{
  "articles": [
    {
      "author": "JAKE OFFENHARTZ, KAREN MATTHEWS and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A gunman killed UnitedHealthcare’s CEO on Wednesday in a “brazen, targeted attack” outside a Manhattan hotel where the health insurer was holding its investor conference, police said, setting off a massive search for the fleeing assailant hours before the annual Rockefeller Center Christmas tree lighting nearby.",
      "publishedAt": "2024-12-04T14:26:27Z",
      "title": "Police hunt for UnitedHealthcare CEO's masked killer after 'brazen, targeted' attack on NYC street",
      "url": "https://apnews.com/daa1e8c8c05606197a5bd2e0242f1683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1df71c98c4ae9a5e7becb8ac9b3de/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s president replaced his defense minister Thursday as opposition parties moved to impeach both men over the stunning yet short-lived imposition of martial law that brought armed troops into Seoul streets.",
      "publishedAt": "2024-12-05T01:50:27Z",
      "title": "Yoon replaces the defense minister as South Korea's parliament nears a vote on their impeachments",
      "url": "https://apnews.com/8e1ffc82990d6bdce8d80dffc3815f62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8273102dc33a4dfeaefde05250989000/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike on a tent camp housing displaced people in southern Gaza killed at least 21 people and wounded 28 on Wednesday, said the director of Nasser Hospital, Atif al-Hout, in the nearby city of Khan Younis.",
      "publishedAt": "2024-12-04T09:26:43Z",
      "title": "Middle East latest: An Israeli strike on a Gaza tent camp kills at least 21 people",
      "url": "https://apnews.com/1369e179a32e5272ac99f6818f69cb8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/556609cff825444c8ab16ea06441e2d7/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Amnesty International accused Israel of committing genocide in the Gaza Strip during its war with Hamas, saying it has sought to deliberately destroy Palestinians by mounting deadly attacks, demolishing vital infrastructure and preventing the delivery of food, medicine and other aid.",
      "publishedAt": "2024-12-05T00:03:00Z",
      "title": "Amnesty International says genocide is occurring in Gaza, an accusation Israel rejects",
      "url": "https://apnews.com/19aa8fb76f7271942e73d5d7a42434e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de870ad706c74328affe3c508684bf41/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "NEW YORK (AP) — Bitcoin has topped the $100,000 mark as a massive rally in the world's most popular cryptocurrency sparked by the election of Donald Trump rolls on. The milestone comes just hours after the President-elect signaled a lighter regulatory approach to the crypto industry when he said he intends to nominate cryptocurrency advocate Paul Atkins to be the next chair the Securities and Exchange Commission.",
      "publishedAt": "2024-12-05T03:16:17Z",
      "title": "Bitcoin tops $100,000 as big rally sparked by Trump election win rolls on",
      "url": "https://apnews.com/c45a747d9c32591bc4e5dcd6e5cc0c22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b819030e84c4b3894fef09e0d174f94/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Hearing a high-profile culture-war clash, the Supreme Court on Wednesday seemed likely to uphold Tennessee's ban on gender-affirming care for minors.",
      "publishedAt": "2024-12-04T05:03:47Z",
      "title": "Supreme Court seems likely to uphold Tennessee's ban on medical treatments for transgender minors",
      "url": "https://apnews.com/3fd2de125caeac6e323bd81ef7271837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39184c19e820444ba4442abfa1aaa8aa/1920.jpeg"
    },
    {
      "author": "ADRIAN SAINZ, JONATHAN MATTISE and ALANNA DURKIN RICHER",
      "description": "MEMPHIS, Tenn. (AP) — The Memphis Police Department uses excessive force and discriminates against Black people, according to the findings of a U.S. Department of Justice investigation launched after the beating death of Tyre Nichols after a traffic stop in 2023.",
      "publishedAt": "2024-12-04T23:20:07Z",
      "title": "Memphis police use excessive force and discriminate against Black people, Justice Department finds",
      "url": "https://apnews.com/beac021fcf8b5fd255ce79520cec86fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42271c2fe93744a5838318111befb3f2/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT, FARNOUSH AMIRI, ZEKE MILLER and TARA COPP",
      "description": "WASHINGTON (AP) — A defiant Pete Hegseth fought to save his nomination to be Donald Trump's defense secretary Wednesday as the president-elect considered possible replacements in the face of growing questions about the former Fox News host's personal conduct and ability to win Senate confirmation.",
      "publishedAt": "2024-12-04T14:12:16Z",
      "title": "Hegseth fights to save Pentagon nomination as sources say Trump considers DeSantis",
      "url": "https://apnews.com/3cb8c7d7bb555ed075cbbb4e8dad0741",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715ae5f075ea4e878e81f9895a482dbe/1920.jpeg"
    },
    {
      "author": "GENE PUSKAR and MARK SCOLFORO",
      "description": "UNITY TOWNSHIP, Pa. (AP) — The search for a woman who is believed to have fallen into a sinkhole in western Pennsylvania has become a recovery effort after two treacherous days of digging through mud and rock produced no signs of life, authorities said Wednesday.",
      "publishedAt": "2024-12-04T12:05:50Z",
      "title": "Police say searchers don’t expect to find woman in Pennsylvania sinkhole alive",
      "url": "https://apnews.com/46045d7dfdf7dc39a57487d9d56f4031",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2c0c7f0bf6e402ca01307d8283679f0/1920.jpeg"
    },
    {
      "author": null,
      "description": "PALERMO, Calif. (AP) — Two children are in \"extremely critical condition\" after being shot Wednesday at a tiny religious K-8 school in Northern California and the gunman is dead after apparently shooting himself, sheriff’s officials said.",
      "publishedAt": "2024-12-04T22:49:08Z",
      "title": "2 kindergarteners wounded and gunman dead after shooting at California religious school",
      "url": "https://apnews.com/843b6fe4ed0e13b863f696e630dbf0a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e3513fa7a7d43d3a5e6597df9813e4c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}