{
  "articles": [
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and CARA ANNA",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel pounded targets in crowded southern Gaza on Saturday and ordered more neighborhoods designated for attack to evacuate, driving up the death toll as the United States and others urged it to do more to protect civilians a day after a truce collapsed.",
      "publishedAt": "2023-12-02T07:32:44Z",
      "title": "Israeli offensive shifts to crowded southern Gaza, driving up death toll despite evacuation orders",
      "url": "https://apnews.com/f300e8dac70d5309bf5f5a75bace7689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f54a09edefb47e58a811ce253f33fa0/1920.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — When it came to the Middle East, Henry Kissinger wasn't pushing for peace — only for what was possible.By the time Kissinger died Wednesday at 100, the agreements he negotiated as United States secretary of state between Israel, Egypt and Syria stabilized borders for nearly half a century after the 1973 Arab-Israeli war.",
      "publishedAt": "2023-12-02T05:22:02Z",
      "title": "With 'shuttle diplomacy,' step by step, Kissinger chased the possible in the Mideast",
      "url": "https://apnews.com/e0d3d89e796d7a5b2bae230615987c1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c079178fdf49e980fe60131d725976/2942.jpeg"
    },
    {
      "author": "JON GAMBRELL, PETER PRENGAMAN and SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Fifty oil companies representing nearly half of global production have pledged to reach near-zero methane emissions and end routine flaring in their operations by 2030, the president of this year's United Nations climate talks said Saturday, a move that environmental groups called a “smokescreen.\"",
      "publishedAt": "2023-12-02T12:23:38Z",
      "title": "At COP28 meeting, oil companies pledge to combat methane. Environmentalists call it a \"smokescreen\"",
      "url": "https://apnews.com/58c756d843fbc696b28a330295505be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95d96d2a108c4c1f959e41eec72b7af7/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "A mother and her 14-year-old daughter are advocating for better protections for victims after AI-generated nude images of the teen and other female classmates were circulated at a high school in New Jersey.",
      "publishedAt": "2023-12-02T13:04:33Z",
      "title": "Teen girls are being victimized by deepfake nudes. One family is pushing for more protections",
      "url": "https://apnews.com/b6f44be048b31fe0b430aeee1956ad38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/120f1cc7fe7643959dc3a42f68721be6/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and MICHELLE L. PRICE",
      "description": "NEWTON, Iowa (AP) — Ron DeSantis completed his campaign promise to visit each of Iowa’s 99 counties, crossing a symbolic but also tactical threshold by telling his audience in a central Iowa town “this should show you that I consider myself a servant, not a ruler.”",
      "publishedAt": "2023-12-02T05:35:18Z",
      "title": "DeSantis hits Iowa campaign milestone but is still far behind Trump, who again mocked his campaign",
      "url": "https://apnews.com/16489ac59dd5e725bafb8096ea152175",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73762cd735554bd2a8b1100aff8390ba/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — One fall day in 2010, retired Supreme Court Justice Sandra Day O’Connor slipped into the courtroom where she worked for nearly 25 years to take in an “amazing” sight.",
      "publishedAt": "2023-12-02T05:16:07Z",
      "title": "Justice Sandra Day O'Connor paved a path for women on the Supreme Court. Four are serving today",
      "url": "https://apnews.com/fdda04cb0d18c0fd2086a062494f5f24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a981dfd8146a4887a9d8b2fd02e05da5/1992.jpeg"
    },
    {
      "author": "ELAINE GANLEY",
      "description": "PARIS (AP) — French police arrested a man who targeted passersby in Paris on Saturday night, killing a German tourist with a knife and injuring two others, France's interior minister said.Police subdued the man, a 25-year-old French citizen who had spent four years in prison for planning a violent offense.",
      "publishedAt": "2023-12-02T22:53:22Z",
      "title": "Police in Paris have arrested a man who targeted passersby, killing 1 and injuring 2, official says",
      "url": "https://apnews.com/1fa2a0122afa982c6795eb8f641142ad",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — A Los Angeles man already in custody in connection with another shooting investigation has been identified as the suspect in three recent killings of homeless men, police said Saturday.",
      "publishedAt": "2023-12-02T23:12:11Z",
      "title": "Authorities identify suspect in killing of 3 homeless men in Los Angeles",
      "url": "https://apnews.com/9821289ef5cc2529ef7218af67959bc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c58daf92e38748719f348d1861422f87/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "CHICAGO (AP) — Muslim community leaders from several swing states pledged to withdraw support for U.S. President Joe Biden on Saturday at a conference in suburban Detroit, citing his refusal to call for a ceasefire in Gaza.",
      "publishedAt": "2023-12-02T19:46:41Z",
      "title": "Group of swing state Muslims vows to ditch Biden in 2024 over his war stance",
      "url": "https://apnews.com/fb3b93f465ed6fd34a901c269a084a90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a399c9d3d7f44cc81878da34643ddbf/1704.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian security forces raided gay clubs and bars across Moscow Friday night, less than 48 hours after the country’s top court banned what it called the “global LGBTQ+ movement” as an extremist organization.",
      "publishedAt": "2023-12-02T09:21:39Z",
      "title": "Police raid Moscow gay bars after a Supreme Court ruling labeled LGBTQ+ movement 'extremist'",
      "url": "https://apnews.com/33e1b9a0110bf22dc2ebc7c42efe6335",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a064bdd574074d86bc7d3ad831646837/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}