{
  "articles": [
    {
      "author": "JULIA FRANKEL and NASSER KARIMI",
      "description": "JERUSALEM (AP) — British Foreign Secretary David Cameron said Wednesday that Israel “is making a decision to act” in response to Iran's missile and drone attack over the weekend, while Iran warned that even the “tiniest” invasion of its territory would bring a “massive and harsh” response.",
      "publishedAt": "2024-04-17T09:36:42Z",
      "title": "British envoy says Israel is 'making a decision to act' as Iran vows to respond to any incursion",
      "url": "https://apnews.com/32b1875bcf167b17ed28172f7146eaf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6355dceb57e4b29b6fc232f80a68390/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations appealed for $2.8 billion on Tuesday to provide desperately needed aid to 3 million Palestinians, stressing that tackling looming famine in war-torn Gaza requires not only food but sanitation, water and health facilities.",
      "publishedAt": "2024-04-17T04:03:55Z",
      "title": "UN appeals for $2.8 billion to help 3 million Palestinians in desperate need of food and other aid",
      "url": "https://apnews.com/7765cef456f284f1fc4901155e1fd5f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9298251d03f74681ae1b21b8d61b0c62/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Defiant and determined, House Speaker Mike Johnson pushed back Tuesday against mounting Republican anger over his proposed U.S. aid package for Ukraine, Israel and other allies, and rejected a call to step aside or risk a vote to oust him from office.",
      "publishedAt": "2024-04-16T16:04:50Z",
      "title": "Facing a Republican revolt, House Speaker Johnson's plan for US aid to Ukraine, allies uncertain",
      "url": "https://apnews.com/3f6f6af81c860eb8ce4104e61728a0fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c255392ab30646ba8eb4fc557cee38b3/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The first seven jurors for Donald Trump's hush money trial were seated Tuesday after lawyers grilled the jury pool about their social media posts, political views and personal lives to decide who can sit in fair judgment of the former president.",
      "publishedAt": "2024-04-16T04:06:06Z",
      "title": "First 7 jurors are chosen for Trump's hush money criminal trial, with 11 more still needed",
      "url": "https://apnews.com/dd1a8dcc063b7ad0fbe14af6e8724c2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f95d5ed37f449039009e4baefb23755/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Three Russian missiles slammed into a downtown area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-floor apartment building and killing at least 13 people, authorities said.",
      "publishedAt": "2024-04-17T08:14:42Z",
      "title": "Russian missiles slam into a Ukraine city and kill 13 people as the war approaches a critical stage",
      "url": "https://apnews.com/2eaf2f93ad447bce3ea2d8f9631c554b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30e218dc02b148a9a4f498f546166f96/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Democrats could end the impeachment trial of Homeland Security Secretary Alejandro Mayorkas on Wednesday before arguments even begin.",
      "publishedAt": "2024-04-17T04:15:19Z",
      "title": "Senate will convene the Mayorkas impeachment trial as Democrats plot a quick dismissal",
      "url": "https://apnews.com/29aa775c0e866f4160f320583f261a72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90e5f2a17f8446298981e9877a0b240e/1920.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "Asian Americans, Native Hawaiians and Pacific Islanders in the United States are more likely than the overall adult population to believe in human-caused climate change, according to a new poll.",
      "publishedAt": "2024-04-17T04:03:14Z",
      "title": "Asian Americans and Pacific Islanders in US more likely to believe in climate change: AP-NORC poll",
      "url": "https://apnews.com/226f4001c8fafc1e0ebff2fdd15e4d2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3758398139e4622a1976b4dacd83307/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — The desert nation of the United Arab Emirates attempted to dry out Wednesday from the heaviest rain ever recorded there after a deluge flooded out Dubai International Airport, disrupting flights through the world's busiest airfield for international travel.",
      "publishedAt": "2024-04-17T07:33:17Z",
      "title": "A storm dumps record rain across the desert nation of UAE and floods Dubai's airport",
      "url": "https://apnews.com/3e838dbc169e52dcd6d11b64f79bdcb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1491857241ee461ea1fb2804b55d2679/1920.jpeg"
    },
    {
      "author": null,
      "description": "TALLAHASSEE, Fla. (AP) — Former U.S. Sen. and two-term Florida Gov. Bob Graham, who gained national prominence as chairman of the Senate Intelligence Committee in the aftermath of the 2001 terrorist attacks and as an early critic of the Iraq war, has died.",
      "publishedAt": "2024-04-17T02:18:14Z",
      "title": "Bob Graham, ex-US senator and Florida governor, dies at 87",
      "url": "https://apnews.com/80c4f1609e314eff981fcfae7d0b32ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cc061fda35942e682b72729f3aa5365/2000.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "SACRAMENTO, Calif. (AP) — The chants of “Light the Beam!” started midway through the fourth quarter as the Sacramento Kings kept piling on the Golden State Warriors.A year after having their season ended by their neighbors, the Kings dealt the Warriors a bit of payback in emphatic fashion with a victory that might have signaled the end of a dynasty.",
      "publishedAt": "2024-04-17T04:40:35Z",
      "title": "The Kings eliminate the Warriors from play-in tournament with 118-94 win",
      "url": "https://apnews.com/4c54c06e93b3b6245c7536acec5660da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ed19e0ac6704f80a19a3f2dbf9973bf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}