{
  "articles": [
    {
      "author": null,
      "description": "BLOOMINGTON, Minn. (AP) — NFL owners unanimously approve $6.05 billion sale of Washington Commanders from Dan Snyder to group led by Josh Harris.",
      "publishedAt": "2023-07-20T20:55:27Z",
      "title": "NFL owners unanimously approve $6.05 billion sale of Washington Commanders from Dan Snyder to group led by Josh Harris.",
      "url": "https://apnews.com/dabd73a5df4d35edd15fe66e552c4773",
      "urlToImage": ""
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russia pounded Ukraine’s southern cities with drones and missiles for a third consecutive night Thursday, keeping Odesa in the Kremlin's crosshairs after a bitter dispute over the end of a wartime deal that allowed Ukraine to send grain through the key Black Sea port.",
      "publishedAt": "2023-07-20T06:49:14Z",
      "title": "Russia bombards Odesa and other southern Ukraine port cities for third night since end of grain deal",
      "url": "https://apnews.com/f99fcec6cca6509853934321792abd1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4098c4011be4998b2c3597f1c9327b2/1920.jpeg"
    },
    {
      "author": "ALI JABAR, ABBY SEWELL and DAVID KEYTON",
      "description": "BAGHDAD (AP) — Protesters angered by an Iraqi man in Sweden who threatened to burn a copy of the Quran stormed the Swedish Embassy in Baghdad early Thursday, overrunning the diplomatic compound and starting a fire.",
      "publishedAt": "2023-07-20T00:50:10Z",
      "title": "Protesters storm Swedish Embassy in Baghdad after man threatens to burn Quran in Stockholm",
      "url": "https://apnews.com/35c40d1cbfa5db845d5c042d86f4b6cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/471c7b42ae6643fbad326551701426f0/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and ALI SWENSON",
      "description": "WASHINGTON (AP) — Robert F. Kennedy Jr. worked to defend himself Thursday against accusations that he traffics in racist and hateful online conspiracy theories, testifying at a House hearing on government censorship despite requests from outside groups to disinvite the Democratic presidential candidate after his recent antisemitic remarks.",
      "publishedAt": "2023-07-20T04:07:56Z",
      "title": "RFK Jr. denies making antisemitic comments as congressional Republicans give him a platform",
      "url": "https://apnews.com/e261116c27a38f8c7329b5c5990dc8e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aafe18b2353c465a9f3667d42ed2c384/3000.jpeg"
    },
    {
      "author": "MARY KATHERINE WILDEMAN",
      "description": "As the planet warms, mosquitoes are slowly migrating upward. The temperature range where malaria-carrying mosquitoes thrive is rising in elevation. Researchers have found evidence of the phenomenon from the tropical highlands of South America to the mountainous, populous regions of eastern Africa.",
      "publishedAt": "2023-07-20T15:40:49Z",
      "title": "As temperatures rise, mosquitoes are also on the move. Scientists worry that could mean more malaria",
      "url": "https://apnews.com/48166329d2eeb9037b49b381a1bbe598",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa2f977187314859b43889341e9328d0/1600.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Supreme Court would have to abide by stronger ethics standards under legislation approved on Thursday by the Senate Judiciary Committee, a response to recent revelations about donor-funded trips by justices.",
      "publishedAt": "2023-07-20T04:04:40Z",
      "title": "Senate committee approves a bill to impose stronger ethics standards on Supreme Court justices",
      "url": "https://apnews.com/3e34958536ce4fa464b6ff8cc1d71260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44b53d1acf1346edad7fcb9f8565144b/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A home that Las Vegas police raided this week in connection with the 1996 drive-by shooting of Tupac Shakur is tied to a man long known to investigators, whose nephew had emerged as a suspect shortly after the rapper's killing.",
      "publishedAt": "2023-07-20T15:14:30Z",
      "title": "Las Vegas police took laptops, documents from home searched in Tupac Shakur's 1996 killing",
      "url": "https://apnews.com/9ab932a3f88017df3ec8cf711fd6ce4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/499a96f2bddd487090b146b3c8a318cb/1486.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY",
      "description": "Temperatures have peaked at or above 110 degrees Fahrenheit (43.3 degrees Celsius) the entire month of July in Phoenix. Air conditioning, which made modern Phoenix even possible, is a lifeline. When a cloudless sky combines with outdoor temperatures over 100 F, your house turns into an “air fryer” or “broiler,” as the roof absorbs powerful heat and radiates it downward, said Jonathan Bean, co-director of the Institute for Energy Solutions at the University of Arizona.",
      "publishedAt": "2023-07-20T16:17:13Z",
      "title": "Homes become 'air fryers' in Phoenix heat, people sacrifice on AC for fear of cost",
      "url": "https://apnews.com/63f35e2a87fc92ebbf4ccb139ddd6496",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67543ae9632c43c1a9fcc35df6d5b32d/3000.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "The fallout from a Pfizer factory being damaged by a tornado could put even more pressure on already-strained drug supplies at U.S. hospitals, experts say. Wednesday's tornado touched down near Rocky Mount, North Carolina, and ripped up the roof of a Pfizer factory that makes nearly 25% of Pfizer's sterile injectable medicines used in U.S.",
      "publishedAt": "2023-07-20T16:41:12Z",
      "title": "Tornado damage to Pfizer plant will probably create long-term shortages of some drugs hospitals need",
      "url": "https://apnews.com/3ce4b4ee0be984f751e0173091a3cdd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f916f17997644441a1c9c5414e84eef6/3000.jpeg"
    },
    {
      "author": "DAVE CAMPBELL and STEPHEN WHYNO",
      "description": "BLOOMINGTON, Minn. (AP) — NFL owners unanimously approved the sale of the Washington Commanders on Thursday from Dan Snyder to a group led by Josh Harris and including Magic Johnson for a record $6.05 billion.",
      "publishedAt": "2023-07-20T21:04:03Z",
      "title": "NFL owners unanimously approve the $6.05B sale of the Commanders from Snyder to Harris group",
      "url": "https://apnews.com/91ab4a15a82255c71f5bcb79865bfe75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2daa736204e54fc08d71ed4a2e060846/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}