{
  "articles": [
    {
      "author": "MELANIE LIDMAN, AAMER MADHANI, and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Iran launched at least 180 missiles into Israel on Tuesday, the latest in a series of rapidly escalating attacks between Israel and Iran and its Arab allies that threatens to push the Middle East closer to a regionwide war.",
      "publishedAt": "2024-10-01T09:41:48Z",
      "title": "Iran fires at least 180 missiles into Israel as regionwide conflict grows",
      "url": "https://apnews.com/eb175dff6e46906caea8b9e43dfbd3da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1d641b75cbc467e901df6f89ef69240/1920.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "YATTA, West Bank (AP) — At dawn in mid-May, Sayyed Ayyed and dozens of other unemployed Palestinian men gathered at the foot of the towering wall of concrete and barbed wire dividing the occupied West Bank from Israel.",
      "publishedAt": "2024-10-02T04:04:21Z",
      "title": "Palestinians in West Bank risk crossing Israel's separation barrier to flee failing economy",
      "url": "https://apnews.com/2971f01fd6fd878399911cef00bfa087",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb530b9f3fb54a0695578282c08c07f8/3000.jpeg"
    },
    {
      "author": "AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — After a year of war between Israel and Hamas, U.S. public opinion on the conflict remains polarized, a new survey by the Pearson Institute and The Associated Press-NORC Center for Public Affairs Research finds, with Democrats more likely to be critical of Israel, while Republicans remain more supportive.",
      "publishedAt": "2024-10-02T04:05:17Z",
      "title": "Republicans are more likely than Democrats to see Israel as a US ally: AP-NORC poll",
      "url": "https://apnews.com/20b070612a8a76ee1d4d6c47864a2355",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be71bebcd5df4d58afd3e5a5640f74fc/3000.jpeg"
    },
    {
      "author": "ERIK VERDUZCO, JEFF AMY and KIMBERLEE KRUESI",
      "description": "SWANNANOA, N.C. (AP) — President Joe Biden will survey the devastation in North and South Carolina on Wednesday as rescuers continue their search for anyone still unaccounted for after Hurricane Helene’s deadly remnants caused catastrophic damage across the Southeast.",
      "publishedAt": "2024-10-02T04:23:32Z",
      "title": "Biden estimates recovery could cost billions ahead of visit to Helene-raved Carolinas",
      "url": "https://apnews.com/3f812f70c4d2649e2198362e9ae42b06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/954d685df6b142b7afe44cc43a45afd6/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, CHRIS MEGERIAN, WILL WEISSSERT and JILL COLVIN",
      "description": "NEW YORK (AP) — In a debate that evoked a calmer era in American politics, Tim Walz and JD Vance on Tuesday went after each other's running mates and sought to shore up their campaigns' vulnerabilities at a time of renewed fears of a regional war in the Middle East and sadness over devastation from Hurricane Helene.",
      "publishedAt": "2024-10-01T04:01:50Z",
      "title": "Walz and Vance go in depth on policy while attacking each other’s running mates in VP debate",
      "url": "https://apnews.com/66ff2e5e45a8dda55b0a2242fc238fdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8acc4540e6a34747811fff1e7adde7c8/3000.jpeg"
    },
    {
      "author": "BILL BARROW, ZEKE MILLER and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Vice presidential hopefuls Tim Walz and JD Vance focused their criticism on the top of the ticket on Tuesday as they engaged in a policy-heavy discussion that may be the last debate of the 2024 presidential campaign.",
      "publishedAt": "2024-10-02T02:20:09Z",
      "title": "Vance and Walz keep it civil in a policy-heavy discussion: VP debate takeaways",
      "url": "https://apnews.com/5b6f219b555416ff579764048ac238a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f184443da1774d82ad26e7f5d9830dc9/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, WYATTE GRANTHAM-PHILIPS and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — The 45,000 dockworkers who went on strike Tuesday for the first time in decades at 36 U.S.",
      "publishedAt": "2024-10-01T10:43:00Z",
      "title": "Dockworkers may have the negotiating advantage in their strike against US ports",
      "url": "https://apnews.com/91703e4798dbc9ee82185e983f31a3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5432e0816734cf7a8711ab86c1495fb/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY and TERRY CHEA",
      "description": "SAN FRANCISCO (AP) — Cabrel Ngounou's life in Cameroon quickly unraveled after neighbors caught the teenager with his boyfriend.",
      "publishedAt": "2024-10-02T04:05:27Z",
      "title": "US 'Welcome Corps' helps resettle LGBTQ+ refugees fleeing crackdowns against gay people",
      "url": "https://apnews.com/1c4a419125f50aa769c8416cd47312e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/042f55dd41d14c5f93df4c785d414374/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ and MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Claudia Sheinbaum was sworn in Tuesday as Mexico’s first female president, riding the enthusiasm over her predecessor’s social programs but also facing challenges that include stubbornly high levels of violence.",
      "publishedAt": "2024-10-01T04:13:54Z",
      "title": "Claudia Sheinbaum sworn in as 1st female president of Mexico",
      "url": "https://apnews.com/7d3599b39a7298df46e7eda34d80afee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75dd09b9d06f4d52b3aed602d1166acd/1920.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — John Amos, who starred as the family patriarch on the hit 1970s sitcom “Good Times\" and earned an Emmy nomination for his role in the seminal 1977 miniseries “Roots,” has died.",
      "publishedAt": "2024-10-01T18:15:05Z",
      "title": "John Amos, patriarch on 'Good Times' and an Emmy nominee for the blockbuster 'Roots,' dies at 84",
      "url": "https://apnews.com/65a1d2dc84175bb5d4c579901af7164f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a189ce14c5dc43b7a1268535eb6a52c5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}