{
  "articles": [
    {
      "author": "RAF CASERT, SYLVIE CORBET",
      "description": "French President Emmanuel Macron has called leaders from key European Union nations and the United Kingdom to his ornate Elysee Palace for an emergency meeting Monday. He wants to discuss how to deal with the Trump administration and step up plans to increase defense spending. The European leaders have been stunned by a weeklong diplomatic blitz on Ukraine from the Trump administration that seemed to embrace the Kremlin while it cold-shouldered many of its age-old European allies. There were belligerent warnings ahead of Donald Trump’s reelection as U.S. president. But EU leaders publicly ignored the ominous forebodings and somehow hoped Trump would stand side by side with Europe.",
      "publishedAt": "2025-02-17T05:08:58Z",
      "title": "European leaders regroup in Paris for strategy huddle after Trump diplomatic blitz on Ukraine",
      "url": "https://apnews.com/article/eu-europe-ukraine-nato-security-summit-trump-060c8661c59f8f75b96711d3889ce559",
      "urlToImage": "https://dims.apnews.com/dims4/default/0326f74/2147483647/strip/true/crop/2998x1686+0+109/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F89%2F01bca9984397477a3b194409ba48%2F1d86402c1c3b4832bd453699e7e38230"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The Kremlin says top Russian officials will hold talks with U.S. counterparts on restoring ties, ending the war in Ukraine and preparing a meeting between Russian President Vladimir Putin and U.S. President Donald Trump. Kremlin spokesman Dmitry Peskov says Russian Foreign Minister Sergey Lavrov and Putin’s foreign affairs adviser Yuri Ushakov will fly to the Saudi capital on Monday to take part in the talks set for Tuesday. He said the talks will be primarily focused on “restoring the entire complex of U.S.-Russian relations” as well as organizing possible talks on the Ukrainian settlement and the meeting of the two presidents.",
      "publishedAt": "2025-02-17T10:00:40Z",
      "title": "Top Russian officials will hold talks with US in Saudi Arabia on Tuesday",
      "url": "https://apnews.com/article/russia-ukraine-war-us-saudi-talks-0c7f21c2125c97fd0a1f6459eebeb65b",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe5ce53/2147483647/strip/true/crop/8083x4547+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F3c%2F52734a0c648ad5e8fa772ec9bc1d%2F43f837ab393e4666be58044671b139a9"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Ukrainian President Volodymyr Zelenskyy traveled to the United Arab Emirates late Sunday as momentum grows for potential peace talks ending Moscow’s war on the country. U.S. President Donald Trump last week suggested he would be meeting Russian President Vladimir Putin in Saudi Arabia. The UAE, home to Abu Dhabi and Dubai, long has been floated as a possible site for peace talks as well given the large population of Russian and Ukrainian expatriates who have flooded the country since the war began, and due to the Emirates’ work on prisoner exchanges in the past.",
      "publishedAt": "2025-02-17T02:16:25Z",
      "title": "Russia-Ukraine war: Zelenskyy in UAE as momentum grows for peace talks",
      "url": "https://apnews.com/article/uae-russia-ukraine-war-a09b2fc2d81276551f40d89383a348c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6dee21/2147483647/strip/true/crop/5400x3038+0+446/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F8e%2Fe90a655c67746f1bd6b1081141b0%2F8afbf2688afe42c78a1c89976bf43583"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "One of Ukraine’s largest steel plants lies in the country’s industrial east, where Russia’s 3-year invasion of its neighbor threatens to throttle production at any moment. Daily battles unfold along a front line 40 kilometers away as the Zaporizhstal Iron and Steelworks churns out materials for military equipment and for foreign manufacturers to use in cars, appliances, and construction. Last week, a second war came to the doorstep of the hulking factory: the possible trade war that U.S. President Donald Trump has provoked since returning to office. Trump's decision to impose tariffs of at least 25% on all imported steel and aluminum could hurt an essential sector of Ukraine’s battered economy.",
      "publishedAt": "2025-02-17T13:32:44Z",
      "title": "Trump's tariffs expose Ukraine's steel industry to another war",
      "url": "https://apnews.com/article/russia-ukraine-trump-steel-tariffs-b86da134bc9b3fac8a3b24eb6ecc16c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/26637d3/2147483647/strip/true/crop/4169x2345+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F62%2F8a3dce14be61cfed4e7b1b4a2bb5%2F956a17a59cc54b05a7fcc779e5d7c182"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Russia has freed a U.S. citizen arrested this month on drug smuggling charges, according to Russian media reports and a U.S. official. The move comes ahead of Russia-U.S. talks in Saudi Arabia. Kalob Byers, 28, was detained on Feb. 7 at Moscow’s Vnukovo airport after customs officials allegedly found cannabis-laced marmalade in his baggage. Russian independent news outlet Meduza reported Monday, citing a Facebook post by Byers’ parents, that he has been released and was awaiting a flight home in the U.S. embassy in Moscow. A U.S. official confirmed to The Associated Press that Byers was released late on Sunday evening. The official spoke on condition of anonymity because they were not authorized to discuss sensitive matters.",
      "publishedAt": "2025-02-17T12:17:45Z",
      "title": "American arrested in Moscow on drug smuggling charges is freed ahead of Russia-US talks",
      "url": "https://apnews.com/article/russia-american-arrested-drug-smuggling-released-7a6fa0b4e307f46ee1b8ab7c0817e7fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Monday is the 500th day of the war triggered by Hamas’ Oct. 7, 2023, attack into southern Israel. A tenuous ceasefire in the Gaza Strip has held for nearly a month. But the current phase of the truce is set to expire in early March and it is unclear if the sides will extend it, begin negotiations for a more lasting ceasefire or resume fighting. The scale of death and devastation is seen in the numbers. Around 1,200 people were killed in Israel on that date and 251 hostages were taken. Around half of the 73 still captive there are believed to be dead. Over 48,200 Palestinians have been killed in Gaza.",
      "publishedAt": "2025-02-17T07:35:06Z",
      "title": "500 days of the Israel-Hamas war, by the numbers",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-500-days-numbers-c244fe24769dbfabcbcdfb10487ce106",
      "urlToImage": "https://dims.apnews.com/dims4/default/85728a7/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Ffa%2F33ddc4443110ee926e93bec5929e%2F63bf5de6b4e9420da54cf1e2fdd431de"
    },
    {
      "author": "DAVID MCHUGH",
      "description": "Germany hasn’t seen significant economic growth in five years. It’s a stunning turnaround for Europe’s biggest economy. The country had expanded exports and dominated world trade in engineered products like industrial machinery and luxury cars for most of this century. So what happened? A combination of domestic and geopolitical factors. German businesses complain about lagging public investments, too much red tape and a lack of skilled workers at home. New manufacturing competition from China and Russia's decision to stop supplying Germany with natural gas due to opposing views of the war in Ukraine compounded the situation.",
      "publishedAt": "2025-02-17T06:23:01Z",
      "title": "5 reasons Germany's economy is in the dumps",
      "url": "https://apnews.com/article/germany-election-economy-china-russia-cbc88159e3ccb706c8ca268375931fda",
      "urlToImage": "https://dims.apnews.com/dims4/default/926681a/2147483647/strip/true/crop/6591x3707+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F17%2Fe72ed73339fa31edc88271a7d1d2%2F8b48118c192b4b0aa0fc1a5ace9cd2a4"
    },
    {
      "author": "JOHN HANNA",
      "description": "U.S. states seem to mark Presidents Day with as many different names and honors as there have been presidents. The federal holiday is officially Washington’s Birthday to honor George, the first president, and 34 states use his name in some way. But 19 use some form of Presidents Day. That name took hold after the holiday became fixed in 1971 on the third Monday in February. The result is a jumble of names, dates and ideas about how to celebrate. Most states are honoring Washington and other figures Monday, but some don't stop with that. Civil War President Abraham Lincoln has his own holidays, and other presidents have days, too.",
      "publishedAt": "2025-02-16T05:07:36Z",
      "title": "Who's being honored on Presidents Day depends on where you live",
      "url": "https://apnews.com/article/presidents-day-holidays-states-washington-lincoln-bb1c5882f43113e297192d69e449de24",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a0d239/2147483647/strip/true/crop/4864x2736+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F86%2Fd8d4d54d38915826c07798e03af2%2F2cf041e9c60545638354869df301b4bd"
    },
    {
      "author": null,
      "description": "An anti-settlement watchdog says Israel has issued tenders for the construction of nearly 1,000 additional settler homes in the occupied West Bank. Peace Now said Monday the development would allow the population of the Efrat settlement to expand by 40% and further block the development of the nearby Palestinian city of Bethlehem. Construction could begin as soon as next year. Israel captured the West Bank, along with the Gaza Strip and east Jerusalem, in the 1967 Mideast war. The Palestinians want all three territories for their future state and view the settlements as a major obstacle to peace, a position with wide international support.",
      "publishedAt": "2025-02-17T07:21:29Z",
      "title": "Watchdog says Israel is advancing plans for nearly 1,000 more settler homes in West Bank",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-17-2025-c20c9664938b267354c9ac4812621a1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9f2a88/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F89%2F3ee52a3c87ec8c206aac47d7c039%2F8ca264427bc64204ba731da970e563a6"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "U.S. President Donald Trump has quickly plunged into Mideast diplomacy since returning to office last month. Trump’s boldest and most controversial plan so far has been his call for all of Gaza’s 2 million people to be removed from the territory, for the U.S. to take “ownership” and then to oversee a yearslong reconstruction process. It's not clear how this plan would work. But it has sent shockwaves across the region — with Israel embracing it and the Arab world opposing it. Here are some takeaways from Trump's first month in office.",
      "publishedAt": "2025-02-17T11:22:05Z",
      "title": "Here are some takeaways from the first month of Trump's Mideast diplomacy",
      "url": "https://apnews.com/article/israel-gaza-trump-netanyahu-mideast-saudi-egypt-arabs-610017e138284454a975885fa158520d",
      "urlToImage": "https://dims.apnews.com/dims4/default/49e9aa7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F12%2Fd163db6ac3aa0eff79d4af592086%2Fb179adb9daee4e84be894586b3f34fc1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}