{
  "articles": [
    {
      "author": "Colleen Barry, Nicole Winfield",
      "description": "Pope Francis’ body will be moved to St. Peter’s Basilica to lie in state allowing the Catholic faithful to pay their respects to the Argentine pope. Francis is being remembered for his humble style, concern for the poor and insistent prayers for peace. Heads of state are expected for the funeral Saturday in St. Peter’s Square. But the three days of public viewing are largely for ordinary Catholics to mourn the 88-year-old pope. Francis died Monday after suffering a stroke. His body will be transferred Wednesday morning to St. Peter’s Basilica. The public mourning period will end on Friday night.",
      "publishedAt": "2025-04-23T04:45:44Z",
      "title": "Pope Francis' body to lie in state in St. Peter's Basilica as the faithful mourn",
      "url": "https://apnews.com/article/vatican-pope-francis-public-viewing-st-peters-732d413b0eba7695d8a931af393097f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b6aae6/2147483647/strip/true/crop/7087x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F12%2F2686b99b7e28dc4c12742744dd78%2F1b27f627a766436ca580eeee7ef6fe2c"
    },
    {
      "author": null,
      "description": "Diplomats and defense chiefs from Britain, the U.S., European nations and Ukraine are due to meet in London to push for a peace deal between Moscow and Kyiv. British Defense Secretary John Healey said Wednesday's meeting of foreign ministers and national security adviserswill include “what a ceasefire might look like and how to secure peace in the long term.” It follows talks last week in Paris. Those attending include retired Lt. Gen. Keith Kellogg, President Donald Trump’s envoy for Ukraine and Russia. The U.S. State Department said Secretary of State Marco Rubio, who attended the Paris talks, was unable to come because of a scheduling issue.",
      "publishedAt": "2025-04-23T04:47:36Z",
      "title": "Officials from Ukraine, US and UK meet in London in latest push to stop the war",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-london-4f35dc70f521e2363218f4c40748caba",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d59037/2147483647/strip/true/crop/8122x4569+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F4c%2F9b0b4b184c99bd5386eb05e6c66f%2F79281dd1c0ce43ea94daa06bba49b831"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Officials say Arab mediators are working on a proposal to end the Israel-Hamas war that would include a five to seven year truce and the release of all remaining hostages. An Israeli strike on the Gaza Strip overnight into Wednesday killed 23 people, according to local health authorities. Egypt and Qatar are still developing the proposal, which would include the gradual withdrawal of Israeli forces from the entire strip and the release of Palestinian prisoners. Hamas would also hand over power to a committee of independent technocrats. Israel and the United States have ruled out any proposal that would allow Hamas to retain influence in Gaza and rearm.",
      "publishedAt": "2025-04-23T08:56:35Z",
      "title": "Mediators work on proposal for long-term truce as Israeli strike on Gaza kills 23",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-23-2025-c02528565c529a717967297d0f76d3aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ccc149/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F80%2Fae0b10e2a908b0530f3c3bd2d9e1%2Fb6fe0be500724a4da11c33c5fc8e6eef"
    },
    {
      "author": "Ellen Knickmeyer",
      "description": "Secretary of State Marco Rubio says Iran must give up all nuclear enrichment if it wants to make a deal during talks with the Trump administration and head off the threat of armed conflict. Iran insists its nuclear program is for civilian energy use and says it does not seek to make weapons-grade uranium to build atomic bombs. Rubio said in a podcast interview released Wednesday that Iran could import enriched material for a peaceful program. Iran has long refused to give up its ability to enrich uranium. Rubio says the U.S. is \"a long ways from any sort of agreement with Iran” but is aiming for a peaceful resolution.",
      "publishedAt": "2025-04-23T17:47:06Z",
      "title": "Rubio says Iran must give up nuclear enrichment",
      "url": "https://apnews.com/article/iran-trump-nuclear-iaea-weapons-0824ff553b5a2adf913997b13cc61e0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/33d918f/2147483647/strip/true/crop/3725x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F39%2Fde4d63efad8009bc388f499219f5%2Faf623754aedf4808935bd7bccf39a243"
    },
    {
      "author": "Collin Binkley, Jocelyn Gecker",
      "description": "President Donald Trump has ordered sharper scrutiny of America’s colleges and the accreditors that oversee them. It's part of his escalating campaign to end what he calls “wokeness” and diversity efforts in education. Trump signed a series of executive actions Wednesday, targeting universities that he views as liberal adversaries to his political agenda. One order called for harder enforcement of a federal law requiring colleges to disclose their financial ties with foreign sources. Another called for a shakeup of the accrediting bodies that decide whether colleges can accept federal financial aid awarded to students.",
      "publishedAt": "2025-04-23T23:39:45Z",
      "title": "Trump's executive orders target colleges like Harvard, DEI in education",
      "url": "https://apnews.com/article/trump-executive-orders-education-9fb7e1f707f0df93e3b28d4eff984d04",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d6e965/2147483647/strip/true/crop/4833x2719+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F44%2Fd588bf00a3f4fbd94a22d7fc77b1%2Fe3d1f35127914d698220c2681e89c328"
    },
    {
      "author": "Larry Neumeister",
      "description": "A dozen states have sued the Trump administration in the U.S. Court of International Trade to stop its tariff policy, saying it is unlawful and has brought chaos to the American economy. The lawsuit filed Wednesday says the policy put in place by President Donald Trump has left the national trade policy subject to Trump's whims rather than the sound exercise of lawful authority. The lawsuit challenges Trump's claim that he could arbitrarily impose tariffs based on the International Emergency Economic Powers Act. A message sent to the Justice Department for comment was not immediately returned.",
      "publishedAt": "2025-04-23T20:51:31Z",
      "title": "A dozen states sue the Trump administration to stop tariff policy",
      "url": "https://apnews.com/article/tariffs-lawsuit-what-states-sue-0d6531b7f60aaa2f7c6c35e0a944d4a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/415448b/2147483647/strip/true/crop/4359x2452+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fa1%2F8a41b96afcff564abf2c529b14de%2F546e32bda88b4b769a930e977a0aa964"
    },
    {
      "author": "Aijaz Hussain",
      "description": "Security has been beefed up across Indian-controlled Kashmir a day after an attack killed at least 26 people, most of them tourists, as Indian forces launched a manhunt for the perpetrators of one of the deadliest attacks in the restive Himalayan region. As investigators began probing the attack, many shops and businesses in Kashmir closed to protest the killings following a call from the region’s religious and political parties. Tens of thousands of armed police and soldiers fanned out across the region and erected additional checkpoints. Police called it a “terror attack” and blamed militants fighting against Indian rule. There was no immediate claim of responsibility.",
      "publishedAt": "2025-04-23T07:17:03Z",
      "title": "Indian troops beef up security in Kashmir after Pahalgam attack",
      "url": "https://apnews.com/article/kashmir-tourist-attack-india-pakistan-801a1ee244cc88846619370237876c11",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bf75d1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F83%2F6a7d1759b521089b141a39ba1b3f%2F19eb94b4628e43159fda97fb6d3985e4"
    },
    {
      "author": "Wilson Mcmakin, Saleh Mwanamilongo",
      "description": "A joint statement from Congo's government and a coalition of insurgents in the country’s east including the M23 rebels says the two sides have agreed to work toward a truce following peace talks in Qatar. The statement was posted online by spokesman Lawrence Kanyuka of the M23 rebels, and confirmed by government spokesman Patrick Muyaya in comments to local media outlets. The statement said the parties had agreed to “work towards concluding a truce” and that they were reaffirming their commitment to “an immediate end to hostilities.” Previous commitments to a ceasefire have not held.",
      "publishedAt": "2025-04-23T20:51:12Z",
      "title": "Congo's government and rebels say they are working toward a truce in the east",
      "url": "https://apnews.com/article/congo-m23-ceasefire-7b50a019e45e08798c40e8192abbcfda",
      "urlToImage": "https://dims.apnews.com/dims4/default/bfe6ccb/2147483647/strip/true/crop/7243x4074+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fa5%2Fb4aadace702e304d9101ae217980%2F1f229bb345014d63961c6cbcb838644b"
    },
    {
      "author": "Bernard Condon",
      "description": "Elon Musk intends to focus more on his job as Tesla CEO, but it’s unclear if the billionaire will be able to solve a big problem of his own making: damage to its brand. Sales have plunged amid protests over Musk’s embrace of right-wing views and rival electric vehicle makers are pouncing. Investors sent Tesla's stock rising 5% a day after Musk announced he would be scaling back his cost-cutting role in Washington, but he's got his work cut out for him. Tesla's share of the U.S. electric vehicle has plunged and Musk has to deliver on promises of an upgraded Model Y and a fleet of cybercabs.",
      "publishedAt": "2025-04-23T21:56:11Z",
      "title": "Musk damaged Tesla's brand in just a few months. Fixing it will likely take longer",
      "url": "https://apnews.com/article/tesla-trump-musk-evs-doge-cybercab-brand-b9c9151c7852b8f1c10aaacb8fe6c8b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/c95265f/2147483647/strip/true/crop/5786x3255+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F1b%2Fc1b1dcf9fd18d3ccee3a5bc7aa08%2F1cdb76626e354b8c9c2d104fb013447d"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "The world's auto industry is getting a shake-up from Chinese automakers that are quickly expanding across the globe, offering relatively affordable electric vehicles designed to wow car buyers with sleek designs and the latest high-tech interiors. Companies like BYD, Great Wall, Geely and Chery Automobile are reaching outward as they build the scale they need to survive brutal competition in their home market. These are not state-run giants like SAIC, BAIC and Guangzhou Automotive. The founder of Geely started out making refrigerators. BYD first built up its expertise in battery technology, now its biggest advantage as the world's largest-selling EV maker. Some others are technology companies allied with automakers to offer autonomous driving.",
      "publishedAt": "2025-04-24T00:59:56Z",
      "title": "China's fast-growing EV makers pursuing varied routes to global expansion",
      "url": "https://apnews.com/article/china-ev-tariffs-geely-byd-51b3c0040bbe25c9d5636d70a4011e2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/15173ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fdb%2Fd499c18eb9d60a48ef8233bfbb0f%2Fd8e8ec5dbfd54324a90b97ce243bdb18"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}