{
  "articles": [
    {
      "author": "TERRY SPENCER and HAVEN DALEY",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton churned Wednesday toward a potentially catastrophic collision along the west coast of Florida, where some residents insisted they would stay after millions were ordered to evacuate and officials warned that stragglers would face grim odds of surviving.",
      "publishedAt": "2024-10-09T04:10:30Z",
      "title": "Time to evacuate is running out as Hurricane Milton closes in on Florida",
      "url": "https://apnews.com/08bde4b9c29460f471d43c6512821c93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff302b91b5c3443ba0845c249b86f2ce/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hurricane Milton strengthened as it churned through the Gulf of Mexico toward Florida on Wednesday and could wallop one of the state's major population centers with huge storm surges, lashing rain and destructive winds just two weeks after deadly Hurricane Helene swamped the coastline.",
      "publishedAt": "2024-10-07T22:26:06Z",
      "title": "What to know about Hurricane Milton as it churns toward Florida's Gulf Coast",
      "url": "https://apnews.com/d40b1e47fd78844bf1ed528bab5099f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f113305290784d1f8376ff40652cef25/1920.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "Human-caused climate change boosted a devastating Hurricane Helene 's rainfall by about 10% and intensified its winds by about 11%, scientists said in a new flash study released just as a strengthening Hurricane Milton threatens the Florida coast less than two weeks later.",
      "publishedAt": "2024-10-09T04:03:35Z",
      "title": "Climate change boosted Helene's deadly rain and wind and scientists say same is likely for Milton",
      "url": "https://apnews.com/8a0d4f072669fd1d0031a23d7fc4b29c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df58719b845347c1a5687166dc8511fc/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A large-scale Israeli operation in northern Gaza has killed and wounded dozens of people and threatens to shut down three hospitals over a year into the war with Hamas, Palestinian officials and residents said Wednesday.",
      "publishedAt": "2024-10-09T09:11:13Z",
      "title": "Israeli offensive in hard-hit northern Gaza kills dozens and threatens hospitals",
      "url": "https://apnews.com/31a2dff9a2bb49bc3b76f32b1ddee128",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6a149da44ef49e0a57d8487b3d549c9/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "WAUKEGAN, Ill. (AP) — On a table at the office of the Waukegan Township Democrats sits a box of postcards with Wisconsin addresses that were collected during a postcard-writing pizza party to help turn out voters there.",
      "publishedAt": "2024-10-09T04:07:36Z",
      "title": "What presidential campaign? The Electoral College puts most American voters on the sidelines",
      "url": "https://apnews.com/cdb4141205034c830924cb94457b7be1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4a7c065eb44425a83d2994cd4f7b523/1920.jpeg"
    },
    {
      "author": "RICHARD LARDNER and DAKE KANG",
      "description": "WASHINGTON (AP) — Thousands of copies of Donald Trump’s “God Bless the USA” Bible were printed in a country that the former president has repeatedly accused of stealing American jobs and engaging in unfair trade practices — China.",
      "publishedAt": "2024-10-09T04:02:39Z",
      "title": "Trump has long blasted China's trade practices. His 'God Bless the USA' Bibles were printed there",
      "url": "https://apnews.com/32a80611605d4052d8238064bbcace4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c512c23b1e724a2f916b2d15fbbd1445/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and MIKE CORDER",
      "description": "STOCKHOLM (AP) — The Nobel Prize in chemistry was awarded Wednesday to David Baker, Demis Hassabis and John Jumper for their breakthrough work predicting and designing the structure of proteins, the building blocks of life.",
      "publishedAt": "2024-10-09T08:05:54Z",
      "title": "Nobel Prize in chemistry awarded to David Baker, Demis Hassabis and John Jumper for work on proteins",
      "url": "https://apnews.com/56f4d9e90591dfe7d9d840a8c8c9d553",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5228cdefb04b4bc48190267d6affc65d/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The rumors surrounding Hurricane Helene are many. There are false claims that people taking federal relief money could see their land seized.",
      "publishedAt": "2024-10-08T23:18:52Z",
      "title": "As FEMA prepares for Hurricane Milton, it battles rumors surrounding Helene recovery",
      "url": "https://apnews.com/468b036784b1db05937e9a34d0146041",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb952fd3e6994ea4a0c31335ce974205/3000.jpeg"
    },
    {
      "author": "SHAWN CHEN",
      "description": "The U.S. Department of Justice is considering asking a federal judge to force Google to sell parts of its business in order to eliminate its online search monopoly.",
      "publishedAt": "2024-10-09T06:23:21Z",
      "title": "US considers asking court to break up Google as it weighs remedies in the antitrust case",
      "url": "https://apnews.com/59114d8bf1dc4c8453c08acaa4051f14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8022b6f208314fb5b6343c41816a720a/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — In a storyline better befitting a melodrama than a popularity vote, Grazer won her second Fat Bear Contest Tuesday by defeating the male behemoth that killed her cub this summer.",
      "publishedAt": "2024-10-09T01:14:35Z",
      "title": "Grazer beats the behemoth that killed her cub to win Alaska's Fat Bear Contest",
      "url": "https://apnews.com/2887949cd304cca96a3d8acbeb61095e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac7f869367547448754cc7be6045c74/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}