{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis has died. He was history’s first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change. He was 88. The Vatican camerlengo made the announcement Monday. Francis suffered from chronic lung disease and had part of one lung removed as a young man. He was admitted to Gemelli hospital on Feb. 14, 2025, for a respiratory crisis that developed into double pneumonia. He spent 38 days there. From his first greeting as pope of a simple “Good evening” to his embrace of refugees and the downtrodden, Francis signaled a very different tone for the papacy, stressing humility over hubris for a Catholic Church beset by scandal and accusations of indifference.",
      "publishedAt": "2025-04-21T07:57:28Z",
      "title": "Pope Francis, first Latin American pontiff, dies at 88",
      "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": "Vanessa Gera, Nicole Winfield",
      "description": "Pope Francis died on Easter Monday at the age of 88. Francis' death was announced by Cardinal Kevin Farrell. The Irish-born Vatican camerlengo's position will be important in the election of the next pope. Francis made his final public appearance a day earlier on Easter Sunday. Francis’ death now sets off the process of allowing the faithful to pay their final respects. That will be followed by a funeral to be celebrated by the dean of the College of Cardinals and a conclave to elect a new pope.",
      "publishedAt": "2025-04-21T11:05:09Z",
      "title": "What to know about the death of Pope Francis",
      "url": "https://apnews.com/article/pope-francis-what-to-know-7c2aa927cf142926f05654984aaa0d90",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis understood the power of a simple touch. Some of the most iconic moments of his papacy were those when he interacted with the poor, the homeless and those seeking refuge from oppression. Francis died Monday at age 88 following a respiratory illness. History’s first Latin American pope and the first to name himself after St. Francis of Assisi charmed the world with poignant acts of love, humility and informality. That began with his very first words as pontiff, emerging on the loggia of St. Peter’s Basilica and greeting the throngs with the words, “Good evening.” Francis eventually ran into troubles, with conservatives who were increasingly upset with his progressive leanings.",
      "publishedAt": "2025-04-21T16:28:09Z",
      "title": "Pope Francis led the church with humility and simplicity",
      "url": "https://apnews.com/article/pope-francis-remembrance-life-7702c44513ed4c9ba0ac5362d418c3f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/e551567/2147483647/strip/true/crop/3872x2178+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F06%2F297282464973491350d224ca0173%2Fcc93569ccb0b4aca9b4b4a69cc699062"
    },
    {
      "author": "Chris Megerian",
      "description": "One of Pope Francis’ final encounters before his death was with U.S. Vice President JD Vance, who visited the Vatican over the weekend. The meeting took place on Easter Sunday. Francis was sitting in a wheelchair, and his words were inaudible in a video released by the Vatican. The vice president told the pope, “I pray for you every day.\" White House press secretary Karoline Leavitt told reporters that she had spoken to people on Vance’s team on Monday morning and heard “how excited and grateful they were for the opportunity” to meet the pope.",
      "publishedAt": "2025-04-21T14:28:06Z",
      "title": "JD Vance was one of the last leaders to meet with Pope Francis",
      "url": "https://apnews.com/article/jd-vance-pope-francis-vatican-meeting-abf9e1a3fbb597778779dafdc6c491d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/894b4ad/2147483647/strip/true/crop/4322x2431+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2F1b%2F0015f9eabcd6f9897b4772115926%2Fd6215f6d91d04990b5206a22e06eca2b"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are sinking as investors pull away from the United States because of the uncertainty caused by President Donald Trump’s trade war and his criticism of the Federal Reserve. The S&P 500 fell 1.2% Monday and was 15% below its record set two months ago. The Dow Jones Industrial Average dropped 430 points, and the Nasdaq composite sank 1.5%. Big Tech stocks led the way lower ahead of earnings reports coming this week from Tesla and others. Perhaps more worryingly, U.S. Treasury bonds and the value of the U.S. dollar also sank as a retreat continues from U.S. markets.",
      "publishedAt": "2025-04-21T02:56:03Z",
      "title": "US stocks sink with the US dollar's value as investors retreat further from the United States",
      "url": "https://apnews.com/article/stocks-markets-rates-inflation-trump-68a6a7f7765d78d46329abbecfbe0797",
      "urlToImage": "https://dims.apnews.com/dims4/default/758fc38/2147483647/strip/true/crop/5847x3289+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fd3%2F52a51305218185a32f23962452f6%2F6b9137a7f9844248867afa7d22b75b52"
    },
    {
      "author": null,
      "description": "The main Palestinian rescue service in Gaza has condemned Israel’s probe into the killings of 15 medical workers last month, calling it a “fabricated investigation.” The army announced the results of its investigation on Sunday, saying it had found “professional failures” and dismissing a deputy commander in what it described as an accident. A total of 15 people were killed in the March 23 incident — including eight medics with the Palestinian Red Crescent Society, six members of the Hamas government’s Civil Defense unit and a U.N. staffer. The PRCS says the investigation underscores “the occupation’s persistence in shielding the truth from the world.”",
      "publishedAt": "2025-04-21T18:18:38Z",
      "title": "Gaza rescue service dismisses Israeli probe into killing of medics as a 'fabricated investigation'",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-21-2025-17ffc7981c4fe1f87b25b54b3c17bf20",
      "urlToImage": "https://dims.apnews.com/dims4/default/52e644f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F8b%2Fecc4514813633bdb3ca476a471c0%2F56a511f6eca145ed85c2a21ff085a9c1"
    },
    {
      "author": "Tara Copp, Eric Tucker",
      "description": "The White House has expressed support for Defense Secretary Pete Hegseth following media reports that he shared sensitive military details in another Signal messaging chat that included his wife and brother. President Donald Trump on Monday called it “fake news” and pointed to what he called disgruntled workers. The administration's posture is meant to hold the line against Democratic demands for Hegseth’s firing at a time when the Pentagon is engulfed in turmoil, including the departures of several senior aides. The White House has framed the revelation as the outgrowth of a power struggle between Hegseth and the career workforce. But some of the recently departed officials were brought in by Hegseth.",
      "publishedAt": "2025-04-21T15:42:29Z",
      "title": "White House voices support for Hegseth as Signal chat revelation stirs fresh turmoil",
      "url": "https://apnews.com/article/hegseth-signal-chat-pentagon-trump-30dc4c3d0e75a89f3fd883f38b26afff",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff3a706/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F4c%2F1bbc15ff58dff7135160ca9cb956%2Fd1f9a1b15d4140f385f484b9f9f796e4"
    },
    {
      "author": "Larry Neumeister",
      "description": "The wife of former U.S. Sen. Bob Menendez has been convicted of charges that she teamed up with the New Jersey Democrat to accept bribes of cash, gold bars and a luxury car. A New York jury returned its verdict Monday in the trial of Nadine Menendez. Prosecutors say she was a key figure in a bribery scheme in which the powerful senator sold his clout to three New Jersey men looking for help with their business dealings or legal troubles. Nadine Menendez says she is innocent. Last year a different jury convicted Bob Menendez of many of the same charges. He is supposed to begin serving an 11-year prison term in June.",
      "publishedAt": "2025-04-21T19:50:43Z",
      "title": "Wife of former US Sen. Bob Menendez convicted in bribery scheme",
      "url": "https://apnews.com/article/nadine-menendez-bribery-verdict-bf8d928577906b854fc09d62d29bd841",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa6483d/2147483647/strip/true/crop/6617x3722+0+344/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Fc9%2F6a08984be2aab2e5dc1609a53157%2Fbe38f966bd814b6b984490477e3f15e2"
    },
    {
      "author": "Carla K. Johnson",
      "description": "Delays in cancer screenings brought on by COVID-19 aren’t making a huge impact on cancer statistics. Experts who track the data say cancer death rates continue to decline. And a new report published Monday in the journal Cancer shows there weren’t huge shifts in late diagnoses. It’s the broadest-yet analysis of the pandemic’s effect on U.S. cancer data. The report’s lead author called the findings reassuring. Many Americans were forced to postpone cancer screenings for several months in 2020 as COVID-19 overwhelmed doctors and hospitals.",
      "publishedAt": "2025-04-21T21:27:36Z",
      "title": "Advanced cancers returned to prepandemic levels, according to a reassuring report",
      "url": "https://apnews.com/article/cancer-screening-covid-pandemic-cb8fb5330716db895d5c61125544ae78",
      "urlToImage": "https://dims.apnews.com/dims4/default/a87ca5c/2147483647/strip/true/crop/1730x973+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Ffa%2Fe0461a33d24e37eefb6ebf6782e9%2Fbfd8c504a45240e28e6adba3447f66e6"
    },
    {
      "author": null,
      "description": "Pope Francis had an informal, lighthearted speaking style. When Francis met Emeritus Pope Benedict XVI for the first time after being elected in 2013, he said, “We are brothers!” He used the same greeting for Patriarch Kirill in 2016 at the first meeting between a pope and the head of the Russian Orthodox Church. When asked about a purportedly gay priest, Francis made headlines by saying, “Who am I to judge?” The comment sent a message of welcome to the LGBTQ+ community and those who felt shunned by a church that had stressed conditions, rules and sexual propriety over unconditional love in previous papacies.",
      "publishedAt": "2025-04-21T09:06:11Z",
      "title": "Some of Pope Francis’ most memorable quotes",
      "url": "https://apnews.com/article/pope-francis-quotes-f202f17ec8db46e2b0222ce8c07b1abf",
      "urlToImage": "https://dims.apnews.com/dims4/default/8b49ee5/2147483647/strip/true/crop/4350x2447+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fce%2F10365c89426fbbfee3596c3ccfd6%2Fap512840296673.jpg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}