{
  "articles": [
    {
      "author": "JOHN PYE",
      "description": "SYDNEY (AP) — England moved on to its first Women’s World Cup championship game with a 3-1 victory Wednesday over co-host Australia, ending the Matildas captivating run through the tournament.",
      "publishedAt": "2023-08-16T11:55:43Z",
      "title": "England beats Australia 3-1 to move into Women's World Cup final against Spain",
      "url": "https://apnews.com/f4d3dd9646fcdbfb7a179137bee7a676",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5eb86fc7279419388a6cb01e7cee9c7/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and LINLEY SANDERS",
      "description": "NEW YORK (AP) — After every new indictment, Donald Trump has boasted that his standing among Republicans only improves — and he has a point.Nearly two-thirds of Republicans — 63% — now say they want the former president to run again, according to new polling from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-08-16T04:04:00Z",
      "title": "Trump enjoys strong support among Republicans. The general election could be a different story",
      "url": "https://apnews.com/ddfd50492dc576c0c2ca2d1afe0e4639",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/effe9b6cc9a84b01877863595d3fe6d7/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Americans are deeply divided along party lines in their views of President Donald Trump's actions in the most recent criminal cases brought against him, a new poll shows, with about half saying his alleged attempt to interfere in Georgia's 2020 vote count was illegal.",
      "publishedAt": "2023-08-16T10:20:36Z",
      "title": "Americans are divided along party lines over Trump’s actions in election cases, AP-NORC poll shows",
      "url": "https://apnews.com/b6140eed88b3153e41dbf9e008d5a21b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b9c8dfa78ef4c8e87b685ac122c5d6d/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Survivors of deadly wildfires on Maui contended with intermittent power and unreliable cell service as they sought help rebuilding their lives. Teams of people, meanwhile, labored to find the dead and identify them.",
      "publishedAt": "2023-08-16T05:03:02Z",
      "title": "Survivors of Maui fires face power cuts and poor cell service as teams work to find and ID the dead",
      "url": "https://apnews.com/4e444bc0217bc1e0779f87e641a1b235",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7445dccef52243a6b1d44e6cb702e4a0/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea asserted Wednesday that a U.S. soldier who bolted across the heavily armed Korean border last month did so after becoming disillusioned with the inequality of American society and racial discrimination in its Army.",
      "publishedAt": "2023-08-15T21:57:29Z",
      "title": "North Korea asserts US soldier Travis King crossed border after becoming disillusioned with America",
      "url": "https://apnews.com/7b0b2f3b87f4cb9352c1cc458ab576b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28a4cf8b6c143c7bf3935e22059c45f/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia pounded grain terminals in Ukraine’s southern Odesa region Wednesday, local officials said, hitting storage facilities and ports along the Danube River that Kyiv has increasingly used for grain transport to Europe after Moscow broke off a key wartime export deal through the Black Sea.",
      "publishedAt": "2023-08-16T09:49:12Z",
      "title": "Russia hits Ukrainian grain depots again as a foreign ship tries out Kyiv's new Black Sea corridor",
      "url": "https://apnews.com/2a3bceb975a1a398695edf40fdb0870e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ca364400f3645f489c5bfd82d8d7cd2/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Nigeriens are preparing for a possible invasion by countries in the region, three weeks after mutinous soldiers ousted the nation’s democratically elected president.Residents in the capital, Niamey, are calling for the mass recruitment of volunteers to assist the army in the face of a growing threat by the West African regional bloc, ECOWAS, which says it will use military force if the junta doesn't reinstate deposed President Mohamed Bazoum.",
      "publishedAt": "2023-08-16T07:49:44Z",
      "title": "Nigeriens call for mass recruitment of volunteers as the junta faces possible regional invasion",
      "url": "https://apnews.com/18656da0973ab4a04bd054363eb1ec4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3402d6364cf4133935d82b74ef84fa7/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "RALEIGH, N.C. (AP) — Transgender rights take center stage in North Carolina again Wednesday as GOP supermajorities in the General Assembly attempt to override the governor's vetoes of legislation banning gender-affirming health care for minors and limiting transgender participation in school sports.",
      "publishedAt": "2023-08-16T05:04:24Z",
      "title": "North Carolina GOP seeks to override governor's veto of bill banning gender-affirming care for youth",
      "url": "https://apnews.com/536351cc360a92cdd21f298f6212e6d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2656773205b044b19837998682f70ce0/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "Washington (AP) — Congressional leaders are pitching a stopgap government funding package to avoid a federal shutdown after next month, acknowledging the House and Senate are nowhere near agreement on spending levels to keep federal operations running.",
      "publishedAt": "2023-08-15T20:27:15Z",
      "title": "McCarthy floats stopgap funding to prevent a government shutdown at the end of next month",
      "url": "https://apnews.com/abbde0620a2058e304846a93834e9bd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acd863cd07744a5ab6afb0dd30a27674/3000.jpeg"
    },
    {
      "author": "JOHN PYE",
      "description": "SYDNEY (AP) — England moved on to its first Women’s World Cup championship game with a 3-1 victory Wednesday over co-host Australia, ending the Matildas captivating run through the tournament.",
      "publishedAt": "2023-08-16T11:55:43Z",
      "title": "England beats Australia 3-1 to move into Women's World Cup final against Spain",
      "url": "https://apnews.com/f4d3dd9646fcdbfb7a179137bee7a676",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5eb86fc7279419388a6cb01e7cee9c7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}