{
  "articles": [
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "LARNACA, Cyprus (AP) — A ship bearing humanitarian aid was making preparations to leave Cyprus and head for Gaza, the European Commission president said Friday as international donors launched a sea corridor to supply the besieged territory that is facing widespread hunger after five months of war.",
      "publishedAt": "2024-03-08T08:01:57Z",
      "title": "A ship with Gaza aid is preparing to inaugurate a sea route from Cyprus to the war-ravaged strip",
      "url": "https://apnews.com/196b1e1bdef8ce28449799759c797d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7614b35c394040cf9ae2be527abf826d/2000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — Even before President Joe Biden announced in his State of the Union address the plans for providing aid to Gaza by sea, the Army’s 7th Transportation Brigade and other units were scrambling to pull equipment together.",
      "publishedAt": "2024-03-09T05:02:04Z",
      "title": "How the US military is scrambling to build a floating dock for urgently needed aid to Gaza",
      "url": "https://apnews.com/97e53ccaa9b54b436b2e6ede7dd9aa2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/691ee8ebd9f54f4980a8f594fc2fe9a4/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The Senate on Friday approved a $460 billion package of spending bills in time to meet a midnight deadline for avoiding a shutdown of many key federal agencies, a vote that gets lawmakers about halfway home in wrapping up their appropriations work for the 2024 budget year.",
      "publishedAt": "2024-03-08T19:11:51Z",
      "title": "Congress passes first package of spending bills just hours before shutdown deadline for key agencies",
      "url": "https://apnews.com/7dfcb8d8682d5dc28c91af3702489d89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a6cffff2e8f42819531e2ed1633e52b/3000.jpeg"
    },
    {
      "author": "BILL BARROW and JEFF AMY",
      "description": "ATLANTA (AP) — The 2024 presidential election campaign will pick up Saturday where the 2020 contest left off. Or, more precisely, in a place where it never actually ended.",
      "publishedAt": "2024-03-09T05:00:47Z",
      "title": "The Biden-Trump rematch comes into view with dueling visits to Georgia",
      "url": "https://apnews.com/5ae87db6c20f95eae55d7f3c603144e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7b78856c6bc4f629b392a4a164e64a8/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — A lonely man jailed for criticizing the government on his ham radio. A poet assaulted by police after he recited a poem objecting to Russia’s war in Ukraine.",
      "publishedAt": "2024-03-09T05:13:54Z",
      "title": "A lonely radio nerd. A poet. Vladimir Putin's crackdown sweeps up ordinary Russians",
      "url": "https://apnews.com/c102c4f4f4fa7d11e5d3587257ecd864",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/749934efec784898b3e75acd4fa5f64f/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and KATIE MARIE DAVIES",
      "description": "TALLINN, Estonia (AP) — Russian President Vladimir Putin is expected to secure his fifth term in power this month on the heels of opposition leader Alexei Navalny's death in prison, which devastated Kremlin critics and spurred concerns about the safety of other imprisoned dissidents.",
      "publishedAt": "2024-03-09T05:57:09Z",
      "title": "Who are the Russian dissidents still serving time after Alexei Navalny died behind bars?",
      "url": "https://apnews.com/f4a70f0275e41748a39630a6c9ae3aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6e50624b52844b39f848b857634752a/1920.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM and KIMBERLEE KRUESI",
      "description": "CHARLESTON, W.Va. (AP) — Democrat Kayla Young and Republican Patricia Rucker frequently clash on abortion rights and just about everything else in West Virginia's Legislature, but they agree on one thing: Too few of their colleagues are women, and it's hurting the state.",
      "publishedAt": "2024-03-09T05:12:49Z",
      "title": "Female representation remains low in US statehouses, particularly Democrats in the South",
      "url": "https://apnews.com/08affa16ae0a26049745ae8e05b324c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67533006bb9d4343967dc33749578dcc/3000.jpeg"
    },
    {
      "author": "TOM ODULA",
      "description": "NAIROBI, Kenya (AP) — Njeri Migwi’s phone buzzes incessantly. Phone calls and messages keep coming in from women seeking help to escape life-threatening situations. A mother and her remaining child are looking for a place to stay after her partner allegedly raped and killed her two other children, including a 6-month old.",
      "publishedAt": "2024-03-09T05:24:49Z",
      "title": "Kenyan activists are on a mission to end gender-based violence as attacks on women surge",
      "url": "https://apnews.com/2c54cc83e369083437bee15404627a22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d879028b3e4a7089f3bb611ea4dd82/3000.jpeg"
    },
    {
      "author": "BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Portugal is holding an early general election on Sunday when 10.8 million registered voters will elect 230 lawmakers to the National Assembly, the country's parliament. The lawmakers will then choose a new government.",
      "publishedAt": "2024-03-09T05:47:33Z",
      "title": "Portugal is electing a new parliament and government. Here’s what to know about the major issues",
      "url": "https://apnews.com/85a9d49b9e52ed6fad1836e3e2faf7a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37667b752c124b8bbf9ddde4b920d9d6/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "TUBA CITY, Ariz. (AP) — Melissa Blackhair is not eager to spring forward Sunday. “I’m dreading it. I just don’t want to see how much we have to adjust,\" Blackhair said while sitting in her home office in Tuba City on the Navajo Nation, the only area in Arizona that follows daylight saving time.",
      "publishedAt": "2024-03-09T05:05:04Z",
      "title": "The US is springing forward to daylight saving. For Navajo and Hopi tribes, it's a time of confusion",
      "url": "https://apnews.com/a1016ce873b772ffae544de9fbcd29d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2776aebe35449888a994ae4527f493b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}