{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI and JILL COLVIN",
      "description": "GRAND RAPIDS, Mich. (AP) — Donald Trump held his first campaign rally since he survived an assassination attempt Saturday, returning to the battleground state of Michigan alongside his newly named running mate.",
      "publishedAt": "2024-07-20T04:08:34Z",
      "title": "Trump holds first rally after assassination attempt with his new running mate, Vance, by his side",
      "url": "https://apnews.com/dcc7969cd53e281e32beb72a2c6e0fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e588ac2bafa444ffa20ee6620666d9fa/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — As Democrats churn over whether President Joe Biden should stay in the 2024 race, the party turmoil is deepening over whether his Vice President Kamala Harris is next in line for the job or if a “mini primary” should be quickly launched to choose a new nominee before the party's August convention.",
      "publishedAt": "2024-07-20T04:00:31Z",
      "title": "Beyond Biden, Democrats are split over who would be next —VP Harris or launch a 'mini primary'",
      "url": "https://apnews.com/2b1c163c863130675b3b5b60718741c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30d986757ab64bac99d51de0b92e9174/3000.jpeg"
    },
    {
      "author": "AHMED AL-HAJ, WAFAA SHURAFA and JACK JEFFERY",
      "description": "SANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.The Israeli strikes appeared to be the first on Yemeni soil since the Israel-Hamas war began in October, and they threatened to open a new front in the region as Israel battles proxies of Iran.",
      "publishedAt": "2024-07-20T10:13:28Z",
      "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks",
      "url": "https://apnews.com/786ff10ee4c3534024833ebbf586fadc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1148926ddacb45dd9db561b24d02fdd7/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM and SHEIKH SAALIQ",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s top court on Sunday scaled back a controversial quota system for government job applicants, a partial victory for student protesters after days of nationwide unrest and deadly clashes between police and demonstrators that have killed scores of people.",
      "publishedAt": "2024-07-21T04:51:23Z",
      "title": "Bangladesh’s top court scales back government jobs quota after deadly unrest that has killed scores",
      "url": "https://apnews.com/107847b2c1bdf4e52dfa0c82f51f3d4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/888b45ab065d4d9b9dc8e4219c4bb547/1920.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — China and the Philippines reached a deal they hope will end confrontations at the most fiercely disputed shoal in the South China Sea, the Philippine government said Sunday.",
      "publishedAt": "2024-07-21T10:15:10Z",
      "title": "China and the Philippines reach deal in effort to stop clashes at fiercely disputed shoal",
      "url": "https://apnews.com/3450e06b61bbe6ef9cd5dd9e211f6f79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/082e6277b7a64b02b23a47133e6d9f20/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and JILL LAWLESS",
      "description": "As the world continues to recover from massive business and travel disruptions caused by a faulty software update from cybersecurity firm CrowdStrike, malicious actors are trying to exploit the situation for their own gain.",
      "publishedAt": "2024-07-20T17:22:07Z",
      "title": "Malicious actors trying to exploit global tech outage for their own gain",
      "url": "https://apnews.com/ebcba985600530a4689289eae38619bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e65fecf4b03426884d2dac34da0c138/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE and LEKAN OYEKANMI",
      "description": "SPRING, Texas (AP) — As the temperature soared in the Houston-area home Janet Jarrett shared with her sister after losing electricity in Hurricane Beryl, she did everything she could to keep her 64-year-old sibling cool.",
      "publishedAt": "2024-07-21T05:32:34Z",
      "title": "Heat-related Texas deaths climb after Beryl left millions without power for days or longer",
      "url": "https://apnews.com/53a403fec3ffdf34daeb8d5e179953ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e009796fc3184c86aca1cbe7c39381f9/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The recently opened archives of Pope Pius XII have shed new light on claims the World War II-era pope didn’t speak out about the Holocaust.",
      "publishedAt": "2024-07-21T05:31:27Z",
      "title": "Vatican's Pius XII archives shed light on another contentious chapter: The Legion of Christ scandal",
      "url": "https://apnews.com/91744e8054aa839647633e1d56372165",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfcfcdac5ffe4a0cb84b05dd0aa407bb/2001.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — A year ago, the head of the Paris Olympics boldly declared that France's capital would be “ the safest place in the world \" when the Games open this Friday.",
      "publishedAt": "2024-07-21T06:06:23Z",
      "title": "With AI, jets and police squadrons, Paris is securing the Olympics — and worrying critics",
      "url": "https://apnews.com/34b168e7a511e22ce7119a91932d2759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bab5e4f907f4f9bad4510545eca526c/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "BUTLER, Pa. (AP) — When gunshots echoed at the Trump rally where she was working, Butler Eagle reporter Irina Bucur dropped to the ground just like everyone else.",
      "publishedAt": "2024-07-21T06:07:12Z",
      "title": "The biggest of stories came to the small city of Butler. Here's how its newspaper met the moment",
      "url": "https://apnews.com/87c73207c4d4470e4d9deb13b2852572",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcbb8b0374c04474878aa21d3fa220e6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}