{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Deeply torn over President Joe Biden’s candidacy, Democratic lawmakers return to Washington at a pivotal moment as they decide whether to work to revive his campaign or edge out the party leader, a make-or-break time for his reelection and their own political futures.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Biden's uncertain political future divides Democrats as they return to Capitol Hill",
      "url": "https://apnews.com/16c222f825558db01609605b3ad9742a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/622abf9cef934d2abaee51078fc957b6/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden will shift this week from focusing on campaigning for reelection to hosting a NATO summit.",
      "publishedAt": "2024-07-08T04:04:34Z",
      "title": "Biden's focus shifts to this week's NATO summit. But questions about his campaign may only intensify",
      "url": "https://apnews.com/a8bc46963b56f13d7cc780d715e1727c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84477606872a4daf85a2c80c56f0c6fe/2628.jpeg"
    },
    {
      "author": "JOHN LEICESTER, LORI HINNANT and SYLVIE CORBET",
      "description": "PARIS (AP) — A coalition of the French left won the most seats in high-stakes legislative elections Sunday, beating back a far-right surge but failing to win a majority.",
      "publishedAt": "2024-07-07T04:00:38Z",
      "title": "French vote gives leftists most seats over far right, but leaves hung parliament and deadlock",
      "url": "https://apnews.com/08f10a7416a2494c85dcd562f33401d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48181c35070245c49bf4cbf4a52dd9c4/1920.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and VALERIE GONZALEZ",
      "description": "MATAGORDA, Texas (AP) — Beryl strengthened and again became a hurricane late Sunday as it heads toward southern Texas, where its outer bands lashed the coast with rain and intensifying winds as residents prepared for the powerful storm that has already cut a deadly path through parts of Mexico and the Caribbean.",
      "publishedAt": "2024-07-08T04:30:46Z",
      "title": "Beryl regains hurricane strength as it bears down on southern Texas",
      "url": "https://apnews.com/7dfd5353671ee30d0c6d11518ea5a370",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e45f17f696e34640a70338ad18abf13c/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Earth's more than year-long streak of record-shattering hot months kept on simmering through June, according to the European climate service Copernicus.There's hope that the planet will soon see an end to the record-setting part of the heat streak, but not the climate chaos that has come with it, scientists said.",
      "publishedAt": "2024-07-08T02:02:30Z",
      "title": "June sizzles to 13th straight monthly heat record. String may end soon, but dangerous heat won't",
      "url": "https://apnews.com/95f7028e64c2271b7445a11b247afef8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d6947c25f0648f4b48065c4a37d5d13/3000.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "NEW YORK (AP) — Ruben Berrios knows the scorching truth: When it comes to extreme heat, where you live can be a matter of life and death.The 66-year-old lives in Mott Haven, a low-income neighborhood in New York’s South Bronx, where more than 90 percent of residents are Latino or Black.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Scorched by history: Discriminatory past shapes heat waves in minority and low-income neighborhoods",
      "url": "https://apnews.com/23a2bdc8fdd392c2ecd39a370fb90f9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/214ff704b3c24193b179bf3fbc447f56/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a cease-fire to bring back scores of hostages held by Hamas.",
      "publishedAt": "2024-07-07T09:41:42Z",
      "title": "Israeli protesters block highways, call for cease-fire to return hostages 9 months into war in Gaza",
      "url": "https://apnews.com/d78b75084f38c98e219e64db588374b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfa8aed90a634041aa2f1ea888bd1e99/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and ALANNA DURKIN RICHER",
      "description": "Boeing will plead guilty to a criminal fraud charge stemming from two crashes of 737 Max jetliners that killed 346 people after the government determined the company violated an agreement that had protected it from prosecution for more than three years, the Justice Department said Sunday night.",
      "publishedAt": "2024-07-08T04:00:19Z",
      "title": "Boeing accepts a plea deal to avoid a criminal trial over 737 Max crashes, Justice Department says",
      "url": "https://apnews.com/245a38dc6d3082f4ddff1f6f74f274f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/180158e6d3ad41a68b44fa5aa60b4fa4/3000.jpeg"
    },
    {
      "author": "ALAN SUDERMAN and JULIET LINDERMAN",
      "description": "WASHINGTON (AP) — Kash Patel was recruiting foot soldiers.It was a Friday morning in February at one of America’s biggest conservative conventions, and Donald Trump’s trusted lieutenant was on center stage, pleading with the former president’s supporters to help the now presumptive Republican nominee reclaim the White House.",
      "publishedAt": "2024-07-08T04:02:01Z",
      "title": "Fight with Kash: Trump loyalist mythologizes former president while building his own brand",
      "url": "https://apnews.com/fc624ab286c19a498d85a66e6e7198fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b715aafce4d4f668bd60d36f6349f9c/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "A New Mexico judge is setting the table for the involuntary manslaughter trial of actor Alec Baldwin in the fatal shooting of a cinematographer on the set of a Western movie.Judge Mary Marlowe Sommer will consider an array of requests from prosecutors and defense attorneys that could restrict what evidence, testimony and court arguments are heard by a jury.",
      "publishedAt": "2024-07-08T04:00:50Z",
      "title": "Pretrial hearing sets stage for Alec Baldwin's arrival in court in fatal shooting of cinematographer",
      "url": "https://apnews.com/7111ebd9d360a261eade601b5e4ec297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ee5c8590f40495c9d2b14a6b0fcc681/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}