{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian activists are calling for more protests against a law they say weakens the country’s anti-corruption bodies. Thousands of people gathered in the capital and other cities across Ukraine on Tuesday to urge President Volodymyr Zelenskyy to veto a controversial bill passed by Ukraine’s Parliament. After Zelenskyy approved it, activists called on social media for another demonstration Wednesday in the center of Kyiv. Critics, including EU officials and rights groups, say the law undermines the agencies' independence and threatens Ukraine's democratic reforms. Zelenskyy defends the law, claiming it removes Russian influence and accelerates stalled corruption cases.",
      "publishedAt": "2025-07-23T10:09:12Z",
      "title": "More protests are expected in Ukraine after Zelenskyy signs controversial anti-corruption bill",
      "url": "https://apnews.com/article/russia-ukraine-war-corruption-protests-zelenskyy-talks-fb2fdeb3fbf36a37b2e1eefb385bac87",
      "urlToImage": "https://dims.apnews.com/dims4/default/270676f/2147483647/strip/true/crop/4240x2385+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fb8%2Fe59cbd54bcd0927387078956d9c4%2F51267112ca184a3b977835bf3d90e21a"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump has announced a flurry of trade deals that will relieve some pressure on companies and consumers from sharply higher tariffs on imports from Japan and a handful of other Asian countries. A deal with China is pending. U.S. Treasury Secretary Scott Bessent says an Aug. 12 deadline might be postponed again to allow more time for talks. The deals offer as little as a 1% reduction in Trump's originally proposed tariffs for the Philippines and keep higher tariffs on key exports of steel and aluminum. Economists say the tariffs inevitably will dent growth in Asia and the world.",
      "publishedAt": "2025-07-23T07:59:27Z",
      "title": "Trump announces trade deals with Japan, Philippines, and Indonesia, easing tariff pressures",
      "url": "https://apnews.com/article/asia-tariffs-trump-japan-china-vietnam-55bcd9a06126686d8d2ed4897398719e",
      "urlToImage": "https://dims.apnews.com/dims4/default/01834ec/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fa4%2F2a1f36bf481fa3d908d5f00e164a%2Fap25204109890540.jpg"
    },
    {
      "author": null,
      "description": "Judges at the UN’s highest court are set to issue a decision Wednesday that could set a legal benchmark for action on the climate crisis. After years of lobbying by island nations who fear they could disappear under rising sea waters, the U.N. General Assembly asked the International Court of Justice for an advisory opinion, a non-binding but important basis for international obligations. The court has two questions to answer: What are countries obliged to do under international law to protect the climate and environment from greenhouse gas emissions, and what are the legal consequences for governments when their action or inaction has significantly harmed the climate and environment?",
      "publishedAt": "2025-07-23T04:07:26Z",
      "title": "UN court to issue opinion in landmark climate change case",
      "url": "https://apnews.com/article/un-court-opinion-climate-change-1ac84a94a5aaffd63518ef1da3502a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c351b90/2147483647/strip/true/crop/6697x3767+0+349/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F1a%2F877a865f00a48715f586c22e984a%2F011664a82c3f4b51928764a48f077dde"
    },
    {
      "author": null,
      "description": "House Speaker Mike Johnson is rebuffing pressure to act on the investigation into Jeffrey Epstein. The speaker is sending members of the House home early for a month-long break from Washington amid calls for a vote on the Epstein matter. Johnson said Tuesday morning that he wants to give the White House “space” to release the Epstein information on its own. The speaker’s stance seemed unlikely to satisfy many Republicans who are threatening to support a bipartisan bill to pry information from the Justice Department. Even before Johnson spoke, a Republican-controlled committee was advancing a resolution to subpoena Epstein’s former girlfriend, Ghislaine Maxwell, for a deposition.",
      "publishedAt": "2025-07-22T16:28:20Z",
      "title": "Speaker Johnson refuses to allow Epstein vote as House set to recess early",
      "url": "https://apnews.com/article/congress-jeffrey-epstein-trump-f2a03eca247268b14a9e38858338eded",
      "urlToImage": "https://dims.apnews.com/dims4/default/af3f55b/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fe8%2F150d1b77fc65008393fe9501979e%2F449dc4be1f4747e89457f5fff97552d2"
    },
    {
      "author": null,
      "description": "Asian shares have rallied, with Tokyo's benchmark Nikkei 225 index up 3.5% after Japan and the U.S. announced a deal on President Donald Trump's tariffs. The agreement as announced calls for a 15% import duty on goods imported from Japan, apart from certain products such as steel and aluminum that are subject to much higher tariffs. That’s down from the 25% Trump had said would kick in on Aug. 1 if a deal was not reached. On Tuesday, Wall Street inched to another record following some mixed profit reports. The S&P 500 added 0.1% to Monday's all-time high. The Dow Jones Industrial Average rose 0.4%, while the Nasdaq slipped 0.4%.",
      "publishedAt": "2025-07-23T03:51:42Z",
      "title": "Asian markets gain, with Japan's Nikkei up 3.5%, lifted by deal on Trump's tariffs",
      "url": "https://apnews.com/article/stock-markets-tariffs-trump-japan-earnings-d051e9cd9d0e15b912219f604a1e1064",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad582a0/2147483647/strip/true/crop/3968x2232+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F36%2F482afa53074bd7dee3b1bf26d1f5%2F9784e9bd29b34fddbff31059a3882fbe"
    },
    {
      "author": null,
      "description": "The gloomy, demon-invoking lead singer of the pioneering band Black Sabbath who became the throaty, growling voice of heavy metal, Ozzy Osbourne has died. A family statement said he died Tuesday, just weeks after his farewell show. He was 76. The statement did not include a cause but in 2020, Osbourne revealed he had Parkinson's disease. Either clad in black or bare-chested, the singer was often the target of parents’ groups for his imagery and once caused an uproar for biting the head off a bat. Later, he would reveal himself to be a doddering and sweet father on the reality TV show “The Osbournes.”",
      "publishedAt": "2025-07-22T18:22:49Z",
      "title": "Ozzy Osbourne dies at 76",
      "url": "https://apnews.com/article/ozzy-osbourne-dies-adff88b55f1d3b0bace5705d58d3cdde",
      "urlToImage": "https://dims.apnews.com/dims4/default/7368ec6/2147483647/strip/true/crop/3480x1957+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fd7%2F24336cf903392fbdd410023c8ac1%2F7ab707fd7a504c8da4759b5023fed59b"
    },
    {
      "author": null,
      "description": "Health authorities say Israeli strikes in Gaza killed at least 21 people. More than half of those killed late Tuesday and early Wednesday reportedly were women and children. Desperation is mounting in the Palestinian territory of more than 2 million, which experts say is at risk of famine because of Israel’s blockade and nearly two-year offensive. More than 100 human rights groups and charities signed a letter Wednesday demanding more aid for Gaza and warning of starvation. Gaza’s Health Ministry says more than 59,000 Palestinians have been killed during the Israel-Hamas war.",
      "publishedAt": "2025-07-23T07:37:46Z",
      "title": "The Latest: Israeli strikes in Gaza kill at least 21 people, health authorities say",
      "url": "https://apnews.com/article/israel-gaza-mideast-wars-latest-july-2025-ca3151c4e52f9cccb22adc6faea83a03",
      "urlToImage": "https://dims.apnews.com/dims4/default/25e637f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Fb0%2Fd756e0508195dbd20a00a61df53a%2Febacd1f9826f49c693adfcaeb0c391f6"
    },
    {
      "author": null,
      "description": "Los Angeles prosecutors have announced felony charges in connection with a car crash outside a nightclub over the weekend that injured 37 people and led to the driver being shot. LA County District Attorney Nathan Hochman on Tuesday charged the driver, who was identified as 29-year-old Fernando Ramirez. Partygoers were leaving the Vermont Hollywood venue at the end of a reggae hip-hop event early Saturday when a vehicle rammed into the crowd. Injuries ranged from minor pain to serious fractures and lacerations, and some people were briefly trapped beneath the vehicle.",
      "publishedAt": "2025-07-22T19:15:28Z",
      "title": "LA prosecutors charge driver in nightclub crash that injured 37",
      "url": "https://apnews.com/article/los-angeles-car-crash-hollywood-nightclub-dd0b2008afe5258cf3125e405ec77418",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d13de6/2147483647/strip/true/crop/3878x2181+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fbf%2Fd442de675407fd7b4ea532380342%2Fd8560462f1c94096a4e4e9856127b4af"
    },
    {
      "author": null,
      "description": "A doctor accused of supplying Matthew Perry with ketamine before his death is expected to plead guilty in federal court on Wednesday. Dr. Salvador Plasencia is charged with illegally distributing ketamine to the “Friends” star in the weeks leading up to his overdose in October 2023. Prosecutors say Plasencia provided Perry with vials, lozenges, and syringes of the drug. He initially pleaded not guilty but agreed to change his plea in exchange some charges being dropped. Perry had struggled with addiction for years. The medical examiner ruled ketamine as the primary cause of his death. Another defendant faces trial next month.",
      "publishedAt": "2025-07-23T04:46:29Z",
      "title": "Doctor who supplied Matthew Perry ketamine and called him a ‘moron’ is set to enter guilty plea",
      "url": "https://apnews.com/article/matthew-perry-doctor-guilty-plea-salvador-plasencia-ea9957df817535ab17fac24660c9c431",
      "urlToImage": "https://dims.apnews.com/dims4/default/5948b76/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F97%2Fb5ae85e6af08e83c15579830c6ab%2Ff6aa4409066b49a782e527cb042a4db1"
    },
    {
      "author": null,
      "description": "There are plenty of reasons why this particular victory by Venus Williams in this particular tennis match resonates with so many folks. That she’s 45, for one thing. Only one woman, Martina Navratilova, ever has won a tour-level singles match while older; her last victory came at 47 in 2004. That Williams hadn’t entered a tournament anywhere in 16 months. That she needed surgery for uterine fibroids. And when asked Tuesday night after beating her 23-year-old opponent, Peyton Stearns, 6-3, 6-4 at the DC Open what message others might take away from that performance and that result, Williams was quick to provide an answer about there being no limits for excellence.",
      "publishedAt": "2025-07-23T10:00:06Z",
      "title": "Venus Williams' win at age 45 resonates for several reasons",
      "url": "https://apnews.com/article/venus-williams-45-navratilova-339951add9c267ffe689900f4fc4ccc1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e42bdbb/2147483647/strip/true/crop/6770x3808+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F32%2Fdad4da831e6f01e66bd967475a2f%2F0df06224ee0b4d6288e61afd579af3ca"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}