{
  "articles": [
    {
      "author": "TAMMY WEBBER and JIM MORRIS",
      "description": "VANCOUVER, British Columbia (AP) — Residents heeded warnings to evacuate the capital of Canada's Northwest Territories as a large wildfire burned just outside the city of 20,000 Friday, while firefighters battled a growing fire that set homes ablaze in a city in British Columbia.",
      "publishedAt": "2023-08-18T04:59:08Z",
      "title": "City empties as thousands flee wildfire burning near capital of Canada's Northwest Territories",
      "url": "https://apnews.com/7b8c327876d86a483c8e25df7bc2c566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/beb59c0c189c48d19697c69c987426c3/1920.jpeg"
    },
    {
      "author": "IGNACIO MARTINEZ and JULIE WATSON",
      "description": "CABO SAN LUCAS, Mexico (AP) — Hurricane Hilary churned off Mexico's Pacific coast Friday as a powerful Category 4 storm threatening to unleash torrential rains on the mudslide-prone border city of Tijuana before heading into Southern California as the first tropical storm there in 84 years.",
      "publishedAt": "2023-08-18T07:58:35Z",
      "title": "Powerful Hurricane Hilary heads for Mexico's Baja. Rare tropical storm watch issued for California",
      "url": "https://apnews.com/406a3f7474eacb6222cedc33993d4657",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8f4aa790ba9498f84b2a74d0c284964/3000.jpeg"
    },
    {
      "author": "KEN SWEET and MAE ANDERSON",
      "description": "NEW YORK (AP) — The Federal Emergency Management Agency said Friday it has approved more than $5.6 million in assistance to nearly 2,000 households in Maui so far as the federal government tries to help survivors of the devastating wildfires.",
      "publishedAt": "2023-08-18T18:10:45Z",
      "title": "FEMA has paid out more than $5.6 million to Maui survivors, a figure expected to grow significantly",
      "url": "https://apnews.com/973218438d06164d218ce60d252d7c32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a08e3ac64bc45f48bfa104005cefa18/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A California appeals court on Friday revived lawsuits from two men who allege Michael Jackson sexually abused them for years when they were boys. A three-judge panel from California’s 2nd District Court of Appeal found that the lawsuits of Wade Robson and James Safechuck should not have been dismissed by a lower court, and that the men can validly claim that the two Jackson-owned corporations that were named as defendants in the cases had a responsibility to protect them.",
      "publishedAt": "2023-08-18T22:42:10Z",
      "title": "Michael Jackson sexual abuse lawsuits revived by appeals court",
      "url": "https://apnews.com/fb488e1343b71629a6305d4bf8adea8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16e074f2543842179d11686ff050ed03/2000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Authorities are searching for a member of the Proud Boys extremist group who disappeared days before his sentencing in a U.S. Capitol riot case, where prosecutors are seeking more than a decade in prison, according to a warrant made public Friday.",
      "publishedAt": "2023-08-18T15:29:39Z",
      "title": "Proud Boy on house arrest in Jan. 6 case disappears ahead of sentencing",
      "url": "https://apnews.com/1341d4596fb96ee2828b54d70ef7e126",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9559d160f19e4b57a10377b80a662a4c/806.jpeg"
    },
    {
      "author": null,
      "description": "SPOKANE, Wash. (AP) — Fast-moving wildfires raced through Washington state on Friday, burning some homes and prompting evacuation orders for thousands of people in small rural communities.One of the largest blazes, the so-called Gray Fire near Spokane in eastern Washington, began around noon and a few hours later had surged through 4.7 square miles (12 square kilometers) of grass, timber and wheat, pushed by 35-mph (56-kph) winds, according to the Washington State Department of Natural Resources.",
      "publishedAt": "2023-08-19T00:19:58Z",
      "title": "Thousands under evacuation orders and some homes burn as wildfires race through Washington state",
      "url": "https://apnews.com/905a0bbd2e0f48c200d670be10fad0bc",
      "urlToImage": ""
    },
    {
      "author": "AAMER MADHANI, DARLENE SUPERVILLE and MATTHEW LEE",
      "description": "CAMP DAVID, Md. (AP) — President Joe Biden and the leaders of Japan and South Korea agreed Friday to expand security and economic ties at a historic summit at the U.S. presidential retreat of Camp David, cementing a new agreement with the allies that are on an increasingly tense ledge in relations with China and North Korea.",
      "publishedAt": "2023-08-18T09:35:11Z",
      "title": "US, Japan and South Korea agree to expand security ties at summit amid China, North Korea worries",
      "url": "https://apnews.com/0bc36bb3705a3dc1b69dc8cd47b35dd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/284b83c029cf42cdae2fe70d0f6c6b3c/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — When the invitation to lunch at the Empire State Building first arrived last summer, some of George Santos’ campaign staffers were wary.The sender described himself as a deep-pocketed donor, eager to max out his contribution to the Republican congressional candidate.",
      "publishedAt": "2023-08-18T18:41:48Z",
      "title": "George Santos says ex-fundraiser caught using a fake name tried a new tactic: spelling it backwards",
      "url": "https://apnews.com/8db3d2c788b34d8a6e5f4f1f79cc01c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67a262e1906c4fd280e2fe83b83c532d/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "Phil Durst recalled clawing at his face after a chemical from a commercial dishwashing machine squirted into his eyes, causing “the most indescribable pain I’ve ever felt — ever, ever, ever.”His left eye bore the brunt of the 2017 work accident, which stole his vision, left him unable to tolerate light and triggered four to five cluster headaches a day.",
      "publishedAt": "2023-08-18T18:01:09Z",
      "title": "Stem cells from one eye show promise in healing injuries in the other",
      "url": "https://apnews.com/b2896563880f2ef9b6eda43263aec095",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f53dc955ca147c3b72ec1308bbe5c7f/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Hours before a Norfolk Southern train derailed in Ohio and erupted in fire in February, a judge ruled a former railroad employee could proceed with a lawsuit claiming he had been harassed for years by managers who said he reported too many flaws in rail cars he inspected and had his job changed after reporting an injury.",
      "publishedAt": "2023-08-19T04:10:10Z",
      "title": "Rail whistleblowers fired for voicing safety concerns despite efforts to end practice of retaliation",
      "url": "https://apnews.com/3cd9619350bacc9c7c01c9a1910f3435",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f53c0a317b814d2d9e82c2e0d3c86784/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}