{
  "articles": [
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Donald Trump's first picks for immigration policy jobs spent the last four years angling for this moment.Stephen Miller and Thomas Homan had critical roles in the first Trump administration and are unapologetic defenders of its policies, which included separating thousands of parents from their children at the border to deter illegal crossings.",
      "publishedAt": "2024-11-12T05:06:55Z",
      "title": "A pair of Trump officials have defended family separation and ramped-up deportations",
      "url": "https://apnews.com/abb1a75497d11c978c369cb20016eecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516759f4b2af40e0aefc305c1d9937b3/1642.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge on Tuesday put off a key ruling in President-elect Donald Trump’s hush money case as his lawyers argued for dismissing it so he can run the country.",
      "publishedAt": "2024-11-12T05:22:48Z",
      "title": "Judge delays ruling on whether to scrap Trump's conviction in hush money case",
      "url": "https://apnews.com/1b555b96443f38d35e995b8b4853a32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7a71f3a14da4c19bd8c6ae0a10814b2/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel has failed to meet U.S. demands to allow greater humanitarian access to the Gaza Strip, where conditions are worse than at any point in the 13-month-old war, international aid organizations said Tuesday.",
      "publishedAt": "2024-11-12T07:24:40Z",
      "title": "Aid groups say Israel misses US deadline to boost humanitarian aid entering Gaza",
      "url": "https://apnews.com/48cd09c1c007cacd6d7a309589490320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f33c02463424cdd9621ecd75888569e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed at least 31 people in the Gaza Strip in the past 24 hours, including 11 at a makeshift cafeteria in an Israeli-declared humanitarian zone, medics said.",
      "publishedAt": "2024-11-12T06:46:27Z",
      "title": "Israeli strikes kill 31 Palestinians in the Gaza Strip and 6 east of Beirut, medics say",
      "url": "https://apnews.com/095148946dcc1d0dcb75cbd423b1be3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca5e09b38ef4f5f86c25f97139297fa/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson said Tuesday that Republicans are “ready to deliver” President-elect Donald Trump's agenda after his election victory, insisting the GOP won't make the mistakes of last time and will be much better prepared for a second-term Trump White House.",
      "publishedAt": "2024-11-12T05:10:44Z",
      "title": "Speaker Mike Johnson says Republicans are 'ready to deliver' on Trump's agenda",
      "url": "https://apnews.com/82730f474a365a0d6e6af78a84bceda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45829a687efe49cc8c2411534a71681f/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "NEW YORK (AP) — Wall Street is already making big bets on what take two for a White House led by Donald Trump will mean for the economy.Since Election Day, investors have sent prices zooming for stocks of banks, fossil-fuel producers and other companies expected to benefit from Trump’s preference for lower tax rates and lighter regulation.",
      "publishedAt": "2024-11-12T16:41:22Z",
      "title": "Wall Street makes wagers on the likely winners and losers in a second Trump term",
      "url": "https://apnews.com/cff11a24cf9a7e05a7b42b3e99a61768",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e08854fe74cd4f8ebc2563ca73c00c9c/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "After a tumultuous year filled with anxiety and a legal battle about its future in the U.S., TikTok may have just been thrown a lifeline by the man who was once its biggest foe: Donald Trump.",
      "publishedAt": "2024-11-12T16:59:27Z",
      "title": "Trump has promised to 'save TikTok'. What happens next is less clear",
      "url": "https://apnews.com/282d8df7b91dce270316509badd39978",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c7caeeeac94414397ca90b642aab7ab/3000.jpeg"
    },
    {
      "author": "SARA CLINE and KEVIN McGILL",
      "description": "BATON ROUGE, LA. (AP) — A new Louisiana requirement that the Ten Commandments be displayed in every public classroom by Jan. 1 was temporarily blocked Tuesday by a federal judge who said the law is “unconstitutional on its face.”",
      "publishedAt": "2024-11-12T15:28:16Z",
      "title": "Federal judge blocks Louisiana law that requires classrooms to display Ten Commandments",
      "url": "https://apnews.com/87b3dde94e583fdbb9ecb26db42b0206",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6153de152f74f0fa21105759ad5a27e/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The U.S. syphilis epidemic slowed dramatically last year, gonorrhea cases fell and chlamydia cases remained below prepandemic levels, according to federal data released Tuesday.The numbers represented some good news about sexually transmitted diseases, which experienced some alarming increases in past years due to declining condom use, inadequate sex education, and reduced testing and treatment when the COVID-19 pandemic hit.",
      "publishedAt": "2024-11-12T16:00:37Z",
      "title": "STD epidemic slows as new syphilis and gonorrhea cases fall in US",
      "url": "https://apnews.com/e8bfcfd0ada922c894b38a6e5dbdec5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38252e1a4bba402197771f1e739c106d/3000.jpeg"
    },
    {
      "author": "MARK LEWIS",
      "description": "STAVANGER, Norway (AP) — In 1965, a Norwegian woman gave birth to a baby girl in a private hospital. Seven days later she returned home with a baby. When the baby developed dark curls that made her look different from herself, Karen Rafteseth Dokken assumed she just took after her husband's mother.",
      "publishedAt": "2024-11-12T16:33:11Z",
      "title": "Women switched at birth in 1965 sue Norway for a breach of human rights",
      "url": "https://apnews.com/60c842f239da2f03f16bf1464761828e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25274f7d4a474e83addf5d8b81cf4336/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}