{
  "articles": [
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump has slammed Ukrainian President Volodymyr Zelenskyy for suggesting that the end of Russia’s war against Ukraine likely “is still very, very far away.\" Trump in a post on his social media platform Monday said the comment was \"the worst statement that could have been made by Zelenskyy, and America will not put up with it for much longer!” Zelenskyy late Sunday said it would take time to come to an agreement to end the war, which he believed would go on for some time. At the same time, he tried offering a positive take on the U.S.-Ukraine relationship in the aftermath of his contentious White House meeting with the Republican president and Vice President JD Vance.",
      "publishedAt": "2025-03-03T17:17:13Z",
      "title": "Trump slams Zelenskyy for saying the end of the Russia war ‘is still very, very far away’",
      "url": "https://apnews.com/article/trump-zelenskyy-russia-ukraine-a15a459c9a3a393d040478ebbe250a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e60696/2147483647/strip/true/crop/5406x3041+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F11%2Fbd228bd69da23a0d1c8d54177126%2Fa042713247604b1d960387634a3a2abf"
    },
    {
      "author": "Lolita C. Baldor, David Klepper",
      "description": "The U.S. Cyber Command is pausing its offensive operations against Russia. Defense Secretary Pete Hegseth made the decision, which was confirmed Monday by a U.S. official speaking on condition of anonymity to discuss sensitive operations. The suspension of some cybersecurity preparations comes as many national security experts warn of a greater threat posed by Russia, China and other adversaries. Hegseth’s decision doesn't affect cyberoperations conducted by other agencies, including the CIA. U.S. Cyber Command oversees and coordinates defensive and offensive cybersecurity work for the Pentagon and is known as America's first line of defense in cyberspace.",
      "publishedAt": "2025-03-03T23:50:04Z",
      "title": "Hegseth orders suspension of Pentagon's offensive cyberoperations against Russia",
      "url": "https://apnews.com/article/cyber-command-russia-putin-trump-hegseth-c46ef1396e3980071cab81c27e0c0236",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a00bcd/2147483647/strip/true/crop/5898x3318+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2F95%2F4fec8f439d9b5a96bc933ed7e0d0%2F941e7344fa8b43f7a556580907c3e50e"
    },
    {
      "author": "Eric Tucker",
      "description": "As his White House meeting with his Ukrainian counterpart devolved into a stunning blowup, President Donald Trump leaned on a familiar refrain to explain his unique kinship with Russian leader Vladimir Putin. He said that Putin had “suffered” through the investigation into Russian interference in the 2016 presidential election. The reference underscored the extent to which Trump’s lingering fury over an inquiry he has misleadingly branded a “hoax” remains top of mind even now. It also showed that Trump’s view of a war that Russia launched in Ukraine three years ago is colored not only by his relationship with Putin but also by his experience with Ukrainian President Volodymyr Zelenskyy.",
      "publishedAt": "2025-03-03T21:08:27Z",
      "title": "How Trump's history with Russia and Ukraine set the stage for a blowup with Zelenskyy",
      "url": "https://apnews.com/article/trump-russia-ukraine-fbi-mueller-ff6d60923de68632f2671e275083b54b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e09336/2147483647/strip/true/crop/3725x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fb3%2F5f7b2a70fc257be2ea121a8e048d%2F95657bc2e31147ca99168afd90e91651"
    },
    {
      "author": "Illia Novikov",
      "description": "Ukrainian President Volodymyr Zelenskyy says a deal to end the war between Ukraine and Russia “is still very, very far away.\" He added that he believed Ukraine's long-term partnership with the U.S. was strong enough that American support would continue despite recent fraught relations with U.S. President Donald Trump. Zelenskyy said late Sunday that “I think our relationship (with the U.S.) will continue because it’s more than an occasional relationship.” He was referring to Washington’s support for the past three years of war. Zelenskyy publicly was upbeat despite recent diplomatic upheaval between Western countries that have been helping Ukraine with military hardware and financial aid.",
      "publishedAt": "2025-03-03T13:54:55Z",
      "title": "Ukraine's Zelenskyy says end of war with Russia is 'very, very far away'",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-b025877c40ffe0ddf2a92adad1715231",
      "urlToImage": "https://dims.apnews.com/dims4/default/79fc4f1/2147483647/strip/true/crop/3000x1688+0+36/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F74%2F00225feb73fcb788bd260f77e272%2Fa89e20fbd29f4d7ab88211f2b6bbb45d"
    },
    {
      "author": "Alex Turnbull, John Leicester",
      "description": "France’s prime minister has torn into U.S. President Donald Trump’s Oval Office thrashing of Ukrainian President Volodymyr Zelenskyy by calling it a staggering show of “brutality” that aimed to humiliate Ukraine's leader. The extraordinarily frank criticism from Prime Minister François Bayrou came in a parliamentary debate on Ukraine on Monday. His words diverged from the more nuanced tone that French President Emmanuel Macron has adopted in the wake of the clash at the White House on Friday and dropped the diplomatic niceties that customarily mark French-U.S. relations. Bayrou called it “a staggering scene” that was “marked by brutality” and “a desire to humiliate” Zelenskyy.",
      "publishedAt": "2025-03-03T17:02:49Z",
      "title": "France's prime minister tears into Trump's attack on Zelenskyy",
      "url": "https://apnews.com/article/trump-zelenskyy-france-bayrou-ukraine-oval-office-1b12c5024d0aad34bd4336ef931e51f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/66b5c02/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F32%2F195dded766fd39ec9be3febd866e%2F5f9cbe2997264a62901d3d005122cc3f"
    },
    {
      "author": "Joseph Krauss",
      "description": "Israel has introduced what it said was a new U.S. ceasefire plan and is trying to force Hamas to accept it by imposing a siege on the Gaza Strip. The plan is different from the one the two sides agreed to in January. Prime Minister Benjamin Netanyahu referred to it as the “Witkoff proposal.” He says it came from U.S. President Donald Trump’s Mideast envoy, Steve Witkoff. But the White House has yet to confirm that. Netanyahu’s remarks came a day after the first phase of the negotiated ceasefire ended, with no clarity on what would come next since the agreement’s second phase has not yet been hammered out. The new plan would require Hamas to release half its remaining hostages in exchange for a ceasefire extension and a promise to negotiate a lasting truce.",
      "publishedAt": "2025-03-03T12:37:41Z",
      "title": "With the Gaza ceasefire in limbo, Israel tries to impose an alternative plan on Hamas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-witkoff-plan-46a639d66772915ba1ed0b43cd2728d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce50b14/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F17%2F981bf2e68329a37c2755e63d770d%2F5196f5ca8373477f847eb1c55ef4f6db"
    },
    {
      "author": "Chris Megerian",
      "description": "Federal employees face a midnight deadline to comply with Elon Musk’s second demand for reports on their recent accomplishments. The request has become a flashpoint within the government workforce. Musk and President Donald Trump have suggested that employees who don’t comply could get fired. They’ve also described the requirement — a list of five things that each person did last week — as an unobjectionable way to increase accountability within a sprawling bureaucracy. But for many workers, it’s been a source of anxiety and confusion as the new administration tightens its grip on the federal government. Judging by instructions that have circulated in recent days, they’ll face a standing request for lists of accomplishments every Monday.",
      "publishedAt": "2025-03-03T19:27:40Z",
      "title": "Federal workers face second Musk deadline to explain their work last week",
      "url": "https://apnews.com/article/elon-musk-doge-emails-a3e7e9ab82f45bb15ef22bddab01f25e",
      "urlToImage": "https://dims.apnews.com/dims4/default/057b6cd/2147483647/strip/true/crop/5167x2906+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F15%2Fb3861ed8f5348549a1dd3ba62bf1%2Fc92bbd40198a41a0bd690c265f294b1f"
    },
    {
      "author": "Simina Mistreanu",
      "description": "China's leaders are overseeing a spell of deflation, or falling prices, that contrasts with inflationary pressures prevailing elsewhere in the world. While cheaper prices can be a blessing, deflation is a symptom of relatively weak demand and stalling economic growth. Falling housing prices have left many families reluctant to spend, while factories keep churning out goods. This has led to the country's longest deflationary streak since the 1960s. Deflation is an abstract economic concept but it reflects very concretely in family balance sheets. Economists say it may signal bigger trouble ahead, while rising tariffs on Chinese exports to the United States could dent demand, further aggravating the problem.",
      "publishedAt": "2025-03-04T03:04:02Z",
      "title": "Beijing's deflation dilemma: Falling prices signal bigger troubles ahead for China's economy",
      "url": "https://apnews.com/article/china-economy-deflation-housing-congress-36d116f4657aa3064882af9b2dd57b14",
      "urlToImage": "https://dims.apnews.com/dims4/default/8b16048/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2Fab%2F3f5275ae333e42a213a96060a8b7%2F8a8918df8a4c4d77836d7d06116e4358"
    },
    {
      "author": "Samya Kullab",
      "description": "Ukraine’s president has few options after last week’s astonishing Oval Office row with U.S. President Donald Trump, who berated the wartime leader. Now Ukraine’s future could depend on whether Volodymyr Zelenskyy can repair his relationship with the White House. The heated conversation that played out live on television looms over all American support for Ukraine and could shape the country’s war against the Russian invasion. The scene will almost certainly stick with Zelenskyy for the rest of his presidency, if not his life. American officials have said that they want an apology from Zelenskyy. He has maintained his cool in public appearances since the episode and leaned into European support.",
      "publishedAt": "2025-03-03T20:01:39Z",
      "title": "Without US help, Zelenskyy has few options except to repair his relationship with the White House",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-meeting-30be085063f4f6f3df242553402234f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e69b517/2147483647/strip/true/crop/3000x1688+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F8c%2F7e65d1240d29388e8372d6f5fa67%2F07755a3d2a3f425c842ffb2e5adafd88"
    },
    {
      "author": "Zeke Miller, Josh Boak, Rob Gillies",
      "description": "President Donald Trump says 25% tariffs on imports from Mexico and Canada will start Tuesday, sparking renewed fears of a North American trade war. He announced the coming tariffs at the White House on Monday. He says the tariffs are to force the two U.S. neighbors to step up their fight against fentanyl trafficking into the U.S. Trump provided a one-month delay in February as both countries promised concessions. But Trump said Monday that there was “no room left for Mexico or for Canada” to avoid the steep new tariffs. U.S. stock markets moved sharply lower after Trump’s comments. Trump said he would also add on another 10% tariff on goods from China, on top of the initial 10% he put in place last month.",
      "publishedAt": "2025-03-03T20:10:32Z",
      "title": "Trump says 25% tariffs on Mexican and Canadian imports will start Tuesday, with 'no room' for delay",
      "url": "https://apnews.com/article/trump-tariffs-mexico-canada-b19e004dddb579c373b247037e04424b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2de9ba8/2147483647/strip/true/crop/6967x3919+0+363/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fec%2F09d0b45270936209a512734bf7e3%2Fcfbaba9369854f78a2bfd7a4cc3f85d4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}