{
  "articles": [
    {
      "author": null,
      "description": "Israel’s military says it struck an Iranian nuclear research facility and killed three senior Iranian commanders in targeted attacks as the war between the two nations continued into a second week. Early Saturday, smoke could be seen rising from an area near a mountain in Isfahan, where a local official said Israel had attacked the nuclear research facility in two waves. Iran continued to launch drones and missiles at Israel but there were no immediate reports of significant damage. Israel says its military has been targeting Iran's missile launchers, and estimates it has now taken out more than 50% of them.",
      "publishedAt": "2025-06-21T04:11:21Z",
      "title": "Israel-Iran war enters its second week",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-talks-geneva-news-06-21-2025-a7b0cdaba28b5817467ccf712d214579",
      "urlToImage": "https://dims.apnews.com/dims4/default/83a82a6/2147483647/strip/true/crop/4937x2777+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fa9%2F94ad0d16be7d3247f1fa293b1998%2F7980de15e81647958dfe075fd8256edc"
    },
    {
      "author": null,
      "description": "The second week of the Israel-Iran war has started with a renewed round of strikes targeting an Iranian nuclear research facility near Isfahan. Talks in Geneva on Friday between European foreign ministers and Iran’s top diplomat failed to produce a breakthrough. U.S. President Donald Trump continues to weigh his country’s military involvement as concerns spiked over potential strikes on Iranian nuclear reactors. Still, European officials expressed hope for future negotiations. Iranian Foreign Minister Abbas Araghchi said he was open to further dialogue but stressed Tehran wasn’t interested in negotiating while Israel continued attacking.",
      "publishedAt": "2025-06-21T07:37:04Z",
      "title": "2nd week of Israel-Iran war starts with renewed strikes",
      "url": "https://apnews.com/article/israel-palestinians-iran-war-latest-06-21-2025-894a8cfb8bf2c1b717e0a955f22b91e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/83a82a6/2147483647/strip/true/crop/4937x2777+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fa9%2F94ad0d16be7d3247f1fa293b1998%2F7980de15e81647958dfe075fd8256edc"
    },
    {
      "author": null,
      "description": "Three people are dead and a regional airport was heavily damaged after powerful winds, including a tornado, swept across the upper Midwest. Cass County Sheriff Jesse Jahner said at a press conference Saturday that two men and a woman were killed at two separate locations in the town of Enderlin, North Dakota, late Friday. Enderlin is about 57 miles southwest of Fargo. Heavy winds also swept across localized areas of Minnesota. The National Weather Service in Grand Forks said a tornado hit a home just east of Enderlin and reported wind gusts of up to 106 mph at Bemidji Regional Airport overnight in Minnesota.",
      "publishedAt": "2025-06-21T13:12:56Z",
      "title": "At least 3 people dead after severe weather swept through rural town in North Dakota",
      "url": "https://apnews.com/article/north-dakota-tornado-deaths-08d9ce8cbea78a8b86d6a66040723814",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A hot-air balloon has caught fire and tumbled from the sky in Brazil’s southern state of Santa Catarina, killing eight people. Thirteen people survived and were taken to hospitals on Saturday. Santa Catarina’s military fire brigade said that 21 people were on board including the pilot. Footage shared by local news outlet G1 showed billows of smoke coming from the balloon in flames as it hurtled toward the ground in the municipality of Praia Grande.",
      "publishedAt": "2025-06-21T14:22:08Z",
      "title": "Brazil hot-air balloon crash kills 8 in Santa Catarina state",
      "url": "https://apnews.com/article/brazil-balloon-fall-49c10b909e0f430a22913f7dd13e2c23",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A Palestinian activist who participated in protests against Israel has been freed from federal immigration detention after 104 days. Mahmoud Khalil, who became a symbol of President Donald Trump’s clampdown on campus protests, left a federal facility in Louisiana on Friday. The former Columbia University graduate student is expected to head to New York to reunite with his U.S. citizen wife and infant son. The federal judge who ordered Khalil's release said it would be “highly, highly unusual” for the government to continue detaining a legal U.S. resident who was unlikely to flee and hadn’t been accused of any violence. The U.S. government said it would appeal the decision.",
      "publishedAt": "2025-06-21T14:26:16Z",
      "title": "What to know about activist Mahmoud Khalil and his release from immigration detention",
      "url": "https://apnews.com/article/mahmoud-khalil-release-columbia-protest-trump-immigration-e833add2d3ef085872c4e8751058450e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a8223b/2147483647/strip/true/crop/3339x1878+0+174/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fb4%2F75a777692d16c96263e754f19037%2Ffe5550ee4d2c4992960a6ad759086be8"
    },
    {
      "author": null,
      "description": "As the sun rose on the longest day of the year in the Northern Hemisphere, a crowd erupted in cheers at Stonehenge where the ancient monument in southern England has clocked the summer solstice over thousands of years. The orange ball crested the northeast horizon Saturday and shone its light into the center of one of the world’s most famous prehistoric monuments. The crowd gathered at the World Heritage Site before dawn, beating the sweltering conditions of the U.K.’s first amber heat-health alert issued since September 2023. Temperatures later hit 91 degrees Fahrenheit in Surrey, the hottest temperature recorded this year.",
      "publishedAt": "2025-06-21T16:01:16Z",
      "title": "Stonehenge solstice sunrise draws druids, pagans and revelers",
      "url": "https://apnews.com/article/summer-solstice-stonehenge-druid-britain-ritual-sunrise-c52d83f82a2d12fba0265e224e2323de",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f552c1/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F62%2F868d8340aa0929f4045ee4233572%2Fc4f8e859d7084f9ab120de33d1fc7da6"
    },
    {
      "author": null,
      "description": "A British-flagged luxury superyacht that sank off Sicily last year, killing U.K. tech magnate Mike Lynch and six others, was lifted fully out of the water on Saturday afternoon as salvage recovery crews completed the operation to bring it ashore for further investigation. The white top and blue hull of the 56-meter Bayesian, covered with algae and mud, was visible clear of the sea in a holding area of a yellow floating crane barge. The Bayesian sank Aug. 19 during a violent storm as Lynch was treating friends to a cruise to celebrate his acquittal two months earlier in the U.S. on fraud charges.",
      "publishedAt": "2025-06-21T14:57:57Z",
      "title": "Sunken Bayesian superyacht lifted out of the water off Sicily as salvage operate completes",
      "url": "https://apnews.com/article/bayesian-superyacht-italy-sunk-lynch-porticello-salvage-73cd71e1aa7dcf55455c18a366d814d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/1de79f0/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F06%2F389e2a9de5894163f64fc95b91e1%2F931da606ca3849a8a73507bc5be6427a"
    },
    {
      "author": null,
      "description": "A man accused of brandishing a rifle at a “No Kings” rally in Utah — prompting an armed safety volunteer to open fire and accidentally kill a protester — has been released from jail while the investigation continues. Salt Lake District Attorney Sim Gill’s office said Friday that it was unable to make a decision on criminal charges against 24-year-old Arturo Gamboa. He had been jailed on suspicion of murder following the June 14 shooting. Gamboa never fired a shot during the rally and it is generally legal to carry firearms in public in Utah.",
      "publishedAt": "2025-06-21T13:34:38Z",
      "title": "Man arrested after Utah 'No Kings' rally shooting is released as investigation continues",
      "url": "https://apnews.com/article/utah-no-kings-protest-shot-killed-9a4c02dd8eb22a9942c0401283fe750e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ccb9a3/2147483647/strip/true/crop/1920x1080+0+100/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fb5%2Fbe0b67e682265b5886b1375554c5%2F6764cc355fa447d18deec7e33749a7b1"
    },
    {
      "author": null,
      "description": "Belarus has freed Siarhei Tsikhanouski, a key dissident figure and the husband of exiled opposition leader Sviatlana Tsikhanouskaya, following a rare visit by a senior U.S. official. Tsikhanouski, a popular blogger and activist who was jailed ibn 2020, arrived in Vilnius, Lithuania, alongside 13 other political prisoners. The release came just hours after Belarusian authorities announced that authoritarian President Alexander Lukashenko met with U.S. President Donald Trump’s envoy for Ukraine, Keith Kellogg, in Minsk.",
      "publishedAt": "2025-06-21T14:12:39Z",
      "title": "Belarus frees opposition figure Tsikhanouski",
      "url": "https://apnews.com/article/belarus-crackdown-tsikhanouski-freed-da71d80a59dae78d5e8c1ebfcd4fc2e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/93d2836/2147483647/strip/true/crop/6162x3466+0+321/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Ff3%2Fc38930535ca3d51e5a51df4bfd03%2F7bae22c4aaa8499ba5a615b5e9580809"
    },
    {
      "author": null,
      "description": "Ukraine's president says Russia repatriated at least 20 of its own dead soldiers in recent exchanges with Ukraine, describing it as a result of Moscow’s disorganization. Volodymyr Zelenskyy said that an Israeli citizen was also among the dead Ukraine received in recent exchanges. He said the Russian side insisted the dead were all Ukrainians. The exchanges of the dead and wounded soldiers are the only tangible result of direct peace talks in Istanbul in June. Zelenskyy told reporters on Friday that he wasn't sure if Ukraine would attend the next round of talks.",
      "publishedAt": "2025-06-21T13:10:23Z",
      "title": "Ukraine received at least 20 bodies of Russian soldiers in recent exchanges, Zelenskyy says",
      "url": "https://apnews.com/article/russia-ukraine-war-dead-soldiers-zelenskyy-3fe949eb4f050e6ef53b8eae7da0ef6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca322ed/2147483647/strip/true/crop/4014x2258+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fed%2F27eafeac5a85f118f5d8be26f818%2F3d302d73f8f544df87e68a30e64cac8f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}