{
  "articles": [
    {
      "author": "JOSH BOAK and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Joe Biden faced a test Thursday that he had avoided so far this year — a solo news conference with questions from the White House press corps.",
      "publishedAt": "2024-07-12T00:55:46Z",
      "title": "Key takeaways from Biden's news conference: Insistence on staying in the race and flubbed names",
      "url": "https://apnews.com/0d9f4936484ff71295e2b088e5c525dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcdcf2c1fc7f4092bf12de3ce8f9b62e/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Joe Biden's tribulations were previewed in Hollywood days before he got on the debate stage.",
      "publishedAt": "2024-07-12T04:33:19Z",
      "title": "Two weeks that imperiled Biden's presidency left him on probation in the court of Democratic opinion",
      "url": "https://apnews.com/2c426f98063ab30143a7675cba10a5b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bee2913342fc4de7b9fcc99ca1341627/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Toward the end of his closely watched news conference Thursday night on the sidelines of the NATO summit, President Joe Biden was talking about being examined by doctors for his mental acuity.",
      "publishedAt": "2024-07-12T02:19:39Z",
      "title": "Biden's challenge: Will he ever satisfy the media's appetite for questions about his ability?",
      "url": "https://apnews.com/9ad030c57977e2a9bdbc2dfa82b5e0a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc99389388444bd1802dabe52ecd428f/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — NATO leaders met this week to celebrate the alliance’s 75th anniversary under the cloud of deep political uncertainty in its most powerful member — the United States. But even as questions swirled about President Joe Biden’s future and the implications of a possible return to the White House by NATO skeptic Donald Trump, the 32 allies put a brave face on their strength and unity going forward, particularly in relation to Ukraine.",
      "publishedAt": "2024-07-12T04:57:11Z",
      "title": "The NATO summit was about Ukraine and Biden. Here are some key things to know",
      "url": "https://apnews.com/d9f2b83dc0956d75f6f75efe85cbefb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1cbb848c97240c2b470cc5f1a49e675/1920.jpeg"
    },
    {
      "author": null,
      "description": "SHIJAIYAH, Gaza Strip (AP) — Palestinians returned to breathtaking scenes of destruction in the Gaza City district of Shijaiyah after Israeli troops withdrew, ending a two-week offensive there. Civil defense workers said Thursday that so far, they had found the bodies of 60 people in the rubble.",
      "publishedAt": "2024-07-11T22:24:40Z",
      "title": "'We have nothing': Palestinians return to utter destruction in Gaza City after Israeli withdrawal",
      "url": "https://apnews.com/6bd730f8c5638e3f1981b91a7b8ab32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9a63b4f195f482e898ff21a5a1f7ac9/1763.jpeg"
    },
    {
      "author": "BINAJ GURUBCHARYA",
      "description": "KATHMANDU, Nepal (AP) — At least 60 people were believed missing in Nepal after two buses were swept by a landslide off a highway and into a swollen river early Friday. Three passengers were rescued as the continuous rain made rescue efforts difficult.",
      "publishedAt": "2024-07-12T03:10:18Z",
      "title": "2 buses carrying at least 60 people swept into a river by a landslide in Nepal. 3 survivors found",
      "url": "https://apnews.com/d137967a9a0975f45cf8ff75f812fed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4edfafb78994b6cb05896063545aed1/2800.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "For all the usual stagecraft, the Republican National Convention that opens Monday is different from Donald Trump's previous nominating affairs.",
      "publishedAt": "2024-07-12T05:03:32Z",
      "title": "Republicans are gathering in Milwaukee to nominate Donald Trump again. Here's what to expect",
      "url": "https://apnews.com/702139084873df3d633ee19d1b82e5f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c96ea90a852441e5aa250170e36bdc7b/3000.jpeg"
    },
    {
      "author": "JORGE RUEDA",
      "description": "CARACAS, Venezuela (AP) — His smile is confident, his hair well-combed and his eyes are squinting slightly: The first candidate you'll likely see on the ballot in Venezuela's upcoming presidential election is Nicolás Maduro, the incumbent seeking reelection.",
      "publishedAt": "2024-07-12T04:23:50Z",
      "title": "Why Nicolás Maduro appears 13 times on the ballot for Venezuela's presidential election",
      "url": "https://apnews.com/195ae6a6db441f8759a28b6694355c81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb05d832ef214ca88ae2cc4cbb9630d7/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — Relatively few Americans fully endorse the idea that a fertilized egg should have the same rights as a pregnant woman. But a significant share say it describes their views at least somewhat well, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-07-12T04:12:43Z",
      "title": "More than 6 in 10 U.S. adults support protecting access to IVF, AP-NORC poll finds",
      "url": "https://apnews.com/3adcb634d5d99d9ebfcc7a28530b1487",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7531cb555c964167ae75ffda073f6017/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — The lead detective in the shooting of cinematographer Halyna Hutchins on the set of the film “Rust” is likely to be on the stand for most of Friday at Alec Baldwin 's involuntary manslaughter trial in New Mexico, as prosecutors try to cast the movie star as a reckless cavalier with a gun in his hand and the defense seeks to portray him as a working actor just doing his job.",
      "publishedAt": "2024-07-12T04:01:37Z",
      "title": "Lead detective in Alec Baldwin case to testify, convicted armorer may be called in ‘Rust’ trial",
      "url": "https://apnews.com/eb3059c696a9aee5cb86967e27d8f3bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62a517d6fd3e45b9b64698b1593caf72/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}