{
  "articles": [
    {
      "author": "MARK SHERMAN, LINDSAY WHITEHURST",
      "description": "The Trump administration wants the Supreme Court to permit the firing of the head of the federal agency dedicated to protecting whistleblowers. That's according to documents obtained Sunday that would mark the first appeal to the justices since President Donald Trump took office. The emergency appeal is the start of what probably will be a steady stream seeking to undo lower court rulings that have slowed his second term agenda. The Justice Department’s filing obtained by The Associated Press asks the conservative-majority court to lift a judge’s order temporarily reinstating Hampton Dellinger as the leader of the Office of Special Counsel.",
      "publishedAt": "2025-02-16T19:49:54Z",
      "title": "Trump admin wants SCOTUS to permit firing of whistleblower agency head",
      "url": "https://apnews.com/article/supreme-court-trump-administration-f2455731efaf92678940bf11c63f7fe8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ace6dd/2147483647/strip/true/crop/4389x2469+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fb1%2F504fbb01ccb1125805e75682124c%2F66e3e0152dc6453c91d24a4f5e78e771"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "The Trump administration’s effort to slash the size of the federal workforce reached the Food and Drug Administration this weekend. Three FDA staffers who spoke to The Associated Press on condition of anonymity because they were not authorized to discuss the layoffs publicly say probationary employees received notices Saturday evening that they were being let go. The jobs were across the FDA, including reviewing the safety of food ingredients, medical devices and tobacco products like electronic cigarettes. The total number of positions eliminated was not clear Sunday. On Friday, the U.S. Department of Health and Human Services said it would fire 5,200 probationary employees across its agencies.",
      "publishedAt": "2025-02-16T18:01:14Z",
      "title": "FDA employees in food safety, medical devices, more are fired",
      "url": "https://apnews.com/article/fda-job-cuts-trump-hhs-kennedy-cdc-nih-76dee97eee8209b2605fadac34427aab",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4160d7/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F73%2F9a884cfc70d95c8e633ea3aa8392%2F029fe8a79f40481093ce316dddf649e8"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "Pam Bondi had insisted at her Senate confirmation hearing that as attorney general, her Justice Department would not “play politics.” Yet in the month since the Trump administration took over, a succession of actions has raised concerns the department is doing exactly that. The moves have generated great upheaval and tested the department's independence. Recent firings and resignations have rattled the foundations of an institution that's prided itself on being driven solely by facts, evidence and the law. A retired federal prosecutor says some of the decisions have all the signs “of corrupting the criminal justice system.\"",
      "publishedAt": "2025-02-16T12:40:39Z",
      "title": "How the Justice Department's independence is being threatened",
      "url": "https://apnews.com/article/fbi-justice-department-trump-bondi-bove-adams-a003af9d9aebe89cd289361a65c9401b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e2cfdf1/2147483647/strip/true/crop/3881x2183+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F2f%2F2e9a213014668290f9474f6a76ae%2F28357a9c446f4f6eac592d061569bb9a"
    },
    {
      "author": "WILL WEISSERT, JOSH BOAK, LINDSAY WHITEHURST",
      "description": "It's been nearly a month in office for President Donald Trump, and he's acted with dizzying speed to reorder the American economy and global diplomacy. In the early going, he's empowered Elon Musk to help force the firing of thousands of federal employees and potentially shutter entire agencies. The new president has imposed tariffs, wiped out diversity programs and rolled back transgender rights. His administration has begun an immigration crackdown that's been overshadowed by so many other steps. At the same time, the economy is beginning to soften, judges are having their say and even some Republicans in Congress are starting to grumble.",
      "publishedAt": "2025-02-15T14:09:09Z",
      "title": "The warning signs in Trump's first month",
      "url": "https://apnews.com/article/trump-firings-tariffs-lawsuits-economy-ukraine-putin-19b79f62ad7c9d51cfb1f0551953051e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df4944b/2147483647/strip/true/crop/4055x2281+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F83%2F88411ff1ab76f00bc8258914eb47%2Ff8b2326f236d4c9d862204fe58bdc267"
    },
    {
      "author": "DYLAN LOVAN",
      "description": "Heavy rains and dangerous flooding have struck the Southeast U.S. as much of the East endured a renewed round of harsh, soggy weather, with at least one fatality reported in Kentucky. Water has submerged cars and buildings in Kentucky and mudslides have blocked roads in Virginia. Both of the states were under flood warnings, along with Tennessee and Arkansas. The National Weather Service has warned residents to stay off the roads. Forecasters also have predicted weekend snowstorms in the Northeast and the threat of tornadoes for the Mississippi Valley. Heavy snow is expected to blanket much of New England. Meteorologists are also warning the U.S. could get its coldest polar vortex stretching event this season in the northern Rockies and northern Plains.",
      "publishedAt": "2025-02-15T16:37:32Z",
      "title": "Eastern US endures a renewed round of harsh, soggy weather",
      "url": "https://apnews.com/article/rain-snow-flooding-0c4ddcf08eba65e62f9c070f59947457",
      "urlToImage": "https://dims.apnews.com/dims4/default/01d3f94/2147483647/strip/true/crop/1668x938+0+87/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F01%2Fc1cc669c381e471bb4f255092eda%2F2a1286cdd1884ca182833dddaa1f3073"
    },
    {
      "author": "MAKIYA SEMINERA",
      "description": "President Donald Trump's suggestion about “getting rid of” the nation's disaster relief agency doesn't sound like a bad idea for some residents of western North Carolina who are still navigating the long recovery process from Hurricane Helene. Frustrations over the flow of aid has led some North Carolinians to express support for the agency's elimination. But some experts and officials warn that disbanding the Federal Emergency Management Agency could mean a slower recovery process and strain local resources. Experts also say there may be some misconceptions about the role that FEMA is supposed to play in disaster response.",
      "publishedAt": "2025-02-16T13:29:08Z",
      "title": "Some in North Carolina embrace Trump's push to abolish FEMA",
      "url": "https://apnews.com/article/hurricane-helene-fema-north-carolina-trump-disasters-2b22a4943f4621d8704108d71e1386d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/066f33a/2147483647/strip/true/crop/3888x2187+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Fce%2F78fabbb3615aa4d06ef9f9470b0d%2F87ccc7a304ef405fa5ec2f94af419a0c"
    },
    {
      "author": "SARAH PARVINI",
      "description": "President Donald Trump has threatened tariffs on semiconductors, arguing that production must be returned to the United States. But the president has also criticized a sweeping Biden-era law designed to revive domestic semiconductor manufacturing by providing billions for computer chips and scientific research. Trump has called the federal contracts made with the help of the CHIPS and Science Act “ridiculous,” signaling that he doesn’t support the program. Experts warn that type of policy would harm consumers and hamstring the U.S. competitive edge in developing chips.",
      "publishedAt": "2025-02-16T15:40:21Z",
      "title": "CHIPS Act: What changes could mean for AI growth, consumers",
      "url": "https://apnews.com/article/trump-semiconductors-chips-act-3592f1ed8b8cd4f2145cfa8a4985046c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9041ca/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F7d%2F87ca738e493e7fa53032f80276f7%2F233ce90d4b7c4c19937953b95b466479"
    },
    {
      "author": "AAMER MADHANI, MEG KINNARD",
      "description": "President Donald Trump’s approach to ending Russia’s war against Ukraine has left European allies and Ukrainian officials worried they're being largely sidelined by the new U.S. administration as Washington and Moscow plan direct negotiations. With the three-year war grinding on, Trump is sending Secretary of State Marco Rubio, national security adviser Mike Waltz and special envoy Steve Witkoff to Saudi Arabia for talks with Russian counterparts. That's according to a U.S. official who wasn't authorized to publicly discuss the upcoming diplomatic efforts and spoke on condition of anonymity. It's unclear whether Ukraine or European officials will be represented in upcoming discussions. Who ultimately ends up at the table could change.",
      "publishedAt": "2025-02-16T21:13:33Z",
      "title": "Ukraine and Europe worry about being sidelined as Trump pushes direct talks with Russia on war's end",
      "url": "https://apnews.com/article/trump-ukraine-russia-war-putin-zelenskyy-europe-7940f9c5828fc46431928bc073170bc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    },
    {
      "author": null,
      "description": "A Ukrainian minister says that an official delegation has arrived in Saudi Arabia for meetings in preparation for a possible visit by President Volodymyr Zelenskyy. The comments by Ukraine's economy minister on Sunday came at a time of intense speculation over planned U.S.-Russia talks in the country to end Moscow's war on its neighbor. And as a top U.S. envoy revealed that he and a fellow negotiator appointed by President Donald Trump were heading there. Trump earlier this week jettisoned three years of U.S. policy and announced he would likely meet soon with Russian President Vladimir Putin to negotiate a deal to end almost three years of fighting.",
      "publishedAt": "2025-02-16T17:29:44Z",
      "title": "US, Ukrainian officials head to Saudi Arabia as talks loom on ending Russia's war",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-talks-negotiations-saudi-51b77cdf699f13ad16cb00bbf371b840",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ae3b90/2147483647/strip/true/crop/3371x1896+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F31%2F4665026ba62b31004a1141ee4f2f%2Fd1437193bdcf4480abc28e41e4008e80"
    },
    {
      "author": "MATTHEW LEE",
      "description": "Secretary of State Marco Rubio is kicking of a Mideast tour in Israel on Sunday. Arab leaders are reeling from President Donald Trump’s proposal to transfer the Palestinian population of the Gaza Strip to other countries and redevelop it under U.S. ownership. On Rubio’s first visit to the region as America’s top diplomat he is likely to get a warm welcome from Israeli Prime Minister Benjamin Netanyahu, who has praised the plan, and pushback from Arab leaders, who have universally rejected it and are scrambling to come up with a counterproposal.",
      "publishedAt": "2025-02-16T06:54:13Z",
      "title": "Rubio kicks off Mideast trip in Israel",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-15-2025-1cf8b3cb7622489c368c610f85e51e35",
      "urlToImage": "https://dims.apnews.com/dims4/default/119d528/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F4b%2F3b55dabfecde87612933bf238fa9%2F2dd0394819f44fec9bb7e62f5ace0555"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}