{
  "articles": [
    {
      "author": null,
      "description": "Health officials in Gaza say Israeli strikes have killed at least 34 Palestinians. The bloodshed comes a day after Israel eased aid restrictions due to a worsening humanitarian crisis. On Sunday, Israel announced a pause in military operations in certain areas for 10 hours daily to improve aid flow. Despite these measures, Israel continues military operations outside the pause timeframe. Aid agencies welcomed the new measures but say they are insufficient. Images of emaciated children have sparked global outrage. Most of Gaza's population now relies on aid and accessing food has become increasingly dangerous.",
      "publishedAt": "2025-07-28T09:01:28Z",
      "title": "Israeli strikes in Gaza kill at least 34 people as some aid restrictions are eased",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-28-2025-7586cb243643b9a875f87624277127b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef65979/2147483647/strip/true/crop/3916x2203+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fd7%2Fb5304ad9ad45e009cf92dd6d990a%2F3f92071cce3b41a5a579f0cf915b65f4"
    },
    {
      "author": null,
      "description": "President Donald Trump has expressed concern over the humanitarian crisis in Gaza, urging Israel to ensure food reaches the people there. Speaking in Scotland on Monday, Trump emphasized the need for action as images of starving children have sparked international outcry. Trump noted that the U.S. and other nations are providing aid, but stressed that Israeli Prime Minister Benjamin Netanyahu must manage its distribution. His remarks mark a shift from his earlier stance on the ongoing Israel-Hamas conflict. Trump also mentioned plans for the U.S. to set up food centers, though details remain unclear.",
      "publishedAt": "2025-07-28T15:14:09Z",
      "title": "Trump wants Netanyahu to 'make sure they get the food' in Gaza",
      "url": "https://apnews.com/article/trump-gaza-israel-netanyahu-ad726ad46bce50cf1e023f50a37e5b3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/78b30f3/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F9c%2Fc20f0c867341d2ffffa3555af8fd%2Fd332ece1def34e02bf31cdc6ab157745"
    },
    {
      "author": null,
      "description": "Police in Nevada say a gunman opened fire just outside a casino and resort in Reno and shot multiple people. The conditions of the victims were not immediately known. Reno police spokesperson Chris Johnson said the gunman was taken into custody Monday and was being treated at a hospital. Johnson says the shooting was reported around 7:30 a.m. Monday outside the casino in the valet area. Reno police warned residents to stay out of the vicinity. Multiple emergency vehicles, including several ambulances, responded outside the casino.",
      "publishedAt": "2025-07-28T16:00:03Z",
      "title": "Multiple injuries reported in Reno Grand Sierra Resort shooting and suspect is in custody",
      "url": "https://apnews.com/article/reno-nevada-grand-sierra-resort-shooting-e8892d51ec4dd2d61b507012773a8c4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/93d0468/2147483647/strip/true/crop/2000x1125+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F6b%2Fb5be04bea301db0e35cfa87ef398%2F81ec8d5d53ec4a7da2e22ebf6261a5bb"
    },
    {
      "author": null,
      "description": "Michigan authorities say 11 people have been stabbed at a Walmart in Traverse City. Authorities say a suspect is in custody and that investigators believe those hurt Saturday were not specifically targeted. The Grand Traverse County Sheriff's Office says that around 4:45 p.m., a 42-year-old man entered the store and used a folding knife to stab 11 people. The sheriff's office says a deputy arrived within minutes and took the man into custody. It also says that people in the store helped apprehend the suspect and treat victims. Munson Healthcare said six of the victims were in critical condition and five in serious condition.",
      "publishedAt": "2025-07-27T12:09:04Z",
      "title": "A man accused of stabbing 11 people at a Walmart is in Michigan authorities' custody",
      "url": "https://apnews.com/article/walmart-stabbing-michigan-341fb14f1bc715243b3780a3d7eabda0",
      "urlToImage": "https://dims.apnews.com/dims4/default/91d2d9c/2147483647/strip/true/crop/6681x3758+0+348/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F31%2F5097567d01dc15766bae541376a1%2F356cab7c940a42539bc931d4b61f16fe"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump says he intends to shorten the 50-day deadline he gave Russian President Vladimir Putin to reach a deal that ends the three-year war in Ukraine. His announcement Monday came as the Ukrainian air force said Russia fired another overnight barrage at Ukraine. Trump said two weeks ago he would implement “severe tariffs” on Russia unless a peace deal is reached by early September. Trump said he would give Putin 10 to 12 days from Monday instead. That means he wants peace efforts to make progress by Aug. 7-9. The plan includes possible sanctions and secondary tariffs targeting Russia’s trading partners.",
      "publishedAt": "2025-07-28T13:53:52Z",
      "title": "Trump says he's shortening the 50-day deadline for Russia to end the war in Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-trump-putin-deadline-ultimatum-0e4cfb5969be5d02217be90f7521ce48",
      "urlToImage": "https://dims.apnews.com/dims4/default/3cf9e95/2147483647/strip/true/crop/5326x2996+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fbb%2F0f3923766dccf03507b15ffbe8e2%2F27fde300cb474bf28b093842ea27846f"
    },
    {
      "author": null,
      "description": "The European Union's trade agreement with the Trump administration is receiving mixed reviews. EU officials claim they avoided a major economic disaster, but French officials argue the EU didn't leverage its full strength. The deal imposes a 15% tariff on most goods imported into the U.S., with no agreement on key areas like pharmaceuticals and steel. French officials criticize the deal as unbalanced, while Germany and Italy see it as avoiding unnecessary escalation. Hungarian Prime Minister Viktor Orbán calls it a failure for Europe. Economists warn the deal could hinder growth and lacks clarity.",
      "publishedAt": "2025-07-28T16:02:37Z",
      "title": "Trump tariff deal leaves Europe dismayed but relieved",
      "url": "https://apnews.com/article/tariff-trump-eu-france-hungary-trade-war-9e3e62fa774811963e155a7f24627ce3",
      "urlToImage": "https://dims.apnews.com/dims4/default/34ff376/2147483647/strip/true/crop/3273x1841+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F3f%2F91f0453f378e211d1a0c8bc0a12e%2Ff87f1fabe168444c88fb43a61e8b2136"
    },
    {
      "author": null,
      "description": "Thai and Cambodian leaders are meeting in Malaysia to resolve deadly border clashes. The fighting, which began last Thursday after a land mine explosion injured Thai soldiers, has killed at least 35 people and displaced over 260,000 people. Both countries have recalled their ambassadors, and Thailand has closed border crossings with Cambodia. The meeting Monday follows direct pressure from U.S. President Donald Trump, who has warned the United States may not proceed with trade deals with either country if hostilities continue. Before departing for Kuala Lumpur, Thailand's acting prime minister said the key focus would be on an immediate ceasefire, but noted trust could be an issue.",
      "publishedAt": "2025-07-28T05:11:54Z",
      "title": "Thai and Cambodian leaders hold ceasefire talks in Malaysia",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-ceasefire-talks-6d8cc517df1be1ad0bf911fe1c81c765",
      "urlToImage": "https://dims.apnews.com/dims4/default/84ccd74/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F86%2Feec0aead47d30cb3f4a989dc4bcb%2F764bc5e56e414855af69fd744335f2d1"
    },
    {
      "author": null,
      "description": "Lawyers seeking a temporary restraining order against an immigration detention center in the Florida Everglades say that “Alligator Alcatraz” detainees have been barred from meeting attorneys. They also say that the detainees are being held without any charges and that federal immigration courts have canceled bond hearings. A virtual hearing in federal court in Miami was being held Monday on the lawsuit. Critics have condemned the facility as a cruel and inhumane threat to the ecologically sensitive wetlands, while Florida Gov. Ron DeSantis and other Republican state officials have defended it as part of the state’s aggressive push to support President Donald Trump’s crackdown on illegal immigration.",
      "publishedAt": "2025-07-28T14:52:11Z",
      "title": "Attorneys: 'Alligator Alcatraz' detainees held without charges, barred from legal access",
      "url": "https://apnews.com/article/florida-immigration-alligator-alcatraz-8607894cc7bab9c17bce30fdf541f0bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/936c00b/2147483647/strip/true/crop/5200x2925+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F24%2F3efc5ed46c9f9e5e55d2e70557e7%2F5240e3e2a6dd4758be381b5259c256cc"
    },
    {
      "author": null,
      "description": "British Prime Minister Keir Starmer is meeting with President Donald Trump at his family's golf property in Scotland. During Monday's talks, Starmer plans to urge Trump to press Israel to allow more aid into Gaza amid an increasingly desperate humanitarian crisis there. He'll also push for a ceasefire in the Israel-Hamas war. Trump has been more focused on the U.S. getting credit for arragning food aid to Gaza. Starmer is further aiming to promote peace efforts in Russia’s war with Ukraine. Trade issues are likely to be a common ground. Despite ongoing challenges, Starmer's efforts to maintain a positive relationship with Trump seem to be working.",
      "publishedAt": "2025-07-28T04:01:44Z",
      "title": "As Trump shows off his golf courses for Britain's leader, crisis in Gaza looms",
      "url": "https://apnews.com/article/trump-scotland-starmer-golf-course-trade-cf9ebbfb9cb2614ec59f0de67d3fd5fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8c8dd6/2147483647/strip/true/crop/8011x4506+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F51%2Fa3306dadca9c0ab1fc3df1e44fcc%2Ff96d4403176e4dc79683c0a7d8730704"
    },
    {
      "author": null,
      "description": "Colorado coach Deion Sanders says he was diagnosed with an aggressive form of bladder cancer but after surgery his oncologist considered him cured. Dr. Janet Kukreja, the director of urologic oncology at the CU Cancer Center/UCHealth University of Colorado hospital, said Sanders had his bladder removed as part of the surgical plan. Sanders plans to oversee the Buffaloes this season as he enters his third season at Colorado. Sanders, who turns 58 next month, spoke to the media on the eve of fall camp. He brought his medical team with him to discuss his diagnosis.",
      "publishedAt": "2025-07-28T17:15:31Z",
      "title": "Deion Sanders says he had bladder cancer but will coach Colorado Buffaloes this season",
      "url": "https://apnews.com/article/deion-sanders-colorado-health-ee452356a49070b49ae1ccd4d151b7cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/6357d25/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F1d%2F94298852f7634fd5cfb605779f52%2Feeec30caa79842048f1ff436ae5a74c8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}