{
  "articles": [
    {
      "author": null,
      "description": "The Press Trust of India reports a plane has crashed Thursday in India’s northwestern Ahmedabad city. Visuals on local television channels have shown smoke billowing from the crash site near the airport in Ahmedabad. There has been no official confirmation yet of the crash.",
      "publishedAt": "2025-06-12T08:50:47Z",
      "title": "A plane has crashed in India’s northwestern Ahmedabad city, Press Trust of India reports",
      "url": "https://apnews.com/article/india-plane-crash-cad8dad5cd0e92795b03d357404af5f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "President Donald Trump’s use of troops to help carry out intensified immigration raids faces its biggest challenge yet on Thursday. That’s when a federal judge is set to weigh a request from California Gov. Gavin Newsom to put an emergency stop to the practice. Newsom has warned that the military intervention is part of a broader effort by Trump to overturn norms at the heart of the nation’s democracy. He also said that sending National Guard troops on the raids has further inflamed tensions in Los Angeles, where large and sometimes volatile protests have broken out since the crackdown began nearly a week ago. The Trump administration called the lawsuit a political stunt.",
      "publishedAt": "2025-06-12T04:44:15Z",
      "title": "Trump administration's use of troops to help with immigration raids faces test in court",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-1009eac191a8f6248463a5028cbe0f68",
      "urlToImage": "https://dims.apnews.com/dims4/default/31fa0a8/2147483647/strip/true/crop/5802x3264+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F28%2F7c90482fd12aecb2cf1990fb9867%2F914041fc133045e5b16b640c05a1bcb1"
    },
    {
      "author": null,
      "description": "Texas Gov. Greg Abbott says he has ordered the deployment of more than 5,000 Texas National Guard troops across the state, along with more than 2,000 state police. Abbott said Thursday the troops and state police will help local law enforcement manage protests against President Donald Trump and ongoing federal immigration raids. Abbott's statement does not detail where the guard troops have been sent. Some were seen at a protest Wednesday night in downtown San Antonio. More protests are planned for Saturday in cities such as Houston, Austin and Dallas as part of the national “No Kings” movement.",
      "publishedAt": "2025-06-12T16:06:07Z",
      "title": "Texas governor deploys National Guard to help control protests against immigration crackdown",
      "url": "https://apnews.com/article/immigration-protests-texas-national-guard-4f8ffc07788515c0d0e7ae40c7980565",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c4ede6/2147483647/strip/true/crop/5557x3126+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F6a%2F84a802c16c1ecc5feb1f5fd31439%2F4760f38e41d14294baf19f9254e4b452"
    },
    {
      "author": null,
      "description": "President Donald Trump says an Israeli attack on Iran over Tehran’s nuclear program is not imminent but “could very well happen.” Trump on Thursday also told reporters that he remains concerned a “massive conflict” could occur in the Middle East if Iran does not negotiate a deal, but that he continues to urge Tehran to make a deal.",
      "publishedAt": "2025-06-12T08:16:12Z",
      "title": "Iran announces a new nuclear enrichment site after UN watchdog censure",
      "url": "https://apnews.com/article/iran-nuclear-iaea-sanctions-728b811da537abe942682e13a82ff8bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8a23ea/2147483647/strip/true/crop/5540x3116+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F2d%2F965f260492c714e3ac37e16b270c%2F8738fbf88d464f98a0ab9eb9c19e5e2e"
    },
    {
      "author": null,
      "description": "The House has voted to cut about $9.4 billion in spending as President Donald Trump’s administration looks to follow through on work done by the Department of Government Efficiency when it was overseen by Elon Musk. The package narrowly passed Thursday targets foreign aid programs and the Corporation for Public Broadcasting, which provides money for National Public Radio and the Public Broadcasting Service as well as thousands of public radio and television stations around the country. The vote was 214-212. Republicans are characterizing the spending as wasteful and unnecessary, but Democrats say the rescissions are hurting the United States’ standing around the world.",
      "publishedAt": "2025-06-12T10:37:27Z",
      "title": "House approves Trump's request to cut funding for NPR, PBS, foreign aid",
      "url": "https://apnews.com/article/trump-budget-cuts-npr-pbs-global-health-2844a884091dce5255a3f4ad70f3a1c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e86601/2147483647/strip/true/crop/4115x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F35%2Feed60f6aa845bfce05e8478fcea1%2Fa9b8bb2bc40a4b6a91fd0d5f84e803b8"
    },
    {
      "author": null,
      "description": "The judge in Harvey Weinstein’s sex crimes case declared a mistrial on the remaining rape charge after the jury foreperson said he wouldn’t continue deliberating. The decision to end deliberations Thursday came a day after the jury delivered a partial verdict. The foreperson complained Wednesday that he felt bullied by another juror and said Thursday he wouldn’t go back into the jury room. The panel convicted the ex-studio boss of one of the top charges but acquitted him of another. Both of those charges concerned accusations of forcing oral sex on women in 2006. Those verdicts still stand. The jury got stuck on a third charge. It was a rape accusation dating to 2013.",
      "publishedAt": "2025-06-12T04:09:04Z",
      "title": "Weinstein case judge declares mistrial on remaining rape charge as jury foreperson won’t deliberate",
      "url": "https://apnews.com/article/harvey-weinstein-sexual-assault-retrial-metoo-c45fa63cb6102766944dca9ee2f93878",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a11102/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F23%2F9bbd7aede5e081920e6a9b1673b0%2F396071145eb2493a90a48e7d3f858840"
    },
    {
      "author": null,
      "description": "A lawyer for Sean “Diddy” Combs is protesting the rising tide of secrecy at the hip-hop icon's sex trafficking and racketeering conspiracy trial after Combs and the public were excluded from lengthy legal arguments. Attorney Marc Agnifilo complained to Judge Arun Subramanian after Combs was left out of an hour-long robing room meeting Thursday, delaying testimony by a key witness by nearly two hours. Agnifilo said the need for a public trial was “an important issue, a constitutional issue” and objected to so much happening out of the earshot of his client. Combs has pleaded not guilty to sex trafficking charges.",
      "publishedAt": "2025-06-12T20:21:48Z",
      "title": "Sean 'Diddy' Combs' lawyer complains about trial secrecy as a famous rapper's name goes unmentioned",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-6e3fe9e45247979532cc3ebb0805dfcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "At least four people are dead in San Antonio after heavy rains flooded highways and stranded motorists. Fire officials said they are still searching Thursday for two people who are missing. Crews made dozens of water rescues after heavy rains flooded highways and stranded motorists. San Antonio police say calls for water rescues began shortly before sunrise. A spokesman for the fire department says it has made 65 water rescues since midnight throughout the San Antonio area. A National Weather Service meteorologist says the flooding occurred after a round of slow-moving showers and thunderstorms during the early morning hours Thursday.",
      "publishedAt": "2025-06-12T15:32:53Z",
      "title": "San Antonio floods leave 4 dead, 2 missing after heavy rain",
      "url": "https://apnews.com/article/severe-texas-san-antonio-deaths-rain-ee0e33396168265aaa328e28185fd976",
      "urlToImage": "https://dims.apnews.com/dims4/default/057f283/2147483647/strip/true/crop/3286x1848+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F2c%2F297454feac7f1589ece443f10da2%2Fdba14e78d26049da8aa30f9d4eda42d9"
    },
    {
      "author": null,
      "description": "A government minister says the death toll in floods in South Africa’s Eastern Cape province has risen to 57. Cooperative Governance and Traditional Affairs Minister Velenkosini Hlabisa is leading a government delegation visiting the scene of the disaster. Rescue teams had earlier Thursday begun a third day of searching for missing people. The missing had included four high school students who were swept away when their bus was caught up in the floods. Six students who were on the bus were confirmed dead. The floods hit the province early Tuesday after an extreme cold front brought heavy rain, strong winds and snow to parts of eastern and southern South Africa.",
      "publishedAt": "2025-06-12T07:49:48Z",
      "title": "Rescuers in South Africa search for the missing after floods, death toll rises to 57",
      "url": "https://apnews.com/article/south-africa-floods-eastern-cape-mthatha-weather-0735ea4ee61113cdfa83fe44f41ed7b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfb3f6a/2147483647/strip/true/crop/5643x3174+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F72%2F0cebecd2b312af41036812e3236d%2F42025c8a5a2e4014a7d147f6329df747"
    },
    {
      "author": null,
      "description": "Paul McCartney, Mike Love, Carnie Wilson, Elton John and more celebrities are sharing their sorrow on the death of Brian Wilson. The visionary leader of the Beach Boys was 82. Wilson’s family posted news of his death to his website and social media accounts Wednesday. Carnie Wilson, Wilson's daughter, said - in her words - “I've never felt this kind of pain before.” Fellow Beach Boy Love acknowledged his ups and down with Wilson, his cousin. But he said through it all, the love never stopped. John called Wilson the biggest influence on his songwriting. Ever. McCartney called Wilson's songs simple and brilliant, at the same time.",
      "publishedAt": "2025-06-11T19:03:01Z",
      "title": "Brian Wilson death: Stars pay tribute to legendary Beach Boys leader",
      "url": "https://apnews.com/article/brian-wilson-death-reaction-3c8a918c60dfb8b528b81f3e8a445989",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ffc921/2147483647/strip/true/crop/3000x1688+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2Fc2%2F756d41bfb71396cac4f7e6cd446f%2Fa446e308a31d44bf8394ca0b584b0991"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}