{
  "articles": [
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — A House Democratic lawmaker has become the first in the party to publicly call for President Joe Biden to step down as the Democratic nominee for president, citing Biden’s debate performance against Donald Trump failing to “effectively defend his many accomplishments.”",
      "publishedAt": "2024-07-02T16:56:45Z",
      "title": "Rep. Lloyd Doggett is first Democrat to publicly call for Biden to step down as party's nominee",
      "url": "https://apnews.com/98c3bd8c4138245e7ef8f79d621268e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3fe226cf4f3483fa0a2a81fce6ec39a/1529.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "Manhattan prosecutors said Tuesday they would not oppose Donald Trump’s request to delay the sentencing in his hush money trial as he seeks to have the conviction overturned following a Supreme Court ruling that granted broad immunity protections to presidents.",
      "publishedAt": "2024-07-02T15:04:16Z",
      "title": "Prosecutor won't oppose Trump sentencing delay in hush money case after high court immunity ruling",
      "url": "https://apnews.com/4d5f8ce399656abff72d7c114a04060d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f71b4064e834a589c37d798679e8c1f/3000.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin said Tuesday that the U.S. will soon announce an additional $2.3 billion in security assistance for Ukraine, to include anti-tank weapons, interceptors and munitions for Patriot and other air defense systems.",
      "publishedAt": "2024-07-02T14:36:54Z",
      "title": "Defense Secretary Austin says the US will provide $2.3 billion more in military aid to Ukraine",
      "url": "https://apnews.com/fdaf6a744ed1ff9787e4d7e22214320e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96ed22c140df446592e35db6ad1d5824/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — Thousands of people at a religious gathering in India rushed to leave a makeshift tent, setting off a stampede Tuesday that killed more than 100 and left scores injured, officials said.",
      "publishedAt": "2024-07-02T11:30:31Z",
      "title": "Stampede at religious event in India kills more than 100, mostly women and children",
      "url": "https://apnews.com/5ef739c5cbe8bb8b732c0b3099173810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d511844c1494e1c8d19e965473cce9a/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER",
      "description": "After a half century of activism, many Native Americans thought a bitter debate over the capital's football mascot was over two years ago when the team became the Washington Commanders.",
      "publishedAt": "2024-07-02T13:00:12Z",
      "title": "Senator wants Washington Commanders to pay tribute to an old logo that offends many Indigenous",
      "url": "https://apnews.com/074bf26f0a2a47e1481e0803909eab20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b080fe4266d448f785b0045cb171be81/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and AMAR SPENCER-SAYERS",
      "description": "ST. GEORGE'S, Grenada (AP) — Hurricane Beryl roared through open waters on Tuesday as a monstrous Category 5 storm heading toward Jamaica after earlier making landfall in the southeast Caribbean, killing at least six people.",
      "publishedAt": "2024-07-02T10:43:42Z",
      "title": "Beryl heads toward Jamaica as a major hurricane after ripping through southeast Caribbean",
      "url": "https://apnews.com/8cf6928baf7c69554c48625fabd4a1b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6797fcbb032416682194d213f02178c/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Rudolph Giuliani, the former New York City mayor, federal prosecutor and legal adviser to Donald Trump, was disbarred in New York on Tuesday after a court found he repeatedly made false statements about Trump's 2020 election loss.",
      "publishedAt": "2024-07-02T15:14:45Z",
      "title": "Giuliani is disbarred in New York as court finds he repeatedly lied about Trump's 2020 election loss",
      "url": "https://apnews.com/81b327f9ab1f98548cb888f8e652c9a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c1f2ce9441c452b90de7115143aa1d0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The U.S. government will pay the vaccine maker Moderna $176 million to accelerate development of a pandemic influenza vaccine that could be used to treat bird flu in people, as concern grows about cases in dairy cows across the country, federal officials announced Tuesday.",
      "publishedAt": "2024-07-02T14:34:22Z",
      "title": "The US will pay Moderna $176 million to develop an mRNA pandemic flu vaccine",
      "url": "https://apnews.com/7f15d8d274a24d89fa86e2f57e13cbff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91d537b83e8f4d24aab61b8db3dde27c/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation in the United States is slowing again after higher readings earlier this year, Federal Reserve Chair Jerome Powell said Tuesday, while adding that more such evidence would be needed before the Fed would cut interest rates.",
      "publishedAt": "2024-07-02T14:00:53Z",
      "title": "Fed Chair Jerome Powell: US inflation is cooling again, though it isn't yet time to cut rates",
      "url": "https://apnews.com/4a20a1f923eb91bbad438c6e2008c17f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/544cc11763314fa0adb91114c7f59c33/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "LONDON (AP) — Marketa Vondrousova became the first defending women’s champion at Wimbledon to lose in the first round the next year since 1994, eliminated 6-4, 6-2 by Jessica Bouzas Maneiro at Centre Court on Tuesday.",
      "publishedAt": "2024-07-02T13:50:09Z",
      "title": "Marketa Vondrousova is the first defending women's Wimbledon champ out in the first round since 1994",
      "url": "https://apnews.com/a4378df0598b6b1419141e61f4bbeec2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2233d19339d8496cbaaf9a8d3c3f15bd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}