{
  "articles": [
    {
      "author": "ISABEL DeBRE, EDITH M. LEDERER and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Palestinians fled in a mass exodus from northern Gaza Friday after Israel’s military told some 1 million people to evacuate toward the southern part of the besieged territory ahead of an expected ground invasion against the ruling Hamas militant group.",
      "publishedAt": "2023-10-13T04:00:40Z",
      "title": "Palestinians flee northern Gaza after Israel orders 1 million to evacuate as ground attack looms",
      "url": "https://apnews.com/c8b4fc20e4fd2ef381d5edb7e9e8308c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f323972c54fb4f33b469bc126099b248/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "In Muslim communities across the world, worshippers gathered at mosques for their first Friday prayers since Hamas militants attacked Israel, igniting the latest Israel-Palestinian war.",
      "publishedAt": "2023-10-13T07:46:52Z",
      "title": "Muslims gather at mosques for first Friday prayers since Israel-Hamas war started",
      "url": "https://apnews.com/2d096a9fe2bedbc5750520242dc63598",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82ed7c6724ae4495a136b90c95b92ce0/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — In Israel's call for the evacuation of half of Gaza's population, many Palestinians fear a repeat of the most traumatic event in their tortured history, their mass exodus from what is now Israel during the 1948 war surrounding its creation.",
      "publishedAt": "2023-10-13T18:36:43Z",
      "title": "In Israel's call for mass evacuation, Palestinians hear echoes of their original catastrophic exodus",
      "url": "https://apnews.com/a1bec1ee3477573e80b39b4044a48111",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ec5478b751645abadd4ae12006fb608/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Increasingly desperate Republicans convened behind closed doors again Friday as the endless search for a House speaker drags deeper into a second week leaving the GOP majority spiraling into chaos for the foreseeable future.",
      "publishedAt": "2023-10-13T16:03:53Z",
      "title": "Republicans quickly eye Trump-backed hard-liner Jim Jordan as House speaker, but not all back him",
      "url": "https://apnews.com/ced017e71de967a7e327cba7e502926a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5901acfd16f248d5b94816cdee25ab3d/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The White House said on Friday that North Korea has delivered more than 1,000 containers of military equipment and munitions to Russia for its ongoing war in Ukraine.",
      "publishedAt": "2023-10-13T16:59:54Z",
      "title": "US says North Korea delivered 1,000 containers of equipment and munitions to Russia for Ukraine war",
      "url": "https://apnews.com/7091eaba254b680888a9b1ec8a68135f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dd98902e07b4664b52aef5b7a0b29a2/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER, SAMUEL PETREQUIN and JEFFREY SCHAEFFER",
      "description": "ARRAS, France (AP) — A man of Chechen origin who was under surveillance by French security services over suspected Islamic radicalization stabbed a teacher to death at his former high school and critically wounded three other people Friday in northern France, authorities said.",
      "publishedAt": "2023-10-13T10:33:11Z",
      "title": "Suspect in French teacher's slaying was held for questioning the day before attack, minister says",
      "url": "https://apnews.com/878f42a5df4a873ca7bd80a173cc9097",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7cf1e54d2214dbc8b6f9be51d5263a6/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY and ANNIE MA",
      "description": "For more than a month, Darryl George, a Black high school student in Texas, spent each school day sitting by himself in punishment over his hairstyle.",
      "publishedAt": "2023-10-13T17:26:04Z",
      "title": "Black student disciplined over hairstyle hopes to 'start being a kid again'",
      "url": "https://apnews.com/ba027664c1c236196eb196b837640df9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/869c2d12496b4609ae4d4c9b85c567c9/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, REBECCA BOONE and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Audio of 911 calls from a deadly August wildfire released late Thursday by Maui County authorities reveals a terrifying and chaotic scene as the inferno swept through the historic town of Lahaina and people desperately tried to escape burning homes and flames licking at cars in gridlocked traffic.",
      "publishedAt": "2023-10-13T03:00:56Z",
      "title": "AP Exclusive: 911 calls from deadly Lahaina wildfire reveal terror and panic in the rush to escape",
      "url": "https://apnews.com/41589535521a3e5f399a5b88db2fac52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a6af86f35724146a4529f88fbc1623c/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court avoided a catastrophic accident last year when a piece of marble at least 2 feet long crashed to the ground in an interior courtyard used by the justices and their aides, according to several court employees.",
      "publishedAt": "2023-10-13T04:13:40Z",
      "title": "The Supreme Court avoided disaster when a chunk of marble fell in a courtyard used by the justices",
      "url": "https://apnews.com/bb79d2faa7e31f2510b70af467e01a63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dc63325d52b4d66b7a5f5acca1d611a/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA’s Psyche spacecraft rocketed away Friday on a six-year journey to a rare metal-covered asteroid.Most asteroids tend to be rocky or icy, and this is the first exploration of a metal world.",
      "publishedAt": "2023-10-13T14:22:17Z",
      "title": "NASA spacecraft launched to mysterious and rare metal asteroid in first mission of its kind",
      "url": "https://apnews.com/2df880c4b43e9eddf61022c950cf64c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c24136a24bf245c2b2dbf56a08c837c0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}