{
  "articles": [
    {
      "author": "Samya Kullab, Susie Blann",
      "description": "The former Ukrainian army general widely seen as the top political rival to President Volodymyr Zelenskyy has spoken publicly for the first time about a deep rift between the two men. The comments made by Valerii Zaluzhnyi during an interview with the AP signal his possible desire to run for the presidency after the war is over. Zelenskyy ousted Zaluzhnyi as head of the army in 2024 and later appointed him as the country’s ambassador to Britain. Zaluzhnyi told AP that their strained relationship reached a boiling point in 2022, when domestic intelligence agents raided his office, a previously unreported incident he alleges was an act of intimidation. Zelenskyy's office and the country's security service declined to comment. The AP could not confirm Zaluzhnyi's account of the raid.",
      "publishedAt": "2026-02-18T09:30:23Z",
      "title": "Ukraine's ex-army chief reveals to AP a rift with Zelenskyy",
      "url": "https://apnews.com/article/ukraine-war-zaluzhnyi-zelenskyy-raid-5ff9e5e2054e0b17c10daf58d7eab63e",
      "urlToImage": "https://dims.apnews.com/dims4/default/130d989/2147483647/strip/true/crop/8102x5399+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fd8%2Fda0855024609fe581195f3c4af1e%2Fd9e26c6dab1e435eba22c75e8f5317e3"
    },
    {
      "author": "Olga R. Rodriguez, Julie Watson",
      "description": "Crews have pushed through mountainous wilderness in California near Lake Tahoe during a snowstorm to rescue six backcountry skiers who survived an avalanche but were trapped by its snow and ice. Nine others from their tour group remain missing. The Nevada County Sheriff's Office says two of the six were taken to a hospital for treatment. The sheriff’s office says there were 15 skiers on the trip — not 16 as initially believed. Extreme weather conditions in the Northern California mountains slowed the rescue effort. It took crews several hours to reach the skiers and take them to safety, where they were evaluated by the Truckee Fire Department.",
      "publishedAt": "2026-02-18T07:13:40Z",
      "title": "A California avalanche hits 16 backcountry skiers. 6 survivors located and 9 are missing",
      "url": "https://apnews.com/article/california-avalanche-backcountry-skiers-rescue-missing-f7b4a89c38af634e39a152a874db17f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0985967/2147483647/strip/true/crop/1105x736+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fe5%2F8782f1d55bd764c87f978c7e1f1f%2Fb41d651afd5548d28cb86c303a1d8f7e"
    },
    {
      "author": "Julie Carr Smyth",
      "description": "Les Wexner’s long-time friendship with the late sexual predator Jeffrey Epstein will be the subject of a closed-door congressional deposition in Ohio. The billionaire retail magnate on Wednesday is expected to face questions about new revelations contained in Epstein-related documents released by the Justice Department. The 88-year-old Wexner is the retired founder of L Brands. He says he intends to cooperate with House Oversight Committee members' inquiry. As one of Epstein’s most prominent former friends, Wexner has already spent years answering for their association. He denies any knowledge of or involvement in Epstein’s crimes. Wexner's name appears more than 1,000 times.",
      "publishedAt": "2026-02-18T05:03:20Z",
      "title": "Retail mogul Les Wexner to face congressional questions over Epstein files",
      "url": "https://apnews.com/article/epstein-wexner-congress-subpoena-733833f6d648c09e6b3473eb1cd4009d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e81a72/2147483647/strip/true/crop/2137x1424+0+13/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F8a%2F28bf0f9d4c76cb438701f5e89440%2Fc52c436d62e047a789003bffb411305c"
    },
    {
      "author": "Mari Yamaguchi",
      "description": "Japanese Prime Minister Sanae Takaichi has been reappointed by Parliament after last week's landslide election win that gave her a strong public mandate. She will form her second Cabinet, with all previous ministers expected to be retained. Takaichi is now gearing up to work on policies she says are needed to make Japan stronger and more prosperous, using her governing Liberal Democratic Party’s two-thirds supermajority in the lower house. She hopes to bolster Japan’s military power, government spending, U.S. alliance and social conservatism.",
      "publishedAt": "2026-02-18T00:41:34Z",
      "title": "Takaichi reelected as Japan's prime minister after election win",
      "url": "https://apnews.com/article/japan-takaichi-us-china-trump-defense-aa82f8a3b5a7120575072f390f30fb97",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b8217a/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F59%2F537314137d8c6da9bea7ecab8644%2Ffcaa6d4de74d4d0aa2297d986e3adc68"
    },
    {
      "author": "Aaron Morrison, Sophia Tareen",
      "description": "The Rev. Jesse Jackson kept up his more than half-century-long fight for civil and human rights through his final years despite challenges over his health, the coronavirus pandemic, racial injustice and political divisions. Whether appearing at the funerals of Black people killed by police or participating in COVID-19 vaccination drives to address hesitancy in communities of color, Jackson built on a life in public advocacy that included running for president, international diplomacy and influencing the lexicon of racial identity in America. Jackson, a protégé of the Rev. Martin Luther King Jr., died on Tuesday. He was 84.",
      "publishedAt": "2026-02-17T16:02:39Z",
      "title": "Jesse Jackson kept the Civil Rights Movement alive long after King",
      "url": "https://apnews.com/article/jesse-jackson-dead-8ed88b7da0b911ed842f3c219cee77e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4513057/2147483647/strip/true/crop/3032x2020+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F83%2F93c5babbaace0ffcfe2e2d74cc72%2F4b2f1d1a34a64a48b6e7db123671e95b"
    },
    {
      "author": "Kimberlee Kruesi",
      "description": "A gunman who opened fire at a Rhode Island youth hockey game, killing two adults and injuring three others, was stopped after a fellow spectator intervened. Pawtucket Police Chief Tina Goncalves said Monday that the shooter died from an apparent self-inflicted gunshot. Goncalves says investigators think the shooting at the Dennis M. Lynch Arena in Pawtucket on Monday afternoon was targeted and may have involved a family dispute. Video online shows players and fans scrambling for cover and rushing to exits. Gov. Dan McKee says the state is grieving again after another recent mass shooting.",
      "publishedAt": "2026-02-17T14:31:54Z",
      "title": "Shooting at a Rhode Island hockey rink leaves 3 dead, including shooter",
      "url": "https://apnews.com/article/pawtucket-hockey-rink-shooting-rhode-island-4e9c9df9c3a2b0a524f0e9bdd0908d45",
      "urlToImage": "https://dims.apnews.com/dims4/default/078458e/2147483647/strip/true/crop/4200x2799+0+563/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F42%2Fc6f3ca08f998d9519a8fb59e0cfb%2Fa22aab3b09934c1392772e0ffa4a9a79"
    },
    {
      "author": "Jamey Keaten, Illia Novikov",
      "description": "U.S.-brokered talks between Russian and Ukrainian envoys are continuing in Geneva, with both sides apparently still far apart on peace terms. Ukrainian delegate Rustem Umerov said working groups on Wednesday are reviewing political and military issues. The talks mark a third round of direct meetings organized by the U.S., after earlier sessions in Abu Dhabi. Trump envoy Steve Witkoff said U.S. efforts have made meaningful progress, but gave no details. Fighting continues along the long front line. Ukraine reports Russia launched a ballistic missile and more than 100 drones overnight. A drone strike in Zaporizhzhia killed a woman and injured seven.",
      "publishedAt": "2026-02-18T09:25:16Z",
      "title": "Ukrainian and Russian envoys hold a second day of US-brokered talks in Geneva",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-geneva-0f22fa796cafd6606a88ad1b101ab3fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/147a2c4/2147483647/strip/true/crop/10867x7241+0+455/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F04%2F7f94c7ea4c4c5447745ae566cb00%2F7c8db2b42d99414faa55f536e3d73769"
    },
    {
      "author": "Ed White",
      "description": "Investigators in the Nancy Guthrie disappearance say DNA from gloves did not match any entries in a national database. CODIS is a valuable storehouse of DNA taken from crime suspects or people with convictions. Any hits could identify possible suspects in the Guthrie saga, which reached a 17th day Tuesday. The 84-year-old mother of NBC “Today” co-anchor Savannah Guthrie was reported missing from her Tucson-area home on Feb. 1 after spending the previous night with family. Investigators are also working with experts to try to locate Nancy Guthrie by somehow detecting her heart pacemaker.",
      "publishedAt": "2026-02-17T20:32:53Z",
      "title": "No breakthrough reported with glove DNA in Nancy Guthrie disappearance",
      "url": "https://apnews.com/article/nancy-guthrie-missing-savannah-guthrie-aadbb20a613491c10373f55ba33d1831",
      "urlToImage": "https://dims.apnews.com/dims4/default/377f983/2147483647/strip/true/crop/6131x4085+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F81%2Fd5e6f574aeda7c6d693d02b30c4b%2F8e5e142f0aeb4a3cbc1ed002fef19783"
    },
    {
      "author": "Jim Mustian, Michael Biesecker, Jack Brook",
      "description": "Minnesota and federal authorities are investigating claims that immigration officers shattered a Mexican man's skull while taking him into custody last month. Alberto Castañeda Mondragón says agents yanked him from a vehicle, slammed him down and beat him with a baton. ICE has said the man caused his own injuries when he tried to run while handcuffed and fell. Hospital workers have told The Associated Press that explanation does not match the CT scan and brain bleeding he received. Both St. Paul police and the FBI last week requested surveillance video from businesses in the shopping center where the arrest happened.",
      "publishedAt": "2026-02-18T00:04:59Z",
      "title": "Minnesota and federal authorities investigating alleged beating of Mexican citizen",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospital-ice-beating-assault-eb305587f58dfc8b97d844d0073411c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff3f9d/2147483647/strip/true/crop/2172x1447+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F98%2Fd3b31ba59f5bba8d4c0fd4bb3d28%2F94351bdc84064a95b5e3cb835e50b6db"
    },
    {
      "author": "Sylvie Corbet",
      "description": "Gisèle Pelicot has released a memoir that recounts her drugging and mass rape case and sends a powerful message of hope and support to victims of sexual abuse. On Tuesday, her book comes out worldwide in 22 languages. Pelicot says writing it helped her reflect on her life. She says she wants to give hope to women living through trauma. The case made her a symbol after a 2024 trial. Her ex-husband and dozens of other men received convictions for assaults over several years. Gymnastic superstar Simone Biles, herself a survivor of sexual abuse, praised Pelicot for speaking publicly.",
      "publishedAt": "2026-02-17T11:46:41Z",
      "title": "Gisèle Pelicot's memoir released in 22 languages shares survival story",
      "url": "https://apnews.com/article/gisele-pelicot-book-france-dominique-rape-4cd6f5bacc7fa9d483d610a3b38551a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/adf3a3d/2147483647/strip/true/crop/6435x4288+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Ffb%2F1bbded99b05e81b4a93be89cb685%2F5c2dd70f481a4c38baee60ff70973df7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}