{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Thousands of Palestinians are fleeing south on foot with only what they can carry after running out of food and water in the north, a United Nations agency said Wednesday, as Israel said its troops were battling Hamas militants deep inside Gaza City.",
      "publishedAt": "2023-11-08T06:39:16Z",
      "title": "Growing numbers of Palestinians flee on foot as Israel says its troops are battling inside Gaza City",
      "url": "https://apnews.com/1d414b19e39fc46a5541d0541a880350",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0dafaddbb484b1eaa4abed607fb0896/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Americans have become more likely to describe Israel as an ally that shares U.S. interests and values since the war with Hamas began, but they’re divided over whether Israel has gone too far in its response to last month’s attack, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-11-08T05:02:11Z",
      "title": "Americans divided over Israel response to Hamas attacks, AP-NORC poll shows",
      "url": "https://apnews.com/5c30c00637b5cb107dc4c342f307b673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3171cb0f019345e0b76c096ea2565485/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Democrats had plenty of good news to celebrate in Tuesday’s off-year elections and more evidence that they can win races centered on the national debate over abortion.Abortion rights supporters won an Ohio ballot measure and the Democratic governor of beet-red Kentucky held onto his office by campaigning on reproductive rights and painting his opponent as extremist.",
      "publishedAt": "2023-11-08T02:21:42Z",
      "title": "Democrats win in several states on abortion rights and other highlights from Tuesday's elections",
      "url": "https://apnews.com/868a21bf3537a0533ae3fd8007d07eef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac3eb7346344495c8078570e7c067ff2/1920.jpeg"
    },
    {
      "author": "ROBERT YOON",
      "description": "WASHINGTON (AP) — A proposal to enshrine abortion rights in Ohio’s Constitution was approved in a statewide election Tuesday, with a significant number of Republicans joining with Democrats to ensure the measure’s passage.",
      "publishedAt": "2023-11-08T05:38:57Z",
      "title": "Voters in Ohio backed a measure protecting abortion rights. Here's how Republicans helped",
      "url": "https://apnews.com/9ab6fb181f2440dad90a616b278403ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83680fe1d1834be8a42e8d4c877b78ef/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Her father gave caustic testimony. Her brothers each spent more than a day on the witness stand.",
      "publishedAt": "2023-11-08T05:28:04Z",
      "title": "Ivanka Trump is set to testify in the civil fraud trial that's probing into the family business",
      "url": "https://apnews.com/1795382ea1d2c33faefbb40a0907feca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b696313ce70e46bbb3686e3157dca48f/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, FOSTER KLUG and MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Top diplomats from the Group of Seven leading industrial democracies announced a unified stance on the Israel-Hamas war on Wednesday after intensive meetings in Tokyo, condemning Hamas, supporting Israel’s right to self-defense and calling for “humanitarian pauses” to speed aid to desperate civilians in the Gaza Strip.",
      "publishedAt": "2023-11-08T03:32:21Z",
      "title": "G7 nations announce a unified stance on Israel-Hamas war after intensive meetings in Tokyo",
      "url": "https://apnews.com/de8e0b1f293e91781de84de6d70df249",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ac9d9e01bd64ed0a9d31b6002b4b1c6/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House voted late Tuesday to censure Democratic Rep. Rashida Tlaib of Michigan — the only Palestinian American in Congress — an extraordinary rebuke of her rhetoric about the Israel-Hamas war.",
      "publishedAt": "2023-11-07T20:49:11Z",
      "title": "House votes to censure Rep. Rashida Tlaib over her Israel-Hamas rhetoric in a stunning rebuke",
      "url": "https://apnews.com/8085189047a4c40f2d44ada4604aa076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2237f40ec9cb4cbe81a07dd6b3e6ebf9/3000.jpeg"
    },
    {
      "author": "AIJAZ HUSSAIN and SHEIKH SAALIQ",
      "description": "SRINAGAR, India (AP) — From Western capitals to Muslim states, protest rallies over the Israel-Hamas war have made headlines. But one place known for its vocal pro-Palestinian stance has been conspicuously quiet: Indian-controlled Kashmir.",
      "publishedAt": "2023-11-08T05:02:55Z",
      "title": "India bars protests that support the Palestinians. Analysts say a pro-Israel shift helps at home",
      "url": "https://apnews.com/f4b431716decb1550522db2e49630d9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab45239ae0d049c4b7ec26e024b0b0f0/3000.jpeg"
    },
    {
      "author": "MEAD GRUVER",
      "description": "CHEYENNE, Wyo. (AP) — She refused to ban books, many of them about racism and the experiences of LGBTQ+ people. And for that, Suzette Baker was fired as a library director in a rural county in central Texas.",
      "publishedAt": "2023-11-08T07:01:06Z",
      "title": "Librarians turn to civil rights agency to oppose book bans and their firings",
      "url": "https://apnews.com/d754f186818a9b3641e8f29cb8ce16a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55299c8f2e3d422097ace74e52ac4624/3000.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "This October was the hottest on record globally, 1.7 degrees Celsius (3.1 degrees Fahrenheit) warmer than the pre-industrial average for the month — and the fifth straight month with such a mark in what will now almost certainly be the warmest year ever recorded.",
      "publishedAt": "2023-11-08T03:10:19Z",
      "title": "Red hot October almost guarantees 2023 will be the hottest year on record",
      "url": "https://apnews.com/4c5b496420620a02f9c295604cf8d2b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/854b3888270644af95c5f2dcc7cb416e/2214.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}