{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI and JILL COLVIN",
      "description": "GRAND RAPIDS, Mich. (AP) — Donald Trump held his first campaign rally since he survived an assassination attempt Saturday, returning to the battleground state of Michigan alongside his newly named running mate.",
      "publishedAt": "2024-07-20T04:08:34Z",
      "title": "Trump holds first rally after assassination attempt with his new running mate, Vance, by his side",
      "url": "https://apnews.com/dcc7969cd53e281e32beb72a2c6e0fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64757bdfcf3f44fd98ed522ba31a4121/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — As Democrats churn over whether President Joe Biden should stay in the 2024 race, the party turmoil is deepening over whether his Vice President Kamala Harris is next in line for the job or if a “mini primary” should be quickly launched to choose a new nominee before the party's August convention.",
      "publishedAt": "2024-07-20T04:00:31Z",
      "title": "Beyond Biden, Democrats are split over who would be next —VP Harris or launch a 'mini primary'",
      "url": "https://apnews.com/2b1c163c863130675b3b5b60718741c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30d986757ab64bac99d51de0b92e9174/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday.",
      "publishedAt": "2024-07-20T21:00:48Z",
      "title": "Gunman in Trump rally attack flew drone over rally site in advance of event, official says",
      "url": "https://apnews.com/733811e02b1e609de6a9bc35f6b8c141",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8f913147843487290fe4a1f0d8ab10c/3000.jpeg"
    },
    {
      "author": "AHMED AL-HAJ, WAFAA SHURAFA and JACK JEFFERY",
      "description": "SANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.The Israeli strikes appeared to be the first on Yemeni soil since the Israel-Hamas war began in October, and they threatened to open a new front in the region as Israel battles proxies of Iran.",
      "publishedAt": "2024-07-20T10:13:28Z",
      "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks",
      "url": "https://apnews.com/786ff10ee4c3534024833ebbf586fadc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1148926ddacb45dd9db561b24d02fdd7/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG and JILL LAWLESS",
      "description": "As the world continues to recover from massive business and travel disruptions caused by a faulty software update from cybersecurity firm CrowdStrike, malicious actors are trying to exploit the situation for their own gain.",
      "publishedAt": "2024-07-20T17:22:07Z",
      "title": "Malicious actors trying to exploit global tech outage for their own gain",
      "url": "https://apnews.com/ebcba985600530a4689289eae38619bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e65fecf4b03426884d2dac34da0c138/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM and SHEIKH SAALIQ",
      "description": "DHAKA, Bangladesh (AP) — Bangladeshi authorities extended a curfew across the country on Sunday as the nation's top court was expected to rule on a civil service hiring quota that has led to days of deadly clashes between police and protesters, killing scores of people.",
      "publishedAt": "2024-07-21T04:51:23Z",
      "title": "Curfew extended in Bangladesh as top court is set to rule on job quotas that sparked deadly unrest",
      "url": "https://apnews.com/107847b2c1bdf4e52dfa0c82f51f3d4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9267a862978648a2b7a4a5a509405fa6/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE and LEKAN OYEKANMI",
      "description": "SPRING, Texas (AP) — As the temperature soared in the Houston-area home Janet Jarrett shared with her sister after losing electricity in Hurricane Beryl, she did everything she could to keep her 64-year-old sibling cool.",
      "publishedAt": "2024-07-21T05:32:34Z",
      "title": "Heat-related Texas deaths climb after Beryl left millions without power for days or longer",
      "url": "https://apnews.com/53a403fec3ffdf34daeb8d5e179953ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e009796fc3184c86aca1cbe7c39381f9/3000.jpeg"
    },
    {
      "author": "JOANNA KOZLOWSKA",
      "description": "Eka Gigauri is used to harsh words from officials about the anti-corruption work she does in Georgia. But seeing her face on posters, accusing her of being an agent of foreign influence, a traitor and a spy, rattled her.",
      "publishedAt": "2024-07-21T04:03:54Z",
      "title": "As Georgia presses on with 'Russia-style' laws, its citizens describe a country on the brink",
      "url": "https://apnews.com/4d6da6d13838074500787cf535cb1a86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5efac1be72ae4894914057f2c48e7461/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "ASPEN, Colo. (AP) — Ukraine is on its way to being able to “stand on its own feet” militarily, Secretary of State Antony Blinken said Friday, noting that more than 20 other countries have pledged to maintain their own military and financial aid to the country even if the U.S.",
      "publishedAt": "2024-07-20T15:48:57Z",
      "title": "Blinken points to wider pledges to support Ukraine in case US backs away under Trump",
      "url": "https://apnews.com/7a31fd2e6a6828cef942d3c2f79b9b26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fd0db25171943c4b2eaabc7874ff2ac/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The recently opened archives of Pope Pius XII have shed new light on claims the World War II-era pope didn’t speak out about the Holocaust.",
      "publishedAt": "2024-07-21T05:31:27Z",
      "title": "Vatican's Pius XII archives shed light on another contentious chapter: The Legion of Christ scandal",
      "url": "https://apnews.com/91744e8054aa839647633e1d56372165",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfcfcdac5ffe4a0cb84b05dd0aa407bb/2001.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}