{
  "articles": [
    {
      "author": "Steve Peoples",
      "description": "Hundreds of thousands of federal workers have little more than 48 hours to explain what they accomplished over the last week. The order is part of billionaire Elon Musk’s crusade to slash what he describes as “waste everywhere\" in the federal government. Musk, who serves as President Donald Trump’s cost-cutting chief, shared the extraordinary request on his social media network on Saturday. He said that “failure to respond will be taken as a resignation.” Shortly afterward, federal employees received a three-line email telling them to share \"approx. 5 bullets of what you accomplished last week and cc your manager.” Thousands of government employees have already been forced out of the federal workforce during the first month of Trump’s administration.",
      "publishedAt": "2025-02-22T23:21:12Z",
      "title": "Musk gives federal workers 48 hours to say what they did last week",
      "url": "https://apnews.com/article/elon-musk-trump-federal-workers-f44257ce4cf8c04c96c8ce0ce262842f",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dbeccd/2147483647/strip/true/crop/5113x2876+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F92%2Fcf13ff0a39158f6457cec66949d4%2Fa8cd448fb7a142dfb75bd069684d2bc0"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "When Bill Clinton came to Washington as president, his Democratic administration used corporate know-how and the new internet to streamline the federal bureaucracy as part of the “Reinventing Government” push. Millions of employees were offered buyouts and there were spending cuts to balance the budget. The effort led by Vice President Al Gore ended up eliminating about 400,000 federal positions and saved an estimated $146 billion. It might sound like the controversial cost-cutting push today led by billionaire Elon Musk under the auspices of Republican President Donald Trump. But the Clinton-era initiative was authorized by legislation, took several years to identify inefficiencies and involved federal workers in re-envisioning their jobs.",
      "publishedAt": "2025-02-23T12:24:36Z",
      "title": "Inside previous cost-cutting and government 'reinvention' efforts",
      "url": "https://apnews.com/article/trump-musk-doge-clinton-reinventing-government-gore-a95795eb75cacc03734ef0065c1b0a6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0f2e95/2147483647/strip/true/crop/2997x1686+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F80%2F847180b4f1e94ef3e5b27f56c2b8%2Fda375ba8a72e4d37b5e94adb4831148f"
    },
    {
      "author": "Will Weissert",
      "description": "President Donald Trump’s week included rewriting U.S. policy toward Russia and firing the country's senior military officer. Trump sat for a chummy interview with Elon Musk and sought greater authority over independent regulatory agencies. The Republican president acknowledged that “inflation is back” but said he “had nothing to do” with prices remaining high. That excuse can only work for so long, unless the economic outlook changes. Consumer sentiment suggests that isn’t happening. As the one-month mark of his second term came and went, Trump also offered increasingly fanciful pushes, including instructing officials to check Fort Knox to ensure the gold is still there and saying Musk could send humans to Mars.",
      "publishedAt": "2025-02-23T12:45:08Z",
      "title": "Russia, gold, DOGE and more: Week 5 at the Trump White House",
      "url": "https://apnews.com/article/trump-russia-musk-inflation-fort-knox-ukraine-f4e3b738f8b2cb869fec5bf9718ef1f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/11cfe09/2147483647/strip/true/crop/3458x1945+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F99%2Fb1b9c6c41060776501a81e1872b6%2F95f12b44028b43b29d7eb4a90f153515"
    },
    {
      "author": "Will Weissert",
      "description": "Defense Secretary Pete Hegseth is defending President Donald Trump’s firing of the nation’s senior military officer and a wave of top dismissals at the Pentagon, insisting that they weren’t unusual despite accusations that the new administration is injecting politics into the military. “Nothing about this is unprecedented,” Hegseth told Fox on Sunday about Air Force Gen. CQ Brown Jr. being dismissed as chairman of the Joint Chiefs of Staff on Friday night. “The president deserves to pick his key national security advisory team.”",
      "publishedAt": "2025-02-23T15:30:03Z",
      "title": "Pete Hegseth defends Pentagon firings, says more may come",
      "url": "https://apnews.com/article/trump-hegseth-brown-joint-chiefs-firing-25668b583b8fb2262c7890a44164e287",
      "urlToImage": "https://dims.apnews.com/dims4/default/3f06551/2147483647/strip/true/crop/7124x4007+0+371/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F4a%2F6670b915082de59f8a5187f454e1%2Fe0ea054e4ff84435b1de772892a00464"
    },
    {
      "author": "Tara Copp",
      "description": "President Donald Trump’s choice to be the top U.S. military officer, retired Air Force Lt. Gen. Dan Caine, endeared himself to the commander in chief through his military call sign, “Razin,” during a meeting in Iraq years ago. Officials who have served with Caine describe him measured and apolitical. Trump said Friday night that Caine was his pick to be the next Joint Chiefs of Staff chairman. That announcement came in the same social media post in which he fired Air Force Gen. CQ Brown Jr. Chris Miller, who was Trump’s last acting defense secretary in his first term, describes Caine as \"nontraditional\" but says he “definitely knows how the Pentagon works.”",
      "publishedAt": "2025-02-22T20:37:18Z",
      "title": "A look at Dan ‘Razin’ Caine, Trump’s pick to be the top US military officer",
      "url": "https://apnews.com/article/trump-joint-chiefs-chairman-razin-caine-military-41b3faeaefd4d965dc22b15b0223ec58",
      "urlToImage": "https://dims.apnews.com/dims4/default/404b648/2147483647/strip/true/crop/2563x1442+0+135/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Fb8%2F6e86b8fede3d5e1dfee3aa672d65%2Fd937032430084dd8b1bca6e9a0850e18"
    },
    {
      "author": "Justin Spike, Illia Novikov",
      "description": "Ukraine’s President Volodymyr Zelenskyy said Sunday he would be ready to give up the presidency if it brought peace and NATO membership. He told a forum in Kyiv, “If to achieve peace, you really need me to give up my post, I’m ready. I can trade it for NATO.” Zelenskyy’s comment appeared to be aimed at recent suggestions by U.S. President Donald Trump and Russian President Vladimir Putin that elections should be held in Ukraine despite Ukrainian legislation prohibiting them during martial law. He spoke after Russia launched a record number of drones into Ukraine on the eve of the three-year anniversary of Moscow's full-scale invasion.",
      "publishedAt": "2025-02-23T13:48:56Z",
      "title": "Zelenskyy says he’d be ready to give up presidency for peace",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-anniversary-putin-trump-c8f73a98d071055be52a1b22b0785ecc",
      "urlToImage": "https://dims.apnews.com/dims4/default/48edd02/2147483647/strip/true/crop/6576x3699+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Ffa%2F74ec12a1b8af9e573c45ca6f97ae%2F52a0ed82df8f4de68d21210711e23191"
    },
    {
      "author": "Tia Goldenberg, Majdi Mohammed",
      "description": "Israeli tanks have moved into the occupied West Bank for the first time since 2002, shortly after the defense minister said troops will remain “for the coming year” in parts of the Palestinian territory. Associated Press journalists saw a handful of tanks move Sunday into Jenin, long a bastion of armed struggle against Israel. Israel is deepening its crackdown on the Palestinian territory and has said it is determined to stamp out militancy amid a rise in attacks. Israel launched the broad offensive in the West Bank on Jan. 21 — two days after the current ceasefire in Gaza took hold.",
      "publishedAt": "2025-02-23T09:21:59Z",
      "title": "Israel expands into West Bank and says troops to remain for a year",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-23-2025-1c2dc86afd2e05888d5d588f462e898b",
      "urlToImage": "https://dims.apnews.com/dims4/default/71dc539/2147483647/strip/true/crop/5363x3017+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F96%2F5ae87cce7489a7e4639afafa8f19%2F415a1f18aaa84a9dbd1ba9549a9e8ae4"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican says Pope Francis is still receiving high flows of supplemental oxygen after doctors earlier said that the 88-year-old pope, who had part of one lung removed as a young man, was in critical condition. On Saturday morning, he suffered a prolonged asthmatic respiratory crisis while being treated for pneumonia and a complex lung infection. He also had blood transfusions to treat a low platelet count. He had a peaceful night and rested. The Vatican said he was still receiving supplemental oxygen on Sunday and more clinical tests were being conducted.",
      "publishedAt": "2025-02-23T07:31:02Z",
      "title": "Pope Francis had a peaceful night after respiratory crisis",
      "url": "https://apnews.com/article/vatican-pope-pneumonia-06324d49846f26a24acec1da5fc74ab2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a827904/2147483647/strip/true/crop/8312x4676+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fee%2F94fedb41baf5c26ececef7f8f8fc%2F8ae7d0df503f4c1680da102ab0f1d2a4"
    },
    {
      "author": "Geir Moulson",
      "description": "German voters are choosing their new government in an election dominated by worries about the years-long stagnation of Europe’s biggest economy, pressure to curb migration and growing uncertainty over the future of Ukraine and Europe’s alliance with the United States. The center-right opposition is favored to win, while polls point to the strongest result for a far-right party since World War II. Germany is the most populous country in the 27-nation European Union and a leading member of NATO. It will be central to determining the continent’s response to the challenges of the coming years, including the Trump administration’s confrontational foreign and trade policy.",
      "publishedAt": "2025-02-23T05:00:26Z",
      "title": "Germany elections: Discontented Germans vote in high-stakes election",
      "url": "https://apnews.com/article/germany-election-merz-scholz-far-right-afd-ebf16ed38e0beaff7fed9a6d29b32a24",
      "urlToImage": "https://dims.apnews.com/dims4/default/e2e54f6/2147483647/strip/true/crop/5176x2912+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Fa9%2Fe9a7f2bda3feb7230a26c22e8436%2F7c3ca2eab50c4031a9c761908b935ed4"
    },
    {
      "author": "Nicole Winfield",
      "description": "What happens when a pope is incapacitated? Is he still pope? Pope Francis remains hospitalized in critical condition with a complex lung infection. But he is still pope and very much in charge. His age and prolonged illness, though, have raised questions about whether he might resign, and revived interest about how papal power is exercised in the Holy See, how it is transferred and under what circumstances. Here’s how it works.",
      "publishedAt": "2025-02-23T10:36:05Z",
      "title": "What happens to Catholic Church leadership when a pope is sick?",
      "url": "https://apnews.com/article/pope-incapacitated-vatican-charge-3b6afdf158e01662d553945efbbff2ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca3ab7e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F8d%2F389400a23ab2ad2e783f4461b248%2Fc430c23c1463498b97ac0a55a97d3241"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}