{
  "articles": [
    {
      "author": "MICHAEL BALSAMO, JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The masked gunman who stalked and killed the leader of one of the largest U.S. health insurance companies outside a Manhattan hotel used ammunition emblazoned with the words “deny,” “defend” and “depose,” a law enforcement official said Thursday.",
      "publishedAt": "2024-12-05T05:10:29Z",
      "title": "Ammunition used in CEO’s killing had 'Deny,' 'defend' and 'depose' written on it, AP source says",
      "url": "https://apnews.com/7f6581ba6b0b520938d82c361e77a83c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1df71c98c4ae9a5e7becb8ac9b3de/1920.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "The masked gunman who killed the leader of one of the largest U.S. health insurance companies in front of midtown Manhattan surveillance cameras remained free Thursday from the dragnet thrown by the nation’s largest police department.",
      "publishedAt": "2024-12-04T20:03:08Z",
      "title": "What to know about the deadly shooting of UnitedHealthcare's CEO",
      "url": "https://apnews.com/79a9710978fc7adbb23d3fed4ea2f70d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af04c64d226f4807ad34aa3961a0d9f9/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s president replaced his defense minister Thursday as opposition parties moved to impeach both men over the stunning-but-brief imposition of martial law that brought armed troops into Seoul streets.",
      "publishedAt": "2024-12-05T01:50:27Z",
      "title": "Yoon replaces the defense minister as South Korea's parliament moves to vote on their impeachments",
      "url": "https://apnews.com/8e1ffc82990d6bdce8d80dffc3815f62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8273102dc33a4dfeaefde05250989000/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Amnesty International accused Israel of committing genocide in the Gaza Strip during its war with Hamas, saying it has sought to deliberately destroy Palestinians by mounting deadly attacks, demolishing vital infrastructure and preventing the delivery of food, medicine and other aid.",
      "publishedAt": "2024-12-05T00:03:00Z",
      "title": "Amnesty International says Israel is committing genocide in Gaza. Israel rejects the allegations",
      "url": "https://apnews.com/19aa8fb76f7271942e73d5d7a42434e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de870ad706c74328affe3c508684bf41/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Syrian insurgents entered the central city of Hama Thursday after days of intense clashes with government forces as they push forward with their week-long offensive that brought large parts of Syria under their control.",
      "publishedAt": "2024-12-05T10:08:51Z",
      "title": "Syrian insurgents capture central city of Hama in another blow to Syrian president",
      "url": "https://apnews.com/0189297bbdc76eee67cb4fdc62136bef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/494f11acbf33481c8339ea9e1515e409/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — It's DOGE time at the U.S. Capitol.Billionaire Elon Musk arrived on Capitol Hill on Thursday, expected to be joined by fellow entrepreneur Vivek Ramaswamy, for meetings with legislators behind closed doors about President-elect Donald Trump's plans to “dismantle” the federal government.",
      "publishedAt": "2024-12-05T15:20:15Z",
      "title": "Elon Musk and Vivek Ramaswamy are bringing Trump's DOGE to Capitol Hill",
      "url": "https://apnews.com/ce55aa7ca8c921511d18e837c2a2db64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3c603d94a1e4af5aec09f21ee38fad7/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The acting director of the Secret Service is promising accountability for what he called the agency’s “abject failure” to secure the rally where a gunman opened fire on Donald Trump last summer during his presidential campaign.",
      "publishedAt": "2024-12-05T11:00:42Z",
      "title": "Secret Service head vows accountability for 'abject failure' in first Trump assassination attempt",
      "url": "https://apnews.com/f05f3899c53bd98899175cce860808f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ea65f2b5be74aa1a9a59bb685483fbb/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ, JONATHAN MATTISE and ALANNA DURKIN RICHER",
      "description": "MEMPHIS, Tenn. (AP) — The U.S. Justice Department said Thursday that it could sue to require reforms at Memphis' police department if the city won't willingly agree to changes, after a federal investigation found that Memphis' officers routinely use unwarranted force and disproportionately target Black people.",
      "publishedAt": "2024-12-05T08:39:29Z",
      "title": "Feds say they could sue to force reforms at Memphis' police department if the city won't play ball",
      "url": "https://apnews.com/be8957ed6b228bcd4a93a9f11ebee4b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42271c2fe93744a5838318111befb3f2/3000.jpeg"
    },
    {
      "author": "DAN MERICA and JESSE BEDAYN",
      "description": "ALEXANDRIA, Va. (AP) — Richard Andre Newman thought he would live the rest of his life in his quiet, leafy neighborhood in suburban Virginia. He was born and raised in Bren Mar Park, where children ride their bikes and neighbors wave hello.",
      "publishedAt": "2024-12-05T05:03:09Z",
      "title": "As data centers proliferate, conflict with local communities follows",
      "url": "https://apnews.com/56b84cbb94942039754282afb076a87b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8330c5c5d8f74fb985995cd8ea324448/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Known across the globe as the stuck astronauts, Butch Wilmore and Suni Williams hit the six-month mark in space Thursday with two more to go.",
      "publishedAt": "2024-12-05T15:16:32Z",
      "title": "NASA's stuck astronauts hit 6 months in space. Just 2 more to go",
      "url": "https://apnews.com/1929d955463291701b99d4862b2c45ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/741c8dd78bc0486984f244f94375e1ac/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}