{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces raided one of the last functioning hospitals in Gaza's north and bombarded the south with airstrikes that killed at least 28 Palestinians, pressing ahead with their offensive Tuesday with renewed backing from the United States, despite rising international alarm.",
      "publishedAt": "2023-12-19T08:35:05Z",
      "title": "Israel strikes south Gaza and raids a hospital in the north as war grinds on with renewed US support",
      "url": "https://apnews.com/226fdce935f5797ba8abc9ae4ad857cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4277e2192ea240b79ec5ee8a4b886aa5/1920.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "MANAMA, Bahrain (AP) — The U.S. and a host of other nations are creating a new force to protect ships transiting the Red Sea that have come under attack by drones and ballistic missiles fired from Houthi-controlled areas of Yemen, Defense Secretary Lloyd Austin announced Tuesday in Bahrain.",
      "publishedAt": "2023-12-18T21:32:21Z",
      "title": "Pentagon announces new international mission to counter attacks on commercial vessels in Red Sea",
      "url": "https://apnews.com/286d51bfd65e741e839e185f0f4a455b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de7f2253c40a404f9543359c049ea7ca/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — President Joe Biden’s push to have Congress replenish wartime aid for Ukraine as part of a deal on border and immigration policy changes will almost certainly drag into next year.",
      "publishedAt": "2023-12-19T01:10:53Z",
      "title": "Biden's push for Ukraine aid stalls in Senate as negotiations over border restrictions drag on",
      "url": "https://apnews.com/064246982c828ed820c1c5a47c85901b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71508efc6b31486f820531718936014c/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and PAUL J. WEBER",
      "description": "BROWNSVILLE, Texas (AP) — Republican Texas Gov.",
      "publishedAt": "2023-12-18T20:33:10Z",
      "title": "Texas governor signs bill that lets police arrest migrants who enter the US illegally",
      "url": "https://apnews.com/8c86bc6c20a7c30d6127b2413b8688fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddb96974530240979e6b7920a93bb0da/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — A strong overnight earthquake rattled a mountainous region of northwestern China, authorities said Tuesday, destroying homes, leaving residents out in a below-freezing winter night and killing 126 people in the nation’s deadliest quake in nine years.",
      "publishedAt": "2023-12-18T23:43:15Z",
      "title": "An earthquake in northwestern China kills at least 126 people in nation's deadliest quake in 9 years",
      "url": "https://apnews.com/6255dcb3ce03a570f6aaaf565230afb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/180cd01bbeb24b4ca1018163cd337056/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "ATLANTA (AP) — It’s unclear to Tameka how — or even when — her children became unenrolled from Atlanta Public Schools. But it was traumatic when, in fall 2021, they figured out it had happened.After more than a year of some form of pandemic online learning, students were all required to come back to school in person.",
      "publishedAt": "2023-12-19T05:03:03Z",
      "title": "These kids want to go to school. The main obstacle? Paperwork",
      "url": "https://apnews.com/22f4b2e1fc15f73f370da9f2679c02f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20385c09930a4e8683172aa2b6c03cbf/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and DAVID CRARY",
      "description": "ROME (AP) — Pope Francis formally approved letting Catholic priests bless same-sex couples, the Vatican announced Monday, a radical shift in policy that aimed at making the church more inclusive while maintaining its strict ban on gay marriage.",
      "publishedAt": "2023-12-18T14:06:17Z",
      "title": "Pope approves blessings for same-sex couples that must not resemble marriage",
      "url": "https://apnews.com/bfa5b71fa79055626e362936e739d1d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1216a7315dcf424982e4093c88207c6b/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Marvel had more riding on Jonathan Majors than perhaps any other actor. Now it's parting ways with him, and throwing years of plans for its cinematic universe in disarray.",
      "publishedAt": "2023-12-19T00:42:38Z",
      "title": "Jonathan Majors' Marvel ouster after assault conviction throws years of Disney's plans into disarray",
      "url": "https://apnews.com/d20f14b2ddeb088e5d09cf5889238990",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55ccc98aaba740ad8640d4221e413d78/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — In only two years, a small, colorful vaping device called Elf Bar has become the most popular disposable e-cigarette in the world, generating billions in sales and quickly emerging as the overwhelming favorite of underage U.S.",
      "publishedAt": "2023-12-19T05:01:37Z",
      "title": "Elf Bar and other e-cigarette makers dodged US customs and taxes after China's ban on vaping flavors",
      "url": "https://apnews.com/77033584983ad47fc5795baa46b4705e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a099e7a48a6b414eb031f111f1291b28/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "Google has agreed to pay $700 million and make several other concessions to settle allegations that it had been stifling competition against its Android app store — the same issue that went to trial in a another case that could result in even bigger changes.",
      "publishedAt": "2023-12-19T05:32:40Z",
      "title": "Google to pay $700M in antitrust settlement reached with states before recent Play Store trial loss",
      "url": "https://apnews.com/e4e2f422baa846c66deac90c7866c5fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c560cd6682f4859a2e3770e5621cdbc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}