{
  "articles": [
    {
      "author": null,
      "description": "Gaza’s health ministry says an Israeli airstrike has hit the fourth floor of southern Gaza’s main hospital, killing at least eight people. The ministry says the victims on the fourth floor of Nasser Hospital were killed Monday in a double-tap strike with one missile hitting first, then another moments later as rescue crews arrived. Khan Younis’ Nasser Hospital has withstood raids and bombardment throughout 22 months of war, with officials at the largest medical facility in southern Gaza citing critical shortages of supplies and staff. Israel’s military did not immediately respond to questions about the strike.",
      "publishedAt": "2025-08-25T08:00:57Z",
      "title": "Israeli airstrike on Gaza hospital kills 8, health ministry says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-25-2025-300f739d8dfe203766f3b1ec59c54bd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7544ff2/2147483647/strip/true/crop/4679x2632+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F1f%2F427236b30ea9601510ee9472976d%2F158e854ef0f4486e89c04067927cd509"
    },
    {
      "author": null,
      "description": "A hospital strike in southern Gaza has killed at least eight people, including four journalists. The attack happened on Monday. Among the victims was Mariam Dagga, a freelancer for the Associated Press. She had been covering the Gaza war, focusing on doctors at Nasser Hospital. Al Jazeera confirmed that its journalist Mohammed Salam was also killed in the strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed, and photographer Hatem Khaled was wounded. The incident highlights the dangers journalists face while reporting in conflict zones.",
      "publishedAt": "2025-08-25T09:13:38Z",
      "title": "Multiple journalists killed by Israeli strikes on Gaza hospital",
      "url": "https://apnews.com/article/mideast-wars-gaza-journalists-killed-5c33e999ee88effd89566a993b31d9cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu says he welcomes the Lebanese cabinet’s “momentous decision” earlier this month to work towards the disarmament of Hezbollah by the end of 2025. He said that if Lebanon takes the necessary steps to disarm Hezbollah, then Israel will respond with reciprocal measures, including a phased reduction of the Israeli military presence in southern Lebanon. Since the Israel-Hezbollah war ended in November with a U.S.-brokered ceasefire, Hezbollah officials have said the group will not discuss its disarmament until Israel withdraws from five hills it controls inside Lebanon and stops almost daily airstrikes that have killed or wounded hundreds of people, most of them Hezbollah members.",
      "publishedAt": "2025-08-25T08:04:40Z",
      "title": "Netanyahu says Israel could withdraw from Lebanon if Hezbollah is disarmed",
      "url": "https://apnews.com/article/mideast-wars-israel-lebanon-hezbollah-withdraw-53e399dc2aee8800af729218edd3d3c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/03f223c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4f%2Fc387d69e7f69914c60ed2694d511%2Fdaf2ce35da6f404d864d426ddb3c6830"
    },
    {
      "author": null,
      "description": "Kilmar Abrego Garcia faces deportation to Uganda after checking in with immigration officials on Monday in Baltimore. The Trump administration requires this as part of an effort to deport the El Salvador national, who was released from jail in Tennessee last week. Immigration officials plan to deport him to Uganda, which has agreed to accept certain deportees from the United States. Abrego Garcia declined a plea deal to be removed to Costa Rica. His case has become a flashpoint in President Donald Trump’s immigration agenda after he was mistakenly deported to El Salvador in March. He has pleaded not guilty to human smuggling charges.",
      "publishedAt": "2025-08-25T04:04:55Z",
      "title": "Back home in Maryland, Kilmar Abrego Garcia faces deportation again as he reports to ICE office",
      "url": "https://apnews.com/article/abrego-garcia-deportation-uganda-el-savador-ce9c34d628536c4afa483466d37a2240",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc384a1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2Fdb%2F8d42db247ebfd59aea6b82a8837b%2Fe1ab28d891eb42fd9664a21472832478"
    },
    {
      "author": null,
      "description": "Russia has accused Ukraine of drone strikes that sparked a fire at a nuclear power plant in the Kursk region Sunday as Ukraine marked its Independence Day. The fire was quickly extinguished with no injuries, though a transformer was damaged. Radiation levels remained normal. The U.N. nuclear watchdog called for protecting all nuclear facilities. Russia claimed to have shot down 95 Ukrainian drones overnight, while Ukraine intercepted 48 of 72 Russian drones. President Zelenskyy addressed the nation from Independence Square, calling for “just peace.” U.S. special envoy Keith Kellogg and Canada’s prime minister visited Kyiv, while Norway pledged $695 million in air defense systems, including Patriot missiles.",
      "publishedAt": "2025-08-24T09:17:53Z",
      "title": "Russia says Ukraine has struck a nuclear power plant in the Kursk region",
      "url": "https://apnews.com/article/russia-ukraine-war-independence-nuclear-164e25c537bf1054bbd426764b6e3bd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f1a0b1/2147483647/strip/true/crop/8563x4817+0+472/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F29%2F59ab765dbdd1c67670bccd0cca19%2F218a636b86d4467f978b5908defe36d3"
    },
    {
      "author": null,
      "description": "Pricey prescriptions and nagging medical costs are swamping some insurers and employers, which means patients may start paying more next year. Health insurance will grow more expensive in many corners of the market in 2026, and some coverage may shrink. That could leave patients exposed to more costs for doctor visits and prescription coverage changes. Price changes could be especially stark in individual coverage marketplaces, where insurers also are predicting the end of some government support that helps people buy coverage. Expensive gene therapies and diabetes and obesity treatments are pressuring prescription coverage.",
      "publishedAt": "2025-08-25T05:00:08Z",
      "title": "Expect health insurance prices to rise next year, brokers and experts say",
      "url": "https://apnews.com/article/health-insurance-drug-costs-2026-rates-c4d865ec09c7088ecc6b55dc520f3566",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fdd661/2147483647/strip/true/crop/5242x2949+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F4a%2Fb5b35641daba538343869cf1623c%2Ffda3c5eda5444ebb9db72bf9d10c38f8"
    },
    {
      "author": null,
      "description": "A posthumous memoir by prominent Jeffrey Epstein accuser Virginia Roberts Giuffre is set for release on Oct. 21. Titled “Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice,” the book was completed before Giuffre died by suicide in April. Publisher Alfred A. Knopf described it Sunday as an unsparing account of her experiences with Epstein, Ghislaine Maxwell, and others, including Britain's Prince Andrew. Giuffre had long alleged she was part of Epstein's sex-trafficking ring. The memoir aims to highlight systemic failures in addressing trafficking and seeks to foster discussions about these injustices. It's co-written by author-journalist Amy Wallace.",
      "publishedAt": "2025-08-24T17:27:07Z",
      "title": "Epstein accuser Virginia Giuffre's memoir will be published",
      "url": "https://apnews.com/article/virginia-giuffre-memoir-jeffrey-epstein-11a44440f4d0e50c8d6f3741640540d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3523a1/2147483647/strip/true/crop/3000x1688+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fc2%2Fcd1bcc38f489c84b692070574aa8%2F827ffcab645f4682afbac70dc83e9590"
    },
    {
      "author": null,
      "description": "Actor Jerry Adler has died at 96. Adler started his career behind the scenes in theater and worked on more than 50 Broadway productions. He later transitioned to acting in his 60s, gaining fame for roles on “The Sopranos” and “The Good Wife.” A New York funeral home confirmed he died Saturday. Adler's acting career spanned more than 30 years, with appearances in shows like “Rescue Me” and “Mad About You.” He also returned to Broadway, onstage this time. He hailed from an entertainment family. His father worked in the theater industry and his cousin was famed acting teacher Stella Adler.",
      "publishedAt": "2025-08-24T13:08:11Z",
      "title": "Jerry Adler, 'Sopranos' actor, dies at 96",
      "url": "https://apnews.com/article/jerry-adler-dies-sopranos-actor-465526928932a9e992350004ca60ff3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a81f655/2147483647/strip/true/crop/2000x1125+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F4f%2F4996e8ceca42a508f2d3855d3f40%2Ffd6497181bcf4bd8880f06dd7abb989d"
    },
    {
      "author": null,
      "description": "President Donald Trump is threatening to deploy military forces to more Democratic-led cities. On Sunday, the president added Baltimore to a list that already includes Chicago and New York. This move comes in a dispute with Maryland's Democratic governor, Wes Moore, who has criticized Trump's use of federal power to combat crime and homelessness. Trump mentioned Moore in a Truth Social post, suggesting he might repeat a National Guard deployment similar to one earlier this year in Los Angeles. Moore had invited Trump to Maryland to discuss public safety. Illinois Governor JB Pritzker has criticized Trump's actions, calling them a manufactured crisis.",
      "publishedAt": "2025-08-24T18:19:16Z",
      "title": "Trump says he might also send troops to police Baltimore",
      "url": "https://apnews.com/article/trump-wes-moore-baltimore-sharpton-national-guard-6cdfd82a1a0dc14e85518c750e8bcc48",
      "urlToImage": "https://dims.apnews.com/dims4/default/647c730/2147483647/strip/true/crop/5526x3108+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F64%2F4da564b51c5f2302034694253dbe%2Fca6d505554c54bc4a79b86d5ed5db16b"
    },
    {
      "author": null,
      "description": "Immigration and Customs Enforcement, or ICE, is key in President Donald Trump's plan for mass deportations. Deportation officers in the Enforcement and Removal Operations unit handle immigration enforcement. They find and remove non-citizens who can't stay in the U.S. for various reasons. ICE also manages detention facilities for those suspected of immigration violations. The agency is rapidly hiring, with Congress approving $76.5 billion to speed up deportations. ICE plans to hire 10,000 more deportation officers by the end of the year. New recruits are trained at the Federal Law Enforcement Training Center in Georgia.",
      "publishedAt": "2025-08-24T11:43:39Z",
      "title": "What to know: Four ways ICE is training new agents and scaling up",
      "url": "https://apnews.com/article/border-immigration-mass-deportation-ice-trump-2bb1cfbafea8c65d167c0c44ca5d7b43",
      "urlToImage": "https://dims.apnews.com/dims4/default/049cec8/2147483647/strip/true/crop/5000x2813+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F90%2F3f83595ca610ae36e8149e27b267%2F9657ceed9b5041019388433ea578a4f2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}