{
  "articles": [
    {
      "author": "NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli military said Sunday it had expanded its ground operations to every part of Gaza and ordered more evacuations in the crowded south, followed by heavy bombardment, as it vowed that operations there against Hamas would be “no less strength” than its earlier offensive in the north.",
      "publishedAt": "2023-12-03T08:21:49Z",
      "title": "Israel says military offensive in crowded southern Gaza will be 'no less strength' than in the north",
      "url": "https://apnews.com/1b93089ec82d10ce89df802d51acc108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b145ca5306c5452a9df17f99204b2a80/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Commercial ships came under attack Sunday by drones and missiles in the Red Sea and a U.S. warship there opened fire in self-defense as part of an hourslong assault claimed by Yemen’s Houthi rebels, officials said.",
      "publishedAt": "2023-12-03T15:59:06Z",
      "title": "Ships face Houthi-claimed attack in Red Sea as officials say a US warship also fires in self-defense",
      "url": "https://apnews.com/716770f0a780160e9abed98d3c48fbde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0db69f6ccba4d1d8a6daa8f05c8c3ed/1500.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "DUBAI, United Arab Emirates (AP) — Vice President Kamala Harris engaged in a speed round of diplomatic talks with Arab leaders on Saturday where she focused on shaping the outlook for a post-conflict Gaza while calling on Israel to do more to protect Palestinian civilians from the “devastating” bombardment.",
      "publishedAt": "2023-12-02T19:28:19Z",
      "title": "Harris focuses on shaping a post-conflict Gaza during a diplomatic blitz in Dubai with Arab leaders",
      "url": "https://apnews.com/52c47491efc64689c7cbc73f68429bf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebbc6ecb339a4da2a3f64e77c1962ed6/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and STEVE PEOPLES",
      "description": "DES MOINES, Iowa (AP) — Three senior members of a super PAC backing Florida Gov. Ron DeSantis left the group on Saturday, the latest sign of instability within the 2024 hopeful's political operation just six weeks before the Iowa Republican caucuses.",
      "publishedAt": "2023-12-03T04:04:56Z",
      "title": "Three officials have left a pro-DeSantis super PAC in the group's latest shake-up, AP sources say",
      "url": "https://apnews.com/6e9f0d3d413b20d74eb6d5e0cbca444e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/050f335dc5584c87a396e10fae199c53/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "The final season of the four-team College Football Playoff turned out to be the most controversial with an unprecedented snub.Michigan, Washington, Texas and Alabama were selected Sunday and Florida State became the first unbeaten Power Five conference champion to be excluded from the field.",
      "publishedAt": "2023-12-03T13:00:33Z",
      "title": "Michigan vs Alabama, Washington vs. Texas in College Football Playoff; unbeaten Florida St left out",
      "url": "https://apnews.com/8b9db687b7cf159779930298d2f1a388",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e85c54055d3d41c4915dfb6fae4301a4/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JORGE RUEDA",
      "description": "CARACAS, Venezuela (AP) — Venezuelans are voting in a referendum Sunday called by the government of President Nicolás Maduro to claim sovereignty over a large swath of neighboring Guyana, arguing the oil- and mineral-rich territory was stolen when the border was drawn more than a century ago.",
      "publishedAt": "2023-12-03T05:01:26Z",
      "title": "Venezuelans vote in a referendum to claim sovereignty of a large territory under dispute with Guyana",
      "url": "https://apnews.com/90a4f0f962a83620903987a68a7d39b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5747f813ec3417bbbab94858c4f6348/1788.jpeg"
    },
    {
      "author": "WILL WEISSERT and JOSH BOAK",
      "description": "DUBAI, United Arab Emirates (AP) — Filling in for President Joe Biden, Vice President Kamala Harris flew to the Middle East to tackle a pair of challenges that have flummoxed White Houses for decades: climate change and the Israeli-Palestinian conflict.",
      "publishedAt": "2023-12-03T18:27:34Z",
      "title": "Harris dashed to Dubai to tackle climate change and war. Each carries high political risks at home",
      "url": "https://apnews.com/7e0ab8e40007f269f3e28eb1d2843e21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfe98864c25d4222bfb67312a7e5e9ce/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Seconds after Palestinian gunmen began shooting up a busy Jerusalem bus stop last week, Yuval Castleman raced toward the scene and opened fire on the attackers — only to be shot and killed by an Israeli soldier who apparently suspected he was also an assailant.",
      "publishedAt": "2023-12-03T17:36:04Z",
      "title": "An Israeli raced to confront Palestinian attackers. He was then killed by an Israeli soldier",
      "url": "https://apnews.com/f5368c1dff72161c701cee488914756a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a282f261d884c8a9d59b5b4e3dded36/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "DUBAI, United Arab Emirates (AP) — With Planet Earth running a fever, U.N. climate talks focused Sunday on the contagious effects on human health.Under a brown haze over Dubai, the COP28 summit moved past two days of lofty rhetoric and calls for unity from top leaders to concerns about health issues like the deaths of at least 7 million people globally from air pollution each year and the spread of diseases like cholera and malaria as global warming upends weather systems.",
      "publishedAt": "2023-12-03T08:30:20Z",
      "title": "Earth is running a fever. And UN climate talks are focusing on the contagious effect on human health",
      "url": "https://apnews.com/ab2a64170501124239db9efaf11d3f77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47923edbf78d405daf589dc079d41933/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Beyoncé ruled the box office this weekend. Her concert picture, “ Renaissance: A Film by Beyoncé,” opened in first place with $21 million in North American ticket sales, according to estimates from AMC Theatres Sunday.",
      "publishedAt": "2023-12-03T16:20:38Z",
      "title": "Beyoncé’s ‘Renaissance’ is No. 1 at the box office with $21 million debut",
      "url": "https://apnews.com/9e2b72e87160f89ecf7f3ed248f40433",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df17e871e6c14a67ba4e7210129a9d6b/1151.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}