{
  "articles": [
    {
      "author": null,
      "description": "Los Angeles police have swiftly enforced a downtown curfew, making arrests moments after it took effect, deploying officers on horseback and using crowd control projectiles to break up a group of hundreds demonstrating against President Donald Trump’s immigration crackdown. Hours later after the curfew went into effect Tuesday night, many of the protesters had dispersed, although small sporadic confrontations continued. Democratic Gov. Gavin Newsom earlier accused Trump of drawing a “military dragnet” across the nation’s second-largest city with his escalating use of the National Guard. He also deployed Marines, though none were seen on the streets Tuesday. Trump ordered the deployment of nearly 5,000 troops, including National Guard and Marines, to LA.",
      "publishedAt": "2025-06-11T05:24:58Z",
      "title": "Los Angeles imposes curfew as protests continue against Trump’s immigration crackdown",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-f39ba39287f628ce8c8be47c92ea6147",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff18fbb/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F47%2F62853facaf44d4f78c7589340768%2F0053e7fa458a4fe2a3545c7cb6d8dd34"
    },
    {
      "author": null,
      "description": "The State Department is preparing to order the departure of all nonessential personnel from the U.S. Embassy in Baghdad due to the potential for regional unrest. That's according to two U.S. officials Wednesday. The Baghdad embassy has already been on limited staffing, and the order will not affect a large number of personnel, but the department is also authorizing the departure of nonessential personnel and family members from Bahrain and Kuwait. That gives them an option on whether to leave the country. Another U.S. official says the Pentagon is standing by to support a potential evacuation of U.S. personnel from U.S. Embassy Baghdad. The officials spoke on the condition of anonymity to detail plans that have not been made public.",
      "publishedAt": "2025-06-11T17:52:22Z",
      "title": "US prepares to order departure of nonessential staff from Baghdad embassy",
      "url": "https://apnews.com/article/state-department-embassy-baghdad-f892ebd6a50850ef5650f31819541bff",
      "urlToImage": "https://dims.apnews.com/dims4/default/7709c8d/2147483647/strip/true/crop/5621x3162+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F6a%2Face3cb0ed2b154bc95ca776bb547%2Fdb3fdf0bd720497aa57d7ab2e0af4837"
    },
    {
      "author": null,
      "description": "President Donald Trump says the United States will get magnets and rare earth minerals from China under a new trade deal and tariffs on Chinese goods will go to 55%. Trump said Wednesday in return the U.S. will allow Chinese students to attend American colleges and universities. An international rights group says several global brands are among dozens of companies at risk of using forced labor through their Chinese supply chains. The report by Global Rights Compliance was released Wednesday. It says the companies might be linked because they use critical minerals or buy minerals-based products sourced from China’s far-western Xinjiang region. China's Foreign Ministry rejects the forced labor claims as lies.",
      "publishedAt": "2025-06-11T01:52:43Z",
      "title": "Trump says US gets minerals from China in trade deal and tariffs go to 55%",
      "url": "https://apnews.com/article/china-xinjiang-critical-minerals-forced-labor-uyghur-eac368889c299fd304a3b7beefc7469a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5303080/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F0d%2F01a7ed45420453325bb70f1271d5%2Fffabafb4784e439489eb2e074da2f9aa"
    },
    {
      "author": null,
      "description": "U.S. Health Secretary Robert F. Kennedy Jr. has named eight new vaccine policy advisers to replace the panel that he abruptly dismissed earlier this week. They include a scientist who researched mRNA vaccine technology and transformed into a conservative darling for his misleading criticisms of COVID-19 vaccines. Kennedy’s decision to “retire” the previous panel was widely decried by doctors’ groups and public health organizations, who feared the advisers would be replaced by a group aligned with Kennedy’s desire to reassess — and possibly end — longstanding vaccination recommendations.",
      "publishedAt": "2025-06-11T21:21:42Z",
      "title": "CDC ACIP vaccine committee replacements named by Robert F. Kennedy Jr.",
      "url": "https://apnews.com/article/cdc-acip-vaccine-committee-9f58e1f004075b081718ff078de88d76",
      "urlToImage": "https://dims.apnews.com/dims4/default/c78e405/2147483647/strip/true/crop/4925x2770+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F46%2Fdff0a65325ac7672447178ee931f%2F3081594bc9674fc9a4ddb3b07fc42e6b"
    },
    {
      "author": null,
      "description": "Brian Wilson of the Beach Boys has died at 82. One of the world’s most beloved and influential musicians, his family posted news of his death to his website Wednesday. The Beach Boys’ many hits include “Good Vibrations,” “California Girls” and “Surfin’ USA.” The eldest and last surviving of three musical brothers, he and his fellow Beach Boys rose from local California act to national hitmakers to international ambassadors of the American dream. Wilson himself was celebrated for his beautiful music and agonizing perfectionism and pitied for the demons that plagued him.",
      "publishedAt": "2025-06-11T16:57:12Z",
      "title": "Brian Wilson of the Beach Boys dies at 82",
      "url": "https://apnews.com/article/brian-wilson-dies-beach-boys-2272762e46c46820a7af09ffc73cb9a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/b616d5f/2147483647/strip/true/crop/4603x2589+0+419/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F46%2F5b9abed44adfc00c49c92f957da8%2F3cb441855b034c2893d37d49517e3184"
    },
    {
      "author": null,
      "description": "Jury deliberations in Harvey Weinstein’s sex crimes retrial are on tenterhooks after the foreperson again requested to speak to the judge about “a situation” he found troubling. The man was questioned Wednesday in private, at his request. He had complained Monday that other jurors were pushing people to change their minds and talking about information beyond the charges. The jury is in its fifth day of deliberations. Weinstein has pleaded not guilty to rape and sexual assault charges.",
      "publishedAt": "2025-06-11T03:59:59Z",
      "title": "More jury drama at Harvey Weinstein's sex crimes retrial",
      "url": "https://apnews.com/article/harvey-weinstein-sexual-assault-trial-31d7a64b75148d1e482f3c020ffea527",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ade6c6/2147483647/strip/true/crop/1251x704+0+65/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F78%2F2248db5a572538d40bf7fc873617%2Fe3026f3652ad4650afba9245fe796283"
    },
    {
      "author": null,
      "description": "The Gaza Health Ministry says that the Palestinian death toll from the 20-month Israel-Hamas war has climbed past 55,000. The ministry doesn't distinguish between civilians and combatants but has said that women and children make up more than half the dead. The ministry gave the updated figures on Wednesday. It’s a grim milestone in the war that began with Hamas’ attack on Oct. 7, 2023 into southern Israel. The war shows no sign of ending. Israel says it only targets militants and blames civilian deaths on Hamas. Israel accuses the militants of hiding among civilians because they operate in populated areas.",
      "publishedAt": "2025-06-11T12:26:21Z",
      "title": "Gaza health officials say more than 55,000 Palestinians have been killed in Israel-Hamas war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-11-2025-5c84e29a249b988e1172cfcf4528cdc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/3181234/2147483647/strip/true/crop/7677x4318+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F7d%2F879b430004220f5e8c266d620283%2F8ee47196adcb4728b36a019a029146c4"
    },
    {
      "author": null,
      "description": "Russian forces have launched a large-scale drone assault across Ukraine, where officials said three people were killed and 64 others wounded. The overnight strikes caused widespread destruction in the northeastern city of Kharkiv, where apartment buildings, private homes, playgrounds, industrial sites and public transportation were hit. Moscow’ has deployed high numbers of drones and missiles in recent days. Ukraine's President Volodymyr Zelenskyy responded by reiterating calls for greater international pressure on Russia.",
      "publishedAt": "2025-06-11T06:07:42Z",
      "title": "Russian attacks kill 3 as drones hit Kharkiv and other parts of Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-kharkiv-7b2760f6b46f5037509fefd6264345aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/faf93d6/2147483647/strip/true/crop/2000x1125+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F8c%2Fd8fc89fc3c4d699494350c2bd454%2F74b9c0113496474087c6a33e3deadee0"
    },
    {
      "author": null,
      "description": "On the 25-year anniversary of Woods’ historic dismantling of Pebble Beach in the U.S. Open — a milestone win that some thought might puncture golf’s stereotype as a sport for rich, white men — Chase Johnson is the only player of Black heritage in the 156-man field at Oakmont. The last man to qualify for this year's Open, Johnson says he's trying to build his profile so maybe he can inspire young players the way Woods once inspired him.",
      "publishedAt": "2025-06-11T19:01:52Z",
      "title": "25 years after Tiger's romp, a huge fan, Chase Johnson, is US Open's only player of Black heritage",
      "url": "https://apnews.com/article/us-open-oakmont-last-man-a42c3ee3b225bfe7b4aadee142407a0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b3108d/2147483647/strip/true/crop/4988x2806+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F3c%2F16b45b4612e84b08922d606e31d2%2F1a0f37dc75ca4c098df121bbfc280a99"
    },
    {
      "author": null,
      "description": "Lots of pet owners let their animals sleep on the bed with them, even though it's probably disturbing their sleep. Melissa Milanak is a professor specializing in sleep health at Medical University of South Carolina. She says most people at her clinic say their pets disturb them often at night. Dogs’ and cats’ natural sleep cycles aren’t the same as those of humans. But people often insist on letting the pets sleep with them anyhow. Generally speaking, having a pet is good for many people’s health. It's been shown to lower humans’ stress levels and get them to exercise, for instance. Many pet owners say they feel comforted having their pets close as they sleep.",
      "publishedAt": "2025-06-11T13:13:54Z",
      "title": "Should you let your pets sleep on the bed with you?",
      "url": "https://apnews.com/article/wellness-pets-bed-sleeping-6cd756b183e23981a3c9884d49fe7895",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc8a7ea/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F4b%2F7f7a1073706fdc45a93baae5e4a7%2Fa83c9d7548824640a56495abc1986833"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}