{
  "articles": [
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — A government shutdown at risk, House Speaker Mike Johnson is fighting to figure out how to meet President-elect Donald Trump's sudden demands — and keep his own job — while federal offices are being told to prepare to shutter operations ahead of Friday's midnight deadline.",
      "publishedAt": "2024-12-19T16:26:07Z",
      "title": "Government shutdown at risk as Trump's demands put Speaker Johnson in a bind",
      "url": "https://apnews.com/e4b5c93d12838d180740a35daecc118d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0ba8c6f192d418999a6c6e3333e7ac8/3000.jpeg"
    },
    {
      "author": "MARK SCOLFORO and MICHAEL R. SISAK",
      "description": "HOLLIDAYSBURG, Pa. (AP) — The suspect in the killing of UnitedHealthcare’s CEO is returning to New York to face murder charges after agreeing to be extradited Thursday during a court appearance in Pennsylvania where he was arrested last week after five days on the run.",
      "publishedAt": "2024-12-19T06:07:46Z",
      "title": "Suspect in killing of UnitedHealthcare CEO returning to New York to face murder charges",
      "url": "https://apnews.com/d6575764b6f4c58108e505e6e5ea896d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2973fb71aa0a46e183261249fad9202d/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A state appeals court on Thursday removed Fulton County District Attorney Fani Willis from the Georgia election interference case against Donald Trump and others but did not dismiss the indictment, leaving the future of the prosecution uncertain.",
      "publishedAt": "2024-12-19T14:59:49Z",
      "title": "Appeals court removes prosecutor Fani Willis from Georgia election case against Trump and others",
      "url": "https://apnews.com/0aa6db3b7abed22eb08ed9323f687972",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b9dcb53e31549d28c4b06e4c43864fb/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER, TOM NOUVIAN and MARINE LESPRIT",
      "description": "AVIGNON, France (AP) — Gisèle Pelicot spoke of her “very difficult ordeal” after 51 men were all found guilty Thursday in the drugging-and-rape trial that turned her into a feminist hero, expressing support for other victims of sexual violence whose cases don't get such attention and “whose stories remain untold.”",
      "publishedAt": "2024-12-19T05:05:47Z",
      "title": "Gisèle Pelicot speaks after ex-husband found guilty of rapes, sentenced to 20 years in France",
      "url": "https://apnews.com/2b25791099f785fabb3c46123d30d9f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd456b80a0a241dd95362732d82dcccd/1920.jpeg"
    },
    {
      "author": "VLADIMIR ISACHENKOV",
      "description": "MOSCOW (AP) — President Vladimir Putin boasted that his military operation in Ukraine has strengthened Russia and denied that the ouster of key ally Bashar Assad in Syria had hurt Moscow’s prestige, as he held his annual news conference and call-in show Thursday.",
      "publishedAt": "2024-12-19T09:14:41Z",
      "title": "Putin boasts of gains in Ukraine at annual news conference meant to reinforce his authority",
      "url": "https://apnews.com/9eab438ab3eb8f9149a6dc5b67d20d86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b077fccab8e4b0e977011e5c3a92c7b/3000.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "MAJDAL SHAMS, Golan Heights (AP) — The four sisters gathered by the side of the road, craning their necks to peer far beyond the razor wire-reinforced fence snaking across the mountain. One took off her jacket and waved it slowly above her head.",
      "publishedAt": "2024-12-19T05:13:01Z",
      "title": "Separated for decades, Assad's fall spurs hope for families split by Golan Heights buffer zone",
      "url": "https://apnews.com/59ed4baf194aec54e1209b5349c4f244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d33877d3f051489c9b72acc7ea41e37f/1920.jpeg"
    },
    {
      "author": "AMY TAXIN and SOPHIA TAREEN",
      "description": "LOS ANGELES (AP) — Winston Leiva rattles off a long list of things immigrants should do to protect themselves against President-elect Donald Trump's promise to conduct mass deportations when he returns to the White House.",
      "publishedAt": "2024-12-19T16:35:46Z",
      "title": "Advocates train immigrants to 'prepare to stay' in the US under Trump",
      "url": "https://apnews.com/ea141413457a04803ce147ecaa11191f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7ba96ef66cc427f8b7f04860fb06fd3/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and SYLVIE CORBET",
      "description": "MAMOUDZOU, Mayotte (AP) — French President Emmanuel Macron arrived Thursday in the Indian Ocean island of Mayotte to survey Cyclone Chido’s destruction and was immediately confronted with a first-hand account of devastation across the French territory.",
      "publishedAt": "2024-12-19T08:03:45Z",
      "title": "France's Macron visits cyclone-devastated Mayotte as residents plead for water, food and other aid",
      "url": "https://apnews.com/604d543a8f020719b3ce5cec320c86fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac16752319a448e1969622267fd54feb/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "California officials have declared a state of emergency over the spread of bird flu, which is tearing through dairy cows in that state and causing sporadic illnesses in people in the U.S.",
      "publishedAt": "2024-12-19T16:28:19Z",
      "title": "California declared an emergency over bird flu. How serious is the situation?",
      "url": "https://apnews.com/e5edab844b409b8ba21feaecb10156d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a54bdc5b064d01b35def7926243701/2579.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "It took more than 100 years, a few billion dollars and the cold, hard realization that you can’t fight progress forever. And now, finally, college football has what the rest of sports have — a legitimate postseason tournament.",
      "publishedAt": "2024-12-19T15:41:51Z",
      "title": "12-team college football playoff arrives after 100 years, a few billion dollars and many detours",
      "url": "https://apnews.com/5f455a13d94a6c9ea3304df2b7998f4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/529143e2ca16486ebc2c5f9cc5eb2c92/1490.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}