{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Republican Sen. Mitch McConnell is announcing that he won’t seek reelection next year. Later Thursday, the Senate is expected to vote on whether to confirm Kash Patel, Trump's pick for FBI director.",
      "publishedAt": "2025-02-20T07:47:00Z",
      "title": "Live updates: Senate to vote on Kash Patel's confirmation for FBI director",
      "url": "https://apnews.com/live/trump-presidency-updates-2-20-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7fd041/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fb3%2Fadfe654a82019da2483c728d6d89%2F47cd07b3ea304741a6e17e2593b4db09"
    },
    {
      "author": "Christopher Rugaber, Paul Wiseman",
      "description": "An idea first proposed on social media has bubbled up to the White House and received President Donald Trump’s enthusiastic endorsement: Take some of the savings from billionaire Elon Musk’s drive to cut government spending and return it to taxpayers. If Musk’s target of $2 trillion in spending cuts is achieved by next year, supporters of the idea say that about one-fifth of those funds could be distributed to taxpaying households in checks of about $5,000. But before you start planning for a windfall, budget experts say such huge savings — nearly one-third of the federal government’s annual spending — are highly unlikely.",
      "publishedAt": "2025-02-20T21:49:10Z",
      "title": "Could Trump really return DOGE savings to taxpayers?",
      "url": "https://apnews.com/article/trrump-doge-checks-inflation-7fb8b5b004faecc213c325fcbafc7ee9",
      "urlToImage": "https://dims.apnews.com/dims4/default/29ffc1e/2147483647/strip/true/crop/5754x3237+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F16%2F21f1a4e7810a1e71dd8822875058%2F1880b583787e4c13a6504341af1af3ee"
    },
    {
      "author": "Brian Slodysko, Eric Tucker, Alan Suderman",
      "description": "President Donald Trump's pick to lead the FBI, Kash Patel, got rich consulting for a roster of foreign clients whose interests may clash with the law enforcement agency he hopes to lead. Patel entered Trump’s orbit as a congressional staffer of modest means. But the years since have been unquestionably lucrative as Patel parlayed his relationship with the Republican to drum up business. An Associated Press review of financial disclosure filings shows Patel is now worth as much as $15 million. But as Patel awaits Senate confirmation, his private-sector work is drawing renewed scrutiny from ethics experts and Democrats. Patel hasn't responded to requests for comment.",
      "publishedAt": "2025-02-07T15:00:36Z",
      "title": "Kash Patel had a roster of foreign clients. Their interests could clash with FBI he hopes to lead",
      "url": "https://apnews.com/article/kash-patel-shein-vance-trump-fbi-aa1e678c283017fb3a9dd3b9de613939",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ea0d5c/2147483647/strip/true/crop/5727x3221+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F58%2F43a6b7e950bb21f4aabc806e3a89%2F447bf784b8de42718ae38a4cba617906"
    },
    {
      "author": "Bruce Schreiner, Kevin Freking",
      "description": "Fellow senators have clapped for Mitch McConnell after he announced he won’t seek reelection next year. The Kentucky Republican is ending a decadeslong tenure as a power broker who championed conservative causes but ultimately ceded ground to the fierce populism of President Donald Trump. McConnell chose his 83rd birthday on Thursday to share his decision to retire when his current term ends in January 2027. McConnell is the longest-serving Senate party leader in U.S. history. McConnell helped forge a conservative Supreme Court and steered the Senate through tax cuts and presidential impeachment trials. McConnell says he still has “some unfinished business to attend to.\"",
      "publishedAt": "2025-02-20T16:15:47Z",
      "title": "Sen. Mitch McConnell won't seek reelection in Kentucky in 2026",
      "url": "https://apnews.com/article/mitch-mcconnell-senate-retirement-34c79ef12bf62d14cb71d3c393f23a83",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4eee55/2147483647/strip/true/crop/8496x4779+0+443/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F0b%2F93a57008f48c44426f90099fb03b%2F5ba9c44e724f48af8fab4a51822b1c22"
    },
    {
      "author": "Steve Peoples, Joey Cappelletti",
      "description": "Pete Buttigieg is quietly contemplating his future from a small city in northern Michigan while talking to Democratic Party officials, labor leaders and top strategists. Some believe Buttigieg is the party’s next savior. The 43-year-old former mayor of South Bend, Indiana, and recently retired U.S. transportation secretary has yet to decide if that’s a responsibility he wants. Buttigieg must decide soon whether he wants to return to the national spotlight as a candidate in Michigan’s 2026 Senate race or focus on a much more consequential role as his party’s next presidential nominee two years later. Prominent allies believe Buttigieg cannot feasibly run for the Senate and the presidency.",
      "publishedAt": "2025-02-20T14:07:45Z",
      "title": "Buttigieg weighs a decision with huge implications for Democrats: Run for Senate or president?",
      "url": "https://apnews.com/article/buttigieg-democrats-michigan-senate-president-2026-2028-9be5c4c8e91437d6202b58c853bd8a08",
      "urlToImage": "https://dims.apnews.com/dims4/default/5cb028a/2147483647/strip/true/crop/4952x2786+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2Ffe%2F44ecce01a628a853f6707ee33f1f%2F8c2f06243dd74659ade7467802859702"
    },
    {
      "author": "Matt Brown, Michelle L. Price",
      "description": "President Donald Trump marked Black History Month at the White House on Thursday by making an appearance at a celebratory reception with a surprise guest, golf legend Tiger Woods, while calling out other athletes in attendance and marveling at the size of the crowd. Trump also announced he planned to bring Alice Johnson, a prison reform advocate whom he pardoned in 2020, into his administration to work on clemency issues. The White House’s Black History Month reception preserved a tradition, but it comes in the wake of Trump issuing a wide-ranging executive order ending the federal government’s diversity, equity and inclusion programs has disrupted its observance elsewhere.",
      "publishedAt": "2025-02-20T05:14:14Z",
      "title": "Trump holds Black History Month event amid anti-DEI push",
      "url": "https://apnews.com/article/trump-black-history-month-54b47c00249e9c9dc723c5f2c9ebcca9",
      "urlToImage": "https://dims.apnews.com/dims4/default/bdd3553/2147483647/strip/true/crop/3620x2036+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F70%2Fffef5aa5b8bc7428de5e63c68c94%2F3ab499a83d474fa49792fbeebe9b14ca"
    },
    {
      "author": "Rebecca Reynolds",
      "description": "President Donald Trump says Elon Musk will be looking at Fort Knox, the legendary depository in Kentucky for American gold reserves, to make sure the gold is still there. Treasury Secretary Scott Bessent says there is an audit every year and that “all the gold is present and accounted for.” The United States Bullion Depository at Fort Knox has stored precious metal bullion reserves for the United States since 1937 and has become synonymous for secure and well protected. Along with protecting gold reserves, Fort Knox is currently also used as the Army's human resources command center, and it hosts the Army’s largest annual training event each summer.",
      "publishedAt": "2025-02-20T19:36:27Z",
      "title": "What to know about Fort Knox's gold depository",
      "url": "https://apnews.com/article/fort-knox-gold-reserves-elon-musk-338bebb56885c142feaa0ff383c9ba37",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ea3726/2147483647/strip/true/crop/2978x1675+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F10%2Fdadfb30ee767ea5ac41f1bad7048%2Fecbf5d53fc0a4510a5ac625ce92bcdbe"
    },
    {
      "author": "Eric Tucker",
      "description": "The Senate is set to vote on whether to confirm Kash Patel as FBI director. Thursday's vote that would place Patel atop the nation’s premier federal law enforcement agency despite concerns from Democrats over his qualifications and the prospect he would do President Donald Trump’s bidding. Patel’s nomination has now advanced in a 51-47 party-line vote, putting him on track for confirmation in the Republican-controlled Senate in the afternoon. To deny Patel's the job, more than three Republican senators would have to defy Trump’s will and vote “no,” and that's seen as unlikely.",
      "publishedAt": "2025-02-20T05:01:40Z",
      "title": "Senate pushes toward confirmation of Kash Patel as Trump's FBI director",
      "url": "https://apnews.com/article/trump-patel-fbi-justice-department-518329110ea230e2989095bfcbe34c59",
      "urlToImage": "https://dims.apnews.com/dims4/default/817e2b2/2147483647/strip/true/crop/5798x3261+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F39%2F462a8fd9031d0ba12315ae77bb72%2Fad175c9d34e349699c1c0224784ea5e4"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican says that Pope Francis’ clinical condition is “improving slightly,” adding that he went about his work activities from the hospital where he is recovering from pneumonia. In a late update, Vatican spokesman Matteo Bruni said Francis has no fever and that his key parameters “continue to be stable.” The 88-yearold pope was admitted to the hospital on Feb. 14 after a case of bronchitis worsened; doctors later diagnosed the onset of pneumonia in both lungs on top of asthmatic bronchitis.",
      "publishedAt": "2025-02-20T07:44:31Z",
      "title": "Vatican says Pope Francis is 'improving slightly' as cardinals acknowledge resignation is possible",
      "url": "https://apnews.com/article/pope-francis-recovers-pneumonia-hospital-e489cc4f7f4e0d43b7c9079667953e9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3b19c3e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F71%2F7b5bc5855f9c7777238afde75cb9%2F8d55fd607dcc44eab2e6aecf599b2804"
    },
    {
      "author": null,
      "description": "Six New York prison workers have been indicted for second-degree murder in the beating death of an inmate who was handcuffed, while four others were charged with lesser crimes. The beating of 43-year-old Robert Brooks by multiple officers at Marcy Correctional Facility in December was caught on body cameras. The special prosecutor began to detail how many people are charged and what the charges are in a court appearance Thursday afternoon. He has previously said he would not comment on the investigation until a grand jury has acted.",
      "publishedAt": "2025-02-20T05:02:01Z",
      "title": "Some New York prison guards charged in beating death of handcuffed inmate appear in court",
      "url": "https://apnews.com/article/new-york-prison-death-prosecutor-brooks-handcuffed-a3e40b59320b8c732d48bbf032304664",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4ebccf/2147483647/strip/true/crop/3000x1688+0+7/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fed%2F5f00d054dd9ceb702f66951bc9c1%2Fffd8ebde1d26407993b5f947907ff776"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}