{
  "articles": [
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — Approaching a midnight government shutdown deadline, the Senate set up votes toward final passage late Friday of a new plan that would temporarily fund federal operations and disaster aid, but drops President-elect Donald Trump's demands for a debt limit increase into the new year.",
      "publishedAt": "2024-12-20T15:21:15Z",
      "title": "Senate eyes vote before midnight on government funding after House approves bill to prevent shutdown",
      "url": "https://apnews.com/da117337aa0c0adab34a5626bb5816af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9175b538421048c580602001238cfb37/1920.jpeg"
    },
    {
      "author": "BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Johnny Zuagar says he’s tried to hide his worries about a potential government shutdown from his three boys as he weighs how much to spend on Christmas presents.",
      "publishedAt": "2024-12-20T23:50:49Z",
      "title": "Government funding difficulties create gloom for federal workers before Christmas",
      "url": "https://apnews.com/77886d390eb5e69fd961109297736230",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbe940bb41ad4a10969b7fb3e9ff87cf/3000.jpeg"
    },
    {
      "author": "EBRAHIM NOROOZI, CHRIS STERN and GEIR MOULSON",
      "description": "MAGDEBURG, Germany (AP) — A car plowed into a busy outdoor Christmas market in the eastern German city of Magdeburg on Friday, killing at least two people and injuring at least 60 others in what authorities called a deliberate attack.",
      "publishedAt": "2024-12-20T19:02:06Z",
      "title": "At least 2 dead and 60 hurt after a car drives into a German Christmas market in a suspected attack",
      "url": "https://apnews.com/6b2bcf305eb9f60f8d7273949dbba4c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29758af4bc904c2daaab8d026910ec25/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WEST PALM BEACH, Fla. (AP) — The smooth economy that Donald Trump was poised to inherit suddenly looks a bit rockier — with critics saying the president-elect is contributing to the uncertainty.The Dow Jones stock index essentially ended Thursday flat after having posted 10 days of losses.",
      "publishedAt": "2024-12-20T12:00:54Z",
      "title": "Trump was poised to inherit a strong economy. Then things got rocky and he added to the uncertainty",
      "url": "https://apnews.com/73d12a23ca26bb02883e6194a957affe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5422a809f4134241a5d8a1003fde56a7/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — President Joe Biden secured the 235th judicial confirmation of his presidency Friday, an accomplishment that exceeds his predecessor's total by one after Democrats put extra emphasis on the federal courts following Donald Trump's far-reaching first term, when he filled three seats on the Supreme Court.",
      "publishedAt": "2024-12-20T16:38:16Z",
      "title": "Senate approves 235th judge of Biden's term, beating Trump's tally",
      "url": "https://apnews.com/db2ac97d2852f0be212c05b8e674b1c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/313412ca628a469a9b9a78f14ab4d804/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "CAIRO (AP) — Even with hopes running high, so much can go wrong when a country ousts a longtime dictator and tries to start anew. The Middle Eastern and North African nations that attempted to transition to democracy in recent years can attest to that.",
      "publishedAt": "2024-12-20T17:29:10Z",
      "title": "What will Syria's future look like? The answer could lie in other Arab countries' recent pasts",
      "url": "https://apnews.com/51635b7aabc0760bb7841829586ede7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4db51c2ee1df4390a891953e4f3565d4/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Amazon delivery drivers and Starbucks baristas are on strike in a handful of U.S.",
      "publishedAt": "2024-12-20T23:43:27Z",
      "title": "Amazon and Starbucks workers are on strike. Trump might have something to do with it",
      "url": "https://apnews.com/64c5c5df331f55ee247365a5a303757d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe37f3586e374bcca1fec2369ad0e575/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — A judge ruled Friday that Missouri’s near-total abortion ban is unenforceable under a new constitutional amendment, though Planned Parenthood said the decision is still not sufficient for it to resume providing abortions in the state.",
      "publishedAt": "2024-12-20T23:59:00Z",
      "title": "A judge says Missouri's abortion ban isn’t enforceable, but there's no start date for abortions",
      "url": "https://apnews.com/8a846e1490a965977133eb5854a7602e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a752ecc1a4b4745b6cd7bd9bda78607/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau's chances of staying on in power have become more tenuous after the opposition party that backed his government for years announced it will vote no confidence in the government when Parliament resumes.",
      "publishedAt": "2024-12-20T14:49:03Z",
      "title": "Canada's Trudeau reshuffles his Cabinet as resignation calls mount and new election threat looms",
      "url": "https://apnews.com/1f222c037bbe7d1e8d68845f91d76417",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34feb7c1ce344a1f861dc2f6f3cbec99/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Drivers and airline passengers without reindeer and sleighs better make a dash for it: it's beginning to look like another record for holiday travel in the U.S.",
      "publishedAt": "2024-12-20T05:10:27Z",
      "title": "It's beginning to look like another record for holiday travel",
      "url": "https://apnews.com/02023bc4a9975d5bb0ac0aedbbaedeb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/031c841181e64db58ca3682e8f3d8a44/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}