{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — AP sources: Israel is conducting small, precision raids across the border in Lebanon and a larger operation is planned.",
      "publishedAt": "2024-09-30T16:53:40Z",
      "title": "AP sources: Israel is conducting small, precision raids across the border in Lebanon and a larger operation is planned",
      "url": "https://apnews.com/f4685fe134d8cde6df50f48271a3cc82",
      "urlToImage": ""
    },
    {
      "author": "MATTHEW LEE, SAMY MAGDY, ABBY SEWELL and NATALIE MELZER",
      "description": "BEIRUT (AP) — Israel has launched small, precision raids across the border in Lebanon and a larger ground operation is being planned, according to two officials.It was not clear if Israel had made a final decision on a broader operation.",
      "publishedAt": "2024-09-30T09:14:51Z",
      "title": "Israel launches small raids across the border with Lebanon, larger operation planned, officials say",
      "url": "https://apnews.com/83ea5f243688f309754ec74850de4238",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf7f5b35984f4736a03607386d2e620d/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and JACK JEFFERY",
      "description": "BEIRUT (AP) — In just over a week, intensified Israeli strikes in Lebanon killed seven high-ranking commanders and officials from the powerful Hezbollah militant group, including the group's leader, Hassan Nasrallah.",
      "publishedAt": "2024-09-29T20:27:44Z",
      "title": "Who were the 7 high-ranking Hezbollah officials killed over the past week?",
      "url": "https://apnews.com/8b2ae56a54d641c6910a79e9e5699824",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8efb16f1d164e238a0d6cb670458b97/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS, KATE PAYNE and PATRICK WHITTLE",
      "description": "ASHEVILLE, N.C. (AP) — Desperate residents isolated by washed out roads and the lack of power and cellular service in western North Carolina lined up for fresh water Monday, days after Hurricane Helene ripped through the Southeastern U.S.",
      "publishedAt": "2024-09-30T04:41:03Z",
      "title": "Supplies rushed to communities isolated by Helene as death toll passes 100",
      "url": "https://apnews.com/f02869c7d01e68f2d7f0553abb82252f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98d4eee33b8b46828f3bd4b90eb1a6a3/1920.jpeg"
    },
    {
      "author": "MAE ANDERSON and ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — U.S. ports from Maine to Texas could shut down Tuesday if a union representing about 45,000 dockworkers carries through with a threatened strike.",
      "publishedAt": "2024-09-30T10:57:20Z",
      "title": "A dockworkers strike could shut down East and Gulf ports. Will it affect holiday shopping?",
      "url": "https://apnews.com/d926e9cfb3f10efb50af89d3c96bdc3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6025e6265ba449f48637a15485b39a0b/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump has suggested that “one rough hour” of law enforcement action would tamp down retail theft, an echo of his longstanding support for more aggressive and potentially violent policing.",
      "publishedAt": "2024-09-30T16:03:06Z",
      "title": "Donald Trump suggests 'one rough hour' of policing will end theft",
      "url": "https://apnews.com/766351074cc53c543e89966651ba0614",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df490146a5674238869f3d726633fb49/2864.jpeg"
    },
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris poked at Donald Trump over crowd sizes, his refusal to debate again and his privileged background on Sunday as she hauled in campaign cash in California and held a raucous rally at the same Nevada venue where the Republican nominee had appeared just two weeks ago.",
      "publishedAt": "2024-09-29T11:24:02Z",
      "title": "Harris trolls Trump at Vegas rally and LA fundraiser, says her crowds are 'pretty big'",
      "url": "https://apnews.com/5e43f8e9159925cea38070e0bb662e47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55c6c41a59634d9da61ff7ebc1b9c8a8/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Republicans are pointing to newly released immigration enforcement data to bolster their argument that the Biden administration is letting migrants who have committed serious crimes go free in the U.S. But the numbers have been misconstrued without key context.",
      "publishedAt": "2024-09-30T04:11:29Z",
      "title": "Trump is pointing to new numbers on migrants with criminal pasts. Here's what they show",
      "url": "https://apnews.com/fc19e795599471c0ab21d76050a71a74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20d659c021094fb8a3964065ba15e6ee/2618.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Shigeru Ishiba, the head of Japan's governing party, plans to call a parliamentary election to be held on Oct.",
      "publishedAt": "2024-09-30T07:06:46Z",
      "title": "Japan's likely next leader says he will call an election for Oct. 27 once he takes office",
      "url": "https://apnews.com/37d55017bea0a9c93c7b98cf6ab3f2d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c85dfb6a8b3b4908b5c635edaeb07a31/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — Indonesian shrimp farmer Yulius Cahyonugroho operated more than two dozen ponds only a few years ago, employing seven people and making more than enough to support his family. Since then, the 39-year-old says the prices he gets from purchasers have fallen by half and he's had to scale back to four workers and about one-third the ponds, some months not even breaking even.",
      "publishedAt": "2024-09-30T04:10:22Z",
      "title": "As big supermarkets pursue profits, new research shows growing exploitation of shrimp farmers",
      "url": "https://apnews.com/d29e3c24a1a20d3815f5418829a6bbe9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54b0721517a64343aae5c7cedf1f7abd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}