{
  "articles": [
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un may travel to Russia for a summit with President Vladimir Putin, a U.S.",
      "publishedAt": "2023-09-05T11:40:36Z",
      "title": "Kim Jong Un and Putin may meet. What do North Korea and Russia need from each other?",
      "url": "https://apnews.com/c44735b9903e6f30e7e8d673ef4c77f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24f036cecf9a4129938f09e4e7a1222d/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Former Proud Boys national chairman Enrique Tarrio will be sentenced on Tuesday for a plot to attack the U.S.",
      "publishedAt": "2023-09-05T10:42:07Z",
      "title": "Former Proud Boys leader Enrique Tarrio faces sentencing in the Jan. 6 Capitol attack",
      "url": "https://apnews.com/da60222b3e1e54902db2bbbb219dc3fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63ad61379403480cbb06f8fd86c077a5/2360.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — The end of Labor Day weekend would typically mark the start of a furious sprint to the Iowa caucuses as candidates battle for their party's presidential nomination.",
      "publishedAt": "2023-09-05T04:04:04Z",
      "title": "The next presidential campaign is coming into focus. It might look a lot like the last one",
      "url": "https://apnews.com/c84d0905fd5d238e088618c5ed41c2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d594fba6506a4e6d9b93f817be34842a/3000.jpeg"
    },
    {
      "author": "JAKE BLEIBERG and PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — The Texas Senate is set to gavel in Tuesday for the impeachment trial of Attorney General Ken Paxton, a political reckoning of years of alleged corruption that could lead to his permanent ouster from office.",
      "publishedAt": "2023-09-05T04:18:32Z",
      "title": "The impeachment trial of Attorney General Ken Paxton is set to begin in the Texas Senate",
      "url": "https://apnews.com/07dd432612e7615ec6221b3411034083",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e3d2672707441948d78875efa491c8a/3000.jpeg"
    },
    {
      "author": null,
      "description": "BLACK ROCK DESERT, Nev. (AP) — Muddy roads flooded by a summer storm that left tens of thousands of partygoers stranded for days at the Burning Man counterculture festival had dried up enough by Monday afternoon to allow them to begin their exodus from the northern Nevada desert.",
      "publishedAt": "2023-09-04T16:48:17Z",
      "title": "Burning Man revelers begin exodus after flooding left tens of thousands stranded in Nevada desert",
      "url": "https://apnews.com/0726190c9f8378935e2a3cce7f154785",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d42bae92218a4c68b25caea232ad1814/1920.jpeg"
    },
    {
      "author": "EDNA TARIGAN and NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — Indonesian President Joko Widodo will welcome fellow Asian and world leaders with a captivating jungle scene of a two-story waterfall, wild orchids and even an orangutan perched up a tree.",
      "publishedAt": "2023-09-05T06:50:51Z",
      "title": "An orangutan, chirping birds and a waterfall at ASEAN venue contrast to Jakarta's pollution outside",
      "url": "https://apnews.com/273d65d78dfc551a954d6f33765d6292",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cae6b238baa84f44b59aea215561e2ee/3000.jpeg"
    },
    {
      "author": "EVA VERGARA and DANIEL POLITI",
      "description": "SANTIAGO, Chile (AP) — The world remembers Gen. Augusto Pinochet as the dictator whose regime tortured, killed and disappeared 3,065 people in the name of fighting communism.",
      "publishedAt": "2023-09-05T06:08:07Z",
      "title": "A half-century after Gen. Augusto Pinochet's coup, some in Chile remember the dictatorship fondly",
      "url": "https://apnews.com/5d500715f016804990d0898ff6d89907",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a694decc6b14dc4ae28ff750bb4992a/1992.jpeg"
    },
    {
      "author": "ABBY SEWELL and OMAR ALBAM",
      "description": "AIN SHEEB, Syria (AP) — More than 300 people were killed and over 600 wounded by cluster munitions in Ukraine in 2022, according to an international watchdog, surpassing Syria as the country with the highest number of casualties from the controversial weapons for the first time in a decade.",
      "publishedAt": "2023-09-05T07:40:16Z",
      "title": "Cluster munition deaths in Ukraine pass Syria, fueling rise in a weapon the world has tried to ban",
      "url": "https://apnews.com/0ffa6fccfd4bf335f8b3e345afbe8e8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b84afa7de34f5f8283325a4510e904/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — First lady Jill Biden tested positive for COVID-19 Monday but is experiencing only mild symptoms, her spokeswoman said.President Joe Biden was tested for the virus following his wife's positive test, but his results were negative.",
      "publishedAt": "2023-09-05T01:15:38Z",
      "title": "First lady Jill Biden tests positive for COVID-19, but President Biden's results negative so far",
      "url": "https://apnews.com/24b43a5009e85ad6dc0524fafcf484ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6420102bbf8498b951c9bbbafbd41a5/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "When the NFL season kicks off this week, Kentucky residents and visitors — for the first time — will be able to legally place sports bets on something other than horse racing.",
      "publishedAt": "2023-09-05T04:43:11Z",
      "title": "As sports betting spikes, help for problem gamblers expands in some states",
      "url": "https://apnews.com/ad0f4b79a25cceafd2e0e9745c23b33d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9383b6722c3d42ee91d4b20a38ea9ebc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}