{
  "articles": [
    {
      "author": null,
      "description": "The Trump administration has released records of the FBI’s surveillance of Martin Luther King Jr., despite opposition from the slain Nobel laureate’s family and the civil rights group that he led until his 1968 assassination. The release involves an estimated 200,000 pages of records that had been under a court-imposed seal since 1977. King’s family, including his two living children, Martin III and Bernice, were given advance notice of the release and had their own teams reviewing the records ahead of the public disclosure. The release is part of President Donald Trump’s order to publicly disclose government files on King and the assassinations of President John F. Kennedy and Robert F. Kennedy.",
      "publishedAt": "2025-07-21T19:46:08Z",
      "title": "Trump administration releases FBI records on MLK Jr.",
      "url": "https://apnews.com/article/martin-luther-king-fbi-files-donald-trump-1a58c3f0c9ec8878e487434e0d372b81",
      "urlToImage": "https://dims.apnews.com/dims4/default/155b4fc/2147483647/strip/true/crop/3000x1688+0+164/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2Fa7%2F92f015ce3b22203bfa84d08a1c8b%2F35497b9eabec42fea7f9037f0c8cc8f8"
    },
    {
      "author": null,
      "description": "The long-range Russian drones come in swarms each night, buzzing over Ukraine by the hundreds, terrorizing the population and attacking targets from the industrial east to areas near its western border with Poland. Russia now batters Ukraine with more drones in a single night than it did during some entire months in 2024. Analysts say the barrages are likely to escalate. On July 8, Russia unleashed more than 700 drones — a record. Some experts say that could soon reach 1,000 a day. This comes amid a U.S. ultimatum for Russia to reach a ceasefire by Sept. 2 or face tough sanctions -– a timeframe Moscow is likely to use to inflict as much damage as possible.",
      "publishedAt": "2025-07-22T04:09:03Z",
      "title": "Russia ramps up aerial attacks on Ukraine after boosting its drone production",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-putin-attacks-0a06736dea37114aa0f351d21746912b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1af3169/2147483647/strip/true/crop/6250x3516+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ffa%2F7256e899626e77e3b71384f8f49c%2F8ee975ab475a40e595962e08d4cb19ec"
    },
    {
      "author": null,
      "description": "A federal judge has sentenced an ex-Kentucky police officer to nearly three years in prison for using excessive force during the 2020 deadly Breonna Taylor raid, declining a U.S. Justice Department recommendation that no prison time be given the defendant. Brett Hankison, who fired 10 shots during the raid but didn’t hit anyone, was the only officer on the scene charged in the Black woman's death. He is the first person sentenced to prison in the case that rocked the city of Louisville and spawned weeks of street protests over police brutality five years ago. U.S. District Judge Grady Jennings sentenced Hankison at a hearing Monday afternoon.",
      "publishedAt": "2025-07-21T18:30:45Z",
      "title": "Federal judge gives ex-officer nearly 3 years in Breonna Taylor raid",
      "url": "https://apnews.com/article/breonna-taylor-raid-hankison-sentence-4da93877da13f506be42cc1c738cab2b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab05a97/2147483647/strip/true/crop/5292x2977+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F78%2Fe753ba26439dd4dde6cce6c3350d%2Fbc1f1766631f4be08adfee2dc309848a"
    },
    {
      "author": null,
      "description": "The Bangladeshi military says an Air Force training aircraft has crashed into a school campus in the capital, Dhaka, killing at least 18 people. The military and a fire official say the Chinese-made F-7 BGI aircraft crashed shortly after takeoff into the campus of Milestone School and College on Monday afternoon as students were attending classes. Local media indicated most of the injured were students. The cause of the crash was not immediately clear. It is the deadliest airplane crash in the Bangladeshi capital in recent memory.",
      "publishedAt": "2025-07-21T08:42:26Z",
      "title": "A Bangladesh Air Force jet crashes into a Dhaka school and kills 18",
      "url": "https://apnews.com/article/bangladesh-air-force-training-jet-crash-school-dhaka-4fd5d521dd2f25e06361ac3a7c19bc2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/0253463/2147483647/strip/true/crop/3274x1842+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fe5%2F4e375a483c524089ae8f84dd1c85%2F3015a7af69404d629afaf8a4de5ad5c0"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to host Philippine President Ferdinand Marcos Jr. at the White House. The visit Tuesday highlights efforts to strengthen security and economic ties between the two countries as tensions rise in the Indo-Pacific. Their talks are expected to focus on mutual defense as China has become increasingly assertive in the South China Sea, where Manila and Beijing have clashed over hotly contested territory. The leaders also are negotiating a potential tariffs deal. Marcos met with Secretary of State Marco Rubio and Defense Secretary Pete Hegseth on Monday. Both sides emphasized their commitment to regional peace and economic collaboration.",
      "publishedAt": "2025-07-22T04:03:11Z",
      "title": "Trump and Philippine leader plan to talk tariffs and China",
      "url": "https://apnews.com/article/marcos-trump-philippines-china-tariffs-3138d1d7f8368c022ab9242bebb4a2e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb924e5/2147483647/strip/true/crop/8149x4584+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fd7%2F50e244c4ee5ef13ad2cf18e01a96%2F373ad20f45084a899ce3a054e493147c"
    },
    {
      "author": null,
      "description": "President Donald Trump is threatening to hold up a stadium deal for Washington's football team if it doesn't restore its old name. Trump said Sunday on his social media site that the Washington Commanders should revert to the Redskins and the Cleveland Guardians should return to the Indians. Later in the day, he threatened the NFL team's stadium deal. The Commanders and Guardians changed their names in 2022 after years of debate over logos and names considered offensive. Both teams have stated they have no plans to change them back.",
      "publishedAt": "2025-07-20T17:52:25Z",
      "title": "Trump threatens to hold back stadium deal for Commanders over team name",
      "url": "https://apnews.com/article/trump-indians-redskins-guardians-commanders-8863d8d95f56414f0f74cab0e897a93f",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b4cba6/2147483647/strip/true/crop/5967x3356+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F95%2F3127d2f616eab2b8f82b7dd51adb%2F0c0f380a3cfb41ea8b075b9d1a5a7ac4"
    },
    {
      "author": null,
      "description": "Harvard University appears in federal court Monday, challenging $2.6 billion in funding cuts by the Trump administration. The university accuses the government of using funding as leverage to control its academic decisions. The cuts followed Harvard's rejection of demands from a federal antisemitism task force. The task force wanted sweeping changes to Harvard's policies on campus protests, admissions, hiring and more. Harvard, with a $53 billion endowment, has self-funded some research but warns it can't cover all losses. The Trump administration denies retaliation, stating the cuts align with its policies.",
      "publishedAt": "2025-07-21T10:19:58Z",
      "title": "Harvard in court over Trump's cuts in research funding",
      "url": "https://apnews.com/article/harvard-trump-funding-cuts-court-0e9100198461e1df52b5a5a4d11837ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/91db8f7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F82%2F7fa8059ab65e1c130f74ba99bde9%2Fa9d7cc75e3234e22a1a61cee595a6310"
    },
    {
      "author": null,
      "description": "The Pentagon has ordered U.S. Marines to leave Los Angeles after more than a month in the city. The 700 Marines were deployed on June 9 during protests against the administration’s immigration policies. Their presence was limited to federal buildings, including an ICE office and detention facility. On Monday, the Pentagon decided to withdraw the Marines following last week’s reduction of half of the National Guard troops in the city. Pentagon spokesman Sean Parnell stated the military presence sent a strong message against lawlessness. About 2,000 National Guard troops remain in Los Angeles.",
      "publishedAt": "2025-07-21T20:14:41Z",
      "title": "Pentagon withdraws 700 Marines from Los Angeles",
      "url": "https://apnews.com/article/los-angeles-marines-immigration-protests-3119cb5c59f4a8d9a8937d90b9ae1224",
      "urlToImage": "https://dims.apnews.com/dims4/default/c321f2e/2147483647/strip/true/crop/7785x4379+0+405/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F2e%2F38c9a63ef6e0973107c57169650f%2F4bb1f2f888a34630830f5bf709ffadda"
    },
    {
      "author": null,
      "description": "The U.N. food agency says Israeli forces fired on Palestinians seeking food aid in northern Gaza on Sunday. Gaza's Health Ministry says at least 80 people were killed trying to access aid supplies. Israel says its forces fired warning shots to address a threat and questioned the death toll. The World Food Program condemned the violence, stating in a statement that the crowd was fired upon by Israeli tanks and snipers. Israel has meanwhile widened its evacuation orders for Gaza, indicating a new battleground may be opening up and squeezing Palestinians into ever tinier stretches of land. Gaza’s Health Ministry says the Palestinian death toll has now surpassed 59,000.",
      "publishedAt": "2025-07-21T09:32:09Z",
      "title": "UN food agency says Israel used tanks and snipers to fire on a crowd seeking aid in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-07-21-2025-01d877899f729d35cb1c9864d449ce53",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e50f6b/2147483647/strip/true/crop/8010x4506+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F62%2Fdbd408b6b179c7dcfdcefdecc4a1%2F0852109969074d8fb8bed75b1be66f15"
    },
    {
      "author": null,
      "description": "Lawyers for Kilmar Abrego Garcia have asked a federal judge in Tennessee to delay releasing him from jail while he awaits trial on human smuggling charges. The request is an effort to prevent the Trump administration from deporting the Maryland construction worker for a second time. Abrego Garcia become a prominent face in the debate over President Donald Trump’s immigration policies when he was wrongfully deported to his native El Salvador in March. The administration returned him to the U.S. last month to face the smuggling charges. U.S. officials say they'll try to deport him again if he's released from jail.",
      "publishedAt": "2025-07-21T14:39:31Z",
      "title": "Kilmar Abrego Garcia’s lawyers ask judge to delay release from jail over deportation fears",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-release-jail-deportation-trial-c17d7ba538530a668e4f55358e83c0fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/1aa78ce/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F79%2F8fa7b9d7e8cd7f9955b65943098b%2F6eec930538d44fc78ef6fcfd51b346b2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}