{
  "articles": [
    {
      "author": "ZEKE MILLER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family.",
      "publishedAt": "2024-12-02T00:37:34Z",
      "title": "Biden pardons his son Hunter despite previous pledges not to",
      "url": "https://apnews.com/24f3007c2d2f467fa48e21bbc7262525",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88ed9c48f94347cdb1371ed1d92349c5/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — President Joe Biden had long pledged that he would not pardon his son, Hunter, who was set to be sentenced this month for gun and tax convictions. But on Sunday, the president did it anyway.",
      "publishedAt": "2024-12-02T03:26:01Z",
      "title": "Biden has pardoned his son Hunter. What does that mean?",
      "url": "https://apnews.com/9307d6bade834df77c265cae7d3b7c25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dea10f70bc5b44bfa5efa506a4879aa6/2000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The U.N. agency for Palestinian refugees said Sunday it is halting aid deliveries through the main cargo crossing into the war-ravaged Gaza Strip because of the threat of armed gangs who have looted convoys.",
      "publishedAt": "2024-12-01T07:41:27Z",
      "title": "UN halts aid shipments through Gaza's main crossing after looting. It blames the crisis on Israel",
      "url": "https://apnews.com/6118019c9bc11204026b686206be8f6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcca616d4e5143eca3a6b28e8a051063/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The Syrian military rushed reinforcements to the northwest and launched airstrikes Sunday in an attempt to push back insurgents who seized the country’s largest city of Aleppo, as Iran pledged to help the government counter the surprise offensive.",
      "publishedAt": "2024-12-01T10:20:09Z",
      "title": "Syria launches counterattacks in an attempt to halt insurgency, as Iran's top diplomat meets Assad",
      "url": "https://apnews.com/a8d7ddd45d3cb6b7aa943957b2ac6d9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/617d1fe8ba804ae4a5be135a9b37780d/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and FADI TAWIL",
      "description": "TYRE, Lebanon (AP) — Israeli jets Sunday launched an airstrike over a southern Lebanese border village, while troops shelled other border towns and villages still under Israeli control, Lebanon's state-run National News Agency reported.",
      "publishedAt": "2024-12-01T15:41:45Z",
      "title": "Israeli strikes hit southern Lebanon, but tense ceasefire holds",
      "url": "https://apnews.com/ae002af23c7ec9e19a0cea08fecc9f62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c33cc1c29efa4943a5e82f640fad3463/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep, Citroën and Ram, amid an ongoing struggle with slumping sales.",
      "publishedAt": "2024-12-01T20:14:41Z",
      "title": "Stellantis CEO Carlos Tavares steps down as carmaker continues struggle with slumping sales",
      "url": "https://apnews.com/df052376ff0ace08fd94a7821cb73317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/454cf38d6b894e1da1f769b27826d237/3000.jpeg"
    },
    {
      "author": "CARA ANNA, CAROLYN THOMPSON and JONAH BRONSTEIN",
      "description": "ORCHARD PARK, N.Y. (AP) — Lake-effect snow blanketed swaths of the U.S. as Thanksgiving travelers journeyed home this holiday weekend, with more snow expected to fall over the Great Lakes region through the week.",
      "publishedAt": "2024-12-01T05:45:28Z",
      "title": "Lake-effect snow blankets the Great Lakes as Thanksgiving travelers head home",
      "url": "https://apnews.com/e38431108b6441a859f9664388b321d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aafe7fd2b44647ae9a31d50544e091d3/1920.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canada's ambassador to the United States said Sunday that Prime Minister Justin Trudeau was successful in getting President-elect Donald Trump and key Cabinet nominees to understand that lumping Canada in with Mexico over the flow of drugs and migrants into the U.S.",
      "publishedAt": "2024-12-01T20:17:18Z",
      "title": "Canada's ambassador says Trudeau told Trump the Canadian border can't be compared to Mexico's",
      "url": "https://apnews.com/42878c1cac442fc7a51c36fbc5fc78a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e93a8bd806842b99b6db67f71292f14/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Shopping on Temu can feel like playing an arcade game. Instead of using a joystick-controlled claw to grab a toy, visitors to the online marketplace maneuver their computer mouses or cellphone screens to browse colorful gadgets, accessories and trinkets with prices that look too good to refuse.",
      "publishedAt": "2024-12-01T12:32:03Z",
      "title": "Shopping on Shein and Temu for holiday gifts? You're not the only one.",
      "url": "https://apnews.com/2d551895e123dedd49fa35ec58d07634",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e403d76734f46bbb02e1b2a88369ee3/3000.jpeg"
    },
    {
      "author": "JOHN WAWROW",
      "description": "ORCHARD PARK, N.Y. (AP) — Josh Allen scored a receiving touchdown on a pass he threw in his latest do-everything performance, and the Buffalo Bills clinched their fifth straight AFC East title with a 35-10 victory over the San Francisco 49ers on a snowy Sunday night.",
      "publishedAt": "2024-12-02T04:24:05Z",
      "title": "Josh Allen has TDs passing, rushing and receiving as Bills rout 49ers 35-10 in snow, clinch AFC East",
      "url": "https://apnews.com/e0956d695ead50321efdba586e638c12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24c4a87cb21f49b5a041649d4e24a633/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}