{
  "articles": [
    {
      "author": "MARCIA DUNN",
      "description": "Boeing’s first astronaut mission ended Friday night with an empty capsule landing and two test pilots still in space, left behind until next year because NASA judged their return too risky.",
      "publishedAt": "2024-09-06T13:17:28Z",
      "title": "Two astronauts are left behind in space as Boeing's troubled capsule returns to Earth empty",
      "url": "https://apnews.com/92dca67a1fbecf05f5f0e6e2e79afc3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/227c3519e8414b809fc121bfdcc2d50a/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and JILL COLVIN",
      "description": "PITTSBURGH (AP) — Kamala Harris and Donald Trump are veering sharply in how they gear up for Tuesday's presidential debate, setting up a showdown that reflects not just two separate visions for the country but two politicians who approach big moments very differently.",
      "publishedAt": "2024-09-07T04:14:31Z",
      "title": "Harris and Trump are getting ready for Tuesday's debate in sharply different ways",
      "url": "https://apnews.com/c34170599af4f51925f8dc4753e06e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18756bd8d8c4d8da55df6243a84935e/1930.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — The first sign of trouble came before the debate even started.“Folks, how are you?” President Joe Biden said as he shuffled onto the stage. His voice was raspy and thin, his movements stiff.",
      "publishedAt": "2024-09-07T04:06:01Z",
      "title": "Biden's disastrous debate performance offers lessons for Harris and warnings for Trump",
      "url": "https://apnews.com/d62e8e7281fff34be8925adc9b4e6dc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033e1f7b62134e0d802e98c74afa21e0/2841.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "It was just the two of them, the teenager and his father, since an eviction a year earlier ended with the boy’s parents parting ways in a separation that fractured the entire family.That’s what Colin Gray told a Georgia sheriff’s investigator who came to his door in May 2023 asking whether an online threat to commit a school shooting had been posted by his son, Colt.",
      "publishedAt": "2024-09-07T04:06:12Z",
      "title": "Georgia school shooting suspect was troubled by a broken family, taunting at school, his father said",
      "url": "https://apnews.com/92fce6b86f5e2ad23c3337aff1997cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f74f687e99f4828b968c4f85764501c/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "A 14-year-old boy stands charged with four counts of murder, accused of using a semiautomatic assault-style rifle to kill two students and two teachers this week at his high school in Georgia.Colt Gray had his first hearing Friday after being charged as an adult in the latest mass shooting at a school in the U.S.",
      "publishedAt": "2024-09-07T04:07:47Z",
      "title": "A 14-year-old boy is charged with killing 4 people at his Georgia high school. Here’s what we know",
      "url": "https://apnews.com/f5300931a4a648e8887a1b8d0fdd6558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28678f98fabd4b308da945c889598be5/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — This week, when they would normally be going back to school, the Qudeh family’s children stumbled with armfuls of rubble they collected from a destroyed building to sell for use in building graves in the cemetery that is now their home in southern Gaza.",
      "publishedAt": "2024-09-07T05:05:22Z",
      "title": "Gaza enters its 2nd school year without schooling. The cost could be heavy for kids' futures",
      "url": "https://apnews.com/c7e72c172f0abc336c9c364900369a19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/890355ea2b4746a3bb561753306dc579/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and AREF TUFANA",
      "description": "NABLUS, West Bank (AP) — Israeli soldiers killed an American woman demonstrating against settlements in the West Bank on Friday, according to two witnesses who said she was shot while posing no threat to Israeli forces and during a moment of calm after clashes earlier in the afternoon.",
      "publishedAt": "2024-09-06T13:07:36Z",
      "title": "Israeli soldiers fatally shot an American woman at a West Bank protest, witnesses say",
      "url": "https://apnews.com/b2f1c741cea3d56eb1a339240dbf036e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0be6e6659b184c7494ddd921f8e3408d/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "PORT MORESBY, Papua New Guinea (AP) — Pope Francis called Saturday for an end to tribal conflicts that have wracked Papua New Guinea for decades and appealed for equitable development of its natural resources during a visit that also surfaced the country's problem of violence against women.",
      "publishedAt": "2024-09-07T01:16:50Z",
      "title": "Pope urges end to Papua New Guinea tribal conflicts and fair, sustainable extraction of resources",
      "url": "https://apnews.com/363c72bc18c4d8c35a0b718ed54ab975",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37a778b4bb5140e79686d823264c75f9/3000.jpeg"
    },
    {
      "author": "ZEN SOO",
      "description": "HONG KONG (AP) — A powerful typhoon killed two people and left at least 92 injured in the southern Chinese island of Hainan, authorities said Saturday, with heavy rains and winds causing power outages in over 800,000 households.",
      "publishedAt": "2024-09-07T04:46:12Z",
      "title": "Typhoon Yagi kills 2 and injures 92 in China's Hainan as it makes its way to northern Vietnam",
      "url": "https://apnews.com/555e6187e737da7b13fe3e31cf3797ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9a678e5354e4e798ac891db1c5e5336/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — When Taylor Fritz, a 26-year-old from California, and Frances Tiafoe, a 26-year-old from Maryland, strode under the Arthur Ashe Stadium lights Friday night for the first U.S.",
      "publishedAt": "2024-09-06T22:23:26Z",
      "title": "Taylor Fritz beats Frances Tiafoe to become the first American man in a US Open final since 2006",
      "url": "https://apnews.com/b142b422def1c9fae2a6e723d80302fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/640e897ed00643cebe85fff509c87b66/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}