{
  "articles": [
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — In the shadow of the White House, seven days before the final votes of the 2024 election are cast, Kamala Harris vowed to put country over party and warned that Donald Trump is obsessed with revenge and his own personal interests.",
      "publishedAt": "2024-10-30T00:35:13Z",
      "title": "Two closing arguments show the stark choice between Trump and Harris",
      "url": "https://apnews.com/070f6f5d72b4419a5d844e77177c2d42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a96d284ff2402aba1915d063628487/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Kamala Harris stood before an overflowing crowd near the White House on Tuesday and promised Americans she would fight for them every day as she urged voters to reject Donald Trump’s efforts to sow division and fear, declaring, “It doesn’t have to be this way.”",
      "publishedAt": "2024-10-29T09:04:01Z",
      "title": "Harris urges voters to reject Trump’s efforts to sow division and fear",
      "url": "https://apnews.com/139a7b390dc30ceab85d9ac56fcc521d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70a92f66ba614f6b9e93e9397dcbc1f5/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, MICHELLE L. PRICE and MICHAEL RUBINKAM",
      "description": "ALLENTOWN, Pa. (AP) — Urged by some allies to apologize for racist comments made by speakers at his weekend rally, Donald Trump took the opposite approach on Tuesday, saying it was an “honor to be involved” in such an event and calling the scene a “lovefest” — the same term he has used to describe the Jan.",
      "publishedAt": "2024-10-29T16:39:15Z",
      "title": "Trump says his New York rally marked by crude and racist insults was 'an absolute lovefest'",
      "url": "https://apnews.com/6e079e7894a7e1db5dd4be76cccb452a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b92031c56d934d87b0e561d47950ff25/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden took a swipe against Donald Trump's supporters on Tuesday as he reacted to the Republican presidential nominee's weekend rally at Madison Square Garden, which was overshadowed by crude and racist rhetoric.",
      "publishedAt": "2024-10-30T01:29:53Z",
      "title": "Biden suggests Trump supporters are 'garbage' after comic's insult of Puerto Rico",
      "url": "https://apnews.com/e62ccf9108ba0ca8d1ee694f91a6867e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d88669053a84dafb0c7ee6ec6a291e5/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Many American voters are concerned that the ongoing Middle East conflict will escalate into an all-out regional war, a new poll finds. About half of voters are “extremely” or “very” worried about the possibility of a broader war in the region.",
      "publishedAt": "2024-10-30T04:03:38Z",
      "title": "AP-NORC poll finds Democrats and Republicans split on Israel's responsibility for war's escalation",
      "url": "https://apnews.com/e1cfd92c19d57842f2ec2f5f3f489856",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd5e42f977b74334b23648fffa90f70c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Two Israeli airstrikes in the northern Gaza Strip on Tuesday killed at least 88 people, including dozens of women and children, health officials said, and the director of a hospital said life-threatening injuries were going untreated because a weekend raid by Israeli forces led to the detention of dozens of medics.",
      "publishedAt": "2024-10-29T07:01:11Z",
      "title": "Israeli strikes in northern Gaza kill at least 88, officials say",
      "url": "https://apnews.com/befe1b42ef25599539198fa04e089f04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d00473a343db462da53a32698aefd3b3/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER and JAMEY KEATEN",
      "description": "UNITED NATIONS (AP) — The United Nations stressed Tuesday that if Israel puts in place new laws cutting ties with the U.N.",
      "publishedAt": "2024-10-29T22:09:14Z",
      "title": "Israel must step in if it bans the UN agency that is a lifeline for Gaza, UN says",
      "url": "https://apnews.com/6cc2518b83eaecd3f813df59588b539f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25dde7bfab0c4a0a94f79e1d5f212ad3/3000.jpeg"
    },
    {
      "author": "NG HAN GUAN",
      "description": "JIUQUAN, China (AP) — China declared a “complete success” after it launched a new three-person crew to its orbiting space station early Wednesday as the country seeks to expand its exploration of outer space with missions to the moon and beyond.",
      "publishedAt": "2024-10-29T20:30:15Z",
      "title": "China launches new crew to its space station as it seeks to expand exploration",
      "url": "https://apnews.com/eeb0d5ca1f7dd080918cc8942511601f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6e36bb92e1e45e48bfccee4cc80c04c/1920.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Anthony Volpe’s third-inning grand slam overcame Freddie Freeman's record-setting home run, and the New York Yankees avoided a World Series sweep with an 11-4 win over the Los Angeles Dodgers on Tuesday night that forced a Game 5.",
      "publishedAt": "2024-10-30T03:30:26Z",
      "title": "Volpe slam sparks comeback after Freeman homer, Yanks beat Dodgers 11-4 to force World Series Game 5",
      "url": "https://apnews.com/1ae2f34295846e1df14b0f7fdb33b0b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9f828a7f8544bbb0a7422b306aa6ec/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Powered by consumer spending, the U.S. economy likely kept expanding at a healthy pace from July through September despite the pressure of still-high interest rates.The Commerce Department is expected to report Wednesday that the gross domestic product — the economy’s total output of goods and services — grew at a 2.6% annual pace last quarter, according to a survey of forecasters by the data firm FactSet.",
      "publishedAt": "2024-10-30T04:01:18Z",
      "title": "US economy is believed to have grown at a solid pace again last quarter",
      "url": "https://apnews.com/6a3fbfb5790b07434d656a95865b7435",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56ce4c44724e42d9b14a8097bd23d7d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}