{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, STEPHEN GROVES, JILL COLVIN and JOSH BOAK",
      "description": "WASHINGTON (AP) — After days of threats and demands, Donald Trump had little to show for it once lawmakers passed a budget deal in the early hours of Saturday, narrowly averting a pre-Christmas government shutdown.",
      "publishedAt": "2024-12-21T20:38:59Z",
      "title": "What Trump's decision to wade into spending fight tells us about the next 4 years",
      "url": "https://apnews.com/e0258d31a9018c7af09afc11a8634707",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57511b8ab4a478ca4171ec71e155388/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — One of the most turbulent sessions of Congress in the modern era is about to make way for the next one.",
      "publishedAt": "2024-12-21T19:41:40Z",
      "title": "Shutdown saga exposes new fault lines for Speaker Johnson and tests his grip on the gavel",
      "url": "https://apnews.com/d8084f6c9c2f7d01845b817430f6f91b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a6f6e2dbad46dfbad25e99e14b8da5/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER, GEIR MOULSON and VANESSA GERA",
      "description": "MAGDEBURG, Germany (AP) — Germans on Saturday mourned the victims of an apparent attack in which authorities say a doctor drove into a busy outdoor Christmas market, killing five people, injuring 200 others and shaking the public’s sense of security at what would otherwise be a time of joy.",
      "publishedAt": "2024-12-21T07:18:27Z",
      "title": "Germans mourn the 5 killed and 200 injured in the apparent attack on a Christmas market",
      "url": "https://apnews.com/32ec923f21cccb2a34e287da42ced921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f1ae4eefa014f2b8e03e24669f928cd/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and WAAFA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — A rocket fired from Yemen hit an area of Tel Aviv overnight, leaving 16 people injured by shattered glass, the Israeli military said Saturday, days after Israeli airstrikes hit Houthi rebels who have been launching missiles in solidarity with Palestinians in Gaza.",
      "publishedAt": "2024-12-21T07:39:32Z",
      "title": "A rocket from Yemen strikes Tel Aviv, injuring 16, and Palestinians mourn a dozen children in Gaza",
      "url": "https://apnews.com/bffc2f7ae556942e2e6760720d63038c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27ebbf20e5784e2094accca1f247bde7/1920.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — A crash between a passenger bus and a truck early Saturday killed 38 people on a highway in Minas Gerais, a state in southeastern Brazil, officials said.",
      "publishedAt": "2024-12-21T13:55:30Z",
      "title": "38 people die in a crash between a passenger bus and a truck in Brazil",
      "url": "https://apnews.com/b521a7fc2626f6b1faaa177d8b8c0fdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e5c1d25d5d04195a55971e59e186d3a/1920.jpeg"
    },
    {
      "author": "JEAN-YVES KAMALE and WILSON McMAKIN",
      "description": "KINSHASA, Congo (AP) — A ferry overloaded with people returning home for Christmas capsized on the Busira River in northeastern Congo, leaving 38 people confirmed dead and over 100 others missing, officials and eyewitnesses said Saturday.",
      "publishedAt": "2024-12-21T20:08:16Z",
      "title": "38 people are dead and over 100 missing in Congo after a ferry capsizes on the Busira River",
      "url": "https://apnews.com/ac222ab809e107b119a8e86f1d5aa3f2",
      "urlToImage": ""
    },
    {
      "author": "LLAZAR SEMINI",
      "description": "TIRANA, Albania (AP) — Albania's prime minister said Saturday the government will shut down the video service TikTok for one year, blaming it for inciting violence and bullying, especially among children.",
      "publishedAt": "2024-12-21T17:08:32Z",
      "title": "Albania to close TikTok for a year blaming it for promoting violence among children",
      "url": "https://apnews.com/9f1073fd1f3786524bad3926f0190ed0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a300deae5104814b02a2f9b361b3f4b/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and THOMAS ADAMSON",
      "description": "MAMOUDZOU, Mayotte (AP) — One week after its worst cyclone in nearly a century, and a day after a testy presidential visit, France’s impoverished Indian Ocean territory of Mayotte is still grappling with counting the dead, restoring essential services and aiding a beleaguered population.",
      "publishedAt": "2024-12-21T11:25:11Z",
      "title": "France's Mayotte struggles to recover as cyclone overwhelms hospitals",
      "url": "https://apnews.com/284271ed0dcf66626533df49e9dfb23f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb7d2d177f07435ea5719e8fc062f3fc/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Amazon delivery drivers and Starbucks baristas are on strike in a handful of U.S.",
      "publishedAt": "2024-12-21T20:43:42Z",
      "title": "Amazon and Starbucks workers are on strike. Trump might have something to do with it",
      "url": "https://apnews.com/5b25237254e2d001a13ff8b9a8d7a17b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe37f3586e374bcca1fec2369ad0e575/3000.jpeg"
    },
    {
      "author": "DAVID CRARY",
      "description": "Hanukkah, Judaism’s eight-day Festival of Lights, begins this year on Christmas Day, which has only happened four times since 1900.",
      "publishedAt": "2024-12-21T13:40:35Z",
      "title": "In a calendar rarity, Hanukkah starts this year on Christmas Day",
      "url": "https://apnews.com/0a9811a1e9c8e21f1cdd2e2d6a23b348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/168b93b7e121425f92d223759c477374/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}