{
  "articles": [
    {
      "author": "ZEKE MILLER, JOSHUA GOODMAN, JIM MUSTIAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The U.S. Drug Enforcement Administration will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy that could have wide ripple effects across the country.",
      "publishedAt": "2024-04-30T17:05:13Z",
      "title": "US drug control agency will move to reclassify marijuana in a historic shift, AP sources say",
      "url": "https://apnews.com/f833a8dae6ceb31a8658a5d65832a3b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46049ccdabb94e389d9bca899f4e54b5/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump was held in contempt of court Tuesday and fined $9,000 for repeatedly violating a gag order that barred him from making public statements about witnesses, jurors and some others connected to his New York hush money case.",
      "publishedAt": "2024-04-30T04:02:59Z",
      "title": "Judge raises threat of jail as he holds Trump in contempt, fines him $9,000 at hush money trial",
      "url": "https://apnews.com/d2f9badee0b28a60d32bc98c0d4e783f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f35544ecc3a7487f891b741703cfef55/1920.jpeg"
    },
    {
      "author": "CEDAR ATTANASIO, JAKE OFFENHARTZ and JONATHAN MATTISE",
      "description": "NEW YORK (AP) — Dozens of protesters took over a building at Columbia University in New York early Tuesday, barricading entrances and unfurling a Palestinian flag from a window in the latest escalation of demonstrations against the Israel-Hamas war on college campuses nationwide.",
      "publishedAt": "2024-04-30T04:13:28Z",
      "title": "Columbia University threatens to expel student protesters occupying an administration building",
      "url": "https://apnews.com/8b0d3a0cedb17f5e892c6ca43bbdf628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e874327fae541d58bc68073e53934a6/1920.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and JEFFREY COLLINS",
      "description": "CHARLOTTE, N.C. (AP) — Four law enforcement officers in North Carolina who were killed while trying to capture a man immediately faced gunfire as they approached, unable to withstand shots from upstairs in a house, authorities said Tuesday.",
      "publishedAt": "2024-04-30T12:26:10Z",
      "title": "4 officers killed in North Carolina were at disadvantage as shots rained from above, police say",
      "url": "https://apnews.com/64a4a9c849b721631cd2f8872945e08d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2605a1af02854ef283e24dff1c552654/1920.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — A man wielding a sword attacked members of the public and police officers in a northeast London suburb Tuesday, killing a 14-year-old boy and injuring four other people, British authorities said.",
      "publishedAt": "2024-04-30T08:57:07Z",
      "title": "Sword-wielding man attacks passersby in London, killing a 14-year-old boy and injuring 4 others",
      "url": "https://apnews.com/ecbc7339ad76d07a1ccce254d166f998",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1932d64f6e30419581fd176b9c1999b4/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — House Democrats will vote to save Republican Speaker Mike Johnson’s job should some of his fellow Republican lawmakers seek to remove him from the position, Democratic leaders said Tuesday, likely assuring for now that Johnson will avoid being ousted from office like his predecessor, former Rep.",
      "publishedAt": "2024-04-30T15:55:01Z",
      "title": "Democrats say they will save Speaker Mike Johnson's job if Republicans try to oust him",
      "url": "https://apnews.com/552169f3e831ab8fb3baacfdf76c2d82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19060a557d8749b7bbd89a632b0843e5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu pledged Tuesday to launch an incursion into the southern Gaza city of Rafah, where hundreds of thousands of Palestinians are sheltering from the almost 7-month-long war, just as cease-fire negotiations between Israel and Hamas appear to be gaining steam.",
      "publishedAt": "2024-04-30T10:43:44Z",
      "title": "Netanyahu vows to invade Rafah 'with or without a deal' as cease-fire talks with Hamas continue",
      "url": "https://apnews.com/f5e14fd176d69f9c4e23b48f3ab5af6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b702e0d1b1c4f2f8f7d99b1b08e0698/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Regular mammograms to screen for breast cancer should start younger, at age 40, according to an influential U.S. task force. Women ages 40 to 74 should get screened every other year, the group said.",
      "publishedAt": "2024-04-30T15:04:58Z",
      "title": "Mammograms should start at 40 to address rising breast cancer rates at younger ages, panel says",
      "url": "https://apnews.com/2b4ebc0dcd0335fd08d17e2e03bc7b23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/077072f997704a718578baec0ec7fbab/1730.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Two Broadway shows celebrating the spark of sonic creativity — the semi-autobiographical Alicia Keys musical “Hell’s Kitchen,\" and the play \"Stereophonic\" about a '70s rock band recording a star-making album — each earned a leading 13 Tony Award nominations Tuesday, a list that also saw a record number of women nominated for best director.",
      "publishedAt": "2024-04-30T04:06:28Z",
      "title": "'Hell's Kitchen' and 'Stereophonic' lead Tony Award nominations, 2 shows honoring creativity's spark",
      "url": "https://apnews.com/5a34692b23991e09e68b3c88bb310bef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ae0bdb6eed24164bfe7abdcde43f832/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s newly installed transitional council chose former Sports Minister Fritz Belizaire as the country's prime minister Tuesday as it presses forward in its monumental task of trying to establish a stable new government amid stifling violence.",
      "publishedAt": "2024-04-30T16:19:34Z",
      "title": "Haiti's transitional council names new prime minister in hopes of quelling stifling violence",
      "url": "https://apnews.com/1a6dd7f6180fd3489c4d4179b294bdf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfa4a9f46e814cf2ad12056a729b8f3b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}