{
  "articles": [
    {
      "author": "AAMER MADHANI, COLLEEN LONG, ZEKE MILLER, MATTHEW LEE and ELLEN KNICKMEYER",
      "description": "MANAUS, Brazil (AP) — President Joe Biden has authorized Ukraine to use U.S.-supplied missiles to strike deeper inside Russia, easing limitations on the longer range weapons as Russia deploys thousands of North Korean troops to reinforce its war, according to a U.S.",
      "publishedAt": "2024-11-17T18:36:04Z",
      "title": "Biden authorizes Ukraine to use US-supplied longer range missiles for deeper strikes inside Russia",
      "url": "https://apnews.com/52d424158182de2044ecc8bfcf011f9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aacf7b639540446d870aee08fc77fe31/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and JOANNA KOZLOWSKA",
      "description": "KYIV, Ukraine (AP) — A Russian strike on a nine-story building in the city of Sumy in northern Ukraine killed eight people and wounded dozens, an official said Sunday, as Russia launched a massive drone and missile attack described by officials as the largest in recent months.",
      "publishedAt": "2024-11-17T08:31:14Z",
      "title": "Russia launches one of its fiercest missile and drone attacks at Ukraine's infrastructure",
      "url": "https://apnews.com/6af214839d9436731e9b960f0d3a7a8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d90aa51f3974c93b8c8f23d778e7893/2000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "PALM BEACH, Fla. (AP) — Donald Trump Jr. said Sunday that any pushback from the Washington establishment around his father's unconventional choices for Cabinet proves they are just the kind of disruptors that voters are demanding.",
      "publishedAt": "2024-11-17T19:03:22Z",
      "title": "Donald Trump Jr. says pushback against Cabinet picks proves they're the disrupters voters wanted",
      "url": "https://apnews.com/552db11011b979577e87de77c76ed921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17dcee6159034f38a397498ee968b16d/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump on Sunday named Brendan Carr, the senior Republican on the Federal Communications Commission, as the new chairman of the agency tasked with regulating broadcasting, telecommunications and broadband.",
      "publishedAt": "2024-11-18T02:19:24Z",
      "title": "Trump names Brendan Carr, senior GOP leader at FCC, to lead the agency",
      "url": "https://apnews.com/bf034fdd137e579c0c3e99681cc99541",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6657c0dccf614b3d896a83e13dcb319c/3000.jpeg"
    },
    {
      "author": "FADI TAWIL, BASSEM MROUE and WAFAA SHURAFA",
      "description": "BEIRUT (AP) — A rare Israeli strike in central Beirut killed the Hezbollah militant group's chief spokesman on Sunday, while an Israeli strike in northern Gaza ’s Beit Lahiya killed at least 30 people, a hospital director there told The Associated Press.",
      "publishedAt": "2024-11-17T07:05:05Z",
      "title": "An Israeli strike in Beirut kills Hezbollah's spokesman, while a strike in Gaza kills at least 30",
      "url": "https://apnews.com/060c45c86b937d255270d272590884a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90117a6b25834cc2b49cd0e77829d003/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, GABRIELA SÁ PESSOA and COLLEEN LONG",
      "description": "MANAUS, Brazil (AP) — Speaking from the Amazon rainforest, President Joe Biden declared Sunday that there’s no going back in America’s “clean energy revolution” even as the incoming Trump administration vows to spur fossil fuel production and scale back efforts against climate change.",
      "publishedAt": "2024-11-17T05:03:57Z",
      "title": "From the Amazon rainforest, Biden declares nobody can reverse US progress on clean energy",
      "url": "https://apnews.com/3cc827382d1e3c32865a14616ddfe467",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60ccb5cf66fb48759d29d291ce362601/1920.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — Dozens of prominent Hong Kong pro-democracy activists are scheduled to be sentenced Tuesday in the largest case under a national security law that critics say crushed political activism in the semi-autonomous Chinese city.",
      "publishedAt": "2024-11-18T03:51:16Z",
      "title": "45 pro-democracy activists face sentencing in Hong Kong. Here's who some of them are",
      "url": "https://apnews.com/f2c36e5da3e974f54595447050280eee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e95d90b7a86a405cb2bfdbddefbe4c13/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — A special tribunal in Bangladesh will hear updates from police on Monday about what the country's security agencies have done to arrest ousted former Prime Minister Sheikh Hasina and her close aides who face charges over hundreds of deaths in a mass uprising this summer.",
      "publishedAt": "2024-11-18T04:29:10Z",
      "title": "Bangladesh tribunal will hear updates from police on their moves to arrest ousted premier Hasina",
      "url": "https://apnews.com/deba1a0c75cc7ab9fe62d6a14c788039",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6407f593af2f49efa31e48666f2f1142/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH and PATRICK WHITTLE",
      "description": "Firefighters in New York said Sunday that a voluntary evacuation overnight helped them protect more than 160 homes from a stubborn wildfire near the New Jersey border as officials in much of the Northeast coped with hundreds of brush fires in tinder-dry and windy conditions.",
      "publishedAt": "2024-11-17T06:50:00Z",
      "title": "Wildfire threat continues in much of the US Northeast as dry conditions persist",
      "url": "https://apnews.com/00215fa5dcbfde4164924d486e363c2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fecd12840bd3478bb1fe91ab8c337dc1/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Two people were killed and 10 others were wounded in two separate shootings along a New Orleans parade route and celebration attended by thousands on Sunday, authorities said. There were no immediate arrests.",
      "publishedAt": "2024-11-18T00:44:33Z",
      "title": "2 killed, 10 wounded in shootings near New Orleans parade route",
      "url": "https://apnews.com/6c641431f5f7d5ce74fd71782e215575",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90bf780dd642462080538c739f9dd557/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}