{
  "articles": [
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli strikes on the southern Gaza city of Rafah overnight killed 22 people, including 18 children, health officials said Sunday, as the United States was on track to approve billions of dollars of additional military aid to Israel, its close ally.",
      "publishedAt": "2024-04-21T07:19:40Z",
      "title": "Israeli strikes on southern Gaza city of Rafah kill 22, mostly children, as US advances aid package",
      "url": "https://apnews.com/8c027f2587c2c433d0fde41b63a0e0c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77f6ceddc5ac4a43bea59b16939f46ca/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Ukrainian and Western leaders on Sunday welcomed a desperately needed aid package passed by the U.S.",
      "publishedAt": "2024-04-21T08:57:20Z",
      "title": "Ukrainian and Western leaders laud US aid package while the Kremlin warns of 'further ruin'",
      "url": "https://apnews.com/1138337200942ca738ffc28bfc289570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bf3f45481674882b20445f6d5d0672c/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s hush money criminal trial shifts to opening statements Monday, followed by the start of witness testimony. A jury of seven men and five women, plus six alternates, was picked last week.",
      "publishedAt": "2024-04-21T03:30:53Z",
      "title": "Key players: Who's who at Donald Trump’s hush money criminal trial",
      "url": "https://apnews.com/5fdc819697a76536ed83cbf28d4a523c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2cc35e3a5f491e9a278191a32d7da7/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — As President Joe Biden and Donald Trump step up their campaigning in swing states, a quieter battle is taking place in the shadows of their White House rematch.The Republican National Committee, newly reconstituted under Trump, has filed election-related lawsuits in nearly half the states.",
      "publishedAt": "2024-04-21T11:21:15Z",
      "title": "Crush of lawsuits over voting in multiple states creates a shadow war for the 2024 election",
      "url": "https://apnews.com/c7d8943dcac776103d948532f62f2a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8069dfe750094971b61547771782303b/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — As the sun sets, a burly man bellows into a megaphone while a curious crowd gathers around him. Next to him is a small cardboard box with several banknotes worth 10 Haitian gourdes — about 7 U.S.",
      "publishedAt": "2024-04-21T06:11:17Z",
      "title": "Haitians scramble to survive, seeking food, water and safety as gang violence chokes the capital",
      "url": "https://apnews.com/418c2a9fa54ea42c4d980917e146be3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ce63f0541204a90918e5ffbbafa78fb/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "ROME, Ga (AP) — Instead of traditional maroon and gold Tibetan Buddhist robes, Lama Rod Owens wore a white animal print cardigan over a bright yellow T-shirt with an image of singer Sade, an Africa-shaped medallion and mala beads — the most recognizable sign of his Buddhism.",
      "publishedAt": "2024-04-21T12:01:57Z",
      "title": "Lama Rod describes himself as a Black Buddhist Southern Queen. He wants to free you from suffering",
      "url": "https://apnews.com/506b1e85687d956eff81f7f4261f5e98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7e7fe392080469c8ff440c4df21e7a1/1920.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT and MICHAEL HILL",
      "description": "ALBANY, N.Y. (AP) — Nature wraps bananas and oranges in peels. But in some modern supermarkets, they're bagged or wrapped in plastic too.For Judith Enck, that's the epitome of pointless plastic.",
      "publishedAt": "2024-04-21T13:32:44Z",
      "title": "Earth Day: How one grocery shopper takes steps to avoid 'pointless plastic'",
      "url": "https://apnews.com/f112aadca284325bf0e8e5adfba65f40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdfa3d6466714a87a0e965258cfa3a09/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "JERUSALEM (AP) — Iran's supreme leader on Sunday dismissed any discussion of whether Tehran's unprecedented drone-and-missile attack on Israel hit anything there, a tacit acknowledgment that despite launching a major assault, few projectiles actually made it through to their targets.",
      "publishedAt": "2024-04-21T12:56:51Z",
      "title": "Iran's supreme leader tacitly acknowledges that Tehran hit little in its attack on Israel",
      "url": "https://apnews.com/66280e717d335afffd9e258a5985d50c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06e5160f7f6f407786a7e13f05c75421/2499.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Rarely a day goes without President Joe Biden mentioning insulin prices. He promotes a $35 price cap for the medication for Americans on Medicare — in White House speeches, campaign stops and even at non-health care events around the country.",
      "publishedAt": "2024-04-21T11:41:59Z",
      "title": "Biden sees a $35 price cap for insulin as a pivotal campaign issue. It’s not that clear-cut",
      "url": "https://apnews.com/f969191c3c5178c91cc973a1b89c2200",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c9b687f8b94ceaa93f26914e351604/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — A single mother of two, Amy Chadwick spent years scrimping and saving to buy a house in the town of Lahaina on the Hawaiian island of Maui. But after a devastating fire leveled Lahaina in August and reduced Chadwick's home to white dust, the cheapest rental she could find for her family and dogs cost $10,000 a month.",
      "publishedAt": "2024-04-21T05:21:39Z",
      "title": "Hawaii lawmakers take aim at vacation rentals after Lahaina wildfire amplifies Maui housing crisis",
      "url": "https://apnews.com/3a7468c75cc9814a7895e03c623e400b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d3410116dac452098b203aba068ba50/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}