{
  "articles": [
    {
      "author": null,
      "description": "The Senate is expected to grind through a rare weekend session as Republicans race to pass President Donald Trump’s package of tax breaks and spending cuts by his July Fourth deadline. Republicans are using their majorities in Congress to push aside Democratic opposition, but they've run into a series of setbacks. Senators are expected to take a procedural vote Saturday to begin debate on the bill, but the timing is uncertain and there's a long path ahead after that. Senate passage could be days away, and the bill would need to return to the House for more votes before it could reach the White House.",
      "publishedAt": "2025-06-28T12:32:38Z",
      "title": "GOP-led Congress race to pass Trump's bill by his July Fourth deadline",
      "url": "https://apnews.com/article/trump-tax-breaks-spending-cuts-senate-deadline-8c72d6db7c9725d9d56db8294012809e",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ae42a2/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2Fde%2F8979ac14b646e4f3fc5f206eea66%2Fa4e90030db4e4ea29153738e748d7ff4"
    },
    {
      "author": null,
      "description": "Israeli strikes in Gaza have killed at least 34 people, according to health officials. The attacks, which began late Friday and continued into Saturday, hit shelters and residential areas across Gaza, worsening its humanitarian crisis. U.S. President Donald Trump has suggested a ceasefire deal could happen within a week. Talks remain uncertain, however, as Israel demands Hamas disarm while Hamas insists on ending the war in exchange for freeing hostages. Meanwhile, Palestinians face severe food shortages, as Israeli is only letting a trickle of aid into the strip.",
      "publishedAt": "2025-06-28T08:32:56Z",
      "title": "At least 34 people killed in Israeli strikes in Gaza as ceasefire prospects inch closer",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-28-2025-0baefcaa74fad04b81c1e5f2b9236c75",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff2ff45/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F89%2F6da784fc318c1b3f229d797bce37%2F65b36ce8892c4826868d7ed49e10af42"
    },
    {
      "author": null,
      "description": "Thousands of mourners gathered in Tehran for the funeral of top Iranian commanders and scientists killed in a 12-day war with Israel. The caskets of Revolutionary Guard chief Gen. Hossein Salami and missile program head Gen. Amir Ali Hajizadeh were paraded Saturday through the city. Israel targeted Iranian military leaders, scientists, and nuclear sites, claiming to have killed 30 commanders and 11 scientists. Iran fired over 550 missiles at Israel, most were intercepted. The conflict caused over 1,000 deaths, at least 417 civilians, according to the Washington-based Human Rights Activists group. Saturday marked the first public funerals since the ceasefire.",
      "publishedAt": "2025-06-28T05:20:26Z",
      "title": "Thousands mourn top Iranian military commanders and scientists killed in Israeli strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-28-2025-f53ad5751d7427deab42111e1ca7751d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0fe6230/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Faf%2Fe739b0e3d039974cbacbeb119b46%2F871d320fcd104e5ea95e7af9549f8c79"
    },
    {
      "author": null,
      "description": "Ukrainian authorities say two people were killed and some 17 injured after Russian drones attacked the southern Ukrainian port city of Odesa. A drone hit a residential tower block in the city, causing damage to three floors and trapping residents, emergency services said. The two killed in the attack were a married couple, and three children were among the injured, Odesa's regional governor reported. According to Russia's Defense Ministry, over 40 Ukrainian drones were shot down over western Russia and occupied Crimea.",
      "publishedAt": "2025-06-28T10:37:23Z",
      "title": "A Russian drone strike on Odesa kills a married couple and injures 17 people, Ukraine says",
      "url": "https://apnews.com/article/russia-ukraine-war-odesa-600b482ec8ebc1ad75629cd4c0ea178b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4736efc/2147483647/strip/true/crop/8231x4630+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F3a%2F685a25523b513339c04ce8ec0c70%2F0749646ed69447049bf5c65e27c3572b"
    },
    {
      "author": null,
      "description": "Congressional Democrats are grappling with how to conduct oversight of the Trump administration after some colleagues were arrested and face charges for attempting to observe the administration's conduct. Lawmakers have increasingly reached out to researchers, local activists, lawmakers and business leaders to gain insights into the administration's actions. But Democrats concede that they have little ability to compel information from the Trump administration without gaining more power in Congress. Congressional Republicans have largely dismissed Democrats' behavior as inflammatory and inappropriate.",
      "publishedAt": "2025-06-28T15:59:30Z",
      "title": "Democrats wrestle with oversight as Trump officials crack down",
      "url": "https://apnews.com/article/democrats-oversight-trump-ice-immigration-5c53e382cc752c9192e12e5ecd9bcef7",
      "urlToImage": "https://dims.apnews.com/dims4/default/092bfe6/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F16%2Fa8d6466ca9322644d1a3dbb8416a%2F4feb75b36cd444a7aa4a21d166ffdef3"
    },
    {
      "author": null,
      "description": "Chief Justice John Roberts is warning that elected officials’ heated words about judges can lead to threats or acts of violence by others. Roberts' comments Saturday at a judicial conference come at a time when threats against judges are on the rise. Roberts didn't identify anyone by name. But he was clearly referring to Republican President Donald Trump and Senate Democratic leader Chuck Schumer when he said he's felt compelled to issue public rebukes of figures in both parties in recent years. Roberts said the danger is that people might pick up on such criticism. He cited “serious threats of violence and murder of judges just simply for doing their work.”",
      "publishedAt": "2025-06-28T16:58:51Z",
      "title": "Chief Justice Roberts warns against heated political words about judges",
      "url": "https://apnews.com/article/supreme-court-roberts-trump-schumer-threats-judges-9310cc94bbb8017e274864ad3c31be23",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd99776/2147483647/strip/true/crop/5389x3031+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fd2%2F5bc222e1a9fc3798788711e73bc3%2F1021dfac3e6f4c398e339b5d79d70f3b"
    },
    {
      "author": null,
      "description": "Zohran Mamdani spoke at a rally in Harlem as he sought to build on momentum from New York City’s Democratic primary. Mamdani told a National Action Network rally Saturday that residents struggling to pay for housing, groceries and bus fare are hungry for change. Mamdani has declarared victory over former Gov. Andrew Cuomo, the presumed favorite in the primary. Results will be finalized after the city’s ranked choice vote-counting resumes Tuesday. The winner of the Democratic primary advances to November’s election. Mayor Eric Adams is running for reelection as an independent candidate.",
      "publishedAt": "2025-06-28T17:24:25Z",
      "title": "Mamdani heads to Harlem after stunning New York City primary results",
      "url": "https://apnews.com/article/zohran-mamdani-mayor-new-york-harlem-sharpton-aa060b291d40c8b9cb6f3e5225805d9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e426f01/2147483647/strip/true/crop/5808x3267+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F02%2Fd57715fe6032afd0e8a27f106dad%2Fe7e6721649ce4a1986cc378197fa3395"
    },
    {
      "author": null,
      "description": "Former Minnesota House Speaker Melissa Hortman has been honored at a funeral where former President Joe Biden and Vice President Kamala Harris attended. Hortman and her husband, Mark, were fatally shot two weeks ago by a man posing as a police officer. The attack also left a state senator and his wife seriously injured. Hortman, known for her impactful legislative work, was the first woman to lie in state at the Minnesota Capitol. Governor Tim Walz praised her dedication to public service. The suspect, Vance Boelter, remains in custody and faces charges that could lead to the federal death penalty.",
      "publishedAt": "2025-06-28T04:06:18Z",
      "title": "Biden, Harris and Walz attend funeral for former Minnesota House Speaker Melissa Hortman",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-funeral-biden-harris-31165984f11341a3bb6d27c01a43c7f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e5fd5e/2147483647/strip/true/crop/1616x909+0+86/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F6f%2F684391c1e018741840278b4098ce%2Fee04b0a09253484fa006c392548dbeca"
    },
    {
      "author": null,
      "description": "In the time before widespread vaccination, young children often lost their lives to devastating infectious diseases that ran rampant in America. Over the next century, vaccines virtually wiped out long-feared scourges like polio and measles and drastically reduced the toll of many others. Vaccine hesitancy grew as memories of these diseases faded. But some Americans know the reality of vaccine-preventable diseases all too well. Their lives were forever changed by rubella, measles, polio and whooping cough, and they clearly see the value of vaccines. Now, as preventable diseases begin to make a comeback, they long to spare others from similar pain.",
      "publishedAt": "2025-06-28T13:00:09Z",
      "title": "Families share their stories of damage done by vaccine-preventable diseases like measles and rubella",
      "url": "https://apnews.com/article/vaccines-measles-polio-whooping-cough-rubella-af4cd1aef8f408a960601df6372f9c32",
      "urlToImage": "https://dims.apnews.com/dims4/default/2621360/2147483647/strip/true/crop/3611x2031+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F34%2F9ca42f6d1c49449a94fc8ccfd777%2F62ff9273a5b54f2dbc530e3cf58b34ff"
    },
    {
      "author": null,
      "description": "The Rev. James Kelly baptized and married thousands of people, ministered to the ill at hospitals, and traveled the world. He became friends with an opera superstar and with a saint. Kelly is the longest-serving priest in the Archdiocese of Philadelphia. He recently celebrated the 75th anniversary of his ordination and his 100th birthday. He’s grateful and tries to make each day count. He listens to opera. He bakes pies. And he still wakes up at dawn every day to say Catholic Mass at the retired living community that he calls home.",
      "publishedAt": "2025-06-28T11:30:30Z",
      "title": "Catholic priest still bakes pies, enjoys opera and performs daily Mass at age 100",
      "url": "https://apnews.com/article/catholic-priest-100-years-old-pennsylvania-91208163c120d57579d1a45834efa4f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/aca643a/2147483647/strip/true/crop/7008x3942+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2Fd2%2F52366ad2da2f74780143e50a5c60%2F80aa17bf4b6547a59cbf02dffbebada2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}