{
  "articles": [
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — A dog’s plaintive wail. A courtroom couplet-turned-cultural catchphrase about gloves. A judge and attorneys who became media darlings and villains. A slightly bewildered houseguest elevated, briefly, into a slightly bewildered celebrity.",
      "publishedAt": "2024-04-11T19:56:14Z",
      "title": "The OJ Simpson saga was a unique American moment. 3 decades on, we're still wondering what it means",
      "url": "https://apnews.com/3610d214475cc680bdecaa14d74f4605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/217d83ae011349b2892e98b2ec48a6c9/1790.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — O.J. Simpson died Thursday without having paid the lion’s share of the $33.5 million judgment a California civil jury awarded to the families of his ex-wife Nicole Brown Simpson and her friend Ron Goldman.",
      "publishedAt": "2024-04-12T04:21:32Z",
      "title": "If O.J. Simpson's assets go to court, Goldman, Brown families could be first in line",
      "url": "https://apnews.com/6a6bfb5fec449adfe469d918b41ceda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7347157b80542609cbb73f418a756cf/1502.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — There’s a reason why President Joe Biden and former President Donald Trump are spending so much time attacking each other — people don't think either man has much to brag about when it comes to his own record.",
      "publishedAt": "2024-04-12T04:00:25Z",
      "title": "Many say Biden and Trump did more harm than good, but for different reasons, AP-NORC poll shows",
      "url": "https://apnews.com/21b95914866c2af3a1e7af8e302dbe27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1334b1459e6141deaca3e127cacc5190/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Of the 1.4 million adults who live in Manhattan, a dozen are soon to become the first Americans to sit in judgment of a former president charged with a crime.",
      "publishedAt": "2024-04-12T04:06:04Z",
      "title": "Manhattan court must find a dozen jurors to hear first-ever criminal case against a former president",
      "url": "https://apnews.com/b8fa0edfed572b06fb4dec05b3824a0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c45f26b52d545e4845d808f2923f0d5/1920.jpeg"
    },
    {
      "author": "ERIKA KINETZ",
      "description": "ASTANA, Kazakhstan (AP) — If the choice was death or a bullet to the leg, Yevgeny would take the bullet. A decorated hero of Russia’s war in Ukraine, Yevgeny told his friend and fellow soldier to please aim carefully and avoid bone.",
      "publishedAt": "2024-04-12T06:07:44Z",
      "title": "Russian soldiers who quit Putin's war get no hero’s welcome abroad as asylum claims surge",
      "url": "https://apnews.com/5c7642cd14431d9af65076df2df4b861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f95d2e664b14e448223e616a71b0850/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Under heavy U.S. pressure, Israel has promised to ramp up aid to Gaza dramatically, saying last week it would open another cargo crossing and surge more trucks than ever before into the besieged enclave.",
      "publishedAt": "2024-04-11T19:28:22Z",
      "title": "More aid is supposed to be entering the Gaza Strip. Why isn’t it helping?",
      "url": "https://apnews.com/30173642b5c298c829f1457db357071e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7230bb203f114f659566a49f525afe69/3000.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT",
      "description": "ALEXANDRIA, Va. (AP) — Twenty years ago this month, photos of abused prisoners and smiling U.S. soldiers guarding them at Iraq's Abu Ghraib prison were released, shocking the world. Now, three survivors of Abu Ghraib will finally get their day in U.S.",
      "publishedAt": "2024-04-12T04:23:48Z",
      "title": "20 years later, Abu Ghraib detainees get their day in US court",
      "url": "https://apnews.com/47bca65df10c62b672944692a139e012",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a0e053e576149f9bdc85910b87317fe/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — On a brisk day at a restaurant outside Chicago, Deb Robertson sat with her teenage grandson to talk about her death.She’ll probably miss his high school graduation. She declined the extended warranty on her car.",
      "publishedAt": "2024-04-12T04:08:23Z",
      "title": "'I'm dying, you're not': Those terminally ill ask more states to legalize physician-assisted death",
      "url": "https://apnews.com/b67affd86c1d1ce99379ed34bdb2946b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36e690ed134d4a13b9f4a29009334980/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN, GISELA SALOMON and CHRISTOPHER RUGABER",
      "description": "MIAMI (AP) — Having fled economic and political chaos in Venezuela, Luisana Silva now loads carpets for a South Carolina rug company. She earns enough to pay rent, buy groceries, gas up her car — and send money home to her parents.",
      "publishedAt": "2024-04-12T10:00:49Z",
      "title": "A healthy US economy's secret ingredient: Immigrant workers, eager to fill jobs",
      "url": "https://apnews.com/fbd1f2ec89e84fdfaf81d005054edad0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9f67658639a403eb57958b2a1e9b313/3000.jpeg"
    },
    {
      "author": "SHARON JOHNSON",
      "description": "STONE MOUNTAIN, Ga. (AP) — In a large, empty parking lot outside Atlanta, one car slowly careened around parking spaces. From the passenger seat, driving instructor Nancy Gobran peered over large sunglasses at her student, a 30-year-old Syrian refugee woman who was driving for one of the first times in her life.",
      "publishedAt": "2024-04-12T04:03:37Z",
      "title": "Teaching refugee women to drive goes farther than their destination",
      "url": "https://apnews.com/19fce94f52b0cb001989aea3f17e3c6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11f7b9b7663c44c69338fe2a03b7626e/2999.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}