{
  "articles": [
    {
      "author": "RAVI NESSMAN",
      "description": "JERUSALEM (AP) — Mediators trying to end the Israel-Hamas war expressed hope for an imminent deal Friday, saying two days of talks had wrapped up in Qatar and that they plan to reconvene in Cairo next week to seal an agreement to stop the fighting.",
      "publishedAt": "2024-08-16T06:39:24Z",
      "title": "Mideast mediators strike hopeful note after talks in Doha",
      "url": "https://apnews.com/cf0bb95a8a36cfabf1c6db8edf97c862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1025cc90d0174dc79bb47c463ea6791f/1920.jpeg"
    },
    {
      "author": "MATT BROWN and MAKIYA SEMINERA",
      "description": "RALEIGH, N.C. (AP) — Vice President Kamala Harris is promoting a broad set of economic proposals that would offer new tax breaks and lower the cost of living for Americans, aiming to address the financial concerns that are at the top of the mind for voters and that Republican Donald Trump is trying to lay at her doorstep.",
      "publishedAt": "2024-08-16T11:05:32Z",
      "title": "Harris aims to blunt Trump's economic attacks by proposing new tax breaks in a bid to lower costs",
      "url": "https://apnews.com/e1ad3f26f2ce8e6cb365a4ffe2ca3e6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53c007b2b8bf411eaffb1999a4d51d34/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "If you're not looking too closely, some recent Kamala Harris ads may give the false impression that some leading news organizations are taking sides in the campaign for president.The advertisements, which have turned up in some Google search feeds, include links to legitimate news stories but feature — in words that appear to be headlines from the originating news organizations — pro-Harris messages written by the Democrat's campaign.",
      "publishedAt": "2024-08-16T13:28:52Z",
      "title": "They look like — and link to — real news articles. But they're actually ads from the Harris campaign",
      "url": "https://apnews.com/2551b67dcf742df0d079122b25dd63d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdaefea2dae94ad08ecb7aaee14789a9/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "Former President Donald Trump owns more than $1 million worth of cryptocurrency and up to $250,000 in gold bars along with the portfolio of golf courses and real estate properties that have made him a billionaire, according to newly released financial disclosures.",
      "publishedAt": "2024-08-16T16:59:57Z",
      "title": "Bibles, cryptocurrency, Truth Social and gold bars: A look at Trump's reported sources of income",
      "url": "https://apnews.com/126e8382dd3501e3144de1a8aa9df2f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c27c9701253d4785b22620c0c2e0e5f7/3000.jpeg"
    },
    {
      "author": "MITCH WEISS and JEFF MARTIN",
      "description": "A mother whose son was having a seizure in his Tennessee apartment said in a federal lawsuit that police and paramedics subjected the 23-year-old to “inhumane acts of violence” instead of treating him, then covered up their use of deadly force.",
      "publishedAt": "2024-08-16T16:50:42Z",
      "title": "Tennessee family's lawsuit says video long kept from them shows police force, not drugs, killed son",
      "url": "https://apnews.com/ca8b91c2f3dc9584094c6fc835d49deb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1024e49d05d4fbd9ebefca06e8796cc/1626.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.",
      "publishedAt": "2024-08-16T10:54:53Z",
      "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm",
      "url": "https://apnews.com/7c53790d1b73ed431eae36bf3189fa4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c60d4a2f3c194a289b8baf7dd6c2038c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — As the first images out of Ferguson, Missouri surfaced 10 years ago — the bloodied body of a man left for hours in the street beneath white sheets, protesters smashing car windows and looting stores — it didn’t take long for the federal government to see a role for itself.",
      "publishedAt": "2024-08-16T13:30:22Z",
      "title": "How Ferguson elevated the profile of the Justice Department's civil rights enforcers",
      "url": "https://apnews.com/b2d5ff17cc430e230c57b186cbdd0c9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cbee2cb91b140cf86493e09a01f0283/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — The World Health Organization has declared the ongoing outbreaks of mpox in Congo and elsewhere in Africa to be a global emergency, requiring urgent action to curb the virus' transmission.",
      "publishedAt": "2024-08-16T16:19:36Z",
      "title": "Now that mpox is a global health emergency, will it trigger another pandemic?",
      "url": "https://apnews.com/59548adbbd58df7e5d176fc244e02a58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4d10527afc54e488d16028448997075/2100.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and JONATHAN MATTISE",
      "description": "WASHINGTON (AP) — A Missouri woman has been arrested on charges she orchestrated a scheme to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale, the Justice Department said Friday.",
      "publishedAt": "2024-08-16T15:42:24Z",
      "title": "Woman charged with trying to defraud Elvis Presley's family through sale of Graceland",
      "url": "https://apnews.com/d6431df76860570e5d31526e81974f7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef3ef4315a354147bd42d5e309adaff4/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "The investigation into the death of “Friends” star Matthew Perry has led to a sweeping indictment that pulled in five people who prosecutors say contributed to his ketamine overdose in October, including two doctors and a street dealer involved in providing Perry large amounts of the powerful anesthetic.",
      "publishedAt": "2024-08-16T15:58:49Z",
      "title": "What is ketamine, the drug involved in Matthew Perry's death?",
      "url": "https://apnews.com/1f6bc37573a44408146e42260b689de4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff4bb351450c4a4ba905848750277bfe/2288.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}