{
  "articles": [
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The special grand jury that investigated efforts by Donald Trump and others to overturn Georgia’s 2020 election results recommended indictments against twice as many people as the 19 ultimately charged by prosecutors, leaving South Carolina Sen.",
      "publishedAt": "2023-09-08T04:06:36Z",
      "title": "Georgia special grand jury recommended charges against 39 people, including Sen. Lindsey Graham",
      "url": "https://apnews.com/08b2cccaed514c2d8e1baae49e2f05eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/098fa1587ab442929679adf1007709b6/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The founder of North Korea's ruling dynasty, an isolationist totalitarian leader named Kim Il Sung, was still building some of the country's first nuclear facilities when Syd Seiler arrived on the Korean Peninsula as a young U.S.",
      "publishedAt": "2023-09-08T04:22:04Z",
      "title": "Ex-US intelligence officer for North Korea points to growing concern on nuclear threat toward South",
      "url": "https://apnews.com/ffce53b0d3273c1f0a863b71f7531cdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f502b18484834692a22526fff06cbf10/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and JIM MUSTIAN",
      "description": "TAMPA, Fla. (AP) — When police arrived at his house to investigate a hit-and-run, Joseph Ruddy, one of the nation’s most prolific federal narcotics prosecutors, looked so drunk he could barely stand up straight, leaning on the tailgate of his pickup to keep his balance.",
      "publishedAt": "2023-09-08T05:40:39Z",
      "title": "Body cam catches elite federal prosecutor offering his Justice Department card in DUI crash arrest",
      "url": "https://apnews.com/bb69c4cb97561e7c6f9c0352681a382a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54d5026254f342aa98b74dd00a36b9df/2875.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "NEW DELHI (AP) — President Joe Biden opened his visit to India on Friday by meeting privately with Prime Minister Narendra Modi at the Indian leader's home in a session the White House said was marked by “undeniable warmth and confidence” in one another going into the annual Group of 20 summit where climate, economic security and more will dominate the weekend's talks.",
      "publishedAt": "2023-09-08T04:02:44Z",
      "title": "Biden and Modi working in 'warmth and confidence' to build ties as Chinese leader skips G20",
      "url": "https://apnews.com/57d279a3a80eb36a80a7e5165d70e61d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8b06ff5b1d94607bec013fc9175e00e/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The White House Situation Room — a space of great mystique and even greater secrecy — just got a $50 million facelift. Actually, “room” is a misnomer. It's a 5,500-square-foot (511-square-meter), highly secure complex of conference rooms and offices on the ground floor of the West Wing.",
      "publishedAt": "2023-09-08T09:01:04Z",
      "title": "Inside the brand new White House Situation Room: Cutting-edge tech, mahogany and that new car smell",
      "url": "https://apnews.com/2662c91507aa4987fad6bc238b8633a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/463db8b10c944182ad89405acc15748f/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Former House Speaker Nancy Pelosi on Friday announced she will seek reelection to Congress in 2024 as Democrats try to win back the majority, saying “democracy is at stake.”",
      "publishedAt": "2023-09-08T16:07:27Z",
      "title": "Nancy Pelosi says she'll seek House reelection in 2024, dismissing talk of retirement at age 83",
      "url": "https://apnews.com/a251e03986a589d5c0bd7f1122f291e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96fce159b3cf45ec94751308640ee31b/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY and STEVE LeBLANC",
      "description": "WORCESTER, Mass. (AP) — The family of a teenager who died after eating an extremely spicy tortilla chip as part of a social media challenge will gather to remember the promising basketball player at a vigil Friday while they await word from Massachusetts authorities about what caused his death.",
      "publishedAt": "2023-09-08T04:24:11Z",
      "title": "Vigil planned for Massachusetts teen who died after taking part in One Chip Challenge",
      "url": "https://apnews.com/5e421f73f5cc0e439ea05f228f4b8465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0e89e4cd311483788db0f47cd56c206/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "A Philadelphia police officer who shot and killed a driver turned himself in Friday and was charged with murder in the man's death as prosecutors released graphic bodycam footage of the fatal confrontation.",
      "publishedAt": "2023-09-08T14:44:42Z",
      "title": "Philadelphia police officer surrenders on murder charges weeks after fatal shooting",
      "url": "https://apnews.com/b3ce7470c9e34400f86dde4884abbc5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14dbf5ea7a694369b99d5303ef1ca761/1451.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — The IRS announced on Friday it is launching an effort to aggressively pursue 1,600 millionaires and 75 large business partnerships that owe hundreds of millions of dollars in past due taxes.",
      "publishedAt": "2023-09-08T13:00:50Z",
      "title": "The IRS plans to crack down on 1,600 millionaires to collect millions of dollars in back taxes",
      "url": "https://apnews.com/2624282ac20388311bd03ee76ae36f70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c749c20cb6b64c8aa1ebcd65640cc68a/3000.jpeg"
    },
    {
      "author": "STEVE REED",
      "description": "CHARLOTTE, N.C. (AP) — Bryce Young is ready to roll in Carolina.C.J. Stroud is set to let it fly with Houston, while Anthony Richardson will get his shot right away in Indianapolis.The 2023 NFL season begins with three rookie quarterbacks — all taken among the first four picks in the draft — starting the season opener.",
      "publishedAt": "2023-09-08T17:15:06Z",
      "title": "NFL kickoff weekend features 3 starting rookie QBs. Only once has there been more to open a season",
      "url": "https://apnews.com/ca2e018d8e8120cdcecfb0bce3c2f6dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5994439fe2184a11b6e54fb73b478d35/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}