{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea said Friday its new submarine has nuclear attack capabilities after years of development. Leader Kim Jong Un described the milestone as crucial in his efforts to build a nuclear-armed navy to counter the United States and its Asian allies.",
      "publishedAt": "2023-09-07T23:35:18Z",
      "title": "North Korea says its latest submarine can launch nuclear weapons, but there are doubts",
      "url": "https://apnews.com/6d9f730b49f84ff5279ba6af5d241142",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8769718f84e7447da58dd35cd69a83fe/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "NEW DELHI (AP) — It’s never been easy for the leaders of the world’s largest economies to find common ground, but Russia’s war on Ukraine has made it even harder for the Group of 20 meeting to reach meaningful agreements this year.",
      "publishedAt": "2023-09-08T04:10:47Z",
      "title": "India seeks a greater voice for the developing world at G20 but the Ukraine war may overshadow talks",
      "url": "https://apnews.com/34a2f1663b6ce51739953a63e6196586",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eab845e8ed484c568f72dad8f447bdff/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A judge on Friday is expected to release the full report compiled by a special grand jury that helped an investigation by the Georgia prosecutor who ultimately indicted former President Donald Trump and 18 others.",
      "publishedAt": "2023-09-08T04:06:36Z",
      "title": "Special grand jury report that aided Georgia probe leading to Trump's indictment is set for release",
      "url": "https://apnews.com/08b2cccaed514c2d8e1baae49e2f05eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aae51be6a4374a299f5745ad5b05b717/3000.jpeg"
    },
    {
      "author": "BABA AHMED",
      "description": "BAMAKO, Mali (AP) — A military camp in Mali's restive north was attacked Friday, a day after two separate assaults by al-Qaida-linked insurgents killed 49 civilians and 15 government soldiers, the military said.",
      "publishedAt": "2023-09-07T23:00:49Z",
      "title": "Mali military camp is attacked a day after 49 civilians and 15 soldiers were killed in assaults",
      "url": "https://apnews.com/5c9da064d244c8f48321277a501eb135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c50392722be4401ad9a8bc02e4830bc/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Women's rights activists in Latin America have long looked to the United States as a model in their decades-long struggle to chip away at abortion restrictions in their highly religious countries.",
      "publishedAt": "2023-09-08T04:06:23Z",
      "title": "Latin America women's rights groups say their abortion win in Mexico may hold the key to US struggle",
      "url": "https://apnews.com/3c299b5711dd00f4c98d521f57f6c77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a159d340c7004b62b1432151d5ef4760/1920.jpeg"
    },
    {
      "author": "YURAS KARMANAU and DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Russian authorities are holding local elections this weekend in occupied parts of Ukraine in an effort to tighten their grip on territories Moscow illegally annexed a year ago and still does not fully control.",
      "publishedAt": "2023-09-08T04:07:51Z",
      "title": "Russia holds elections in occupied Ukrainian regions in an effort to tighten its grip there",
      "url": "https://apnews.com/dcdce1c6fa131ddf331f70b352e62a81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1979919e97f44a1c8c46f1b4a994f01d/3000.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "ATHENS, Greece (AP) — Floodwaters were rising around one of Greece's largest cities on Friday after a river burst its banks, while fire department and military helicopters were plucking people from villages inundated by tons of water and mud that have left at least six people dead, six missing and many people clinging to the roofs of their homes.",
      "publishedAt": "2023-09-08T09:42:57Z",
      "title": "Evacuation orders are in place in central Greece as a river bursts its banks and floodwaters rise",
      "url": "https://apnews.com/c39a65089f22d5c2f3ef2de437816bf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6256db9d844c49c183d0c4f0e2e7c0e7/3000.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SANTA ROSA, Calif. (AP) — Madison Bernard climbed into bed before dawn with her toddler, Charlotte, who was asleep next to a nightstand strewn with straws, burned tinfoil and a white powder.Hours later, the mother woke and found her daughter struggling to breathe, according to investigators who described the scene in court documents.",
      "publishedAt": "2023-09-08T04:09:42Z",
      "title": "As more children die from fentanyl, some prosecutors are charging their parents with murder",
      "url": "https://apnews.com/4767deae62a1ae1d9fa17a3edcc73f73",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5c500c276fc4f789612db61047e6d52/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Spanish state prosecutors have accused Luis Rubiales of sexual assault and coercion for kissing a player on the lips without her consent after the Women’s World Cup final, the country’s prosecutors’ office said Friday.",
      "publishedAt": "2023-09-08T11:43:18Z",
      "title": "Spanish prosecutors accuse Rubiales of sexual assault and coercion for kissing a player at World Cup",
      "url": "https://apnews.com/c45bf18c3fcf12c3f4e977b4c6956321",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28ec3f65e2fb4741b570e1925ff65cb7/3000.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "KANSAS CITY, Mo. (AP) — The Lions walked into roaring Arrowhead Stadium on Thursday night, where the Kansas City Chiefs are nearly unbeatable and were trying to open their latest Super Bowl title defense with a win, and proved what Detroit coach Dan Campbell has come to know in turning around the long downtrodden franchise.",
      "publishedAt": "2023-09-08T03:31:27Z",
      "title": "Lions spoil Chiefs' celebration of Super Bowl title by rallying for a 21-20 win in the NFL's opener",
      "url": "https://apnews.com/47ffe470713ec61bac6ed0570003658a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9edf2f9184ff4188846ebf029a0021ff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}