{
  "articles": [
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelans waited anxiously for the results of Sunday’s presidential election that could pave the way to an end to 25 years of single party rule, even as some polls remained open more than an hour after a deadline to close.",
      "publishedAt": "2024-07-28T04:03:03Z",
      "title": "Venezuelans anxiously await results of presidential election that could end one-party rule",
      "url": "https://apnews.com/5ce255ae90614162590bfe1207d2e1d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22ce85e7bd524eb4aa7a498fceef2896/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The Middle East braced for a potential flare-up in violence on Sunday after Israeli authorities said a rocket from Lebanon struck a soccer field in the Israeli-controlled Golan Heights, killing 12 children and teens in what the military called the deadliest attack on civilians since Oct.",
      "publishedAt": "2024-07-28T09:54:36Z",
      "title": "Israel weighs response to Hezbollah after a rocket from Lebanon kills 12 youths on a soccer field",
      "url": "https://apnews.com/e9430da6eefada8e2f833f5f914190aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1256eed2de4d6dbb32175ece24d24d/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, BILL BARROW, and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris' campaign has raised $200 million since she emerged as the likely Democratic presidential nominee last week, an eyepopping haul in her race against the Republican nominee, former President Donald Trump.",
      "publishedAt": "2024-07-28T09:02:00Z",
      "title": "Harris raised $200 million in first week of White House campaign and signed up 170,000 volunteers",
      "url": "https://apnews.com/5db5d7c5001c87377e4ba11250fff597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dd8d9cf5c3c4a7aaa62fd471bde5e88/3000.jpeg"
    },
    {
      "author": "NIC COURY and REBECCA BOONE",
      "description": "FOREST RANCH, Calif. (AP) — Wildfires across the western United States and Canada put millions of people under air quality alerts on Sunday as thousands of firefighters battled the flames, including the largest wildfire in California this year.",
      "publishedAt": "2024-07-28T17:11:29Z",
      "title": "Crews battle wildfires across the US West and fight to hold containment lines",
      "url": "https://apnews.com/0efabc7891459d4f8cdfa038a895e69d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f707a9f557884e989adb9f26179c7737/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The lawyer of a powerful Mexican drug cartel leader who is now in U.S. custody pushed back Sunday against claims that his client was tricked into flying into the country, saying he was “forcibly kidnapped” by the son of Joaquín “El Chapo” Guzmán.",
      "publishedAt": "2024-07-28T17:37:58Z",
      "title": "Attorney for cartel leader 'El Mayo’ Zambada says his client was kidnapped and brought to the US",
      "url": "https://apnews.com/989e3e51e53b2f6da97f6dc9275c61e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f6a61de70e4cc6b9534f24b2ebbd00/2000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — The similarities were striking. Maybe fitting in the birthplace of déjà vu.Simone Biles sitting off to the side at the Olympics.",
      "publishedAt": "2024-07-28T09:40:03Z",
      "title": "Simone Biles shakes off a calf injury to dominate during Olympic gymnastics qualifying",
      "url": "https://apnews.com/590bfce552aef32cb12fb0e3bb64ecd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ceec9d7a5a14feebdd50dd6e657e482/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — A manipulated video that mimics the voice of Vice President Kamala Harris saying things she did not say is raising concerns about the power of artificial intelligence to mislead with Election Day about three months away.",
      "publishedAt": "2024-07-28T20:59:02Z",
      "title": "A manipulated video shared by Musk mimics Harris' voice, raising concerns about AI in politics",
      "url": "https://apnews.com/3a5df582f911a808d34f68b766aa3b8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/859cadd3370b47e8bb6114227d82dceb/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — New blood tests could help doctors diagnose Alzheimer’s disease faster and more accurately, researchers reported Sunday – but some appear to work far better than others.",
      "publishedAt": "2024-07-28T11:02:30Z",
      "title": "Blood tests for Alzheimer's may be coming to your doctor's office. Here's what to know",
      "url": "https://apnews.com/5c18dda10a3629b727008b9d7f9f7518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909df18d85ba467998d2e51b8aae18b1/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — Fifteen people were killed after a mudslide hit a homestay house in a tourist area in southeastern China on Sunday as heavy rains from what remained of a tropical storm drenched the region, state media said.",
      "publishedAt": "2024-07-28T04:19:10Z",
      "title": "Mudslide kills 15 people near tourist site in China as rains from tropical storm Gaemi drench region",
      "url": "https://apnews.com/3fdd5c362596193f3c7b1cabad3bce56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85e83c8caef94b8ea36b9c3f425447d6/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Marvel is back on top with “ Deadpool &amp; Wolverine.” The comic-book movie made a staggering $205 million in its first weekend in North American theaters, according to studio estimates Sunday.",
      "publishedAt": "2024-07-28T15:30:26Z",
      "title": "‘Deadpool & Wolverine’ smashes R-rated record with $205 million debut, 8th biggest opening ever",
      "url": "https://apnews.com/2ff49d29c7aa3cf037fb2326abbecd6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/208de704dc08477a9d0ecfd5857f9534/2574.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}