{
  "articles": [
    {
      "author": "Steve Peoples",
      "description": "Hundreds of thousands of federal workers have little more than 48 hours to explain what they accomplished over the last week. The order is part of billionaire Elon Musk’s crusade to slash what he describes as “waste everywhere\" in the federal government. Musk, who serves as President Donald Trump’s cost-cutting chief, shared the extraordinary request on his social media network on Saturday. He said that “failure to respond will be taken as a resignation.” Shortly afterward, federal employees received a three-line email telling them to share \"approx. 5 bullets of what you accomplished last week and cc your manager.” Thousands of government employees have already been forced out of the federal workforce during the first month of Trump’s administration.",
      "publishedAt": "2025-02-22T23:21:12Z",
      "title": "Musk gives all federal workers 48 hours to explain what they did last week",
      "url": "https://apnews.com/article/elon-musk-trump-federal-workers-f44257ce4cf8c04c96c8ce0ce262842f",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dbeccd/2147483647/strip/true/crop/5113x2876+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F92%2Fcf13ff0a39158f6457cec66949d4%2Fa8cd448fb7a142dfb75bd069684d2bc0"
    },
    {
      "author": "Will Weissert, Adriana Gomez Licon",
      "description": "President Donald Trump says “nobody has ever seen anything” like his administration’s sweeping effort to fire thousands of federal employees and shrink the size of government. He congratulated himself for “dominating” Washington and sending bureaucrats “packing.” Addressing an adoring crowd Saturday at the Conservative Political Action Conference in suburban Washington, Trump promised, “We’re going to forge a new and lasting political majority that will drive American politics for generations to come.” He talked up his immigration policies and his plan to scrutinize U.S. gold reserves at Fort Knox. But mostly Trump focused on past campaigns, jeering at former President Joe Biden and Kamala Harris, the former vice president.",
      "publishedAt": "2025-02-22T21:32:12Z",
      "title": "CPAC: Trump revels in mass federal firings, jeers at Biden",
      "url": "https://apnews.com/article/trump-conservative-conference-russia-ukraine-duda-b1339273857da7d3310636bc90ab77a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/97175a1/2147483647/strip/true/crop/5280x2970+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F62%2F82663a90a427244a8a85853c7828%2F1067301a6f064c65969391fb27d173a8"
    },
    {
      "author": "Calvin Woodward",
      "description": "President Donald Trump is moving with light speed and brute force to reshape America at home and abroad. In his first month back in office, he's performed a pirouette in foreign policy as he pulls the U.S. back from historic alliances, reaches out to Russia and chokes foreign aid. At home, he's fired thousands of federal workers and mandated an about-face in the missions of department after department. How much of this sticks will largely depend on courts, which appear to be the only check on Trump's expansive use of executive power. Congress has so far been compliant as Trump pursues his ends by edict instead of legislation.",
      "publishedAt": "2025-02-22T13:49:33Z",
      "title": "Trump moves with light speed and brute force in shaking the core of what America has been",
      "url": "https://apnews.com/article/trump-reshaping-america-democracy-musk-executive-power-0e8b6724d45fcdb3e6f0cef05ae7b952",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b3fb7/2147483647/strip/true/crop/3024x1701+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F40%2Fc8566d5c48341b5fed2c6e2b1f35%2F287ed54c254b46eca9e61bb0fe1bdd48"
    },
    {
      "author": "Tara Copp",
      "description": "President Donald Trump’s choice to be the top U.S. military officer, retired Air Force Lt. Gen. Dan Caine, endeared himself to the commander in chief through his military call sign, “Razin,” during a meeting in Iraq years ago. Officials who have served with Caine describe him measured and apolitical. Trump said Friday night that Caine was his pick to be the next Joint Chiefs of Staff chairman. That announcement came in the same social media post in which he fired Air Force Gen. CQ Brown Jr. Chris Miller, who was Trump’s last acting defense secretary in his first term, describes Caine as \"nontraditional\" but says he “definitely knows how the Pentagon works.”",
      "publishedAt": "2025-02-22T20:37:18Z",
      "title": "A look at Dan ‘Razin’ Caine, Trump’s pick to be the top US military officer",
      "url": "https://apnews.com/article/trump-joint-chiefs-chairman-razin-caine-military-41b3faeaefd4d965dc22b15b0223ec58",
      "urlToImage": "https://dims.apnews.com/dims4/default/404b648/2147483647/strip/true/crop/2563x1442+0+135/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Fb8%2F6e86b8fede3d5e1dfee3aa672d65%2Fd937032430084dd8b1bca6e9a0850e18"
    },
    {
      "author": "Eric Tucker, Will Weissert",
      "description": "New FBI Director Kash Patel has told senior officials that he plans to relocate 1,000 employees from Washington to field offices around the country and move an additional 500 to a bureau facility in Huntsville, Alabama. That's according to a person with knowledge of the discussions who spoke on condition of anonymity to describe plans that haven't been made public. The plans were communicated Friday, the same day Patel was sworn in at the White House. At that ceremony, Patel called the opportunity to lead the nation’s premier federal law enforcement agency the “greatest honor” of his life.",
      "publishedAt": "2025-02-21T23:08:00Z",
      "title": "New FBI Director Kash Patel plans to move up to 1,500 workers out of Washington, AP source says",
      "url": "https://apnews.com/article/fbi-trump-patel-justice-department-8fa2f99b7915ee18def9fdf61150741f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb28abf/2147483647/strip/true/crop/2877x1618+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F2f%2F4117e97ce3c72b0c9f255030405e%2Ff08263f81d774e2a98564f809c738114"
    },
    {
      "author": null,
      "description": "Red Cross ambulances have arrived in Gaza’s southernmost city of Rafah in preparation for the handover of six Israeli hostages to be freed Saturday under the Israel-Hamas ceasefire deal. AP video showed the ambulances waiting among a crowd with a line of Hamas fighters nearby in Rafah, where two of the hostages are expected to be handed over. The other four are to be handed over in central Gaza.",
      "publishedAt": "2025-02-22T06:23:32Z",
      "title": "Family confirms second body released by militants was Shiri Bibas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-22-2025-364c7abeb679e910cb5acba234469574",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1bf97d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F43%2F476efdca70eadb16c08f1e79432d%2F465de4ee09d343a18485466b3b56195c"
    },
    {
      "author": "Nicole Winfield, Silvia Stellacci",
      "description": "The Vatican is carrying on with its Holy Year celebrations without the pope. Pope Francis remains hospitalized with pneumonia and a complex respiratory infection. Doctors say it will keep him hospitalized for at least another week and regardless is still touch-and-go. In a brief early update Saturday, the Vatican said Francis slept well overnight. But doctors have warned that the main threat facing the 88-year-old Francis would be the onset of sepsis, a serious infection of the blood that can occur with pneumonia. As of Friday, there was no evidence of any sepsis, and Francis was responding to the various drugs he is taking.",
      "publishedAt": "2025-02-22T11:34:24Z",
      "title": "Sepsis a threat in pope's pneumonia battle as Vatican Holy Year celebrations march on without him",
      "url": "https://apnews.com/article/pope-francis-pneumonia-sepsis-vatican-respiratory-infection-bab5b9a141517171d4efc71fadafa0a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5775990/2147483647/strip/true/crop/3445x1938+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F6b%2Fe8a8c0c84a588615d96e4939864f%2Fd3d35ff587814047b6884cca820ff090"
    },
    {
      "author": null,
      "description": "A hospital official says a gunman has been killed after shots were fired at a hospital in central Pennsylvania. Officials at UPMC Memorial in York said that no patients were injured and that the gunman is dead. The extent of any other injuries was unclear. Law enforcement is on premises and is managing the situation. UPMC Memorial is a five-story, 104-bed hospital in York that opened in 2019.",
      "publishedAt": "2025-02-22T17:46:18Z",
      "title": "Shooter dead after opening fire at Pennsylvania's UPMC Memorial hospital",
      "url": "https://apnews.com/article/york-pennsylvania-hospital-shooting-gunman-dead-270382b4e7bb1c48e78b50247c722df4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's deputy foreign minister says preparations have begun for a face-to-face meeting between U.S. President Donald Trump and Russia's Vladimir Putin. Sergei Ryabkov told Russian state media on Saturday that a possible summit could involve broad talks on global issues, including the war in Ukraine. But he said efforts to bring it about are at an early stage. Last week Russian and U.S. representatives agreed to start working toward ending the war and improving their diplomatic and economic ties, at high-level talks in Saudi Arabia that marked an extraordinary about-face in U.S. foreign policy under President Trump.",
      "publishedAt": "2025-02-22T12:36:47Z",
      "title": "Trump-Putin summit preparations are underway, Russia says",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-talks-89e19bc56677064f6f9a6d6e03de7362",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e95ea0/2147483647/strip/true/crop/4730x2661+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Ff3%2F72fe7b8ef362f1f0cb1220ae473f%2F9f0d8c65f7ba4fbaa7b4c6787cd1261f"
    },
    {
      "author": null,
      "description": "Military officials say a shooting at a U.S. Air Force base in New Mexico has left one airman dead and another wounded. A spokesperson for Kirtland Air Force Base in Albuquerque says the shooting happened near one of the entrances at about 2 a.m. Saturday and was not a terrorist act or an attack by an outsider. One airman died at the scene and the other was taken to a hospital with a gunshot wound to a hand and later discharged. The Air Force released few other details and did not immediately say whether someone was in custody or if there was a search for a suspect.",
      "publishedAt": "2025-02-22T17:49:27Z",
      "title": "Shooting at Air Force Base in New Mexico kills airman, wounds another",
      "url": "https://apnews.com/article/shooting-kirtland-air-force-base-new-mexico-cc56a0c9b0e1606bec2dd3447063977b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}