{
  "articles": [
    {
      "author": "JILL COLVIN and AMANDA SEITZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump says he will nominate anti-vaccine activist Robert F. Kennedy Jr. to lead the Department of Health and Human Services, putting him in charge of a massive agency that oversees everything from drug, vaccine and food safety to medical research and the social safety net programs Medicare and Medicaid.",
      "publishedAt": "2024-11-14T21:01:26Z",
      "title": "Trump chooses anti-vaccine activist Robert F. Kennedy Jr. as health secretary",
      "url": "https://apnews.com/f40ee2398e3a280c1586eecdd80bdf7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2ae26072bde4c7b9c9694b5af8c32c4/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Americans are fed up with the price of food, and many are looking to President-elect Donald Trump to lower their grocery bills.",
      "publishedAt": "2024-11-14T14:31:02Z",
      "title": "Food prices worried most voters, but Trump's plans likely won't lower their grocery bills",
      "url": "https://apnews.com/b69a367ebb7dafe416b8f99b94256cf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2a2adcfde584c0e913302573b5ba931/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump has had few defenders in Congress as reliable as Matt Gaetz, who has thundered at one prosecutor after another for perceived bias against the president-elect and emphatically amplified the Republican's rallying cry that the criminal investigations into him are “witch hunts.”",
      "publishedAt": "2024-11-14T05:03:33Z",
      "title": "Gaetz pick shows value Trump places on loyalty — and retribution — as he returns to Washington",
      "url": "https://apnews.com/0aa4f13e1e3186a6c3664a1d3b248eb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a6440dbb2c4d1d830ba506257e7663/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "The satirical news publication The Onion was named the winning bidder for Alex Jones' Infowars at a bankruptcy auction, backed by families of Sandy Hook Elementary School shooting victims whom Jones owes more than $1 billion in defamation judgments for calling the massacre a hoax.",
      "publishedAt": "2024-11-14T14:07:21Z",
      "title": "Satire publication The Onion buys Alex Jones' Infowars at auction with Sandy Hook families' backing",
      "url": "https://apnews.com/6496f198d141c991087dcd937b3588e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d0cf69c42264f1980f0ea5da2fc6b12/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Chair Jerome Powell said Thursday that the Federal Reserve will likely cut its key interest rate slowly and deliberately in the coming months, in part because inflation has shown signs of persistence and the Fed's officials want to see where it heads next.",
      "publishedAt": "2024-11-14T20:01:55Z",
      "title": "Powell says Fed will likely cut rates cautiously given persistent inflation pressures",
      "url": "https://apnews.com/0fbe8b37fad39e03ded3bfc87d9ccc9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42c13b3067034babae1e26410a6abd64/3000.jpeg"
    },
    {
      "author": "ALBERT AJI",
      "description": "DAMASCUS, Syria (AP) — Israel carried out at least two airstrikes on a western neighborhood of Damascus and one of the capital’s suburbs on Thursday, killing at least 15 people and wounding another 16, Syria's state news agency said.",
      "publishedAt": "2024-11-14T14:30:06Z",
      "title": "2 Israeli airstrikes hit Syria's capital and a suburb, killing 15 people, Syrian state media says",
      "url": "https://apnews.com/1f6dd957d1d6c8f610349e99cfed1a98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2110458a9d264d91b08cc07606ff8a28/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Those ever-present TV drug ads showing patients hiking, biking or enjoying a day at the beach could soon have a different look: New rules require drugmakers to be clearer and more direct when explaining their medications' risks and side effects.",
      "publishedAt": "2024-11-14T14:42:57Z",
      "title": "New FDA rules for TV drug ads: Simpler language and no distractions",
      "url": "https://apnews.com/80bbe076f4ed743ebde3923dd28be004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b03da42a5934648beaf68469444d54a/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Suicides in the U.S. military increased in 2023, continuing a long-term trend that the Pentagon has struggled to abate, according to a Defense Department report released on Thursday.",
      "publishedAt": "2024-11-14T13:00:37Z",
      "title": "Suicides in the US military increased in 2023, continuing a long-term trend",
      "url": "https://apnews.com/3f8c429edca42823900a7f0c9fa60f61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58251378abfc4b1a9e09e073ea79b7db/3000.jpeg"
    },
    {
      "author": "BILL BARROW and MARC LEVY",
      "description": "ATLANTA (AP) — After losing the White House and both houses of Congress, Democrats are grappling with how to handle transgender politics and policy following a campaign that featured withering and often misleading GOP attacks on the issue.",
      "publishedAt": "2024-11-14T15:38:27Z",
      "title": "Trump hammered Democrats on transgender issues. Now the party is at odds on a response",
      "url": "https://apnews.com/bbae5660ef59110e5fc9c24f98b082d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c2a9dba39d44f0a848e92a731b26acf/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "ST. PETERSBURG, Fla. (AP) — The Tampa Bay Rays will play their 2025 home games at the New York Yankees' nearby spring training ballpark amid uncertainty about the future of hurricane-damaged Tropicana Field, Rays executives told The Associated Press.",
      "publishedAt": "2024-11-14T16:54:37Z",
      "title": "Hurricane-stricken Tampa Bay Rays to play 2025 season at Yankees' spring training field in Tampa",
      "url": "https://apnews.com/112a238a23b1223b9222effcb26b8911",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/287e0c326c6d4a6d921212e8906e711c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}