{
  "articles": [
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Union leaders and Hollywood studios reached a tentative agreement Sunday to end a historic screenwriters strike after nearly five months, though no deal is yet in the works for striking actors.",
      "publishedAt": "2023-09-25T02:23:54Z",
      "title": "Writers Guild and Hollywood studios reach tentative agreement to end strike. No deal yet for actors",
      "url": "https://apnews.com/3336824c06795931845c889f1e08b3ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1faf74492ad14a3388db40f09bb8d04b/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The Biden administration announced Monday that it has awarded more than $1.4 billion to projects that improve railway safety and boost capacity, with much of the money coming from the 2021 infrastructure law.",
      "publishedAt": "2023-09-25T09:05:46Z",
      "title": "Biden administration announces $1.4 billion to improve rail safety and boost capacity in 35 states",
      "url": "https://apnews.com/9a7ff416e41d531dfb996d332a1ba146",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9636cd82167041269b62cc401dd55895/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — From just outside the burn zone in Lahaina, Jes Claydon can see the ruins of the rental home where she lived for 13 years and raised three children. Little remains recognizable beyond the jars of sea glass that stood outside the front door.",
      "publishedAt": "2023-09-25T04:25:39Z",
      "title": "Residents prepare to return to sites of homes demolished in Lahaina wildfire 7 weeks ago",
      "url": "https://apnews.com/c5f6f108afc9432d66edf34a4976d48f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dec45b3a73b341239c75e7ced8a32c98/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "LUHANSK REGION, Ukraine (AP) — Flying above enemy lines, a Ukrainian reconnaissance drone sends a clear image back to soldiers hiding in a basement a few kilometers away: A Russian armored vehicle is idling along a key logistics route, looking like easy prey in the artillery-scarred green landscape.",
      "publishedAt": "2023-09-25T04:13:38Z",
      "title": "Ukraine is building an advanced army of drones. For now, pilots improvise with duct tape and bombs",
      "url": "https://apnews.com/589f1fc0e0db007ea6d344b197207212",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3940489a33f4423fa4658f3de539fd89/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — The second Republican presidential debate will be broadcast Wednesday on Fox Business Network and Univision, but the exclusive online livestream will take place on Rumble, an alternative video-sharing platform that has been criticized for allowing— and at times promoting — far-right extremism, bigotry, election disinformation and conspiracy theories.",
      "publishedAt": "2023-09-25T04:01:55Z",
      "title": "RNC's livestreaming partner for the GOP debate is a haven for disinformation and extremism",
      "url": "https://apnews.com/a6e627ac88463f9f83ada062ea83c6db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6c2d96b045f44319573f828accde202/3000.jpeg"
    },
    {
      "author": "SUDHIN THANAWALA",
      "description": "ATLANTA (AP) — Judge Peter Cahill hardly slept during the six weeks he presided over the murder trial of Minneapolis police officer Derek Chauvin for killing George Floyd.",
      "publishedAt": "2023-09-25T04:04:31Z",
      "title": "Past high-profile trials suggest stress and potential pitfalls for Georgia judge handling Trump case",
      "url": "https://apnews.com/91718eb1aabf41c1bc504c9aee24c906",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd365c6118ae4b5fa4b8bfa9f12f6974/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — Oil prices have risen, meaning drivers are paying more for gasoline and truckers and farmers more for diesel.",
      "publishedAt": "2023-09-25T09:21:04Z",
      "title": "Oil prices have risen. That's making gas more expensive for US drivers and helping Russia's war",
      "url": "https://apnews.com/a9f4ddbd815dd6c6fd90698443e7b8b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43a1984dc97842f786ea9f3891e269d8/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "INDEPENDENCE, Mo. (AP) — It's a Monday in September, but with schools closed, the three children in the Pruente household have nowhere to be. Callahan, 13, contorts herself into a backbend as 7-year-old Hudson fiddles with a balloon and 10-year-old Keegan plays the piano.",
      "publishedAt": "2023-09-25T05:07:15Z",
      "title": "More schools are adopting 4-day weeks. For parents, the challenge is day 5",
      "url": "https://apnews.com/af7686cb78a39a136c9b97d7d59c1b71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ff49564bfd240959180053177ca8158/3000.jpeg"
    },
    {
      "author": "AVET DEMOURIAN",
      "description": "YEREVAN, Armenia (AP) — Thousands of Armenians streamed out of Nagorno-Karabakh after the Azerbaijani military reclaimed full control of the breakaway region while Turkish President Recep Tayyip Erdogan visited Azerbaijan Monday in a show of support to its ally.",
      "publishedAt": "2023-09-25T09:41:45Z",
      "title": "Thousands of Armenians flee Nagorno-Karabakh as Turkish president visits Azerbaijan",
      "url": "https://apnews.com/275856efde7cb8f9a82d505bd36edf17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/305c5286b6814cc0bbe139e979ea5269/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR and MADDIE BURAKOFF",
      "description": "Neanderthals live on within us.These ancient human cousins, and others called Denisovans, once lived alongside our early Homo sapiens ancestors. They mingled and had children. So some of who they were never went away — it's in our genes.",
      "publishedAt": "2023-09-25T05:04:46Z",
      "title": "We carry DNA from extinct cousins like Neanderthals. Science is now revealing their genetic legacy",
      "url": "https://apnews.com/e49cb7d939cfe5d583e7ed0af8751784",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0fac0a93cc0477ca78189d016064de9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}