{
  "articles": [
    {
      "author": "PATRICK WHITTLE and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — A huge swath of the U.S. was blasted with ice, snow and wind on Monday as the polar vortex that dipped south over the weekend kept an area stretching from the Rocky Mountains to the coast of Maine in its frigid grip, making many roads treacherous, forcing school closures, and causing widespread power outages and flight cancellations.",
      "publishedAt": "2025-01-06T05:02:53Z",
      "title": "Polar vortex keeps a huge swath of the US in its icy grip",
      "url": "https://apnews.com/8b96d7f30cd068a56f7d0401ab51cebe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ebcb0f98d9e42d9b8bc7e5d5faa7c4a/1920.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau announced his resignation Monday in the face of rising discontent over his leadership and after the abrupt departure of his finance minister signaled growing turmoil within his government.",
      "publishedAt": "2025-01-06T14:14:44Z",
      "title": "Canada's Trudeau resigns as Liberal Party leader, spelling end to time in power",
      "url": "https://apnews.com/03b27b55590bda7fb341065dd51fb873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc94930d2a79470a9eb16d9c181f1fb0/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — As Congress convenes during a winter storm to certify President-elect Donald Trump's election, the legacy of Jan.",
      "publishedAt": "2025-01-06T05:03:45Z",
      "title": "Congress is ready to certify Trump's election win, but his Jan. 6 legacy hangs over the day",
      "url": "https://apnews.com/b8284b9b6b22f78ab7f23f8c8b3c3da3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdad54e1fb3f4dceab798640529c3e0a/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is taking a message to the grieving families of victims in the deadly New Year's attack in New Orleans: “It takes time.",
      "publishedAt": "2025-01-06T12:04:36Z",
      "title": "Biden is traveling to New Orleans following the French Quarter attack that killed 14 and injured 30",
      "url": "https://apnews.com/5c92619c079e2f104e42e1d7b8bea424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad27c2a81faa4956908bcad21674dc5f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — President-elect Donald Trump on Monday moved to indefinitely postpone this week’s sentencing in his hush money case as he appeals a ruling that upheld the verdict and put him on course to be the first president to take office convicted of crimes.",
      "publishedAt": "2025-01-06T14:34:59Z",
      "title": "Trump’s lawyers ask judge to halt Friday's hush money case sentencing while they appeal to block it",
      "url": "https://apnews.com/e20933f9418bd378925e5f9e75f28485",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48a0df45299f4adab56c57db8a3141fb/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis on Monday named the first woman to head a major Vatican office, appointing an Italian nun, Sister Simona Brambilla, to become prefect of the department responsible for all the Catholic Church's religious orders.",
      "publishedAt": "2025-01-06T12:22:56Z",
      "title": "Pope Francis has named the first woman to head a major Vatican office",
      "url": "https://apnews.com/cf2602d26d3ec84a7993f872916b1b89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c74720837d34976bc9ec9866ae228c0/1900.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Nippon Steel and U.S. Steel filed a federal lawsuit Monday challenging a Biden administration decision to block Nippon's proposed $15 billion acquisition of the Pittsburgh company and said that the head of the Steelworkers union and a rival steelmaker worked together to scuttle the buyout.",
      "publishedAt": "2025-01-06T12:34:16Z",
      "title": "Nippon, US Steel file suit against Biden administration, union, and rival after $15B deal scuttled",
      "url": "https://apnews.com/eacf51a38e26280080f49fb280cb70a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92b59f28f77e4e0e838bcb9917964a3b/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Gunmen opened fire on a bus carrying Israelis in the occupied West Bank on Monday, killing three people and wounding seven others. Violence has surged in the territory since Hamas’ Oct.",
      "publishedAt": "2025-01-06T08:01:25Z",
      "title": "Shooting attack on a bus kills 3 Israelis in the occupied West Bank",
      "url": "https://apnews.com/0258e5a061f150c36f0e8d416f01810c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c95697687c0a4f05878c01ef6f2e2077/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — It's the largest prosecution in Justice Department history — with reams of evidence, harrowing videos and hundreds of convictions of the rioters who stormed the U.S.",
      "publishedAt": "2025-01-06T12:08:11Z",
      "title": "Hundreds of Capitol riot prosecutions are in limbo as a DC court awaits Trump's White House return",
      "url": "https://apnews.com/d8e4549d92feb44bee76ffb2f7758914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9948af777484a9187c3a84a25b2b9f8/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — CES, the annual trade show of all things tech, is upon us.The multi-day event, organized by the Consumer Technology Association, kicks off this week in Las Vegas — where swaths of the latest gadgets and advances across industries like personal tech, transportation, health care, sustainability and more are set to be on display.",
      "publishedAt": "2025-01-06T13:12:39Z",
      "title": "CES 2025 is here. What can we expect from the annual show of all-thing tech?",
      "url": "https://apnews.com/e61bd161c73a0a313658598911a2d3fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3cd745bdb08418bb7d91eb928d94528/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}