{
  "articles": [
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military launched airstrikes early Friday on two locations in eastern Syria linked to Iran's Revolutionary Guard Corps, the Pentagon said, in retaliation for a slew of drone and missile attacks against U.S.",
      "publishedAt": "2023-10-27T02:08:36Z",
      "title": "US strikes Iran-linked sites in Syria in retaliation for attacks on US troops",
      "url": "https://apnews.com/af3c7a0f069b8c8b08f6feaa0e165d6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5154afd136a40aea3829dd15ae4df05/2945.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT BUMSTED, HOLLY RAMER and MICHAEL BALSAMO",
      "description": "LEWISTON, Maine (AP) — Heavily armed police surrounded a home Thursday as they searched for a U.S. Army reservist who authorities say killed 18 people and wounded 13 in a mass shooting at a bowling alley and a bar in Lewiston, Maine.",
      "publishedAt": "2023-10-26T00:24:51Z",
      "title": "Heavily armed police surround home in search for suspect in the fatal shooting of 18 in Maine",
      "url": "https://apnews.com/49da6d06a8b5a15d3b619b3927bc33ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0dd71b6f12448aa8deb7f23c8dd9c07/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE, LINDSAY WHITEHURST and MARC LEVY",
      "description": "PORTLAND, Maine (AP) — Barely four years before a gunman's deadly rampage in Maine, a state that is staunchly protective of gun rights, the governor signed a law aimed at preventing a mass shooting like the one Wednesday night that claimed at least 18 lives.",
      "publishedAt": "2023-10-26T17:54:41Z",
      "title": "Maine passed a law to try to prevent mass shootings. Some say more is needed after Lewiston killings",
      "url": "https://apnews.com/c0ea366da50bd9d9dd4fb1aac256c049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2774c3f8a9554ccab6e5f53dfb41c0fb/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, KAREEM CHEHAYEB and AMY TEIBEL",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops and tanks briefly raided northern Gaza overnight, the military said Thursday, engaging with Hamas fighters and targeting anti-tank weapons in order to “prepare the battlefield” before an expected ground invasion.",
      "publishedAt": "2023-10-26T05:41:33Z",
      "title": "Israeli troops briefly raid northern Gaza to 'prepare' for an expected full-scale incursion",
      "url": "https://apnews.com/2964c54724e0e80382dd29756b3427bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eea99bb87cca48c2803037ef4eaaad0f/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — How many Palestinians have been killed in the Gaza Strip since the war between Israel and Hamas started?With Israel besieging and bombing territory at a scale never seen before, arriving at a precise answer isn't easy.",
      "publishedAt": "2023-10-26T18:41:05Z",
      "title": "EXPLAINER: What is Gaza's Ministry of Health and how does it calculate the war's death toll?",
      "url": "https://apnews.com/59470820308b31f1faf73c703400b033",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44d38772fce54c088ee30b7df14c1025/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "The new leader of one of the chambers of Congress that will certify the winner of next year's presidential election helped spearhead the attempt to overturn the last one, raising alarms that Republicans could try to subvert the will of the voters if they remain in power despite safeguards enacted after the 2021 attack on the U.S.",
      "publishedAt": "2023-10-26T04:04:21Z",
      "title": "New US House speaker tried to help overturn the 2020 election, raising concerns about the next one",
      "url": "https://apnews.com/8cd7c5a9e6ae69635bbb4624cc78e5c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f05679f2bcbd46299375087703fcfcb0/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "ACAPULCO, Mexico (AP) — Survivors of a Category 5 storm that killed at least 27 people as it devastated Mexico’s resort city of Acapulco spent Thursday searching for acquaintances and necessities and hoping that aid would come quickly in the wake of Hurricane Otis.",
      "publishedAt": "2023-10-26T05:15:46Z",
      "title": "Hurricane Otis survivors search for friends and necessities in devastated Acapulco",
      "url": "https://apnews.com/17b4b34147a2fe5acbe980a0b5b06aa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union said Wednesday it has reached a tentative contract agreement with Ford that could be a breakthrough toward ending the nearly 6-week-old strikes against Detroit automakers.",
      "publishedAt": "2023-10-25T17:24:17Z",
      "title": "Autoworkers reach a deal with Ford, a breakthrough toward ending strikes against Detroit automakers",
      "url": "https://apnews.com/08a81503d72e44d4efa40549f684d5a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b36d130cce04d7096f85c64efc63152/1920.jpeg"
    },
    {
      "author": "JEFF AMY and KATE BRUMBACK",
      "description": "ATLANTA (AP) — A federal judge ruled Thursday that some of Georgia's congressional, state Senate and state House districts were drawn in a racially discriminatory manner, ordering the state to draw an additional Black-majority congressional district.",
      "publishedAt": "2023-10-26T16:54:09Z",
      "title": "Judge says Georgia's congressional and legislative districts are discriminatory and must be redrawn",
      "url": "https://apnews.com/3a29f4d5662e8908cc083aa07c37abd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b052535238a54f339774e766deae41f7/3000.jpeg"
    },
    {
      "author": "EMILY WANG FUJIYAMA and KANIS LEUNG",
      "description": "BEIJING (AP) — Former Premier Li Keqiang, China’s top economic official for a decade, died Friday of a heart attack. He was 68. Li was China’s No. 2 leader from 2013-23 and an advocate for private business but was left with little authority after President Xi Jinping made himself the most powerful Chinese leader in decades and tightened control over the economy and society.",
      "publishedAt": "2023-10-27T00:47:36Z",
      "title": "Former Premier Li Keqiang, China’s top economic official for a decade, dies at 68",
      "url": "https://apnews.com/537e0dbbc2a4023915cb428f44540468",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed33b47dd664442baa9edc10e7d0d427/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}