{
  "articles": [
    {
      "author": "Collin Binkley",
      "description": "Harvard University is challenging the Trump administration’s decision to bar the Ivy League school from enrolling foreign students. The school says that's an unconstitutional retaliation for defying the White House’s political demands. Harvard filed a lawsuit Friday in federal court in Boston that says the government's action violates the First Amendment and due process clause. The school says the penalty will mean an “immediate and devastating effect for Harvard and more than 7,000 visa holders.”",
      "publishedAt": "2025-05-23T12:33:43Z",
      "title": "Harvard sues over ban on foreign student enrollment",
      "url": "https://apnews.com/article/harvard-foreign-students-enrollment-trump-lawsuit-94b65866c563e67a7a7a3c79e90144d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/435c5a6/2147483647/strip/true/crop/4116x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F42%2Ff46f197d702f52e131b55bf70a35%2F1674aa3aa7314708ad42721731b58e3a"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump on Friday threatened to put a 25% tariff on Apple products unless iPhones are manufactured in the United States. The threat delivered over social media could dramatically increase the price of iPhones, potentially hurting sales and the profits of one of America’s leading technology companies. The company now joins Amazon, Walmart and other major companies as being in the White House’s crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by the import taxes being imposed by Trump.",
      "publishedAt": "2025-05-23T11:39:48Z",
      "title": "Trump threatens 25% import tax on Apple unless iPhones are made in the US",
      "url": "https://apnews.com/article/trump-tariff-apple-iphone-tax-170021e8fad22878d0183b5d48971087",
      "urlToImage": "https://dims.apnews.com/dims4/default/060d102/2147483647/strip/true/crop/5383x3028+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F4a%2F263e817a39437ebb480885f4b629%2F2b51e19e1e9649db8f993672e49ba853"
    },
    {
      "author": "Mary Clare Jalonick, Matt Brown, Joey Cappelletti",
      "description": "House Republicans are jubilant about muscling through President Donald Trump’s “big, beautiful” tax and immigration package by a single vote. But across the Capitol, senators are more cautious. Senate Majority Leader John Thune can afford to lose three Republican senators and still pass the bill, and there are more than that who have problems with it. Like the House, he will have to balance the concerns from moderate and conservative members of his conference. Republicans’ aspirational deadline is July 4, ahead of a potential debt default. Thune said groups of senators had already been meeting to discuss the legislation.",
      "publishedAt": "2025-05-23T17:06:52Z",
      "title": "What issues to watch as 'big, beautiful bill' heads to Senate",
      "url": "https://apnews.com/article/tax-cuts-medicaid-congress-senate-trump-bill-2825f8fa0e96a00cf72a6de6a5a88a25",
      "urlToImage": "https://dims.apnews.com/dims4/default/c695ee7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F1c%2F66b09e8e9f9f5170e320183e582f%2F302b598ab5c942f7b58676fed6692087"
    },
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "A senior Ukrainian officials says an exchange of prisoners between Russia and Ukraine from their more than three-year war is underway. The official said the swap was ongoing Friday morning and had not yet finished. He who spoke on condition of anonymity because he was not authorized to speak publicly. Moscow did not immediately confirm the exchange was underway. Ukraine and Russia agreed to the exchange of 1,000 prisoners from each side a week ago in Turkey in their first direct peace talks since the early weeks of Moscow’s 2022 invasion of its neighbor. That meeting lasted only two hours and brought no breakthrough in international diplomatic efforts to stop the fighting.",
      "publishedAt": "2025-05-23T10:32:46Z",
      "title": "Ukrainian official says major prisoner swap with Russia is underway",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-prisoner-swap-8b745966e2f9a484d80ed89fb70d5648",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e8698a/2147483647/strip/true/crop/3811x2144+0+119/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F9c%2Ffbd6560b58bb196ad2d4291a20e0%2F5f8a75af4c0541488debe56ffb388b6d"
    },
    {
      "author": "Jon Gambrell, Giada Zampano",
      "description": "Iran and the United States are preparing for a fifth round of negotiations over Tehran’s rapidly advancing nuclear program, with enrichment emerging as the key issue. U.S. officials up to President Donald Trump insist Iran cannot continue to enrich uranium at all in any deal that could see sanctions lifted on Tehran’s struggling economy. Iran’s Foreign Minister Abbas Araghchi early Friday insisted that no enrichment would mean “we do NOT have a deal.” While authorities haven't said where in Rome the talks Friday are taking place, an earlier round was held at the Omani Embassy in Italy's capital. Oman is mediating the negotiations.",
      "publishedAt": "2025-05-23T05:10:57Z",
      "title": "Iran and US resuming nuclear talks with uranium enrichment a key issue",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-rome-witkoff-araghchi-799a6604cdb2ddfe59c36acbbe69619f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a7f7e47/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Fa4%2Ff1707f8a7e3d223b76cfacd73381%2Fedcf1e7846e147f79a993e8cc0dfb103"
    },
    {
      "author": null,
      "description": "Authorities in Germany say an assailant stabbed people at the central railway station in the city of Hamburg, injuring 12 people — six of them critically. Police say a suspect in the Friday attack has been arrested. Hamburg’s fire service said that six people sustained life-threatening injuries, while another three were seriously injured and three had slight injuries. Authorities didn’t give any details of the suspect, or additional details of the attack.",
      "publishedAt": "2025-05-23T17:20:10Z",
      "title": "12 people injured in stabbing at Hamburg train station, authorities say",
      "url": "https://apnews.com/article/stabbing-hamburg-train-station-aa0c9d31a07e6055cf465986cbe578d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d391f2/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F15%2F9e4886f2d483a9d9a5acdf8829a8%2Fe00116d7f5b54b45a1d60592ea5c45b4"
    },
    {
      "author": "Michael Biesecker, Jim Mustian",
      "description": "In the years before he was accused of killing two Israeli Embassy employees, the suspect in the fatal shootings was an active participant in Chicago’s left-wing protest scene, speaking out against police violence and a proposed Amazon headquarters. Then the war in Gaza ignited his fury into violence. Thirty-one-year-old Elias Rodriguez was charged Thursday with the murder of foreign officials and other crimes in connection with the deaths of Israeli citizen Yaron Lischinsky and Sarah Milgrim, an American, as they left an event at a Jewish museum. The couple had plans to become engaged. Court papers said he told police after his arrest, “I did it for Palestine, I did it for Gaza.”",
      "publishedAt": "2025-05-23T15:16:29Z",
      "title": "Suspect in shooting of Israeli Embassy staffers railed against Gaza war in online posts",
      "url": "https://apnews.com/article/israel-embassy-jewish-museum-shooting-gaza-e3774932a9628998588ce322b2f017de",
      "urlToImage": "https://dims.apnews.com/dims4/default/826b37c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F3a%2F403a88c93bb28c05edef23c1d539%2Faa9e40ac6de647e6a2ad76ef57bedc51"
    },
    {
      "author": "Wafaa Shurafa",
      "description": "At least 23 people were killed by Israeli strikes across Gaza overnight as Israel pressed ahead with its military offensive and let in minimal aid to the strip. Ten people were killed by strikes in the southern city of Khan Younis, four in the central town of Deir al-Balah and nine in the Jabaliya refugee camp in the north. Israel is facing mounting international criticism for its latest offensive and pressure to let aid into Gaza amid a catastrophic humanitarian crisis. The strip has been under an Israeli blockade for nearly three months, according to the United Nations. Experts have warned that many of Gaza’s 2 million residents are at high risk of famine.",
      "publishedAt": "2025-05-23T10:15:20Z",
      "title": "At least 23 people killed by Israeli strikes in Gaza as Israel lets minimal aid in",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-23-2025-ca90ad92d081bb639d75e02625d975c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/64e9426/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F00%2F85f0462e1835cf137db3ff641e0b%2F31e676c9c721483e946920dba2fdd33a"
    },
    {
      "author": "Jim Mustian, Jack Brook",
      "description": "The recent jailbreak in New Orleans followed decades of dysfunction in the city's jail system and recent warnings that conditions were ripe for catastrophe. Among the most memorable scandals was a series of jailhouse videos showing inmates chugging Budweiser, snorting drugs and ejecting bullets from a handgun. That footage fueled a sweeping 2013 court order intended to reform one of the most violent jails in the U.S. But much of that makeover remains unfulfilled despite federal oversight and the 2015 opening of the state-of-the-art Orleans Justice Center. An independent jail monitor has warned for months of “extremely inadequate” staffing levels and dangerously lax supervision.",
      "publishedAt": "2025-05-23T16:51:41Z",
      "title": "New Orleans jail escape highlights decades of issues",
      "url": "https://apnews.com/article/new-orleans-jail-history-escape-f525fb6102af030dba48e3c7c9af276a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9bf9d3f/2147483647/strip/true/crop/4000x2250+0+137/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2Ff8%2F76f05d9ff5765c7bae0b010b1354%2Fe1b6839a511d4570a530b45e93f399fa"
    },
    {
      "author": "Dorany Pineda, Brittany Peterson",
      "description": "Retired firefighter Mark Whaling knows firsthand what it’s like to wait on a helicopter to refill on water while he's battling a blaze on the ground. Before retiring from the Los Angeles County Fire Department, he worked to develop the Heli-Hydrant – a small, open tank that can be located in urban areas to give helicopters a much closer water source than when they have to fly to natural sources such as lakes and rivers. The Heli-Hydrants are drawing interest from officials eager to boost their preparedness for wildfires, especially in the West. One was used nearly 40 times last fall in a fire near San Diego.",
      "publishedAt": "2025-05-23T13:07:20Z",
      "title": "Heli-hydrant water tanks speed helicopter responses to California wildfires",
      "url": "https://apnews.com/article/wildfires-helicopter-water-tanks-drought-climate-change-78d64dcc5f7c6544cbf9160a1a7b24ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbbe2ed/2147483647/strip/true/crop/4025x2264+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fdb%2F6fe52ec4a8857b0a1191e1c92956%2Fd7214ac8dbb54e6d850c17affdb843df"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}