{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — Israel’s defense minister on Monday pushed back against international calls to wrap up the country’s military offensive in the Gaza Strip, saying the current phase of the operation against the Hamas militant group will “take time.”",
      "publishedAt": "2023-12-11T08:04:02Z",
      "title": "Israeli defense chief resists pressure to halt Gaza offensive, says campaign will 'take time'",
      "url": "https://apnews.com/2beb52343a9b25050d8df801ad977bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b08863ff52d4c1daab406fb077142fc/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith on Monday asked the Supreme Court to take up and rule quickly on whether former President Donald Trump can be prosecuted on charges he plotted to overturn the 2020 election results.",
      "publishedAt": "2023-12-11T17:45:54Z",
      "title": "Special counsel Jack Smith asks the Supreme Court to rule quickly on whether Trump can be prosecuted",
      "url": "https://apnews.com/f3e7206bdf169c9faa15a19084541824",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ebb0d04064e43649fe9fe273f8b6d50/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "When the U.S. Supreme Court undid the nationwide right to abortion last year, it did not remove the issue from the courts.Instead, it opened a new frontier of litigation, with states passing their own restrictions and opponents challenging them in courts across the country.",
      "publishedAt": "2023-12-11T19:15:46Z",
      "title": "What to know about abortion lawsuits being heard in US courts this week",
      "url": "https://apnews.com/42776ba0bc37394f86dc779be98e0949",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37f399b7835b4b5db9fba13f261ba407/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — Hundreds of Harvard faculty members are urging the Ivy League university to keep its president, Claudine Gay, in command as she faces calls from some lawmakers and donors to step down over comments at a congressional hearing on antisemitism.",
      "publishedAt": "2023-12-11T19:52:16Z",
      "title": "Harvard faculty rallies to the aid of university president criticized for remarks on antisemitism",
      "url": "https://apnews.com/aff2c8e58088654953cac9c334170444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c765793e05246a8a30d2cc170765484/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — A federal court jury has decided that Google’s Android app store has been protected by anticompetitive barriers that have damaged smartphone consumers and software developers, dealing a blow to a major pillar of a technology empire.",
      "publishedAt": "2023-12-11T08:14:39Z",
      "title": "Epic Games wins antitrust lawsuit against Google over barriers to its Android app store",
      "url": "https://apnews.com/dd6b26be7447b5ff8cc0d20a4d01b6b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/985477bb714b44858cf59aaac7a5075f/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE, HOLLY MEYER and TRAVIS LOLLER",
      "description": "NASHVILLE, Tenn. (AP) — After a March 2020 tornado destroyed the Rev. Jacques Boyd’s Nashville church, his friend, the Rev. Vincent Johnson, lent him space to worship in.",
      "publishedAt": "2023-12-11T20:57:52Z",
      "title": "Two Nashville churches, wrecked by tornadoes years apart, lean on each other in storms' wake",
      "url": "https://apnews.com/98ea671a53bebb5aebbda0b3cf138989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/971e7376bea64cb8811ffd13ccbf5f54/3000.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy kicked off a quick visit to Washington on Monday, warning in a speech at a defense university that Russia may be fighting in Ukraine but its “real target is freedom” in America and around the world.",
      "publishedAt": "2023-12-11T15:38:30Z",
      "title": "Zelenskyy issues plea for support during Washington visit as Ukraine funding stalls in Congress",
      "url": "https://apnews.com/8663f4d1e1b8b05828fde1c0be05686d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a303090f14434e95b8a40bcab3ffd9df/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Lawyers for two Georgia election workers played audio recordings in a Washington courtroom Monday of graphic and racist threats the two women received after Rudy Giuliani falsely accused them of fraud while pushing Donald Trump’s baseless claims after the 2020 election.",
      "publishedAt": "2023-12-11T05:03:30Z",
      "title": "Jurors in a Giuliani damages case hear the threats election workers got after his false claims",
      "url": "https://apnews.com/19fbeae3f5231654b4625787a78419e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb46f19bded140ce945dca9f14c905c0/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The Air Force has disciplined 15 personnel in connection with the massive classified documents leak by an airman earlier this year, concluding that multiple officials intentionally failed to take required action on his suspicious behavior, the Air Force inspector general reported Monday.",
      "publishedAt": "2023-12-11T16:39:35Z",
      "title": "Air Force disciplines 15 as IG finds that security failures led to massive classified documents leak",
      "url": "https://apnews.com/e1110c921529cafa81d3063aae615f52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1292872e194d6583daf2221de574e7/2556.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Heisman Trophy winner Jayden Daniels from LSU was one of seven players in either their fifth or sixth season of college football selected to The Associated Press All-America team announced Monday.",
      "publishedAt": "2023-12-11T17:03:10Z",
      "title": "The AP All-America team is loaded with 5th- and 6th-year players, including LSU's Heisman-winning QB",
      "url": "https://apnews.com/45e5dac6434336de5712779fbc0e7e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2ce14817bcc498eab88c850d36c42db/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}