{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio voters on Tuesday resoundingly rejected a Republican-backed measure that would have made it more difficult to change the state’s constitution, setting up a fall campaign that will become the nation’s latest referendum on abortion rights since the U.S.",
      "publishedAt": "2023-08-08T04:04:47Z",
      "title": "Voters in Ohio reject GOP-backed proposal that would have made it tougher to protect abortion rights",
      "url": "https://apnews.com/227cde039f8d51723612878525164f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbdc34f5de374e0fae8e0531c2cf889f/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and HOLLY RAMER",
      "description": "WINDHAM, N.H. (AP) — Former President Donald Trump on Tuesday kept up his attacks on special counsel Jack Smith and vowed to continue talking about his criminal cases even as prosecutors sought a protective order to limit the evidence that Trump and his team could share.",
      "publishedAt": "2023-08-08T22:04:23Z",
      "title": "Trump vows to keep talking about criminal cases despite prosecutors pushing for protective order",
      "url": "https://apnews.com/11cc4d1015c36e6ba078c00805d99838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54bc010f1eed45ab94a1b56b0347294a/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Dozens of flights and ferry services were grounded in South Korea on Wednesday ahead of a tropical storm that has dumped rain on Japan's southwestern islands for more than a week.",
      "publishedAt": "2023-08-09T03:07:52Z",
      "title": "Flights and ferries halted in South Korea ahead of storm that's dumped rain on Japan for a week",
      "url": "https://apnews.com/a1fd5a9f5fcf852543f0b9b71d81aae6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52659e48e0c14e25a0a1d14a54d33c14/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is reinstating a regulation aimed at reining in the proliferation of ghost guns, firearms without serial numbers that have been turning up at crime scenes across the nation in increasing numbers.",
      "publishedAt": "2023-08-08T16:46:37Z",
      "title": "Supreme Court reinstates regulation of ghost guns, firearms without serial numbers",
      "url": "https://apnews.com/46b871969dc6a7da35605c2ebc5385e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c70377e5a84042ad855fb6c66db241/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "BOSTON (AP) — Massachusetts Gov. Maura Healey declared a state of emergency Tuesday, citing an influx of migrants seeking shelter at a time when the cost of housing — already in short supply — continues to rise.",
      "publishedAt": "2023-08-08T20:56:43Z",
      "title": "Massachusetts governor declares state of emergency amid influx of migrants seeking shelter",
      "url": "https://apnews.com/3daeb96003779a2fe49def8e1f7b8975",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62be49f094f741dda0620fd862cf73d9/2984.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The numbers were drawn Tuesday night for an estimated $1.58 billion Mega Millions jackpot that is the third-largest in U.S.",
      "publishedAt": "2023-08-08T04:05:40Z",
      "title": "Numbers drawn for giant $1.58 billion Mega Millions jackpot",
      "url": "https://apnews.com/8397543de852fc4c716cc2ce940d9eac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9eeddc71ddbc46ef9ae08efbd619b2ad/1920.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — Mississippi Gov. Tate Reeves on Tuesday won the Republican nomination as he seeks a second term, setting up a general election contest against Democrat Brandon Presley in the heavily conservative state.",
      "publishedAt": "2023-08-08T04:08:29Z",
      "title": "Mississippi GOP Gov. Tate Reeves will face Democrat Brandon Presley in the November election",
      "url": "https://apnews.com/80b7194bfa70cce08edc475183c1d4d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9175ce311274b75939719592f525004/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A judge sentenced rapper Tory Lanez to 10 years in prison Tuesday for shooting and wounding hip-hop superstar Megan Thee Stallion in the feet, bringing a conclusion to a three-year legal and cultural saga that saw two careers, and lives, thrown into turmoil.",
      "publishedAt": "2023-08-08T04:36:02Z",
      "title": "Tory Lanez gets 10 years in prison for shooting Megan Thee Stallion",
      "url": "https://apnews.com/58a042216c01eae44bc2ed22bf45aba2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83e397c19d3d4cec8e518de8881bd474/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER",
      "description": "JUNEAU, Alaska (AP) — People in Alaska's capital have lived for more than a decade with periodic glacial dam outbursts like the one that destroyed at least two homes over the weekend.",
      "publishedAt": "2023-08-08T23:25:22Z",
      "title": "After a glacial dam outburst destroyed homes in Alaska, a look at the risks of melting ice masses",
      "url": "https://apnews.com/63a2b7424adac6e8bb42798f947fcd21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6243c261c99a4485b2261da49d16611d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}