{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has called for a just and lasting peace in Ukraine and an immediate ceasefire in Gaza with the release of hostages and delivery of humanitarian aid in his first Sunday noon blessing as pontiff. Leo said, “Never again war!” from the loggia of St. Peter’s Basilica on Sunday. Recalling the end of World War II 80 years ago, Leo quoted Pope Francis in denouncing the number of conflicts ravaging the globe today, saying it was a “third world war in pieces.”",
      "publishedAt": "2025-05-11T09:54:52Z",
      "title": "Pope Leo XIV calls for peace in Ukraine, a Gaza ceasefire and release of hostages in Sunday appeal",
      "url": "https://apnews.com/article/vatican-pope-leo-xiv-a16ff59f75260ca8baf5d90890523766",
      "urlToImage": "https://dims.apnews.com/dims4/default/060c125/2147483647/strip/true/crop/8058x4533+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fb1%2Fb9d6190b6a97a331f7dffbd7e726%2F77efdbe4e86c4e2188fc6e80aa602990"
    },
    {
      "author": "David Crary, Tiffany Stanley",
      "description": "News that the global Catholic church would get its first-ever U.S.-born pope was welcomed by Catholics across the ideological spectrum in Pope Leo XIV’s homeland, raising the question of whether he might be able to ease some of the deep divisions within its ranks. From U.S. Catholics to the left of the ideological center, there's optimism that Leo will carry on Pope Francis’ outreach to poor and marginalized people, including migrants. They also hope he'll provide a counterweight to the policies of the Trump administration that distress them. To the right, there's hope the new pope will faithfully uphold Catholic doctrine, including opposition to abortion, same-sex marriage and women’s ordination.",
      "publishedAt": "2025-05-11T11:43:27Z",
      "title": "From the left and right, US Catholics hope new pope fulfills their hopes",
      "url": "https://apnews.com/article/pope-leo-us-catholic-church-divisions-8121d1584e32a485e9a275a732cebdc6",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f270cc/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F26%2F240c18ddf041169e1a33e5e59161%2F027593d528314cc5a8e7199a07807a5f"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says he is pleased to see that Russia is finally engaging with finding an end to the war, but there must be a ceasefire before peace talks can start. Calling it a “positive sign,” he said in a post on X Sunday that “the entire world has been waiting for this for a very long time. And the very first step in truly ending any war is a ceasefire.” Russian President Vladimir Putin in remarks to the media overnight effectively rejected the ceasefire proposal and proposed restarting direct talks with Ukraine in Istanbul on May 15 instead.",
      "publishedAt": "2025-05-11T08:32:26Z",
      "title": "Ukrainian president welcomes Russian overtures but insists on ceasefire before peace talk",
      "url": "https://apnews.com/article/russia-ukraine-war-ceasefire-2b3d2fad88436c5406ea63f81ac554ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/09b03ee/2147483647/strip/true/crop/5000x2813+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F15%2F505170ed1ddbc772ba9d2b82f075%2F47a85f1fedd6499fbeaaeef8b44612ff"
    },
    {
      "author": "Munir Ahmed, Aijaz Hussain",
      "description": "Residents and officials in the disputed Kashmir region say there was overnight border fighting between Pakistani and Indian troops, despite a ceasefire to stop a conflict between the two countries. People on both sides of the Line of Control, which divides the territory, said the fighting subsided by Sunday morning. As part of the ceasefire, agreed a day earlier, the nuclear-armed neighbors agreed to immediately stop all firing and military action on land, in the air and at sea. They accused each other of repeatedly violating the deal hours later. The two countries agreed to a truce a day earlier to defuse the most serious military confrontation between them in decades following a gun massacre of tourists.",
      "publishedAt": "2025-05-11T09:09:08Z",
      "title": "India and Pakistan ceasefire shaken by overnight border fighting in disputed Kashmir region",
      "url": "https://apnews.com/article/pakistan-india-ceasefire-kashmir-6fa80010fa8ffee1da1f28e7b593aa2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/19bcbc1/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Fbc%2Fd68384f89be8d8a0b540be249d15%2F64867a6935594d288212ed7a8ee94f73"
    },
    {
      "author": "Jamey Keaten, Christopher Bodeen",
      "description": "The U.S. and China have resumed crucial tariff talks that have put the global economy on edge, but appeared to have diverging views of where the negotiations presently stand. President Donald Trump said on social media that “great progress” was being made and even suggested a “total reset” was a possibility as the sides took their seats for the second and final scheduled day of discussions in Geneva. Beijing has yet to comment directly, but its official news agency took a tough approach Saturday, saying China will “firmly reject any proposal that compromises core principles or undermines the broader cause of global equity.” No breakthroughs were announced after 10 hours of discussions on the opening day.",
      "publishedAt": "2025-05-11T09:30:41Z",
      "title": "US and China begin 2nd day of tariff talks. No breakthroughs but Trump touts 'great progress'",
      "url": "https://apnews.com/article/china-us-switzerland-tariffs-negotiations-20f32dd4f11b66bfd73bd105b7acad5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/afa9af3/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fc2%2F1ecbfbd169eee806339cb5dc712e%2Fa2616bd0547d44a6b1771c8f3a343f47"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Palestinian health officials say Israeli strikes overnight and into Sunday killed 10 people in the Gaza Strip, mostly women and children. Two of the strikes hit tents in the southern city of Khan Younis, each killing two children and their parents. Other strikes killed a child and a man riding a bicycle, according to Nasser Hospital, which received bodies from all the strikes. The Israeli military says it only targets militants and tries to avoid harming civilians. It blames Hamas for civilian deaths in the 19-month-old war because the militants are embedded in densely populated areas. There was no immediate Israeli comment on the latest strikes.",
      "publishedAt": "2025-05-11T06:25:10Z",
      "title": "Israeli strikes on Gaza kill 10 people, mostly women and children",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eace61/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F31%2Fa6fcefccd1c6f2411dee94f7a450%2F035e99094c5d4b53af2f7a197613dea8"
    },
    {
      "author": "Rodrique Ngowi, Claire Rush",
      "description": "A Tufts University student from Turkey has returned to Boston after being released from a Louisiana immigration detention center. Rumeysa Ozturk told reporters at Logan Airport on Saturday that she was grateful for the support she has received and was excited to get back to her studies. Ozturk was held for more than six weeks after she was arrested while walking along a street in a Boston suburb. Her lawyers say she was illegally detained following an op-ed she co-wrote last year that criticized her university's response to Israel and the war in Gaza. U.S. District Judge William Sessions ordered her release pending a final decision on the claims.",
      "publishedAt": "2025-05-11T01:40:20Z",
      "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
      "url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4c839d/2147483647/strip/true/crop/2540x1429+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F92%2F70f137c5733e6ce368417bce9602%2F01d55a366cba43e29982caa802110821"
    },
    {
      "author": "Bharatha Mallawarachi",
      "description": "A passenger bus has skidded off a cliff in Sri Lanka’s tea-growing hill country, killing 21 people and injuring at least 14 others. The accident occurred in the early hours of Sunday near the town of Kotmale, about 86 miles east of Colombo, the capital, in a mountainous area of central Sri Lanka, police said. The driver was injured and among those admitted to the hospital for treatment. The bus was operated by a state-run bus company. Deadly bus accidents are common in Sri Lanka, especially in the mountainous regions, often due to reckless driving and poorly maintained and narrow roads.",
      "publishedAt": "2025-05-11T04:22:35Z",
      "title": "Passenger bus skids off a cliff in Sri Lanka, killing 21 people and injuring at least 14 others",
      "url": "https://apnews.com/article/sri-lanka-deadly-bus-accident-mountains-5473095293bbd4891a231629d0d7d76f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Vanessa Gera",
      "description": "As Poland gears up for the May 18 presidential election, a striking political shift is taking shape: the once-unifying cause of support for Ukrainians is turning into a wedge issue on the campaign trail. Praised as a humanitarian model for the way Poland opened its doors to millions of Ukrainians fleeing the war, Polish society is now witnessing growing fatigue. And the candidates have taken note. Anti-Ukrainian rhetoric is now a key theme on the campaign trail, with right-wing candidates accusing Ukrainians of not being grateful enough for the help they have gotten.",
      "publishedAt": "2025-05-11T05:07:41Z",
      "title": "A million Ukrainian refugees are still in Poland. Now presidential candidates vow to put Poles first",
      "url": "https://apnews.com/article/poland-ukrainians-presidential-election-4982cc03f7b5a88c8e21cc340087e7e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/81f2054/2147483647/strip/true/crop/3461x1947+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F9f%2F17665b7da4a7fe77fe0cbe59add1%2Fe8ac95f4b79f4fce8c47b9bc944ee06b"
    },
    {
      "author": "Sarah Parvini",
      "description": "Players swiping their way through more than 18,700 levels of Candy Crush Saga might be surprised to learn they’re solving puzzles enhanced by unsuspected ally: artificial intelligence. The video game that helped make gamers out of anyone with a smartphone uses AI to help developers create levels to serve a captive audience constantly looking for more sweets to squash. King, the Swedish company that made Candy Crush, also uses AI update older levels so players don’t feel bored, stuck or frustrated as they spend hours on their phones.",
      "publishedAt": "2025-05-11T11:25:43Z",
      "title": "How AI helps push Candy Crush players through its most difficult puzzles",
      "url": "https://apnews.com/article/candy-crush-ai-artificial-intelligence-547254aaa06bf026df5b41458ac62dcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/43b9a21/2147483647/strip/true/crop/1080x608+0+656/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F98%2F1837522c4c09f9068e7197014f31%2Fdb3d803e10794691ab8f9bdb7c96ed48"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}