{
  "articles": [
    {
      "author": "SEAN MURPHY and MATT O'BRIEN",
      "description": "OKLAHOMA CITY (AP) — A body camera captured every word and bark uttered as police Sgt. Matt Gilmore and his K-9 dog, Gunner, searched for a group of suspects for nearly an hour.Normally, the Oklahoma City police sergeant would grab his laptop and spend another 30 to 45 minutes writing up a report about the search.",
      "publishedAt": "2024-08-26T10:04:19Z",
      "title": "Police officers are starting to use AI chatbots to write crime reports. Will they hold up in court?",
      "url": "https://apnews.com/a24d1502b53faae4be0dac069243f418",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94ae2da8dc994aa29727f972c3097261/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israeli forces rescued a hostage found alone and underground in Gaza on Tuesday, freeing a living captive from Hamas’ vast tunnel network for the first time since the Oct.",
      "publishedAt": "2024-08-27T12:33:09Z",
      "title": "Israel rescues a hostage found alone in an underground tunnel in Gaza",
      "url": "https://apnews.com/696f8ee830207815efd31320976ef118",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78acd2a4793c4f96b6f3ac33288ede8b/1600.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and GISELA SALOMON",
      "description": "McALLEN, Texas (AP) — Maria García began the week full of hope. Swinging by the office of her attorney in Los Angeles, she dropped off required paperwork for the Biden administration's new immigration policy that could finally give her husband, Roberto, legal residency as the spouse of an American citizen.",
      "publishedAt": "2024-08-27T16:32:46Z",
      "title": "A judge pauses key Biden immigration program. Immigrant families struggle to figure out what to do.",
      "url": "https://apnews.com/9b282ce79793004d43e393f75081f331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0a1614d85b14f2c9550a45081bb840f/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has a new advertising push to draw attention to her plan to build 3 million new homes over four years, a move designed to contain inflationary pressures that also draws a sharp contrast to Republican Donald Trump's approach.",
      "publishedAt": "2024-08-27T09:03:28Z",
      "title": "Harris campaign releases new ad to highlight plans to build 3 million homes and reduce inflation",
      "url": "https://apnews.com/00ae665790649d3b25d77a6cc0d111d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a12a180e5104e749b5261db6f2432fe/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — The Biden administration offered federal resources to Donald Trump and Kamala Harris for presidential transition planning for the first time Tuesday, with experts suggesting both are behind in preparing for their potential administrations.",
      "publishedAt": "2024-08-27T16:20:18Z",
      "title": "Presidential transition planning has begun in earnest, but Trump and Harris are already behind",
      "url": "https://apnews.com/944aa257180e7cbc5e50601a1a7119a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd44d4144c7c49e387e053bd608ad282/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader opened the door Tuesday to renewed negotiations with the United States over his country's rapidly advancing nuclear program, telling its civilian government there was “no harm\" in engaging with its “enemy.”",
      "publishedAt": "2024-08-27T10:47:38Z",
      "title": "Iran's supreme leader opens door to negotiations with United States over Tehran's nuclear program",
      "url": "https://apnews.com/bc11763f45041ac84171ebc3866f1273",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df73405f7ab14b44ac671bd2c7c750cd/2200.jpeg"
    },
    {
      "author": null,
      "description": "FALCON HEIGHTS, Minn. (AP) — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.Here's a look at some of the weather events:Midwest sizzles under heat wave",
      "publishedAt": "2024-08-27T04:08:03Z",
      "title": "Wild week of US weather includes heat wave, tropical storm, landslide, flash flood and snow",
      "url": "https://apnews.com/74406ed40b60e8dff405488e0e483fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23d63ec11f5b4fee859b05dd436b4ee8/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Meta CEO Mark Zuckerberg says senior Biden administration officials pressured Facebook to “censor” some COVID-19 content during the pandemic and vowed that the social media giant would push back if it faced such demands again.",
      "publishedAt": "2024-08-27T11:11:23Z",
      "title": "Zuckerberg says the White House pressured Facebook over some COVID-19 content during the pandemic",
      "url": "https://apnews.com/463ac6e125b0d004b16c7943633673fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55c91c7d49314db6954779be5d6721c3/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "A New Hampshire resident infected with the mosquito-borne eastern equine encephalitis virus has died, state health authorities said.",
      "publishedAt": "2024-08-27T16:05:41Z",
      "title": "New Hampshire resident dies after testing positive for mosquito-borne encephalitis virus",
      "url": "https://apnews.com/20f5fac5b0cff8e07581bf67342d9d20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d73305e09c124e6ebd8a258ff70bc337/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Leonard Riggio, a brash, self-styled underdog who transformed the publishing industry by building Barnes &amp; Noble into the country’s most powerful bookseller before his company was overtaken by the rise of Amazon.com, has died at age 83.",
      "publishedAt": "2024-08-27T17:05:53Z",
      "title": "Leonard Riggio, who forged a bookselling empire at Barnes & Noble, dead at 83",
      "url": "https://apnews.com/b80f1af10d56c0b8d93f8a844ac89912",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b0760f94eb644bfadc8087685d62af4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}