{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A helicopter carrying Iranian President Ebrahim Raisi, the country's foreign minister and other officials apparently crashed in the mountainous northwest reaches of Iran on Sunday, sparking a massive rescue operation in a fog-shrouded forest as the public was urged to pray.",
      "publishedAt": "2024-05-19T12:42:37Z",
      "title": "Helicopter carrying Iran's hard-line president apparently crashes in foggy, mountainous region",
      "url": "https://apnews.com/b483ba75e4339cfb0fe00c7349d023b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/418a24210b66450399a38df950abec4e/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's hard-line President Ebrahim Raisi has long been seen as a protégé to Iran's supreme leader and a potential successor for his position within the country's Shiite theocracy.",
      "publishedAt": "2024-05-19T15:19:13Z",
      "title": "Who is Ebrahim Raisi, Iran's president whose helicopter suffered a 'hard landing' in foggy weather?",
      "url": "https://apnews.com/a02630b6dca3cac455cacd16690b710f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf17eb3c3fea456390407fa300f18770/2499.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel's leaders aired divisions over who should govern Gaza after the war, now in its eighth month.",
      "publishedAt": "2024-05-19T09:18:40Z",
      "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel's leaders are increasingly divided",
      "url": "https://apnews.com/d6ea9776d293130d52d308abd284556e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5753e7f946ea4d4789b40b2a1d995754/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Testimony in the hush money trial of Donald Trump is set to conclude in the coming days, putting the landmark case on track for jury deliberations that will determine whether it ends in a mistrial, an acquittal — or the first-ever felony conviction of a former American president.",
      "publishedAt": "2024-05-19T11:34:40Z",
      "title": "What we've learned so far in the Trump hush money trial and what to watch for as it wraps up",
      "url": "https://apnews.com/2723054e49944eecb6c86008ec4adabd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca52622da86d4dc086d68e31e3834223/2159.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MATT BROWN and BILL BARROW",
      "description": "ATLANTA (AP) — President Joe Biden on Sunday told Morehouse College graduates during his commencement speech that he heard their voices of protest over the Israel-Hamas war, and that scenes from the conflict in Gaza have been heartbreaking.",
      "publishedAt": "2024-05-19T03:25:39Z",
      "title": "Biden tells Morehouse graduates that he hears their voices of protest over the war in Gaza",
      "url": "https://apnews.com/e42d08d7431bf9218afa90177efa3f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8cc2ea93acb42d0ae4373b7a15c14f2/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Sen. Tammy Baldwin, facing a tough reelection fight in one of the races that will determine control of Congress, has made protecting reproductive rights a cornerstone of her campaign, and she's willing to back that up by pledging to change the Senate filibuster rules if Democrats retain control of the chamber.",
      "publishedAt": "2024-05-19T11:43:33Z",
      "title": "The Senate filibuster is a hurdle to any national abortion bill. Democrats are campaigning on it",
      "url": "https://apnews.com/cc02b78b1029233abe9911c14d285c7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1525ddfa5fc242b39d685b11a3796fdc/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Dressed in black and white, the crowd of angry teenagers squeezed into a narrow street in Haiti’s capital.They stopped in front of a cemetery and hoisted a coffin onto their shoulders, tears rolling down some faces.",
      "publishedAt": "2024-05-19T04:01:51Z",
      "title": "As killings surge, Haitians struggle to bury loved ones and find closure in violent capital",
      "url": "https://apnews.com/3f616868b7bef8f7f40f036198e332a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a7488a3e6e3405aa14a8b7022234455/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — At least 11 people were reported killed in attacks in Ukraine’s war-ravaged northeast on Sunday as Russia pushed ahead with its renewed offensive.",
      "publishedAt": "2024-05-19T08:10:18Z",
      "title": "At least 11 killed as Russia presses forward with its offensive in northeastern Ukraine",
      "url": "https://apnews.com/c6d7c9bb699bd48d4634be6259244a0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c3df14f529443fda25225b2a03d7cc2/3000.jpeg"
    },
    {
      "author": "LEFTERIS PITARAKIS",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — Slovakia’s populist prime minister, Robert Fico, remained in serious condition on Sunday but has been given a positive prognosis four days after he was shot multiple times in an assassination attempt that has sent shockwaves across the deeply polarized European Union nation, the defense minister said.",
      "publishedAt": "2024-05-19T11:17:12Z",
      "title": "Slovak prime minister's condition remains serious but prognosis positive after assassination bid",
      "url": "https://apnews.com/db201bb4d798fb929190d58f9145f82d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d55712d342148a2b5b6083fb07609bf/1920.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Sean “Diddy” Combs admitted that he beat his ex-girlfriend Cassie in a hotel hallway in 2016 after CNN released video of the attack, saying in a video apology he was “truly sorry” and his actions were “inexcusable.”",
      "publishedAt": "2024-05-19T15:38:23Z",
      "title": "Diddy admits beating ex-girlfriend Cassie, says he's sorry, calls his actions 'inexcusable'",
      "url": "https://apnews.com/4e6a81d3e9ab40fa229edef2fb8ad357",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3388329f2a554b41bd1177d733573d78/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}