{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Grieving and angry Israelis surged into the streets Sunday night after six more hostages were found dead in Gaza, chanting “Now! Now!” as they demanded that Prime Minister Benjamin Netanyahu reach a cease-fire with Hamas to bring the remaining captives home.",
      "publishedAt": "2024-09-01T03:11:35Z",
      "title": "Israelis erupt in protest to demand a cease-fire after 6 more hostages die in Gaza",
      "url": "https://apnews.com/29496f50a9b1740bd3905035ffd23052",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9f4fe70c15b425296a95d42d3f48664/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinian health authorities and United Nations agencies on Sunday began a large-scale campaign of vaccinations against polio in the Gaza Strip, hoping to prevent an outbreak in the territory that has been ravaged by the Israel-Hamas war.",
      "publishedAt": "2024-09-01T07:24:00Z",
      "title": "Large-scale polio vaccinations begin in war-ravaged Gaza after first case in 25 years",
      "url": "https://apnews.com/5bca65dd2b60bb74011ecf97864961f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a19205e999a40a0b834ff96803ae2c6/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Donald Trump's campaign issued a statement Sunday from the Gold Star military families who invited him to Arlington National Cemetery as they defended the Republican presidential nominee and insisted that Vice President Kamala Harris is the candidate politicizing fallen U.S.",
      "publishedAt": "2024-09-01T16:33:25Z",
      "title": "Trump issues statement from Gold Star families defending Arlington Cemetery visit and ripping Harris",
      "url": "https://apnews.com/0ef2d4d0d0a1bbecdf77adbc4970a8fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8563e8b71149bab76526d9939ea41d/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and DAN MERICA",
      "description": "WASHINGTON (AP) — Italo Medelius was leading a volunteer drive to put Cornel West on North Carolina's presidential ballot last spring when he received an unexpected call from a man named Paul who said he wanted to help.",
      "publishedAt": "2024-09-01T16:39:42Z",
      "title": "GOP network props up liberal third-party candidates in key states, hoping to siphon off Harris votes",
      "url": "https://apnews.com/4089fb0c9ebb16002e56a1c254a21b0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a475f5a43a7409b821c58514bdcdfb6/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Only U.S. citizens are eligible to vote in this fall's election for president and other top offices. While that is nothing new, the potential for noncitizens to register or vote has been receiving a lot of attention lately.",
      "publishedAt": "2024-09-01T11:34:14Z",
      "title": "Illegal voting by noncitizens is rare, yet Republicans are making it a major issue this election",
      "url": "https://apnews.com/09b86e6768f755fd875f3c51b0e8ea70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f41f549d02241d7bc668573674f5311/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — The far-right Alternative for Germany was on track to become the strongest party in a state election for the first time Sunday in the country’s east, and at least a very close second to mainstream conservatives in a second vote, projections showed.",
      "publishedAt": "2024-09-01T06:57:03Z",
      "title": "A German far-right party is set to win its first state election and performs strongly in a second",
      "url": "https://apnews.com/97413b8e75871eb35c5e2d8b05e885f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/828d9d5c15404f10ae1ff8e98f9e17ac/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — If any evidence were needed to underscore that Pope Francis’ upcoming trip to Asia and Oceania is the longest, farthest and most challenging of his pontificate, it’s that he’s bringing along his secretaries to help him navigate the four-country program while keeping up with work back home.",
      "publishedAt": "2024-09-01T03:35:17Z",
      "title": "Pope embarks on longest, farthest and most challenging trip to Asia, with China in the background",
      "url": "https://apnews.com/19930e8f324ffc7f0c59ce30ab995585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b8caeee6a074949946e9f8795a80497/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA and CATERINA MORBIATO",
      "description": "MEXICO CITY (AP) — “That’s it, dude! Done!,” exclaimed Eliezer López as he jumped up and down, throwing his arms to the sky and drawing a sign of the cross across his chest. His joy was so contagious, his friends started to emerge from nearby tents to celebrate with him.",
      "publishedAt": "2024-09-01T04:06:29Z",
      "title": "US border policy spurred migrant camps hundreds of miles away in Mexico's capital",
      "url": "https://apnews.com/22b49fabf6e4d7d25d2873d0637544fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7b4f79a1ca540bea8c62509a107dd17/1920.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "Before she cut the air on the world’s biggest sporting stage with head-spinning, gravity-defying moves, Logan Edra, aka B-Girl Logistx, held herself with a razor-sharp focus.Brows furrowed and hands anchored at her hips, Team USA’s youngest breaker this year seemed more serious than some of her competitors at the Paris Olympics.",
      "publishedAt": "2024-09-01T04:21:05Z",
      "title": "Minority athletes hope their Olympic journeys will sway intolerant hearts and minds",
      "url": "https://apnews.com/71dc9a7d7ab5cd306df9d5b9c6b471d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c588d860f90a41558cfa29c92697583f/2982.jpeg"
    },
    {
      "author": "AMY TAXIN and TERRY CHEA",
      "description": "WEST SACRAMENTO, Calif. (AP) — Climate change is stressing rainforests where the highly sensitive cocoa bean grows, but chocolate lovers need not despair, say companies that are researching other ways to grow cocoa or develop cocoa substitutes.",
      "publishedAt": "2024-09-01T04:10:26Z",
      "title": "Companies are crafting new ways to grow cocoa, and chocolate alternatives, to keep up with demand",
      "url": "https://apnews.com/73904f71a086044fa55b0ea1a32cf84d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/307574c7736841c884c72921616e9133/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}