{
  "articles": [
    {
      "author": "SEUNG MIN KIM, TOM KRISHER and CHRIS MEGERIAN",
      "description": "VAN BUREN TOWNSHIP, Mich. (AP) — President Joe Biden grabbed a bullhorn on the picket line Tuesday and urged striking auto workers to “stick with it” in an unparalleled show of support for organized labor by a modern president.",
      "publishedAt": "2023-09-26T04:02:36Z",
      "title": "Biden urges striking auto workers to \"stick with it\" in picket line visit unparalleled in history",
      "url": "https://apnews.com/8ecc84eeca15c99673f31bdac6921f7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c1e63086dc642e89dfb473f93b4a03d/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Congress is rushing headlong into crisis mode Tuesday with a government shutdown days away, as Speaker Kevin McCarthy faces an insurgency from hard-right Republicans eager to slash spending even if it means halting pay for the military and curtailing federal services for millions of Americans.",
      "publishedAt": "2023-09-26T04:03:27Z",
      "title": "Congress is moving into crisis mode as time runs short to avoid a government shutdown",
      "url": "https://apnews.com/e4c37673b6507deaed2902f2166ef759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/201fe92e7704435699b6120e85ef433b/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "U.S. regulators and 17 states are suing Amazon over allegations the e-commerce behemoth abuses its position in the marketplace to inflate prices on and off its platform, overcharge sellers and stifle competition.",
      "publishedAt": "2023-09-26T16:04:06Z",
      "title": "Amazon sued by FTC and 17 states over allegations it inflates online prices and overcharges sellers",
      "url": "https://apnews.com/1b91bf8026cc3edf81e817cf8596c4bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c2655d1b2f24abd84d4482fb1556899/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and JAKE OFFENHARTZ",
      "description": "WASHINGTON (AP) — Democratic Sen. Cory Booker is calling on Sen. Bob Menendez to resign, saying in a statement that the sweeping federal bribery charges unveiled on Friday against his fellow New Jersey Democrat contain ”shocking allegations of corruption and specific, disturbing details of wrongdoing.”",
      "publishedAt": "2023-09-26T15:54:09Z",
      "title": "Sen. Booker says fellow New Jersey Democrat Menendez should resign over 'shocking' bribe allegations",
      "url": "https://apnews.com/9d17cbf4520627be01d4969f05cce3a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab318c264d32439f83f0db5d52aa1082/1920.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — California will double the taxes on guns and ammunition and use the money to pay for more security at public schools and various violence prevention programs under a new law Gov.",
      "publishedAt": "2023-09-26T17:59:17Z",
      "title": "California governor signs law raising taxes on guns and ammunition to pay for school safety",
      "url": "https://apnews.com/0870a673a3d4e85c78466897cfd7ff6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7602c1a1b5f646939fa94b0335ee41c3/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden sued Rudy Giuliani and another attorney Tuesday, saying the two wrongly accessed and shared his personal data after obtaining it from the owner of a Delaware computer repair shop.",
      "publishedAt": "2023-09-26T13:58:34Z",
      "title": "Hunter Biden sues Rudy Giuliani and another lawyer over accessing and sharing of his personal data",
      "url": "https://apnews.com/94fbf97f52aea73b8421e3be017767f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63e4af59d3be470aba30c45f4f497c74/2160.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and JENNIFER PELTZ",
      "description": "UNITED NATIONS (AP) — Indian and Canadian diplomats didn't directly address their countries' row over the killing of a Sikh separatist leader, but they obliquely underscored some key talking points as they addressed world leaders at the U.N.",
      "publishedAt": "2023-09-26T14:15:44Z",
      "title": "India and Canada steer clear, at UN, of their dispute over Sikh separatist leader's killing",
      "url": "https://apnews.com/769062a89ad89647eeffbd5378428846",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dfffe72729a47c594d62f1ec10ea6e3/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — JPMorgan Chase agreed Tuesday to pay $75 million to the U.S. Virgin Islands to settle claims that the bank enabled the sex trafficking acts committed by financier Jeffrey Epstein.JPMorgan said that $55 million of the settlement will go toward local charities that provide assistance to victims of domestic abuse and trafficking and other crimes, as well as to enhance the capabilities of local law enforcement.",
      "publishedAt": "2023-09-26T14:22:43Z",
      "title": "JPMorgan to pay $75 million on claims that it enabled Jeffrey Epstein's sex trafficking operations",
      "url": "https://apnews.com/b33f0094586fd4fa229bd6295a7d09e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77cc0c4b76224e4d88a74954404652ad/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — The speaker of Canada’s House of Commons resigned Tuesday for inviting a man who fought for a Nazi military unit during World War II to Parliament to attend a speech by the Ukrainian president.",
      "publishedAt": "2023-09-26T14:54:11Z",
      "title": "Canada's House speaker resigns over inviting a man who fought for a Nazi unit to Parliament",
      "url": "https://apnews.com/d4ca05841193409e455cee3b19fcee6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cba7e5db3ce149a6bbcd0c0e6a7e5a00/3000.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "It’s highly unlikely any player other than Lionel Messi could have brought Prince Harry, Selena Gomez and Leonardo DiCaprio out to a regular-season Major League Soccer match. But there they were — very noticeable in fact — in the crowd when Messi’s Inter Miami squad took on LAFC in Southern California early this month.",
      "publishedAt": "2023-09-26T18:18:55Z",
      "title": "Messi Mania has grabbed hold in Major League Soccer, but will it be a long-lasting boost?",
      "url": "https://apnews.com/f8a054882a38cef1fa69b85774ff89a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baaf319058c44d77b0c2f8e21261f44f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}