{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — When Israel declared war against Hamas last October, it stood unified at home and enjoyed broad backing from around the world following an unprecedented attack by the Islamic militant group.",
      "publishedAt": "2024-04-05T04:20:58Z",
      "title": "After six months of war, Israel's isolation grows with no end in sight",
      "url": "https://apnews.com/327bfeb7bfce5cb0de1568bf41a0ff06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3f898af56d543e487eb3786aeac5423/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden issued a stark warning to Israeli Prime Minister Benjamin Netanyahu on Thursday that future U.S. support for Israel's Gaza war depends on the swift implementation of new steps to protect civilians and aid workers.",
      "publishedAt": "2024-04-04T17:51:11Z",
      "title": "Biden tells Israel's Netanyahu future US support for war depends on new steps to protect civilians",
      "url": "https://apnews.com/3591fb5f82b22cf8e5d1060fccaef115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01bd92f800e5457d8004962b017123de/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Like many Americans, Richard Bidon says he'd like to see the U.S. government “go back to its original design” — a system of checks and balances developed nearly 240 years ago to prevent any branch, especially the presidency, from becoming too powerful.",
      "publishedAt": "2024-04-05T04:04:33Z",
      "title": "Americans think a president's power should be checked, AP-NORC poll finds — unless their side wins",
      "url": "https://apnews.com/e7e0f499b7d8bb93420f76ec4c72aae0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a798f10bca4f7fa0549cae6b2dcc82/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Former Defense Secretary Mark Esper has called him a “threat to democracy.” Former national security adviser John Bolton has declared him “unfit to be president.” And former Vice President Mike Pence has declined to endorse him, citing “profound differences.”",
      "publishedAt": "2024-04-05T04:06:24Z",
      "title": "Former Trump officials are among the most vocal opponents of returning him to the White House",
      "url": "https://apnews.com/e202861911ab37cadfcf058b5b163fb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aca67e9b65140a3a5b3a57dae22bdf5/3000.jpeg"
    },
    {
      "author": null,
      "description": "HUALIEN, Taiwan (AP) — Rescue teams are searching for a family of five feared trapped in a rockslide following Taiwan’s biggest earthquake in 25 years that has left at least 10 dead.",
      "publishedAt": "2024-04-05T04:38:28Z",
      "title": "Rescue teams searching for family feared trapped in rockslide following Taiwan earthquake",
      "url": "https://apnews.com/bd01953781a73c29d09902f784543293",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da633d56d66d4b858cd4f7a658853232/3000.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA and IGNATIUS SSUUNA",
      "description": "HUYE, Rwanda (AP) — The diggers’ hoes scrape the brown soil, looking for — and often finding — human bone fragments. The women then wipe the bone pieces with their hands as others watch in solemn silence.",
      "publishedAt": "2024-04-05T04:48:33Z",
      "title": "New mass graves in Rwanda reveal cracks in reconciliation efforts, 30 years after the genocide",
      "url": "https://apnews.com/61fb69da1c44be82a9f85d193e91104f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b3c89d53fb8453e9c8d2f5c18d4603c/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Soaring prices for green onions and apples. Striking doctors. A politician's allegedly sexist jab at a female candidate.",
      "publishedAt": "2024-04-05T04:14:05Z",
      "title": "South Korea election issues: Green onions, striking doctors, an alleged sexist jab at a candidate",
      "url": "https://apnews.com/8ac15e82dacaff19f3c54197fe6d9b9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0126e5ac9304c0690db4e6c010ea053/3000.jpeg"
    },
    {
      "author": null,
      "description": "GUANGZHOU, China (AP) — U.S. Treasury Secretary Janet Yellen called Friday for a level playing field for American companies and workers as she opened a five-day visit to China in a major industrial and export hub.",
      "publishedAt": "2024-04-05T02:28:52Z",
      "title": "US Treasury Secretary Yellen, in China, calls for level-playing field for US workers and firms",
      "url": "https://apnews.com/7f861ff193fdc35b355c650fb84d204c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f996c3bacd914830bbe22db0d91d530e/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The American economy is thought to have added 200,000 jobs in March — a more-than-respectable increase though one that would mark a slowdown from February's vigorous gain of 275,000 and last year's monthly average increase of 251,000.",
      "publishedAt": "2024-04-05T04:01:28Z",
      "title": "US jobs report for March is likely to point to slower but still-solid hiring",
      "url": "https://apnews.com/1e456b8df0e11b218ed50f1ead6f6797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f6a8845185046d99a39a3e3bd914c4f/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "CLEVELAND (AP) — Their memories are blurry. Of AAU tournaments and Team USA practices. Of gold medals and deep 3s. Of the girl with the brown ponytail with the unlimited range who always seemed to know what was coming next and the blonde who never got rattled with the ball in her hands, by opponents or the sea of eyes constantly transfixed on her.",
      "publishedAt": "2024-04-04T22:32:08Z",
      "title": "Caitlin Clark and Paige Bueckers have been in each other's orbit for years. The Final Four beckons",
      "url": "https://apnews.com/c9ee9671b55416dd3a6d4a1cffa87848",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb41934fcf5d4dac917882d85f321c76/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}