{
  "articles": [
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations appealed for $2.8 billion on Tuesday to provide desperately needed aid to 3 million Palestinians, stressing that tackling looming famine in war-torn Gaza requires not only food but sanitation, water and health facilities.",
      "publishedAt": "2024-04-17T04:03:55Z",
      "title": "UN appeals for $2.8 billion to help 3 million Palestinians in desperate need of food and other aid",
      "url": "https://apnews.com/7765cef456f284f1fc4901155e1fd5f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9298251d03f74681ae1b21b8d61b0c62/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israel is vowing to retaliate against Iran, risking further expanding the shadow war between the two foes into a direct conflict after an Iranian attack over the weekend sent hundreds of drones and missiles toward Israel.",
      "publishedAt": "2024-04-16T20:13:29Z",
      "title": "Israel says it will retaliate against Iran. These are the risks that could pose to Israel",
      "url": "https://apnews.com/d9145465e2e2d54d3c975e51af95275b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1916792ab5646b9ac03271dbe161021/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The first seven jurors for Donald Trump's hush money trial were seated Tuesday after lawyers grilled the jury pool about their social media posts, political views and personal lives to decide who can sit in fair judgment of the former president.",
      "publishedAt": "2024-04-16T04:06:06Z",
      "title": "First 7 jurors are chosen for Trump's hush money criminal trial; 11 more still needed",
      "url": "https://apnews.com/dd1a8dcc063b7ad0fbe14af6e8724c2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f95d5ed37f449039009e4baefb23755/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "Asian Americans, Native Hawaiians and Pacific Islanders in the United States are more likely than the overall adult population to believe in human-caused climate change, according to a new poll. It also suggests that partisanship may not have as much of an impact on this group's environmental views, compared to Americans overall.",
      "publishedAt": "2024-04-17T04:03:14Z",
      "title": "Asian Americans, Pacific Islanders in the US more likely to believe in climate change: AP-NORC poll",
      "url": "https://apnews.com/226f4001c8fafc1e0ebff2fdd15e4d2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3758398139e4622a1976b4dacd83307/3000.jpeg"
    },
    {
      "author": "GRANT PECK",
      "description": "BANGKOK (AP) — Myanmar’s jailed former leader Aung San Suu Kyi has been moved from prison to house arrest as a health measure due to a heat wave, the military government said. On Wednesday it also granted amnesty for over 3,000 prisoners to mark this week’s traditional New Year holiday.",
      "publishedAt": "2024-04-17T03:35:20Z",
      "title": "Aung San Suu Kyi has been moved from prison to house arrest due to heat wave, Myanmar military says",
      "url": "https://apnews.com/a76feadba52f619a921cf4b43e7dcf54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dc6e4cbb6084d2fbec94d9d8c002bf0/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Defiant and determined, House Speaker Mike Johnson pushed back Tuesday against mounting Republican anger over his proposed U.S. aid package for Ukraine, Israel and other allies, and rejected a call to step aside or risk a vote to oust him from office.",
      "publishedAt": "2024-04-16T16:04:50Z",
      "title": "Facing a Republican revolt, House Speaker Johnson's plan for US aid to Ukraine, allies uncertain",
      "url": "https://apnews.com/3f6f6af81c860eb8ce4104e61728a0fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c255392ab30646ba8eb4fc557cee38b3/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "Four months after a contentious congressional hearing led to the resignations of two Ivy League presidents, Columbia University's president is set to appear before the same committee over questions of antisemitism and the school's response to conflicts on campus over the Israel-Hamas war.",
      "publishedAt": "2024-04-17T04:09:53Z",
      "title": "Columbia University president to testify in Congress on college conflicts over Israel-Hamas war",
      "url": "https://apnews.com/3255357b4443c1fb4bae8b8ea5774ee5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2ecde10fa054019b564298da953f10c/3000.jpeg"
    },
    {
      "author": null,
      "description": "TALLAHASSEE, Fla. (AP) — Former U.S. Sen. and two-term Florida Gov. Bob Graham, who gained national prominence as chairman of the Senate Intelligence Committee in the aftermath of the 2001 terrorist attacks and as an early critic of the Iraq war, has died.",
      "publishedAt": "2024-04-17T02:18:14Z",
      "title": "Bob Graham, ex-US senator and Florida governor, dies at 87",
      "url": "https://apnews.com/80c4f1609e314eff981fcfae7d0b32ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cc061fda35942e682b72729f3aa5365/2000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "MEXICO CITY (AP) — Venezuelan President Nicolás Maduro ordered the closure of his country’s embassy and consulates in Ecuador on Tuesday in solidarity with Mexico in its protest over a raid by Ecuadorian authorities on the Mexican Embassy in Quito.",
      "publishedAt": "2024-04-16T17:10:37Z",
      "title": "Venezuela closes its embassy in Ecuador to protest the police raid on the Mexican Embassy there",
      "url": "https://apnews.com/3874d5469a5ef3665e2130b12c4c8776",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db3e06b9ecf74731b50ec7b4bcb30308/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Heavy thunderstorms lashed the United Arab Emirates on Tuesday, dumping the heaviest rain ever recorded in the country in the span of hours as it flooded out portions of major highways and Dubai's international airport.",
      "publishedAt": "2024-04-16T08:25:13Z",
      "title": "Storm dumps heaviest rain ever recorded in desert nation of UAE, flooding roads and Dubai's airport",
      "url": "https://apnews.com/7bf3881efbea998dfa4c1ed8d538217c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88f721445569461c9f10a5195cfa4bc8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}