{
  "articles": [
    {
      "author": "SAM MEDNICK and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israel’s prime minister faced growing pressure Saturday after U.S. President Joe Biden announced a proposed agreement to end the fighting in Gaza, with many Israelis urging Benjamin Netanyahu to embrace the deal but far-right allies threatening to collapse his government if he does.",
      "publishedAt": "2024-06-01T10:04:25Z",
      "title": "Israeli leader Netanyahu faces growing pressure at home after Biden's Gaza proposal",
      "url": "https://apnews.com/8c06dda3a8e20491b5a34377c60bb827",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1328c1fb3e64620b7b7cb2fafb68284/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Throughout its grinding seven-month war against Hamas, Israel has pledged to investigate a series of deadly events in which its military forces are suspected of wrongdoing. The commitment comes in the face of mounting claims — from human rights groups and the International Criminal Court 's chief prosecutor — that the country's leaders are committing war crimes in Hamas-ruled Gaza.",
      "publishedAt": "2024-06-02T05:50:33Z",
      "title": "The Israeli army says it investigates itself. Where do those investigations stand?",
      "url": "https://apnews.com/b0b6107d449ca4e6d6a1b59749f15814",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9757cde9fc714c96b5b54600136d2e67/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "After his historic guilty verdict in his hush money case, Donald Trump attacked the U.S.",
      "publishedAt": "2024-06-02T05:17:04Z",
      "title": "Trump's attacks on US justice system after guilty verdict could be useful to autocrats like Putin",
      "url": "https://apnews.com/2828902db670e00af3b1ac871938b96e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75b5703413964819baa15164c09ae3e9/3000.jpeg"
    },
    {
      "author": "AARON MORRISON and MATT BROWN",
      "description": "NEW YORK (AP) — As Donald Trump lambasted the guilty verdict of his hush money trial this week, he stood inside a Manhattan courthouse that was the site of one of the most notorious examples of injustice in recent New York history.",
      "publishedAt": "2024-06-01T12:32:48Z",
      "title": "Black leaders call out Trump's criminal justice contradictions as he rails against guilty verdict",
      "url": "https://apnews.com/b59498a04d148a65ef33df36a61aa668",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15be402171884fa7b7ac109cffe3b5a9/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "SINGAPORE (AP) — Ukrainian President Volodymyr Zelenskyy urged a group of top defense officials at Asia’s premier security conference on Sunday to attend an upcoming peace summit, saying Ukraine was ready to hear “various proposals and thoughts” on ending the war with Russia.",
      "publishedAt": "2024-06-02T04:55:07Z",
      "title": "Zelenskyy urges top defense officials to attend upcoming summit on ending Russia's war on Ukraine",
      "url": "https://apnews.com/94ebb72539182a0215c85895725cdd48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3a607e9230245afa33790c442eb8b11/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "ALEXANDRIA, Va. (AP) — On one side of the classroom, students circled teacher Maria Fletcher and practiced vowel sounds. In another corner, children read together from a book. Scattered elsewhere, students sat at laptop computers and got reading help from online tutors.",
      "publishedAt": "2024-06-02T04:48:57Z",
      "title": "Most US students are recovering from pandemic-era setbacks, but millions are making up little ground",
      "url": "https://apnews.com/c828144e18a02a1e45841c4dd07f05cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fed6976002044f73aff8f7c71adfc504/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER and PETER PRENGAMAN",
      "description": "PARIS (AP) — Of all the decisions Paris Olympics organizers made about where to hold each sport, sending surfing competitions to the other side of the world — in the Pacific waters of Tahiti — provoked the strongest reactions.",
      "publishedAt": "2024-06-02T03:04:32Z",
      "title": "Paris is aiming for the most sustainable Olympics yet. Organizers acknowledge the plan isn't perfect",
      "url": "https://apnews.com/85a237ea50cc2f1e5c60b907e06b7299",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ad9f808088d453598e0037f8985361f/3000.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA",
      "description": "KAMPALA, Uganda (AP) — Early last year, Caroline Ikendi was in distress after undergoing an emergency Caesarean section to remove a stillborn baby and save two others. Doctors said one of the preterm babies had a 2% chance of living.",
      "publishedAt": "2024-06-02T05:04:35Z",
      "title": "A growing community of breast milk donors in Uganda gives mothers hope",
      "url": "https://apnews.com/94f8c81bbd664b9681db55465cd4185d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7893f4146d8140de81b4681f887af0fa/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Voters choosing Mexico’s next president are deciding Sunday between a former academic who promises to further the current leader's populist policies and an ex-senator and tech entrepreneur who pledges to up the fight against deadly drug cartels.",
      "publishedAt": "2024-06-02T04:05:32Z",
      "title": "More populist policies or tougher fight with cartels? Mexicans weigh choice as they pick new leader",
      "url": "https://apnews.com/d7fef5c7ac964072401ba6d9809dd7d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bea5673d59e4000af4ed0caf7ec60af/1465.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — California firefighters aided by aircraft battled a wind-driven wildfire burning Saturday in an area straddling the San Francisco Bay Area and central California, authorities said.",
      "publishedAt": "2024-06-02T03:08:46Z",
      "title": "California firefighters battle wind-driven wildfire east of San Francisco",
      "url": "https://apnews.com/c125ea03f228b8df65d4e66729477189",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2002028e56c0443da0e8a8b9f5b6855f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}