{
  "articles": [
    {
      "author": "ISABELLA O'MALLEY and MICHAEL PHILLIS",
      "description": "FRANKFORT, Ky. (AP) — On a recent day under the July sun, three men heaved solar panels onto the roof of a roomy, two-story house near the banks of the Kentucky River, a few miles upstream from the state capitol where lawmakers have promoted coal for more than a century.",
      "publishedAt": "2023-07-23T12:11:30Z",
      "title": "One year old, US climate law is already turbocharging clean energy technology",
      "url": "https://apnews.com/d5b0a7f15659930c6c15f0d180b193e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2edaa1f0a8ea472f900e09f6d62da94e/3000.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "In many election cycles, there's a snappy shorthand used to describe the type of voters who may help decide the winner. Think soccer moms or security moms. Even NASCAR dads. And now, the “mama bears.”",
      "publishedAt": "2023-07-23T11:29:56Z",
      "title": "'Mama bears' may be the 2024 race's soccer moms. But where the GOP seeks votes, some see extremism",
      "url": "https://apnews.com/a96ae3d1ed167f823360e7645ca4b519",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e3201a0c40d49d2b1b6bec23dee7b52/3000.jpeg"
    },
    {
      "author": "CIARÁN GILES and JOSEPH WILSON",
      "description": "MADRID (AP) — Spain appears headed for political gridlock after Sunday's inconclusive national elections left parties on both the right and left without a clear path toward forging a new government.",
      "publishedAt": "2023-07-23T05:03:56Z",
      "title": "Spain at risk of political gridlock after conservative win falls short of toppling PM Sánchez",
      "url": "https://apnews.com/83cad969eac6cf25ced972357a248e99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/438140586ed84adbb012594b23f16e78/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu was recovering in a hospital on Sunday after an emergency heart procedure, as tens of thousands of supporters and opponents of his government's judicial overhaul plan held rival rallies ahead of a key vote.",
      "publishedAt": "2023-07-23T06:36:35Z",
      "title": "Israel's Netanyahu hospitalized as thousands protest judicial overhaul plan ahead of key vote",
      "url": "https://apnews.com/364da40bb2f8a8125a27a7c7e5630e36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df2b1de3d8aa463f86754c07106d9e26/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ELISE MORTON",
      "description": "ODESA, Ukraine (AP) — Russia struck the Ukrainian Black Sea city of Odesa on Sunday, keeping up a barrage of attacks that has damaged critical port infrastructure in southern Ukraine in the past week.",
      "publishedAt": "2023-07-23T07:20:24Z",
      "title": "Russian strike on Ukraine's Odesa badly damages landmark Orthodox cathedral; 1 dead, many wounded",
      "url": "https://apnews.com/adc78b45e74e0236125b1ec706e5d7da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0025bd859af441ac9fc70dcaf06952d1/1920.jpeg"
    },
    {
      "author": "DEMETRIS NELLAS",
      "description": "ATHENS, Greece (AP) — Firefighters struggled through the night to contain 82 wildfires across Greece, 64 of which started Sunday, the hottest day of the summer so far.Their efforts were without the help of firefighting planes and helicopters, which do not operate at night.",
      "publishedAt": "2023-07-23T09:14:24Z",
      "title": "Fire still blazing on the Greek island of Rhodes as dozens more erupt across the country",
      "url": "https://apnews.com/df9155c19c7af5b81d9e6b2afa7fafd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f0b1240e7424497bf0f3d50126f836f/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Wisconsin's Supreme Court will flip from majority conservative to liberal control in August and Democrats have high hopes the change will lead to the state's abortion ban being overturned and its maps redrawn to weaken GOP control of the Legislature and congressional districts.",
      "publishedAt": "2023-07-23T04:33:55Z",
      "title": "Democrats eye Wisconsin high court's new liberal majority to win abortion and redistricting rulings",
      "url": "https://apnews.com/89907b3aaf0814a434de477e2a45d9bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a258399de2ee4bf4924977498c69e510/3000.jpeg"
    },
    {
      "author": "YOUCEF BOUNAB",
      "description": "PARIS (AP) — Neighborhoods in northeast Paris have struggled for years with the scourge of crack cocaine and its use in public. The Summer Olympics, kicking off a year from Wednesday, are offering an impetus to tackle the problem.",
      "publishedAt": "2023-07-23T13:35:41Z",
      "title": "Next year's Olympics are pushing Paris to confront crack cocaine use on city streets",
      "url": "https://apnews.com/00e3e8f279c489415abff04742567193",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fa4b6d1226c44b8bc0bc963501cb72b/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "HOYLAKE, England (AP) — Brian Harman stood in the tunnel and looked out to the 18th green at Royal Liverpool with his eyes on that shiny claret jug, waiting for his name to be called with the century-old introduction as “champion golfer of the year.\" He always imagined this was possible.",
      "publishedAt": "2023-07-23T17:35:47Z",
      "title": "Brian Harman is unstoppable in a drama-free British Open win at Hoylake",
      "url": "https://apnews.com/ef773f589855f285355c6634d502f422",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72e897ed063443ad82abfb208dca690f/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "“ Barbenheimer ” didn’t just work – it spun box office gold. The social media-fueled fusion of Greta Gerwig’s “ Barbie ” and Christopher Nolan’s “ Oppenheimer ” brought moviegoers back to the theaters in record numbers this weekend, vastly outperforming projections and giving a glimmer of hope to the lagging exhibition business, amid the sobering backdrop of strikes.",
      "publishedAt": "2023-07-23T15:20:04Z",
      "title": "'Barbie' takes the box office crown and 'Oppenheimer' soars in a historic weekend",
      "url": "https://apnews.com/3ff25c0a3acf7b568866c2ff307d0108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a52c04aa86934b32aae1464b319433ff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}