{
  "articles": [
    {
      "author": "WAFAA SHURAFA and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Desperate Palestinians scrambled for escape from northern Gaza on Saturday or huddled by the thousands at a hospital in the target zone in hopes it would be spared, as Israel intensified warnings of an imminent offensive by air, ground and sea following Hamas militants’ deadly rampage in Israel a week ago.",
      "publishedAt": "2023-10-14T04:26:01Z",
      "title": "Gaza's desperate civilians flee or huddle in hopes of safety, as warnings of Israeli offensive mount",
      "url": "https://apnews.com/785e0eb833715354cade4694e8ccbf67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aefca239bd4047ef87dcb9bc9f3697d0/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — As Israel pounds the Gaza Strip with airstrikes, Laila Abu Samhadaneh, 65, is anxious about water. The besieged Gaza Strip's 2.3 million people don't have access to clean, running water after Israel cut off water and electricity to the enclave as it intensifies its air attacks in response to a bloody Hamas attack last week.",
      "publishedAt": "2023-10-14T21:02:04Z",
      "title": "Lack of water worsens misery in besieged Gaza as Israeli airstrikes continue",
      "url": "https://apnews.com/4cc305b209437eec7235e975cf4c47d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7918d7b90bd145e4bf8f5be85b9a141f/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Women, children and older adults hiding in safe rooms gunned down mercilessly. Homes set ablaze with terrified residents still inside them. Children, some bound, forced into a room and slaughtered.",
      "publishedAt": "2023-10-15T04:06:25Z",
      "title": "In Hamas' horrific killings, Israeli trauma over the Holocaust resurfaces",
      "url": "https://apnews.com/7a05336b15666e6306845cffa617b699",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5560d65caf4a44c5b09855531900b796/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LOLITA C. BALDOR",
      "description": "RIYADH, Saudi Arabia (AP) — President Joe Biden on Saturday spoke with Palestinian President Mahmoud Abbas and Israeli Prime Minister Benjamin Netanyahu, urging the leaders to allow humanitarian aid to the region and affirmed his support for efforts to protect civilians.",
      "publishedAt": "2023-10-14T11:41:21Z",
      "title": "In first call with Palestinian president Abbas, Biden discusses support for humanitarian aid to Gaza",
      "url": "https://apnews.com/487f746b102a82f4c345a058584e2518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4d9587d33414c1ea142a647cd5a112c/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Attorney General Jeff Landry, a Republican backed by former President Donald Trump, has won the Louisiana governor’s race, holding off a crowded field of candidates.The win is a major victory for the GOP as they reclaim the governor’s mansion for the first time in eight years.",
      "publishedAt": "2023-10-14T04:16:12Z",
      "title": "Republican Jeff Landry wins the Louisiana governor's race, reclaims office for GOP",
      "url": "https://apnews.com/ed79c5a80af6e59593985c9be4ce5dc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/187cb60d121b41b583e7827fb9c8b06f/2000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — A proposed gag order aimed at reining in Donald Trump's incendiary rhetoric puts the judge overseeing his federal election interference case in a tricky position: She must balance the need to protect the integrity of the legal proceedings against the First Amendment rights of a presidential candidate to defend himself in public.",
      "publishedAt": "2023-10-14T12:25:19Z",
      "title": "A proposed gag order on Trump in his federal election case is putting the judge in a tricky position",
      "url": "https://apnews.com/02d078e492a828ed030e583775462dba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c7109e3363c46e9b4ba774c12f08175/3000.jpeg"
    },
    {
      "author": "BY JEAN-YVES KAMALE",
      "description": "KINSHASA, Congo (AP) — A boat capsized in Congo’s northwest killing at least 27 people, and more than 70 others were missing, a senior government official said Saturday as rescuers searched frantically for survivors.",
      "publishedAt": "2023-10-14T20:30:05Z",
      "title": "At least 27 dead with dozens more missing after boat capsizes in northwest Congo",
      "url": "https://apnews.com/39157ce30094187169b06ab84493ad01",
      "urlToImage": ""
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Frightened by unprecedented violence on the streets and within prisons, Ecuadorians have a universal demand for the president they will choose Sunday — safety.The runoff election in the South American country pits an heir to a banana empire, Daniel Noboa, and an attorney, Luisa González.",
      "publishedAt": "2023-10-15T04:06:33Z",
      "title": "Ecuadorians electing new president, choosing between an heir to a banana empire and an attorney",
      "url": "https://apnews.com/65a9d0e3b3e525fac39e02a7d2e0b89c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afc0755a43bc4f4d807f50c750a01f4c/3000.jpeg"
    },
    {
      "author": "ANGELA CHARLTON and JEFFREY SCHAEFFER",
      "description": "PARIS (AP) — The Louvre Museum in Paris and Versailles Palace evacuated visitors and staff Saturday after receiving bomb threats, police said. The French government started deploying 7,000 troops to increase security around the country after a fatal school stabbing by a suspected Islamic extremist.",
      "publishedAt": "2023-10-14T15:26:34Z",
      "title": "Louvre Museum and Versailles Palace evacuated after bomb threats with France on alert",
      "url": "https://apnews.com/859227d963367d7601575e4a8e1d2d4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e392151b4de4c8c86eaff220dbb4bd5/3000.jpeg"
    },
    {
      "author": "AIDA SULTANOVA",
      "description": "BAKU, Azerbaijan (AP) — As a young man starting out as a dentist, Nazim Valiyev was forced to flee his home as ethnic violence roiled a separatist region inside Azerbaijan. More than three decades later, with his medical career over after a stroke, the 60-year-old hopes he can return there, now that it is back under Azerbaijani control.",
      "publishedAt": "2023-10-15T04:08:30Z",
      "title": "Azerbaijanis who fled a separatist region decades ago ache to return, but it could be a long wait",
      "url": "https://apnews.com/f86ea6a53d24f73351e9ca3f0c9e5b12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25b3cbb3e5ec4914b1f55ce3d0e3a4d9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}