{
  "articles": [
    {
      "author": "JONATHAN J. COOPER, WILL WEISSERT and ZEKE MILLER",
      "description": "CHICAGO (AP) — Vice President Kamala Harris closes out the Democratic National Convention Thursday night when she accepts her party's historic presidential nomination and seizes one of her few remaining opportunities to appeal to an audience of millions.",
      "publishedAt": "2024-08-22T10:31:04Z",
      "title": "Democrats conclude their convention Thursday with their new standard bearer, Kamala Harris",
      "url": "https://apnews.com/807cf9d4a609a18ceaa9eee9c9422af5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa597401f4c546c688af82658f48a4c2/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy made his first visit Thursday to the border area where his forces launched their surprise offensive into Russia, saying that Kyiv's military had taken control of another Russian village and captured more prisoners of war.",
      "publishedAt": "2024-08-22T07:56:54Z",
      "title": "Zelenskyy makes 1st visit to border area where Ukrainian forces launched offensive into Russia",
      "url": "https://apnews.com/92ba09ebaef0e8fd1777df56b3d8a706",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f48fdb0f41ef4c02a42270cbbf95d6e0/2312.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Some new Ukrainian soldiers refuse to fire at the enemy. Others, according to commanders and fellow fighters, struggle to assemble weapons or to coordinate basic combat movements.",
      "publishedAt": "2024-08-22T04:10:49Z",
      "title": "Poorly trained recruits contribute to loss of Ukrainian territory on eastern front, commanders say",
      "url": "https://apnews.com/ed2d06ad529e3b7e47ecd32f79911b83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e760302532644e5f8d514e907892b01f/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D. and JIM VERTUNO",
      "description": "A suspect arrested in Guatemala has been charged with helping coordinate the 2022 smuggling attempt that ended in the deaths of 53 migrants in Texas, the Justice Department announced Thursday, marking what U.S.",
      "publishedAt": "2024-08-22T04:04:07Z",
      "title": "US government indicts Guatemalan suspect on smuggling charges over deaths of 53 migrants in trailer",
      "url": "https://apnews.com/d1a8047a6c76e6b810e471e769d48fa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/919a6f7986c64b43a8954adb790b066f/1920.jpeg"
    },
    {
      "author": "ROB GILLIES and JOSH FUNK",
      "description": "TORONTO (AP) — Business and consumers across Canada and the U.S. could suffer significant economic harm with Canada's major freight railroads at a full stop Thursday over a contract dispute with their workers.",
      "publishedAt": "2024-08-22T14:23:12Z",
      "title": "Canada's 2 major freight railroads at a full stop; government officials scramble",
      "url": "https://apnews.com/5b9290b47ad6cdb439735c10560602d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ba83071e633414eae9b0ef9b6badf1b/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Key mediator Egypt expressed skepticism Wednesday about the proposal meant to bridge gaps in cease-fire talks between Israel and Hamas as more details emerged a day before negotiations were expected to resume in Cairo.",
      "publishedAt": "2024-08-21T14:36:39Z",
      "title": "Key mediator Egypt expresses skepticism about the Gaza cease-fire proposal as more details emerge",
      "url": "https://apnews.com/4153fa5fe0daf904f570f4e73f31d2c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/136fe8a5e91d41999694aa96465d8a1f/1920.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "ORLANDO, Fla. (AP) — Midwife Jennie Joseph touched Husna Mixon’s pregnant belly, turned to the 7-year-old boy in the room with them and asked: “Want to help me check the baby?”With his small hand on hers, Joseph used a fetal monitor to find a heartbeat.",
      "publishedAt": "2024-08-22T15:10:37Z",
      "title": "Europe offers clues for solving America's maternal mortality crisis",
      "url": "https://apnews.com/211218f769e9a5a6e856a485fb31aef3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f3cccac99cb435086f2a022225050a6/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "ASHEBORO, N.C. (AP) — At his first outdoor rally since last month’s attempted assassination, Donald Trump spoke from behind bulletproof glass Wednesday in North Carolina at an event focused on national security.",
      "publishedAt": "2024-08-21T16:31:56Z",
      "title": "Trump speaks from behind bulletproof glass at first outdoor rally since his attempted assassination",
      "url": "https://apnews.com/60de08931c1a964e8e1fb21d3778d35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/760e66dbea8747db9c8e0cb17b8b4dbd/3000.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "MADISON, Fla. (AP) — Tens of thousands of students have left Florida’s public schools in recent years amid an explosive expansion in school choice.",
      "publishedAt": "2024-08-22T04:01:41Z",
      "title": "School choice and a history of segregation collide as one Florida county shutters its rural schools",
      "url": "https://apnews.com/84b07720f3df70e544afcf06098037b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab18d156e4b944e6bcb682ac4ad51b18/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Backstage at a celebration of Indigenous peoples in Mexico City's sprawling central square, Carlos CGH traced his fingers across a black and red “gabán,” which is similar to a poncho.",
      "publishedAt": "2024-08-22T05:44:28Z",
      "title": "In Mexico, an Indigenous Triqui artist embraces his roots through contemporary rap",
      "url": "https://apnews.com/171e79cafef8eab83034d69bc4f868ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/515f52427a1540b8879348d13d27d1ba/2489.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}