{
  "articles": [
    {
      "author": "WAYNE PARRY",
      "description": "NORTH WILDWOOD, N.J. (AP) — A long-running sandstorm at the Jersey Shore could soon come to an end as New Jersey will carry out an emergency beach replenishment project at one of the state's most badly eroded beaches.",
      "publishedAt": "2024-04-26T17:17:15Z",
      "title": "Help is coming for a Jersey Shore town that's losing the man-vs-nature battle on its eroded beaches",
      "url": "https://apnews.com/3200bd4f75927728ef655b2a2d84fd17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/901ca635890940418572aa596089e444/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's defense team attacked the credibility Friday of the prosecution's first witness in his hush money case, seeking to discredit testimony detailing a scheme between Trump and a tabloid to bury negative stories to protect the Republican's 2016 presidential campaign.",
      "publishedAt": "2024-04-26T04:01:57Z",
      "title": "Trump's lawyers try to discredit testimony of prosecution's first witness in hush money trial",
      "url": "https://apnews.com/868e6b9d30a039d5009ec6a9d7e96ff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/663a546105f249cbb9b728560e65e0d5/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Defense lawyers in Donald Trump’s hush money trial dug Friday into assertions of the former publisher of the National Enquirer and his efforts to protect Trump from negative stories during the 2016 election.",
      "publishedAt": "2024-04-26T10:41:24Z",
      "title": "The Latest | Trump speaks with reporters after 4th day of witness testimony in hush money trial ends",
      "url": "https://apnews.com/afc9fb76e5b52db950339ce6c99d5fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f278ec766b84faea7b9887179b86607/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD, NOREEN NASIR and NICK PERRY",
      "description": "NEW YORK (AP) — Columbia University students who inspired pro-Palestinian demonstrations across the country said Friday that they had reached an impasse with administrators and intended to continue their encampment until their demands were met.",
      "publishedAt": "2024-04-26T04:23:05Z",
      "title": "Columbia protesters say they're at an impasse with administrators and will continue anti-war camp",
      "url": "https://apnews.com/e8a2e657e2614f94373beae602e9ba9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c1339998c442e1a47fedb95fb552a1/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — A former paramedic who injected Elijah McClain with a powerful sedative avoided prison and was sentenced to 14 months in jail and probation on Friday in the Black man’s killing that helped fuel the 2020 racial injustice protests.",
      "publishedAt": "2024-04-26T05:42:24Z",
      "title": "Paramedic who injected Elijah McClain with ketamine before his death avoids prison",
      "url": "https://apnews.com/c2a7d4a0883588c4dc87993ebe6bb472",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb23041ee8e41459df9ad7a4f8b455d/3000.jpeg"
    },
    {
      "author": "RYAN J. FOLEY, CARLA K. JOHNSON and SHELBY LUM",
      "description": "Demetrio Jackson was desperate for medical help when the paramedics arrived.The 43-year-old was surrounded by police who arrested him after responding to a trespassing call in a Wisconsin parking lot.",
      "publishedAt": "2024-04-26T10:16:50Z",
      "title": "Dozens of deaths reveal risks of injecting sedatives into people restrained by police",
      "url": "https://apnews.com/621909ba7491abc2af8ad2e33ba3415b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a749ed6f161747ff994b2295a3c83a5e/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. will provide Ukraine additional Patriot missiles for its air defense systems as part of a massive $6 billion additional aid package, Defense Secretary Lloyd Austin announced Friday.",
      "publishedAt": "2024-04-25T23:50:44Z",
      "title": "US announces new Patriot missiles for Ukraine as part of new $6 billion aid package",
      "url": "https://apnews.com/026fc8f9ee064ffb49bbee2422e2908b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8afe8c87e244360afba280c00cd8263/1920.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — #MeToo founder Tarana Burke has heard it before. Every time there’s a legal setback, the movement is declared dead in the water. A legal success, and presto, it’s alive again.So Burke, who nearly two decades ago coined the phrase “Me too” from her work with sexual assault survivors, found herself again declaring after New York's highest court on Thursday overturned Harvey Weinstein’s 2020 rape conviction: The #MeToo reckoning is greater than any court case.",
      "publishedAt": "2024-04-26T04:43:08Z",
      "title": "#MeToo advocates vow the reckoning will continue after Weinstein's conviction is overturned",
      "url": "https://apnews.com/8272c7113b53714c51cb54111cd01bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/144d5fea3d954a8d99e3d8815667fdbc/3000.jpeg"
    },
    {
      "author": "JOSH FUNK, MARGERY A. BECK and HEATHER HOLLINGSWORTH",
      "description": "OMAHA, Neb. (AP) — A tornado plowed through suburban Omaha, Nebraska, on Friday afternoon, damaging hundreds of homes and other structures as the twister tore for miles along farmland and into subdivisions.",
      "publishedAt": "2024-04-26T21:37:13Z",
      "title": "Midwest tornadoes cause severe damage in Omaha suburbs",
      "url": "https://apnews.com/491cd033f91eb27f4139bf5582e57903",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/006cf9fac3e84c788a4d0a320e9ad593/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden’s administration is indefinitely delaying a long-awaited menthol cigarette ban, a decision that infuriated anti-smoking advocates but could avoid a political backlash from Black voters in November.",
      "publishedAt": "2024-04-26T18:57:36Z",
      "title": "Biden officials indefinitely postpone ban on menthol cigarettes amid election-year pushback",
      "url": "https://apnews.com/e9a28fb0ac70fcb0ad8e106c42d4c951",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66b3845f3c4d4747a69e5ae22f6fe4b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}