{
  "articles": [
    {
      "author": "SAM MEDNICK",
      "description": "ADRE, Chad (AP) — Crossing into Chad, the 27-year-old thought she'd left the horrors of Sudan's war behind: the bodies she ran over while fleeing, the screams of girls being raped, the disappearance of her husband when gunmen attacked.",
      "publishedAt": "2024-11-16T05:32:24Z",
      "title": "They fled war in Sudan. Now, women in refugee camps say they’re being forced to have sex to survive",
      "url": "https://apnews.com/49b3d344da3573d4abe06bb7c3be965e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd52bc564934420b8f3ad699414dc91a/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "PALM BEACH, Fla. (AP) — President-elect Donald Trump made his selection for energy secretary on Saturday, even as a key ally, billionaire Elon Musk, called for more direct public input into the decision-making process for another top post: the head of the Treasury Department.",
      "publishedAt": "2024-11-16T18:23:17Z",
      "title": "Trump taps Wright as energy secretary, as Musk suggests public should weigh in on Treasury pick",
      "url": "https://apnews.com/8d5bfbccd32c1115cf2f6b54b8c58a0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63865d6086824542b154b353bb72475c/2945.jpeg"
    },
    {
      "author": "MIKE CATALINI, PHILIP MARCELO AND AUDREY McAVOY",
      "description": "TOTOWA, N.J. (AP) — Patrons at Murph's Tavern are toasting not just Donald Trump's return to the presidency but the fact that he carried their northern New Jersey county, a longtime Democratic stronghold in the shadow of New York City.",
      "publishedAt": "2024-11-16T13:37:50Z",
      "title": "From New Jersey to Hawaii, Trump made inroads in surprising places in his path to the White House",
      "url": "https://apnews.com/346dbbd11111f9558b69ed137321c630",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e5a9f569edd442697801511cbe67b12/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump's choice of Matt Gaetz to be attorney general has many Justice Department employees reeling, worried not only about their own jobs but the future of the agency that the Trump loyalist has railed against.",
      "publishedAt": "2024-11-16T13:15:23Z",
      "title": "Anxiety and dismay inside the Justice Department after Trump taps Gaetz as attorney general",
      "url": "https://apnews.com/852d3096a6f154fcdb23581948f906e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e30aaf5ce11f4f69a6e21939d79212bf/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS, HANNA ARHIROVA and LORI HINNANT",
      "description": "KYIV, Ukraine (AP) — At a secretive factory in Russia's central grasslands, engineers are manufacturing hundreds of decoy drones meant to overwhelm Ukrainian defenses as they try to protect against a horrific new weapon, an Associated Press investigation has found.",
      "publishedAt": "2024-11-16T05:06:21Z",
      "title": "Operation False Target: How Russia plotted to mix a deadly new weapon among decoy drones in Ukraine",
      "url": "https://apnews.com/2f904b04fcc5de17549415a974f5a92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76742f121c4d4081a87b504b1a48afc7/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — Over the past two weeks, the political landscape around the negotiations for a cease-fire in Gaza have undergone a dramatic transformation.",
      "publishedAt": "2024-11-16T05:45:40Z",
      "title": "The family of Israeli-American hostage pleads with Biden and Trump to bring hostages home",
      "url": "https://apnews.com/7e3cd6a6f0b9cd70cced92225a31e66c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261f2360482441f08c39757ea7a927a1/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Israeli ground forces reached their deepest point in Lebanon since they invaded six weeks ago before pulling back Saturday after battles with Hezbollah militants, Lebanese state media reported.",
      "publishedAt": "2024-11-16T12:06:32Z",
      "title": "Israeli troops reach deepest point in Lebanon since Oct. 1 invasion, Lebanese media say",
      "url": "https://apnews.com/41d19e05cebf73a66dc320ccad047d4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b690abc9d7f4bd4bf0409c5215fb0a0/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and RYAN J. FOLEY",
      "description": "MINNEAPOLIS (AP) — On the last night of their lives, Jagdish Patel, his wife and their two young children tried to slip into the U.S. across a near-empty stretch of the Canadian border. Wind chills reached minus 36 Fahrenheit (minus 38 Celsius) that night in January 2022 as the family from India set out on foot to meet a waiting van.",
      "publishedAt": "2024-11-16T05:05:15Z",
      "title": "An Indian family froze to death crossing the Canada-US border, a perilous trip becoming more common",
      "url": "https://apnews.com/16946bb01a1d1ca2978f29e902e550fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d8cbba426a64e06b213a545e7b8861e/3000.jpeg"
    },
    {
      "author": "HOLLY MEYER",
      "description": "In the new horror movie, “Heretic,” Hugh Grant plays a diabolical religious skeptic who traps two scared missionaries in his house and tries to violently shake their faith.",
      "publishedAt": "2024-11-16T13:34:57Z",
      "title": "From 'The Exorcist' to 'Heretic,' why holy horror can be a hit with moviegoers",
      "url": "https://apnews.com/1252f80811e8c5e6cdc6610d3d87b070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8c6df39ba874ce495d4c4562f49a782/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — New York City politicians are calling on Whoopi Goldberg to apologize for suggesting on air that a local bakery had declined to make “The View” co-host a batch of desserts for her birthday because of her political beliefs.",
      "publishedAt": "2024-11-16T18:40:10Z",
      "title": "NYC politicians call on Whoopi Goldberg to apologize for saying bakery denied order over politics",
      "url": "https://apnews.com/45b9f1ab9da1783eb436c3db161da19d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9708340bfb24ae684f8db71d967570b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}