{
  "articles": [
    {
      "author": "Joey Cappelletti, Steven Sloan",
      "description": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors. The Republican president is still expected to meet with governors at the White House on Friday but the event won't be facilitated by the governors' group. Trump had refused to include Democratic Jared Polis of Colorado and Wes Moore of Maryland and he recently blasted them on social media as “not worthy of being there.” The episode underscores the confrontational approach Trump has taken during his second term toward state leaders he doesn't like.",
      "publishedAt": "2026-02-19T05:15:03Z",
      "title": "Group backs out after Trump won't invite all governors to the White House",
      "url": "https://apnews.com/article/governors-trump-meeting-counterweight-washington-5e078af4172aba3ea3c734c910e4e0c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/43a78d4/2147483647/strip/true/crop/5603x3733+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F01%2F4d59b39ea23ebf44e89974f57c24%2Fee69369429944fc291dafaa73da95874"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran held annual military drills with Russia as a second American aircraft carrier drew closer to the Middle East. Both the United States and Iran are signaling they are prepared for war if talks on Tehran’s nuclear program fizzle out. President Donald Trump said Thursday he believes 10 to 15 days is enough time for Iran to reach a deal. But talks on its nuclear program have been deadlocked for years, and Iran has refused to discuss wider U.S. and Israeli demands that it scale back its missile program and sever ties to armed groups. Indirect talks held in recent weeks made little visible progress, and one or both sides could be buying time for final war preparations.",
      "publishedAt": "2026-02-19T08:04:43Z",
      "title": "Trump warns of 'bad things' if Iran doesn't make a deal",
      "url": "https://apnews.com/article/iran-us-russia-drill-nuclear-talks-aircraft-carrier-0456903e0d7a24cfcdc33d53732dee2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/68fe7c0/2147483647/strip/true/crop/4800x3198+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F97%2F532fc68388db2b374dd03913b6bf%2F25752bd85ebd4e54862d41250c82eb71"
    },
    {
      "author": "Konstantin Toropin, Ben Finley",
      "description": "The Pentagon is sending the largest force of American warships and aircraft to the Middle East in decades. The buildup is happening as President Donald Trump warns of possible military action against Iran if talks over its nuclear program fall apart. Trump likely will have a host of military options. They could include surgical attacks on Iran’s air defenses or strikes focused on Supreme Leader Ayatollah Ali Khamenei. But experts warn that Iran could retaliate in ways it hadn’t following attacks last year by the U.S. or Israel. They say military actions against Iran could potentially risk American lives and spark a regional war.",
      "publishedAt": "2026-01-23T22:10:51Z",
      "title": "US military assets in the Middle East",
      "url": "https://apnews.com/article/us-military-middle-east-iran-protests-b7a56659d708f2f11f66a18135f44c40",
      "urlToImage": "https://dims.apnews.com/dims4/default/3df649e/2147483647/strip/true/crop/3855x2569+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F1b%2F608c284adb0a220791def46133a5%2F830616e90d5340379c0de0bd92d4ef98"
    },
    {
      "author": null,
      "description": "The Board of Peace has met for the first time in Washington, bringing officials from nearly 50 countries together. Twenty-seven of the countries have joined the board. The other participating countries — as well as the European Union — came as observers. President Donald Trump opened the meeting on Thursday, announcing that nine members pledged a combined $7 billion toward relief in Gaza. Trump also said five countries have agreed to deploy troops to take part in an international stabilization force to the Palestinian territory that has been battered by the war between Israel and the Palestinian militant Hamas group.",
      "publishedAt": "2026-02-19T16:57:13Z",
      "title": "List of those who attended Trump's first Board of Peace meeting",
      "url": "https://apnews.com/article/trump-board-of-peace-participants-b9b7e438caeca308c153b60c032895b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd45c08/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fd5%2F5872243d721b3902df98754d57be%2F256beca1c4e544c59258e41f7db15a8b"
    },
    {
      "author": "Sudhin Thanawala",
      "description": "A federal judge has accused the Trump administration of terrorizing immigrants and recklessly violating the law in its efforts to deport millions of people living in the country illegally. Citing the deaths of Renee Good and Alex Pretti in Minnesota, the judge said in a scathing decision late Wednesday that the White House had also “extended its violence on its own citizens.” U.S. District Judge Sunshine Sykes in Riverside, California ordered the U.S. Department of Homeland Security to provide detained immigrants around the country with notice of her earlier decision that they may be eligible to seek release on bond. The department said in a statement that the Supreme Court had “repeatedly overruled” lower courts on the issue of mandatory detention.",
      "publishedAt": "2026-02-19T17:49:11Z",
      "title": "Federal judge slams Trump administration's immigration crackdown in scathing decision",
      "url": "https://apnews.com/article/immigration-trump-detention-bond-judge-50a5da122aa51eed77cace0830548df3",
      "urlToImage": "https://dims.apnews.com/dims4/default/b16ac16/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2Fee%2Fc0771d40cb34fb818d088e655456%2Fe0d6d797a9294d70bb1ad3fb14800cdd"
    },
    {
      "author": "Ryan J. Foley, Jim Mustian",
      "description": "The federal prosecutor’s office in Minnesota has been gutted by a wave of career officials resigning or retiring over objections to Trump administration directives. Because of the turmoil, 12-time convicted felon Cory Allen McKay caught a break. He was scheduled to stand trial next month on methamphetamine trafficking charges that could have locked him up for 25 years. Instead, he walked free after the prosecutor on his case retired. The diminished U.S. attorney's office has been forced to dismiss some cases, kill others before charges are filed and seek plea agreements and delays. Local officials worry the office will be unable to bring charges against some of the state’s most serious offenders.",
      "publishedAt": "2026-02-19T05:08:03Z",
      "title": "Defendants catch a break from exodus of prosecutors in Minnesota",
      "url": "https://apnews.com/article/minnesota-prosecutors-office-defendant-free-142f82b163a8b0d646ba6079251d32be",
      "urlToImage": "https://dims.apnews.com/dims4/default/c99d897/2147483647/strip/true/crop/3900x2599+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fdd%2F3df03bab0c0b3be07726d4487449%2Fae55ffbd7e174ff0868197e6074e0070"
    },
    {
      "author": "Russ Bynum",
      "description": "Kindergarten and first grade students at a Georgia school are mourning their teacher days after she was killed by a driver who authorities say was fleeing federal immigration officers. Principal Alonna McMullen says it was heartbreaking telling 5 and 6 year old students in Linda Davis' special needs classes of her death. The crash happened Monday less than a half mile from the school where Davis taught in Savannah's southern suburbs. Authorities say the driver was a Guatemalan man who crashed after running a stoplight to evade immigration officers seeking to detain him on a judge's deportation order. McMullen said Davis had an upbeat personality and a determination to ensure all of her students thrived.",
      "publishedAt": "2026-02-19T21:35:22Z",
      "title": "Students in Savannah grieve teacher killed in crash with driver pursued by ICE",
      "url": "https://apnews.com/article/ice-immigration-crash-savannah-teacher-linda-davis-daed7eaee667a725dc7e3891ab327ca5",
      "urlToImage": "https://dims.apnews.com/dims4/default/07ee779/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F17%2F685f0c641d6a857b10072aa667eb%2F8e062825a75149fb82e5a25095150306"
    },
    {
      "author": "Maria Sherman",
      "description": "Eric Dane, the actor known for “Grey’s Anatomy” and “Euphoria,” has died at 53 due to ALS. His representatives say he died on Thursday afternoon. His family says he spent his final days with loved ones. Dane rose to fame as Dr. Mark Sloan on “Grey’s Anatomy” and later played Cal Jacobs on “Euphoria.” He also starred on “The Last Ship,” where production paused as he battled depression. In April 2025, Dane shared his diagnosis of ALS, which is also known as Lou Gehrig's disease. He later spoke publicly to push ALS awareness and research. He leaves two daughters with wife Rebecca Gayheart, who he married in 2004.",
      "publishedAt": "2026-02-20T02:33:07Z",
      "title": "Eric Dane, 'Grey's Anatomy' and 'Euphoria,' star, dies at 53",
      "url": "https://apnews.com/article/eric-dane-dead-a2eaf3916d047c038ac1121af9a99f17",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa23604/2147483647/strip/true/crop/3111x2073+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F08%2Fde6e582fcc2f8c5cde34b107a744%2F45b88ad30d514972ada55c630fb3aafd"
    },
    {
      "author": "John Hanna, Jamie Stengle",
      "description": "Democratic Rep. Jasmine Crockett of Texas is urging supporters to look at experience in a heated U.S. Senate primary with state Rep. James Talarico as he rides on wider attention thanks to late-night host Stephen Colbert. The March 3 primary in Texas is the nation’s first big contest of the 2026 midterm elections, and early voting is underway. Talarico and Crockett ramped up their bids Thursday as some Democrats see increasing opportunity in November’s elections despite not having won a statewide race in Texas in more than 30 years. Colbert's pulled interview with Talarico put more of a spotlight on their race. Crockett rallied supporters at multiple stops around the Dallas area on Thursday.",
      "publishedAt": "2026-02-20T01:09:34Z",
      "title": "Colbert controversy pours money, attention on Texas Senate race",
      "url": "https://apnews.com/article/colbert-talarico-crockett-senate-texas-trump-1135c821aece1a1023c48272ddf0e8c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e95a39/2147483647/strip/true/crop/4967x3310+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F64%2F6654ddec461d445ae40e5183cb55%2F64a60f341f594b02b0fd03cec7d5f183"
    },
    {
      "author": "Dave Skretta",
      "description": "Alysa Liu won Olympic gold for the U.S. in women’s figure skating, ending a 24-year drought. Liu delivered a near-flawless free skate at the Milan Cortina Games to beat out Kaori Sakamoto and Ami Nakai of Japan on Thursday night. Liu had returned to the sport after stepping away following the Beijing Games. She posted a career-best 226.79 points, while Sakamoto took silver after a mistake. Nakai earned bronze after a slip as well. American teammate Amber Glenn celebrated in the kiss-and-cry area with Liu after Nakai’s score was read. Glenn rebounded from Tuesday’s short program and finished fifth.",
      "publishedAt": "2026-02-19T10:26:43Z",
      "title": "Alysa Liu gives US its first women's figure skating Olympic gold in 24 years",
      "url": "https://apnews.com/article/milan-cortina-olympics-figure-skating-women-437ba97a98c0f43b1317dfc26275b633",
      "urlToImage": "https://dims.apnews.com/dims4/default/0049a3c/2147483647/strip/true/crop/3562x2373+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Ff8%2Fed91f0f1f6a81fbc7413c21a7daf%2Fcc677e98953a415bac6270c8f198e8da"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}