{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday struck down a Trump-era ban on bump stocks, the rapid-fire gun accessories used in the deadliest mass shooting in modern U.S.",
      "publishedAt": "2024-06-14T14:13:26Z",
      "title": "Supreme Court strikes down Trump-era ban on rapid-fire rifle bump stocks, reopening political fight",
      "url": "https://apnews.com/b3bd1b4163d78514a6d5acc5b44c8b3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a24ad0dd9c2e4395ab953594ab9bb568/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson said Friday that the House will go to court to enforce the subpoena against Attorney General Merrick Garland for access to President Joe Biden's special counsel audio interview, hours after the Justice Department refused to prosecute Republicans’ contempt of Congress charge.",
      "publishedAt": "2024-06-14T18:37:32Z",
      "title": "Speaker Johnson says House will go to court for Biden audio after Justice Dept. refused to prosecute",
      "url": "https://apnews.com/8f38c7178fb0c996442781243f65ab97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22ab6aee5cae471f8861fb7f140db56f/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "The Supreme Court 's ruling on technical grounds Thursday keeps the abortion pill mifepristone available in the U.S. for now, but it won't be the last word on the issue, and the unanimous opinion offers some clues for how abortion opponents can keep trying to deny it to women nationwide.",
      "publishedAt": "2024-06-14T19:29:23Z",
      "title": "The Supreme Court's ruling on mifepristone isn't the last word on the abortion pill",
      "url": "https://apnews.com/5cc89d289ced29a1274423b43789397f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1b05c3b58684e57ab6725d1cafb4150/2924.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "MATAMOROS, Mexico (AP) — Some shelters south of the U.S. border are caring for many more migrants now that the Biden administration stopped considering most asylum requests, while others have yet to see much of a change.",
      "publishedAt": "2024-06-14T17:55:28Z",
      "title": "Some Mexican shelters see crowding south of the border as Biden's asylum ban takes hold",
      "url": "https://apnews.com/4957cad289d270306d20c08ea3b273c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0573995fcee448aafc6883c18792cee/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A federal judge on Friday ordered the liquidation of conspiracy theorist Alex Jones ′ personal assets but dismissed his company’s separate bankruptcy case, leaving the future of his Infowars media platform uncertain as he owes $1.5 billion for his false claims that the Sandy Hook Elementary School shooting was a hoax.",
      "publishedAt": "2024-06-14T04:03:35Z",
      "title": "Alex Jones’ personal assets to be sold to pay $1.5B Sandy Hook debt. Company bankruptcy is dismissed",
      "url": "https://apnews.com/3ccd113496caee18a085dfa54c6e6c0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/613b59a563dc48b2a3b84ffeb4027819/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Leaders of the Group of Seven wealthy democracies have agreed to engineer a $50 billion loan to help Ukraine in its fight for survival.",
      "publishedAt": "2024-06-13T04:09:37Z",
      "title": "G7 leaders agree to lend Ukraine billions backed by Russia's frozen assets. Here's how it will work",
      "url": "https://apnews.com/39d8619f083600651fabe46b4548716d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71f15553b4414dafa4620a62175d1713/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and KELVIN CHAN",
      "description": "BARI, Italy (AP) — Pope Francis challenged leaders of the world’s wealthy democracies on Frida y to keep human dignity foremost in developing and using artificial intelligence, warning that such powerful technology risks turning human relations themselves into mere algorithms.",
      "publishedAt": "2024-06-14T04:27:52Z",
      "title": "Pope Francis becomes first pontiff to address a G7 summit, raising alarm about AI. The G7 responds",
      "url": "https://apnews.com/610b8f16aac4d36aa8a56c88de2ca09f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b666cb7ba7e54e29bb0c57d27df1ef6e/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "CAPE TOWN, South Africa (AP) — South African President Cyril Ramaphosa was reelected by lawmakers for a second term on Friday, after his party struck a dramatic late coalition deal with a former political foe just hours before the vote.",
      "publishedAt": "2024-06-14T07:43:16Z",
      "title": "South Africa's President Ramaphosa is reelected for second term after a dramatic late coalition deal",
      "url": "https://apnews.com/b71d8f3de7b3bb4be76f94e8d75f0daf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a7f16405e34450cae5185e721929b0c/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN and TATIANA POLLASTRI",
      "description": "MOGI GUACU, Brazil (AP) — Orange juice prices have always been volatile, falling when bumper harvests create an oversupply of oranges and rising when frost or a hurricane knocks out fruit trees.",
      "publishedAt": "2024-06-14T15:13:34Z",
      "title": "High orange juice prices may be on the table for a while due to disease and extreme weather",
      "url": "https://apnews.com/8a8f97573d9c26ab44a62c6a0228686e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c67a6037f58841c0aacfd9ae99345f68/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and DANICA KIRKA",
      "description": "LONDON (AP) — The Princess of Wales said Friday she is “making good progress” in her cancer treatment and will attend King Charles III 's ceremonial birthday parade on Saturday, Kate’s first public appearance since her diagnosis.",
      "publishedAt": "2024-06-14T17:03:12Z",
      "title": "Princess of Wales says she's making ‘good progress’ in cancer treatment, will attend a public event",
      "url": "https://apnews.com/255a3da40725ba9fc702a9a4ccce470f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc8d42e552dc41fbbf514af36df7b928/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}