{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST, EUGENE JOHNSON and ERIC TUCKER",
      "description": "SEATTLE (AP) — The founder of Binance, the world’s largest cryptocurrency exchange, pleaded guilty Tuesday to a felony charge that he failed to take steps to prevent money laundering as the company agreed to pay more than $4 billion following an investigation by the U.S.",
      "publishedAt": "2023-11-21T17:27:45Z",
      "title": "Founder of Binance, world’s largest crypto exchange, pleads guilty to anti-money laundering charge",
      "url": "https://apnews.com/8314e9697b98cfe3a9827c78e5720914",
      "urlToImage": ""
    },
    {
      "author": "JOSEF FEDERMAN and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israel and the Hamas militant group on Tuesday appeared close to a deal to temporarily halt their devastating six-week war so that dozens of hostages being held in the Gaza Strip could be freed in exchange for Palestinians in Israeli prisons.",
      "publishedAt": "2023-11-21T07:37:00Z",
      "title": "Israeli Cabinet to consider possible deal for release of some hostages held by Hamas",
      "url": "https://apnews.com/39f5ae0bdb4e32f0e69115aa43446132",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/802532e04553451694390464c84f3dc4/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — The helicopter-borne Houthi attack on an Israel-linked ship in the Red Sea highlights the danger now lurking in one of the world’s key shipping routes as the Israel-Hamas war rages, as well as the rebels’ tactics mirroring those of its chief sponsor, Iran.",
      "publishedAt": "2023-11-21T10:48:59Z",
      "title": "Analysis: Iran-backed Yemen rebels' helicopter-borne attack on ship raises risks in crucial Red Sea",
      "url": "https://apnews.com/65b611ff878a411900037e7c9a8ee17b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5918958d960740019d63fcbf11cc64b4/1620.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Patrick Kennedy, son of Sen. Ted Kennedy and nephew of President John F. Kennedy, remembers being a young state legislator in Rhode Island some 30 years ago and hearing encouraging words from the opposition leader at the time.",
      "publishedAt": "2023-11-21T05:16:42Z",
      "title": "60 years after JFK's death, today's Kennedys choose other paths to public service",
      "url": "https://apnews.com/7a17f5baefe83fc1eddb1025e2e298d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2a87e7d7fed4870a1d6b18fe5094565/2000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — It happens every November, when the cold descends on Kyiv. The change in weather always makes Dmytro Riznychenko think back, and he is overwhelmed by his emotions.“This is where it truly began,\" Riznychenko said, walking through central Kyiv's Independence Square recently, reflecting on the uprising that unleashed a decade of momentous change for Ukraine, eventually leading to the current war with Russia.",
      "publishedAt": "2023-11-21T05:07:51Z",
      "title": "10 years later, a war-weary Ukraine reflects on events that began its collision course with Russia",
      "url": "https://apnews.com/2f73f31a5aec45bd7dbcddae8f72edac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf5eb7c4aa8d490f981fe10dd37d220c/3000.jpeg"
    },
    {
      "author": "KATHY McCORMACK and ROBERT F. BUKATY",
      "description": "HINSDALE, N.H. (AP) — Geoffrey Holt was unassuming as the caretaker of a mobile home park in Hinsdale, New Hampshire, where he lived a simple, but curious life. Residents would see Holt around town in threadbare clothes — riding his lawn mower, headed to the convenience store, parked along the main road reading a newspaper or watching cars pass.",
      "publishedAt": "2023-11-21T05:13:25Z",
      "title": "New Hampshire man had no car and no furniture, but died with a big secret, leaving his town millions",
      "url": "https://apnews.com/994a9448623c51db5036b85dd563fb24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/673519ccacec4878b7c7d07e3171b69a/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A judge in Atlanta is hearing arguments Tuesday on a request to revoke the bond of one of former President Donald Trump's co-defendants in the Georgia case related to efforts to overturn the 2020 election.",
      "publishedAt": "2023-11-21T05:06:37Z",
      "title": "A judge hears arguments on revoking a Trump co-defendant's bond in Georgia election subversion case",
      "url": "https://apnews.com/b8af5a6f7b99da9fec4834f940f133c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d25b510efae4042a50985c33a74b03b/3000.jpeg"
    },
    {
      "author": "LOUIS OKAMBA",
      "description": "BRAZZAVILLE, Republic of Congo (AP) — A stampede at a military stadium has left at least 37 people dead in Republic of Congo after large crowds of young people responded to a recruitment appeal, authorities said Tuesday.",
      "publishedAt": "2023-11-21T12:37:32Z",
      "title": "At least 37 dead after a stampede at a military recruitment event in the Republic of Congo",
      "url": "https://apnews.com/4c312db9335771786481e130f3a23b80",
      "urlToImage": ""
    },
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — The sun was shining in June 1979 as Rosalynn Carter made her way through an enthusiastic crowd in Laconia, New Hampshire.“She shook my hand!” yelled one delighted participant.",
      "publishedAt": "2023-11-21T05:07:33Z",
      "title": "Rosalynn Carter's advocacy for mental health was rooted in compassion and perseverance",
      "url": "https://apnews.com/c17a5bc89c29f952b0d3f7f48c3b2412",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebae35acc31043e4b05c39cd27eb2db3/2208.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Despite inflation and memories of past holiday travel meltdowns, millions of people are expected to hit airports and highways in record numbers over the Thanksgiving break.The busiest days to fly will be Tuesday and Wednesday as well as the Sunday after Thanksgiving.",
      "publishedAt": "2023-11-21T05:26:29Z",
      "title": "Record crowds are expected to take to the air and roads for Thanksgiving",
      "url": "https://apnews.com/4dc8ec8af36e686c1bc116df5d736562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/740365365c6d4387a3037de838c67903/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}