{
  "articles": [
    {
      "author": "MORIAH BALINGIT",
      "description": "WASHINGTON (AP) — In some ways, Doris Milton is a Head Start success story.",
      "publishedAt": "2024-03-03T05:07:39Z",
      "title": "Head Start preschools aim to fight poverty, but their teachers struggle to make ends meet",
      "url": "https://apnews.com/256a66cc4df8a331a2d0badcba7f72e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/920ddc1f71194cc3849885d6a24062df/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders on Sunday came out with a package of six bills setting full-year spending levels for some federal agencies, a step forward in a long overdue funding process beset by sharp political divisions between the two parties as well as infighting among House Republicans.",
      "publishedAt": "2024-03-03T22:55:25Z",
      "title": "Congressional leaders come out with 6 spending bills in a drive to avoid a partial shutdown",
      "url": "https://apnews.com/e813a4321d7f61b3ad173d06f651ca13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/416fe11498ab4030b349f540ce2c3c5b/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election.",
      "publishedAt": "2024-03-03T18:16:35Z",
      "title": "A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot",
      "url": "https://apnews.com/d784759ab9376d4c3a6e3ae72465f448",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4913e5ff250b4ade971c32f599ef785a/3000.jpeg"
    },
    {
      "author": "GISELA SALOMON",
      "description": "Joe Biden has made more use of immigration “parole” than any American president to bypass an uncooperative Congress, but he's hardly the first.The presidential power has been a centerpiece of Biden's strategy to channel immigrants through new and expanded legal pathways and discourage illegal crossings, a radical difference from his rival Donald Trump.",
      "publishedAt": "2024-03-03T20:26:27Z",
      "title": "Immigration 'parole' is a well-worn tool for US presidents. It faces a big test in 2024 elections",
      "url": "https://apnews.com/6deab463a9cc596b2cd1adc6443da787",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ad523a7b7c84756b1f181bb027e1958/2777.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Prime Minister Benjamin Netanyahu rebuked a top Cabinet minister arriving in Washington on Sunday for talks with U.S. officials, according to an Israeli official, signaling widening cracks within the country’s leadership nearly five months into its war with Hamas.",
      "publishedAt": "2024-03-03T11:50:29Z",
      "title": "Rival of Netanyahu visits US, signaling wider cracks in Israel’s wartime leadership",
      "url": "https://apnews.com/3193becf71b8e5a533d38be7973795e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1be8797d056f4aefb1509db40a8f9ef5/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — It took 10 years and three rounds of in vitro fertilization for Rania Abu Anza to become pregnant, and only seconds for her to lose her five-month-old twins, a boy and a girl.",
      "publishedAt": "2024-03-03T14:27:25Z",
      "title": "After 10 years of trying, a Palestinian woman had twins. An Israeli strike killed them both",
      "url": "https://apnews.com/25282b273b92aec7fc75c3212f8d8e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfceb280d30d44f5beb656b1398628d0/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS, JESSE BEDAYN and AMELIA THOMSON-DeVEAUX",
      "description": "WASHINGTON (AP) — A small but substantial chunk of Republican primary and caucus voters say they would be so dissatisfied if Donald Trump became the party's presidential nominee that they would not vote for him in November's general election, according to AP VoteCast.",
      "publishedAt": "2024-03-03T12:30:12Z",
      "title": "A chunk of Republican primary and caucus voters say they wouldn’t vote for Trump as the GOP nominee",
      "url": "https://apnews.com/4a64d34b6d74e167cf6b256784c841c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58524294814245b59d2078e2d62d39ef/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "WASHINGTON (AP) — As an independent, Christian Miller can’t vote in Pennsylvania’s closed presidential primary in April. He said it wouldn’t matter even if he could.“You’re not really voting for anything,\" said Miller, who left the Democratic Party in 2022.",
      "publishedAt": "2024-03-03T12:49:54Z",
      "title": "Super Tuesday's dominance highlights how presidential selection process can exclude many US voters",
      "url": "https://apnews.com/d7bc896efd6f53f1f8b28225af6f8957",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f635ce2cc15b432fae53d5939b1f9793/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Hundreds of inmates fled Haiti's main prison after armed gangs stormed the facility in an overnight explosion of violence that engulfed much of the capital.",
      "publishedAt": "2024-03-03T15:39:55Z",
      "title": "Hundreds of inmates flee after armed gangs storm Haiti's main prison, leaving bodies behind",
      "url": "https://apnews.com/2788f145b0d26efc2aa199e923724e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f437685d4baf4661b3dd5fcfafa8adba/1920.jpeg"
    },
    {
      "author": "BROOKE HESS and CHRISTOPHER WEBER",
      "description": "TRUCKEE, Calif. (AP) — A major highway was closed and ski resorts were shut down Sunday as the effects of a powerful blizzard continued to cause problems across the Sierra Nevada, and forecasters warned that more heavy snow was on the way for Northern California.",
      "publishedAt": "2024-03-03T15:19:33Z",
      "title": "Key Northern California highway closed as snow continues to fall in the blizzard-hit Sierra Nevada",
      "url": "https://apnews.com/0d16bbf1fde08e77659d61325a469c1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f61156c45fcb47bd9a794ad43439cc8f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}