{
  "articles": [
    {
      "author": "Lisa Mascaro, Kevin Freking, Matt Brown",
      "description": "House Republicans have muscled their budget blueprint to passage, with a push from President Donald Trump. The vote late Tuesday evening is a crucial step toward delivering what he's called his “big, beautiful bill,” with $4.5 trillion in tax breaks and $2 trillion in spending cuts. It kickstarts a weeks-long process to draft the details and merge with the Senate. The vote was 217-215 with all Democrats opposed. But even some Republicans are uneasy. As Elon Musk is tearing through the federal government, Republicans are being hammered at town halls back home. It's a familiar GOP problem that slashing federal spending is easier said than done, as constituents rely on Medicaid and other programs and services.",
      "publishedAt": "2025-02-25T12:04:42Z",
      "title": "Mike Johnson tries to push Trump's agenda forward, but votes in jeopardy",
      "url": "https://apnews.com/article/johnson-trump-republicans-budget-vote-tax-cuts-4cb74ca15f6a74a7344355e4507ab9fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/795d4f3/2147483647/strip/true/crop/5523x3107+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2Fa8%2F26f51e78b427964efa81c4039f4a%2F972e6299f88e4d88adaf72cf9083138d"
    },
    {
      "author": "Ryan J. Foley",
      "description": "The acting administrator of the organization that is pushing for sweeping budget cuts across federal agencies is a low-profile executive who has expertise in health care technology and worked in the first Trump administration. The White House identified Amy Gleason as the acting leader of the Department of Government Efficiency, which was created by the Trump organization to find waste, fraud and abuse in the government. Gleason, 53, worked from 2018 through 2021 in the United States Digital Service, an agency that has been renamed the US DOGE Service, according to her LinkedIn profile. In that role, she worked with the White House on the federal response to the coronavirus pandemic.",
      "publishedAt": "2025-02-25T23:14:14Z",
      "title": "Who is Amy Gleason, named DOGE's acting leader?",
      "url": "https://apnews.com/article/doge-acting-administrator-amy-gleason-65af638e646fdd5dd6d5fcc5cc04a2e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4fdad54/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2Fe0%2F8540b435eca560a1db9c712ac17a%2F893f744ccc654b41b16e863372a7857e"
    },
    {
      "author": "Brian Slodysko, Byron Tau",
      "description": "Twenty-one civil service employees have resigned from Elon Musk’s Department of Government Efficiency, saying they're refusing to use their technical expertise to “dismantle critical public services.” The staffers wrote Tuesday in a joint resignation letter obtained by The AP they “swore to serve the American people\" and uphold their oath to the Constitution across presidential administrations but it has become clear they “can no longer honor those commitments.” The staffers who resigned worked for what was once known as the United States Digital Service. Musk called the story “fake news” and said the staffers would have been fired if they didn't resign.",
      "publishedAt": "2025-02-25T16:02:30Z",
      "title": "DOGE staffers resign en masse to protest Musk's slashing of federal government",
      "url": "https://apnews.com/article/doge-elon-musk-federal-government-resignations-usds-6b7e9b7022e6d89d69305e9510f2a43c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3f5b55/2147483647/strip/true/crop/5827x3278+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2Fe7%2F524363185368c86081c03a0b16eb%2Fe22751441cbe469495e7a3f0da888633"
    },
    {
      "author": "Rebecca Santana",
      "description": "The Trump administration is creating a registry for all people who are in the U.S. illegally, and those who don’t self-report could face fines or prosecution. Immigration officials announced the registry efforts Tuesday. They said everyone who's in the U.S. illegally must register, give fingerprints and provide an address. Officials cited a section of the Immigration and Nationality Act as justification for registration, which would apply to anyone 14 and older. The announcement comes as the administration seeks to make good on campaign promises to carry out mass deportations and seal the border to future asylum-seekers. On its website, the U.S. Citizenship and Immigration Service said it would soon create a form and process for registration.",
      "publishedAt": "2025-02-26T03:04:55Z",
      "title": "Trump administration creates registry for immigrants who are in the US illegally",
      "url": "https://apnews.com/article/illegal-immigrant-registry-trump-border-enforcement-37ce7a345c1617ce3a9427e0ef755021",
      "urlToImage": "https://dims.apnews.com/dims4/default/4dce7d4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fd4%2F9ef7712cf0936d260abbe9903c81%2Fa82e043bfaa9428b9e26606abbc34f18"
    },
    {
      "author": "Ellen Knickmeyer, Michael Kunzelman",
      "description": "A federal judge has given the Trump administration less than two days to release billions of dollars in U.S. foreign aid. The judge says the administration has given no sign of complying with his nearly two-week-old court order to ease its funding freeze. The lawsuit was brought by nonprofit organizations over the cutoff of funding through the U.S. Agency for International Development and State Department. The cutoff followed an executive order by President Donald Trump targeting what he portrayed as wasteful programs that do not correspond to his foreign policy goals. Nonprofit groups who receive federal money for work abroad say the freeze breaks federal law and has shut down funding for even the most urgent life-saving programs abroad.",
      "publishedAt": "2025-02-25T18:47:58Z",
      "title": "Judge gives Trump administration two days to release billions of dollars in blocked foreign aid",
      "url": "https://apnews.com/article/funding-freeze-usaid-trump-d592d015249934827e023c65e644c51a",
      "urlToImage": "https://dims.apnews.com/dims4/default/802026d/2147483647/strip/true/crop/5388x3031+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F0c%2F639ee48e50350a0b6bfb22bb4aa0%2F82f334473ea541d79e32f63db5304d28"
    },
    {
      "author": "Josef Federman, Abby Sewell",
      "description": "Israeli and Hamas officials say they have reached an agreement to exchange the bodies of dead hostages for the release of hundreds of Palestinian prisoners. The deal Tuesday keeps their fragile ceasefire intact for at least a few more days. Israel has delayed the release of 600 Palestinian prisoners since Saturday to protest what it says is the cruel treatment of hostages during their release by Hamas. The militant group says the delay is a “serious violation” of their ceasefire. and that talks on a second phase are not possible until they are freed. The deadlock had threatened to collapse the ceasefire. But late Tuesday, Hamas said an agreement had been reached to resolve the dispute.",
      "publishedAt": "2025-02-25T23:13:07Z",
      "title": "Israel and Hamas agree on new exchange, leaving fragile ceasefire intact",
      "url": "https://apnews.com/article/israel-hamas-hostages-ceasefire-witkoff-a291db865dfd730c62e343e352cac94f",
      "urlToImage": "https://dims.apnews.com/dims4/default/6418dca/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F09%2F5481e3d25cf8cfaa104a57c7275b%2Fd68ede9cf70a4d16b43a4abeda1ea007"
    },
    {
      "author": "Laurie Kellman",
      "description": "The White House says its officials \"will decide\" which news outlets cover President Donald Trump. That departs from a century of tradition in which a pool of independent news organizations go where the chief executive does and holds him accountable on behalf of regular Americans. White House press secretary Karoline Leavitt said Wednesday that the changes would rotate some traditional outlets from the group and include some streaming services. She cast the change as a modernization of the press pool, saying the move would restore “access back to the American people” who elected Trump.",
      "publishedAt": "2025-02-25T19:07:45Z",
      "title": "White House says it 'will decide' which news outlets cover Trump, rotating some traditional ones",
      "url": "https://apnews.com/article/trump-ap-news-outlets-ban-gulf-mexico-25c77f617418dd3ca2791af90b263a59",
      "urlToImage": "https://dims.apnews.com/dims4/default/a07773e/2147483647/strip/true/crop/5177x2912+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fe5%2F39ad2aece61695b28518c1cb9b6b%2Fb63c5f23e7854d84abde290a07141d74"
    },
    {
      "author": "Mari Yamaguchi",
      "description": "The tiny island of Yonaguni on Japan’s western frontier is too small for even a convenience store. But its wooded mountain ranges now carry radar sites. Japan and its ally, the United States, hold joint military exercises here. Plans are underway to add a new missile unit. All of the buildup has cemented the island as a front line in a potential clash over Taiwan, the self-governing democratic island that China claims as its own. Yonaguni has just 1,500 local residents, making the militarization of the island especially felt.",
      "publishedAt": "2025-02-26T03:05:32Z",
      "title": "Stress and fear roil a tiny, rapidly militarizing Japanese island near Taiwan",
      "url": "https://apnews.com/article/japan-china-taiwan-us-military-border-island-948aeb5eeeac08b6db9f88eccc7bb55d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4bb79c/2147483647/strip/true/crop/3868x2176+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F33%2Fd46a59241b35c756aec6a02b2f73%2F50691f979cb5411887b6fb71ea2a50e1"
    },
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    },
    {
      "author": "Brian Witte, Rodrique Ngowi",
      "description": "A fired federal employee who oversaw cybersecurity at a flagship website for the U.S. Department of Veterans Affairs is warning that sensitive financial and health data could be compromised due to actions taken by the Trump administration’s Department of Government Efficiency. Jonathan Kamens led cybersecurity efforts for VA.gov and was fired this month. Dozens of his colleagues from the U.S. Digital Service were fired the same day. Kamens says he’s concerned he won’t be replaced amid the massive downsizing of the federal government. He said banking and other information is used on the VA site and is at risk. The VA says the loss of one employee won’t affect operations and that many others also focus on cybersecurity.",
      "publishedAt": "2025-02-25T22:38:31Z",
      "title": "Fired cybersecurity chief for Veterans Affairs site says data is at risk",
      "url": "https://apnews.com/article/veterans-affairs-cybersecurity-fired-federal-workers-e90eed5107537a910fe9ab979edba72f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a96396a/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2Ff3%2Fa1deb771fb3fad22d8a691685151%2Fus-ma-doge-va-firing-20250225cr-1920x1080.jpg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}