{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Hezbollah fired at least 185 rockets and other projectiles into Israel on Sunday, wounding seven people in the militant group's heaviest barrage in several days, in response to deadly Israeli strikes in Beirut while negotiators pressed on with cease-fire efforts to halt the all-out war.",
      "publishedAt": "2024-11-24T11:32:43Z",
      "title": "Hezbollah fires more than 180 rockets and other projectiles into Israel, wounding at least 7",
      "url": "https://apnews.com/c91698370339e689edb6423abb3ed392",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c315dc5f26744450925c72628baaa47d/1920.jpeg"
    },
    {
      "author": "SAM MCNEIL",
      "description": "UMM AL-FAHM, Israel (AP) — Israel’s yearlong crackdown against Palestinian citizens who speak out against the war in Gaza is prompting many to self-censor out of fear of being jailed and further marginalized in society, while some still find ways to dissent — carefully.",
      "publishedAt": "2024-11-24T05:18:36Z",
      "title": "Israel cracks down on Palestinian citizens who speak out against the war in Gaza",
      "url": "https://apnews.com/849cc9250534b5bae98cea89e6f4d35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07bb4526562b4a69890753279e1aa6c5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JON GAMBRELL",
      "description": "TEL AVIV, Israel (AP) — Israel said Sunday that the body of an Israeli-Moldovan rabbi who went missing in the United Arab Emirates has been found after he was killed in what it described as a “heinous antisemitic terror incident.”",
      "publishedAt": "2024-11-24T07:17:16Z",
      "title": "Israel says rabbi who went missing in the UAE was killed",
      "url": "https://apnews.com/98953265dcba8329803ae87d70462117",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c4a7a8fd48a4a988a6fe62ae99689d2/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Donald Trump has big plans for the economy — and a big debt problem that will be a hurdle to delivering on them.",
      "publishedAt": "2024-11-24T12:41:18Z",
      "title": "The rising price of paying the national debt is a risk for Trump's promises on growth and inflation",
      "url": "https://apnews.com/895ec1551122a0e1babf24b657f650bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4192e087704795a738260c492ad1f8/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin has signed a law granting debt forgiveness to new army recruits who enlist to fight in Ukraine.The measure, whose final version appeared on a government website Saturday, underscores Russia’s needs for military personnel in the nearly 3-year war, even as it fired last week a new intermediate-range ballistic missile.",
      "publishedAt": "2024-11-24T11:28:00Z",
      "title": "Moscow offers debt forgiveness to new recruits and AP sees wreckage of a new Russian missile",
      "url": "https://apnews.com/fb6c3fdd0e63d2c757bbf95fefcc2e31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f79638c90ada49ba963efc001f7b1dac/1920.jpeg"
    },
    {
      "author": "GODOFREDO A. VASQUEZ",
      "description": "WINDSOR, Calif. (AP) — Forecasters through the U.S. issued warnings that another round of winter weather could complicate travel leading up to the Thanksgiving holiday, while California and Washington state continue to recover from storm damage and power outages.",
      "publishedAt": "2024-11-24T08:16:07Z",
      "title": "Forecasts warn of possible winter storms across US during Thanksgiving week",
      "url": "https://apnews.com/4f28a830a98f04d012c9d03aa77073ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95f691472aa64203be5b9a842bca9f1e/1920.jpeg"
    },
    {
      "author": "KENYA HUNTER",
      "description": "ATLANTA (AP) — As she checked into a recent flight to Mexico for vacation, Teja Smith chuckled at the idea of joining another Women’s March on Washington.",
      "publishedAt": "2024-11-24T12:57:36Z",
      "title": "After Trump's win, Black women are rethinking their role as America's reliable political organizers",
      "url": "https://apnews.com/0c646e888c999b03d1798e1aa1331937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e026c36fe0d4d499bba68c3a777798c/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Pakistani police arrested thousands of Imran Khan supporters ahead of a rally in the capital to demand the ex-premier’s release from prison, a security officer said Sunday.Khan has been behind bars for more than a year and has over 150 criminal cases against him.",
      "publishedAt": "2024-11-24T06:13:03Z",
      "title": "Pakistani police arrest thousands of Imran Khan supporters ahead of rally in the capital",
      "url": "https://apnews.com/415227ef93b710798dedbc6c9f8ac2a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c2eacc36bc44feb8f1489841280b1f8/3000.jpeg"
    },
    {
      "author": "NAYARA BATSCHKE",
      "description": "MONTEVIDEO, Uruguay (AP) — Uruguayans went to the polls Sunday for a second round of voting to choose their next president, with the conservative governing party and the left-leaning coalition locked in a close runoff after failing to win an outright majority in last month's vote.",
      "publishedAt": "2024-11-24T04:00:39Z",
      "title": "Uruguay's once-dull election has become a dead heat in the presidential runoff",
      "url": "https://apnews.com/cb746654935e5de40a96c7b95e036e33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77031ffec2f345749b510b56847d79c4/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Chuck Woolery, the affable, smooth-talking game show host of “Wheel of Fortune,” “Love Connection” and “Scrabble” who later became a right-wing podcaster, skewering liberals and accusing the government of lying about COVID-19, has died.",
      "publishedAt": "2024-11-24T06:07:47Z",
      "title": "Chuck Woolery, smooth-talking game show host of 'Love Connection' and 'Scrabble,' dies at 83",
      "url": "https://apnews.com/508f37c136ccbc4c8ad48a4fd582674b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b828b222fb540edafc0bb1b58d6f8b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}