{
  "articles": [
    {
      "author": "JOHN LEICESTER, TOM NOUVIAN and MARINE LESPRIT",
      "description": "AVIGNON, France (AP) — A court in France on Thursday sentenced the ex-husband of Gisèle Pelicot to 20 years of imprisonment for drugging and raping her and allowing other men to rape her while she was unconscious, in abuse that lasted nearly a decade.",
      "publishedAt": "2024-12-19T05:05:47Z",
      "title": "Gisèle Pelicot's ex-husband found guilty of rapes, sentenced to 20 years in prison in France",
      "url": "https://apnews.com/2b25791099f785fabb3c46123d30d9f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9d6a46bcd04b8e94b2b6a1646a6785/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A series of intense Israeli airstrikes shook Yemen's rebel-held capital and a port city early Thursday and killed at least nine people, officials said, shortly after a Houthi missile targeted central Israel.",
      "publishedAt": "2024-12-19T01:54:11Z",
      "title": "Israeli airstrikes hit Yemen's rebel-held capital and port city after Houthi attack targets Israel",
      "url": "https://apnews.com/8f73755ccc47a34261cc041658403b4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf6bcc707652489d9de606e628f6f956/1920.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "MAJDAL SHAMS, Golan Heights (AP) — The four sisters gathered by the side of the road, craning their necks to peer far beyond the razor wire-reinforced fence snaking across the mountain. One took off her jacket and waved it slowly above her head.",
      "publishedAt": "2024-12-19T05:13:01Z",
      "title": "Separated for decades, Assad's fall spurs hope for families split by Golan Heights buffer zone",
      "url": "https://apnews.com/59ed4baf194aec54e1209b5349c4f244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d33877d3f051489c9b72acc7ea41e37f/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump delivered a likely death blow to bipartisan congressional budget negotiations on Wednesday, rejecting the measure as full of giveaways to Democrats after billionaire ally Elon Musk whipped up outrage toward the bill and cheered on Republican lawmakers who announced their opposition.",
      "publishedAt": "2024-12-18T22:57:41Z",
      "title": "Trump brings chaos back to Washington by attempting to kill bipartisan budget deal with Musk's help",
      "url": "https://apnews.com/5dc9fd8672f9807189032811d4ab0528",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d7f96feb85442da86adc0415f0bbef6/3000.jpeg"
    },
    {
      "author": "TODD RICHMOND, SCOTT BAUER and RYAN J. FOLEY",
      "description": "MADISON, Wis. (AP) — The shooter who killed a student and teacher at a religious school in Wisconsin brought two guns to the school and was in contact with a man in California whom authorities say was planning to attack a government building, according to authorities and court documents that became public Wednesday.",
      "publishedAt": "2024-12-18T18:47:02Z",
      "title": "Wisconsin school shooter had 2 guns and got messages from man accused of plotting his own attack",
      "url": "https://apnews.com/62313e9e9d20f3ed59fcf8d2c7fc3b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378f7cf32b794b40965ce1b8fb40e8a6/1920.jpeg"
    },
    {
      "author": "MARK SCOLFORO and MICHAEL R. SISAK",
      "description": "HOLLIDAYSBURG, Pa. (AP) — The suspect charged with shooting to death a health insurance company chief executive on a Manhattan street will be taken Thursday morning to hearings on related Pennsylvania criminal charges and efforts to extradite him to New York.",
      "publishedAt": "2024-12-19T06:07:46Z",
      "title": "Man accused in UnitedHealthcare CEO killing expected to appear at hearing on extradition to New York",
      "url": "https://apnews.com/d6575764b6f4c58108e505e6e5ea896d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72eefcdb17f548b0b8dc055e5e3fa660/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and SYLVIE CORBET",
      "description": "MAMOUDZOU, Mayotte (AP) — France's President Emmanuel Macron traveled Thursday to the Indian Ocean archipelago of Mayotte to survey the devastation that Cyclone Chido wrought across the French territory as thousands of people tried cope without the bare essentials such as water or electricity.",
      "publishedAt": "2024-12-19T08:03:45Z",
      "title": "France's Macron visits cyclone-wrecked Mayotte as residents urge for water, food and other aid",
      "url": "https://apnews.com/604d543a8f020719b3ce5cec320c86fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac16752319a448e1969622267fd54feb/1920.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — Amid the havoc wrought by a violent earthquake two days earlier, Ivan Oswald and his staff at Nambawan Cafe on an idyllic stretch of Vanuatu’s waterfront prepared on Thursday for lunchtime service.",
      "publishedAt": "2024-12-19T05:58:03Z",
      "title": "Number of dead and missing still unclear as first aid arrives in quake-hit Pacific nation of Vanuatu",
      "url": "https://apnews.com/1a4ce87db29567875d148a46edbce671",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28fb5daf75e64543a56231dd50640bf7/2000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "TOPEKA, Kan. (AP) — A Kansas official who is an informal adviser to President-elect Donald Trump's transition team on immigration issues doesn't expect mass deportations to prompt arrests of migrants at sensitive locations such as schools and churches.",
      "publishedAt": "2024-12-19T05:02:09Z",
      "title": "A key Trump ally on immigration explains how mass deportations could work",
      "url": "https://apnews.com/1918efac421cf5772a932917757a4642",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b96740a9a23e4888b3413437f68cfdd0/2983.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "The International Brotherhood of Teamsters said workers at seven Amazon facilities will begin a strike on Thursday morning, an effort by the union to pressure the e-commerce company for a labor agreement during a key shopping period.",
      "publishedAt": "2024-12-19T06:55:43Z",
      "title": "Teamsters say Amazon workers will strike at multiple facilities as union seeks labor contract",
      "url": "https://apnews.com/1ea28e27bc3ddd88d9f0c7c53f798d1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb5d0bb242c14516bb31a513596c403e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}