{
  "articles": [
    {
      "author": "MARK VANCLEAVE and VALERIE GONZALEZ",
      "description": "MATAGORDA, Texas (AP) — Beryl began lashing Texas with rain and intensifying winds Sunday as coastal residents boarded up windows, left beach towns under evacuation orders and prepared for the powerful storm that has already cut a deadly path through parts of Mexico and the Caribbean.",
      "publishedAt": "2024-07-07T04:06:37Z",
      "title": "Texas coastal residents told to expect power outages, flooding as Beryl moves closer to landfall",
      "url": "https://apnews.com/a01a44797f9de77a54b3a8be454ea37f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fd859c9319541389ea860e7195580c1/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER and MARGERY A. BECK",
      "description": "LOS ANGELES (AP) — A long-running heat wave that has already shattered previous records across the U.S. persisted on Sunday, baking parts of the West with dangerous temperatures that caused the death of a motorcyclist in Death Valley and held the East in its hot and humid grip.",
      "publishedAt": "2024-07-07T04:24:47Z",
      "title": "Persistent heat wave in the US shatters new records, causes deaths in the West and grips the East",
      "url": "https://apnews.com/f64b0459aaf83e0a4a12ab6d5e626bb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/245f0c14f0cb40738ca714eb7001417a/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER, LORI HINNANT and SYLVIE CORBET",
      "description": "PARIS (AP) — A coalition of the French left won the most seats in high-stakes legislative elections, according to final results early Monday, beating back a far-right surge but failing to win a majority.",
      "publishedAt": "2024-07-07T04:00:38Z",
      "title": "French vote gives leftists most seats over far right, but leaves hung parliament and deadlock",
      "url": "https://apnews.com/08f10a7416a2494c85dcd562f33401d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/035125aa42724c46973b9d3e4cfea3f8/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, WILL WEISSERT, MARC LEVY and LISA MASCARO",
      "description": "HARRISBURG, Pa. (AP) — President Joe Biden urged his supporters to stay unified during a series of Sunday stops in critical Pennsylvania on Sunday, even as some leading congressional Democrats privately suggested it was time for him to abandon his reelection bid because of intensifying questions about whether he's fit for another term.",
      "publishedAt": "2024-07-07T14:45:53Z",
      "title": "While Biden campaigns in Pennsylvania, some Democratic leaders in the House say he should step aside",
      "url": "https://apnews.com/77b050b1c5c39aec2ef633281d082566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d0b01b72b084d75845c82bdb2f4a39a/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Growing skepticism about President Joe Biden's reelection chances has European leaders heading to the NATO summit in Washington confronting the prospect that the military alliance's most prominent critic, Donald Trump, may return to power over its mightiest military.",
      "publishedAt": "2024-07-07T11:03:34Z",
      "title": "Can you 'Trump-proof' NATO? As Biden falters, Europeans look to safeguard the military alliance",
      "url": "https://apnews.com/e45273ef1bd408d72245f8f7fd1ec5c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8eefcce104d4f15a01443b64580d9ea/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a cease-fire to bring back scores of hostages held by Hamas.",
      "publishedAt": "2024-07-07T09:41:42Z",
      "title": "Israeli protesters block highways, call for cease-fire to return hostages 9 months into war in Gaza",
      "url": "https://apnews.com/d78b75084f38c98e219e64db588374b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b49b4943663e48a5ad0e89721c64d3a9/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BUENOS AIRES, Argentina (AP) — Given the choice between a far-right convention to bash his enemies and a presidential summit to discuss regional trade policy, Argentine President Javier Milei preferred the stadium packed with cheering fans.",
      "publishedAt": "2024-07-07T13:14:15Z",
      "title": "Argentine President Milei heads to CPAC in Brazil, snubbing Lula and escalating a political feud",
      "url": "https://apnews.com/f00671ad568ff18f4b158a5530b8cc29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a015b96686144da389ca118bc9b3c6de/3000.jpeg"
    },
    {
      "author": "KEVIN McGILL",
      "description": "NEW ORLEANS (AP) — A federal appeals court in New Orleans is taking another look at its own order requiring a Texas county to keep eight books on public library shelves that deal with subjects including sex, gender identity and racism.",
      "publishedAt": "2024-07-07T18:11:47Z",
      "title": "A US appeals court will review its prior order keeping banned books on shelves in a Texas county",
      "url": "https://apnews.com/e3ed2b8e11ce7ca090463b5bd3a6dfc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a2c7b8f0ef44daf95146068acc14228/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — British Prime Minister Keir Starmer is seeking to reset relations at home and abroad.",
      "publishedAt": "2024-07-07T12:00:02Z",
      "title": "New British prime minister seeks to improve on 'botched' trade deal with European Union",
      "url": "https://apnews.com/5d0b0111764809f98708c63cb16c94cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d379205400442649554bed235924f99/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — After a historically bad first half of the year, the box office is suddenly booming.“Despicable Me 4,” the Illumination Animation sequel, led the way over the holiday weekend with $75 million in ticket sales Friday through Sunday and $122.6 million since opening on Wednesday, according to studio estimates Sunday.",
      "publishedAt": "2024-07-07T17:25:34Z",
      "title": "‘Despicable Me 4’ debuts with $122.6M as boom times return to the box office",
      "url": "https://apnews.com/728266e7177d23a0732c46d084f521f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9774635ad4b4b1fb80bc08cc8ce9295/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}