{
  "articles": [
    {
      "author": "TERRY SPENCER",
      "description": "PERRY, Fla. (AP) — Tropical Storm Idalia descended on the Carolinas on its way out to the Atlantic Ocean on Thursday, leaving a trail of flooding and destruction throughout the Southeast that stretched back to its landfall as a hurricane in Florida.",
      "publishedAt": "2023-08-31T05:54:09Z",
      "title": "Tropical Storm Idalia descends on North Carolina after pounding Florida, Georgia and South Carolina",
      "url": "https://apnews.com/6fcf457b3c1da43c208730bb998cdd0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78967eb74d704513add78c154acf4ac0/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — A nighttime fire ripped through a rundown five-story building in Johannesburg that was occupied by homeless people and squatters, leaving at least 73 people dead early Thursday, emergency services in South Africa's biggest city said.",
      "publishedAt": "2023-08-31T05:23:04Z",
      "title": "A building fire in Johannesburg leaves at least 73 dead, many of them homeless, authorities say",
      "url": "https://apnews.com/a365fc66541584e61ec5cd3e7b375e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7309567f094e42218e2ede07262bcaac/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "As former President Donald Trump dominates the Republican presidential primary, some liberal groups and legal experts contend that a rarely used clause of the Constitution prevents him from being president after the Jan.",
      "publishedAt": "2023-08-31T04:05:12Z",
      "title": "Liberal groups seek to use the Constitution's insurrection clause to block Trump from 2024 ballots",
      "url": "https://apnews.com/9c5f79203109ba221b35a48e708ad725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4553602e05a41858e2f7907b166cce6/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — The National Weather Service on Wednesday warned gusty winds and low humidity have increased the risk that fires could spread rapidly in the western parts of each Hawaiian island, three weeks after a deadly blaze tore through a coastal Maui town during a similar alert.",
      "publishedAt": "2023-08-31T03:01:28Z",
      "title": "Forecasters are warning gusty winds and low humidity raise risk of fires spreading rapidly in Hawaii",
      "url": "https://apnews.com/4dfee66d3185b1a1f7ea5a946bce9eb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/231c5b14f22b48daa11a85e43f646287/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "Before the fatal shootings of three Black residents in Jacksonville, Florida, over the weekend, the gunman, a young white man with swastikas painted on his rifle, pulled into a parking lot at Edward Waters University and began putting on tactical gear.",
      "publishedAt": "2023-08-31T04:03:47Z",
      "title": "After Jacksonville shootings, historically Black colleges address security concerns, remain vigilant",
      "url": "https://apnews.com/6aa28d01fe5086b1dfdf5df2e72c2e35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f419de6bd8ab46a394d03a31b4a230f1/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "DAKAR, Senegal (AP) — The ouster of Gabon's president by mutinous soldiers appears to have been well organized and capitalized on the population's grievances against the government as an excuse to seize power, analysts said.",
      "publishedAt": "2023-08-31T07:11:05Z",
      "title": "Gabon election results were a 'smokescreen' for soldiers to oust unpopular president, analysts say",
      "url": "https://apnews.com/bf34a2f16ab2a3a406270b3a735ef78f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1ead7837aac41c4bc0f579eebe2bc85/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — With the walls stripped bare and furniture dismantled, the east Jerusalem apartment is a far cry from the vividly-hued haven it was in early February, when members of the Zalabani family played cards on the cobalt couch and feasted on stewed chicken with richly spiced rice.",
      "publishedAt": "2023-08-31T10:12:07Z",
      "title": "As Israel pushes punitive demolitions, family of 13-year-old Palestinian attacker to lose its home",
      "url": "https://apnews.com/b05977502bc2c40e61eb68ab733653b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c15e21b9e3434114bed636b35a6889a9/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Groceries stashed in the back of an electric delivery scooter are an increasingly familiar sight in the Indian city of Bengaluru. In crowded markets, electric rickshaws drop off and pick up passengers.",
      "publishedAt": "2023-08-31T01:49:20Z",
      "title": "India is one of the world's fastest-growing EV markets. This is why",
      "url": "https://apnews.com/55e7ed315fc41d0ba56461386ad44a4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f25be97c0144bc3a896b7b8b4219ca1/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "PHOENIX (AP) — Andrea Nissen is trying to prepare her 65-year-old husband, who has Alzheimer’s disease, for a solo flight from Arizona to Oklahoma to visit family. She worries about travelers and airport officials misinterpreting his forgetfulness or habit of getting in people's personal space, and feels guilty about not being able to accompany him.",
      "publishedAt": "2023-08-31T04:31:15Z",
      "title": "Some US airports strive to make flying more inclusive for those with dementia",
      "url": "https://apnews.com/1a69e61fbec6e5a98bcf8a60d50aa840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66cfc162036c4a5786e850fad7aab123/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK and MATT O'BRIEN",
      "description": "NEW YORK (AP) — Kelly McKernan’s acrylic and watercolor paintings are bold and vibrant, often featuring feminine figures rendered in bright greens, blues, pinks and purples. The style, in the artist’s words, is “surreal, ethereal … dealing with discomfort in the human journey.”",
      "publishedAt": "2023-08-31T05:49:33Z",
      "title": "Visual artists fight back against AI companies for repurposing their work",
      "url": "https://apnews.com/7ebcb6e6ddca3f165a3065c70ce85904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be7105f01d3f40ffaab5137660c5699b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}