{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — The Army veteran who drove a pickup truck into a crowd of New Year’s revelers in New Orleans acted alone, the FBI said Thursday, reversing its position from a day earlier that he likely worked with others in the deadly attack that officials said was inspired by the Islamic State group.",
      "publishedAt": "2025-01-02T05:21:00Z",
      "title": "FBI says driver in New Orleans rampage acted alone, was '100%' inspired by Islamic State group",
      "url": "https://apnews.com/5bbf5fdc715c4d0d4c8764dd8da22720",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde6b90ab8704921812dd206154a02dd/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — The FBI now says the New Orleans truck attacker acted alone in an “act of terrorism” when he drove a pickup truck into a crowd of New Year’s revelers early Wednesday, killing 14 people.",
      "publishedAt": "2025-01-02T13:32:37Z",
      "title": "The Latest: The FBI now says the New Orleans truck attacker acted alone in an 'act of terrorism'",
      "url": "https://apnews.com/979e26706ecd35aba6bc60379263c15c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e04adf45836c4184ac5d3bb042954b80/1920.jpeg"
    },
    {
      "author": "TARA COPP, ALANNA DURKIN RICHER, COLLEEN LONG and TY ONEIL",
      "description": "LAS VEGAS (AP) — The highly decorated Army soldier inside a Tesla Cybertruck packed with fireworks that exploded outside Trump International Hotel in Las Vegas shot himself in the head just before detonation, authorities said Thursday.",
      "publishedAt": "2025-01-02T15:38:48Z",
      "title": "Soldier shot self in head before Cybertruck exploded outside Trump's Las Vegas hotel, officials say",
      "url": "https://apnews.com/5c5a8fd13a50e2bcde46370ae926d427",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f56797794064e0c870776b3d49ed9fb/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Two deadly incidents on New Year's Day — an attack being investigated as an act of terrorism in New Orleans and an explosion of a Tesla Cybertruck in Las Vegas — both involved vehicles that were rented on Turo, a peer-to-peer car sharing company.",
      "publishedAt": "2025-01-02T19:55:13Z",
      "title": "Turo-rented cars were involved in 2 deadly incidents this New Year's. Here's what we know",
      "url": "https://apnews.com/1a8d5f5bb8dcdeed32e17a5efe4296af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04254d591e8e47098a9c3a080cf409e1/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s anti-corruption agency on Friday dispatched investigators to execute a warrant to detain impeached President Yoon Suk Yeol over his short-lived martial law decree last month, as hundreds of his supporters gathered at his residence in Seoul, vowing to block their approach.",
      "publishedAt": "2025-01-02T04:02:34Z",
      "title": "South Korean investigators head to Seoul in attempt to detain impeached President Yoon Suk Yeol",
      "url": "https://apnews.com/1779809dc6b2c7e5a9478bac17ca7585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10db29dfcdc64032a3d4345cf026bc7c/1920.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — A worker digging up clay in a southern England limestone quarry noticed unusual bumps that led to the discovery of a “dinosaur highway” and nearly 200 tracks that date back 166 million years, researchers said Thursday.",
      "publishedAt": "2025-01-02T15:17:51Z",
      "title": "'Dinosaur highway' tracks dating back 166 million years are discovered in England",
      "url": "https://apnews.com/9fd0499419db0950099e6413a1936488",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66eda2f228a64f859030264d5e8069da/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Say hello to the latest dog in the American Kennel Club's lineup of recognized breeds.",
      "publishedAt": "2025-01-02T13:03:15Z",
      "title": "Meet the Danish-Swedish farmdog, the newest breed in the American Kennel Club's lineup",
      "url": "https://apnews.com/8e238bb973e47cafd3de303a45a3c2aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb98890ca48f4392972570701d4fbe72/3000.jpeg"
    },
    {
      "author": "BRETT MARTEL",
      "description": "NEW ORLEANS (AP) — Ticketed fans in Georgia and Notre Dame gear packed a plaza adjacent to the Superdome, enjoyed music under clear skies — and under the watch of snipers on rooftops — before filtering into the stadium for Thursday afternoon's College Football Playoff quarterfinal at the Sugar Bowl.",
      "publishedAt": "2025-01-02T17:59:23Z",
      "title": "Superdome re-opens from lockdown for the Sugar Bowl CFP quarterfinal between Georgia and Notre Dame",
      "url": "https://apnews.com/d6142ce05560f597c65dd99846e8ac4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d673a877b7c44f728c0e32297f269366/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Jenniffer González Colón was sworn in Thursday as Puerto Rico’s new governor during a normally ebullient ceremony held amid widespread anger over a blackout that hit the U.S.",
      "publishedAt": "2025-01-02T13:22:27Z",
      "title": "Puerto Rico's new governor sworn in days after a major blackout left much of the island in the dark",
      "url": "https://apnews.com/84afbbfa537b23f35494df0127b20c2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f671362b2fca4f3ead73a08229b5a62b/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and BERNARD CONDON",
      "description": "DETROIT (AP) — Tesla posted its first annual sales drop in more than a dozen years Thursday, undercutting a stock that has soared since Donald Trump’s victory on optimism Elon Musk’s close relationship to the president-elect will help the company.",
      "publishedAt": "2025-01-02T14:24:21Z",
      "title": "Tesla sales dropped 1.1% in 2024, its first annual decline in a dozen years",
      "url": "https://apnews.com/69af17c4e606625694af8293db25b2f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ca5d4eb019472ba63699f6f74dbb84/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}