{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER, JON GAMBRELL and LUJAIN JO",
      "description": "WASHINGTON (AP) — Americans detained for years in Iran arrived home Tuesday, tearfully hugged their loved ones and declared “Freedom!” after being let go as part of a politically risky deal that saw President Joe Biden agree to the release of nearly $6 billion in frozen Iranian assets.",
      "publishedAt": "2023-09-19T10:47:46Z",
      "title": "Americans released by Iran arrive home, tearfully embrace their loved ones and declare: 'Freedom!'",
      "url": "https://apnews.com/b9c2ec8209117d28f87074a6402ffef1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e49fd5a273a4fb1aa54c6af099c935d/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Hunter Biden has gone on the offensive against his Republican critics, arguing in a new lawsuit that although he is the son of the president of the United States, he shouldn't be treated differently than any other American.",
      "publishedAt": "2023-09-19T04:22:27Z",
      "title": "Hunter Biden has gone on the offensive against Republicans. That could be tricky for the president",
      "url": "https://apnews.com/69cc61586da9f624375e25b0c00c74f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63e4af59d3be470aba30c45f4f497c74/2160.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ROB GILLIES",
      "description": "NEW DELHI (AP) — India expelled a senior Canadian diplomat on Tuesday and accused Canada of interfering in its internal affairs, ramping up a confrontation between the two countries over accusations that the Indian government may have been involved in the killing of a Sikh activist.",
      "publishedAt": "2023-09-19T03:23:54Z",
      "title": "Modi government expels a Canadian diplomat after Trudeau says India was involved in Sikh's killing",
      "url": "https://apnews.com/3c5572d9027769ea6adbd047ec6f462a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4028f5e2d4144d191168ea29a394204/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy's visit to Washington this week comes at a critical juncture for his alliance with the United States as Republican leaders in Congress diverge on how to send more military and humanitarian aid to the country.",
      "publishedAt": "2023-09-19T04:16:12Z",
      "title": "Political divide emerges on Ukraine aid package as Zelenskyy heads to Washington",
      "url": "https://apnews.com/9bced4d9a8c16ae5bf148f640b6f2c31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab638f4dd76b49098691e4118095e622/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "NEW YORK (AP) — President Joe Biden will use his annual address before the U.N.",
      "publishedAt": "2023-09-19T09:02:34Z",
      "title": "At UN, Biden looks to send message to world leaders - and voters - about leadership under his watch",
      "url": "https://apnews.com/04b25cd42d03caf194def2862f6eb8d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5290043900e4b43b07253b214464d9b/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LINLEY SANDERS",
      "description": "NEW YORK (AP) — As President Joe Biden prepares to meet Israeli Prime Minister Benjamin Netanyahu this week in New York, a new poll finds that while Americans generally view Israel as a partner or ally, many question whether his far-right government shares American values.",
      "publishedAt": "2023-09-19T04:14:23Z",
      "title": "Most Americans view Israel as a partner, but fewer see it as sharing US values, AP-NORC poll shows",
      "url": "https://apnews.com/41ba5cb189185f3e4956f4465c00999f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca190fcc38145c7a10a6c7eccdc1ea3/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Evan Gershkovich, a Wall Street Journal reporter who was detained on espionage charges, appeared in a Moscow court Tuesday to appeal his arrest. The 31-year-old United States citizen was arrested in the city of Yekaterinburg while on a reporting trip to Russia in late March.",
      "publishedAt": "2023-09-19T11:29:21Z",
      "title": "Jailed Wall Street Journal reporter Evan Gershkovich appears at a Moscow court to appeal his arrest",
      "url": "https://apnews.com/f3e0835eed2e4c795bd5dabbfe705e71",
      "urlToImage": ""
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The classified documents indictment of Donald Trump would seem, on paper at least, to be the most straightforward of the four criminal cases the former president is facing.",
      "publishedAt": "2023-09-19T04:18:16Z",
      "title": "Florida jury pool could give Trump an advantage in classified documents case",
      "url": "https://apnews.com/68155de474a855cd37e2a5c27ce55cbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77903ab20b174109bbab33a370099692/3000.jpeg"
    },
    {
      "author": null,
      "description": "DERNA, Libya (AP) — The prime minister of Libya's eastern administration said Tuesday that authorities have divided the flood-stricken city of Derna into four sections to create buffers in case of disease outbreaks, a day after thousands of angry protesters demanded the city's rapid reconstruction.",
      "publishedAt": "2023-09-19T09:39:48Z",
      "title": "Libyan leader says flooded city has been divided to create buffers in case of disease outbreaks",
      "url": "https://apnews.com/4cc0651feafb96b3f939b76f402a9bf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae9fc27c3d7a43e7a27ce5d9c04479be/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PITTSBURGH (AP) — T.J. Watt and Alex Highsmith knew what was coming. Maybe the Cleveland Browns should have, too. It's the same thing that always seems to be coming when they visit Pittsburgh in the regular season.",
      "publishedAt": "2023-09-19T04:00:30Z",
      "title": "T.J. Watt's scoop-and-score lifts Steelers past Browns 26-22 as Cleveland loses Nick Chubb to injury",
      "url": "https://apnews.com/7749ef8a1ebd066430308f87b1cb9669",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b6119f4f4d14771a8fcd60bf8581e24/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}