{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike on a hospital courtyard in the Gaza Strip early Monday killed at least four people and triggered a fire that swept through a tent camp for people displaced by the war, leaving more than two dozen with severe burns, according to Palestinian medics.",
      "publishedAt": "2024-10-14T06:30:26Z",
      "title": "Israeli strike on hospital tent camp kills 4 and ignites a fire that burns dozens",
      "url": "https://apnews.com/70c8cf5a93eec9ea643a5fda5670da93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ec8cdbf00804c40820ad2e495a56096/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu is examining a plan to seal off humanitarian aid to northern Gaza in an attempt to starve out Hamas militants, a plan that, if implemented, could trap without food or water hundreds of thousands of Palestinians unwilling or unable to leave their homes.",
      "publishedAt": "2024-10-13T13:46:33Z",
      "title": "Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside",
      "url": "https://apnews.com/219d7eb9a3050e281ccc032d5a56263c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb132e8f0d734ca19edafb5396f5ddde/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is announcing a plan to give Black men more economic opportunities and other chances to thrive as she works to energize a key voting bloc that has Democrats concerned about a lack of enthusiasm.",
      "publishedAt": "2024-10-14T09:01:09Z",
      "title": "Harris is laying out a new plan to empower Black men as she tries to energize them to vote for her",
      "url": "https://apnews.com/67ac83899af785cf4d8788b9fcdeb592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a70c2a9abbc547c7b9f0ae6df9ea7775/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The indictment charging Donald Trump with hoarding classified documents leveled one jaw-dropping allegation after another, including that he showed off a secret Pentagon attack plan to guests at his golf club and suggested his lawyer mislead the FBI about the presence of the White House records.",
      "publishedAt": "2024-10-14T04:12:04Z",
      "title": "This could have been a year of a federal court reckoning for Trump. Judges had other ideas",
      "url": "https://apnews.com/302f87960dbd84d7be5daedaf03328d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f6ba2041d54d82812e8270940f33a2/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and LAURA BARGFELD",
      "description": "TAMPA, Fla. (AP) — When ankle-deep floodwaters from Hurricane Helene bubbled up through the floors of their home, Kat Robinson-Malone and her husband sent a late-night text message to their neighbors two doors down: “Hey, we're coming.”",
      "publishedAt": "2024-10-13T04:01:54Z",
      "title": "Florida neighbors band together to recover after one-two punch from hurricanes Helene and Milton",
      "url": "https://apnews.com/a39b7a04052e9cd9d0d8598d090ea54b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbbf443d7b0d4110bf93f903717ff8dc/1920.jpeg"
    },
    {
      "author": "JOHNSON LAI and HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — China employed a record 125 aircraft, as well as its Liaoning aircraft carrier and ships, in large-scale military exercises surrounding Taiwan and its outlying islands Monday, simulating the sealing off of key ports in a move that underscores the tense situation in the Taiwan Strait, officials said.",
      "publishedAt": "2024-10-14T01:15:45Z",
      "title": "China deploys record 125 warplanes in large scale military drill in warning to Taiwan",
      "url": "https://apnews.com/053fbadaf1125be4adfee7a7e6d1ce79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c24c0685b394e7a97192ae32b60942d/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Asian American, Native Hawaiian and Pacific Islander adults are more likely than the overall U.S. population to view legal immigration as an asset to the country's economy and workforce, according to a new poll.",
      "publishedAt": "2024-10-14T04:20:55Z",
      "title": "Most AAPI adults think legal immigrants give the US a major economic boost: AP-NORC/AAPI Data poll",
      "url": "https://apnews.com/3ea9472f4742e15e3979c38c68c1e59c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8406929048a24831abd2e6a7f61b3ac6/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and MIKE CORDER",
      "description": "STOCKHOLM (AP) — The Nobel memorial prize in economics was awarded Monday to Daron Acemoglu, Simon Johnson and James A. Robinson for research that explains why societies with poor rule of law and exploitative institutions do not generate sustainable growth.",
      "publishedAt": "2024-10-14T08:25:46Z",
      "title": "Nobel economics prize is awarded for research into how poor institutions affect countries' success",
      "url": "https://apnews.com/db3bfe55ac17dd22cf82f1dd637bfa94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6fbe5dbf1324710b4093bb5c5981e76/3000.jpeg"
    },
    {
      "author": "YURAS KARMANAU",
      "description": "TALLINN, Estonia (AP) — The last time any of Maria Kolesnikova's family had contact with the imprisoned Belarusian opposition activist was more than 18 months ago. Fellow inmates at the penal colony reported hearing her plead for medical help from inside her tiny and smelly cell.",
      "publishedAt": "2024-10-14T04:09:46Z",
      "title": "Ailing and silenced in prison, Belarus activist symbolizes the nation's repression",
      "url": "https://apnews.com/4c81e46b1ebba8924306c541fb7170db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7224c7ae434343148667e4e1976a67fd/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "As Native Americans across the U.S. come together on Monday for Indigenous Peoples Day to celebrate their history and culture and acknowledge the ongoing challenges they face, many will do so with a focus on the election.",
      "publishedAt": "2024-10-14T04:02:00Z",
      "title": "Indigenous Peoples Day celebrated with an eye on the election",
      "url": "https://apnews.com/fb096986752c2a8f52a805335f2c66ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/200a37bd0c494985ae5dca1a019547ba/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}