{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Forced leaves have begun in Washington and worldwide for most employees of the U.S. Agency for International Development. Under a Trump administration plan, the agency is to be left with fewer than 300 workers out of many thousands. The leaves at USAID started Friday. Federal workers associations have turned to the courts to try to roll back orders dismantling most of the agency and U.S.- funded aid programs around the world. It's not clear whether the reduction to 300 would be permanent or temporary, potentially allowing more workers to return after what Trump administration says is a review of the aid and development programs it wants to resume.",
      "publishedAt": "2025-02-07T13:55:18Z",
      "title": "Forced leaves start for thousands at USAID under a Trump plan to gut the foreign aid agency",
      "url": "https://apnews.com/article/usaid-foreign-aid-trump-rubio-48f8460804d33bdaa18d7765c4b24f9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/75a7e4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F06%2F50d0ce2890d770e8b85e9bdc4574%2F786b30dbc5b847ecadb76eeabd1c5461"
    },
    {
      "author": "BRIAN WITTE",
      "description": "President Donald Trump's administration has ordered all federal departments and agencies to provide lists of employees who are underperforming. The memo was sent Thursday as the administration seeks to shrink the workforce and awaits a court ruling related to its deferred resignation offers. The memo from the Office of Personnel Management directs the agencies to submit names of every employee who has received less than a “fully successful” performance rating in the past three years and to note whether the workers have been on performance plans. That data is due March 7.",
      "publishedAt": "2025-02-07T19:28:18Z",
      "title": "Trump administration orders federal agencies to provide lists of underperforming employees",
      "url": "https://apnews.com/article/trump-federal-employees-lists-underperforming-layoffs-80755cea03a93c2b6d00e21fb1716e39",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbb2cf5/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fec%2F178b4c0d051974fce9dff2f7a659%2F585af19ec9bd411d9e73456def55cf32"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump says he is firing members of the board of trustees for the Kennedy Center and naming himself chairman. He also indicated that he will use the post to dictate programming at one of the nation’s premier cultural institutions. He wrote on social media Friday that “At my direction, we are going to make the Kennedy Center in Washington D.C., GREAT AGAIN.\" He says the current chairman, philanthropist David Rubenstein, is among those who “do not share our Vision for a Golden Age in Arts and Culture.” He says, \"We will soon announce a new Board, with an amazing Chairman, DONALD J. TRUMP!”",
      "publishedAt": "2025-02-08T01:05:38Z",
      "title": "Trump says he's firing Kennedy Center board of trustees members and naming himself chairman",
      "url": "https://apnews.com/article/trump-kennedy-center-board-chairman-firings-21cd0018c6e9f591d59becea8573d8c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/75c2420/2147483647/strip/true/crop/6346x3570+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2Fd4%2F3c18df4b93fca18c175134352641%2Ffc65af1e402147e7ba238259136dc7e7"
    },
    {
      "author": "BECKY BOHRER, GENE JOHNSON",
      "description": "Authorities say a single-engine plane flying over water in Alaska just south of the Arctic Circle with 10 people on board experienced a sudden loss in elevation and speed just before its signal was lost. U.S. Coast Guard Lt. Benjamin McIntyre-Coble also said that at least one of the searchers scouring miles of frozen tundra and flying over icy seas had found “some sort of item of interest” on Friday afternoon, but did not provide more specifics. Authorities said all 10 on board were adults and that the flight was a regularly scheduled commuter trip.",
      "publishedAt": "2025-02-07T05:15:21Z",
      "title": "Missing plane in Alaska had sudden drop in elevation and speed before signal lost, Coast Guard says",
      "url": "https://apnews.com/article/missing-aircraft-alaska-search-10-people-eb496188285ed54c9a527f658d4ff70a",
      "urlToImage": "https://dims.apnews.com/dims4/default/575eb34/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fed%2F21f0ac7c3704d4b904e46a397cdd%2F54be0cc45e2f48f0a8869e13ce1f3440"
    },
    {
      "author": "JIM MORRIS",
      "description": "Prime Minister Justin Trudeau says President Donald Trump’s talk of making Canada the 51st state is “a real thing” and is linked to the country’s rich natural resources. Trudeau’s comments to business and labor leaders in a closed-door session were mistakenly carried by a loudspeaker, Canada’s public broadcaster CBC reported. “Mr. Trump has it in mind that the easiest way to do it is absorbing our country and it is a real thing. In my conversations with him on…,” Trudeau said before the microphone cut out, according to CBC. Trudeau’s office did not immediately respond to a request for comment.",
      "publishedAt": "2025-02-07T19:50:08Z",
      "title": "Justin Trudeau reportedly says Trump’s talk of making Canada a US state is 'a real thing'",
      "url": "https://apnews.com/article/canada-us-tariffs-trudeau-trump-5cfe160c66f90b973d90ea7810cddbe5",
      "urlToImage": "https://dims.apnews.com/dims4/default/acf6eba/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fe1%2F37561cc2ccf5775b00bf5d7bb918%2F64f7f478ca1340d8846a437ce3a2c8c0"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "Hamas identified the three Israeli hostages that it plans to free in the next release mandated by the fragile ceasefire agreement, a sign the deal was moving forward Friday even as U.S. and Israeli officials continued calls to relocate Gaza’s population after the war. Israel is to release 183 Palestinian prisoners on Saturday to fulfill its side of the agreement, according to the Hamas-linked prisoners’ office in Gaza. Details came as U.S. President Donald Trump talked up his widely criticized proposal to move all Palestinians from Gaza. Trump characterized the plan as a simple “real estate transaction,” claiming it “had been very well received,” though it has been roundly rejected by the region’s Arab governments and by Palestinians themselves.",
      "publishedAt": "2025-02-07T21:12:33Z",
      "title": "Hamas names 3 more Israeli hostages to be freed as ceasefire deal stays on track",
      "url": "https://apnews.com/article/israel-hamas-gaza-war-ceasefire-hostages-02-07-2025-9e32d4507fc402e79c063b7708df439d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d32978d/2147483647/strip/true/crop/1778x1000+111+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fd6%2Fc4f0d0ec5734addfba95ebd62a72%2F1f3426847e564f66a450d3d1b24572e1"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "President Donald Trump’s administration is using federal prisons to detain some people arrested in its immigration crackdown. The federal Bureau of Prisons confirmed the move Friday in a statement to The Associated Press. It's a return to a detention strategy that drew allegations of mistreatment during Trump’s first term. In a statement to AP, the prison agency said it is assisting U.S. Immigration and Customs Enforcement “by housing detainees and will continue to support our law enforcement partners to fulfill the administration’s policy objectives.” The Bureau of Prisons has declined to say how many immigration detainees it is accepting, or which prison facilities are being used.",
      "publishedAt": "2025-02-07T16:55:19Z",
      "title": "Federal prisons being used to detain people arrested in Trump’s immigration crackdown",
      "url": "https://apnews.com/article/immigration-federal-prisons-trump-25d676a6ebbff139ae04a75cd91be7e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec41fe5/2147483647/strip/true/crop/3781x2127+0+129/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Fcc%2Febf529431053694e3b0672db6ad9%2F21d3908339a9418083082c95392e4be1"
    },
    {
      "author": "AAMER MADHANI, MARI YAMAGUCHI",
      "description": "President Donald Trump plans to cover a range of issues in his meeting with Japanese Prime Minister Shigeru Ishiba. He wants to talk about joint training exercises, Japanese investment in the U.S. economy, improving cyber security, increasing space cooperation, and promoting joint business opportunities to develop critical technologies. Ishiba, for his part, will look to remind Trump about the long-running U.S.-Japan alliance. Japanese companies employ nearly 1 million Americans and have held the top spot for cumulative foreign direct investment into the U.S. over the last five years. Ishiba arrived at the White House around midday on Friday and he and Trump are holding their first face-to-face talks.",
      "publishedAt": "2025-02-07T12:03:07Z",
      "title": "Japan's Ishiba makes a whirlwind Washington trip to try to forge a personal connection with Trump",
      "url": "https://apnews.com/article/trump-ishiba-us-japan-cd84a0e7306ab4b8b7e03bc8b76aa06c",
      "urlToImage": "https://dims.apnews.com/dims4/default/892c2c7/2147483647/strip/true/crop/5502x3095+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fa5%2F15535aa6353a940e3ed516bc6340%2Fb2c2dc7635d04d44b87afb8fedb373da"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "Nineteen Democratic attorneys general have sued President Donald Trump to stop Elon Musk’s Department of Government Efficiency from accessing Treasury Department records that contain sensitive personal data such as Social Security and bank account numbers for millions of Americans. The suit was filed Friday in federal court in New York City. It alleges that the Trump administration allowed Musk’s team access to the Treasury Department’s central payment system in violation of federal law. The payment system handles tax refunds, Social Security benefits, veterans’ benefits and more. It sends out trillions of dollars every year while containing an expansive network of Americans’ personal and financial data.",
      "publishedAt": "2025-02-08T00:06:40Z",
      "title": "19 states sue to stop DOGE from accessing Americans' personal data",
      "url": "https://apnews.com/article/elon-musk-doge-lawsuit-attorneys-general-5733f8985e4cf7ad5b233fddefef4d01",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b5d9bd/2147483647/strip/true/crop/5652x3179+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F7d%2F2f6dfa75e820e887756123a5e9f0%2Ff628a3db342e445b98c6f04b3f277d40"
    },
    {
      "author": "MATT O'BRIEN, BERNARD CONDON",
      "description": "When Elon Musk bought Twitter in 2022, he laid off thousands of employees, stopped paying rent and auctioned off coffee makers and office chairs in hopes of a big turnaround. Now the world’s richest man has brought the same slash-and-burn strategy to the federal government. Some people who experienced Musk’s takeover at Twitter have a warning: Expect chaos, cuts driven by ideology as much as by cost concerns, intimidation and plenty of lawsuits. Since assuming leadership of the Department of Government Efficiency, Musk has consolidated control over large swaths of the government, sidelined career officials, gained access to sensitive databases and invited a constitutional clash over the limits of presidential authority.",
      "publishedAt": "2025-02-07T15:47:42Z",
      "title": "The slash-and-burn tactics Musk brings to Washington often backfired at Twitter",
      "url": "https://apnews.com/article/elon-musk-twitter-takeover-x-doge-government-efficiency-e78ac431e7bbf2ae8513594078f1408b",
      "urlToImage": "https://dims.apnews.com/dims4/default/435a9b7/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F57%2F23bd03832f6008ed4a976fdb0328%2Fc12e78bcaf4b413ba6ac1612b9a13982"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}