{
  "articles": [
    {
      "author": "CLAIRE RUSH, TY O'NEIL and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Dogs trained to find bodies sniffed through piles of rubble and ash as stunned survivors of deadly wildfires that killed at least 80 people on the Hawaiian island of Maui took stock of their shattered lives and tried to imagine rebuilding from nothing.",
      "publishedAt": "2023-08-12T08:03:35Z",
      "title": "Survivors of the deadly Maui wildfires start returning to ruins. The death toll is likely to rise",
      "url": "https://apnews.com/38ec0d6a5c610035a0a72b804fcdffe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43a2054b84844a8f90cb99a7ad3aa8a6/1920.jpeg"
    },
    {
      "author": "REBECCA BOONE, JENNIFER SINCO KELLEHER and AUDREY MCAVOY",
      "description": "WAILUKU, Hawaii (AP) — In the hours before a wildfire engulfed the town of Lahaina, Maui County officials failed to activate sirens that would have warned the entire population of the approaching flames and instead relied on a series of sometimes confusing social media posts that reached a much smaller audience.",
      "publishedAt": "2023-08-12T06:08:56Z",
      "title": "In deadly Maui wildfires, communication failed. Chaos overtook Lahaina along with the flames",
      "url": "https://apnews.com/f4bb9bb77c093ac8ff16440b54ade4a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd8f0468f053424798452d0fa959e954/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — As he gears up for reelection, President Joe Biden is already facing questions about his ability to convince voters that the economy is performing well.",
      "publishedAt": "2023-08-12T04:26:20Z",
      "title": "Biden's reelection bid faces vulnerabilities in wake of special counsel appointment",
      "url": "https://apnews.com/aa7a608719c0fbcb281408420e4235ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44290ff664f04e6292a0ec1394fd3c6d/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Western-backed maritime forces in the Middle East on Saturday warned shippers traveling through the strategic Strait of Hormuz to stay as far away from Iranian territorial waters as possible to avoid being seized, a stark advisory amid heightened tensions between Iran and the U.S.",
      "publishedAt": "2023-08-12T14:47:41Z",
      "title": "Shippers warned to stay away from Iranian waters over seizure threat as US-Iran tensions high",
      "url": "https://apnews.com/6d33ae164cb5f89a0347634b2ed45ae7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a9d1dd6f7ee434aba709057f8504528/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia thwarted an attack by 20 Ukrainian drones targeting Moscow-annexed Crimea overnight, the Russian Defense Ministry said Saturday.Fourteen drones were shot down by Russian air defenses and a further six were jammed electronically, the ministry said in a Telegram post.",
      "publishedAt": "2023-08-12T08:24:47Z",
      "title": "Russia downs 20 drones over Crimea following a spate of attacks on Moscow",
      "url": "https://apnews.com/de83d603e64ab85e48ae37be27997caf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88874af314cc45119176a4d9b73dbd1c/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Pentagon is developing plans to restructure the National Guard in Washington, D.C., in a move to address problems highlighted by the chaotic response to the Jan.",
      "publishedAt": "2023-08-12T11:19:27Z",
      "title": "The Pentagon plans to shake up DC’s National Guard, criticized for its response to protests, Jan. 6",
      "url": "https://apnews.com/e80e186b33efeff0f38ed19d5951d42e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a17a46e3618490f94655f61738f77cf/3000.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "VAIL, Iowa (AP) — Republican presidential hopeful Vivek Ramaswamy was more than 40 minutes into a town hall in rural Iowa when a woman in the crowd posed a pointed question.",
      "publishedAt": "2023-08-12T04:40:36Z",
      "title": "How Vivek Ramaswamy is pushing — delicately — to win over Trump supporters",
      "url": "https://apnews.com/768b865d113f603a721cb0f7d1e8053a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c74c922f8744f1ebdde1eab784f178c/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "PHILLIPS COMMUNITY, S.C. (AP) — The Rev. Elijah Smalls Jr. once grew okra, butter beans and other vegetables in the neighborhood where his family has lived near the South Carolina coast since not long after the Civil War.",
      "publishedAt": "2023-08-12T05:01:53Z",
      "title": "Developers have Black families fighting to maintain property and history",
      "url": "https://apnews.com/7eeb7b1bcb70e845ffec7eeba23f594b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/273ab82174974ad5833456a9736158dc/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — On and off the big screen, it's Barbie's world and Ken is just living in it.As reflected in Greta Gerwig's blockbuster movie that tackles the legacy Mattel's famous doll, Barbie has always been more popular than Ken.",
      "publishedAt": "2023-08-12T13:07:08Z",
      "title": "He's 'just Ken' but will the 'Barbie' movie change his popularity?",
      "url": "https://apnews.com/3474931ad500b47ecc19a92418fd9368",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d5dd614ebfb4cb899ec9c912d7e23f6/2000.jpeg"
    },
    {
      "author": "JOHN WAWROW",
      "description": "ORCHARD PARK, N.Y. (AP) — Damar Hamlin reached another major milestone in his return to football by suiting up for Buffalo's preseason opener against the Indianapolis Colts on Saturday.",
      "publishedAt": "2023-08-12T10:00:27Z",
      "title": "Damar Hamlin makes an early impact in returning to field in Bills' preseason game against Colts",
      "url": "https://apnews.com/bffe86713152ee00d2e91f78b507a91e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9581fded719e4da8afd2327d8eaf6864/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}