{
  "articles": [
    {
      "author": "Zeke Miller",
      "description": "The White House says guests at President Donald Trump’s address to Congress will include the widow of a slain New York police officer, a Pennsylvania teacher who was detained in Russia and the family of a man killed at Trump’s assassination attempt in Pennsylvania. Trump on Tuesday will give an accounting of his turbulent first weeks in office as a divided nation struggles to keep pace. Some Americans fear for the country’s future after the Republican president’s aggressive early moves, while others cheer him on. Democrats are highlighting the impact of Trump’s actions by inviting as guests fired federal workers and people who’d be harmed by cuts to Medicaid and other programs.",
      "publishedAt": "2025-03-04T05:11:24Z",
      "title": "Trump will stand before Congress and offer divided nation an accounting of his turbulent first weeks",
      "url": "https://apnews.com/article/trump-speech-congress-immigration-tariffs-guests-93f6107ede260854f90c65c4bde60de8",
      "urlToImage": "https://dims.apnews.com/dims4/default/b426a2c/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F95%2F045aec4086a891ea58abaa2a5668%2Fcf7b6a837c814f78acc74f0125803628"
    },
    {
      "author": "Meg Kinnard",
      "description": "President Donald Trump will stand at the front of the U.S. House chamber to address a joint session of Congress, the first of his second term in office. But Tuesday night's address won't be called the State of the Union. The president's first-year speech is called something else: a joint address to Congress. The term has its origins in the first term of President Ronald Reagan. According to the American Presidency Project, the impacts of these first-year speeches should be considered to have the same heft as the State of the Union addresses that follow in subsequent years.",
      "publishedAt": "2025-03-04T05:19:23Z",
      "title": "Why Trump's speech is not called the State of the Union",
      "url": "https://apnews.com/article/why-is-it-not-state-of-union-3bf88c02395141a6d9148a8f7c1e6e78",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6b8fe1/2147483647/strip/true/crop/4762x2679+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F7a%2Fb936eb9d76d676ee4f03cf2a22b9%2Fabcebb46e3784a7e922ac75ebe3a5526"
    },
    {
      "author": "David Bauder",
      "description": "For a second time, the Associated Press is asking a federal judge to immediately restore its access to presidential events. In an amended lawsuit filed late Monday, AP says the White House has doubled down on retaliating against the news outlet for its refusal to rename the Gulf of Mexico. A federal judge last week rejected AP's first bid for an injunction, but urged the White House to reconsider because case law stood against it. The amended lawsuit cited the White House's decision to take full control over which journalists are allowed in pools that cover smaller events. The Trump administration did not immediately return a request for comment on Tuesday.",
      "publishedAt": "2025-03-04T15:12:43Z",
      "title": "AP again seeks end of its White House ban, saying the Trump administration is retaliating further",
      "url": "https://apnews.com/article/ap-trump-white-house-journalists-pool-ban-dd2a9c7994c2542f4936f045540f006e",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d2c88e/2147483647/strip/true/crop/4176x2349+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2Ff3%2F62aaf9232e340637dfdbd1d3e553%2Fd6615a50c0574e7fbb7f44ed7ef33eba"
    },
    {
      "author": "Jill Lawless",
      "description": "The U.S. has been Ukraine’s biggest military backer since Russia’s full-scale invasion began three years ago. The suspension of that aid by the Trump administration doesn’t mean Ukraine’s defenses will quickly collapse. But it's a major blow that threatens to remove some of the most formidable weapons in Ukraine’s battlefield arsenal. And it ratchets up pressure on Kyiv to accept a peace agreement. The U.S. provides about 20% of Ukraine’s military supplies. And it includes the most lethal and important equipment like longer-range missiles and Patriot air defense systems. Malcolm Chalmers of the RUSI think tank says much will depend on whether the U.S. cuts off technical assistance as well as weapons and ammunition.",
      "publishedAt": "2025-03-04T14:46:53Z",
      "title": "Trump's halt on military aid will hurt Ukraine's defenses. But it may not be fatal",
      "url": "https://apnews.com/article/us-military-aid-halt-ukraine-explainer-123551e5d86b49fdaa977eae685d32a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/1917823/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F6c%2Fb44ce0e7af93bc36143665d5ec19%2Fce43959b1cb44e7cab1302dbd1b9b830"
    },
    {
      "author": "Rebecca Santana",
      "description": "Republicans in Congress are taking aim at four cities over their policies limiting cooperation with immigration enforcement under President Donald Trump's administration. Mayors from Boston, Chicago, Denver and New York will appear Wednesday before the Committee on Oversight and Government Accountability over their cities' policies restricting authorities' cooperation with federal enforcement. These are often referred to as “sanctuary policies” and the localities as “sanctuary cities.” Courts have upheld the legality of most sanctuary laws. But Trump administration officials have targeted sanctuary policies, seeing them as a key impediment to deporting people in the large numbers he wants. New York’s mayor says he hopes for a “civil conversation” with the representatives.",
      "publishedAt": "2025-03-04T13:05:07Z",
      "title": "Republicans target 4 'sanctuary' cities as Trump pushes mass deportations",
      "url": "https://apnews.com/article/congress-sanctuary-cities-trump-immigration-border-49766af8d0bad4be8b4e46d0ffa0ab02",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c13362/2147483647/strip/true/crop/7300x4106+31+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F27%2Ffe7fcad34ef6b032a443d8752179%2F41aac1ac93f640729085db47ab97f41b"
    },
    {
      "author": "Devi Shastri/associated Press, Carlos Nogueras Ramos/texas Tribune",
      "description": "Measles has sickened nearly 150 mostly unvaccinated people in rural West Texas, and a school-age child has died. The virus is spreading among Gaines County’s Mennonite community, where government mandates are not trusted. But another outbreak is also spreading, and that's mistrust in vaccines and public health. Most parents have chosen to vaccinate, but doctors worry anti-vaccine rhetoric from Robert F. Kennedy Jr., the nation’s top health official, will make things worse as childhood vaccination rates decline. Gaines County has an 82% kindergarten vaccination rate against measles, below the 95% needed to stop outbreaks. The rate may be even lower among homeschooled children.",
      "publishedAt": "2025-03-04T11:17:39Z",
      "title": "Texas measles outbreak fueled by distrust in public health and personal choice",
      "url": "https://apnews.com/article/measles-outbreak-texas-rfk-vaccines-8cf4641b04731c713edb524ca943490c",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe2d809/2147483647/strip/true/crop/4429x2491+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fc8%2F16556a4ef74096d7a6c40aabd792%2F1446676010144e499f457d52430ac278"
    },
    {
      "author": "Luis Andres Henao",
      "description": "Greenlanders have been pushed into the global spotlight in the weeks since U.S. President Donald Trump said America could take over their Arctic homeland. Most say they don’t want to be American. Many are worried and overwhelmed by the comments and the attention. But also hopeful. They say Trump’s comments have ignited unprecedented interest in full independence from Denmark — a key issue in a parliamentary election on March 11. Greenland is coveted for its strategic location, its valuable rare earth minerals and its potential for shipping routes as the ice that covers most of the world’s largest island keeps retreating due to climate change.",
      "publishedAt": "2025-03-04T06:14:07Z",
      "title": "On a cold northern island, a mantra rises: 'Greenland is not for sale'",
      "url": "https://apnews.com/article/buy-greenland-trump-united-states-denmark-c5c2169a4b43c133eacbc4529126f3b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/26aec3e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fde%2Fab9da8fa4c9d95939f6c41039c3b%2F7c432e5894984a20b4cf2ba5d8818f80"
    },
    {
      "author": "Josh Boak, Paul Wiseman, Rob Gillies",
      "description": "President Donald Trump’s long-threatened tariffs against Canada and Mexico have gone into effect, kicking off a trade war with America's neighbors. Starting just past midnight Tuesday, imports from Canada and Mexico are now taxed at 25%, with Canadian energy products subject to 10% import duties. In addition, the 10% tariff that Trump placed on Chinese imports in February was doubled to 20%. China retaliated Tuesday with additional tariffs of up to 15% on a wide array of U.S. farm exports, among other measures. Canada also has announced tariffs on American goods. Trump's moves have raised inflation fears, even as he has promised the American public that taxes on imports are the easiest path to national prosperity.",
      "publishedAt": "2025-03-04T05:03:54Z",
      "title": "Trump tariffs on Canada and Mexico take effect",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-643086a6dc7ff716d876b3c83e3255b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbd1fcd/2147483647/strip/true/crop/3000x1688+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fa8%2Fbdde94a2bac327067aab245c44c2%2F00c2c6a26d3b4061ba25590f48e727bb"
    },
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "Ukrainians are grappling with the consequences of the Trump administration’s decision to pause military aid vital for their fight against Russia’s invasion. That step came days after a disastrous Oval Office row that has deepened a rift between Kyiv and the White House. U.S. President Donald Trump directed the U.S. to pause all assistance to Ukraine as he seeks to pressure Ukrainian President Volodymyr Zelenskyy to engage in peace talks with Russia. Ukraine, which depends heavily on foreign help to hold back the Russian invasion that began on Feb. 24 2022, Kyiv has feared the possibility of aid being stopped to Ukraine ever since Trump took office.",
      "publishedAt": "2025-03-04T07:33:52Z",
      "title": "Ukrainians grapple with consequences of Trump's pause on all military aid",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-military-aid-2ce8b167f0ba948b2b606381192de71d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e1edbb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F91%2Ff1341c4558686103f9a903dee635%2Fb44068ffe5414269ada4c6acf253f811"
    },
    {
      "author": "Aamer Madhani",
      "description": "Vice President JD Vance says a U.S.-Ukraine critical minerals deal is a more practical deterrent against Russia than an international security force for post-war Ukraine proposed by key allies Britain and France. The Republican said in a Fox News Channel interview aired Monday the pact that would give the U.S. access to Ukraine’s critical minerals “is a way better security guarantee than 20,000 troops from some random country that hasn’t fought a war in 30 or 40 years.” The comments highlight differences between President Donald Trump and U.K. Prime Minister Keir Starmer and French President Emmanuel Macron about how to prevent Russia from invading again if a truce can be reached between Moscow and Kyiv.",
      "publishedAt": "2025-03-04T14:45:02Z",
      "title": "Vance says US-Ukraine minerals deal better deterrent of Putin than 'troops from some random country'",
      "url": "https://apnews.com/article/trump-vance-zelenskyy-ukraine-russia-war-c095188d261f33f8ec1034ab76d517d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bfc4b3/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F65%2F885e4def131e8bf53ac81cb19bfa%2F1ba8231d9dd24da3b45f385656be561f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}