{
  "articles": [
    {
      "author": "Matthew Lee, Aamer Madhani",
      "description": "President Donald Trump and French President Emmanuel Macron are starting their day by taking part in a virtual meeting with fellow leaders of the Group of Seven economies to discuss Russia's war in Ukraine. Trump welcomed Macron to the White House on Monday at a moment of deep uncertainty about the future of transatlantic relations. The Republican meets with British Prime Minister Keir Starmer on Thursday. Trump has transformed American foreign policy and effectively tuned out European leadership as he looks to quickly end the war. The “America First” president has cast a shadow over what veteran U.S. diplomats and ex-government officials had regarded as America’s calming presence of global stability.",
      "publishedAt": "2025-02-24T05:02:06Z",
      "title": "Trump meets Macron as uncertainty grows about US ties to Europe and Ukraine",
      "url": "https://apnews.com/article/trump-macron-ukraine-russia-starmer-8869d05f2cd8db5da277dd927cf959d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb72087/2147483647/strip/true/crop/4576x2574+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F96%2Fef70452e530099d7ff0fdad87a51%2F4924916f737f43149c764561aff1d36c"
    },
    {
      "author": "Edith M. Lederer",
      "description": "On the third anniversary of Russia’s invasion of Ukraine, the U.N. General Assembly is expected to vote on dueling resolutions. One is Ukraine’s European-backed proposal demanding an immediate withdrawal of Russian forces from the country. The other is a U.S. resolution for a swift end to the war that never mentions Moscow’s aggression. The Monday votes are a reflection of the tensions that have emerged between the U.S. and Ukraine after President Donald Trump suddenly opened negotiations with Russia in a bid to quickly resolve the conflict. General Assembly resolutions aren't legally binding but are seen as a barometer of world opinion.",
      "publishedAt": "2025-02-24T05:07:52Z",
      "title": "The UN will vote to demand Russia pull troops out of Ukraine. But the US wants a softer approach",
      "url": "https://apnews.com/article/un-russia-ukraine-war-resolution-trump-zelenskyy-cde221e5850196776525403e788c272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/80659f7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fac%2F38033569d166ffa08b0e3841d037%2Fbb62e87d3b264e148d436d3ff609f9ae"
    },
    {
      "author": null,
      "description": "A dozen leaders from Europe and Canada arrived in Ukraine’s capital by train Monday morning to mark the third anniversary of Russia’s invasion. The visitors were greeted at the station by Ukrainian Foreign Minister Andrii Sybiha and the president’s chief of staff Andrii Yermak. Among them were European Commission President Ursula von der Leyen and Canadian Prime Minister Justin Trudeau. Von der Leyen wrote on social media that Europe's destiny was at stake. The guests were set to attend events dedicated to the anniversary and discuss supporting Ukraine amid a recent U.S. policy shift under President Donald Trump.",
      "publishedAt": "2025-02-24T06:32:17Z",
      "title": "Foreign leaders visit Ukraine's capital to mark third war anniversary",
      "url": "https://apnews.com/article/russia-ukraine-war-anniversary-84e4c62519fc15b34e17f661cf3dd20e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d41efa0/2147483647/strip/true/crop/6889x3875+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fad%2F065b365e7b2ab1dbefa1d23dc59c%2F72d93c5e7f7a4a31a2243ec36b3a9567"
    },
    {
      "author": "Samya Kullab",
      "description": "Ukraine has offered to strike a deal with U.S. President Donald Trump for continued American military aid in exchange for developing Ukraine’s mineral industry. It could provide a valuable source of the rare earth elements that are essential for many kinds of technology. Trump said that he wanted such a deal earlier this month. It was initially proposed last fall by Ukrainian President Volodymyr Zelenskyy as part of his plan to strengthen Kyiv’s hand in future negotiations with Moscow. After an initial rocky start, negotiations on a deal are gaining traction.",
      "publishedAt": "2025-02-11T05:17:40Z",
      "title": "Ukraine’s rare earth elements could help keep US military aid flowing",
      "url": "https://apnews.com/article/russia-ukraine-war-rare-earth-elements-trump-6a4a95d4370a2e46a81ce4a3a352bf8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    },
    {
      "author": "Kate Payne",
      "description": "As Florida Gov. Ron DeSantis approaches the end of his term in office, he’s talking up one potential heir to succeed him in 2026: his wife Casey DeSantis. At the same time, he’s taking a shot at President Donald Trump's pick for the job, teeing up another potential faceoff between the popular Republican governor and the man he dared to challenge for the presidential nomination. The aspirations of the state’s first lady have long been the subject of Tallahassee parlor talk. That chatter has grown louder in recent weeks as tensions have bubbled between DeSantis and Trump’s allies in the Florida Legislature.",
      "publishedAt": "2025-02-24T19:33:01Z",
      "title": "Ron DeSantis promotes his wife as next Florida governor, swipes Trump pick",
      "url": "https://apnews.com/article/florida-governors-race-desantis-casey-trump-donalds-dee847fe8934260668cf7f47832ad824",
      "urlToImage": "https://dims.apnews.com/dims4/default/7850ad7/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Ff4%2F81e17358380d2060943308952949%2Fc37f88ce57b14de7a924d92955abca77"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "The Supreme Court has declined to hear a pair of cases from abortion opponents who say laws limiting anti-abortion demonstrations near clinics violate their First Amendment rights. The high court turned down the appeals in orders handed down Monday, though two conservative justices disagreed. Activists argued the laws barring people from protesting or trying to dissuade women from abortions should be struck down after the justices overturned Roe v. Wade. The cities defending the laws in Illinois and New Jersey said they were passed to address disturbing behavior from protesters outside of health care clinics.",
      "publishedAt": "2025-02-24T15:43:27Z",
      "title": "Supreme Court turns back challenges to laws keeping abortion opponents away from clinics, patients",
      "url": "https://apnews.com/article/supreme-court-abortion-buffer-zones-7979c3d747d7eab88f7e8b723397e768",
      "urlToImage": "https://dims.apnews.com/dims4/default/185178d/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Ff3%2F037f98fcb4f310f35173da606ec6%2F263d4bd9234b47c2ac293ee41794f771"
    },
    {
      "author": "Rebecca Boone, Martha Bellisle",
      "description": "A Republican-hosted legislative town hall meeting in northern Idaho became turbulent after three plainclothes security workers forcibly removed a woman who was heckling the speakers. The incident at Coeur d’Alene High School on Saturday, first reported by the Coeur d’Alene Press, quickly drew widespread attention after videos of the chaos were posted online. Now more than $120,000 has been raised for Teresa Borrenpohl’s legal costs. Borrenpohl is a Democrat who unsuccessfully ran for a legislative seat last year. She was issued a misdemeanor citation for battery after biting one of the men who tried to drag her from her seat.",
      "publishedAt": "2025-02-24T18:21:25Z",
      "title": "Idaho town hall meeting turns chaotic after woman is forcibly removed for shouting at speakers",
      "url": "https://apnews.com/article/idaho-protest-woman-removed-town-hall-b4348df006fe83723f95769a05007098",
      "urlToImage": "https://dims.apnews.com/dims4/default/84f86b3/2147483647/strip/true/crop/5100x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Ff0%2F04a11452964d94cfe43c971e90c1%2Fac1bd1943e764069bd95fea0744259b5"
    },
    {
      "author": "Sean Murphy",
      "description": "Many federal employees across the country are back at agency offices under President Donald Trump's return-to-office mandate. Trump advisor Elon Musk warned on his platform X Monday that workers who don't comply will be placed on administrative leave. At least some federal agencies are not fully prepared for all remote workers to return to the office. In an email to U.S. Department of Education Federal Student Aid employees on Friday, agency officials noted that some regional offices in Boston, Chicago, New York and San Francisco were not ready for workers to return.",
      "publishedAt": "2025-02-24T21:01:18Z",
      "title": "Federal workers return to offices amid threat from Elon Musk",
      "url": "https://apnews.com/article/trump-musk-doge-return-office-federal-workers-20309562c6a77912462321951277d110",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f42448/2147483647/strip/true/crop/4938x2778+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F48%2Ff614bf91d496ee8a651e71209eb2%2F500030aabe394b51bb70e6600729b972"
    },
    {
      "author": "Matt Sedensky",
      "description": "A judge is hearing in The Associated Press’ lawsuit against three staff members of President Donald Trump, whose administration has barred the news agency from presidential events. The AP is appearing in federal court in Washington over its emergency motion. It wants the court to undo the administration’s move to shut its journalists out of the Oval Office, Air Force One and other areas. The dispute stems from the news agency’s refusal to conform to Trump’s renaming of the Gulf of Mexico to the “Gulf of America.” The AP says it is adhering to the “Gulf of Mexico” terminology because its audience is global and the waters are not only in U.S. territory, but it is acknowledging Trump’s rechristening as well.",
      "publishedAt": "2025-02-24T19:15:31Z",
      "title": "Trump administration in court over AP lawsuit on White House access",
      "url": "https://apnews.com/article/ap-lawsuit-trump-gulf-mexico-america-6b6fba488e7e420e5fcd28c44a755922",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ce9107/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F6c%2F01dcee28b6ce2c9d1d6b8ffb4c74%2Fe1af6160de104af5b4a114b5a1921519"
    },
    {
      "author": "Nicole Winfield, Trisha Thomas",
      "description": "The Vatican says Pope Francis remains in critical condition but has showed slight improvement in laboratory tests. He has resumed some work activities, including calling a parish in Gaza City that he has kept in touch with since the war there began. The Vatican’s evening bulletin was more upbeat than in recent days. It said the 88-year-old Francis. suffering from pneumonia in both lungs, hadn’t had any more respiratory crises. The slight kidney insufficiency detected on Sunday was of no concern. He is continuing to receive supplemental oxygen and doctors say his prognosis remains guarded. He received the Eucharist in the morning and resumed working in the afternoon.",
      "publishedAt": "2025-02-24T07:33:28Z",
      "title": "Pope Francis resting after early stages of kidney failure detected",
      "url": "https://apnews.com/article/pope-vatican-hospital-pneumonia-sepsis-ec28babfc64d4f7086a2ba5db52fd69f",
      "urlToImage": "https://dims.apnews.com/dims4/default/859b658/2147483647/strip/true/crop/5577x3137+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F9e%2F64e28501ad88e141a56e33e13f65%2F4fb87074cd9b4ee298a0139a3ab3670a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}