{
  "articles": [
    {
      "author": "SAM METZ and CLAIRE RUSH",
      "description": "LAHAINA, Hawaii (AP) — When flames swept through western Maui, engulfing the town of Lahaina, residents saw toxic fumes spewing into the air as burning homes, pipes and cars combusted, transforming rubber, metal and plastic into poisonous, particulate matter-filled smoke.",
      "publishedAt": "2023-08-14T05:05:41Z",
      "title": "Maui officials and scientists warn that after the flames flicker out, toxic particles will remain",
      "url": "https://apnews.com/2a2e25c013c9fce39041718848028c3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd61b9bf0b9c47f2ad78e416ce212c96/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Long before the FBI began investigating Donald Trump 's hoarding of classified documents or Attorney General Merrick Garland appointed a special prosecutor to probe the former president, Fani Willis was at work.",
      "publishedAt": "2023-08-14T04:05:27Z",
      "title": "How Fani Willis oversaw what might be the most sprawling legal case against Donald Trump",
      "url": "https://apnews.com/32bfdd2cca9d3184056836b208a78379",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/965e3f683ee94c2fbb47fd969cfa1781/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — The Taliban have settled in as rulers of Afghanistan, two years after they seized power as U.S.",
      "publishedAt": "2023-08-14T04:43:43Z",
      "title": "The Taliban are entrenched in Afghanistan after 2 years of rule. Women and girls pay the price",
      "url": "https://apnews.com/10711b53a73638f46f2eb534b15b1a63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cb405ab04754d4897db4a4cc4790adb/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and MARGERY A. BECK",
      "description": "MARION, Kan. (AP) — A small central Kansas police department is facing a torrent of criticism for raiding a local newspaper’s office and the home of its owner and publisher, seizing computers and cellphones, and, in the publisher’s view, stressing his 98-year-old mother enough to cause her weekend death.",
      "publishedAt": "2023-08-14T04:51:24Z",
      "title": "A central Kansas police force comes under constitutional criticism after raiding a newspaper",
      "url": "https://apnews.com/f1e49c4e542ddb3cf19c9ca02a0a21fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42a535c76ab8403ebde121e239df9dd9/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — For Jake Welch, getting dressed is one big math problem.The 36-year-old brand director for an advertising firm calculates the cost-per-wear of his wardrobe by highlighting 200 items in a spreadsheet — excluding underwear and socks — and meticulously listing the price he paid for each of them as well as how many times he's worn it.",
      "publishedAt": "2023-08-14T09:00:26Z",
      "title": "Thinking of buying a new pair of jeans? Breaking down the cost over time might help you decide",
      "url": "https://apnews.com/9b93abdde32c855a46fb37aa7d2ff38d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7724a90cad9942d79bb0c0333cda2bf7/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — David McCormick had a clear explanation for why his fellow Republican, Dr. Mehmet Oz, lost a critical Pennsylvania Senate seat last year: Voters viewed the daytime television celebrity as an interloper from New Jersey with limited ties to the state he hoped to represent.",
      "publishedAt": "2023-08-14T04:06:56Z",
      "title": "David McCormick is gearing up for a Senate run in Pennsylvania. But he lives in Connecticut",
      "url": "https://apnews.com/e84500b848f0be7efb9f9b3c495dd066",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff2741d5cc504febad279817e0dfb9da/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Niger’s mutinous soldiers said they will prosecute deposed President Mohamed Bazoum for “high treason” and undermining state security, in an announcement hours after the junta said they were open to dialogue with West African nations to resolve the mounting regional crisis.",
      "publishedAt": "2023-08-14T05:56:57Z",
      "title": "Niger’s coup leaders say they will prosecute deposed President Mohamed Bazoum for 'high treason'",
      "url": "https://apnews.com/1e54fa565ec0c659fc233cc695d7de21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6992d663d88047d4ac98337d98df92c6/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Belen Diaz was walking home from college one evening when a motorcycle carrying two men made a menacing U-turn.Terrified that she was about to be robbed for the eighth time in three years, the teaching student banged on a cab window until the driver drove her home.",
      "publishedAt": "2023-08-14T04:13:45Z",
      "title": "Ecuador was calm and peaceful. Now hitmen, kidnappers and robbers walk the streets",
      "url": "https://apnews.com/4f96684926c2600e2483373555a7cf42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/297ef12ea7794c58810c5e7f08e22840/3000.jpeg"
    },
    {
      "author": "DAVID CRARY",
      "description": "More than 6,000 people representing scores of religions and belief systems are expected to convene in Chicago starting Monday for what organizers bill as the world’s largest gathering of interfaith leaders.",
      "publishedAt": "2023-08-14T12:19:19Z",
      "title": "A throng of interfaith leaders to focus on combating authoritarianism at global gathering in Chicago",
      "url": "https://apnews.com/c45b6f2332f8f6d429c8a403b640277d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c544eeecc2784d19983451ecae6ecabc/3000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "TOPEKA, Kan. (AP) — As children across the U.S. head back to classes and practices for fall sports, four more states are expecting their K-12 schools to keep transgender girls off their girls teams.",
      "publishedAt": "2023-08-14T04:08:06Z",
      "title": "More states expect schools to keep trans girls off girls teams as K-12 classes resume",
      "url": "https://apnews.com/ec0b1d2ea162855131264c88bb992e2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b37252532d96436686f2638c87ec04c0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}