{
  "articles": [
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian state news agency says Kim Jong Un, Putin have arrived for meeting to Vostochny cosmodrome in Russia's far east.",
      "publishedAt": "2023-09-13T04:10:44Z",
      "title": "Russian state news agency says Kim Jong Un, Putin have arrived for meeting to Vostochny cosmodrome in Russia's far east",
      "url": "https://apnews.com/063a3e7d853879b08535a3b9d5e3e2ab",
      "urlToImage": ""
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un arrived at a cosmodrome in Russia's Far East on Wednesday for a meeting with Russian President Vladimir Putin that underscores how the two leaders’ interests are aligning in the face of their separate, intensifying confrontations with the United States.",
      "publishedAt": "2023-09-13T04:03:14Z",
      "title": "Putin welcomes Kim Jong Un at cosmodrome for meeting that shows how leaders are coming together",
      "url": "https://apnews.com/0d70f5190df1088ebe53e8ca19f8e9c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ff81b4f040f4de78eb45ca339d7c53f/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Sevastopol Shipyard in Russian-annexed Crimea was on fire Wednesday after a Ukrainian attack, and 24 people were injured, local Russian-installed official reported.Mikhail Razvozhayev, Moscow-appointed governor of the port city of Sevastopol on the Crimean peninsula, said on Telegram on Wednesday that the fire was sparked by a missile attack.",
      "publishedAt": "2023-09-13T04:08:25Z",
      "title": "Crimea shipyard burning after a Ukrainian attack and 24 are injured, Russian-installed official says",
      "url": "https://apnews.com/925cf5d35b53ea061d1dc73dd0cf329f",
      "urlToImage": ""
    },
    {
      "author": "JACK JEFFERY",
      "description": "LONDON (AP) — A storm that has killed thousands of people and left thousands more missing in Libya is the latest blow to a country that has been gutted by years of chaos and division.",
      "publishedAt": "2023-09-12T18:58:06Z",
      "title": "How Libya’s chaos left its people vulnerable to deadly flooding",
      "url": "https://apnews.com/d88aee9a6f87ebba96c8a17b28e20911",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7a1b3f322b14026b5dd62496e00cd76/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy announced Tuesday he is directing the U.S.",
      "publishedAt": "2023-09-12T14:53:19Z",
      "title": "Speaker McCarthy directs the House to open an impeachment inquiry into President Biden",
      "url": "https://apnews.com/b187202be8814f7acbdd6e2e937e23d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bfbc34ffc1445b2a3331c7bab014a0e/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE and LAURAN NEERGAARD",
      "description": "Most Americans should get an updated COVID-19 vaccine, health officials said Tuesday.Advisers to the Centers for Disease Control and Prevention endorsed the new shots for everyone 6 months and older and the agency's director quickly signed off Tuesday on the panel's recommendation.",
      "publishedAt": "2023-09-12T20:26:53Z",
      "title": "Americans can now get an updated COVID-19 vaccine",
      "url": "https://apnews.com/5bc4db844557120bcc50dc0838c0e044",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40e7d2011c9b4489a636ecae88646583/1134.jpeg"
    },
    {
      "author": "PAUL WISEMAN and MICHAEL LIEDTKE",
      "description": "WASHINGTON (AP) — Google has exploited its dominance of the internet search market to lock out competitors and smother innovation, the Department of Justice said Tuesday at the opening of the biggest U.S.",
      "publishedAt": "2023-09-12T04:04:04Z",
      "title": "Google exploited exclusive search engine deals to maintain its advantage over rivals, DOJ argues",
      "url": "https://apnews.com/687b9a5b90ec18f207d36df3ba11aebd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9d6420ec11e4417bec0476532d66bbc/1920.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "An earthquake has sown destruction and devastation in Morocco, where death and injury counts continue to rise after rescue crews dug out people both alive and dead in villages that were reduced to rubble.",
      "publishedAt": "2023-09-11T04:05:47Z",
      "title": "What to know about the Morocco earthquake and the efforts to help",
      "url": "https://apnews.com/fe5a0fbe71646f9b1b4f6a85889b414a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a48360284cd643168ce407a5474db602/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran on Tuesday identified the five prisoners it hopes to see freed in the United States in exchange for five Iranian-Americans now held in Tehran and billions in assets once held by South Korea.",
      "publishedAt": "2023-09-12T14:10:52Z",
      "title": "Iran identifies 5 prisoners it wants from US in swap for Iranian-Americans and billions in assets",
      "url": "https://apnews.com/4bcf25d9be7807a2882fd949f2ad8eb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32f2db3809cf4c14a9d3b3de59f0d7b3/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "CUPERTINO, Calif. (AP) — Apple on Tuesday unveiled its next generation of iPhones — a lineup that will boast better cameras, faster processors, a new charging system and a price hike for the fanciest model.",
      "publishedAt": "2023-09-12T04:00:59Z",
      "title": "Apple’s new iPhones get faster chips, better cameras and new charging ports",
      "url": "https://apnews.com/4ce309e39cabc302912bcf189605483e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fd7b219de974b7da51c1578a87e1f13/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}