{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Health officials and people trapped inside Gaza's largest hospital rejected Israel's claims that it was helping babies and others evacuate Sunday, saying fighting continued just outside the facility where incubators lay idle with no electricity and critical supplies were running out.",
      "publishedAt": "2023-11-12T06:59:32Z",
      "title": "Heavy fighting rages near main Gaza hospital and people trapped inside say they cannot flee",
      "url": "https://apnews.com/20f5dcd135b7eb34238a7b25ce560d0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c528e68e3abf4ab5bdcc66ccafa9f696/1920.jpeg"
    },
    {
      "author": "AMY TEIBEL",
      "description": "JERUSALEM (AP) — Attacks by Lebanon's Hezbollah group Sunday wounded seven Israeli troops and 10 other people, Israel's military and rescue services said. The clashes came as skirmishes between the Iran-backed group and Israeli military continue to intensify along the Lebanon-Israel border, threatening to escalate into another front in the Mideast’s latest war.",
      "publishedAt": "2023-11-12T13:58:34Z",
      "title": "Attacks by Lebanon's Hezbollah group wound 7 Israeli troops, 10 others along border with Israel",
      "url": "https://apnews.com/88266c7dbbdf80adfe9157909a39dccb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81763488dc7541479df62f170a188374/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET and BARBARA SURK",
      "description": "PARIS (AP) — More than 100,000 people marched in Paris on Sunday to protest against rising antisemitism in the wake of Israel’s ongoing war against Hamas in Gaza.Prime Minister Elisabeth Borne, representatives of several parties on the left, conservatives and centrists of President Emmanuel Macron's party as well as far-right leader Marine Le Pen attended Sunday’s march in the French capital amid tight security.",
      "publishedAt": "2023-11-12T12:04:00Z",
      "title": "More than 100,000 people march in Paris against soaring antisemitism amid Israel-Hamas war",
      "url": "https://apnews.com/1083d79342ce7a27ccd4f5f63e2abc57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0a4add2ad16459d9cbd1c5804597b7c/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The United States and China are the two global economic heavyweights. Combined, they produce more than 40% of the world's goods and services. So when Washington and Beijing do economic battle, as they have for five years running, the rest of the world suffers, too.",
      "publishedAt": "2023-11-12T06:00:28Z",
      "title": "A fragile global economy is at stake as US and China seek to cool tensions at APEC summit",
      "url": "https://apnews.com/ddfdbfd267a8dabb1138a8157b7c88ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aaf196bd064bfcb6853fb708ae7dd7/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Activists protesting corporate profits, environmental abuses, poor working conditions and the Israel-Hamas war are among those planning to march in downtown San Francisco on Sunday, united in their opposition to a global trade summit that will draw President Joe Biden and leaders from nearly two dozen countries.",
      "publishedAt": "2023-11-12T05:34:28Z",
      "title": "Protesters will demonstrate against world leaders, Israel-Hamas war as APEC comes to San Francisco",
      "url": "https://apnews.com/2aa0c66d653e03e7b7fd1188d74f6582",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4c93d954d1f4e6684ddf9bca932085e/3000.jpeg"
    },
    {
      "author": "FELIPE DANA",
      "description": "KYIV, Ukraine (AP) — Russian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key front line cities, Ukrainian military officials said Sunday. Moscow's troops have begun a push to regain territory near Bakhmut, the eastern mining city that was the site of the war’s bloodiest battle before falling into Russian hands in May, the head of Ukraine’s ground forces wrote on the Telegram messaging app.",
      "publishedAt": "2023-11-12T12:26:58Z",
      "title": "Russia ramps up attacks on key cities in eastern Ukraine",
      "url": "https://apnews.com/0c94ceeccc97dfc8e433c3e2f828b833",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a3ec4e427a749f4945d7a20f137172e/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — A wildfire burning in a remote Hawaii rainforest is underscoring a new reality for the normally lush island state just a few months after a devastating blaze on a neighboring island leveled an entire town and killed at least 99 people.",
      "publishedAt": "2023-11-12T05:00:39Z",
      "title": "There's another wildfire burning in Hawaii. This one is destroying irreplaceable rainforest on Oahu",
      "url": "https://apnews.com/e676c5bd5384554bc100ca5208bacf43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c45d05e3114436097688a493bc78c6b/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden has a simple reelection pitch to voters — let him “finish the job.”So what does that mean? What's left for him to get done?",
      "publishedAt": "2023-11-12T12:31:23Z",
      "title": "Joe Biden wants to complete his goals on civil rights, taxes, and social services if he's reelected",
      "url": "https://apnews.com/272bb9582df845cf9cd222ff2e9bd2f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d6e22570eca4872bad57e8d914b0458/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — A mass deportation operation. A new Muslim ban. Tariffs on all imported goods and \"freedom cities\" built on federal land. Much of the 2024 presidential campaign has been dominated by the myriad investigations into former President Donald Trump and the subsequent charges against him.",
      "publishedAt": "2023-11-12T12:12:10Z",
      "title": "Trump's plans if he returns to the White House include deportation raids, tariffs and mass firings",
      "url": "https://apnews.com/d656d8f08629a8da14a65c4075545e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c029860820364598ac9a709c9bdbc962/1920.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Georgia extended its streak of weeks being top-ranked in the AP Top 25 to 22 on Sunday, giving the Bulldogs the second-longest run of being No.",
      "publishedAt": "2023-11-12T19:12:16Z",
      "title": "AP Top 25: Georgia's No. 1 streak hits 22, second-best ever; Louisville, Oregon State enter top 10",
      "url": "https://apnews.com/93d021b5d341fb1665d9630fd5280819",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3a463b1dba04d88a51ae88afba6e342/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}