{
  "articles": [
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — A rare call for a general strike in Israel to protest the failure to return hostages held in Gaza led to closures and other disruptions around the country on Monday, including at its main international airport.",
      "publishedAt": "2024-09-02T06:49:47Z",
      "title": "General strike in Israel over hostages found dead in Gaza reflects political divisions",
      "url": "https://apnews.com/f8a8c85f8947631a7f3039e087dd3904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0688fc7dddd4de79272f08bb03f0ae6/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Residents of Beirut's southern suburbs have been scrambling to make contingency plans since an Israeli airstrike on an apartment building in a busy neighborhood killed a top Hezbollah commander and touched off fears of a full-scale war.",
      "publishedAt": "2024-09-02T04:16:25Z",
      "title": "Some Lebanese who fear war is coming have an unusual backup plan: Moving to Syria",
      "url": "https://apnews.com/70eeb35e16e813e79c2fd9129415dd78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8f95025c7a14cf98c6d8ba193d33090/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris and President Joe Biden are co-headlining a campaign event Monday in the marquee battleground state of Pennsylvania as Harris balances presenting herself as “a new way forward” while remaining intensely loyal to Biden and the policies he has pushed.",
      "publishedAt": "2024-09-02T04:14:45Z",
      "title": "Harris looks to Biden for a boost in Pennsylvania as the two are set to attend a Labor Day parade",
      "url": "https://apnews.com/afd4b7fbd9d747e307a8fb5c1f60d5fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d56c7a6cd8d41809f8ef68e05da1c6c/3000.jpeg"
    },
    {
      "author": "BY OLIVIA DIAZ and BRIAN WITTE",
      "description": "WASHINGTON (AP) — Worries of being uprooted from their jobs have returned for Laura Dodson and other federal workers, who have long been the economic backbone of the nation's capital and its suburbs.",
      "publishedAt": "2024-09-02T04:13:00Z",
      "title": "Federal workers around nation's capital worry over Trump's plans to send some of them elsewhere",
      "url": "https://apnews.com/675c08a888cd27d0a75b01134114460a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f84c7840f05240bb9690e6cdd1c9ea3c/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Imagine a customer-service center that speaks your language, no matter what it is.Alorica, a company in Irvine, California, that runs customer-service centers around the world, has introduced an artificial intelligence translation tool that lets its representatives talk with customers who speak 200 different languages and 75 dialects.",
      "publishedAt": "2024-09-02T07:00:25Z",
      "title": "AI may not steal many jobs after all. It may just make workers more efficient",
      "url": "https://apnews.com/e57eb040009d77ddcce1574d1c1915fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd32a5cdea2e4a5e92aa1be43844b22d/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and VASILISA STEPANENKO",
      "description": "KYIV, Ukraine (AP) — Russia launched an overnight barrage of drones and cruise and ballistic missiles at Kyiv, officials said Monday, as children prepared their return to school across the country after the summer vacation and some found classes canceled due to damage from the attack.",
      "publishedAt": "2024-09-02T04:14:53Z",
      "title": "Russia fires a barrage of drones, cruise and ballistic missiles at Kyiv as children return to school",
      "url": "https://apnews.com/cbdd990b82cae466f15f756f79f2564c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3c719e2d9e846d49f0bb503e5983e10/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "UZHHOROD, Ukraine (AP) — This week marks the start of the school year in Ukraine, a pivotal time for any student, especially for teenagers in their final year of high school. Ukrainian teens have more than just grades and university choices on their minds — they are grappling with the realities of war.",
      "publishedAt": "2024-09-02T06:09:49Z",
      "title": "Three Ukrainian teens begin their final year of high school holding onto hopes for the future",
      "url": "https://apnews.com/79472c1f2b6926865c18285cb3e20763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7adbc47148d3424ab625e83759dc0322/1920.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — The Alternative for Germany party's success in two state elections piled new pressure on Chancellor Olaf Scholz's fractious government and left the country's main opposition party facing political contortions on Monday to find a way to govern a pair of eastern regions without involving the far-right party.",
      "publishedAt": "2024-09-02T07:26:42Z",
      "title": "Far-right success in German votes piles new pressure on Scholz's coalition",
      "url": "https://apnews.com/53cd18674858225d28a55f5fd0e2e211",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2556ef6b9e6a4f2dbdcd547adeaea8e8/2528.jpeg"
    },
    {
      "author": "JOHN ROGERS",
      "description": "LOS ANGELES (AP) — Linda Deutsch, a special correspondent for The Associated Press who for nearly 50 years wrote glittering first drafts of history from many of the nation’s most significant criminal and civil trials — Charles Manson, O.J.",
      "publishedAt": "2024-09-02T01:34:59Z",
      "title": "Linda Deutsch, AP trial writer who had front row to courtroom history, dies at 80",
      "url": "https://apnews.com/40b73ccda0b811ed90553c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/affc3541e63d4a5abec7c883f5a89e8d/1920.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "ESPN has gone off the air on a major carrier for the second straight year during the U.S. Open tennis tournament and in the midst of the first full weekend of college football.Disney Entertainment channels went dark on DirecTV Sunday night after the sides were unable to reach a new carriage agreement.",
      "publishedAt": "2024-09-02T01:37:04Z",
      "title": "ESPN networks, ABC and Disney channels go dark on DirecTV on a busy night for sports",
      "url": "https://apnews.com/94bb717f4b1a7f302e73102f23713308",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c96cfef1e264b7bb322bab138b6de14/1889.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}