{
  "articles": [
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — President-elect Donald Trump announced “success” in coming up with a new plan to fund the government and suspend the debt ceiling a day before a government shutdown, urging Congress to swiftly pass it, with House votes set for Thursday evening.",
      "publishedAt": "2024-12-19T16:26:07Z",
      "title": "Trump backs new GOP plan to fund government and raise debt limit as shutdown nears",
      "url": "https://apnews.com/e4b5c93d12838d180740a35daecc118d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/653c9a6a0d0b44b4b10a13fffdc59a72/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "In the first major flex of his influence since Donald Trump was elected, Elon Musk brought to a sudden halt a bipartisan budget proposal by posting constantly on his X megaphone and threatening Republicans with primary challenges.",
      "publishedAt": "2024-12-19T19:54:12Z",
      "title": "Musk ascends as a political force beyond his wealth by tanking budget deal",
      "url": "https://apnews.com/320a3487d596ae0d2e1ffdc1e62054b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fef080b184e94390a94db7079b81bf4e/3000.jpeg"
    },
    {
      "author": "MARK SCOLFORO, MICHAEL R. SISAK and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The man accused of killing UnitedHealthcare’s CEO was whisked back to New York by plane and helicopter Thursday to face new federal charges of stalking and murder, which could bring the death penalty if he's convicted.",
      "publishedAt": "2024-12-19T06:07:46Z",
      "title": "Man accused in UnitedHealthcare CEO killing faces federal charge that's eligible for death penalty",
      "url": "https://apnews.com/d6575764b6f4c58108e505e6e5ea896d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28d83043e89f4e578f1dac1aa1c9a4a2/1920.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ AND ELLIOT SPAGAT",
      "description": "McALLEN, Texas (AP) — U.S. Immigration and Customs Enforcement deported more than 270,000 people to 192 countries over a recent 12-month period, the highest annual tally in a decade, according to a report released Thursday that illustrates some of the financial and operational challenges that President-elect Donald Trump will face to carry out his pledge of mass deportations.",
      "publishedAt": "2024-12-19T22:24:19Z",
      "title": "Immigration agency deports highest numbers since 2014, aided by more flights",
      "url": "https://apnews.com/e09b2f8b9eb5e91ebc8f143748f0021a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a06cdeb8b3454ea987dfaa8b53f17b14/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A state appeals court on Thursday removed Fulton County District Attorney Fani Willis from the Georgia election interference case against Donald Trump and others, the latest legal victory for the president-elect in criminal cases that once threatened his career and freedom.",
      "publishedAt": "2024-12-19T14:59:49Z",
      "title": "Prosecutor Fani Willis is removed from the Georgia election case against Trump and others",
      "url": "https://apnews.com/0aa6db3b7abed22eb08ed9323f687972",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b9dcb53e31549d28c4b06e4c43864fb/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Amazon workers affiliated with the Teamsters union launched a strike at seven of the company's delivery hubs less than a week before Christmas.",
      "publishedAt": "2024-12-19T21:56:29Z",
      "title": "Amazon workers are striking at multiple delivery hubs. Here's what you should know",
      "url": "https://apnews.com/39b86c286d67219e42309566f3975cba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98b34582751f4442b5a45e4a2108197c/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "A large number of mysterious drones have been reported flying over New Jersey and across the eastern U.S., sparking speculation and concern over where they came from and why.",
      "publishedAt": "2024-12-14T18:21:17Z",
      "title": "Mystery drone sightings continue in New Jersey and across the US. Here's what we know",
      "url": "https://apnews.com/e6f565f5d51d9d47ad140e7e7d131842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e8e598ddc64153a160fe9c93854ec2/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and SYLVIE CORBET",
      "description": "MAMOUDZOU, Mayotte (AP) — French President Emmanuel Macron arrived Thursday in the Indian Ocean island of Mayotte to survey Cyclone Chido’s destruction and was immediately confronted with a first-hand account of devastation across the French territory.",
      "publishedAt": "2024-12-19T08:03:45Z",
      "title": "France's Macron says tour of cyclone-devastated Mayotte is a day he won't forget",
      "url": "https://apnews.com/604d543a8f020719b3ce5cec320c86fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac16752319a448e1969622267fd54feb/1920.jpeg"
    },
    {
      "author": "NADIA LATHAN",
      "description": "UVALDE, Texas (AP) — A Texas judge on Thursday refused to throw out criminal charges accusing the former Uvalde schools police chief of putting children at risk during the slow response to the 2022 Robb Elementary School shooting, while a lawyer for his co-defendant said they want to move the upcoming trial out of the small town where the massacre occurred.",
      "publishedAt": "2024-12-19T05:05:18Z",
      "title": "Former Uvalde schools police chief loses bid to toss criminal charges related to 2022 shooting",
      "url": "https://apnews.com/a652e6a9c1422021ba32fa8afb2d40dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e52dc884ea034b4197efd6dabccaf73d/2734.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "California officials have declared a state of emergency over the spread of bird flu, which is tearing through dairy cows in that state and causing sporadic illnesses in people in the U.S.",
      "publishedAt": "2024-12-19T16:28:19Z",
      "title": "California declared an emergency over bird flu. How serious is the situation?",
      "url": "https://apnews.com/e5edab844b409b8ba21feaecb10156d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a54bdc5b064d01b35def7926243701/2579.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}