{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — A U.S. Army veteran who drove a pickup truck into a crowd of New Year’s revelers in New Orleans, killing 15 people, had posted videos to social media hours before the carnage saying he was inspired by the Islamic State group and expressing a desire to kill, the president said.",
      "publishedAt": "2025-01-02T05:21:00Z",
      "title": "US Army veteran who killed 15 in New Orleans attack was inspired by the Islamic State group",
      "url": "https://apnews.com/5bbf5fdc715c4d0d4c8764dd8da22720",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30276dc076b941a1bc8b545207ba2049/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — An 18-year-old girl dreaming of becoming a nurse, a single mother, a father of two and a former Princeton football star suffered fatal injuries when the driver of a white pickup truck sped down Bourbon Street, packed with holiday revelers early Wednesday morning.",
      "publishedAt": "2025-01-01T22:58:04Z",
      "title": "An aspiring nurse, a football star, a single mother and a father of 2 killed in New Orleans attack",
      "url": "https://apnews.com/9f2fbcc3e48d8b391590f60969e80e61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d673e497d33f474898533cbcb489487c/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Authorities say the driver of a pickup truck sped through a crowd of pedestrians gathered in New Orleans’ bustling French Quarter district early on New Year's Day, killing at least 15 people and injuring about 30 other revelers.",
      "publishedAt": "2025-01-01T14:40:46Z",
      "title": "What we know about a vehicle attack on pedestrians in New Orleans that killed at least 15",
      "url": "https://apnews.com/1685016388d65039ce62e720aab2ba14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27781d03090541dc8c31d68e7a65ac8d/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The FBI says it recovered the stark black banner of the Islamic State extremist group from the truck that an American man from Texas smashed into New Year's partygoers in New Orleans' French Quarter Wednesday, killing 15 people.",
      "publishedAt": "2025-01-01T23:53:08Z",
      "title": "What is the Islamic State group, and what attacks has it inspired by offshoots and lone wolves?",
      "url": "https://apnews.com/4bb6446c484737fbe9dd1b9c26a899a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4a0a669baeb44b9999ef0aba79a71c0/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "President Joe Biden is bestowing the second highest civilian medal on Liz Cheney and Bennie Thompson — the lawmakers who led the congressional investigation into the violent Jan.",
      "publishedAt": "2025-01-02T05:00:23Z",
      "title": "Biden is giving the second highest civilian award to the leaders of the Jan. 6 congressional panel",
      "url": "https://apnews.com/f725b7003ea11239b90962a8cf0d5305",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a80069d3585f44008c9ff4ad278a06c9/3000.jpeg"
    },
    {
      "author": "TY O'NEIL and ANITA SNOW",
      "description": "LAS VEGAS (AP) — Firework mortars and camp fuel canisters were found stuffed into the back of the Tesla Cybertruck that exploded outside President-elect Donald Trump's Las Vegas hotel early Wednesday, killing a suspect inside the vehicle and sparking an intense investigation into possible terrorism.",
      "publishedAt": "2025-01-01T19:32:11Z",
      "title": "Firework mortars, gas cannisters stuffed inside Tesla that exploded outside Trump's Las Vegas hotel",
      "url": "https://apnews.com/ad4c171c7a6af64f08db93d9fdc2d749",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d5b0a1cb17947c188eb1e57ebad2300/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Ruth. Gehrig. DiMaggio. Mantle. Giuliani?As Rudy Giuliani’s life gets stripped for parts to satisfy a $148 million defamation verdict, the former New York City mayor is fighting to keep one gleaming set of sports memorabilia in the family: Yankees World Series rings bestowed to him by the team’s late owner, George Steinbrenner.",
      "publishedAt": "2025-01-02T05:27:01Z",
      "title": "Rudy at the Bat: Giuliani fights to save his Yankees World Series rings from $148 million verdict",
      "url": "https://apnews.com/3515aed30e385a3612c06383c5b9119c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cc4adf09e8d4512ab202c4c041b51c5/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Impeached South Korean President Yoon Suk Yeol, in a message to conservative supporters rallying outside his Seoul residence, vowed to “fight to the end” against “anti-state forces,” while his legal team warned Thursday that police officers attempting to detain him could face arrest by his presidential security service or even civilians.",
      "publishedAt": "2025-01-02T04:02:34Z",
      "title": "Impeached South Korean president issues defiant message as he faces possible detention",
      "url": "https://apnews.com/1779809dc6b2c7e5a9478bac17ca7585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10db29dfcdc64032a3d4345cf026bc7c/1920.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "PASADENA, Calif. (AP) — Second chances don’t come around often in life, Ohio State coach Ryan Day told his players in a team meeting before the Rose Bowl.After a season in which they fell short at too many key moments, the Buckeyes all knew they had one of those second chances when they stepped onto this famous turf for another shot at the top-ranked, unbeaten Oregon Ducks.",
      "publishedAt": "2025-01-02T01:36:51Z",
      "title": "No. 6 Ohio State routs top-ranked Oregon 41-21 in the Rose Bowl, advances to CFP semifinals",
      "url": "https://apnews.com/8030a2a37d45c1a6d7dd15b51ae6c098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35da7899addb4ff5a0d90666683936bc/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "COLORADO SPRINGS, Colo. (AP) — It was a decision that robbed hundreds of athletes of their once-in-a-lifetime chance at Olympic glory, and for more than four decades, it weighed heavily on the man who made it — Jimmy Carter.",
      "publishedAt": "2025-01-02T05:21:33Z",
      "title": "Carter reflected on 1980 Olympic boycott: ‘A bad decision’",
      "url": "https://apnews.com/9ba0aad38e01013bd0f40ce554317caf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/735aa30f4f1b485b9d773576f0abb8e2/2914.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}