{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is visiting Texas on Friday to assess catastrophic flooding that has killed at least 120 people. Despite his past calls to phase out the Federal Emergency Management Agency, Trump has praised the federal response to the disaster. He plans to tour affected areas by air, meet first responders and speak with victims' families. The administration has shifted focus from reducing federal disaster management to addressing the tragedy's human impact. But even though Trump hasn't been as vocal about his push to shutter FEMA, Homeland Security Secretary Kristi Noem in recent days has highlighted efforts to streamline its operations.",
      "publishedAt": "2025-07-11T04:00:41Z",
      "title": "Trump plans to tour Texas flood damage",
      "url": "https://apnews.com/article/trump-texas-floods-fema-phase-out-b77d9681d2d39f8c201351b54ecf944f",
      "urlToImage": "https://dims.apnews.com/dims4/default/80ea1a6/2147483647/strip/true/crop/7897x4442+0+411/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F8a%2Fbbb7b4815157ae028222b65f980f%2F3462225b773643a495456c7fefc4c5a9"
    },
    {
      "author": null,
      "description": "Officials say a Russian drone barrage has targeted the center of Kharkiv, injuring nine people and damaging a maternity hospital in Ukraine’s second-largest city. Kharkiv's mayor says mothers with newborns are being evacuated to a different medical facility. He didn’t say whether anyone at the hospital was among the injured. Russia’s recent escalation of long-range Shahed drone attacks on Ukrainian cities, which often also include ballistic and cruise missiles as well as powerful glide bombs, has brought renewed urgency to efforts to improve Ukraine’s air defenses after more than three years of war.",
      "publishedAt": "2025-07-11T10:50:26Z",
      "title": "Russian drones strike Ukraine's 2nd-largest city, damaging a maternity hospital",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-trump-drones-05ba74cd9fbefcd81cc90886d091af5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9fbcba8/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F8f%2Fea396ac7ca0fc57ae48e48353a2c%2F75d6148464a0423c8a407981520f9f1c"
    },
    {
      "author": null,
      "description": "A divided federal appeals court has thrown out an agreement that would have allowed accused Sept. 11 mastermind Khalid Sheikh Mohammed to plead guilty in a deal that would have spared him the risk of execution for al-Qaida’s 2001 attacks. The decision Friday undoes an attempt to wrap up more than two decades of military prosecution beset by legal and logistical troubles. It suggests no quick end to the long struggle by the U.S. military and successive administrations to bring to justice the man charged with planning one of the deadliest attacks ever on the United States. Mohammed is accused of developing and directing the plot to crash hijacked airliners into the World Trade Center and the Pentagon.",
      "publishedAt": "2025-07-11T16:00:11Z",
      "title": "Court throws out plea deal for alleged Sept. 11 mastermind",
      "url": "https://apnews.com/article/sept-11-guantanamo-plea-deal-mohammed-1a982f469fe828f3dcd01de39ab11987",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The State Department is firing over 1,300 career diplomats and civil servants in line with a dramatic reorganization plan initiated by the Trump administration earlier this year. A senior State Department official said Friday the department is sending layoff notices to 1,107 civil servants and 246 foreign service officers with domestic assignments in the United States. While lauded by President Donald Trump's administration as overdue and necessary to make the department leaner and more efficient, the cuts have been roundly criticized by current and former diplomats who say they will weaken U.S. influence and its ability to counter existing and emerging threats abroad.",
      "publishedAt": "2025-07-11T11:29:32Z",
      "title": "State Department laying off 1,300 staffers under Trump plan",
      "url": "https://apnews.com/article/layoffs-diplomats-state-department-trump-rubio-bfdb86767b7bd5b6570819d404a7782e",
      "urlToImage": "https://dims.apnews.com/dims4/default/fab6f77/2147483647/strip/true/crop/7632x4293+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F12%2Fbb36e8e47bc3677cddfba58d89aa%2Fc3d65919cb014d26936ecc18b1c6546a"
    },
    {
      "author": null,
      "description": "A Pennsylvania man who posted a YouTube video of his father’s severed head has been convicted of murder. Bucks County Judge Stephen A. Corr issued the guilty verdict against Justin D. Mohn on Friday in the January 2024 shooting death of his father, Michael F. Mohn, at their home in the Philadelphia suburbs. Prosecutors said Mohn shot his 68-year-old father with a newly purchased pistol, then decapitated him with a kitchen knife and machete. The 33-year-old was arrested after scaling a fence at the state’s National Guard headquarters.",
      "publishedAt": "2025-07-11T15:13:41Z",
      "title": "Pennsylvania man who posted video of father’s severed head online is found guilty of murder",
      "url": "https://apnews.com/article/father-beheaded-online-video-head-pennsylvania-mohn-ee1069e457493b47ea7601724a14a1a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a231b8/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fec%2F5e35d3ce4668ddc1cead1f0471ff%2F99338b4267aa4b78bd2f171be6d8b6fb"
    },
    {
      "author": null,
      "description": "Communities in rural Vermont face damaged homes and washed-out roads after heavy rainfall caused flash flooding. Up to 5 inches of rain fell in just a few hours on Thursday, swelling waterways and isolating nearly 20 homes in Sutton. Swift-water rescue teams evacuated residents from two homes. This marks the third consecutive summer of severe flooding in the state. According to the National Weather Service, Vermont's frequent floods can be linked to climate change and its mountainous terrain. Meanwhile, Massachusetts also experienced flash flooding on Thursday, with over seven inches of rain disrupting businesses and commuters.",
      "publishedAt": "2025-07-11T16:39:42Z",
      "title": "Flash floods once again hit Vermont, damaging homes and roads",
      "url": "https://apnews.com/article/flooding-vermont-storms-5c358c58633fcc8d566596e157cbf094",
      "urlToImage": "https://dims.apnews.com/dims4/default/60c9648/2147483647/strip/true/crop/2048x1152+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F39%2Fe7f3bf82c0ab30c7cc72cf74a22c%2Fd7e7a4fe36124928a4b5be9786426389"
    },
    {
      "author": null,
      "description": "The son of notorious Mexican drug kingpin “El Chapo” has pleaded guilty to U.S. drug trafficking charges. He is the first of El Chapo’s sons facing similar charges to enter a plea deal. Prosecutors allege Ovidio Guzman Lopez, along with his brother, Joaquin Guzman Lopez, known as the “Chapitos,” or little Chapos, ran a faction of the Sinaloa cartel that exported fentanyl to the United States. Ovidio Guzman Lopez previously pleaded not guilty, but on Friday pleaded guilty to drug trafficking, money laundering and firearms charges tied to his leadership role in the cartel as part of a plea deal.",
      "publishedAt": "2025-07-11T04:08:58Z",
      "title": "Son of ‘El Chapo’ pleads guilty in US drug trafficking case",
      "url": "https://apnews.com/article/el-chapo-son-drug-trafficking-sinaloa-chicago-68614b0ed663925eca1a72d9539403cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/9582a6a/2147483647/strip/true/crop/1941x1092+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F3a%2F5488c45fc01abf011b9294a1eb57%2F4e8305e3b7334679a5d8295d860a1a4d"
    },
    {
      "author": null,
      "description": "Just hours after hitting all-time highs, Wall Street was poised to open with losses, a possible sign that President Donald Trump’s wave of tariff letters is again raising concern among investors. Futures for the S&P 500 and the Nasdaq fell 0.5% before the bell Friday, while futures for the Dow Jones Industrial Average slid 0.6%. Trump said in a letter Thursday that he'll raise taxes on many imported goods from Canada to 35%, deepening the rift between the longtime North American allies. Meanwhile, bitcoin climbed to a new all-time high Friday, briefly eclipsing $118,000 before settling around $117,600.",
      "publishedAt": "2025-07-11T04:45:03Z",
      "title": "Wall Street poised to open lower Friday as Trump's tariff letters spark investor anxiety",
      "url": "https://apnews.com/article/financial-markets-asia-wall-street-bitcoin-fd74377af3bc0d4617fe7263e053ffc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/c0ac172/2147483647/strip/true/crop/8335x4688+0+434/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F6a%2F7d9411bb44aeb645fbaaa5f79a64%2F21594d061bad49d5b511749a11cd8337"
    },
    {
      "author": null,
      "description": "“The Salt Path” is a memoir of resilience and courage that captured the hearts of millions and which was subsequently adapted for the big screen with actors Gillian Anderson and Jason Isaacs taking the lead roles. But now the book and the film are mired in controversy. A report in last Sunday’s The Observer newspaper said that there was more to the 2018 book than met the eye. It said that key elements of the story had been fabricated. Author Raynor Winn accepts “mistakes” were made but that the overarching allegations were “highly misleading.” She has sought legal counsel. The Bookseller magazine said that publisher Penguin Michael Joseph on Friday agreed with Winn to delay the publication of her next book.",
      "publishedAt": "2025-07-11T12:55:10Z",
      "title": "'The Salt Path:' A book that captured the hearts of millions, but now mired in controversy",
      "url": "https://apnews.com/article/salt-path-book-controversy-raynor-winn-202a7afe0226f9771fe4ea34d371e730",
      "urlToImage": "https://dims.apnews.com/dims4/default/811da62/2147483647/strip/true/crop/7659x4308+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F38%2Fecb462400f8cfc520505b235aac1%2F483876f5d49d430fa9603b9a72dbd7db"
    },
    {
      "author": null,
      "description": "Carlos Alcaraz has defeated Taylor Fritz 6-4, 5-7, 6-3, 7-6 (6) to move within one victory of a third consecutive Wimbledon championship. Alcaraz's victory Friday puts him into the final against either No. 1 Jannik Sinner or 24-time major champion Novak Djokovic. Alcaraz beat Djokovic in the past two finals at the All England Club. The 22-year-old Alcaraz is 5-0 so far in Grand Slam title matches. That includes a five-set comeback win over Sinner at the French Open a month ago. The fifth-seeded Fritz was trying to become the first American man in the Wimbledon final since Andy Roddick lost to Roger Federer in 2009.",
      "publishedAt": "2025-07-11T07:00:06Z",
      "title": "Alcaraz beats Fritz to get back to the Wimbledon final",
      "url": "https://apnews.com/article/wimbledon-semifinals-alcaraz-fritz-djokovic-sinner-4ac6eb82dbb3b3cd9ecd74b79cd88f53",
      "urlToImage": "https://dims.apnews.com/dims4/default/04ef134/2147483647/strip/true/crop/5096x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F6b%2Fea5ff3ff709c1f37fca9cccf6a7e%2Fd72637e2618543a79ef97bf8428536c9"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}