{
  "articles": [
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    },
    {
      "author": "Kevin Freking, Stephen Groves",
      "description": "The commemoration of Russia’s invasion of Ukraine three years ago was mostly a Democratic affair at the U.S. Capitol. A press conference Monday evening held by members of the Congressional Ukraine Caucus featured just one Republican out of the 18 or so who attended. Democrats also dominated the House and Senate floor time spent on the topic. The split screen was another indication of just how much the debate over Ukraine has changed in the nation’s Capitol. While some congressional Republicans still voice support for Ukraine, they aren't defying Trump’s new direction, instead holding out hope that he will come around to supporting Kyiv.",
      "publishedAt": "2025-02-25T22:32:01Z",
      "title": "Scenes at US Capitol reflect growing partisan divide on Ukraine",
      "url": "https://apnews.com/article/congress-ukraine-trump-invasion-anniversary-38c34838d64dc9620578ac37934f8d72",
      "urlToImage": "https://dims.apnews.com/dims4/default/795d4f3/2147483647/strip/true/crop/5523x3107+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2Fa8%2F26f51e78b427964efa81c4039f4a%2F972e6299f88e4d88adaf72cf9083138d"
    },
    {
      "author": "Sylvie Corbet",
      "description": "French President Emmanuel Macron traveled to Washington seeking to convince U.S. President Donald Trump to stand by Europe’s side in his talks with Russia about ending the war in Ukraine. As Macron left the White House, he called the meeting a “turning point” — yet Trump made no promises. Following Monday’s meeting, Macron praised Trump’s move toward Putin in an interview on Fox News, saying it may lead to a truce between Russia and Ukraine in the coming weeks. Macron did not come to Washington empty handed. He repeatedly said he would push to boost French and European defense spending, in response to one of Trump’s most insistent demands. Trump didn’t make any promises regarding Ukraine’s sovereignty or Europe’s security.",
      "publishedAt": "2025-02-25T19:59:41Z",
      "title": "Macron got no promises on Ukraine but called his meeting with Trump a 'turning point'",
      "url": "https://apnews.com/article/macron-trump-relationship-ukraine-russia-41e95e7ef6a02bb9c7faf69b50ed89dd",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6d5e33/2147483647/strip/true/crop/4176x2349+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fb2%2F2ead4e096aeda05de8279a9c8873%2F7fcbbba63e8c4adf9f3583a805dcc3b8"
    },
    {
      "author": "Edith M. Lederer",
      "description": "Latvia’s foreign minister is warning that Russian President Vladimir Putin will try to achieve in peace talks what he hasn’t been able to accomplish in his war against Ukraine — weaken the United States and restore control over his smaller neighbor. Baiba Braže spoke to The Associated Press on Tuesday at the United Nations. It is a week of intense diplomacy between Europe and the United States following President Donald Trump’s upending of U.S. policy with his decision to hold direct talks with Russia, while excluding Ukraine and its European allies from the initial discussions.",
      "publishedAt": "2025-02-26T05:01:42Z",
      "title": "Latvia FM: Putin will try to achieve in peace talks what he couldn't in Ukraine war — weaken the US",
      "url": "https://apnews.com/article/un-latvia-russia-ukraine-war-putin-trump-ed920ae9ff7fc3570018bf5ba8b3edaa",
      "urlToImage": "https://dims.apnews.com/dims4/default/eaf9e72/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fe8%2F2975196410b09d511c97090d0abd%2F3cb5218bb87144a79e7e006c43bea0eb"
    },
    {
      "author": "Melanie Lidman",
      "description": "Tens of thousands of Israelis have lined highways holding flags, orange balloons and signs saying “forgive us” in an outpouring of grief as the bodies of a mother and her two small sons who were killed in captivity in the Gaza Strip were taken for burial. The Bibas family’s plight has come to embody the profound sense of loss and grief still permeating Israel after Hamas’ Oct. 7, 2023 attack. Israel says the boys were killed by their captors in November 2023, a month after they were abducted, while Hamas claims the family was killed in an Israeli airstrike. Their bodies were released as part of a fragile ceasefire deal. They are to be buried on Wednesday.",
      "publishedAt": "2025-02-26T10:14:09Z",
      "title": "Israelis bid farewell to a mother and her two young sons killed in captivity in Gaza",
      "url": "https://apnews.com/article/israel-gaza-ceasefire-bibas-hostages-funeral-02e50d565e28e82ace012e001e9a4e3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/3124ce0/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F2c%2F6cf217c7a4eed4c627218f88355d%2F3e43a3d4577e4c5d92cae625fae37743"
    },
    {
      "author": "Michael Biesecker",
      "description": "Five Microsoft employees have been ejected from a meeting with the company’s chief executive for protesting the company providing artificial intelligence and cloud computing services to the Israeli military. The protest came after an investigation by The Associated Press revealed sophisticated AI models from Microsoft and OpenAI had been used as part of an Israeli military program to select bombing targets during the recent wars in Gaza and Lebanon. Microsoft CEO Satya Nadella was speaking Monday about new products when workers standing about 15 feet to his right revealed T-shirts that spelled out the question “Does Our Code Kill Kids, Satya?”",
      "publishedAt": "2025-02-25T20:23:36Z",
      "title": "Microsoft workers protest sale of AI and cloud services to Israeli military",
      "url": "https://apnews.com/article/israel-palestinians-ai-technology-microsoft-gaza-lebanon-90541d4130d4900c719d34ebcd67179d",
      "urlToImage": "https://dims.apnews.com/dims4/default/00583b6/2147483647/strip/true/crop/5496x3092+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2Fd7%2Fb21531f25a185ed1cad4735fbd7d%2F2b90c448ed614ef18603625be7c9bf91"
    },
    {
      "author": "Hyung-jin Kim",
      "description": "A small group of foreign tourists has visited North Korea in the past week. They are the first international travelers to enter the country in five years except for a group of Russian tourists who went to the North last year. Experts say the latest trip indicates North Korea may be gearing up for a full resumption of its international tourism to bring in much-needed foreign currency to revive its struggling economy. The Beijing-based travel company Koryo Tours said it arranged a five-day trip from Feb. 20 to Feb. 24 for 13 international tourists to the northeastern North Korean border city of Rason, where the country’s special economic zone is located.",
      "publishedAt": "2025-02-26T10:28:19Z",
      "title": "International tourists visit North Korea for the first time in years",
      "url": "https://apnews.com/article/north-korea-international-tourism-c50320e71d064fdfb948f66a7a7a5634",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ece6f2/2147483647/strip/true/crop/1389x781+0+109/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2Ffc%2F280e8654852e8d3e3fdf88ac4884%2Fc5365219c1824bc8a2f5671dda0fcefb"
    },
    {
      "author": "Samy Magdy, Melanie Lidman",
      "description": "Hamas says that it will return the bodies of four dead hostages on Thursday in exchange for Israel’s release of hundreds of Palestinian prisoners, two days before the first phase of the ceasefire between the warring parties is set to expire. Israel had delayed the release of some 600 Palestinian prisoners over what it said was the cruel treatment of hostages during their release by the militant group. The deadlock over the exchange had threatened to collapse the ceasefire when the current six-week first phase of the deal expires this weekend. Hamas' latest announcement on Wednesday would complete both sides’ obligations of the first phase of the ceasefire.",
      "publishedAt": "2025-02-26T07:47:50Z",
      "title": "Hamas to turn over bodies of four Israeli hostages in exchange for release of hundreds of prisoners",
      "url": "https://apnews.com/article/israel-hamas-hostages-ceasefire-witkoff-494b3f97c46f17f42213f3a71375c345",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ee5dbb/2147483647/strip/true/crop/4205x2365+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F1d%2Fd3939cf0fbecc8e6c6753b390801%2F513def2fe46642a1a129ff228b52fbce"
    },
    {
      "author": "Nicole Winfield, Silvia Stellacci",
      "description": "Pope Francis remains in critical condition and is resting. Wednesday's morning update came as Argentines and Romans alike gathered in the Eternal City to pray for his recovery from double pneumonia. The Vatican’s short morning update said that the “pope had a peaceful night and is resting.” The faithful from Francis’ homeland gathered in the Argentine church of Rome on Tuesday night for a special Mass presided over by the pope’s vicar for Rome.",
      "publishedAt": "2025-02-26T07:46:03Z",
      "title": "Pope resting as Argentines in Rome pray for his recovery",
      "url": "https://apnews.com/article/vatican-pope-hospital-pneumonia-argentina-ae4275503e12684b34d69d7cfde3a092",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f4e996/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F2c%2Fde903daa352d526506f7ca6dc989%2F16231cb5d7384b8d9ebb45228a96a239"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Matt Brown",
      "description": "House Republicans have muscled their budget blueprint to passage, with a push from President Donald Trump. The vote late Tuesday evening is a crucial step toward delivering what he's called his “big, beautiful bill,” with $4.5 trillion in tax breaks and $2 trillion in spending cuts. It kickstarts a weeks-long process to draft the details and merge with the Senate. The vote was 217-215 with all Democrats opposed. But even some Republicans are uneasy. As Elon Musk is tearing through the federal government, Republicans are being hammered at town halls back home. It's a familiar GOP problem that slashing federal spending is easier said than done, as constituents rely on Medicaid and other programs and services.",
      "publishedAt": "2025-02-25T12:04:42Z",
      "title": "Mike Johnson tries to push Trump's agenda forward, but votes in jeopardy",
      "url": "https://apnews.com/article/johnson-trump-republicans-budget-vote-tax-cuts-4cb74ca15f6a74a7344355e4507ab9fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/795d4f3/2147483647/strip/true/crop/5523x3107+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2Fa8%2F26f51e78b427964efa81c4039f4a%2F972e6299f88e4d88adaf72cf9083138d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}