{
  "articles": [
    {
      "author": "NAJIB JOBAIN and JACK JEFFREY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Battles between Israel and Hamas around hospitals forced thousands of Palestinians to flee from some of the last perceived safe places in northern Gaza, stranding critically wounded patients, newborns and their caregivers with dwindling supplies and no electricity, health officials said Monday.",
      "publishedAt": "2023-11-13T07:30:24Z",
      "title": "Medics and patients, including babies, stranded as battles rage around Gaza hospitals",
      "url": "https://apnews.com/c98faefe9d5bb213d3e44cf9defd5990",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c528e68e3abf4ab5bdcc66ccafa9f696/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — A camera livestreaming the skyline of Gaza City captures streaks of light. Dash-cam video from a car in Israel spots a killer coming into view. A satellite identifies tank tracks in the dirt, and a mall security camera catches the moment a bomb in Gaza detonates.",
      "publishedAt": "2023-11-13T05:03:18Z",
      "title": "For news organizations, the flood of Gaza war video is proving both illuminating and troubling",
      "url": "https://apnews.com/c5e23399d190b3b1161eee90ee055ceb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d0474d5b5540cfb4ab4ce08bb64e8d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump Jr. returned to court Monday as something of a character witness for his father’s real estate empire, waxing exuberantly about the former president’s “incredible vision” as a developer and his company’s portfolio of “great, iconic projects\" at the New York civil fraud trial now threatening its future.",
      "publishedAt": "2023-11-13T05:31:28Z",
      "title": "Donald Trump Jr. exuberantly lauds dad’s real estate exploits as civil fraud trial shifts to defense",
      "url": "https://apnews.com/4727a8f5345c1ab794d33d0c9bcc990f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23b3388064d64611becc3b183e1fde6d/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — The course of events in the year since the last meeting between Presidents Joe Biden and Xi Jinping offers cautious hope that they will have better luck this time around. But it also shows how easily any agreement they reach could once again veer off course.",
      "publishedAt": "2023-11-13T14:10:16Z",
      "title": "This year's Biden-Xi summit has better foundation but South China Sea and Taiwan risks won't go away",
      "url": "https://apnews.com/92bff09d3031d352c0fc4af05e2532e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4372146ca3e948fca3063a6541f642de/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — International students attended U.S. universities in surging numbers last year, rebounding from a pandemic slump with the help of a 35% jump in students coming from India, according to a study released Monday.",
      "publishedAt": "2023-11-13T05:15:10Z",
      "title": "International students have returned to US colleges, fueled by a surge from India",
      "url": "https://apnews.com/8104695e27ca9d035ce6f15ad52f1bc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b05ff72dae2b4b8f9d015b89a4d7f52d/2624.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — As political comebacks go, former British Prime Minister David Cameron’s return to government as foreign secretary is more dramatic and unexpected than most.",
      "publishedAt": "2023-11-13T17:04:26Z",
      "title": "Why David Cameron is a surprising choice as new UK foreign policy chief after fateful Brexit vote",
      "url": "https://apnews.com/81dadeb68e681d0fcf0a6221441f5941",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10487eb12a1b45b989921de6f64b210c/3000.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SAN FRANCISCO (AP) — Prosecutors brought forward a string of law enforcement officials Monday to provide context around video that's at the crux of their case against David DePape, the man accused of attacking former House Speaker Nancy Pelosi's husband at the couple's San Francisco home last year.",
      "publishedAt": "2023-11-13T18:15:29Z",
      "title": "FBI, Capitol police testify in the trial of the man accused of attacking Nancy Pelosi's husband",
      "url": "https://apnews.com/fb32db568be375e4c4fc26f41d283d7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e676f636e11b4404be2b77497bd8b177/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "A recent boom in psychedelic research has given way to a bumper crop of startups seeking to harness the potential of mind-altering drugs for treating depression, addiction and other conditions.In this crowded field, Vancouver-based Filament Health has a unique approach: extracting drugs like psilocybin and mescaline from natural sources, including mushrooms and cacti, rather than synthesizing the ingredients in a laboratory.",
      "publishedAt": "2023-11-13T14:27:39Z",
      "title": "In crowded field of psychedelic startups, Filament CEO makes case for 'natural' drugs",
      "url": "https://apnews.com/aadee1fa4e84692d614888fa5ff66d18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8bd25de21b3456f9415a7790f942735/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — The tiny Caribbean island of Dominica is creating the world’s first marine protected area for one of earth’s largest animals: the endangered sperm whale.Nearly 300 square miles (800 square kilometers) of royal blue waters on the western side of the island nation that serve as key nursing and feeding grounds will be designated as a reserve, the government announced Monday.",
      "publishedAt": "2023-11-13T15:00:55Z",
      "title": "Caribbean island of Dominica creates world's first marine protected area for endangered sperm whale",
      "url": "https://apnews.com/c1a1c8fa801c36d53192355e34331649",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bcc41536e6b4f57a69f2c19ecaaecda/2977.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Long-haul carrier Emirates opened the Dubai Air Show on Monday with a $52 billion purchase of Boeing Co. aircraft, showing how aviation has bounced back after the groundings of the coronavirus pandemic, even as Israel's war with Hamas clouds regional security.",
      "publishedAt": "2023-11-13T04:19:04Z",
      "title": "Long-haul carrier Emirates opens Dubai Air Show with $52 billion aircraft purchase from Boeing",
      "url": "https://apnews.com/d2ca068f0c88592c60eb9f11737baa46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91a90dec397b4de1ab99b88975a6e99d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}