{
  "articles": [
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine President Volodymyr Zelenskyy said Sunday that defense minister Oleksii Reznikov will be replaced this week with Rustem Umerov, a Crimean Tatar lawmaker.Zelenskyy made the announcement on his official Telegram account.",
      "publishedAt": "2023-09-03T10:20:51Z",
      "title": "Ukraine President Zelenskyy says defense minister Oleksii Reznikov will be replaced this week",
      "url": "https://apnews.com/a795984a5c42f5a65f64f2e35772a49b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a111322c42f541c5a5a20de5bd5a7aa5/3000.jpeg"
    },
    {
      "author": null,
      "description": "BLACK ROCK DESERT, Nev. (AP) — Tens of thousands of people gathered for the Burning Man festival remained stranded in the Nevada desert on Sunday after storms that swept through the area, as authorities investigated a possible death and worked to open exit paths by the end of the Labor Day weekend.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Burning Man flooding strands tens of thousands at Nevada site; authorities are investigating 1 death",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": "REBECCA BLACKWELL and JAMES POLLARD",
      "description": "HORSESHOE BEACH, Fla. (AP) — This remote seaside enclave known as “Florida's Last Frontier” took much of the pounding from Hurricane Idalia when it struck the state's west coast as a Category 3 storm last week.",
      "publishedAt": "2023-09-03T14:40:41Z",
      "title": "Florida fishing village Horseshoe Beach hopes to maintain its charm after being walloped by Idalia",
      "url": "https://apnews.com/3d06d0c0856d16d38f89e0ee91b23511",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b40d2b50a774fb28eb9835a1d1e194f/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "It seemed wistfully appropriate, somehow, that news of Jimmy Buffett’s death emerged at the beginning of the Labor Day weekend, the demarcation point of every American summer’s symbolic end.",
      "publishedAt": "2023-09-03T14:23:43Z",
      "title": "Americans have long wanted the perfect endless summer. Jimmy Buffett offered them one",
      "url": "https://apnews.com/8e9122bf72b07775ef3fb79f4b851661",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81fbe6ab63db4405a27addec43e85323/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "OSKALOOSA, Iowa (AP) — Tim Scott seldom specifically brings up race in Iowa. Nor does the Republican presidential candidate have to.",
      "publishedAt": "2023-09-03T11:48:22Z",
      "title": "Tim Scott is the top Black Republican in the GOP presidential primary. Here's how he discusses race",
      "url": "https://apnews.com/0861ed7c4343b007d82ecbb79a9a7e46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54301c07b3de4c50be29c376800efc43/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Body camera video of the fatal police shooting of Ta'Kiya Young, a 21-year-old pregnant mother in a suburb of Columbus, Ohio, has raised questions about how an allegation of shoplifting led to a bullet being fired through her windshield.",
      "publishedAt": "2023-09-03T04:04:24Z",
      "title": "Fatal police shooting of pregnant Ohio woman raises concerns over firing at moving vehicles",
      "url": "https://apnews.com/8bb256e64494834a84bee8bac3321d97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ffaadc2589b4c0d9533cd7833d45ad6/3000.jpeg"
    },
    {
      "author": "ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES, Argentina (AP) — If a baby was taken from their parents four decades ago during Argentina's military dictatorship, what would that person look like today?Argentine publicist Santiago Barros has been trying to answer that question using artificial intelligence to create images of what the children of parents who disappeared during the dictatorship might look like as adults.",
      "publishedAt": "2023-09-03T04:09:36Z",
      "title": "AI project imagines adult faces of children who disappeared during Argentina's military dictatorship",
      "url": "https://apnews.com/b847832cbaa940889d2448c0ff6d8a20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5bb92994a70463f82d1ddb9fe13132e/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "MANILA, Philippines (AP) — The U.S. is assured of going to the Paris Olympics. That's good. It also has a quarterfinal game at the World Cup awaiting Tuesday. That's also good.Thing is, the only celebrating in Manila on Sunday night was done by the guys in the other locker room.",
      "publishedAt": "2023-09-03T13:46:16Z",
      "title": "US falls to Lithuania at Basketball World Cup but still qualifies for Paris Olympics",
      "url": "https://apnews.com/f4855c75df6bd6c048d86bbaafc7454d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/506f5313fb42437b93432cd7be7d265f/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu said Sunday he wants Eritrean migrants involved in a violent clash in Tel Aviv to be deported immediately and has ordered a plan to remove all of the country's African migrants.",
      "publishedAt": "2023-09-03T09:31:50Z",
      "title": "Israel's Netanyahu says he wants Eritrean migrants involved in violent clashes to be deported",
      "url": "https://apnews.com/25d4e5ebe0bda2d6c40e2ae25c1e0cf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/672b51cf09874e8fbbc5e3eebb199473/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "The third installment in the Denzel Washington-led “Equalizer” franchise topped the domestic box office this weekend with $34.5 million according to studio estimates Sunday. By the end of the Monday holiday, Sony expects that total will rise to $42 million.",
      "publishedAt": "2023-09-03T15:34:49Z",
      "title": "‘Equalizer 3’ cleans up, while ‘Barbie’ and ‘Oppenheimer’ score new records",
      "url": "https://apnews.com/884055fee9d4cbb6cdea0239eb735077",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4487599394774e8b8238d317e7d1a931/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}