{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, TIA GOLDENBERG and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel and Hamas on Wednesday agreed to a four-day cease-fire in the war in Gaza — a diplomatic breakthrough that will free dozens of hostages held by militants as well as Palestinians imprisoned in Israel, and bring a large influx of aid to the besieged territory.",
      "publishedAt": "2023-11-22T06:55:51Z",
      "title": "Israeli official says talks continuing, hostage release won't take place before Friday",
      "url": "https://apnews.com/d12c1728cbae0ff74a69cc9cc3e8a646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2038b1664484226bc2c8196f96859cb/1920.jpeg"
    },
    {
      "author": "VICTOR CAIVANO",
      "description": "GAZA CITY, Gaza Strip (AP) — The Israeli military on Wednesday unveiled what it claimed was a Hamas military facility under Gaza's largest hospital, showing what appeared to be a subterranean dormitory to a group of foreign journalists who were given a rare glimpse inside the besieged enclave.",
      "publishedAt": "2023-11-23T00:42:03Z",
      "title": "Israel unveils what it claims is a major Hamas militant hideout beneath Gaza City's Shifa Hospital",
      "url": "https://apnews.com/c71ebee136e018fd5a3572a54040f73e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44d5859dba26462aa42cec3a029506fe/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and RAF CASERT",
      "description": "THE HAGUE, Netherlands (AP) — The far-right, anti-Islam populist Geert Wilders was headed for a massive parliamentary election victory Wednesday in one of the biggest political upsets in Dutch politics since World War II, and one that is bound to send shockwaves through Europe.",
      "publishedAt": "2023-11-22T06:32:08Z",
      "title": "Anti-Islam populist Wilders heading for a massive win in Netherlands in a shock for Europe",
      "url": "https://apnews.com/f31f57a856f006ff0f2fc4984acaca6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eaa0ccdc9ad3498e8a489699a384ad9b/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "The late crush of holiday travelers picked up steam Wednesday, with about 2.7 million people expected to board flights and millions more planning to drive or take the train to Thanksgiving celebrations.",
      "publishedAt": "2023-11-22T05:06:39Z",
      "title": "Record Thanksgiving travel rush off to a smooth start despite snowy forecast",
      "url": "https://apnews.com/7858946c4d16fdf4291a66d82ea91ac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5aad664ce4c43068bd9795a6e5c4c37/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — It's been quite a week for ChatGPT-maker OpenAI — and co-founder Sam Altman.Altman, who helped start OpenAI as a nonprofit research lab back in 2015, was removed as CEO Friday in a sudden and mostly unexplained exit that stunned the industry.",
      "publishedAt": "2023-11-22T21:05:00Z",
      "title": "What does Sam Altman's firing — and quick reinstatement — mean for the future of AI?",
      "url": "https://apnews.com/51ae332acc18a41b51df5a39efa146d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b764f7c94dd64d279b23510acb603bea/1920.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina ’s President-elect Javier Milei has called for the wholesale reinvention of the government but he has precious little time.",
      "publishedAt": "2023-11-22T21:57:29Z",
      "title": "Argentina's President-elect is racing against the clock to remake the government",
      "url": "https://apnews.com/77df30d1ae36465ee68f755a541cd837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/128564e38d884a0b9c1f315db7e0526e/2062.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON, JOHN WAWROW and JENNIFER PELTZ",
      "description": "NIAGARA FALLS, N.Y. (AP) — A vehicle speeding toward a U.S.-Canada bridge from the American side crashed and exploded at a checkpoint in Niagara Falls on Wednesday, killing two people and prompting the closing of multiple border crossings for hours.",
      "publishedAt": "2023-11-22T18:36:22Z",
      "title": "Fiery crash kills 2 at Niagara Falls' Rainbow border bridge. Officials say no sign of terrorism",
      "url": "https://apnews.com/4e8f9bfeabd94a0d8aa4d96eccd179b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91185cc4c6614251bc8d0a318c6b78df/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Just minutes after President John F. Kennedy was fatally shot as his motorcade rolled through downtown Dallas, Associated Press reporter Peggy Simpson rushed to the scene and immediately attached herself to the police officers who had converged on the building from which a sniper's bullets had been fired.",
      "publishedAt": "2023-11-22T05:04:31Z",
      "title": "JFK assassination remembered 60 years later by surviving witnesses to history, including AP reporter",
      "url": "https://apnews.com/822f26b3a850508fb1e6530b86ebf809",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2984e3d46adc425ba6f469e6d66a2306/1920.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Impossible is often just a starting point on a Christopher Nolan film and “Oppenheimer,”about the father of the atomic bomb, was no exception.",
      "publishedAt": "2023-11-22T14:50:27Z",
      "title": "The 'Oppenheimer' creative team take you behind the scenes of the film's key moments",
      "url": "https://apnews.com/500369cc4a5e7ba1a22635b0a2f358e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d4785732ff84d138b2549790761f561/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "Boo Williams wakes up each morning not knowing how the pain will hit. It could be debilitating headaches that make it impossible to get out of bed. Sometimes the pain shoots down his neck. Through all of it, he's angry.",
      "publishedAt": "2023-11-22T11:01:35Z",
      "title": "NFL disability program leaves retired Saints tight end hurting and angry",
      "url": "https://apnews.com/c69476ec32f55f678d3748fc471daef2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1bcac03d9c64156a42f08f0b7517c10/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}