{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JACK JEFFERY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli warplanes heavily bombarded an area around Khan Younis in southern Gaza on Monday as the military ordered mass evacuations from the town in the face of a widening ground offensive that is pushing Palestinians into a progressively shrinking portion of the besieged territory.",
      "publishedAt": "2023-12-04T07:49:35Z",
      "title": "Israel orders evacuations as it widens offensive, but Palestinians are running out of places to go",
      "url": "https://apnews.com/ece85568ce36cb2315f26b10adda30fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/174eb55540fe47dd87123534fc86a6e9/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and ERIC TUCKER",
      "description": "MIAMI (AP) — A former career American diplomat was charged with serving as a secret agent for communist Cuba going back decades in what prosecutors portrayed as one of the most brazen and long-running betrayals in the history of the U.S.",
      "publishedAt": "2023-12-04T16:00:43Z",
      "title": "Former career US diplomat charged with secretly spying for Cuban intelligence for decades",
      "url": "https://apnews.com/e30bf2d027e32ac8b66ff051062273dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4d90c09c592424a9f30e01c3c7a423c/2839.jpeg"
    },
    {
      "author": "MICHAEL REZENDES and JASON DEAREN",
      "description": "HAILEY, Idaho (AP) — Paul Rytting listened as a woman, voice quavering, told him her story. When she was a child, her father, a former bishop in The Church of Jesus Christ of Latter-day Saints, had routinely slipped into bed with her while he was aroused, she said.",
      "publishedAt": "2023-12-04T05:02:22Z",
      "title": "Recordings show how the Mormon church protects itself from child sex abuse claims",
      "url": "https://apnews.com/9c301f750725c0f06344f948690caf16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffd0b2dbbb5a430582f6acd46539e265/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday wrestled with a nationwide settlement with OxyContin maker Purdue Pharma that would shield members of the Sackler family who own the company from civil lawsuits over the toll of opioids.",
      "publishedAt": "2023-12-04T05:02:25Z",
      "title": "The Supreme Court wrestles with OxyContin maker's bankruptcy deal, with billions of dollars at stake",
      "url": "https://apnews.com/df2843c77fa46d8a4752d4fe43745f0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/953a17a2fb384be19b076222fb7692fc/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Treasury Secretary Janet Yellen is heading to Mexico this week to promote her agency's new strike force to help combat illicit fentanyl trafficking as the U.S. and China step up efforts to stop the movement of the powerful opioid and drug-making materials into the United States.",
      "publishedAt": "2023-12-04T17:16:35Z",
      "title": "Janet Yellen is heading to Mexico after Treasury launches a new fentanyl trafficking strike force",
      "url": "https://apnews.com/957709c4caf4cabd0cbac54f359f6c41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0883ebbd1c8e464cb6dbf7d1c7919336/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Jonathan Majors listened silently, head-cocked and eyes down, as a Manhattan prosecutor and his defense attorney offered competing accounts of a violent confrontation in the backseat of a car that led to assault charges against the film star and put his rapid Hollywood ascent on pause.",
      "publishedAt": "2023-12-04T15:43:52Z",
      "title": "Jonathan Majors assault trial starts with competing versions of a backseat confrontation",
      "url": "https://apnews.com/48e9c7b2bd7cf2bc5b93769348e88725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc76ab084d594df99e30c24608139d5c/1909.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Don’t trust the oil and gas industry to report their actual carbon pollution, said former U.S. Vice President Al Gore, who added that the man leading the United Nations climate talks runs one of the “dirtiest” oil companies out there.",
      "publishedAt": "2023-12-04T13:34:02Z",
      "title": "Gore blasts COP28 climate chief and oil companies' emissions pledges at UN summit",
      "url": "https://apnews.com/ec565d495075ed6b9c0171c1675db8f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76476b7a03b044e29cbf6ca0c37892a8/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER AND LISA MASCARO",
      "description": "WASHINGTON (AP) — As a cease-fire ticked down last week and Israel prepared to resume its round-the-clock airstrikes, Sen. Bernie Sanders and a robust group of Democratic senators had a message for their president: They were done “asking nicely” for Israel to do more to reduce civilian casualties in Gaza.",
      "publishedAt": "2023-12-04T05:06:03Z",
      "title": "Biden's allies in Senate demand that Israel limit civilian deaths in Gaza as Congress debates US aid",
      "url": "https://apnews.com/a760c44986e5381b146d370cada95b52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/958ffce23c4c43f79f77fdf3063b6a06/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "LSU's Jayden Daniels, Oregon's Bo Nix and Washington's Michael Penix Jr., transfer quarterbacks who have all played at least five college seasons, and Ohio State receiver Marvin Harrison Jr. were announced as the Heisman Trophy finalists on Monday night.",
      "publishedAt": "2023-12-05T00:02:19Z",
      "title": "Heisman finalists: LSU QB Daniels, Oregon QB Nix, Washington QB Penix Jr., Ohio St WR Harrison Jr.",
      "url": "https://apnews.com/4168b6d346694c2d5b1d47d19014f0c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81d37904d3b247328b97a92ba6912c80/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — Ten of the best songs of the year, as determined by Associated Press Music Writer Maria Sherman, in no particular order. Dive in.“On My Mama,” Victoria Monét",
      "publishedAt": "2023-12-04T17:26:22Z",
      "title": "AP's top songs of 2023: 'On My Mama,' 'Flowers,' 'Monaco' and more",
      "url": "https://apnews.com/cab41d556a9bd9b220555719aaba9b56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61a98498b61f4fc29e7de5f496a1f1a4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}