{
  "articles": [
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes on the Gaza Strip killed at least 29 people overnight and into Wednesday, including one that hit a home where displaced people were sheltering in the isolated north, killing 19, according to Palestinian medical officials.",
      "publishedAt": "2024-12-11T06:36:53Z",
      "title": "Israeli strikes on Gaza kill at least 29, Palestinian medics say",
      "url": "https://apnews.com/52692a401ef2fb7e66c0d4d00633bd10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdf0434d0a9141c8993819dcf57e8ce5/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SARAH EL DEEB and JULIA FRANKEL",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Reem Ajour says she last saw her husband and then 4-year-old daughter in March, when Israeli soldiers raided a family home in northern Gaza. She is haunted by those chaotic last moments, when the soldiers ordered her to go – to leave behind Talal and Masaa, both wounded.",
      "publishedAt": "2024-12-11T05:02:53Z",
      "title": "These Palestinians disappeared after encounters with Israeli troops in Gaza",
      "url": "https://apnews.com/f5a8633d750e496e1fe91dd07fa71a4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea6a9e7ea3d541b8ab602459ca9657c7/1920.jpeg"
    },
    {
      "author": null,
      "description": "UNITED NATIONS (AP) — Humanitarian aid to n orth Gaza, where Israel launched a ground offensive on Oct.",
      "publishedAt": "2024-12-11T00:45:24Z",
      "title": "Humanitarian aid to northern Gaza mostly blocked for the last 2 months, UN says",
      "url": "https://apnews.com/f529bf77d09e609265179e259b799c6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa1dba3baaed42e884ac72b9c2802e32/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The man charged with murder in the killing of the CEO of UnitedHealthcare made it clear he wasn’t going to make things easy on authorities, shouting unintelligibly and writhing in the grip of sheriff’s deputies as he was led into court and then objecting to being brought to New York to face trial.",
      "publishedAt": "2024-12-11T05:07:34Z",
      "title": "Man accused of killing UnitedHealthcare's CEO shouts on way into courthouse and fights extradition",
      "url": "https://apnews.com/64ba21747f41c3a81f661900e797b6d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecadcbe85c8f4808bcc92c46d704a384/1920.jpeg"
    },
    {
      "author": "JAE C. HONG, ERIC THAYER and STEFANIE DAZIO",
      "description": "MALIBU, Calif. (AP) — Weather conditions were forecasted to improve this week in Southern California, aiding firefighters in their battle against a wind-driven wildfire that's forced up to 20,000 people — including performers Cher, Dick Van Dyke and his wife — from their homes.",
      "publishedAt": "2024-12-11T05:24:00Z",
      "title": "A Malibu wildfire prompts evacuation orders and warnings for 20,000, including Dick Van Dyke, Cher",
      "url": "https://apnews.com/c074d51281ca12ca6e98d91e6e78da71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3491b9cfda934f10befbb77450fc7a1f/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s previous defense minister was stopped from attempting suicide while in detention over last week’s martial law declaration, officials said Wednesday, as President Yoon Suk Yeol’s office resisted a police attempt to search the compound.",
      "publishedAt": "2024-12-11T00:35:52Z",
      "title": "Ex-defense chief in South Korea tried to kill himself after being arrested over martial law",
      "url": "https://apnews.com/3210438b8663fe609bfe4cb8b748a114",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5bb4552d5de44fdbd898213c27bafea/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden has approved a new national security memorandum that is meant to serve as a roadmap for the incoming Trump administration as it looks to counter growing cooperation among China, Iran, North Korea and Russia, the White House said Wednesday.",
      "publishedAt": "2024-12-11T10:02:21Z",
      "title": "Biden approves national security memo aimed at helping Trump on China, Iran, North Korea and Russia",
      "url": "https://apnews.com/6d3462b37533a2665d1e844ee6f7f662",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a054db9bfce94001b59b917984e5fb6d/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump made another flurry of job announcements on Tuesday, selecting Andrew Ferguson as the next chair of the Federal Trade Commission, Ron Johnson was nominated to be ambassador to Mexico, and Kimberly Guilfoyle to be ambassador to Greece.",
      "publishedAt": "2024-12-10T23:24:37Z",
      "title": "Trump says he'll name Andrew Ferguson head of FTC and Kimberly Guilfoyle as ambassador to Greece",
      "url": "https://apnews.com/695d34974cb09387e0c3ec6757754eac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80f6ca9f7f1548138e889030793ab5a2/3000.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "Sexual abuse and harassment by coaches and others who held positions of power over women on the U.S. Biathlon team have been dismissed, ignored or excused over decades by officials more concerned with winning medals than holding offenders accountable, according to a half-dozen former Olympians and other biathletes.",
      "publishedAt": "2024-12-11T05:22:25Z",
      "title": "US Biathlon officials ignored sexual harassment and abuse of female racers for decades, athletes say",
      "url": "https://apnews.com/b5c09737637b10f2f6bc5093ee950529",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c29fbaa4e4a43daa31c16542493a506/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and SANYA MANSOOR",
      "description": "NEW YORK (AP) — After being acquitted of homicide, the military veteran who choked a volatile, mentally ill man on a New York subway told an interviewer he put himself in a “very vulnerable position” but felt compelled to act.",
      "publishedAt": "2024-12-11T00:16:43Z",
      "title": "After acquittal in subway chokehold trial, Daniel Penny says he was vulnerable in the encounter",
      "url": "https://apnews.com/3c69673475d69e02aa80f6d146114554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ef4550561294e8aa3ba5c6355b47bcb/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}