{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and JULIA FRANKEL",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops mistakenly shot three hostages to death Friday in a battle-torn neighborhood of Gaza City, and an Israeli strike killed a Palestinian journalist in the south of the besieged territory, underscoring the ferocity of Israel’s ongoing onslaught.",
      "publishedAt": "2023-12-15T08:04:04Z",
      "title": "Israeli military says it mistakenly killed 3 Israeli hostages in battle-torn part of Gaza",
      "url": "https://apnews.com/072436cece0f2351fadfed892e985554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d419292c227d4981863dbcd66fbcdc50/1920.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "CAIRO (AP) — An Israeli strike killed a Palestinian cameraman for the TV network Al Jazeera and wounded its chief Gaza correspondent Friday as they reported at a school in the south of the besieged territory, the network said.",
      "publishedAt": "2023-12-15T21:49:48Z",
      "title": "Israeli strike on school kills Al Jazeera cameraman in southern Gaza, network says",
      "url": "https://apnews.com/b17e6f5c5d987e4f834a0cc3fdc043de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40abc7ee67574c08a681dd53fbe3129e/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — A jury awarded $148 million in damages on Friday to two former Georgia election workers who sued Rudy Giuliani for defamation over lies he spread about them in 2020 that upended their lives with racist threats and harassment.",
      "publishedAt": "2023-12-15T15:22:18Z",
      "title": "Jury awards $148 million in damages to Georgia election workers over Rudy Giuliani’s 2020 vote lies",
      "url": "https://apnews.com/6f6446c4f5224f521db8ff7763fb12d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62dbcb3fec3e44a4a9eb692388fd5e08/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — After hearing from 40 witnesses over 2½ months, Judge Arthur Engoron sounded almost wistful as he presided over the last day of testimony in former President Donald Trump’s civil business fraud trial.",
      "publishedAt": "2023-12-15T19:44:42Z",
      "title": "After 40 witnesses and 43 days of testimony, here's what we learned at Trump’s civil fraud trial",
      "url": "https://apnews.com/44d7ce912fa2434c452e2b5dd6139789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5262dd639aeb4937873bf5edc29bde63/3000.jpeg"
    },
    {
      "author": "BEN FINLEY and DENISE LAVOIE",
      "description": "NEWPORT NEWS, Va. (AP) — The mother of a 6-year-old boy who shot his teacher in a Virginia classroom was sentenced Friday to two years in prison for felony child neglect by a judge who chastised her for abdicating her responsibilities as a parent.",
      "publishedAt": "2023-12-15T05:01:25Z",
      "title": "Mother of 6-year-old who shot teacher in Virginia gets 2 years in prison for child neglect",
      "url": "https://apnews.com/9b99a00c2745dcbcd49b4c25f2a86f96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04ff0df33ef34c77b664d10cd2b8f908/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — An independent report conducted for a police agency clears the agency's response to growing concerns about the mental health of a man who later went on to commit the deadliest mass shooting in Maine history, but it does reveal missed opportunities to intervene to prevent the tragedy, legal experts said Friday.",
      "publishedAt": "2023-12-15T23:27:53Z",
      "title": "A review defends police action before the Maine mass shooting. Legal experts say questions persist",
      "url": "https://apnews.com/8d022b3bb802a9d110b24a7deb9eff75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fc2354336f4fdf92b6647c0499c74b/1920.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Arizona's governor on Friday ordered the state's National Guard to the border with Mexico to help federal officials manage an influx of migrants. Democratic Gov. Katie Hobbs said she issued the executive order because “the federal government is refusing to do its job to secure our border and keep our communities safe.”",
      "publishedAt": "2023-12-16T00:53:08Z",
      "title": "Arizona's governor is sending the state's National Guard to the border to help with a migrant influx",
      "url": "https://apnews.com/7f222b37ac7504bea0f0ef6a2f387ef0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8753362893104d61956fc7325656ceb2/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A federal judge has rejected a request from Oregon Republican state senators who boycotted the Legislature to be allowed on the ballot after their terms end. U.S. District Court Judge Ann Aiken issued the decision Wednesday.",
      "publishedAt": "2023-12-15T23:59:53Z",
      "title": "Federal judge rejects request from Oregon senators who boycotted Legislature seeking to run in 2024",
      "url": "https://apnews.com/ff4ff7001c4317871ec36d1be261fcbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a21cda68b0f4b38a39e35f5bfa1ab5f/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "CORALVILLE, Iowa (AP) — Donald Trump was uncharacteristically serious when he implored an audience in eastern Iowa to carry him to a blowout in next month's Republican caucuses. “The margin of victory is very important, it's just very important,” Trump told about 1,000 people attending a Wednesday rally aimed at organizing campaign volunteers.",
      "publishedAt": "2023-12-15T15:47:14Z",
      "title": "With Iowa's caucuses a month away, Trump urges voters to hand him not just a victory, but a blowout",
      "url": "https://apnews.com/ef6ede3e5b2172157fb48579a6c90840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11214d5938eb4a448fee06d12a257fdf/1920.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "ORLANDO, Fla. (AP) — No wonder Tiger Woods jokingly refers to the PNC Championship as the fifth major.Woods was together with 14-year-old son Charlie on Friday, their swings eerily similar and the encouraging words coming as only Woods can deliver them.",
      "publishedAt": "2023-12-15T21:56:51Z",
      "title": "Tiger Woods and son get another crack at PNC Championship. Woods jokingly calls it the 5th major",
      "url": "https://apnews.com/beeaf4a70564253a517992a3e4b887ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ec9aef7d98944ff896bf8c3e1bcecdc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}