{
  "articles": [
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu visited the White House Thursday to discuss the war in Gaza with President Joe Biden and likely Democratic nominee Vice President Kamala Harris at an important moment for all three politicians.",
      "publishedAt": "2024-07-25T04:06:08Z",
      "title": "Netanyahu meets with Biden and Harris at a crucial moment for the US and Israel",
      "url": "https://apnews.com/41c4e0685e88fd75e9aa8e0d0d859b07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be5aeaa372654c04bc0963667e6996fa/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER, SEUNG MIN KIM and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden on Wednesday delivered a solemn call to voters to defend the country's democracy as he laid out in an Oval Office address his decision to drop his bid for reelection and throw his support behind Vice President Kamala Harris.",
      "publishedAt": "2024-07-24T22:35:53Z",
      "title": "Biden delivers solemn call to defend democracy as he lays out his reasons for quitting race",
      "url": "https://apnews.com/6fc0be75e1b9c9b15f5c07f42324c81b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46f4c8940a034946b1de90b10da043b4/3000.jpeg"
    },
    {
      "author": "DARREN SANDS",
      "description": "WASHINGTON (AP) — Black clergy who know Vice President Kamala Harris, now the frontrunner for the Democratic presidential nomination, marvel at the fusion of traditions and teachings that have molded her religious faith and social justice values.",
      "publishedAt": "2024-07-25T12:02:29Z",
      "title": "Kamala Harris: A Baptist with a Jewish husband and a faith that traces back to MLK and Gandhi",
      "url": "https://apnews.com/1aaa7a87fdbf32e675b9bd55ea072032",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d91d75cccd9542b497af6a6ec6f127c2/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and ADRIANA GOMEZ LICON",
      "description": "CHARLOTTE, N.C. (AP) — Donald Trump unleashed a barrage of attack lines Wednesday against his likely new opponent, Vice President Kamala Harris, whom he called his “new victim to defeat” and accused of deceiving the public about President Joe Biden 's ability to run for a second term.",
      "publishedAt": "2024-07-24T04:28:16Z",
      "title": "Trump turns his full focus on Harris at his first rally since Biden's exit from the 2024 race",
      "url": "https://apnews.com/7c7e6e405fecc8927a63763c76f2db1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48447599f81b4e74bf4342241172c03e/3000.jpeg"
    },
    {
      "author": "MARGIE MASON and ROBIN McDOWELL",
      "description": "Beneath the blazing summer sun on a former slave plantation, Lamont Gross and fellow prisoners stooped in long rows, picking vegetables by hand under the watchful eyes of armed guards on horseback. He said breaks were short and infrequent, with nothing to protect workers from the heat.",
      "publishedAt": "2024-07-25T13:07:21Z",
      "title": "Prisoners fight against working in heat on former slave plantation, raising hope for change in South",
      "url": "https://apnews.com/b41d72f87dc22e0a351a1a8f5345b9bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2a8e2eccfa74530b633e44fc2c0b148/2813.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — President Joe Biden signed into law on Thursday a bill strengthening oversight of the crisis-plagued federal Bureau of Prisons after reporting by The Associated Press exposed systemic corruption, failures and abuse in the federal prison system.",
      "publishedAt": "2024-07-25T16:50:26Z",
      "title": "Biden signs bill strengthening oversight of crisis-plagued US Bureau of Prisons after AP reporting",
      "url": "https://apnews.com/397d95d00d507a95c58dc0f78ada0407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77aeda7e1a994c3d802d57036f142369/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "When Jennifer Wexton rose Thursday to speak on the House floor, something she has done countless times before, the congresswoman used a voice she thought was gone forever.After a rare neurological disorder robbed her of her ability to speak clearly, Wexton has been given her voice back with the help of a powerful artificial intelligence program, allowing the Virginia Democrat to make a clone of her speaking voice using old recordings of speeches and appearances she made as a congresswoman.",
      "publishedAt": "2024-07-25T04:15:00Z",
      "title": "A neurological disorder stole her voice. Jennifer Wexton takes it back on the House floor.",
      "url": "https://apnews.com/6569e27b4095db2b58c36b61e833d0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f71d27361cc46438d9e4cc59b703c08/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "MIAMI (AP) — In a WhatsApp chat that quickly devolved into depravity, a group of U.S. Drug Enforcement Administration agents boasted about their “world debauchery tour” of “boozing and whoring” on the government’s dime.",
      "publishedAt": "2024-07-25T04:54:04Z",
      "title": "Secret DEA files show agents joked about rape in a WhatsApp chat. Then one of them was accused of it",
      "url": "https://apnews.com/649db430c4953a083a7af33ec34b9781",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa2c39d7dfd4405db381547232c55049/3000.jpeg"
    },
    {
      "author": "TRÂN NGUYỄN",
      "description": "SACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom issued an executive order Thursday to direct state agencies on how to remove homeless encampments, a month after a Supreme Court ruling allowing cities to enforce bans on sleeping outside in public spaces.",
      "publishedAt": "2024-07-25T15:18:46Z",
      "title": "Newsom issues executive order for removal of homeless encampments in California",
      "url": "https://apnews.com/7d4478801de6e9f8a708c7c7c6ef3e5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/902a1ee4185e48a9901b1c8690f78c25/3000.jpeg"
    },
    {
      "author": "JAY COHEN",
      "description": "PARIS (AP) — Flavor Flav stopped for hugs, handshakes and high-fives as he made his way around the Team USA House at the Paris Games on Thursday.",
      "publishedAt": "2024-07-25T17:46:20Z",
      "title": "Flavor Flav is soaking up his 1st Olympic experience cheering on the US water polo teams",
      "url": "https://apnews.com/34694545c54c229b9c81168ead939bb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8317cb38dde4e9293d263d217e11d34/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}