{
  "articles": [
    {
      "author": "JOSEPH KRAUSS, ABBY SEWELL and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Palestinians across the Middle East on Wednesday are marking the anniversary of their mass expulsion from what is now Israel with protests and other events at a time of mounting concern over the humanitarian catastrophe in Gaza.",
      "publishedAt": "2024-05-15T08:01:54Z",
      "title": "Palestinians across the Middle East mark their original 'catastrophe' with eyes on the war in Gaza",
      "url": "https://apnews.com/e9696aa2da25e447219f2be0c1926b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/500838f8637b4f328f22e924bdc19730/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, ELLEN KNICKMEYER and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The Biden administration has told key lawmakers it would send more than $1 billion in additional arms and ammunition to Israel, three congressional aides said Tuesday. But it was not immediately known how soon the weapons would be delivered.",
      "publishedAt": "2024-05-15T00:04:03Z",
      "title": "Biden administration is sending $1 billion more in weapons, ammo to Israel, congressional aides say",
      "url": "https://apnews.com/ebe971ca8878ff430ce6458c04151585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56762c2d15e44eb79b6ed41367fed105/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, ERIC TUCKER, MICHELLE L. PRICE and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's attorneys started grilling prosecutors' star witness in his hush money trial Tuesday, portraying former attorney Michael Cohen as a media-obsessed liar who's determined to see the former president behind bars.",
      "publishedAt": "2024-05-14T22:28:01Z",
      "title": "Lies, loyalty and a gag order upheld: Tuesday's Trump hush money trial takeaways",
      "url": "https://apnews.com/2d18a4b018208cf2285a4ccd23846709",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bebad140eeb84b5985124341d0531a3b/1920.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and TERRY SPENCER",
      "description": "OCALA, Fla. (AP) — Mexican citizens were among those going to work at a Florida watermelon farm on Tuesday when the bus they were traveling in was sideswiped and crashed, killing eight people, officials said.",
      "publishedAt": "2024-05-15T04:20:07Z",
      "title": "Mexican citizens were traveling to work at a Florida farm when a pickup hit their bus, killing 8",
      "url": "https://apnews.com/e0832b36b75d5cd9beb8080d12edae51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab752b981a0743e6ae815c30edf8d563/1920.jpeg"
    },
    {
      "author": "BRIAN WITTE, LEAH WILLINGHAM and STEVE PEOPLES",
      "description": "ANNAPOLIS, Md. (AP) — Republican voters advanced strong Senate contenders in Maryland and West Virginia on Tuesday, giving the GOP a big boost in its push to claim control of Congress' upper chamber.",
      "publishedAt": "2024-05-14T04:09:19Z",
      "title": "Senate primaries set up a marquee race in Maryland and a likely Republican flip in West Virginia",
      "url": "https://apnews.com/632750f07b79a9bd4922635fd07ca644",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39f976efba614b279b1de0daab016c45/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "WASHINGTON (AP) — Seventy years ago this week, the U.S. Supreme Court ruled separating children in schools by race was unconstitutional. On paper, that decision — the fabled Brown v.",
      "publishedAt": "2024-05-15T04:12:33Z",
      "title": "70 years ago, school integration was a dream many believed could actually happen. It hasn't",
      "url": "https://apnews.com/9d84858db3717620a77bfae0b478cab8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04b00e5909864a24bcadf71c23fa452d/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian forces withdrew from some areas of the country's northeast and battled Russian troops in others on Wednesday, as President Volodymyr Zelenskyy postponed all his upcoming foreign trips, underscoring the seriousness of the threat his soldiers are facing.",
      "publishedAt": "2024-05-15T07:50:37Z",
      "title": "Ukrainian troops pull out of some areas and Zelenskyy postpones foreign trips amid Russian offensive",
      "url": "https://apnews.com/30c152149f68bbe03c485ce91df6e7ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33dbfb906e0d4ef29b9ccb9a9b76141a/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ and KRUTIKA PATHI",
      "description": "MALAPPURAM, India (AP) — Preventing Muslim migrants from gaining citizenship. Revoking the semi-autonomy of the country’s only Muslim-majority region.",
      "publishedAt": "2024-05-15T06:05:26Z",
      "title": "India's parliament has fewer Muslims as strength of Modi's party grows",
      "url": "https://apnews.com/c01281195f71a4c8b4bd53146695a0e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52cb0a4643464cd1bafb46f37ee42a32/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — Some social media users are calling out celebrities for what they say is inaction in the face of a humanitarian crisis in Gaza — and they've taken to a “blockout” to pressure the stars to take a stand.",
      "publishedAt": "2024-05-15T05:06:44Z",
      "title": "What is the celebrity 'blockout' over the war in Gaza?",
      "url": "https://apnews.com/2a5258f1f64976c41cd570358923dee7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/633045eb0d7e4bbfa6db7f1ba451967e/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — For a last hurrah, it was a Sage decision.A miniature poodle named Sage won the top prize Tuesday night at the Westminster Kennel Club dog show, in what veteran handler Kaz Hosaka said would be his final time at the United States' most prestigious canine event.",
      "publishedAt": "2024-05-14T22:04:18Z",
      "title": "Miniature poodle named Sage wins Westminster Kennel Club dog show",
      "url": "https://apnews.com/157739b5e1cfc3fc00658e77c6841e96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57826514170944e5b55f330e5e1fe022/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}