{
  "articles": [
    {
      "author": null,
      "description": "INDIANAPOLIS (AP) — The NCAA and nation's 5 largest college sports conferences agree to settle antitrust litigation for nearly $2.8 billion.",
      "publishedAt": "2024-05-23T23:44:33Z",
      "title": "The NCAA and nation's 5 largest college sports conferences agree to settle antitrust litigation for nearly $2.8 billion",
      "url": "https://apnews.com/07fb2d316bcfcff5ee6c70dd6d2237db",
      "urlToImage": ""
    },
    {
      "author": "CARSON GERBER of CNHI News and NICKY FORSTER and DEVI SHASTRI of The Associated Press",
      "description": "Norma Upshaw, 82, was living alone south of Nashville, when her doctor said she needed to start in-home dialysis. Her closest family lived 40 miles away, and they’d already scrambled once when the independent senior living facility she had called home — a community of largely Black residents — had closed with 30 days’ notice.",
      "publishedAt": "2024-05-23T12:40:24Z",
      "title": "Black Americans are underrepresented in residential care communities, AP/CNHI News analysis finds",
      "url": "https://apnews.com/75d0d29ce56005d7046e6f174fc26689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1eefe5ce1f54ca98e22c5a6087b19be/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and WYATTE GRANTHAM-PHILIPS",
      "description": "WASHINGTON (AP) — The Justice Department sued Ticketmaster and its parent company Thursday, accusing them of running an illegal monopoly over live events in America and asking a court to break up the system that squelches competition and drives up prices for fans.",
      "publishedAt": "2024-05-23T14:31:26Z",
      "title": "Government sues Ticketmaster owner and asks court to break up company's monopoly on live events",
      "url": "https://apnews.com/df9b552d127e1494db13e3cd625787a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1db08b5f038746709f5e67be36b6de6b/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court 's conservative majority on Thursday preserved a Republican-held South Carolina congressional district, rejecting a lower-court ruling that said the district discriminated against Black voters.",
      "publishedAt": "2024-05-23T14:12:37Z",
      "title": "Supreme Court finds no bias against Black voters in a South Carolina congressional district",
      "url": "https://apnews.com/864d1609b74ad74980604c26e9bfac52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca7d96a274e749e59c8bad9c0dd3986c/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump campaigned Thursday in one of the most Democratic counties in the nation, holding a rally in the South Bronx as he tries to woo minority voters days before a Manhattan jury will begin deliberations on whether to convict him of felony charges in his criminal hush money trial.",
      "publishedAt": "2024-05-23T04:14:19Z",
      "title": "Trump holds a rally in the South Bronx as he tries to woo his hometown",
      "url": "https://apnews.com/00fae754f78333111c508d6e740a3610",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bce9fbba0b404ff7a6da3cdc5bb9ede7/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Two abortion-inducing drugs could soon be reclassified as controlled and dangerous substances in Louisiana under a first-of-its-kind bill that received final legislative passage Thursday and is expected to be signed into law by the governor.",
      "publishedAt": "2024-05-23T17:33:01Z",
      "title": "Louisiana Legislature approves bill classifying abortion pills as controlled dangerous substances",
      "url": "https://apnews.com/06ea3e8df86b72b473efe8fc71054ddf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc72f75f2e2143198ec2f6a36102b5d2/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES, MARY CLARE JALONICK and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Senate Republicans again blocked a bill meant to clamp down on the number of migrants allowed to claim asylum at the U.S.-Mexico border as Senate Majority Leader Chuck Schumer sought Thursday to underscore GOP resistance to the proposal.",
      "publishedAt": "2024-05-23T16:02:47Z",
      "title": "Border bill fails Senate test vote as Democrats seek to underscore Republican resistance",
      "url": "https://apnews.com/924f48912eecf1dc544dc648d757c3fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6e8c3e377624459a635a842e48723c1/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Diminished but not deterred, Hamas is still putting up a fight after seven brutal months of war with Israel, regrouping in some of the hardest-hit areas in northern Gaza and resuming rocket attacks into nearby Israeli communities.",
      "publishedAt": "2024-05-23T08:10:37Z",
      "title": "How does this end? With Hamas holding firm and fighting back in Gaza, Israel faces only bad options",
      "url": "https://apnews.com/0fcb4e20821ba8c0e49edf6571486d3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d15f3c545c8648e3ac6fa0e4814978fc/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "WASHINGTON (AP) — Get ready for what nearly all the experts think will be one of the busiest Atlantic hurricane seasons on record, thanks to unprecedented ocean heat and a brewing La Nina.There's an 85% chance that the Atlantic hurricane season that starts in June will be above average in storm activity, the National Oceanic and Atmospheric Administration announced Thursday in its annual outlook.",
      "publishedAt": "2024-05-23T14:44:41Z",
      "title": "Dangerous brew: Ocean heat and La Nina combo likely mean more Atlantic hurricanes this summer",
      "url": "https://apnews.com/0fe7c4cb0367e8b56ac63ff663839df0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebceb56529ac4fdf82cd4f6526c9fcdc/1920.jpeg"
    },
    {
      "author": "MATT O'BRIEN and BARBARA ORTUTAY",
      "description": "President Joe Biden's administration is pushing the tech industry and financial institutions to shut down a growing market of abusive sexual images made with artificial intelligence technology.New generative AI tools have made it easy to transform someone's likeness into a sexually explicit AI deepfake and share those realistic images across chatrooms or social media.",
      "publishedAt": "2024-05-23T13:09:31Z",
      "title": "White House pushes tech industry to shut down market for sexually abusive AI deepfakes",
      "url": "https://apnews.com/c76c46b48e872cf79ded5430e098e65b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc2cc2651cf54206ad4cd595fc471970/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}