{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The United Nations was forced Friday to stop deliveries of food and other necessities to Gaza and warned of the growing risk of widespread starvation after internet and telephone services collapsed in the besieged enclave because of lack of fuel.",
      "publishedAt": "2023-11-17T08:30:09Z",
      "title": "UN stops delivery of food and supplies to Gaza as communications blackout hinders aid coordination",
      "url": "https://apnews.com/1811384fac6394329dd71e3aaf461eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f451460169a441ce97eff16ddb8cc921/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA and SAM McNEIL",
      "description": "Abbey Onn lost her aunt and a young cousin when Hamas attackers rampaged through Kibbutz Nir Oz on Oct. 7. Now Onn is worried about what will happen to three other family members taken hostage that day as Israel pounds Gaza City in a bid to end Hamas’ control of the Gaza Strip.",
      "publishedAt": "2023-11-17T05:33:35Z",
      "title": "'Bring them home': As the battle for Gaza rages, hostage families wait with trepidation",
      "url": "https://apnews.com/9d4f1c996aaf5d66925c6a4e82a0076c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81dc30c5c18b473aac5ff689201d8265/2000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — A Colorado judge on Friday found that former President Donald Trump engaged in insurrection during the Jan. 6, 2021, attack on the U.S.",
      "publishedAt": "2023-11-18T00:10:06Z",
      "title": "Colorado judge finds Trump engaged in insurrection, but rejects constitutional ballot challenge",
      "url": "https://apnews.com/5b6e40f069abc1b8604ec37c46621055",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d16b41c7a68b44f5a39859a8337a185f/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson said Friday he plans to publicly release thousands of hours of footage from the Jan. 6, 2021, attack on the U.S.",
      "publishedAt": "2023-11-17T21:19:51Z",
      "title": "Speaker Johnson says he'll make 44,000 hours of Jan. 6 footage available to the general public",
      "url": "https://apnews.com/c737a543c379413ad6e025ac603ac3e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d55adb77cc504469a13e717b745e3dea/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "SAN FRANCISCO (AP) — President Joe Biden and Mexican President Andrés Manuel López Obrador pledged Friday to work side-by-side to confront illicit fentanyl trafficking into the U.S. and to manage the growing number of migrants traveling north to the border between their nation.",
      "publishedAt": "2023-11-17T05:13:08Z",
      "title": "Biden and López Obrador have talked fentanyl and US-Mexico migration. They pledged solidarity",
      "url": "https://apnews.com/d39861ee91b91656be23e8d1068ec993",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea059ff7835f407887c4944287ea0b2b/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Former first lady Rosalynn Carter is in hospice care at home in Plains, Georgia, joining former President Jimmy Carter, who has been receiving end-of-life care since February, their family announced Friday.",
      "publishedAt": "2023-11-17T20:08:38Z",
      "title": "Rosalynn Carter, 96-year-old former first lady, is in hospice care at home, Carter Center says",
      "url": "https://apnews.com/10ef9ab41d1a0376b1c4d7b1bd3aeca0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1301e013e6254fe095ad3c35e2700b9e/2500.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The Republicans battling to be their party's alternative to former President Donald Trump came together Friday for a different kind of cattle call, bringing personal and at times emotional stories to what an influential Iowa Christian organization billed as a friendly conversation.",
      "publishedAt": "2023-11-17T05:06:39Z",
      "title": "DeSantis, Haley and Ramaswamy get personal and friendly during 'family discussion' in Iowa",
      "url": "https://apnews.com/805c24ebcf92a622a60ee3461616032e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b4d60af9c4247569d76e91b5348b60a/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The chairman of the House Ethics Committee announced Friday he has filed a resolution to force a vote on expelling Rep. George Santos, R-N.Y., from Congress, one day after the committee issued a withering report detailing substantial evidence that Santos converted campaign donations for his own personal use.",
      "publishedAt": "2023-11-17T16:02:49Z",
      "title": "Ethics chairman launches a new bid to expel George Santos after a withering report on his conduct",
      "url": "https://apnews.com/1d9e63b5a4e8b49912fec0c141fc3a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bcf8803f6c64e4cbf3499e402f8b852/3000.jpeg"
    },
    {
      "author": "SARAH RANKIN",
      "description": "HENRICO, Va. (AP) — Susanna Gibson lost her Virginia legislative race this month, but she may not be done with politics.",
      "publishedAt": "2023-11-17T15:15:19Z",
      "title": "Defeated Virginia candidate whose explicit videos surfaced says she may not be done with politics",
      "url": "https://apnews.com/b7534f8c3f4d099dfd3d96701a125504",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1251b158d6774f15b0860c6151fdcf65/1920.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "ChatGPT-maker Open AI said Friday it has pushed out its co-founder and CEO Sam Altman after a review found he was “not consistently candid in his communications” with the board of directors.“The board no longer has confidence in his ability to continue leading OpenAI,” the artificial intelligence company said in a statement.",
      "publishedAt": "2023-11-17T21:02:26Z",
      "title": "ChatGPT-maker OpenAI fires CEO Sam Altman, the face of the AI boom, for lack of candor with company",
      "url": "https://apnews.com/893e4a460c10eb3a8f1afefa6156eca3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91096abbf81d485fa3cd897136a743a1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}