{
  "articles": [
    {
      "author": "JAKE OFFENHARTZ, KAREN MATTHEWS and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A gunman killed UnitedHealthcare’s CEO on Wednesday in a “brazen, targeted attack” outside a Manhattan hotel where the health insurer was holding its investor conference, police said, setting off a massive search for the fleeing assailant hours before the annual Rockefeller Center Christmas tree lighting nearby.",
      "publishedAt": "2024-12-04T14:26:27Z",
      "title": "Police hunt for UnitedHealthcare CEO's masked killer after 'brazen, targeted' attack on NYC street",
      "url": "https://apnews.com/daa1e8c8c05606197a5bd2e0242f1683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1df71c98c4ae9a5e7becb8ac9b3de/1920.jpeg"
    },
    {
      "author": "ADAM GELLER and TOM MURPHY",
      "description": "NEW YORK (AP) — Brian Thompson led one of the biggest health insurers in the U.S. but was unknown to millions of people his decisions affected.Then Wednesday's targeted fatal shooting of the UnitedHealthcare CEO on a midtown Manhattan sidewalk thrust the executive and his business into the national spotlight.",
      "publishedAt": "2024-12-04T18:18:26Z",
      "title": "UnitedHealthcare CEO kept a low public profile. Then he was shot to death in New York",
      "url": "https://apnews.com/8a130e64bcab749d1a085f5a34ab8254",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1df71c98c4ae9a5e7becb8ac9b3de/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT, FARNOUSH AMIRI, ZEKE MILLER and TARA COPP",
      "description": "WASHINGTON (AP) — A defiant Pete Hegseth fought to save his nomination to be Donald Trump's defense secretary Wednesday as the president-elect considered possible replacements in the face of growing questions about the former Fox News host's personal conduct and ability to win Senate confirmation.",
      "publishedAt": "2024-12-04T14:12:16Z",
      "title": "Hegseth fights to save Pentagon nomination as sources say Trump considers DeSantis",
      "url": "https://apnews.com/3cb8c7d7bb555ed075cbbb4e8dad0741",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715ae5f075ea4e878e81f9895a482dbe/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Hearing a high-profile culture-war clash, the Supreme Court on Wednesday seemed likely to uphold Tennessee's ban on gender-affirming care for minors.",
      "publishedAt": "2024-12-04T05:03:47Z",
      "title": "Supreme Court seems likely to uphold Tennessee's ban on medical treatments for transgender minors",
      "url": "https://apnews.com/3fd2de125caeac6e323bd81ef7271837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39184c19e820444ba4442abfa1aaa8aa/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Former White House adviser Peter Navarro, who served prison time related to the Jan. 6 attack on the U.S. Capitol, will return to serve in Donald Trump’s second administration, the president-elect announced Wednesday.",
      "publishedAt": "2024-12-04T16:17:58Z",
      "title": "Peter Navarro served prison time related to Jan. 6. Now Trump is bringing him back as an adviser",
      "url": "https://apnews.com/2566b318a1f82ad17d8d1abf17e9d218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00cd2ee70e0416caa1703238b182fe5/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and WAFAA SHURAFA",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli airstrikes tore through a tent camp for displaced Palestinians in southern Gaza on Wednesday, sparking fires and killing at least 21 people, according to the head of a nearby hospital, in the latest assault on a sprawling tent city that Israel designated a humanitarian safe zone but has repeatedly targeted.",
      "publishedAt": "2024-12-04T18:15:46Z",
      "title": "Israeli strikes on a Gaza tent camp kill at least 21 people, hospital says",
      "url": "https://apnews.com/efb344dafb1ef0d6d2ec55a17a292ad4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19b2ca243fed4c6f82be8a4aa88ada26/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — President Yoon Suk Yeol’s stunning martial law declaration lasted just hours, but experts say it raised serious questions about his ability to govern for the remaining 2 1/2 years of his term and whether he will abide by democratic principles.",
      "publishedAt": "2024-12-04T16:09:05Z",
      "title": "South Korean President Yoon's martial law declaration raises questions over his political future",
      "url": "https://apnews.com/f9f865c60ef95e57bdd39f2a384a0dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f0307bc3f9b44b0937985e417391041/3000.jpeg"
    },
    {
      "author": "TOM NOUVIAN and SYLVIE CORBET",
      "description": "PARIS (AP) — France’s far-right and left-wing lawmakers joined together Wednesday in a historic no-confidence vote prompted by budget disputes that forces Prime Minister Michel Barnier and his Cabinet members to resign, a first since 1962.",
      "publishedAt": "2024-12-04T10:47:52Z",
      "title": "French lawmakers vote to oust prime minister in the first successful no-confidence vote since 1962",
      "url": "https://apnews.com/3b408ee1ac4c502541a56fbe3a230479",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0388ac3a167b4c63a8768306d3582f17/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — A top White House official on Wednesday said at least eight U.S. telecom firms and dozens of nations have been impacted by a Chinese hacking campaign.Deputy national security adviser Anne Neuberger offered new details about the breadth of the sprawling Chinese hacking campaign that gave officials in Beijing access to private texts and phone conversations of an unknown number of Americans.",
      "publishedAt": "2024-12-04T20:55:38Z",
      "title": "White House says at least 8 US telecom firms, dozens of nations impacted by China hacking campaign",
      "url": "https://apnews.com/88cabc592dae2fa870772c5ce4ace5ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bf9d736d3f44c1fa38311d9b0e87cde/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS, HUMERA LODHI and ANNIE NG",
      "description": "WASHINGTON (AP) — The lead-up to the 2024 election was all about cat owners. But in the end, the dogs had their day.President-elect Donald Trump won slightly more than half of voters who own either cats or dogs, with a big assist from dog owners, according to AP VoteCast, a survey of more than 120,000 voters.",
      "publishedAt": "2024-12-04T13:11:53Z",
      "title": "Harris found success with women who have cats, but Trump got the dog owner vote: AP VoteCast",
      "url": "https://apnews.com/0f1f21fb148c31a276b5f0668270981f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a38e012d0434e0190f5b269a7128d38/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}