{
  "articles": [
    {
      "author": null,
      "description": "Israeli Defense Minister Israel Katz said that Iran had “completely violated” the ceasefire between Israel and Iran by launching missiles after the ceasefire came into effect. Katz said he instructed the Israeli military to resume targeting Iranian paramilitary and government targets. Israel said it had identified missiles launched from Iran into its airspace less than three hours after the ceasefire went into effect, after both Israel and Iran accepted President Donald Trump’s plan to end the 12-day war roiling the Middle East.",
      "publishedAt": "2025-06-24T05:46:42Z",
      "title": "Trump ceasefire plan falters as Israel says Iran launched more missiles and pledges response",
      "url": "https://apnews.com/article/israel-iran-trump-ceasefire-attacks-continue-f1e60190722cc3410b69f21717872ffa",
      "urlToImage": "https://dims.apnews.com/dims4/default/883d6ad/2147483647/strip/true/crop/4408x2480+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F02%2F7f93c3434f16a04bb8a2b8ad24c8%2F25611577134a49829bf7e621833531b1"
    },
    {
      "author": null,
      "description": "Palestinian witnesses say Israeli forces and drones opened fire toward hundreds of people waiting for aid trucks in central Gaza. Hospitals say at least 25 people were killed and more than 140 wounded. Israel's military says it was reviewing reports of casualties from Israeli fire after a group of people approached troops. The Awda hospital in the Nuseirat camp, which received the victims, says the Palestinians were waiting for the trucks on a road south of Wadi Gaza. Witnesses have told The Associated Press that Israeli forces opened fire as people were advancing closer. One man says fire from drones and gunfire from tanks came at people, “even as we were fleeing.” Another says drones flew over the crowds first, then there was fire from tanks and drones as people moved eastward.",
      "publishedAt": "2025-06-24T06:50:32Z",
      "title": "25 killed by Israeli forces while waiting on aid trucks in Gaza, Palestinians say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-06-24-2025-dbbdba6c1986376e6e09900650814412",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f62991/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fc2%2F2e961ad9d37967374839c8107f45%2F84d5917ece7d48e2875d1c5c77690aed"
    },
    {
      "author": null,
      "description": "Members of Congress are hearing from President Donald Trump’s intelligence leaders about the strikes on Iran. The House and the Senate will receive classified briefings Tuesday, three days after Trump directed strikes on Iranian nuclear facilities and a day after Iran struck a U.S. base in Qatar. Democrats and some Republicans have questions about Trump’s unilateral decision to launch military action. Many argue the Republican president should've gone to Congress for approval. CIA Director John Ratcliffe and Director of National Intelligence Tulsi Gabbard will be among the officials briefing Congress. The briefings come a day after Trump proclaimed Israel and Iran had agreed to a ceasefire, but that tentative truce has faltered.",
      "publishedAt": "2025-06-24T04:09:10Z",
      "title": "Intelligence leaders are set to brief Congress on Trump's Iran strikes",
      "url": "https://apnews.com/article/iran-strikes-israel-congress-trump-nuclear-facilities-8cbb969ff7056addc110d11af0cddf0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f304dd9/2147483647/strip/true/crop/5118x2879+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F83%2F5aeaeb75c4a1a287a7e620f87ec7%2Ffa237233c9e248fb9aa251722ab23deb"
    },
    {
      "author": null,
      "description": "Officials say Russian drones, missiles and artillery have killed at least 16 civilians and injured almost 100 others in Ukraine. The attacks coincided with Ukrainian President Volodymyr Zelenskyy's push for guarantees of further Western military aid for his country’s efforts to repel Russia’s invasion. Zelenskyy is meeting Tuesday with Western leaders attending a NATO summit in The Hague, Netherlands. He is keen to lock in additional military support for Ukraine’s fight against Russia, as direct peace talks have delivered no progress on a possible settlement.",
      "publishedAt": "2025-06-24T11:27:14Z",
      "title": "Russian attacks kill 13 civilians in Ukraine as Zelenskyy seeks more Western aid",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-missile-attacks-8135ed1141c667b5b044b8187b2d2179",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c54492/2147483647/strip/true/crop/4498x2530+1+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Ff2%2Fa8ac9049b3361d11084063945af4%2F2235247299864b888fdae722858d9b2c"
    },
    {
      "author": null,
      "description": "World leaders are gathering in the Netherlands for the start of a historic two-day NATO summit that could unite the world’s biggest security organization around a new defense spending pledge or widen divisions among the 32 allies. The allies are expected to endorse a goal of spending 5% of their gross domestic product on their security, to be able to fulfil the alliance’s plans for defending against outside attack. Ukrainian President Volodymyr Zelenskyy arrived in The Hague for a series of meetings, despite his absence from a leaders’ meeting aiming to seal the agreement to boost military spending.",
      "publishedAt": "2025-06-24T08:00:40Z",
      "title": "World leaders gather for historic NATO summit with unity on the line",
      "url": "https://apnews.com/article/nato-ukraine-zelenskyy-trump-iran-israel-rutte-1cdf87daa23ac024ae050fed9b7b8c49",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9f34c5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F5a%2F65745481e9d3808f140ac61d8f00%2F1f44f0bbda1f406faf85689d47ed2f6f"
    },
    {
      "author": null,
      "description": "New York City voters will decide whether Andrew Cuomo has done enough to make a political comeback by winning the Democratic mayoral primary. The former governor is trying to reboot his career by defeating upstart liberal darling Zohran Mamdani and a crowded field of establishment candidates in the city's primary Tuesday. The winner will go on to face incumbent Mayor Eric Adams, who is running as an independent, in the fall general election. Cuomo has been the front-runner throughout the race, with his deep experience, nearly universal name recognition, strong political connections and juggernaut fundraising apparatus vaulting him to the front of the pack.",
      "publishedAt": "2025-06-24T03:48:34Z",
      "title": "New York mayoral primary voters pick from field including Cuomo and Mamdani",
      "url": "https://apnews.com/article/andrew-cuomo-zohran-mamdani-new-york-mayor-0d39764944e7e55a7e26a988d4136a86",
      "urlToImage": "https://dims.apnews.com/dims4/default/993c4c8/2147483647/strip/true/crop/4800x2700+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fa9%2F0d1dd1b4ee45a3d7ad5330b359e8%2F6ef3e1c0ed924a64a3b54422467eb8e8"
    },
    {
      "author": null,
      "description": "Dutch authorities are investigating possible sabotage against the rail network after a power outage limited train services to and from the country’s main airport. The outage came as the Netherlands is hosting a historic NATO summit that opened Tuesday. Caretaker Justice Minister David van Weel told the NATO Public Forum that investigators are considering the possibility that fire in some 30 rail cables may have been set intentionally. The damage has disrupted rail services and no trains are running between Schiphol Airport and the country’s capital, Amsterdam.",
      "publishedAt": "2025-06-24T09:21:29Z",
      "title": "Dutch authorities investigate possible sabotage against rail network as NATO summit opens",
      "url": "https://apnews.com/article/nato-summit-train-sabotage-investigation-dcb29f0e126512811fac4b95d7662cac",
      "urlToImage": "https://dims.apnews.com/dims4/default/cddf2ee/2147483647/strip/true/crop/4986x2805+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F0e%2Fc87c45f0efab77c6b0a82ce38737%2F2b244b87e95a45bc80dd04273714f804"
    },
    {
      "author": null,
      "description": "A search continues for two people still missing after six others were killed when a boat capsized on Lake Tahoe in California during a powerful weekend thunderstorm that whipped up high waves. The Coast Guard says swells of more than 8 feet were recorded around the time the 27-foot gold Chris-Craft vessel flipped over Saturday afternoon. Two people were rescued immediately and taken to a hospital in unknown condition. Six bodies were recovered later Saturday. Meteorologists say the intensity of the thunderstorm surprised even forecasters, who'd predicted some rain but nothing like the sudden squall that lashed the southern part of the lake.",
      "publishedAt": "2025-06-23T18:54:05Z",
      "title": "Search continues for 2 people still missing after 6 killed when boat capsized on Lake Tahoe",
      "url": "https://apnews.com/article/lake-tahoe-california-boat-capsize-75bf2d0fa4d3fa802cf2680b756575fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ead357/2147483647/strip/true/crop/810x456+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F6b%2F6c1bab584ae855e625f85779cba7%2F89fcd700fa404f45bdafa289567ba8e9"
    },
    {
      "author": null,
      "description": "Stock markets have rallied and oil prices fell after U.S. President Donald Trump announced what appears to be a shaky ceasefire in the Israel-Iran conflict. Oil prices declined on hopes that the potential threat to the global flow of crude may have abated, even after the U.S. carried out strikes on Iranian nuclear sites. A barrel of benchmark U.S. oil dropped about 3% early Tuesday and more than 7% on Monday after briefly topping $78 Sunday night. On Monday, the S&P 500 rose 1%, the Dow Jones Industrial Average added 0.9% and the Nasdaq composite also gained 0.9%. Treasury yields fell.",
      "publishedAt": "2025-06-24T03:52:04Z",
      "title": "World shares rally after Trump announces what appears to be a shaky Israeli-Iran ceasefire",
      "url": "https://apnews.com/article/stocks-markets-oil-iran-tariffs-rates-d5713bc60bcc433702b215076d2d35fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5f36e6/2147483647/strip/true/crop/8933x5025+0+465/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2Ffb%2F10b504747709550abdc5d146ae7d%2Fdb4bd83ec68049e6a3690b3bda142bb6"
    },
    {
      "author": null,
      "description": "Waymo’s robotaxis will begin carrying passengers through parts of Atlanta Tuesday in an expansion of a partnership with Uber’s ride-hailing service that began earlier this year in Austin. The robotaxis will initially cover a 65-square-mile (168,00-square-kilometers) area within the Atlanta market before expanding to a larger stretch. Waymo’s driverless march into Atlanta comes just days after Tesla finally launched a limited robotaxi service in Austin, more than five years after CEO Elon Musk brashly promised the electric automaker would quickly overtake Waymo as the leader in autonomous driving technology.",
      "publishedAt": "2025-06-24T11:08:11Z",
      "title": "Waymo expands its robotaxi service to Atlanta in partnership with Uber",
      "url": "https://apnews.com/article/waymo-uber-robotaxis-atlanta-expansion-e8c1d1a379bb14785ec32e97877efd65",
      "urlToImage": "https://dims.apnews.com/dims4/default/69f5eeb/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2F93%2F5e7c61a91b2012dafb7c939da042%2Fa2975b0964f64d6398f053e3f3a618de"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}