{
  "articles": [
    {
      "author": "MELISSA GOLDIN, CEDAR ATTANASIO and CHARLOTTE GRAHAM-McLAY",
      "description": "NEW YORK (AP) — From Sydney to Mumbai to Paris to Rio de Janeiro, communities around the world welcomed 2025 with spectacular light shows, embraces and ice plunges.",
      "publishedAt": "2024-12-31T06:04:09Z",
      "title": "The world welcomes 2025 with light shows, embraces and ice plunges",
      "url": "https://apnews.com/d272e3c02dd0a0c39be1ef06634ff3f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c632f9efe293476fa497c0a9c5606676/3000.jpeg"
    },
    {
      "author": "GHAITH ALSAYED, WAFAA SHURAFA and LUJAIN JO",
      "description": "DAMASCUS (AP) — In Damascus, the streets were buzzing with excitement Tuesday as Syrians welcomed in a new year that seemed to many to bring a promise of a brighter future after the unexpected fall of Bashar Assad’s government weeks earlier.",
      "publishedAt": "2024-12-31T17:19:59Z",
      "title": "A new year dawns on a Middle East torn by conflict and change",
      "url": "https://apnews.com/3480c8519737dcdde8a32b624bc528a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4b03e89b3354815b8403f971b26cce8/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes killed at least 12 Palestinians in the Gaza Strip, mostly women and children, officials said Wednesday, as the nearly 15-month war ground on into the new year with no end in sight.",
      "publishedAt": "2025-01-01T07:08:03Z",
      "title": "Israeli strikes kill 12 in Gaza as war grinds into the new year with no end in sight",
      "url": "https://apnews.com/55ed3832a113d3314dd45d475bafd421",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8988a420575d4b38aae4c8fbeb6e89d0/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Grieving relatives of the victims of the South Korea plane crash gathered at the site to pay respects to their loved ones on New Year’s Day, as officials said they've extracted data from one of the retrieved black boxes to find the exact cause of the crash.",
      "publishedAt": "2025-01-01T06:51:58Z",
      "title": "South Korea air crash investigators extract black box data as grieving families mourn the victims",
      "url": "https://apnews.com/904b15ec24a543c99e3c8e416af3a0a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64689867a99441f8b1975b066f4f8474/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — A blackout hit nearly all of Puerto Rico early on Tuesday as the U.S. territory prepared to celebrate New Year’s, leaving more than 1.3 million clients in the dark.",
      "publishedAt": "2024-12-31T12:09:59Z",
      "title": "Nearly all of Puerto Rico is without power on New Year's Eve",
      "url": "https://apnews.com/b594dc464d469b812dc9b65c76cc16e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18040691e1ee4b84ac1f670d160aa71a/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Before reaching the 1978 peace deal between Egypt’s Anwar Sadat and Israel’s Menachem Begin, Jimmy Carter managed months of intense preparation, high-stakes negotiations at Camp David and a field trip to the Gettysburg battlefield to demonstrate the consequences of war.",
      "publishedAt": "2025-01-01T05:04:25Z",
      "title": "Jimmy the Baptist: Carter redefined ‘evangelical,’ from campaigns to race and women’s rights",
      "url": "https://apnews.com/93343181bb9fac49723470c7e10561d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/196f317016d94e9aa69da55e9ca470f1/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "PALM BEACH, Fla. (AP) — President-elect Donald Trump said Tuesday that he's planning to attend the funeral of former President Jimmy Carter.",
      "publishedAt": "2025-01-01T02:37:55Z",
      "title": "Trump says he is planning to attend Jimmy Carter's funeral",
      "url": "https://apnews.com/2d7fc241ff0be4eb99b9c6547010bd03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eba1068128f6492bad00485c38b16678/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Chief Justice John Roberts issued a defense Tuesday of judicial independence, which he said is under threat from intimidation, disinformation and the prospect of public officials defying court orders.",
      "publishedAt": "2024-12-31T23:00:21Z",
      "title": "Chief Justice John Roberts defends judicial independence, says it is under threat in several ways",
      "url": "https://apnews.com/1e11fa540245a8c629c90772674ea8f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ceeed4af9b404f0f977295136f507107/3000.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "Hundreds of people who say they suffered physical or sexual abuse at two state-run reform schools in Florida are in line to receive tens of thousands of dollars in restitution from the state, after Florida lawmakers formally apologized for the horrors they endured as children more than 50 years ago.",
      "publishedAt": "2025-01-01T05:09:06Z",
      "title": "Hundreds apply for restitution for abuse suffered at Florida reform schools",
      "url": "https://apnews.com/c1f1bcd546b8134605e56a83c4629d1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d1c0fc15bfb48dda6cb172c1484127b/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "Actor Blake Lively sued \"It Ends With Us” director Justin Baldoni and several others tied to the romantic drama on Tuesday, alleging harassment and a coordinated campaign to attack her reputation for coming forward about her treatment on the set.",
      "publishedAt": "2025-01-01T03:07:07Z",
      "title": "Blake Lively sues 'It Ends With Us' director Justin Baldoni alleging harassment and smear campaign",
      "url": "https://apnews.com/1aecaec0a51d8c45ea313a6f7dbff31b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdfe8f73dc924bd2942c24c756fcfc41/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}