{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Vice President Kamala Harris will deliver her campaign’s “closing argument” Tuesday from the same spot in Washington where former President Donald Trump helped incite a mob that attacked the U.S.",
      "publishedAt": "2024-10-29T13:12:01Z",
      "title": "Election 2024 Latest: With 1 week to go, Harris heads to Washington and Trump stumps in Pennsylvania",
      "url": "https://apnews.com/4d54837e83d91f1d200f56a6948a96b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b92031c56d934d87b0e561d47950ff25/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Kamala Harris will promise Tuesday to “put country above party and above self” in the closing argument of her presidential campaign, to be delivered from the same site where Donald Trump fomented the Capitol insurrection, in the hopes that it offers a stark visualization of the choice voters face.",
      "publishedAt": "2024-10-29T09:04:01Z",
      "title": "Harris to promise to 'put country above party and above self' in closing argument against Trump",
      "url": "https://apnews.com/139a7b390dc30ceab85d9ac56fcc521d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/833c8b365efb484faf5155d1fd3c5e06/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, MICHELLE L. PRICE and MICHAEL RUBINKAM",
      "description": "ALLENTOWN, Pa. (AP) — Urged by some allies to apologize for racist comments made by speakers at his weekend rally, Donald Trump took the opposite approach on Tuesday, saying it was an “honor to be involved” in such an event and calling the scene a “lovefest” — the same term he has used to describe the Jan.",
      "publishedAt": "2024-10-29T16:39:15Z",
      "title": "Trump says his New York rally marked by crude and racist insults was 'an absolute lovefest'",
      "url": "https://apnews.com/6e079e7894a7e1db5dd4be76cccb452a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b92031c56d934d87b0e561d47950ff25/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER and JAMEY KEATEN",
      "description": "UNITED NATIONS (AP) — The United Nations stressed Tuesday that if Israel puts in place new laws cutting ties with the U.N.",
      "publishedAt": "2024-10-29T22:09:14Z",
      "title": "Israel must step in if it bans the UN agency that is a lifeline for Gaza, UN says",
      "url": "https://apnews.com/6cc2518b83eaecd3f813df59588b539f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25dde7bfab0c4a0a94f79e1d5f212ad3/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Two Israeli airstrikes in the northern Gaza Strip on Tuesday killed at least 88 people, including dozens of women and children, health officials said, and the director of a hospital said life-threatening injuries were going untreated because a weekend raid by Israeli forces led to the detention of dozens of medics.",
      "publishedAt": "2024-10-29T07:01:11Z",
      "title": "Israeli strikes in northern Gaza kill at least 88, officials say",
      "url": "https://apnews.com/befe1b42ef25599539198fa04e089f04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abaa3abbdf9145f7a4a77972efe8923e/1920.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "TALLAHASSEE, Fla. (AP) — A federal judge who recently chastised Florida officials for “trampling” on free speech rights continued to block the head of the state's health department from taking any more steps to threaten TV stations that air commercials for an abortion rights measure on next week’s ballot.",
      "publishedAt": "2024-10-29T15:05:06Z",
      "title": "Judge continues to block Florida officials from threatening TV stations over abortion ads",
      "url": "https://apnews.com/d762c425f6ec193c3edcf6e6e9c93198",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d006f129b7af47c3a74f98814e9b9a69/2423.jpeg"
    },
    {
      "author": "DAVE COLLINS and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Longtime Donald Trump ally Steve Bannon was released from federal prison early Tuesday and immediately resumed his full-throated support for the former president, urging Republicans to turn out in large numbers next week to defeat Democratic nominee Vice President Kamala Harris.",
      "publishedAt": "2024-10-29T04:08:29Z",
      "title": "Steve Bannon spends his first day out of prison on the airwaves stumping for Trump",
      "url": "https://apnews.com/56f2f7a17ae2273a29a0829234f56fae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5db5340938394bb0bedc9eb544fa44b2/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — This presidential election, the first since the Jan. 6, 2021, insurrection at the Capitol, will be a stress test of the new systems and guardrails that Congress put in place to ensure America’s long tradition of the peaceful transfer of presidential power.",
      "publishedAt": "2024-10-29T04:18:22Z",
      "title": "The first presidential election since the Jan. 6 attack will test new guardrails from Congress",
      "url": "https://apnews.com/64b1ceeeacff133731ca4af01425a7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dead30909a3f4aba904c6580c4d3fe0e/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — The man who was sentenced to 30 years in federal prison for attacking the husband of former House Speaker Nancy Pelosi with a hammer in their California home was given a life term without the possibility of parole on Tuesday following a separate state trial.",
      "publishedAt": "2024-10-29T18:47:11Z",
      "title": "Man serving 30 years for attacking Nancy Pelosi’s husband gets a life term on state charges",
      "url": "https://apnews.com/454cbde088fcae22a356f1f8dd0e9eba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/773f2794be184344ad317fa1aa605c15/1168.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Jaywalking -- that time-honored practice of crossing the street outside of the crosswalk or against the traffic light -- is now legal in New York City.",
      "publishedAt": "2024-10-29T20:43:12Z",
      "title": "‘I’m walking here!’: Jaywalking legalized in New York City",
      "url": "https://apnews.com/6df1eacddfa5b7951a51dadc05a4ce6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f87fc0c8a6f14ef29cdf5302f58ec6d0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}