{
  "articles": [
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — At a busy Tel Aviv entertainment district, diners spill into outdoor seating and clink glasses as music fills the air. There’s laughter, there’s life. But all around the patrons, staring down from lampposts and shop windows, are pictures of hostages held in Gaza, stark reminders that Israel is at war and forever scarred by the deadliest attack in its history.",
      "publishedAt": "2024-10-05T04:03:41Z",
      "title": "One year in, war casts a shadow over every aspect of life in Israel",
      "url": "https://apnews.com/28daf7e6aa8ddab419cf76e31b111d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fa8fa8ef3ce4a78a5d4340a435e1803/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli airstrike has cut off a main highway linking Lebanon with Syria, leaving two huge craters on either side of the road.",
      "publishedAt": "2024-10-04T06:58:15Z",
      "title": "Middle East latest: An Israeli airstrike cuts a major highway linking Lebanon with Syria",
      "url": "https://apnews.com/22ce0cdc4813e1f0d657d67868a2da61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c4448334a5843c1b92b4180ff54b055/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran has emerged as a twofold concern for the United States as it nears the end of the presidential campaign.Prosecutors allege Tehran tried to hack figures associated with the election, stealing information from former President Donald Trump’s campaign.",
      "publishedAt": "2024-10-05T04:13:00Z",
      "title": "Alleged plots against US campaign are only the latest examples of Iran targeting adversaries",
      "url": "https://apnews.com/6cb2929fa7065ca8d8e21c6713087258",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65e8031d9b764460bfebf848a89f69be/2200.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS, JEFF AMY and BRITTANY PETERSON",
      "description": "ASHEVILLE, N.C. (AP) — Nearly a week after Hurricane Helene brought devastation to western North Carolina, a shiny stainless steel tanker truck in downtown Asheville attracted residents carrying 5-gallon containers, milk jugs and buckets to fill with what has become a desperately scare resource — drinking water.",
      "publishedAt": "2024-10-04T17:59:26Z",
      "title": "A week after Helene hit, thousands still without water struggle to find enough",
      "url": "https://apnews.com/737bd51b1351315dc28522e36c425f18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/573899bb8c1a44f7bcc01b215bda21bc/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — Democratic presidential nominee Kamala Harris is heading to North Carolina on Saturday as the state recovers from Hurricane Helene, arriving there one day after a visit by Republican Donald Trump, who is spreading false claims about the federal response to the disaster.",
      "publishedAt": "2024-10-05T04:14:16Z",
      "title": "Harris is heading to North Carolina to survey Helene's aftermath one day after Trump visited",
      "url": "https://apnews.com/13475a09f3fed719a1b451105ab15ccf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74eaed39c9fb4afc9862945dc3fb2429/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "BUTLER, Pa. (AP) — Former President Donald Trump plans to return Saturday to the site where a gunman tried to assassinate him in July, setting aside what are now near-constant worries for his physical safety in order to fulfill a promise — “really an obligation,” he said recently — to the people of Butler, Pennsylvania.",
      "publishedAt": "2024-10-05T04:15:07Z",
      "title": "Trump returns to site of Pennsylvania assassination attempt for huge rally with Vance and Musk",
      "url": "https://apnews.com/24a8718393eb6fdab01336ca4438a0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/583ca8408d9142a2a9982df86d18ef58/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — After 1,080 days as president, Joe Biden on Friday decided to pop in and take questions in the White House briefing room for the first time, striding in with a grin after a strong monthly jobs report and the temporary settlement of a strike by ports workers.",
      "publishedAt": "2024-10-04T20:46:32Z",
      "title": "Biden talks election, economy and Middle East in surprise news briefing",
      "url": "https://apnews.com/0093866898d9f9067ff0676672cba9d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90a83f6fa4df43d187790b748c40b037/1920.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "PARIS (AP) — A French judge in the trial of dozens of men accused of raping an unconscious woman whose now former husband had repeatedly drugged her so that he and others could assault her decided on Friday to allow the public to see some of the video recordings of the alleged rapes.",
      "publishedAt": "2024-10-04T19:31:56Z",
      "title": "A French judge in a shocking rape case allows the public to see some of the video evidence",
      "url": "https://apnews.com/79c8973223e572e0f83bc06aba03ed05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d971290ebbc4fce99507c27a5c80741/3000.jpeg"
    },
    {
      "author": "KEMO CHAM and JESSICA DONATI",
      "description": "FREETOWN, Sierra Leone (AP) — Companies that bring solar power to some of the poorest homes in Central and West Africa are said to be among the fastest growing on a continent whose governments have long struggled to address some of the world's worst infrastructure and the complications of climate change.",
      "publishedAt": "2024-10-05T04:34:34Z",
      "title": "Solar power companies are growing fast in Africa, where 600 million still lack electricity",
      "url": "https://apnews.com/4dae37aa5c7984e157f00ed5b88fd75b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e19b433b9ce944919686532be1fa16e1/2048.jpeg"
    },
    {
      "author": "NADIA LATHAN and SUMMER BALLENTINE",
      "description": "AUSTIN, Texas (AP) — A Texas man set to die this month is at the center of another push for clemency in the U.S., this time backed by several GOP lawmakers and bestselling author John Grisham, who say a father’s 2002 conviction for killing his infant daughter deserves a second look.",
      "publishedAt": "2024-10-05T04:03:29Z",
      "title": "A Texas execution is renewing calls for clemency. It's rarely granted",
      "url": "https://apnews.com/9fcdf7f534a37f3ba8152781185a96e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f43b2894dd94c1b823083ca0239e515/1827.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}