{
  "articles": [
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Republicans and Israeli officials were quick to express outrage after Senate Majority Leader Chuck Schumer sharply criticized Prime Minister Benjamin Netanyahu's handling of the war in Gaza and called for Israel to hold new elections.",
      "publishedAt": "2024-03-16T12:32:23Z",
      "title": "Schumer's rebuke of Netanyahu shows the long, fragile line the US and allies walk on interference",
      "url": "https://apnews.com/3c86e541396fda36b0ef05b2d36c28e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/660d58f90527493597a63b20eb331b82/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Stalled talks aimed at securing a cease-fire in the war between Israel and Hamas are expected to resume in earnest in Qatar as soon as Sunday, according to Egyptian officials.",
      "publishedAt": "2024-03-16T10:21:21Z",
      "title": "Cease-fire talks with Israel and Hamas are expected to resume Sunday in Qatar",
      "url": "https://apnews.com/53a0fff49d9196fc38f75ad1b37a64bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Voters across Russia cast ballots Saturday on the second day of an election set to formalize six more years of power for President Vladimir Putin, who faces no serious challengers after crushing political dissent over his nearly quarter-century of rule.",
      "publishedAt": "2024-03-16T05:45:24Z",
      "title": "Russians cast ballots in an election preordained to extend President Vladimir Putin's rule",
      "url": "https://apnews.com/55fc9746c240cfd7f267b007f83a1147",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a097dc54e864f34a9a7bcacd9c8a00d/3000.jpeg"
    },
    {
      "author": "STAN CHOE and CHRISTOPHER RUGABER",
      "description": "NEW YORK (AP) — It seems like a bizarre mishmash: A former Trump cabinet official is saying he wants to buy TikTok just days after leading a group that pumped $1 billion into a beaten-down bank.",
      "publishedAt": "2024-03-16T12:56:18Z",
      "title": "Mnuchin’s interest in TikTok and distressed NY bank echoes his pre-Trump investment playbook",
      "url": "https://apnews.com/5527566c81a6f3d9b288bba232f55684",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c5b00c65afa4153a84bace70db474b1/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden was returning from church a week ago when he stepped out of his armored SUV onto the driveway of his Wilmington, Delaware, home on an important mission: He wanted to inspect the landscaping.",
      "publishedAt": "2024-03-16T04:14:08Z",
      "title": "The Hur interview transcript offers a window into the life of 'frustrated architect' Joe Biden",
      "url": "https://apnews.com/68a70e86ae2c9b7affe1b5352aee5347",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df3794e9b9a4473fbfca2a0f9d3556b6/3000.jpeg"
    },
    {
      "author": null,
      "description": "FAIRLESS HILLS, Pa. (AP) — Several people were shot after gunfire erupted early Saturday in a suburban Philadelphia township, forcing cancellation of a St. Patrick's Day parade and shutting down a children's theme park, authorities said.",
      "publishedAt": "2024-03-16T15:07:50Z",
      "title": "Authorities order residents to shelter in place after shootings in suburban Philadelphia township",
      "url": "https://apnews.com/fb5a52ecf043dc82556ae0d0286007b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c1d3d493ec148f1aa4a08cf4671c47c/3000.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — In the Chinese city of Shanghai, two young women seeking an education abroad have both decided against going to the United States, a destination of choice for decades that may be losing its shine.",
      "publishedAt": "2024-03-16T14:37:08Z",
      "title": "After the pandemic, young Chinese again want to study abroad, just not so much in the US",
      "url": "https://apnews.com/a0193f84fd7b6879867aee147ae73a48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9104cc979c54fdf9c576313a5693331/3000.jpeg"
    },
    {
      "author": "DEVNA BOSE",
      "description": "As rural hospitals continue to struggle financially, a new type of hospital is slowly taking root, especially in the Southeast.",
      "publishedAt": "2024-03-16T12:55:30Z",
      "title": "A new kind of hospital is coming to rural America. To qualify, facilities must close their beds",
      "url": "https://apnews.com/19b3212835aa7786e1e488ae45267ea6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15265016260e4bc6900fca26338c42e4/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS, GIOVANNA DELL'ORTO, MARIAM FAM and DARREN SANDS",
      "description": "DEARBORN, Mich. (AP) — While Muslim students remain a rarity in many U.S. school districts, they are a major presence in some communities, prompting public schools to be more attentive to their needs during the holy month of Ramadan when dawn-to-sundown fasting is a duty of Islam.",
      "publishedAt": "2024-03-16T12:03:25Z",
      "title": "Fasting at school? More Muslim students in the US are getting support during Ramadan",
      "url": "https://apnews.com/8504b32049791fbc85eec9a8f68c700f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8843e8bd02b47a98dc58bc6f87478da/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Americans celebrated Irish heritage at several major St. Patrick's Day parades Saturday, marking the holiday a day early at events that included a big anniversary in Savannah, Georgia, and honored a pioneering female business leader as grand marshal in New York.",
      "publishedAt": "2024-03-16T04:16:43Z",
      "title": "With green and glee, major US parades mark St. Patrick's Day — a little early",
      "url": "https://apnews.com/9f984e62ddb4447b249d47f9051df9be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8d0bfd8ade14018b3a552f2275603a2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}