{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Israeli airstrikes on the Gaza Strip overnight killed at least 20 people, Palestinian medics said Monday. One of the strikes hit a tent camp in the Muwasi area, an Israel-declared humanitarian zone, killing eight people, including two children, according to Nasser Hospital in the southern city of Khan Younis, which received the bodies.",
      "publishedAt": "2024-12-23T08:35:17Z",
      "title": "Middle East latest: Israeli airstrikes on Gaza kill at least 20 people, Palestinian medics say",
      "url": "https://apnews.com/d7d28b67bb47c390a7be0ddd925f1c46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2787976db70d44dbbc6768c41cd07403/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Two recently retired senior Israeli intelligence agents shared new details about a deadly clandestine operation years in the making that targeted Hezbollah militants in Lebanon and Syria using exploding pagers and walkie talkies three months ago.",
      "publishedAt": "2024-12-23T03:48:34Z",
      "title": "Former Israeli spies describe attack using exploding electronic devices against Hezbollah",
      "url": "https://apnews.com/b008d92e6c9f0747f23def9bf3a5e3df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4578cf516cc485d8b38cb51acfb8a6e/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden announced Monday that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment mere weeks before President-elect Donald Trump, an outspoken proponent of expanding capital punishment, takes office.",
      "publishedAt": "2024-12-23T10:00:56Z",
      "title": "Biden gives life in prison to 37 of 40 federal death row inmates so Trump can't have them executed",
      "url": "https://apnews.com/f67b5e04453cd1aa6383c516bc14f300",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d267045be5a4afe9b3a92dc073a2fba/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PHOENIX (AP) — As Washington heaved over the possibility of a partial government shutdown, leading far-right figures gathered with thousands of Donald Trump’s most ardent supporters and, for the most part, gloried in splintering the president-elect’s party.",
      "publishedAt": "2024-12-23T05:15:03Z",
      "title": "The new right celebrates Trump at a conservative conference and sidesteps inconsistencies",
      "url": "https://apnews.com/afb64a04493ddf44df3b7338536a6524",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/457c0b4eae654e329aa350b7bb3f7cfa/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The man accused of fatally shooting the CEO of UnitedHealthcare is expected to be arraigned in a Manhattan court Monday on murder and terror charges in a state case that will run parallel to his federal prosecution.",
      "publishedAt": "2024-12-23T05:30:42Z",
      "title": "Luigi Mangione to appear in Manhattan court to face state charges in death of UnitedHealthcare CEO",
      "url": "https://apnews.com/8079a5bbe5f3e0539d09332a7240168d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/698a7419f63b4d7094a79f741c636bdb/3000.jpeg"
    },
    {
      "author": null,
      "description": "MAGDEBURG, Germany (AP) — Mourners laid flowers near the scene of the deadly Christmas market attack on Monday as investigators puzzled over the motive of the suspect and fears swirled that the rampage could deepen divisions in German society.",
      "publishedAt": "2024-12-23T10:12:07Z",
      "title": "Magdeburg mourns Christmas market attack victims as fears swirl of deeper social divisions",
      "url": "https://apnews.com/9ae2b2ca5cea3cef79fe502ab3f27b63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2068cea9a4874dea914449d50b09c0e0/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and ELAINE KURTENBACH",
      "description": "TOKYO (AP) — Japanese automakers Honda and Nissan have announced plans to work toward a merger, forming the world’s third-largest automaker by sales as the industry undergoes dramatic changes in its transition away from fossil fuels.",
      "publishedAt": "2024-12-23T07:32:06Z",
      "title": "Nissan, Honda announce plans to merge, creating world's No. 3 automaker",
      "url": "https://apnews.com/782913451d6487ed177a3517a9ba5be5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6c8e77b49de4a37b15f5359004d55da/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Opponents of abortion are increasingly focusing on restricting access to pills, which are the most common way to end a pregnancy in the U.S.This month, the Texas attorney general's office filed a lawsuit against a New York doctor, saying she violated Texas law by prescribing abortion pills to a patient there via telemedicine.",
      "publishedAt": "2024-12-23T05:23:34Z",
      "title": "Abortion opponents shift focus to pills with lawsuits, proposed laws and possible federal action",
      "url": "https://apnews.com/3e5652cc354e2f7cfb2b65be38c1bed9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a744459339c4806ae49093a03ad884e/3000.jpeg"
    },
    {
      "author": "RISHI LEKHI",
      "description": "KANGPOKPI, India (AP) — Phalneivah Khonsai ran for her life when violence struck her neighborhood in India's restive northeast, carrying just the bare essentials in the hope that she and her family could return soon.",
      "publishedAt": "2024-12-23T06:05:27Z",
      "title": "Tens of thousands displaced by ethnic violence in northeast India suffer squalid conditions in camps",
      "url": "https://apnews.com/9153549db3852e7f34a3ef70b7bdb349",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/571fed23e0524513aba08db80e20b663/1920.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BAN NAM KHEM, Thailand (AP) — The 20-year-old freshman student was still asleep that Sunday morning at the family's house on the Andaman Sea coast of southern Thailand when her mom, sensing something wasn't right, woke her up saying they needed to leave right away.",
      "publishedAt": "2024-12-23T02:09:15Z",
      "title": "Trauma lingers on for survivors of the deadly tsunami that hit Thailand 20 years ago",
      "url": "https://apnews.com/d65d7ad67550a623524fc037a7628452",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92e9d56c106b45b8ba265f49a83756b2/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}