{
  "articles": [
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden delivered a defiant argument for a second term in his State of the Union speech Thursday night, lacing into GOP front-runner Donald Trump for espousing “resentment, revenge and retribution\" and for jeopardizing freedom at home and abroad.",
      "publishedAt": "2024-03-07T05:03:44Z",
      "title": "Biden uses feisty State of the Union to contrast with Trump, sell voters on a second term",
      "url": "https://apnews.com/1a42ff9d4ef3e0f2753e43ac8d39fc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bf829fb06024f278199680850b6a986/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The State of the Union address is one of the durable set pieces of the presidency, a forum that almost always favors the speaker in a one-way conversation with millions of Americans.",
      "publishedAt": "2024-03-08T04:08:59Z",
      "title": "Takeaways from Biden's State of the Union address: Combative attacks on a foe with no name",
      "url": "https://apnews.com/31cfc7a93213f052eb3f8a0bf51173d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a67c1d4766040ef8da9af5a4e12383f/3000.jpeg"
    },
    {
      "author": "MOHAMED JAHJOUH, JACK JEFFERY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — After months of warnings over the risk of famine in Gaza under Israel’s bombardment, offensives and siege, children are starting to die.",
      "publishedAt": "2024-03-08T05:04:53Z",
      "title": "After months of warnings that Israel’s siege is causing famine, children begin to die in Gaza",
      "url": "https://apnews.com/2f938b1a82d7822c7da67cc162da1a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5753ce5fa63b4896bcc5e7edf928ef66/3000.jpeg"
    },
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "NICOSIA, Cyprus (AP) — A ship will head to Gaza on Friday carrying humanitarian aid, the European Commission president said, as international donors launch a sea corridor to supply the territory, which faces widespread hunger and shortages of other essential supplies after nearly five months of war.",
      "publishedAt": "2024-03-08T08:01:57Z",
      "title": "A top EU official says a ship is leaving for Gaza as test of new humanitarian corridor",
      "url": "https://apnews.com/196b1e1bdef8ce28449799759c797d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7614b35c394040cf9ae2be527abf826d/2000.jpeg"
    },
    {
      "author": "MATT BROWN and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — At first glance, images circulating online showing former President Donald Trump surrounded by groups of Black people smiling and laughing seem nothing out of the ordinary, but a look closer is telling.",
      "publishedAt": "2024-03-08T05:09:50Z",
      "title": "Fake images made to show Trump with Black supporters highlight concerns around AI and elections",
      "url": "https://apnews.com/72194f59823037391b3888a1720ba7c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd3ddcaddfae4e35b70535aee9b0b092/3000.jpeg"
    },
    {
      "author": "ANGELA CHARLTON",
      "description": "PARIS (AP) — France’s leadership will use a press from the time of Napoleon to seal the right to abortion into the country's constitution in a historic ceremony Friday that's open to the public and is designed to show support to women across the world on International Women’s Day.",
      "publishedAt": "2024-03-08T05:19:36Z",
      "title": "France to seal the right to abortion in its constitution as world marks International Women's Day",
      "url": "https://apnews.com/e9475951b59cd5778b9741aa4a21f339",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c978bb520ab409ab588f55183fbb328/3000.jpeg"
    },
    {
      "author": "MARIAM FAM",
      "description": "CAIRO (AP) — Observant Muslims the world over will soon be united in a ritual of daily fasting from dawn to sunset as the Islamic holy month of Ramadan starts. For Muslims, it's a time of increased worship, charity and good deeds.",
      "publishedAt": "2024-03-08T06:36:17Z",
      "title": "What is Ramadan and how do Muslims observe the Islamic holy month?",
      "url": "https://apnews.com/d8c9e002e4904c5d8e0ccee2b77f9ad4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8435f84db1945a98d3ec449498cee97/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Most of America “springs forward” Sunday for daylight saving time and losing that hour of sleep can do more than leave you tired and cranky the next day.",
      "publishedAt": "2024-03-08T06:01:18Z",
      "title": "How springing forward to daylight saving time could affect your health -- and how to prepare",
      "url": "https://apnews.com/06088a66e5e7a86e9df4843742377d89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cda39760404648f498772891cedd5530/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — For Margarita, a 33-year-old event planner in St. Petersburg, the prison death of opposition leader Alexei Navalny was devastating news that left her dispirited and longing to take some sort of action.",
      "publishedAt": "2024-03-08T05:31:28Z",
      "title": "With dissent stifled, some Russians help political prisoners by writing them letters of support",
      "url": "https://apnews.com/8ad5c35d3b481500f8cca3e5ee9a27a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7870acb075a3496c99ca5edc2e96e8e3/3000.jpeg"
    },
    {
      "author": "DAKE KANG and ZEN SOO",
      "description": "BEIJING (AP) — The hotel was spacious. It was upscale. It had a karaoke bar. The perfect venue, the CEO of the Chinese hacking company thought, to hold a Lunar New Year banquet currying favor with government officials.",
      "publishedAt": "2024-03-08T05:53:20Z",
      "title": "Behind the doors of a Chinese hacking company, a sordid culture fueled by influence, alcohol and sex",
      "url": "https://apnews.com/6276e8662ddf6f2c1afbae994d8b3aa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2382c9d352014c07b5390c59d3b04fc1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}