{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — An Israeli airstrike killed 76 members of an extended family, rescue officials said Saturday, a day after the U.N. chief warned again that nowhere is safe in Gaza and that Israel's ongoing offensive is creating “massive obstacles” to the distribution of humanitarian aid.",
      "publishedAt": "2023-12-23T09:31:19Z",
      "title": "Israeli strike kills 76 members of one Gaza family, rescue officials say as combat expands in south",
      "url": "https://apnews.com/982fae4d0802b20d2a90423445c9f64b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef01d65383c445b6982022e54c1ef8b6/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Most U.S. state legislatures will reconvene in January for the first time since Hamas' Oct. 7 attack on Israel sparked a war in Gaza and protests worldwide — and they're preparing to take action in response, both symbolic and concrete.",
      "publishedAt": "2023-12-23T05:23:31Z",
      "title": "Israel and Hamas measures get a look as most US state legislatures meet for first time since Oct. 7",
      "url": "https://apnews.com/6f21af19b7ccb55ad3f6cfcd41a9aac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd5ed9068a34288b1755ad6fda5d6c6/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Supreme Court said Friday it will not immediately take up a plea by special counsel Jack Smith to rule on whether former President Donald Trump can be prosecuted for his actions to overturn the 2020 election results.",
      "publishedAt": "2023-12-22T19:35:57Z",
      "title": "Supreme Court rejects prosecutor's push to fast-track ruling in Trump election subversion case",
      "url": "https://apnews.com/90b93eeb663ebaf67a2e0bc266390fa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f330bb5f2a44ebe8e25ad558f046f49/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Standing on a portable stage erected at home plate of the Milwaukee Brewers ballpark, Wisconsin Gov. Tony Evers recently praised the professional baseball team as an “essential part” of the state's “culture and identity” and “economic success.”",
      "publishedAt": "2023-12-23T06:07:29Z",
      "title": "Plans abounding for new sports stadiums across the US, carrying hefty public costs",
      "url": "https://apnews.com/a81d825286530bb95f227efc99f2e9d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b6a5b9d47fd4410a21a84f3d7c4ef4b/3000.jpeg"
    },
    {
      "author": "KRISTEN GELINEAU, EDNA TARIGAN and REZA SAIFULLAH",
      "description": "PIDIE, Indonesia (AP) — Their screams and sobs could be heard from the ailing boat soon after it emerged into view amid the vastness of the Andaman Sea. Crowded on board were tiny babies and children, alongside mothers and fathers begging to be saved.",
      "publishedAt": "2023-12-23T04:12:38Z",
      "title": "‘Pray for us’: Eyewitnesses reveal first clues about a missing boat with up to 200 Rohingya refugees",
      "url": "https://apnews.com/c174d368f3a20e704b0aa745f8449e01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58c1679cf9de446ba6213b8597e183a6/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — The liberal-controlled Wisconsin Supreme Court overturned Republican-drawn legislative maps on Friday and ordered that new district boundary lines be drawn as Democrats had urged in a redistricting case they hope will weaken GOP majorities.",
      "publishedAt": "2023-12-22T20:52:44Z",
      "title": "Wisconsin Supreme Court orders new legislative maps in redistricting case brought by Democrats",
      "url": "https://apnews.com/eccbcfee414d1943073a9fb949743860",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd6a7aec34eb4e7987915b6a97c28b91/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — Two Denver-area paramedics were convicted Friday for giving a fatal overdose of the sedative ketamine to Elijah McClain in 2019 — a jury verdict that experts said could have a chilling effect on first responders around the country.",
      "publishedAt": "2023-12-23T00:54:50Z",
      "title": "Paramedics were convicted in Elijah McClain's death. That could make other first responders pause",
      "url": "https://apnews.com/acef1eabe02b458f53d30d8fe3bf76a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82b0a785d7b74d0583fb836bfbcea090/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump says he is eager to debate President Joe Biden, even if the debates are sponsored by the nonpartisan Commission on Presidential Debates.",
      "publishedAt": "2023-12-22T18:55:50Z",
      "title": "Trump says he’s eager to debate Biden in 2024, even if controversial commission plans events",
      "url": "https://apnews.com/428216dc2a0e9692a64dfde800753f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbc94b4816904e9aa078340f955f28ce/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "A Washington state law aimed at improving police accountability is in the spotlight after three Tacoma officers were acquitted in the 2020 death of Manuel Ellis, a Black man who was shocked, beaten and restrained face-down on a sidewalk as he pleaded for breath.",
      "publishedAt": "2023-12-23T02:10:38Z",
      "title": "Acquittals in Manuel Ellis' death put Washington state's police accountability law in the spotlight",
      "url": "https://apnews.com/e7c66e9cf9f0a4e8a33fb4aa15e0c3f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2f24674b3424945af8e22c28bfb3fc0/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ",
      "description": "ACOLMAN, Mexico (AP) — María de Lourdes Ortiz Zacarías swiftly cuts hundreds of strips of newsprint and colored crepe paper needed to make a piñata, soothed by Norteño music on the radio while measuring pieces by feel.",
      "publishedAt": "2023-12-23T05:04:28Z",
      "title": "In Mexico, piñatas are not just child's play. They're a 400-year-old tradition",
      "url": "https://apnews.com/aea87fa66c7263c467559baa8090b77e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8eee0536f48a49a6a3aee584a6fc878f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}