{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, JILL COLVIN and JOSH BOAK",
      "description": "PHILADELPHIA (AP) — Kamala Harris pressed a forceful case against Donald Trump on Tuesday in their first and perhaps only debate before the presidential election, repeatedly goading him in an event that showcased their starkly different visions for the country on abortion, immigration and American democracy.",
      "publishedAt": "2024-09-10T04:05:35Z",
      "title": "Harris presses a more forceful case against Trump than Biden did on abortion, economy and democracy",
      "url": "https://apnews.com/6ad8c03f6bf1ae88870b7db26276236e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d4d121c150485c9377c31eac3b8666/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Donald Trump and Kamala Harris faced each other on the debate stage for the first — and possibly the last — time.",
      "publishedAt": "2024-09-11T02:26:48Z",
      "title": "Key takeaways from a debate that featured tense clashes and closed with a Taylor Swift endorsement",
      "url": "https://apnews.com/b648ff0b9baf10d4625548e815d7cfe3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f495ed82ff9a4d189873df62bf43b5e8/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — To many Democrats, Kamala Harris was everything Joe Biden was not in confronting Donald Trump on the debate stage: forceful, fleet of foot, relentless in going after her opponent.",
      "publishedAt": "2024-09-11T04:39:58Z",
      "title": "To pumped-up Democrats, Harris was everything Biden was not in confronting Trump in debate",
      "url": "https://apnews.com/319079a18ea993066bea750b57f6e0fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db739489e539420793cc8b9d065a4689/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The U.S. is remembering the lives taken and those reshaped by 9/11, marking an anniversary laced this year with presidential campaign politics.",
      "publishedAt": "2024-09-11T04:08:12Z",
      "title": "US commemorates 9/11 attacks with victims in focus, but politics in view",
      "url": "https://apnews.com/52ddad8ed7f62e155644f0ae6eda96ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91a8fcfb278045e4a988f6fc0d263010/2000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation in the United States may have hit a three-year low in August, underscoring that the rate of price increases is falling back to pre-pandemic levels and clearing the way for the Federal Reserve to start cutting its key interest rate next week.",
      "publishedAt": "2024-09-11T07:00:20Z",
      "title": "US inflation likely fell further last month as Fed prepares to cut rates next week",
      "url": "https://apnews.com/bb1f4cfeede550c6c82fd78e2ea537a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78de5fe3a6cd4e98b052bb054ffb2b22/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes on Palestinian territories have killed more than two-dozen Palestinians on Wednesday, according to local officials. They say an Israeli airstrike killed five Palestinians in the occupied West Bank, and at least 20 people, including 16 women and children, were killed in the Gaza Strip.",
      "publishedAt": "2024-09-11T06:50:18Z",
      "title": "Israel-Hamas war latest: Israeli airstrikes on Palestinian territories kill dozens more",
      "url": "https://apnews.com/9ba2cc21d3f1b308f98ff99b233768b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc2e740f9b864d4697cf5803b8612571/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — U.S. Secretary of State Antony Blinken and British Foreign Secretary David Lammy arrived in Kyiv on a joint visit Wednesday, as Ukraine presses the West to allow it to use long-range missiles against Russia.",
      "publishedAt": "2024-09-11T08:48:11Z",
      "title": "Blinken and Lammy arrive in Kyiv as Ukraine pushes for long-range strikes against Russia",
      "url": "https://apnews.com/0584fb5f4cf2b89f9b4eea1358700a91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/966235c6b9c74abfb8166eb03c8d173b/3000.jpeg"
    },
    {
      "author": null,
      "description": "HANOI, Vietnam (AP) — A flash flood swept away an entire hamlet in northern Vietnam, killing 30 people and leaving dozens missing as deaths from a typhoon and its aftermath climbed to 155 on Wednesday.",
      "publishedAt": "2024-09-11T03:32:46Z",
      "title": "Flash flood sweeps away hamlet as Vietnam's storm toll rises to 155 dead",
      "url": "https://apnews.com/682dff62798f943244bc96f072072ef7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7b80832586d4eaa87308425432800ee/1920.jpeg"
    },
    {
      "author": "EUGENE GARCIA and THOMAS PEIPERT",
      "description": "TRABUCO CANYON, Calif. (AP) — Alex Luna, a 20-year-old missionary, saw the sky turn from a cherry red to black in about 90 minutes as an explosive wildfire raced toward the Southern California mountain community of Wrightwood and authorities implored residents to leave their belongings behind and get out of town.",
      "publishedAt": "2024-09-11T06:31:04Z",
      "title": "'Hellish' scene unfolds as wildfire races toward California mountain community",
      "url": "https://apnews.com/64803e9fc481128f1839e729ad36544f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c59817fd48d4bce8a0631cc26b87bfd/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Taylor Swift, one of the music industry's biggest stars, endorsed Kamala Harris for president shortly after the presidential debate ended.",
      "publishedAt": "2024-09-11T03:19:05Z",
      "title": "Taylor Swift endorses Kamala Harris for president after debate ends",
      "url": "https://apnews.com/3a36b6f9695c20153891bba35c47f21d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c848134ad604db1933c034659eec0b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}