{
  "articles": [
    {
      "author": "Colleen Barry, Nicole Winfield",
      "description": "Pope Francis’ body will be moved to St. Peter’s Basilica to lie in state allowing the Catholic faithful to pay their respects to the Argentine pope. Francis is being remembered for his humble style, concern for the poor and insistent prayers for peace. Heads of state are expected for the funeral Saturday in St. Peter’s Square. But the three days of public viewing are largely for ordinary Catholics to mourn the 88-year-old pope. Francis died Monday after suffering a stroke. His body will be transferred Wednesday morning to St. Peter’s Basilica. The public mourning period will end on Friday night.",
      "publishedAt": "2025-04-23T04:45:44Z",
      "title": "Pope Francis' body to lie in state in St. Peter's Basilica as the faithful mourn",
      "url": "https://apnews.com/article/vatican-pope-francis-public-viewing-st-peters-732d413b0eba7695d8a931af393097f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b6aae6/2147483647/strip/true/crop/7087x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F12%2F2686b99b7e28dc4c12742744dd78%2F1b27f627a766436ca580eeee7ef6fe2c"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis had a learning curve on clergy sexual abuse, with the turning point coming in 2018. Few people could have predicted that a comment he made then, dismissing victims of Chile's most notorious pedophile, would blow up into the biggest crisis of his papacy. But it was one that eventually set the Catholic Church on a new path of accountability for clergy sexual abuse. Years later, Francis recognized that the Chile trip was his “conversion” moment, when he came to realize he had been misled about just how bad the problem was.",
      "publishedAt": "2025-04-23T04:46:35Z",
      "title": "How Pope Francis dealt with clergy sexual abuse",
      "url": "https://apnews.com/article/pope-francis-catholic-church-sexual-abuse-2d87fe01e6ede23d403039b9fd3a978f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0dce4b1/2147483647/strip/true/crop/3757x2113+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F01%2F732a0c2aeae78760909680a72766%2Fb72a7543aab74d549092d75d7ea8346e"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Officials say Arab mediators are working on a proposal to end the Israel-Hamas war that would include a five to seven year truce and the release of all remaining hostages. An Israeli strike on the Gaza Strip overnight into Wednesday killed 23 people, according to local health authorities. Egypt and Qatar are still developing the proposal, which would include the gradual withdrawal of Israeli forces from the entire strip and the release of Palestinian prisoners. Hamas would also hand over power to a committee of independent technocrats. Israel and the United States have ruled out any proposal that would allow Hamas to retain influence in Gaza and rearm.",
      "publishedAt": "2025-04-23T08:56:35Z",
      "title": "Mediators work on proposal for long-term truce as Israeli strike on Gaza kills 23",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-23-2025-c02528565c529a717967297d0f76d3aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ccc149/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F80%2Fae0b10e2a908b0530f3c3bd2d9e1%2Fb6fe0be500724a4da11c33c5fc8e6eef"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Health officials in the Gaza Strip say more than 400 dialysis patients have died during the 18-month Israel-Hamas war because of lack of proper treatment. Israel has restricted the supply of humanitarian aid throughout much of the war and imposed a complete blockade more than six weeks ago. Its numerous evacuation orders across much of the territory have challenged patients' ability to reach regular care. Six of the seven dialysis centers in Gaza have been destroyed during the war. That's according to the World Health Organization earlier this year. Patients who should be having three weekly dialysis visits are now getting two and for shorter periods.",
      "publishedAt": "2025-04-23T05:27:12Z",
      "title": "Dialysis patients struggle to get treatment in blockaded Gaza. Officials say hundreds have died",
      "url": "https://apnews.com/article/gaza-israel-palestinians-kidney-dialysis-health-war-c72ce95bf0d8f9b2c719a01aeb04341e",
      "urlToImage": "https://dims.apnews.com/dims4/default/01ac53b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F29%2Fadd37b89536849e57488c3188cad%2Ff8215b02d2af4a8f97fb818ac16035e3"
    },
    {
      "author": null,
      "description": "Diplomats and defense chiefs from Britain, the U.S., European nations and Ukraine are due to meet in London to push for a peace deal between Moscow and Kyiv. British Defense Secretary John Healey said Wednesday's meeting of foreign ministers and national security adviserswill include “what a ceasefire might look like and how to secure peace in the long term.” It follows talks last week in Paris. Those attending include retired Lt. Gen. Keith Kellogg, President Donald Trump’s envoy for Ukraine and Russia. The U.S. State Department said Secretary of State Marco Rubio, who attended the Paris talks, was unable to come because of a scheduling issue.",
      "publishedAt": "2025-04-23T04:47:36Z",
      "title": "Officials from Ukraine, US and UK meet in London in latest push to stop the war",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-london-4f35dc70f521e2363218f4c40748caba",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d59037/2147483647/strip/true/crop/8122x4569+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F4c%2F9b0b4b184c99bd5386eb05e6c66f%2F79281dd1c0ce43ea94daa06bba49b831"
    },
    {
      "author": "Aijaz Hussain",
      "description": "Security has been beefed up across Indian-controlled Kashmir a day after an attack killed at least 26 people, most of them tourists, as Indian forces launched a manhunt for the perpetrators of one of the deadliest attacks in the restive Himalayan region. As investigators began probing the attack, many shops and businesses in Kashmir closed to protest the killings following a call from the region’s religious and political parties. Tens of thousands of armed police and soldiers fanned out across the region and erected additional checkpoints. Police called it a “terror attack” and blamed militants fighting against Indian rule. There was no immediate claim of responsibility.",
      "publishedAt": "2025-04-23T07:17:03Z",
      "title": "Indian troops beef up security in Kashmir after Pahalgam attack",
      "url": "https://apnews.com/article/kashmir-tourist-attack-india-pakistan-801a1ee244cc88846619370237876c11",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bf75d1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F83%2F6a7d1759b521089b141a39ba1b3f%2F19eb94b4628e43159fda97fb6d3985e4"
    },
    {
      "author": "Sheikh Saaliq",
      "description": "At least 26 people have been killed and 17 others wounded after gunmen opened fire on a group of tourists in Indian-controlled Kashmir, the worst assault in years targeting civilians in the restive region that has seen an anti-India rebellion for more than three decades. Tuesday’s attack took place in the picturesque town of Pahalgam in the Himalayan mountains, popular with Indian visitors. Police accused rebels of masterminding the attack. The region has seen a spate of militant attacks in remote mountains in recent years, but violence has largely declined in the Kashmir Valley. India and Pakistan have each laid claim to Kashmir since war broke out following the British partition of the subcontinent in 1947.",
      "publishedAt": "2025-04-23T06:38:43Z",
      "title": "Disputed Kashmir has witnessed worst attack on civilians in years, sparking fear of rising tensions",
      "url": "https://apnews.com/article/kashmir-pahalgam-militant-attack-india-explainer-440b6e3b2886fe18aa2521e823d0754c",
      "urlToImage": "https://dims.apnews.com/dims4/default/0b0e3b9/2147483647/strip/true/crop/8338x4690+0+434/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fb5%2F28591e5f43e4bb5994786b953859%2F7cdcf7a0b64b44fdbaa6fdec8c07ee5c"
    },
    {
      "author": "Josh Boak, Fatima Hussein",
      "description": "U.S. Treasury Secretary Scott Bessent said in a Tuesday speech that the ongoing tariffs showdown with China is unsustainable and expects a “de-escalation” in the trade war between the world’s two largest economies. But in a private speech in Washington for JPMorgan Chase, Bessent also cautioned that talks between the United States and China had yet to formally start. President Donald Trump placed a 145% import tax on China, which countered with 125% tariffs on U.S. imports. Trump has placed tariffs on several dozen countries, causing the stock market to stumble and interest rates to increase on U.S. debt as investors worry about slower economic growth and higher inflationary pressures.",
      "publishedAt": "2025-04-22T17:51:36Z",
      "title": "Scott Bessent says US tariff war with China is not 'sustainable'",
      "url": "https://apnews.com/article/tariffs-trade-taxes-trump-china-bessent-treasury-66668fa26957ece530a250fa8ea19faa",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fd9ea1/2147483647/strip/true/crop/4792x2696+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2Fbe%2Fbba80cc7a96d129a126e4e2e45e0%2F90de5d469b234a8287bbb52c9f4345d1"
    },
    {
      "author": null,
      "description": "A wildfire burning in New Jersey has forced thousands of people to evacuate and temporarily closed a stretch of a major highway. The Ocean County Sheriff's office says the Garden State Parkway was closed between Barnegat and Lacey townships on Tuesday night, but has since reopened. Authorities say more than 1,300 structures have been threatened and power is out to most of Barnegat Township. About 3,000 residents have been evacuated. There have been no immediate reports of injuries. The cause of the fire is under investigation. The New Jersey Forest Fire Service planned to give an update at news conference late Wednesday morning.",
      "publishedAt": "2025-04-23T10:42:24Z",
      "title": "New Jersey fire prompts evacuations and disrupts Garden State Parkway travel",
      "url": "https://apnews.com/article/wildfire-new-jersey-evacuations-garden-state-parkway-54b9d32e868a12be0556f2631975e552",
      "urlToImage": "https://dims.apnews.com/dims4/default/10697b1/2147483647/strip/true/crop/5679x3194+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fcd%2F26c865c7b9910bc136011d201dee%2F9d42d2a055c14889b165346f49d474b1"
    },
    {
      "author": "Fatima Hussein",
      "description": "The height of tax season was the height of turmoil at the IRS. The agency has churned through acting directors and is preparing to lose tens of thousands of workers to layoffs and voluntary retirements. All the while, President Donald Trump is weighing in on which nonprofits should lose their tax-exempt status. The incursion into the IRS' typically apolitical stance threatens to further erode trust in federal institutions and weaponize enforcement efforts. Just three months into Trump’s second term, the government’s fly-under-the-radar tax collector has become the latest platform for the Republican administration’s vision to cut and control the federal bureaucracy.",
      "publishedAt": "2025-04-23T10:18:52Z",
      "title": "Leadership churn, worker exodus and threats to groups' tax-exempt status roil IRS",
      "url": "https://apnews.com/article/trump-irs-layoffs-turmoil-tax-season-5e897d6371da8da1ed620a539d727f5b",
      "urlToImage": "https://dims.apnews.com/dims4/default/de66cba/2147483647/strip/true/crop/3484x1960+0+187/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2Fbf%2Fcc3c98ce312a5ffe2c41880624b5%2Fcb56a7c86a844c949c2e33b4362652df"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}