{
  "articles": [
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — A rare general strike in Israel to protest the failure to return hostages held in Gaza led to disruptions around the country on Monday, while U.S. President Joe Biden added to the pressure by saying Israeli Prime Minister Benjamin Netanyahu isn't doing enough to reach a deal for a cease-fire.",
      "publishedAt": "2024-09-02T06:49:47Z",
      "title": "Rare strike disrupts Israel while Biden says Netanyahu isn't doing enough to reach Gaza deal",
      "url": "https://apnews.com/f8a8c85f8947631a7f3039e087dd3904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72c668d160854543848caf93217eff04/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — An Israeli-American family that became an international icon in the struggle to free hostages from Hamas captivity in Gaza laid their son to rest on Monday after he was said to have been killed by militants as soldiers were approaching the spot where he was being held.",
      "publishedAt": "2024-09-02T15:06:59Z",
      "title": "'We all failed you.' Heartbreak at funeral for Israeli-American hostage in Jerusalem",
      "url": "https://apnews.com/0be443e7ce616cbce3f2cb984e7971ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ef6aab9465e47e4a9dcfd40f772d02e/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris plans to use Monday's joint campaign appearance in the industrial city of Pittsburgh with President Joe Biden to say that U.S.",
      "publishedAt": "2024-09-02T04:14:45Z",
      "title": "Harris set to oppose sale of US Steel to a Japanese firm during joint Pennsylvania event with Biden",
      "url": "https://apnews.com/afd4b7fbd9d747e307a8fb5c1f60d5fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d56c7a6cd8d41809f8ef68e05da1c6c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "WASHINGTON (AP) — The U.S. government has seized a plane used by Venezuelan President Nicolas Maduro that officials say was illegally purchased through a shell company and smuggled out of the United States, citing violations of sanctions and export control laws.",
      "publishedAt": "2024-09-02T17:12:05Z",
      "title": "US government seizes plane used by Venezuelan president, citing sanctions violations",
      "url": "https://apnews.com/cceb18c18908a5d3bd4ea691ac3a8d7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cacd27d34ccc4f908f40e316c79ca64d/3000.jpeg"
    },
    {
      "author": "DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — A Brazilian Supreme Court panel on Monday unanimously upheld the decision of one of its justices to block billionaire Elon Musk’s social media platform X nationwide, according to the court’s website.",
      "publishedAt": "2024-09-02T15:35:59Z",
      "title": "Brazil Supreme Court panel unanimously upholds judge's decision to block X nationwide",
      "url": "https://apnews.com/6942614705a4e85064f1d98628b49295",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5bf5e27677b40df8e485b2625f882b1/3000.jpeg"
    },
    {
      "author": "BY OLIVIA DIAZ and BRIAN WITTE",
      "description": "WASHINGTON (AP) — Worries of being uprooted from their jobs have returned for Laura Dodson and other federal workers, who have long been the economic backbone of the nation's capital and its suburbs.",
      "publishedAt": "2024-09-02T04:13:00Z",
      "title": "Federal workers around nation's capital worry over Trump's plans to send some of them elsewhere",
      "url": "https://apnews.com/675c08a888cd27d0a75b01134114460a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f84c7840f05240bb9690e6cdd1c9ea3c/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Imagine a customer-service center that speaks your language, no matter what it is.Alorica, a company in Irvine, California, that runs customer-service centers around the world, has introduced an artificial intelligence translation tool that lets its representatives talk with customers who speak 200 different languages and 75 dialects.",
      "publishedAt": "2024-09-02T07:00:25Z",
      "title": "AI may not steal many jobs after all. It may just make workers more efficient",
      "url": "https://apnews.com/e57eb040009d77ddcce1574d1c1915fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd32a5cdea2e4a5e92aa1be43844b22d/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "More than 10,000 workers at 25 U.S. hotels were on strike Monday after choosing Labor Day weekend to amplify their demands for higher pay, fairer workloads and the reversal of COVID-era cuts.",
      "publishedAt": "2024-09-02T15:18:21Z",
      "title": "Labor Day hotel strikes reflect the frustrations of a workforce largely made up of women of color",
      "url": "https://apnews.com/b778b1c7cc5434d0f57cb6c568644570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24fcfdcbb3714ce09bb51193e330b499/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "UZHHOROD, Ukraine (AP) — This week marks the start of the school year in Ukraine, a pivotal time for any student, especially for teenagers in their final year of high school. Ukrainian teens have more than just grades and university choices on their minds — they are grappling with the realities of war.",
      "publishedAt": "2024-09-02T06:09:49Z",
      "title": "Three Ukrainian teens begin their final year of high school holding onto hopes for the future",
      "url": "https://apnews.com/79472c1f2b6926865c18285cb3e20763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7adbc47148d3424ab625e83759dc0322/1920.jpeg"
    },
    {
      "author": "JOHN ROGERS",
      "description": "LOS ANGELES (AP) — Linda Deutsch, a special correspondent for The Associated Press who for nearly 50 years wrote glittering first drafts of history from many of the nation’s most significant criminal and civil trials — Charles Manson, O.J.",
      "publishedAt": "2024-09-02T01:34:59Z",
      "title": "Linda Deutsch, AP trial writer who had a front row seat to courtroom history, dies at 80",
      "url": "https://apnews.com/40b73ccda0b811ed90553c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/affc3541e63d4a5abec7c883f5a89e8d/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}