{
  "articles": [
    {
      "author": "ZEKE MILLER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family.",
      "publishedAt": "2024-12-02T00:37:34Z",
      "title": "Biden pardons his son Hunter despite previous pledges not to",
      "url": "https://apnews.com/24f3007c2d2f467fa48e21bbc7262525",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88ed9c48f94347cdb1371ed1d92349c5/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military said Monday an Israeli American soldier who was believed to have been captured alive by Hamas in its Oct. 7, 2023, attack was killed that day and his body taken into the Gaza Strip.",
      "publishedAt": "2024-12-02T09:48:38Z",
      "title": "Middle East latest: Israel says soldier thought to have been taken hostage is now presumed dead",
      "url": "https://apnews.com/8ae460d7a2796c0bf93a2293d26d0fdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd1cadd72d3044668286f78f7b70d283/2000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Iranian-backed Iraqi militias have deployed in Syria to back the government's counteroffensive against a surprise advance by insurgents who seized the largest city of Aleppo, a militia official and a war monitor said Monday.",
      "publishedAt": "2024-12-02T09:18:53Z",
      "title": "Iraqi militias deploy in Syria to back government's counteroffensive against insurgents",
      "url": "https://apnews.com/12341a6c15a772e207a1b5513c11f8fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4c5f62256a54614a4042f48f529134a/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — German Chancellor Olaf Scholz visited Ukraine for the first time in more than 2 1/2 years Monday, just weeks after he was criticized by Ukrainian President Volodymyr Zelenskyy for having a phone call with Russian President Vladimir Putin.",
      "publishedAt": "2024-12-02T07:16:11Z",
      "title": "German Chancellor Olaf Scholz is in Ukraine for his first visit in 2 1/2 years",
      "url": "https://apnews.com/6b937199e732653dab0e1c4ed400b69c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c60bb92309140edbb65d8ac3916a071/3000.jpeg"
    },
    {
      "author": null,
      "description": "CONAKRY, Guinea (AP) — Fifty-six people were killed and several injured in a stampede at a soccer stadium in southern Guinea, following clashes between fans, Guinea’s government said Monday. Authorities are conducting an investigation to establish those responsible for the stampede on Sunday, Communications Minister Fana Soumah said in a statement read on national television.",
      "publishedAt": "2024-12-02T06:07:18Z",
      "title": "56 people killed in stampede following clashes at a Guinea soccer match, authorities say",
      "url": "https://apnews.com/8663cce728047148546ad4030b1cedf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2def2e3f1d394731b5f79f735f26c6a3/2000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — The president of the International Criminal Court lashed out at the United States and Russia for interfering with its investigations, calling threats and attacks on the court “appalling.”",
      "publishedAt": "2024-12-02T05:09:04Z",
      "title": "Chief of International Criminal Court lashes out at US and Russia over threats and accusations",
      "url": "https://apnews.com/d2b42db2919a4be879bd3df771a4113f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f1cbd23ef614a498edf60924c388460/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — The top United Nations court took up the largest case in its history on Monday, hearing the plight of several small island nations helpless in combating the devastating impact of climate change that they feel endangers their survival.",
      "publishedAt": "2024-12-02T07:54:37Z",
      "title": "Landmark climate change case opens at the top UN court as island nations fear rising seas",
      "url": "https://apnews.com/e954301f0258509f67e66ae2762da6f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7be7af066abc4aa1b948fa38f6ec9062/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and JOEY CAPPELLETTI",
      "description": "NEW YORK (AP) — Nearly a month after a devastating election loss that exposed cracks in the very foundation of their party, Democrats remain deeply divided over the extent of their political problem — or even if they have one.",
      "publishedAt": "2024-12-02T05:02:55Z",
      "title": "Democrats still don't agree on the seriousness of their political problem after election defeat",
      "url": "https://apnews.com/0674765f082ba6116107e1e7cad4e536",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80a1fcdc6da64950811b4ca9b801f768/2103.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "SAINT-MALO, France (AP) — Had he continued working aboard fuel-powered cargo ships, Yann Jourdan reckons he'd be earning perhaps four times what he now gets as captain of a sailboat that instead uses the wind's clean energy to transport goods across the Atlantic.",
      "publishedAt": "2024-12-02T05:24:47Z",
      "title": "Climate solution: Sails make a comeback in shipping, to dent its huge carbon footprint",
      "url": "https://apnews.com/0c191cb3674e157e66f65c8e58e7c0ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5cc0c76b5ea4ce29cacb085e23a5913/1920.jpeg"
    },
    {
      "author": "JOHN WAWROW",
      "description": "ORCHARD PARK, N.Y. (AP) — Josh Allen’s memorable week began with singer and actress Hailey Steinfeld accepting his proposal for marriage and ended with the Buffalo Bills quarterback celebrating his three-TD outing in an AFC East-clinching 35-10 win over San Francisco by making snow angels alongside coach Sean McDermott on Sunday night.",
      "publishedAt": "2024-12-02T04:24:05Z",
      "title": "Josh Allen has TDs passing, rushing and receiving as Bills rout 49ers 35-10 in snow, clinch AFC East",
      "url": "https://apnews.com/e0956d695ead50321efdba586e638c12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24c4a87cb21f49b5a041649d4e24a633/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}