{
  "articles": [
    {
      "author": "Isaac Scharf, Wafaa Shurafa",
      "description": "Israel’s defense minister says that troops will remain in so-called security zones in the Gaza Strip, Lebanon and Syria indefinitely. Israeli forces have taken over large areas of Gaza in recent weeks in a renewed campaign to pressure Hamas to release hostages after Israel ended their ceasefire last month. Israel has also refused to withdraw from some areas in Lebanon following a ceasefire with the Hezbollah militant group last year, and it seized a buffer zone in southern Syria after the overthrow of President Bashar Assad. The Palestinians and both neighboring countries view the presence of Israeli troops as military occupation in violation of international law.",
      "publishedAt": "2025-04-16T07:44:48Z",
      "title": "Israeli defense minister says troops will remain in Gaza, Lebanon and Syria indefinitely",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-16-2025-884713e2096d5353e3008ec7d9cc01ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/5549379/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F64%2F4a087c951d5aa79334830a065534%2Ffdcc0d31ed85499b946861be5a9c58d8"
    },
    {
      "author": "Sam Mednick",
      "description": "Israeli military raids in the occupied West Bank have driven about 40,000 Palestinians from their homes. It's the largest displacement in the territory since the 1967 Mideast war. Some Palestinians found shelter in schools, wedding halls and other venues. But the holy month of Ramadan is over, and pressure is rising to use venues again. Many people have been asked to leave. There are few other options in a territory under Israeli crackdown. Israel says troops will stay in some urban refugee camps for a year. One local man who has been helping the displaced asks, “What will be their fate?”",
      "publishedAt": "2025-04-16T03:38:34Z",
      "title": "Israeli raids displaced tens of thousands in the West Bank. Now few places to shelter remain",
      "url": "https://apnews.com/article/israel-palestinians-west-bank-displaced-military-a61c4a30bb918e9dbd8771ba3482c853",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dbbbd7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F2d%2Fea8a4e99d7a9fafd4d9d08c83af4%2F7904e74c46dc4254a61e41198ceec999"
    },
    {
      "author": "Sylvia Hui",
      "description": "The U.K. Supreme Court is set to decide a case on the definition of a woman in a long-running dispute between a women’s rights group and the Scottish government. Five judges at Britain’s highest court are set to rule Wednesday in a case that seeks to clarify whether a trans person with a gender recognition certificate that recognizes them as female can be regarded as a woman under equality law. While the case centers on Scottish law, the women's campaign group bringing the challenge has said its outcome could apply to the U.K. and have consequences for single-sex services such as toilets and hospital wards.",
      "publishedAt": "2025-04-16T04:18:26Z",
      "title": "UK Supreme Court is set to rule on a landmark legal challenge over the legal definition of a woman",
      "url": "https://apnews.com/article/uk-supreme-court-decision-definition-woman-scotland-1a61bea0c26c13cf34864f696a1a5f0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/98781b3/2147483647/strip/true/crop/4969x2795+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F25%2F4a62a86374cb69e2bd375870ab72%2F8c49aee62be64c00b7adf328b8ebc0f5"
    },
    {
      "author": "Alexa St. John",
      "description": "President Donald Trump is considering a delay of auto tariffs. A temporary pause won’t be enough for automakers to adjust their vast global supply chains but exemptions on parts could be key to the industry. It may also give car buyers a little more time to decide before vehicle prices are expected to rise significantly.",
      "publishedAt": "2025-04-15T17:21:59Z",
      "title": "As Trump considers auto tariffs pause, parts exemptions could be key for US industry",
      "url": "https://apnews.com/article/trump-tariffs-automakers-supply-chain-cost-car-buying-1e92a9dc09294234459fcf4acea3e788",
      "urlToImage": "https://dims.apnews.com/dims4/default/3cf39ce/2147483647/strip/true/crop/7070x3977+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F6b%2F9febabe54d3e70b2877dfd3843b5%2F4b1e1b79c4184b1abc6824fd26e36d61"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "China has reported that its economy expanded at a 5.4% annual pace in January-March, supported by strong exports ahead of U.S. President Donald Trump’s rapid increases in tariffs on Chinese exports. Analysts are forecasting that the world’s second largest economy will slow significantly in coming months, however, as tariffs as high as 145% on U.S. imports from China take effect. Exports were a strong factor in China’s ability to attain a 5% annual growth rate in 2024 and the official target for this year remains at about 5%. Beijing has hit back at the U.S. with 125% tariffs on American exports, while also stressing its determination to keep its own markets open to trade and investment.",
      "publishedAt": "2025-04-16T02:11:30Z",
      "title": "China's economy grows at a 5.4% annual pace in Jan-March quarter",
      "url": "https://apnews.com/article/china-economy-tariffs-trump-beijing-45a04578c3d637465b9043600fc54ca2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4fd6a6e/2147483647/strip/true/crop/8238x4634+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F19%2F04d864f3bffb7da534f08ece0ab7%2Fb53eedf69690410a967799f0c1d4f16f"
    },
    {
      "author": "Michael Kunzelman, Ben Finley",
      "description": "A federal judge in Maryland is expected to question the Trump administration about its continued refusal to retrieve a mistakenly deported Maryland man from an El Salvador prison. A hearing is scheduled for late Tuesday afternoon in a U.S. District Court. It comes a day after White House advisers repeated their claim that they lack the authority to return the Salvadoran national from his native country. The president of El Salvador also said Monday that he would not return Abrego Garcia, likening it to smuggling “a terrorist into the United States.” The U.S. Supreme Court ordered the Trump administration last week to facilitate Abrego Garcia's return to the U.S.",
      "publishedAt": "2025-04-15T18:36:55Z",
      "title": "US judge to question Trump officials' refusal to return Kilmar Abrego Garcia",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-el-salvador-trump-deported-e537cfb69a9840046b5d3e512509e9a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb12ce6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fa1%2F726df7e1f7a6a35686bad4c19b16%2Fb884be15d57e413ea3e2515fab8a2613"
    },
    {
      "author": "Collin Binkley",
      "description": "On one side is Harvard, the nation’s oldest and wealthiest university, with a brand so powerful that its name is synonymous with prestige. On the other side is the Trump administration, determined to go farther than any other White House to reshape American higher education. Both sides are digging in for a clash that could test the limits of the government’s power and the independence that has made U.S. universities a destination for scholars around the world. On Monday, Harvard become the first university to openly defy the Trump administration as it demands sweeping changes to limit activism on campus.",
      "publishedAt": "2025-04-15T17:01:09Z",
      "title": "Harvard's challenge to Trump administration could test limits of government power",
      "url": "https://apnews.com/article/harvard-trump-administration-federal-cuts-037c3f5b259a7577358c5979e701c7c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5c3cf7/2147483647/strip/true/crop/2540x1429+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F5f%2F1d1fe8f795e8a21c613d398676b4%2Fb57cca02200840dbb798e899ecb2eb63"
    },
    {
      "author": "Amanda Seitz",
      "description": "Health secretary Robert F. Kennedy Jr.’s efforts to contain measles outbreaks around the country have drawn criticism from a number of health officials who say he has delivered a mixed message about the effectiveness of the measles vaccine. Kennedy also has not been regularly briefed on the outbreak by his own infectious disease experts at the Centers for Disease Control and Prevention. That's according to two former federal health officials who would have organized such briefings for the health secretary. In another irregularity, the nation's leading pediatric organization has not been involved in the response.",
      "publishedAt": "2025-04-16T04:02:32Z",
      "title": "RFK Jr.'s mixed message about the measles outbreaks draws criticism from health officials",
      "url": "https://apnews.com/article/measles-outbreak-rfk-jr-messaging-criticism-vaccine-1a2cbdc14eb0c256695fdfac00cbfb6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a5dc1ea/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fec%2F0a6f6fb699de1bb8031bcffaa700%2F1519e31553024f5db5bd59b0f912ad4e"
    },
    {
      "author": "Sean Murphy",
      "description": "Thirty years after a truck bomb detonated outside a federal building in the nation’s heartland, deep scars still remain from the deadliest homegrown attack on U.S. soil. Three decades have not healed all the wounds from the Oklahoma City bombing on April 19, 1995. A mother still grieves the loss of her first-born baby daughter. A son whose father was killed in the attack never got to know his dad. One of the youngest survivors who was injured in the attack still struggles to breathe. Several survivors tell The Associated Press they fear the current political climate could spawn another deadly attack.",
      "publishedAt": "2025-04-16T04:06:42Z",
      "title": "The Oklahoma City bombing was 30 years ago. Some survivors worry America didn’t learn the lesson",
      "url": "https://apnews.com/article/oklahoma-city-bombing-30th-anniversary-survivors-ad18c59a2d3194d9c8f0e2103a30e4c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2a85c9/2147483647/strip/true/crop/5847x3289+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F82%2Ff56540a1724cc16f1932eaa7030c%2F0af759159d3a4cebb8ed6264e847f8b8"
    },
    {
      "author": "Amanda Swinhart, Patrick Whittle",
      "description": "Making maple syrup in New England’s fickle spring weather can be an unpredictable business. Now President Donald Trump’s ever-changing tariff policies are adding anxiety about an industry that depends on cross-border trade. U.S. syrup producers generally buy their equipment from Canada and can get their packaging and equipment from China or Europe. Canadian producers sell nearly two-thirds of their finished products to U.S. consumers. All are affected by the steep new taxes announced by the White House.",
      "publishedAt": "2025-04-16T04:05:22Z",
      "title": "Vermont maple syrup makers face uncertainty amid Canada and China tariff chaos",
      "url": "https://apnews.com/article/trump-maple-syrup-tariffs-vermont-canada-9d9f1af448e8abf59f8ac591ee298746",
      "urlToImage": "https://dims.apnews.com/dims4/default/0490fc2/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fdf%2F21eed0920894b9cdb7e806118598%2F4a6c58df4ca24c18aea9089c5462d6cf"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}