{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea’s Kim Jong Un rolled into Russia on an armored train Tuesday to see President Vladimir Putin, a rare meeting between isolated leaders driven together by their need for support in escalating standoffs with the West.",
      "publishedAt": "2023-09-12T03:16:41Z",
      "title": "North Korea's leader is in Russia to meet Putin, with both locked in standoffs with the West",
      "url": "https://apnews.com/07221c9ba59e042372d9a50e756c2d79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/078e570e911049ea877b04109889b7eb/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Emergency workers uncovered hundreds of bodies as they dug through the wreckage of Libya’s eastern city of Derna on Tuesday, and 10,000 people were reported still missing after floodwaters broke through dams and smashed through the city, washing away entire neighborhoods.",
      "publishedAt": "2023-09-12T07:33:18Z",
      "title": "Thousands feared dead as Libyans search for bodies in a city devastated by floods",
      "url": "https://apnews.com/95379b164871d97fb74b1cd1bcb5640c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7fa216a73cb4adcb7facbab621f5521/1920.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "An earthquake has sown destruction and devastation in Morocco, where death and injury counts continue to rise after rescue crews dug out people both alive and dead in villages that were reduced to rubble through Monday.",
      "publishedAt": "2023-09-11T04:05:47Z",
      "title": "What to know about the Morocco earthquake and the efforts to help",
      "url": "https://apnews.com/fe5a0fbe71646f9b1b4f6a85889b414a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a0bca06e60a429ca66cbd5f3648950b/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Lawyers for Donald Trump on Monday asked the federal judge presiding over his election subversion case in Washington to recuse herself, saying her past public statements about the former president and his connection to the Jan.",
      "publishedAt": "2023-09-11T20:55:37Z",
      "title": "Trump lawyers seek recusal of judge in DC presiding over federal election subversion case",
      "url": "https://apnews.com/3e5039d9d9bb5f47282ba517de5f0e7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c51e7c90b188486a8e39d3cc4203d5b3/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and MICHAEL LIEDTKE",
      "description": "WASHINGTON (AP) — Google will confront a threat to its dominant search engine beginning Tuesday when federal regulators launch an attempt to dismantle its internet empire in the biggest U.S. antitrust trial in a quarter century.",
      "publishedAt": "2023-09-12T04:04:04Z",
      "title": "It's Google versus the US in the biggest antitrust trial in decades",
      "url": "https://apnews.com/687b9a5b90ec18f207d36df3ba11aebd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77c834d682e946c987572cb253f4c34c/3000.jpeg"
    },
    {
      "author": "MARC LEVY and CLAUDIA LAUER",
      "description": "Authorities warned that an escaped murderer who has evaded capture in southeastern Pennsylvania for nearly two weeks was armed and urged residents Tuesday in the area where he was being pursued to lock up, secure vehicles and remain indoors.",
      "publishedAt": "2023-09-12T11:09:39Z",
      "title": "Escaped Pennsylvania murderer Danelo Cavalcante is armed, residents should stay inside, police say",
      "url": "https://apnews.com/b59e73762beca9ec9852be97afca39e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1eaff6154a34674b4b989613a228890/1920.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE and COREY WILLIAMS",
      "description": "CHICAGO (AP) — It took four and a half months for Shannon Ross’ life to unravel.Ross, who describes himself as Indigenous and a person of color, was arrested in Chicago in October 2019 on weapons charges and ultimately found not guilty.",
      "publishedAt": "2023-09-12T04:10:31Z",
      "title": "Cash bail disproportionately impacts communities of color. Illinois is the first state to abolish it",
      "url": "https://apnews.com/b8aac667b7d3016e12ea64a70964bf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00bb869152984e6291b73a8afe103bcb/3000.jpeg"
    },
    {
      "author": "ROBERT BADENDIECK and SUZAN FRASER",
      "description": "ISTANBUL (AP) — An American researcher was “doing well” at a Turkish hospital, officials said Tuesday, after rescuers pulled him out of a cave where he fell seriously ill and became trapped 1,000 meters (more than 3,000 feet) below its entrance for over a week.",
      "publishedAt": "2023-09-12T11:10:10Z",
      "title": "American researcher doing well after rescue from a deep Turkish cave, calling it a 'crazy adventure'",
      "url": "https://apnews.com/2c9598907421554d5894f24a97349ecf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/146c806eeb8b433faf2a095771d9ec42/1280.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — During her husband’s 1992 presidential campaign, Hillary Clinton observed that “our lives are a mixture of different roles” and said most people are trying to find the right balance.",
      "publishedAt": "2023-09-12T04:05:48Z",
      "title": "Hillary Clinton is stepping over the White House threshold in yet another role",
      "url": "https://apnews.com/3648880e2ee103817073ece8e1c082a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d666b25362ab44cfa5bf672e1830cb05/3000.jpeg"
    },
    {
      "author": "IVÁN VALENCIA",
      "description": "BAHIA SOLANO, Colombia (AP) — Every summer, thousands of tourists descend on the Colombian town of Bahia Solano to experience the thrill of watching humpback whales as they migrate from the frigid waters of the southern Pacific to Colombia’s warm waters.",
      "publishedAt": "2023-09-12T04:20:37Z",
      "title": "AP PHOTOS: Humpback whales draw thousands of visitors to a small port on Colombia’s Pacific coast",
      "url": "https://apnews.com/6f039415dea74e7c41e5cd7f160f390c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/808557a29f1a4f70bfcbf267042768f0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}