{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and DAVID RISING",
      "description": "RAFAH, Gaza Strip (AP) — Israel’s military hit the family home of the exiled leader of Hamas on the outskirts of Gaza City with an airstrike Saturday and pressed ahead with attacks across in the besieged enclave where a humanitarian crisis is rapidly worsening.",
      "publishedAt": "2023-11-04T07:48:05Z",
      "title": "Hamas leader's home is hit in airstrike as Israel presses its attacks and U.S. envoy seeks aid route",
      "url": "https://apnews.com/baf5a858e29aa6a4b8100e3afc5afdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa03223f28a84e799f993f3f507ad240/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The average Palestinian in Gaza is living on two pieces of Arabic bread made from flour the United Nations had stockpiled in the region, yet the main refrain now being heard in the street is “Water, water,” the Gaza director for the U.N.",
      "publishedAt": "2023-11-04T00:32:06Z",
      "title": "The average Palestinian in Gaza is living on 2 pieces of bread a day, UN official says",
      "url": "https://apnews.com/90fcfc40d63f8604d0effa861e793c89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72cbd61d19d64f9e9982a89c6d9dde12/3000.jpeg"
    },
    {
      "author": "JIM SALTER and MARC LEVY",
      "description": "ST. LOUIS (AP) — Most members of Congress have stood firmly behind Israel since the Hamas attack last month, but not Cori Bush.",
      "publishedAt": "2023-11-04T04:03:03Z",
      "title": "War in the Middle East upends the dynamics of 2024 House Democratic primaries",
      "url": "https://apnews.com/1b8616887e31f86a930ebc2e767c9a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4393fba31cc4108bc2d91dbfcfb5962/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and BILL BARROW",
      "description": "KISSIMMEE, Fla. (AP) — Former President Donald Trump is expanding his support in Florida as he seeks to bury the presidential ambitions of Gov.",
      "publishedAt": "2023-11-04T04:07:22Z",
      "title": "The Trump-DeSantis rivalry grows more personal and crude as the GOP candidates head to Florida",
      "url": "https://apnews.com/4e290803224da2c9ebef65f41b409542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/727e3740841140c38520a36ee17ee6f4/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Helicopters and ground troops rushed to help people hurt in a strong earthquake that shook districts in northwestern Nepal just before midnight Friday, killing at least 128 people and injuring dozens more, officials said Saturday.",
      "publishedAt": "2023-11-03T19:01:17Z",
      "title": "Quake shakes northwest Nepal, killing at least 128 and injuring dozens. Officials fear toll to rise",
      "url": "https://apnews.com/47b0b262ed1aa26957285dd1a55699fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0738ef681b40f2bfa95932068dd1b2/2884.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "CHICAGO (AP) — Sophee Langerman was on her way to a bicycle safety rally in Chicago’s Lakeview neighborhood in June when a car turning right rolled through a red light and slammed into her bike, which she was walking off the curb and into the crosswalk.",
      "publishedAt": "2023-11-04T04:21:31Z",
      "title": "Right turn on red? With pedestrian deaths rising, US cities are considering bans",
      "url": "https://apnews.com/7f5bdee9c7b3f4cbf005f1844f486123",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8d62c43a790480490e46abbd196bcd8/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Sheryl Crow and Olivia Rodrigo kicked off the 2023 Rock &amp; Roll Hall of Fame induction ceremony Friday night and Missy Elliott closed the show more than four hours later with a roof-shaking set, as the hall celebrated a strong representation of women and Black artists.",
      "publishedAt": "2023-11-03T04:01:35Z",
      "title": "Sheryl Crow, Missy Elliott and Chaka Khan make the crowd go wild at Rock & Roll Hall of Fame",
      "url": "https://apnews.com/f8c111337f7c2f6e2477a015369462f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c97f19156cd45158408ba4e7ca2b893/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "AMMAN, Jordan (AP) — U.S. Secretary of State Antony Blinken stepped up his frantic diplomacy on Saturday, trying to build support for planning a post-conflict future for Gaza as he continued his second urgent mission to the Middle East since the Israel-Hamas conflict began.",
      "publishedAt": "2023-11-04T08:32:09Z",
      "title": "Blinken tries to cajole wary Arabs on support for post-conflict Gaza as Israel's war intensifies",
      "url": "https://apnews.com/9d9ada872b84699424f17f13df1c3560",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1ecbcda22df4fc9ae6d19fe8c628247/2091.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — The Army reservist who opened fire inside at a bowling alley and a bar in Lewiston, Maine, before disappearing was alive and possibly on the run during a good portion of the massive search that followed, according to a conclusion from the state medical examiner’s office released Friday.",
      "publishedAt": "2023-11-03T22:18:48Z",
      "title": "Maine mass shooter was alive for most of massive 2-day search, autopsy suggests",
      "url": "https://apnews.com/822ee952fdb9e25022c761f437523593",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd50fda949194cdda1c8be877773f459/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "NEWPORT NEWS, Va. (AP) — A teacher who was shot by her 6-year-old student in Virginia can press forward with her $40 million lawsuit against a school system over claims of negligence by school administrators, a judge ruled Friday.",
      "publishedAt": "2023-11-03T18:22:24Z",
      "title": "Virginia teacher shot by 6-year-old can proceed with $40 million lawsuit, judge rules",
      "url": "https://apnews.com/48d4ea18da54ccfeb3e082902020bf6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73fd4ba57f7a4641be9e98360c827f3b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}