{
  "articles": [
    {
      "author": "MARK KENNEDY",
      "description": "Lily Bloom and Ryle Kincaid don't really meet-cute. On a rooftop in Boston, he announces himself by angrily kicking a patio chair. She's up there trying to come to terms with her abusive father's death.",
      "publishedAt": "2024-08-07T14:59:48Z",
      "title": "Movie Review: 'It Ends With Us' with Blake Lively tackles big issues but slips into soap opera",
      "url": "https://apnews.com/035aa1becea86aa90a5f1aa982cf823c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c9f04572fb44a92b692729933fae61c/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "PARIS (AP) — Stephen Curry was thinking about this two years ago, after winning his fourth NBA title with the Golden State Warriors. The only thing left for him to win was Olympic gold.And in the ultimate moment, he made sure that medal would be his.",
      "publishedAt": "2024-08-10T21:20:34Z",
      "title": "Golden Steph: Curry's late barrage seals another Olympic men's basketball title, as US beats France",
      "url": "https://apnews.com/11c95e9b6dfdb25f77c122cd1abe58e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05c00480b2664ad0ad3b8576806c7974/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit a school-turned-shelter in Gaza early Saturday, killing at least 80 people and wounding nearly 50 others, Palestinian health authorities said, in one of the deadliest attacks of the 10-month Israel-Hamas war.",
      "publishedAt": "2024-08-10T04:26:06Z",
      "title": "Israeli airstrike on a Gaza school used as a shelter kills at least 80, Palestinian officials say",
      "url": "https://apnews.com/f33867d7596ebb70c1cb3a77fd4437cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34a7e5fd5ad141efb3db32d90cc35e1e/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — As shots rang out in the hallways and classrooms of Robb Elementary School in Uvalde, Texas, one of the terrified teachers who frantically dialed 911 described “a lot, a whole lot of gunshots,\" while another sobbed into the phone as a dispatcher urged her to stay quiet.",
      "publishedAt": "2024-08-10T17:08:06Z",
      "title": "Teacher pleads, 'Hurry, hurry, hurry, hurry!' in 911 call from Uvalde school shooting",
      "url": "https://apnews.com/2eaabf46b09866b037b3a9dee81b9cd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f501da363fc94a4e97ac935002f27f2b/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — “Mass Deportation Now!” declared the signs at the Republican National Convention, giving a full embrace to Donald Trump’s pledge to expel millions of migrants in the largest deportation program in American history.",
      "publishedAt": "2024-08-10T04:21:20Z",
      "title": "Trump is putting mass deportations at the heart of his campaign. Some Republicans are worried",
      "url": "https://apnews.com/ec64f85e3633c9c7a8a247eaf9feb64f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d63a0b64565045788fa6986ffe892af2/3000.jpeg"
    },
    {
      "author": "RIO YAMAT, DARLENE SUPERVILLE and JOSH BOAK",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris is working to make Nevada look like less of a political gamble in November's election.The Democratic presidential nominee was visiting the state on Saturday with her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-10T04:01:25Z",
      "title": "In Las Vegas, Kamala Harris sees a chance to improve her odds of winning",
      "url": "https://apnews.com/ac21118dbb24290e46d32ad9669507d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80dbae3ff3ba435bbedfedaac84731c5/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — The International Gymnastics Federation restored Romanian gymnast Ana Barbosu to third in the Paris Olympicswomen's floor exercise final Saturday, potentially forcing American gymnast Jordan Chiles to return the bronze she won in the event.",
      "publishedAt": "2024-08-10T17:46:44Z",
      "title": "Romanian gymnast could replace Jordan Chiles as bronze medalist in floor exercise after court ruling",
      "url": "https://apnews.com/4004ae4869ac2eafbb89b68ee5966110",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42d5befe59244faa9d748ac8c93e015b/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE, GABRIELA SÁ PESSOA and DAVID KOENIG",
      "description": "VINHEDO, Brazil (AP) — Brazilian rescue teams Saturday retrieved the remains of all 62 passengers from the wreckage of a plane crash in Sao Paulo state as families started gathering in the metropolis to identify and bury their loved ones.",
      "publishedAt": "2024-08-10T04:08:29Z",
      "title": "Rescuers retrieve remains of all 62 passengers in Brazil plane crash. Families gather in Sao Paulo",
      "url": "https://apnews.com/5c5a3371b5e899b745c1cb6e46950230",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d24eca695024162ab879ada62b7d1b2/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, ERIC TUCKER and LARRY NEUMEISTER",
      "description": "WASHINGTON (AP) — A Defense Department disagreement over how to bring to justice the accused mastermind of the Sept.",
      "publishedAt": "2024-08-10T12:35:35Z",
      "title": "'Original sin': Torture of 9/11 suspects means even without plea deal, they may never face a verdict",
      "url": "https://apnews.com/5742ea797014d3fd48cfaae4c9f180f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a63f396cbac043e6b57d8cfcd33e45c6/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and MICHAEL R. SISAK",
      "description": "WASHINGTON (AP) — A worker at a federal prison in California has died and investigators are examining whether he was exposed to fentanyl shortly before his death, three people familiar with the matter told The Associated Press.",
      "publishedAt": "2024-08-10T13:14:54Z",
      "title": "Worker's death at California federal prison investigated for possible fentanyl exposure, AP learns",
      "url": "https://apnews.com/c524f7db5c03c2298af5e488470ba639",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/904804b08f464ba8b3677177e68a3011/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}