{
  "articles": [
    {
      "author": null,
      "description": "Iran’s Supreme Leader Ali Khamenei claimed victory over Israel on Thursday in his first public statement since a ceasefire was declared in the war between the two countries. Khamenei hasn't been seen in public since taking shelter in a secret location after the outbreak of the war June 13 when Israel attacked Iranian nuclear facilities and targeted top military commanders and scientists. In his first comment posted on X he offered his “congratulations on the victory” over Israel.",
      "publishedAt": "2025-06-26T10:25:35Z",
      "title": "Iran’s Supreme Leader makes first public statement since ceasefire declared in Israel-Iran war",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-26-2025-d09bf2282deea3b2edd63f29c867c058",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The Pentagon’s top leaders have doubled down on how destructive the U.S. attacks had been on Iran's nuclear facilities. And they described in detail the study and planning behind the bombing mission. In a rare Pentagon press briefing, Defense Secretary Pete Hegseth and Joint Chiefs Chairman Gen. Dan Caine tried to shift the debate from whether the nuclear targets were “obliterated,” as President Donald Trump has said, and focus on what they portrayed as the heroism and extensive research and preparation that went into carrying them out. Hegseth said once more than an early assessment from the Defense Intelligence Agency was preliminary.",
      "publishedAt": "2025-06-26T13:42:25Z",
      "title": "Pentagon leaders double down on the destruction from US attacks on Iran",
      "url": "https://apnews.com/article/iran-us-strikes-nuclear-trump-hegseth-caine-78499bef6b34ebb970b5c9d074021044",
      "urlToImage": "https://dims.apnews.com/dims4/default/50a935e/2147483647/strip/true/crop/5392x3033+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F46%2F00365cd36e09a2fb508515d94599%2F14aa82b4d8ba42059876572c00990f26"
    },
    {
      "author": null,
      "description": "Palestinian hospital officials say an Israeli airstrike has hit a street in central Gaza, killing 18 people. Witnesses say the strike targeted a crowd receiving flour from a Palestinian police unit that had confiscated goods from looters. The unit, part of Gaza’s Hamas-led Interior Ministry, was distributing aid when the attack occurred. Israel has accused Hamas of stealing aid, while Gaza faces ongoing turmoil over food distribution. Armed gangs and desperate crowds have disrupted aid efforts, with tribes now stepping in to guard convoys. Meanwhile, limited aid continues to trickle into Gaza, where millions struggle with hunger and violence.",
      "publishedAt": "2025-06-26T17:33:02Z",
      "title": "An Israeli strike kills 18 Palestinians in central Gaza",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-06-26-2025-a5c3052d1d983329b5d9a2f3986811fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/97f34b3/2147483647/strip/true/crop/4153x2336+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F6e%2F12eeb021a3b9c5e3671d91bcacc0%2F5f665d568f604170aedf4073298a92ff"
    },
    {
      "author": null,
      "description": "A divided Supreme Court is allowing states to cut off Medicaid money for Planned Parenthood amid a wider Republican-backed push to defund the organization, the country’s largest abortion provider. The 6-3 ruling was handed down Thursday. The case centers on funding for other health care services Planned Parenthood provides in South Carolina, but the ruling could have broader implications for Medicaid patients. South Carolina argued no public money should go to the high-profile abortion provider, even if it it’s not paying for abortions. Planned Parenthood says patients go there for things like contraception and cancer screenings, in part because it can be hard to find a doctor who takes the publicly funded insurance.",
      "publishedAt": "2025-06-26T14:13:24Z",
      "title": "States can cut off Planned Parenthood’s Medicaid funds, Supreme Court says",
      "url": "https://apnews.com/article/supreme-court-planned-parenthood-abortion-medicaid-e056395b9e5646d13539e76605027a1f",
      "urlToImage": "https://dims.apnews.com/dims4/default/3eaecb4/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F3d%2Fa87643172a66494032c3db3143ef%2Fd8836e1bde35443d8bb9d885c64ca509"
    },
    {
      "author": null,
      "description": "The Senate parliamentarian has advised a key Medicaid provider tax overhaul that's central to President Donald Trump's big tax cut and spending bill does not adhere to procedural rules. It’s a blow to Republicans rushing to finish the package this week. The guidance from the parliamentarian is rarely ignored and forces GOP leaders to consider options. Republicans could try to revise it or strip it from the package. Otherwise, the provision could be challenged during floor votes. Democrats are unified against the Republican president's bill. And even GOP senators warn the tax change would hurt rural hospitals. Some Republicans call for challenging or even firing the parliamentarian, the nonpartisan chief arbiter of Senate rules.",
      "publishedAt": "2025-06-26T14:01:08Z",
      "title": "Key Medicaid provision in Trump's big bill found to violate Senate rules",
      "url": "https://apnews.com/article/trump-big-bill-hospital-provider-tax-f6f4343bbc9c9a279bd7861c2e5c1b7b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7c53cb5/2147483647/strip/true/crop/3362x1891+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4c%2F48804194d30d7134b1dcd5299dfc%2Fa260d48997914330b21a8b8ada8704b7"
    },
    {
      "author": null,
      "description": "U.S. Health Secretary Robert F. Kennedy Jr.’s new vaccine advisory committee endorsed fall flu vaccination Thursday for just about every American but with a twist: The group says people should only be given shots free of an ingredient antivaccine groups have falsely tied to autism. The seven-member panel, which includes vaccine skeptics, replaced the previous 17-member group earlier this month. Public health officials are worried that ideological decisions could make vaccines less accessible and more expensive for millions of Americans.",
      "publishedAt": "2025-06-26T12:09:29Z",
      "title": "Kennedy's vaccine committee endorses preservative-free fall flu shots",
      "url": "https://apnews.com/article/cdc-acip-flu-vaccine-thimerosal-c5696bbc19f345323153d5336cb5e798",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa7b2da/2147483647/strip/true/crop/3457x1945+0+222/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fe1%2F215bacb3e7fb12c818be95502ed3%2F32534925e3624f47b1183a55cba1571c"
    },
    {
      "author": null,
      "description": "President Donald Trump’s call for Prime Minister Benjamin Netanyahu’s corruption trial to be thrown out has plunged the American leader into one of Israel’s most heated debates, unnerving many in its political class just days after they unanimously praised his strikes on Iran. Trump’s social media post condemning the trial as a witch hunt and his vow that the United States will save Netanyahu from serious corruption charges, came just two days after he called off an Israeli bombing raid in Iran. Both were dramatic interventions in the affairs of ally that previous U.S. administrations had insisted was a sovereign nation that made its own decisions.",
      "publishedAt": "2025-06-26T16:34:52Z",
      "title": "Trump's call to cancel Netanyahu's trial stirs controversy in Israel",
      "url": "https://apnews.com/article/israel-us-trump-netanyahu-trial-iran-e7cedec1c1a48101f83dc3fff0c2ac28",
      "urlToImage": "https://dims.apnews.com/dims4/default/35ee6e9/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2Ff7%2F6791cc2cdb86e459516080a5f0ca%2Fcda64e19c4a046ba9dbb2e47eea1bc47"
    },
    {
      "author": null,
      "description": "A prosecutor has begun two days of closing arguments at Sean “Diddy” Combs' sex trafficking trial by telling a jury that the music mogul used “power, violence and fear” to rule a criminal enterprise for two decades. The closing on Thursday was delivered by Assistant U.S. Attorney Christy Slavik in Manhattan federal court. The defense will get its turn Friday. Afterward, another prosecutor will deliver a rebuttal closing argument before Judge Arun Subramanian instructs the jury on the law so it can begin deliberations. Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges. The trial is in its seventh week.",
      "publishedAt": "2025-06-26T14:39:59Z",
      "title": "Prosecutor casts Sean 'Diddy' Combs as a criminal who abused others through power, violence and fear",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-831c43678c42e4c84e13e42e9cd210ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "World shares are mixed and the U.S. dollar has weakened as investors catch their breath following recent bouts of volatility. Traders were turning to U.S. updates on durable goods orders, jobs and consumer spending and what they suggest about how President Donald Trump's higher tariffs are affecting the economy. On Wednesday, the S&P 500 barely budged, staying just 0.8% below its all-time high. The Dow Jones Industrial Average dipped 0.2%, and the Nasdaq composite rose 0.3%. Oil prices have stabilized after plunging by roughly $10 per barrel as worries about potential disruptions to supplies faded with the implementation of a ceasefire in the Israel-Iran war.",
      "publishedAt": "2025-06-26T04:47:38Z",
      "title": "World shares are mixed and dollar weakens",
      "url": "https://apnews.com/article/stocks-markets-trump-tariffs-powell-inflation-caaca074740d9f61a494f426bdc41de0",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ecc326/2147483647/strip/true/crop/1599x899+0+83/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fc9%2F558df6bb3ff7655970a8b486d3fc%2F753f2bf337724e89bfefb4fb067f530f"
    },
    {
      "author": null,
      "description": "Bruce Springsteen isn't the only musician to complete or launch anticipated album projects, then to see it never see the light of day. Springsteen is releasing the “Tracks II: The Lost Albums” box set with reams of so-called lost music on Friday. There are many reasons for albums to be abandoned. Those include perfectionist or easily distracted artists, nervous record executives, and sometimes material that is literally lost. Dr. Dre, the Beach Boys, Prince, Green Day, Neil Young and others all had their stories. But as Springsteen notes in explaining while one of discs was dropped: “I always put them away, but I don't throw them away.”",
      "publishedAt": "2025-06-26T15:51:55Z",
      "title": "A look at 'lost albums' from artists through the decades",
      "url": "https://apnews.com/article/lost-albums-music-bruce-springsteen-27529fc84fcfddbb2f3c392984c06ef2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4bc6e79/2147483647/strip/true/crop/3010x1693+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F89%2F62732b5318d3e4ff9e2259107d41%2Fd8a5e2a45906440fa0f8e1ea5d67767c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}