{
  "articles": [
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Sunday the daring military incursion into Russia’s Kursk region aims to create a buffer zone to prevent further attacks by Moscow across the border.",
      "publishedAt": "2024-08-18T11:12:29Z",
      "title": "Ukrainian president says push into Russia's Kursk region is to create a buffer zone there",
      "url": "https://apnews.com/43d6579c82c24ffc5cfabd99d07c66db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4d13c2989e94edaa43256e2e53ee78f/2000.jpeg"
    },
    {
      "author": "ROBERT YOON",
      "description": "WASHINGTON (AP) — Once more, with feeling!It’s been nearly two weeks since Vice President Kamala Harris officially won the Democratic presidential nomination in an online vote, the first time a nominee was named prior to a party's convention.",
      "publishedAt": "2024-08-18T17:29:54Z",
      "title": "Convention delegates will nominate Harris, again. This time, there's less suspense and more pizzazz",
      "url": "https://apnews.com/ae2fc83930d90d43863588264c465cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84e23ef25fee4bc8bfa44710aa11814a/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — U.S. Secretary of State Antony Blinken will use his ninth diplomatic mission to the Middle East since the start of the Israel-Hamas war to press for the quick conclusion of an elusive cease-fire agreement.",
      "publishedAt": "2024-08-18T16:26:16Z",
      "title": "Blinken, on ninth Mideast trip since Gaza war began, seeks cease-fire momentum as talks to resume",
      "url": "https://apnews.com/a022fea284a40272e65f3ba7752eb9fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b123bca03adc4a24af1423d13f877f24/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 29 people including young quintuplets overnight and into Sunday, health officials said, as U.S. Secretary of State Antony Blinken arrived in Israel to try to seal a cease-fire deal that could help ease soaring regional tensions.",
      "publishedAt": "2024-08-18T06:33:39Z",
      "title": "Quintuplets among Gaza's dead as Blinken visits the region to seek a cease-fire deal",
      "url": "https://apnews.com/4059985bff76d459360f17e8319633c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd0ee69d270e4db981978d2c3a45c386/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and MICHELLE L. PRICE",
      "description": "ROCHESTER, Pa. (AP) — Democratic presidential nominee Kamala Harris and running mate Tim Walz gave pep talks to campaign volunteers and a high school football team Sunday, with their bus tour in a corner of Pennsylvania serving as a modest, small-town version of the grand rally she's expected to have at the Democratic nominating convention in Chicago this week.",
      "publishedAt": "2024-08-18T11:22:53Z",
      "title": "Harris and Walz make small-town stops and campaign phone calls on Pennsylvania bus tour before DNC",
      "url": "https://apnews.com/2fa74e23e4cd21218f61f6c6595a577c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30e750c979a44f6fbc5828b5d1901bbe/1920.jpeg"
    },
    {
      "author": "RON TODT",
      "description": "Tropical Storm Ernesto became a hurricane again Sunday as it churned away from Bermuda and headed further out in the northeastern Atlantic, sending powerful swells toward the U.S.",
      "publishedAt": "2024-08-18T15:52:14Z",
      "title": "Ernesto strengthens back into a hurricane, sends powerful swells, rip currents to US East Coast",
      "url": "https://apnews.com/a9260c6c35d380854c22635ac12ec8bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0422e159f6a84ad3a20c97030b8460b8/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Sudan has been stricken by a cholera outbreak that has killed nearly two dozen people and sickened hundreds more in recent weeks, health authorities said Sunday. The African nation has been roiled by a 16-month conflict and devastating floods.",
      "publishedAt": "2024-08-18T16:58:36Z",
      "title": "Cholera outbreak in Sudan has killed at least 22 people, health minister says",
      "url": "https://apnews.com/046f27a435816dd0838eade09dbec4ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd71e20f0c7645c0bb75ff6d64a4df3f/2500.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "ATLANTA (AP) — Every Monday evening, the Andrew and Walter Young Family YMCA basement becomes a sanctuary for men who, local leaders say, have too often been denied one.The Black Man Lab, which for nearly a decade has sought weekly to create a “safe, sacred and healing space” for Black men in metropolitan Atlanta, regularly gathers more than 100 men to pray, meditate and talk through challenges and triumphs they are facing and learn from peers and elders.",
      "publishedAt": "2024-08-18T14:35:06Z",
      "title": "Black men emerge as key constituency in 2024 race, bringing dynamic views to the top of politics",
      "url": "https://apnews.com/b719055efc229dccc8d84466d9ed6e90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6c8576b374f4193988dc392e09e68c2/3000.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "HOLEY LAND WILDLIFE MANAGEMENT AREA, Fla. (AP) — It's after midnight when the windshield fogs up on Thomas Aycock's F-250 pickup truck. He flashes a low smile as he slowly maneuvers through the sawgrass, down dirt roads deep in the Florida Everglades.",
      "publishedAt": "2024-08-18T04:29:23Z",
      "title": "A hunter’s graveyard shift: grabbing pythons in the Everglades",
      "url": "https://apnews.com/6838af6afed7eedf875a06482c362156",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/295bade288b1476c9050be64f229e736/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — For hours, motion capture sensors tacked onto Noshir Dalal’s body tracked his movements as he unleashed aerial strikes, overhead blows and single-handed attacks that would later show up in a video game.",
      "publishedAt": "2024-08-18T11:00:32Z",
      "title": "Can AI truly replicate the screams of a man on fire? Video game performers want their work protected",
      "url": "https://apnews.com/bd4e8a0d9d58480df823c9ac968fad0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bfd12fd5f0640b5b75cc7dc388fce43/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}