{
  "articles": [
    {
      "author": "Josh Boak, Aamer Madhani",
      "description": "President Donald Trump is set to unveil his proposed Board of Peace at the World Economic Forum. It's an idea that was initially envisioned as a small group of world leaders overseeing the Gaza ceasefire. But it has morphed into something far more ambitious. The rollout of the board has been overshadowed by Trump’s pressure campaign over acquiring Greenland. Some European leaders have said they'll take a pass on the new panel that Trump has suggested could eventually make the United Nations obsolete. Trump wants to spotlight the proposed board on Thursday.",
      "publishedAt": "2026-01-22T05:10:58Z",
      "title": "Trump unveils Board of Peace in Davos after Greenland furor",
      "url": "https://apnews.com/article/trump-davos-peace-board-zelenskyy-gaza-f3b265cff4032d51cb5f14bc1cd2d2a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3378fa/2147483647/strip/true/crop/3603x2027+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F64%2F4f789b615093e5ee8fa0c5a8cab3%2F8f36066958c340d1bd4469cf785cf845"
    },
    {
      "author": "Steven Sloan, Matt Brown",
      "description": "Joe Biden promised Europe that \"America is back\" early in his presidency, aiming to mend ties after Donald Trump's tenure. However, nearly five years later, Trump's influence over Europe has grown. Recently, Trump demanded Denmark cede Greenland to the U.S., causing turmoil within NATO. European leaders are responding by exploring alliances that exclude the U.S. Canadian Prime Minister Mark Carney highlighted a global shift, calling the rules-based order an \"illusion.\" European leaders criticized Trump's approach, while some Republicans supported him. Democrats urged stronger responses, stressing the need for a lasting shift in U.S. politics to rebuild trust.",
      "publishedAt": "2026-01-22T05:07:36Z",
      "title": "Trump's European threats leave America with uncertain standing in the world",
      "url": "https://apnews.com/article/trump-nato-europe-greenland-denmark-627268004024f111097d7e1c5c2da357",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7a1374/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2Fdd%2F499ec77b090b8210dc051b5c1bce%2F4ea8c5ab271948a58542e1ceac250aef"
    },
    {
      "author": "Alanna Durkin Richer, Giovanna Dell'Orto",
      "description": "Attorney General Pam Bondi says a woman who led an anti-immigration enforcement protest that disrupted a service at a Minnesota church has been arrested. Bondi announced the arrest of Nekima Levy Armstrong in a post on X on Thursday. On Sunday, protesters entered the Cities Church in St. Paul, where a local official with U.S. Immigration and Customs Enforcement serves as a pastor. The group interrupted services by chanting “ICE out” and “Justice for Renee Good,” referring to the 37-year-old mother of three who was fatally shot by an ICE officer in Minneapolis earlier this month. Levy Armstrong, a civil rights attorney and prominent local activist, had called for the pastor affiliated with ICE to resign.",
      "publishedAt": "2026-01-22T14:41:30Z",
      "title": "Woman arrested for leading a protests at a Minnesota church",
      "url": "https://apnews.com/article/justice-department-minnesota-church-disruption-bondi-ed084f5005187f58eabe0cc627d1862b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba8601d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F67%2F415b77bdc0f5f83ed5e8ce2627f2%2F3f51bd3a8d644c038b291a27b3ada84e"
    },
    {
      "author": "Michelle L. Price, Julie Carr Smyth",
      "description": "Vice President JD Vance is blaming what he calls the \"far left\" for turmoil surrounding the White House's deportation campaign. Vance is set to visit Minnesota later Thursday. But first he stopped in Ohio, his home state, where he criticized opposition to the administration's immigration enforcement. The vice president will meet in Minneapolis with Immigration and Customs Enforcement agents. Protests have erupted in the city after an agent fatally shot Renee Good this month. Vance has defended that agent and said Good's death was a \"tragedy of her own making.\" Vance also is praising the arrest of protesters who disrupted a weekend church service in Minnesota.",
      "publishedAt": "2026-01-22T16:44:49Z",
      "title": "Vance says 'far left' should stop resisting immigration enforcement",
      "url": "https://apnews.com/article/vance-ice-minneapolis-deportations-trump-economy-002f1d1acf05c00aeee289ec192100e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5140def/2147483647/strip/true/crop/8256x5501+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fe9%2Fad8f29867115a0bdd5013404721f%2F26a72b37c8e245e385716d4d6c506b1d"
    },
    {
      "author": "Emilie Megnien, Sean Murphy",
      "description": "Crews spread salt on roads and readied snowplows as a storm threatened to bring snow, sleet and freezing rain to a broad section of the U.S. in the coming days. Meteorologists say ice may linger on roads and sidewalks because temperatures will be slow to warm in many areas. Ice could also weigh down trees and power lines, triggering widespread outages. Forecasters say the storm will hit much of the nation’s midsection starting Friday and then head toward the East Coast through Sunday. The National Weather Service said the coldest windchills may fall below minus 50 Fahrenheit across the Northern Plains.",
      "publishedAt": "2026-01-22T05:01:48Z",
      "title": "States from New Mexico to the Carolinas prepare for severe ice storm",
      "url": "https://apnews.com/article/winter-storm-ice-snow-freezing-rain-f8f2277db0d87b1aa3d4893c565ce57c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9b2b4a/2147483647/strip/true/crop/5022x2825+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F8d%2Fea49b224e1395a6732f8840c4098%2F2d275591fed340369521991b91e01b04"
    },
    {
      "author": "Eric Tucker, Mary Clare Jalonick, Lisa Mascaro, Alanna Durkin Richer",
      "description": "Former Justice Department special counsel Jack Smith's congressional hearing is underway. Thursday's hearing is expected to focus fresh attention on Smith's two criminal investigations that shadowed Donald Trump during his 2024 presidential campaign. Smith testified behind closed doors last month but returns to the House Judiciary Committee for a public hearing. The hearing is likely to divide along partisan lines between Republican lawmakers looking to undermine Smith and Democrats hoping to elicit new and damaging testimony about Trump’s conduct in the Washington, D.C., and Florida cases. The hearing unfolds against the backdrop of an ongoing Trump administration retribution campaign targeting the investigators who scrutinized the Republican president.",
      "publishedAt": "2026-01-22T11:25:44Z",
      "title": "Jack Smith testifies at public hearing on his Trump investigations",
      "url": "https://apnews.com/article/jack-smith-congress-justice-department-trump-056c73bd6b5c46dc213266aa01677f36",
      "urlToImage": "https://dims.apnews.com/dims4/default/f683146/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F94%2F9f5b8a39794633536f5283d58826%2Fc7bd0eb57c1242bc9540bd4afcff410c"
    },
    {
      "author": "Kevin Freking, Lisa Mascaro",
      "description": "The House is looking to pass this year’s final batch of spending bills. The effort on Thursday is being complicated by Democratic lawmakers’ concerns the measure funding the Department of Homeland Security inadequately addresses President Donald Trump’s mass deportation efforts. House Democratic leaders Hakeem Jeffries, Katherine Clark and Pete Aguilar announced in a closed-door meeting they would oppose the Homeland Security bill. With Republicans in charge of both chambers of Congress and the White House, Democrats have few good options to express their opposition. Speaker Mike Johnson voices confidence the funding bills will pass, including the Homeland Security measure.",
      "publishedAt": "2026-01-22T12:01:34Z",
      "title": "House moves to finish government funding bills as deadline nears",
      "url": "https://apnews.com/article/homeland-security-government-funding-bills-d7ca791c2d1aa81d2982239f81bc86be",
      "urlToImage": "https://dims.apnews.com/dims4/default/18f89ed/2147483647/strip/true/crop/6809x3830+0+354/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Ff3%2Fdcc9dec0e4523786f922c4d711ad%2F72392f211e4a46189b7c319768a07ab5"
    },
    {
      "author": "Marcia Dunn",
      "description": "A new study shows how earthquake monitors can better track space junk by tuning into their sonic booms. Scientists reported Thursday that they collected seismic readings from the sonic booms generated when a discarded module from a Chinese crew capsule reentered in 2024. The data allowed them to place the object's path nearly 20 miles farther south than radar had predicted from orbit. The study in the journal Science focused on one debris event. But the researchers already have used publicly available data from seismic networks to track a few dozen other reentries, including those from three failed SpaceX Starship test flights.",
      "publishedAt": "2026-01-22T16:01:55Z",
      "title": "How earthquake detectors can track space junk",
      "url": "https://apnews.com/article/space-junk-seismic-booms-dadb5f9499fa9b52200baada0fdf1f15",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb9031a/2147483647/strip/true/crop/6039x4024+4+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F15%2F6180aee4778a7ac778c0c40b18fd%2Fee3f3b3c653748a7bc5c08add22b8737"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are ticking higher and have regained most of their losses for the week. The S&P 500 rose 0.4% Thursday, continuing its rally after President Donald Trump called off tariffs on European countries that he said opposed his desire to have Greenland. The Dow Jones Industrial Average rose 260 points, and the Nasdaq composite climbed 0.6%. Details are still sparse about the framework of a deal on Greenland that Trump said he reached with the head of NATO. Financial markets nevertheless showed signs of steadiness, though nerves were still apparent. Gold's price eased, while the U.S. dollar's value was mixed against other currencies.",
      "publishedAt": "2026-01-22T04:37:09Z",
      "title": "US stocks climb again after Trump calls off his tariffs for Greenland",
      "url": "https://apnews.com/article/stocks-markets-rates-greenland-trump-4834e3bc03fa1d3073e027bd67763cc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac7a94e/2147483647/strip/true/crop/4257x2837+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F2b%2F67312d69fcdc022c2421a453bbb5%2Fe16fafa083a544c1af3629a4a21941d0"
    },
    {
      "author": "Jake Coyle",
      "description": "Ryan Coogler’s blues-steeped vampire epic “Sinners” led all films with 16 nominations to the 98th Academy Awards, setting a record for the most in Oscar history. Academy of Motion Pictures Arts and Sciences voters showered “Sinnners” with more nominations Thursday than they had ever bestowed before, breaking the 14-nomination mark set by “All About Eve,” “Titanic” and “La La Land.” Along with best picture, Coogler was nominated for best director and best screenplay, and double-duty star Michael B. Jordan was rewarded with his first Oscar nomination, for best actor. Paul Thomas Anderson’s father-daughter revolutionary saga “One Battle After Another” trailed in second with 13 nominations of its own.",
      "publishedAt": "2026-01-22T05:05:32Z",
      "title": "Oscar nominations 2026: 'Sinners' could make history",
      "url": "https://apnews.com/article/oscar-nominations-2026-83798def8de7626b011aba3c043a4115",
      "urlToImage": "https://dims.apnews.com/dims4/default/9122abd/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F7f%2F1e10e37b803c4693271050df5108%2Fb1a628a31989438c8e890dabfd8decb5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}