{
  "articles": [
    {
      "author": null,
      "description": "The Bangladeshi military says an Air Force training aircraft has crashed into a school campus in the capital, Dhaka, killing at least 18 people. The military and a fire official say the Chinese-made F-7 BGI aircraft crashed shortly after takeoff into the campus of Milestone School and College on Monday afternoon as students were attending classes. Local media indicated most of the injured were students. The cause of the crash was not immediately clear. It is the deadliest airplane crash in the Bangladeshi capital in recent memory.",
      "publishedAt": "2025-07-21T08:42:26Z",
      "title": "A Bangladesh Air Force jet crashes into a Dhaka school and kills 18",
      "url": "https://apnews.com/article/bangladesh-air-force-training-jet-crash-school-dhaka-4fd5d521dd2f25e06361ac3a7c19bc2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/0253463/2147483647/strip/true/crop/3274x1842+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fe5%2F4e375a483c524089ae8f84dd1c85%2F3015a7af69404d629afaf8a4de5ad5c0"
    },
    {
      "author": null,
      "description": "President Donald Trump is threatening to hold up a stadium deal for Washington's football team if it doesn't restore its old name. Trump said Sunday on his social media site that the Washington Commanders should revert to the Redskins and the Cleveland Guardians should return to the Indians. Later in the day, he threatened the NFL team's stadium deal. The Commanders and Guardians changed their names in 2022 after years of debate over logos and names considered offensive. Both teams have stated they have no plans to change them back.",
      "publishedAt": "2025-07-20T17:52:25Z",
      "title": "Trump threatens to hold back stadium deal for Commanders over team name",
      "url": "https://apnews.com/article/trump-indians-redskins-guardians-commanders-8863d8d95f56414f0f74cab0e897a93f",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b4cba6/2147483647/strip/true/crop/5967x3356+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F95%2F3127d2f616eab2b8f82b7dd51adb%2F0c0f380a3cfb41ea8b075b9d1a5a7ac4"
    },
    {
      "author": null,
      "description": "Harvard University appears in federal court Monday, challenging $2.6 billion in funding cuts by the Trump administration. The university accuses the government of using funding as leverage to control its academic decisions. The cuts followed Harvard's rejection of demands from a federal antisemitism task force. The task force wanted sweeping changes to Harvard's policies on campus protests, admissions, hiring and more. Harvard, with a $53 billion endowment, has self-funded some research but warns it can't cover all losses. The Trump administration denies retaliation, stating the cuts align with its policies.",
      "publishedAt": "2025-07-21T10:19:58Z",
      "title": "Harvard in court over Trump's cuts in research funding",
      "url": "https://apnews.com/article/harvard-trump-funding-cuts-court-0e9100198461e1df52b5a5a4d11837ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/91db8f7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F82%2F7fa8059ab65e1c130f74ba99bde9%2Fa9d7cc75e3234e22a1a61cee595a6310"
    },
    {
      "author": null,
      "description": "The U.N. food agency says Israeli forces fired on Palestinians seeking food aid in northern Gaza on Sunday. Gaza's Health Ministry says at least 80 people were killed trying to access aid supplies. Israel says its forces fired warning shots to address a threat and questioned the death toll. The World Food Program condemned the violence, stating in a statement that the crowd was fired upon by Israeli tanks and snipers. Israel has meanwhile widened its evacuation orders for Gaza, indicating a new battleground may be opening up and squeezing Palestinians into ever tinier stretches of land. Gaza’s Health Ministry says the Palestinian death toll has now surpassed 59,000.",
      "publishedAt": "2025-07-21T09:32:09Z",
      "title": "UN food agency says Israel used tanks and snipers to fire on a crowd seeking aid in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-07-21-2025-01d877899f729d35cb1c9864d449ce53",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e50f6b/2147483647/strip/true/crop/8010x4506+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F62%2Fdbd408b6b179c7dcfdcefdecc4a1%2F0852109969074d8fb8bed75b1be66f15"
    },
    {
      "author": null,
      "description": "Lawyers for Kilmar Abrego Garcia have asked a federal judge in Tennessee to delay releasing him from jail while he awaits trial on human smuggling charges. The request is an effort to prevent the Trump administration from deporting the Maryland construction worker for a second time. Abrego Garcia become a prominent face in the debate over President Donald Trump’s immigration policies when he was wrongfully deported to his native El Salvador in March. The administration returned him to the U.S. last month to face the smuggling charges. U.S. officials say they'll try to deport him again if he's released from jail.",
      "publishedAt": "2025-07-21T14:39:31Z",
      "title": "Kilmar Abrego Garcia’s lawyers ask judge to delay release from jail over deportation fears",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-release-jail-deportation-trial-c17d7ba538530a668e4f55358e83c0fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/1aa78ce/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F79%2F8fa7b9d7e8cd7f9955b65943098b%2F6eec930538d44fc78ef6fcfd51b346b2"
    },
    {
      "author": null,
      "description": "Indonesian first responders say the number of people saved from a passenger ferry that caught fire at sea has risen to 575, but three people died and two remain missing. The ferry was making a regular half-day journey Sunday between two ports in North Sulawesi province when the fire started about midday. Images showed terrified passengers, mostly wearing life jackets, jumping into the sea as flames and smoke billowed. Rescue crews pulled many people from the sea, and local fishermen also saved some survivors. Authorities previously said five people died, but revised it to three Monday after two passengers initially reported as dead were found in a hospital.",
      "publishedAt": "2025-07-21T01:16:30Z",
      "title": "More than 575 people saved from burning Indonesia ferry, rescuers say",
      "url": "https://apnews.com/article/indonesia-passenger-ferry-fire-4872d675acc1fdd0d53811b1d0b0e55b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3b16862/2147483647/strip/true/crop/2432x1368+0+127/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fea%2F31353c02932f5ba44f31d8117090%2F631d4851042347998f1fe1e311cd398b"
    },
    {
      "author": null,
      "description": "Families of missing loved ones face a unique and agonizing grief called ambiguous loss. Experts explain this as the pain of uncertainty when a loved one's fate is unknown, leaving families in emotional limbo. Rachel Ganz, whose husband vanished in Missouri during April floods, describes waking daily to unbearable questions about his fate. Similar anguish affects families worldwide, from Ukraine to Israel and Gaza, as they navigate loss without closure. Experts say the lack of rituals intensifies the pain. Support can come from acknowledging their struggle and offering silent presence, as words often fail to comfort in such profound uncertainty.",
      "publishedAt": "2025-07-21T04:06:02Z",
      "title": "It's called 'ambiguous loss,' and it plagues families of missing people",
      "url": "https://apnews.com/article/texas-flood-missing-ukraine-israel-gaza-help-12b6b59b169a2fac9146ede7caf906b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6674c4e/2147483647/strip/true/crop/4160x2340+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F2a%2Fa6c0f7a2fcfd225b829581a2c529%2Ff53c35690ac54beea0b1d6528e47d095"
    },
    {
      "author": null,
      "description": "Russia has launched one of its largest aerial assaults on Ukraine in months, targeting Kyiv overnight into Monday. Ukrainian officials report two deaths and 15 injuries, including a child. This escalation comes as the U.K. and Germany prepare to lead a NATO meeting on military support for Ukraine, including advanced air defense systems like Patriots. The British defense chief is expected to urge Ukraine’s Western partners at the meeting to launch a “50-day drive” to get Kyiv the weapons it needs to fight Russia’s bigger army and force Russian President Vladimir Putin to the negotiating table, according to a statement by the U.K. government.",
      "publishedAt": "2025-07-21T05:01:54Z",
      "title": "UK and Germany to chair NATO meeting on Trump's Ukraine arms plan",
      "url": "https://apnews.com/article/russia-ukraine-nato-trump-weapons-1284699f9fbcf5157c43dc88ad6994f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/afef7dc/2147483647/strip/true/crop/5070x2852+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fe4%2F041e62d2f572d1922c6e92ccad32%2F7823a3b86dd64b8ea2b936562c75a2ca"
    },
    {
      "author": null,
      "description": "Japanese Prime Minister Shigeru Ishiba’s ruling coalition has lost its majority in the upper house of parliament. The coalition fell short of the 50 seats needed to secure a majority in the 248-seat chamber. This follows their October loss in the lower house, leaving the coalition a minority in both houses for the first time since 1955. Ishiba has vowed to stay on despite mounting challenges, including economic struggles and U.S. trade tensions. Meanwhile, opposition parties, including populist groups, gained ground, reflecting voter frustration with rising prices and political instability. Calls for Ishiba to step down may intensify.",
      "publishedAt": "2025-07-20T02:44:50Z",
      "title": "Japan's governing coalition loses upper house election",
      "url": "https://apnews.com/article/japan-politics-election-ishiba-parliament-vote-fcc2fb4cce609240d1c2369bf4090e26",
      "urlToImage": "https://dims.apnews.com/dims4/default/8b89157/2147483647/strip/true/crop/5088x2862+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Fd3%2F3c2f27810eb3b66819784e598228%2F01a5ed956b324e4ab150682841d1a6bd"
    },
    {
      "author": null,
      "description": "U.S. stocks are rising toward more records ahead of a week full of profit updates from big U.S. companies. The S&P 500 rose 0.5% Monday and was above its all-time high set on Thursday. The Dow Jones Industrial Average climbed 153 points, and the Nasdaq composite added 0.7% to its own record. Verizon Communications helped lead the way following its better-than-expected profit report. Other market heavyweights slated to report their results for the spring this week include Alphabet, Coca-Cola and Tesla. Stocks slipped across much of Europe but rose in much of Asia, while Treasury yields eased in the bond market.",
      "publishedAt": "2025-07-21T05:18:20Z",
      "title": "Wall Street rises toward records as Verizon begins a big week for profit reports with a beat",
      "url": "https://apnews.com/article/stocks-markets-rate-japan-trump-f8b796193ca767a3b0f8856eba0ae268",
      "urlToImage": "https://dims.apnews.com/dims4/default/39ca2b5/2147483647/strip/true/crop/4480x2520+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F1b%2Fd438a2035cce67d26fa67308dfbb%2F3161ec18215d4f958ff9387390f75768"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}