{
  "articles": [
    {
      "author": "TERRY SPENCER and KATE PAYNE",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton barreled into the Atlantic Ocean on Thursday after plowing across Florida as a Category 3 storm, pounding cities with ferocious winds and rain, whipping up a barrage of tornadoes and causing an unknown numbers of deaths.",
      "publishedAt": "2024-10-10T05:21:44Z",
      "title": "More than 3 million without power after Hurricane Milton slams Florida, causes deaths and flooding",
      "url": "https://apnews.com/5f6a112986eb6e21720f0f17c504afe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc33b98986c4452a833d7ab8691c088c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hurricane Milton brought powerful winds, a deadly storm surge and flooding to much of Florida after making landfall along the Gulf Coast as a Category 3 storm.",
      "publishedAt": "2024-10-10T07:46:51Z",
      "title": "The Latest: Hurricane Milton is weaker but still dangerous",
      "url": "https://apnews.com/cec55add05a1d5f0228656232523335b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/466daddb3e4c437cbaa92a3453c6a547/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "With its mighty strength and its dangerous path, Hurricane Milton powered into a very rare threat flirting with experts' worst fears.",
      "publishedAt": "2024-10-09T22:59:05Z",
      "title": "Here's what has made Hurricane Milton so fierce and unusual",
      "url": "https://apnews.com/0dd01c0e79d888dbda2a96b68fb62a29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1122a76ca9e4724a6af9beeeb4a50a8/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a school sheltering displaced people in the Gaza Strip killed at least 23 people on Thursday, with the toll likely to rise, Palestinian medical officials said.",
      "publishedAt": "2024-10-10T09:10:39Z",
      "title": "Palestinian officials say an Israeli strike on a Gaza shelter has killed at least 23 people",
      "url": "https://apnews.com/a5e53cdd4fca30be1909506b5c777922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0759a332430c45c9a49487c180950139/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israel’s ground invasion in Lebanon stretched into its second week, as the Hezbollah militant group fired hundreds of rockets deep into Israel — with no end in sight to the escalating conflict.",
      "publishedAt": "2024-10-01T12:10:40Z",
      "title": "What to know about Israel's ground invasion in southern Lebanon",
      "url": "https://apnews.com/c44358cb4c70db69bdab4b254cb2ed76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/685969995de14b9ab7b8b2cf52a327de/3000.jpeg"
    },
    {
      "author": "DAN MERICA, AARON KESSLER and RICHARD LARDNER",
      "description": "WASHINGTON (AP) — Donald Trump’s contributions from small-dollar donors have plummeted since his last bid for the White House, presenting the former president with a financial challenge as he attempts to keep pace with Democrats' fundraising machine.",
      "publishedAt": "2024-10-10T04:03:01Z",
      "title": "Trump's small-dollar donor fundraising is beset by confusion and fatigue",
      "url": "https://apnews.com/f1a6b238d15edb3f72260e4c86d2c552",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fd540a8e2604189a3c303b4e3575ede/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS and LORI HINNANT",
      "description": "The social media ads promised the young African women a free plane ticket, money and a faraway adventure in Europe. Just complete a computer game and a 100-word Russian vocabulary test.But instead of a work-study program in fields like hospitality and catering, some of them learned only after arriving on the steppes of Russia’s Tatarstan region that they would be toiling in a factory to make weapons of war, assembling thousands of Iranian-designed attack drones to be launched into Ukraine.",
      "publishedAt": "2024-10-10T04:04:51Z",
      "title": "Africans recruited to work in Russia say they were duped into building drones for use in Ukraine",
      "url": "https://apnews.com/11602ab837f0ff4635926d884b422185",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21dacca8e3c94b8998921cb8e2649366/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — U.S. inflation last month likely reached its lowest point since February 2021, clearing the way for another Federal Reserve rate cut and adding to the stream of encouraging economic data that has emerged in the final weeks of the presidential campaign.",
      "publishedAt": "2024-10-10T04:01:28Z",
      "title": "US inflation likely cooled again last month in latest sign of a healthy economy",
      "url": "https://apnews.com/cd6d9712bfd484d6e1bc4ccb958dcf23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db64146ce15a40acb9a36abbc581e3ee/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and MIKE CORDER",
      "description": "STOCKHOLM (AP) — After three days of Nobel prizes honoring work in the sciences, the literature award is being announced Thursday by the Nobel Committee at the Swedish Academy.",
      "publishedAt": "2024-10-10T07:33:10Z",
      "title": "The Nobel Prize in literature is being awarded in Stockholm",
      "url": "https://apnews.com/e52fdabe9379d351d744e121218bddc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2114fdb65224ca68677bbf8f3abb0fa/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "Rafael Nadal announced his impending retirement from tennis on Thursday at age 38 after winning 22 Grand Slam singles titles during an unprecedented era he shared with his rivals in the so-called Big Three, Roger Federer and Novak Djokovic.",
      "publishedAt": "2024-10-10T09:52:30Z",
      "title": "22-time Grand Slam champion Rafael Nadal will retire from tennis after next month's Davis Cup finals",
      "url": "https://apnews.com/e8d5c3ea277d4bb9e060a350319c66c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe5ba83a844c4977b9fc945ac79d8708/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}