{
  "articles": [
    {
      "author": "By Alanna Durkin Richer",
      "description": "A federal judge says he's found probable cause to hold the Trump administration in criminal contempt of court for violating his orders to turn around planes carrying deportees to El Salvador. U.S. District Judge James E. Boasberg said Wedneday that the administration must try to “purge” itself of a contempt finding or he'll launch hearings and potentially refer the matter for prosecution. The move by Boasberg marks an escalation in a battle between the judicial and executives branches of government over a president’s powers to carry out key White House priorities.",
      "publishedAt": "2025-04-16T16:32:58Z",
      "title": "Judge finds probable cause to hold Trump administration in contempt for violating deportation order",
      "url": "https://apnews.com/article/trump-deportees-el-salvador-contempt-boasberg-da282511ac6f5c8dd19af620995ca440",
      "urlToImage": "https://dims.apnews.com/dims4/default/f302e67/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F7d%2F5f1c43a327eb23fb85f5d5d37d37%2Fbd67517eae3a45bebe8972e155380f5f"
    },
    {
      "author": "Isaac Scharf, Wafaa Shurafa",
      "description": "Israel’s defense minister says that troops will remain in so-called security zones in the Gaza Strip, Lebanon and Syria indefinitely. Israeli forces have taken over large areas of Gaza in recent weeks in a renewed campaign to pressure Hamas to release hostages after Israel ended their ceasefire last month. Israel has also refused to withdraw from some areas in Lebanon following a ceasefire with the Hezbollah militant group last year, and it seized a buffer zone in southern Syria after the overthrow of President Bashar Assad. The Palestinians and both neighboring countries view the presence of Israeli troops as military occupation in violation of international law.",
      "publishedAt": "2025-04-16T07:44:48Z",
      "title": "Israeli defense minister says troops will remain in Gaza, Lebanon and Syria indefinitely",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-16-2025-884713e2096d5353e3008ec7d9cc01ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/5549379/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F64%2F4a087c951d5aa79334830a065534%2Ffdcc0d31ed85499b946861be5a9c58d8"
    },
    {
      "author": "Joseph Krauss",
      "description": "Israel’s defense minister says its troops will remain in so-called security zones in the Gaza Strip, Lebanon and Syria indefinitely, after Israel unilaterally expanded its frontiers in the war unleashed by Hamas’ Oct. 7, 2023, attack. Israel says it needs to hold on to the zones to prevent similar attacks, but the takeovers amount to military occupation. The acquisition of territory by force is universally seen as a violation of international law. Israel, which has captured territory during wars with its Arab neighbors going back to its establishment in 1948, says this is a special case.",
      "publishedAt": "2025-04-16T16:33:15Z",
      "title": "Israel to keep soldiers in Gaza, Lebanon and Syria indefinitely",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-gaza-lebanon-syria-land-buffer-zones-bed41f9762fd5481170119f3a8d0fba7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f09c2d6/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F77%2Fd40785977f5b99574b3197b02660%2F563816720fa4444faa2f96b483e3b1bf"
    },
    {
      "author": "Sylvia Hui",
      "description": "The U.K. Supreme Court is set to decide a case on the definition of a woman in a long-running dispute between a women’s rights group and the Scottish government. Five judges at Britain’s highest court are set to rule Wednesday in a case that seeks to clarify whether a trans person with a gender recognition certificate that recognizes them as female can be regarded as a woman under equality law. While the case centers on Scottish law, the women's campaign group bringing the challenge has said its outcome could apply to the U.K. and have consequences for single-sex services such as toilets and hospital wards.",
      "publishedAt": "2025-04-16T04:18:26Z",
      "title": "UK Supreme Court is set to rule on a landmark legal challenge over the legal definition of a woman",
      "url": "https://apnews.com/article/uk-supreme-court-decision-definition-woman-scotland-1a61bea0c26c13cf34864f696a1a5f0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/98781b3/2147483647/strip/true/crop/4969x2795+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F25%2F4a62a86374cb69e2bd375870ab72%2F8c49aee62be64c00b7adf328b8ebc0f5"
    },
    {
      "author": "Mary Clare Jalonick, Matthew Brown",
      "description": "Maryland Sen. Chris Van Hollen arrived in El Salvador Wednesday to push for the release of Kilmar Abrego Garcia, a man who was sent there by the Trump administration in March despite an immigration court order preventing his deportation. Van Hollen said in a video that he hopes to meet with Abrego Garcia, a Salvadoran citizen who was living in Maryland. He said he also hopes to meet with high level officials to press for his return to the United States. The Trump administration and Nayib Bukele, the president of El Salvador, said this week that they have no basis to send him back.",
      "publishedAt": "2025-04-16T17:06:04Z",
      "title": "Abrego Garcia's Maryland senator Chris Van Hollen visits El Salvador",
      "url": "https://apnews.com/article/abrego-garcia-el-salvador-trump-deportation-van-hollen-senator-81cca0ac24a9a312be97c730679f8dd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/0aca7d1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F26%2F51840e5ed136828d2845c3974d63%2Fa76685c0ca494bb3be86899cd908c3e3"
    },
    {
      "author": "Darlene Superville, Mari Yamaguchi",
      "description": "President Donald Trump says he's joining some of his top economic advisers for negotiations at the White House over tariffs and trade with a top Japanese official who's traveling to Washington for the talks. The Republican president says in a post on his social media platform he'll attend the meeting Wednesday alongside Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick. Trump recently announced a round of global tariffs but then quickly put them on hold for 90 days after the markets tanked. Japan's 24% across-the-board tariff is on hold. But a 10% baseline tariff and a 25% tariff on cars, auto parts, steel and aluminum exports to the U.S. remain in place.",
      "publishedAt": "2025-04-16T12:16:35Z",
      "title": "Trump says he'll join Bessent and Lutnick for trade negotiations with the Japanese",
      "url": "https://apnews.com/article/trump-trade-tariffs-japan-negotiations-bessent-lutnick-9134808d0e4aaf30bc60b28d7adc9b32",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f8d837/2147483647/strip/true/crop/4898x2755+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F11%2F30b5c33b9ce0332b1fa060462492%2F221a04a5f8194d3a9b029a66455b9331"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker, Patrick Whittle",
      "description": "The Trump administration is suing Maine’s education department for not complying with its push to ban transgender athletes in girls and women's sports. The lawsuit announced Wednesday by Attorney General Pam Bondi escalates a dispute over whether the state is abiding by a federal law that bars discrimination in education based on sex. The lawsuit follows weeks of feuding between the Republican administration and Democratic Gov. Janet Mills that has led to threats to cut off crucial federal funding. And there was an earlier clash at the White House when Mills told the president: “We’ll see you in court.”",
      "publishedAt": "2025-04-16T12:39:23Z",
      "title": "Trump administration sues Maine over participation of transgender athletes in girls sports",
      "url": "https://apnews.com/article/maine-education-department-transgender-athletes-pam-bondi-5b5c8d0022233fae5ec60efc9fa5394f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f270336/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F61%2Fd6d633d5d280727179bba869a57d%2Ffd5ee5ae838c4b2aa2bb5cecb09b2862"
    },
    {
      "author": null,
      "description": "Ten prison guards were charged in connection with the fatal beating of a 22-year-old prison inmate, including two charged with murder. Wednesday's charges are the second time a group of correctional officers in New York was indicted for a death behind bars this year. Other prisoners say several guards severely beat Messiah Nantwi, a prisoner at the Mid-State Correctional Facility, sending him to a hospital where he died on March 1. The Utica-area facility was one of many state prisons that was struggling to function during a three-week wildcat strike by guards.",
      "publishedAt": "2025-04-16T17:41:58Z",
      "title": "Messiah Nantwi: 10 guards charged over New York prisoner's fatal beating",
      "url": "https://apnews.com/article/new-york-prison-guards-inmate-death-5ec50359f3168e7115028c26784fc0af",
      "urlToImage": "https://dims.apnews.com/dims4/default/49136af/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2F70%2F3a6613582aa351ebacb38a1e51bf%2Fb191c95c28ca433ab12b4c01b2d4c327"
    },
    {
      "author": "The Associated Press",
      "description": "An independent expert will review security at Pennsylvania Gov. Josh Shapiro's official residence after investigators accused a man of scaling a wall and setting fire to the mansion, state police said Wednesday.The review will be a risk and vulnerability assessment of the governor’s official residence following the security breach, Pennsylvania State Police announced.",
      "publishedAt": "2025-04-16T14:35:48Z",
      "title": "Security review planned after arson at Pennsylvania governor's residence",
      "url": "https://apnews.com/article/pennsylvania-governor-arson-848cbadda4fc15197baa0169076534af",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Michael R. Sisak",
      "description": "Harvey Weinstein’s lawyers are asking a judge to allow the ailing ex-studio boss to spend his nights at a New York City hospital instead of jail for the duration of his #MeToo rape retrial. Weinstein’s lawyers made the request as jury selection resumed for a second day on Wednesday. In court papers, his lawyers argue that Weinstein’s stay at New York City’s notorious Rikers Island jail complex is exacerbating his health issues and that he’d be better off in the prison ward at Bellevue Hospital. Judge Curtis Farber has yet to rule on the request and the issue wasn’t discussed in court before jury selection resumed.",
      "publishedAt": "2025-04-16T15:04:50Z",
      "title": "Weinstein’s lawyers want him hospitalized instead of in jail during #MeToo retrial",
      "url": "https://apnews.com/article/harvey-weinstein-health-sexual-assault-metoo-retrial-720f5261203eb01d525b56bb5461d7ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/198fbde/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F92%2F3af098f2119c7f36e937c7a832df%2F7a9c9974042245c8aed9790dc5efa567"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}