{
  "articles": [
    {
      "author": "JINTAMAS SAKSORNCHAI, ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "BANGKOK (AP) — A plane carrying Julian Assange landed Tuesday in Bangkok for refueling, as the WikiLeaks founder was on his way to enter a plea deal with the U.S.",
      "publishedAt": "2024-06-25T05:33:34Z",
      "title": "WikiLeaks founder Julian Assange stops in Bangkok on his way to a US court and later freedom",
      "url": "https://apnews.com/00eb380879ff636cc9b916f82f82ed40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1d7303a648d4a7faa43717495307136/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israel’s Supreme Court on Tuesday ruled unanimously that the military must begin drafting ultra-Orthodox men for compulsory service, a landmark decision that could lead to the collapse of Prime Minister Benjamin Netanyahu’s governing coalition as Israel continues to wage war in Gaza.",
      "publishedAt": "2024-06-25T08:12:14Z",
      "title": "Israel's high court orders the army to draft ultra-Orthodox men, rattling Netanyahu's government",
      "url": "https://apnews.com/e2a8359bcea1bd833f71845ee6af780d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d415b0a1d8438b8565bc2dd54dc332/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — It could be a well-rehearsed zinger or an offhand, too-loud sigh.Notable moments from past presidential debates demonstrate how the candidates' words and body language can make them look especially relatable or hopelessly out-of-touch.",
      "publishedAt": "2024-06-25T04:06:21Z",
      "title": "How memorable debate moments are made: On the fly, rehearsed — and sometimes without a word uttered",
      "url": "https://apnews.com/93b3700715c2f16092ddfaee59ca49cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0302aed3302b42a48194d82060ed9de8/3000.jpeg"
    },
    {
      "author": "RICHARD LARDNER and JACK DURA",
      "description": "BISMARCK, N.D. (AP) — North Dakota Gov. Doug Burgum is one of Donald Trump’s most visible and vocal backers, sprinting around the country to drum up support for the former president’s comeback bid while auditioning to be his running mate.",
      "publishedAt": "2024-06-25T04:19:33Z",
      "title": "A potential Trump VP pick backs a controversial CO2 pipeline favored by the Biden White House",
      "url": "https://apnews.com/bd004cdfa081a11f769833587b6828b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f62006230ec4625a1576ee50a4a0fa5/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — The U.S. surgeon general on Tuesday declared gun violence a public health crisis, driven by the fast-growing number of injuries and deaths involving firearms in the country.",
      "publishedAt": "2024-06-25T09:03:10Z",
      "title": "US surgeon general declares gun violence a public health emergency",
      "url": "https://apnews.com/24b53f1aaace068e0cb24ae809853f66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4de9092413814e7c95c13332738e028d/1620.jpeg"
    },
    {
      "author": "RUSS BYNUM and JIM MUSTIAN",
      "description": "SAVANNAH, Ga. (AP) — Julian Lewis didn’t pull over for the Georgia State Patrol cruiser flashing its blue lights behind him on a rural highway. He still didn't stop after pointing a hand out the window and turning onto a darkened dirt road as the trooper sounded his siren.",
      "publishedAt": "2024-06-25T04:09:45Z",
      "title": "Shot in 1.6 seconds: Video raises questions about how trooper avoided charges in Black man's death",
      "url": "https://apnews.com/e5ac7de893189c11c88137fe9b81829e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1e3c966f45044eab4442fa4b2cb974a/1920.jpeg"
    },
    {
      "author": "MARGERY A. BECK, HANNAH FINGERHUT and JOHN HANNA",
      "description": "NORTH SIOUX CITY, S.D. (AP) — More storms are possible in parts of the deluged Midwest, where flooding after days of heavy rains has killed at least two people, sent a river surging around a dam and forced evacuations and rescues.",
      "publishedAt": "2024-06-25T04:46:39Z",
      "title": "More rain possible in deluged Midwest as flooding kills 2, causes water to surge around dam",
      "url": "https://apnews.com/71b740c16ad97edd90b3e9422672a61e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c7a59f8ad344f7aebeaa3ffe29e8ff/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran’s supreme leader called Tuesday for “maximum” voter turnout in this week's presidential election to “overcome the enemy,\" denouncing politicians who he described as believing that everything good comes from the United States.",
      "publishedAt": "2024-06-25T07:46:10Z",
      "title": "Iran's supreme leader calls for 'maximum' turnout for presidential election as voter apathy high",
      "url": "https://apnews.com/b5e4936aa0308d4fd646a4aaef9ed161",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ae7b6f59de641ec9b8d1e599f940b9a/2500.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "BANGKOK (AP) — China's Chang'e 6 probe returned on Earth with rock and soil samples from the little-explored far side of the moon in a global first.",
      "publishedAt": "2024-06-25T06:15:14Z",
      "title": "A Chinese lunar probe returns to Earth with the world's first samples from the far side of the moon",
      "url": "https://apnews.com/c2dd59505402c07f9382bbca14eed4cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cd7ef9046bc4b5eb1c225b942139b5c/1280.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "SUNRISE, Fla. (AP) — Aleksander Barkov put his hands at either end of the Stanley Cup and began skating away to start the celebration that the Florida Panthers have wanted forever.And as he began to hoist hockey's chalice for the first time, he had one thought.",
      "publishedAt": "2024-06-25T03:44:54Z",
      "title": "Top Cats: Panthers win their 1st Stanley Cup, top Oilers 2-1 in Game 7",
      "url": "https://apnews.com/37f35a84a80b8f1494d3c38511d312f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab66e90c16064a04a2e66c114079840b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}