{
  "articles": [
    {
      "author": "ZEKE MILLER, STEVE PEOPLES and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden worked forcefully Friday to quell Democratic anxieties over his unsteady showing in his debate with former President Donald Trump, as elected members of his party closed ranks around him in an effort to shut down talk of replacing him atop the ticket.",
      "publishedAt": "2024-06-28T15:28:07Z",
      "title": "Biden concedes debate fumbles but declares he will defend democracy. Dems stick by him — for now",
      "url": "https://apnews.com/b93d7ffaad75fd423ea3953fe16287f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd396de2091644d7800d1e2e7a3002b3/3000.jpeg"
    },
    {
      "author": "JACK DURA",
      "description": "BISMARCK, N.D. (AP) — For most of North Dakota Gov. Doug Burgum's two terms in office, he approached the job like a CEO running a business.",
      "publishedAt": "2024-06-29T04:03:14Z",
      "title": "Doug Burgum vetoed anti-LGBTQ measures while governor. Then he started running for president",
      "url": "https://apnews.com/c92c4cfc5f8f8fea1f0b1ffff743506e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90ae3ea095624f549022613c82d0e5eb/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and AMIR VAHDAT",
      "description": "DUBAI, United Arab Emirates (AP) — Iran will hold a runoff presidential election pitting a little-known reformist against a hard-line former nuclear negotiator after results released Saturday showed the lowest-ever poll turnout in the Islamic Republic’s history.",
      "publishedAt": "2024-06-29T02:45:58Z",
      "title": "Iran to hold runoff election with reformist Pezeshkian and hard-liner Jalili after low-turnout vote",
      "url": "https://apnews.com/189a89c3a9c04be1af83ab684e213558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/671e1d45805b4a96b16d37ba56f1866f/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Slowly but steadily this summer, Russian troops are forging through Ukraine's outgunned and undermanned defenses in a relentless onslaught, prompting the West to push for new weapons and strategies to shore up Kyiv.",
      "publishedAt": "2024-06-29T04:21:06Z",
      "title": "Russia presses its offensive in Ukraine and issues new threats as the West tries to blunt the push",
      "url": "https://apnews.com/a0c813d0c5c3c05943d4bec9306dbcd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e339caecd62453eab3429f714b7cf67/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — About a year and a half ago, a lawyer for Julian Assange presented federal prosecutors in Virginia with a longshot request: Dismiss the case against the WikiLeaks founder.",
      "publishedAt": "2024-06-29T04:04:32Z",
      "title": "The Saipan surprise: How delicate talks led to the unlikely end of Julian Assange's 12-year saga",
      "url": "https://apnews.com/86760b88e01553c8cfeb2fa00c78d5b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/615d2356f92b4f11b3ec4f41f72c0e8e/3000.jpeg"
    },
    {
      "author": null,
      "description": "BELGRADE, Serbia (AP) — An attacker with a crossbow wounded a Serbian police officer guarding the Israeli Embassy in Belgrade on Saturday, Serbia’s interior ministry said. The officer responded by fatally shooting the assailant.",
      "publishedAt": "2024-06-29T11:23:59Z",
      "title": "An attacker wounds a police officer guarding Israel's embassy in Serbia before being shot dead",
      "url": "https://apnews.com/920a0817e545ea20a98d19c59db80a38",
      "urlToImage": ""
    },
    {
      "author": "DEEPA BHARATH",
      "description": "Jews in the predominantly Muslim region of Dagestan in southern Russia say they are determined to regroup and rebuild following a deadly attack by Islamic militants on Christian and Jewish houses of worship in two cities last weekend.",
      "publishedAt": "2024-06-29T04:22:26Z",
      "title": "Dagestani Jews look to rebuild after extremist attacks in the restive region of southern Russia",
      "url": "https://apnews.com/02ccbd4970cf9868ce1c1b25e49d39d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7f634dbc88a40a8b856c104d322b1ff/3000.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "Two white autoworkers bludgeoned 27-year-old Chinese American Vincent Chin to death with a baseball bat during his bachelor party in Detroit in 1982, but his loved ones' cries for justice fell on deaf ears.",
      "publishedAt": "2024-06-29T04:17:07Z",
      "title": "The brutal killing of a Detroit man in 1982 inspires decades of Asian American activism nationwide",
      "url": "https://apnews.com/9431d684cde3d12e77c6cbd0f959b6ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/718cc7a4dce741298f89b70778992c06/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Martin Mull, whose droll, esoteric comedy and acting made him a hip sensation in the 1970s and later a beloved guest star on sitcoms including “Roseanne” and “Arrested Development,” has died, his daughter said Friday.",
      "publishedAt": "2024-06-29T01:11:33Z",
      "title": "Martin Mull, hip comic and actor from 'Fernwood Tonight' and 'Roseanne,' dies at 80",
      "url": "https://apnews.com/9e388ada08324634fe763b798abd0bc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cc31e482e3141de87d51fc65b47be58/3000.jpeg"
    },
    {
      "author": "JANIE McCAULEY",
      "description": "SAN FRANCISCO (AP) — Orlando Cepeda, the slugging first baseman nicknamed “Baby Bull” who became a Hall of Famer among the early Puerto Ricans to star in the major leagues, has died. He was 86.The San Francisco Giants and his family announced the death Friday night and a moment of silence was held as his photo showed on the scoreboard at Oracle Park midway through a game against the Los Angeles Dodgers.",
      "publishedAt": "2024-06-29T03:54:11Z",
      "title": "Orlando Cepeda, the slugging Hall of Fame first baseman nicknamed `Baby Bull,' dies at 86",
      "url": "https://apnews.com/2d8b17a39dd0814b290f175196b938d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b4930b606a64961a6778e906570bbb6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}