{
  "articles": [
    {
      "author": "Jim Morris, Rob Gillies",
      "description": "Canadians are in shock after a deadly mass shooting in British Columbia. Seven people were killed at a school in Tumbler Ridge, and two others at a nearby home. Authorities say the suspected shooter, a woman, was found dead from a self-inflicted wound. More than 25 people were wounded in Tuesday's attack, with two in critical condition. Prime Minister Mark Carney expressed his condolences and announced flags will fly at half-staff for seven days. School shootings are rare in Canada, which has strict gun control laws. The motive remains unclear as the investigation continues.",
      "publishedAt": "2026-02-11T15:00:38Z",
      "title": "Shooting at a school and home in Canada leaves 9 dead and 25 injured",
      "url": "https://apnews.com/article/canada-school-shooting-british-columbia-e577eb5689d1af42f6077a56368d4170",
      "urlToImage": "https://dims.apnews.com/dims4/default/d719763/2147483647/strip/true/crop/947x631+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F3e%2F9f6f7b81dbf6a97d54173ced10ac%2F1b43a2da28d94a6e931131d50f6b3342"
    },
    {
      "author": "Jesse Bedayn",
      "description": "Investigators are still searching for Nancy Guthrie as the case reaches it's 11th day. Police briefly detained a man for questioning but released him Tuesday. Investigators say the 84-year-old mother of “Today” show host Savannah Guthrie was taken against her will from her home in Tucson, Arizona. The FBI released porch video of a masked person with a backpack, but they haven't identified a suspect as pressure and questions mount. Former FBI profiler Mary Ellen O’Toole says it's not uncommon for investigations to move slowly. She says public tips can break cases open.",
      "publishedAt": "2026-02-11T21:24:30Z",
      "title": "Few leads in Guthrie investigation, yet cases often break unexpectedly",
      "url": "https://apnews.com/article/nancy-guthrie-missing-investigation-5d11ef6f23ce6b1895b0e4ea508364de",
      "urlToImage": "https://dims.apnews.com/dims4/default/2eb2cd0/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F5b%2Fc642e112cea967a29c3b5570f847%2Fdadf56efdf714675bc351b5083e1dcd2"
    },
    {
      "author": null,
      "description": "The Federal Aviation Administration is closing the airspace around El Paso International Airport in Texas for 10 days, grounding all flights to and from the airport. A notice posted on the FAA’s website said the temporary flight restrictions were for “special security reasons,” but the notice did not provide additional details. The closure does not include Mexican airspace. The airport said in an Instagram post that all flights to and from the airport would be grounded from late Tuesday through late on Feb. 20, including commercial, cargo and general aviation flights. It suggests travelers contact their airlines to get up-to-date flight information.",
      "publishedAt": "2026-02-11T10:51:06Z",
      "title": "FAA closes airspace around El Paso International Airport for 10 days",
      "url": "https://apnews.com/article/faa-el-paso-texas-air-space-closed-1f774bdfd46f5986ff0e7003df709caa",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff83bb/2147483647/strip/true/crop/4005x2669+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F56%2Fa40ae2f7385a44057ca845ba8125%2F9ff56359bb5749f2959b601277ec2e4f"
    },
    {
      "author": "Farnoush Amiri, Melanie Lidman",
      "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu are expected to discuss new nuclear talks with Iran. The longtime Israeli leader is visiting the White House on Wednesday. It comes as both Tehran and Washington are projecting cautious optimism after holding indirect talks in Oman on Friday about how once again to approach negotiations over Iran’s nuclear program. It remains unclear how much influence Netanyahu will have over Trump's approach toward Iran. Trump said Tuesday that he wants “no nuclear weapons, no missiles.” Netanyahu’s office has said he wants Iran talks to include limits on Iran’s ballistic missile program and support for militant groups like the Palestinian Hamas and Lebanon’s Hezbollah.",
      "publishedAt": "2026-02-11T05:02:10Z",
      "title": "Trump and Netanyahu meeting to focus on Iran",
      "url": "https://apnews.com/article/israel-iran-trump-netanyahu-nuclear-talks-fa5be8069deb4b1b01cdf30d3e3525e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/148d1b9/2147483647/strip/true/crop/2800x1866+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F92%2Fcff3128a8d93f54f000c9cdb02d4%2F61591b9a504845cfa509b1fa75e2c1c5"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker",
      "description": "Attorney General Pam Bondi is set to face questions from lawmakers over the Justice Department’s handling of files related to Jeffrey Epstein that have exposed sensitive private information about victims despite redaction efforts. Bondi is confronting a new wave of criticism stemming from the political saga that has dogged her term after the release of millions of additional Epstein disclosures that victims have slammed as sloppy and incomplete. It will be the first time the attorney general appears before Congress since a tumultuous hearing in October in which she repeatedly deflected questions and countered Democrats’ criticism of her actions with her own political attacks.",
      "publishedAt": "2026-02-11T05:05:39Z",
      "title": "Bondi will face questions from lawmakers over Epstein files",
      "url": "https://apnews.com/article/pam-bondi-house-judiciary-committee-justice-department-6d7502b80e42e9e9454264e242507bbd",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dbb8cf/2147483647/strip/true/crop/7494x4993+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F57%2Fefd2d6b9a3aa62f8a8201bc2f55e%2Fe5b8c6fefab049ba8ea8898d3528c7fa"
    },
    {
      "author": "Mark Kennedy",
      "description": "James Van Der Beek, best known as Dawson on “Dawson’s Creek,” has died at 48, according to a statement on his Instagram. The post on Wednesday says he died earlier that day. Van Der Beek shared in 2024 that he was receiving treatment for colorectal cancer. He was best known for “Dawson’s Creek,” which ran from 1998 to 2003. He also appeared in “Varsity Blues” and later leaned into jokes about his own image. He is survived by his wife, Kimberly, and six children.",
      "publishedAt": "2026-02-11T19:51:15Z",
      "title": "James Van Der Beek, 'Dawson's Creek' star, dies at 48",
      "url": "https://apnews.com/article/james-van-der-beek-dead-8668938cf9ee4a4608a0750c0ee3abd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/f13c52f/2147483647/strip/true/crop/3152x2100+5+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F0e%2Feb0721be8587406e93334380ddeb%2F34cf2bdfdb2d4a58ae55dfb1d9973660"
    },
    {
      "author": "Lisa Mascaro",
      "description": "House Republicans are rushing ahead with legislation that would impose strict new voter ID requirements ahead of the midterm elections. The bill, coming to a vote on Wednesday, is a Trump administration priority aimed at scrutinizing ballot access. But it faces blowback in the Senate. Called the Safeguard American Voter Eligibility, or SAVE America Act, the legislation requires Americans to present proof of citizenship when they register to vote and to show a valid photo identification before they cast ballots. Republicans say it's needed to prevent voter fraud. Democrats warn it will make it harder for millions of Americans to vote. Experts say voter fraud is extremely rare.",
      "publishedAt": "2026-02-11T19:45:01Z",
      "title": "GOP pushes ahead on strict voter ID bill ahead of midterm elections",
      "url": "https://apnews.com/article/house-gop-save-act-midterm-election-voting-a9a4f256fef5b1c9899f74abc5fddafa",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c4b2e9/2147483647/strip/true/crop/8293x5526+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fca%2Fb60c72005c4a9d0bc5a2452641af%2Fa40ecf233a574fc295c05b9a935ad848"
    },
    {
      "author": "Lauran Neergaard",
      "description": "Scientists are testing an entirely new way to fight heart disease: whether gene editing might offer a one-time fix for high cholesterol. It's very early-stage research that has been tried in only a few dozen people so far. But gene-editing approaches being developed by two companies show hints that switching off certain genes could dramatically reduce artery-clogging cholesterol. It will take far longer and larger studies to prove. Still, researchers say it raises hope of one day being able to prevent heart attacks without having to take pills.",
      "publishedAt": "2026-02-11T18:45:09Z",
      "title": "Could gene editing offer the one-time fix for artery-clogging cholesterol?",
      "url": "https://apnews.com/article/cholesterol-heart-attack-ldl-gene-editing-crispr-7aa18fea7484be8d3de9e00f3e2b01d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8476a49/2147483647/strip/true/crop/2048x1365+0+31/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F50%2F15586c6db2c420d9c9b9bb89f3dc%2F984d0bdc91794ba7969a719ab637c181"
    },
    {
      "author": "James Ellingworth",
      "description": "Franjo von Allmen of Switzerland looks like a breakout star of the Milan Cortina Olympics after winning his third gold medal. Jordan Stolz has one gold and is targeting three more. And Chloe Kim and a bunch of NHL stars are just getting started. Von Allmen won the super-G in Bormio on Wednesday to become the third man with three victories in Alpine skiing at one Winter Games. It hadn’t been done since 1968. Stolz won the men's 1,000-meter speedskating and has three events to go. Kim's attempt at a three-peat in the halfpipe began promisingly when she finished first in qualifying.",
      "publishedAt": "2026-02-11T16:34:10Z",
      "title": "Von Allmen wins again, Chloe Kim and NHL stars get started at Winter Olympics",
      "url": "https://apnews.com/article/winter-olympics-roundup-wednesday-61ea37be5fb4f533f225abe5bf75e893",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef63cc0/2147483647/strip/true/crop/4698x3130+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fd0%2Fafddb693385e31251c625d14b8eb%2Fa90eee0ccc3e4c45a578c62e016f244b"
    },
    {
      "author": "Paul Wiseman",
      "description": "U.S. employers added a surprisingly strong 130,000 jobs last month, but government revisions cut 2024-2025 U.S. payrolls by hundreds of thousands. The Labor Department said Wednesday that the unemployment rate fell to 4.3%. The report included major revisions that reduced the number of jobs created last year to just 181,000, weakest since the pandemic year of 2020, and less than half the previously reported 584,000. The job market has been sluggish for months even though the economy is registering solid growth.",
      "publishedAt": "2026-02-11T05:01:36Z",
      "title": "Strong hiring in January after hundreds of thousands of job cuts last year",
      "url": "https://apnews.com/article/jobs-economy-unemployment-labor-c760d3f86988833bc9ccb3936d44d61b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2dd4f0b/2147483647/strip/true/crop/1394x929+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2Fe2%2F71bef71be0f43e08b8c4dd12ecea%2Fbfda9d5535fc4de8a3972098c2ed416c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}