{
  "articles": [
    {
      "author": null,
      "description": "JERUSALEM (AP) — The Israeli military said Friday its troops in Gaza found the bodies of three Israeli hostages killed by Hamas during its Oct. 7 attack, including German-Israeli Shani Louk.",
      "publishedAt": "2024-05-17T15:32:45Z",
      "title": "Israeli army finds bodies of 3 hostages in Gaza killed at Oct. 7 music festival",
      "url": "https://apnews.com/a37e4fd656b46be36c4c659a9c2aac7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3d4f8d4efab479492c2cb8d72620b5c/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and JON GAMBRELL",
      "description": "WASHINGTON (AP) — Trucks carrying badly needed aid for the Gaza Strip rolled across a newly built U.S. pier and into the besieged enclave for the first time Friday as Israeli restrictions on border crossings and heavy fighting hindered the delivery of food and other supplies.",
      "publishedAt": "2024-05-17T06:14:53Z",
      "title": "Trucks are rolling across a new US pier into Gaza. But challenges remain to getting enough aid in",
      "url": "https://apnews.com/336c810724d107a41bb6628c721aea7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/475b1e85eed9410abddc2aa162533f22/2859.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "CAIRO (AP) — The 35 American and other international doctors came to Gaza in volunteer teams to help one of the territory’s few hospitals still functioning. They brought suitcases full of medical supplies and had trained for one of the worst war zones in the world.",
      "publishedAt": "2024-05-17T17:14:56Z",
      "title": "US, international volunteer doctors trapped in Gaza hospital by Israeli assault",
      "url": "https://apnews.com/b826803dfb08362d1e76de3ce3bdbf8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c93bf48437a64986ba9820c96d6daa05/2000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin said on Friday during a visit to China that Moscow’s offensive in Ukraine’s northeastern Kharkiv region aims to create a buffer zone but that there are no plans to capture the city.",
      "publishedAt": "2024-05-17T06:29:04Z",
      "title": "Putin says Russia wants a buffer zone in Ukraine's Kharkiv but has no plans to capture the city",
      "url": "https://apnews.com/ce31e2e73cbb8dd59aa73baa6cd87d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e7593ea8d7b4b5780dace0c33e995db/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — The planned presidential debates between Joe Biden and Donald Trump that were swiftly organized this week are a coup for CNN and ABC News — but a virtual guarantee they'll be among the least-watched general election contests ever.",
      "publishedAt": "2024-05-17T14:40:00Z",
      "title": "Taking presidential debates out of commission's hands virtually guarantees fewer viewers",
      "url": "https://apnews.com/e048a86824c5ed912d795bc37ae66f58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7b73bde522042daa817da3503134e40/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "ST. PAUL, Minn. (AP) — Former President Donald Trump will head to Minnesota on a day off from his hush money trial for a Republican fundraiser Friday night in a traditionally Democratic state that he boasts he can carry in November.",
      "publishedAt": "2024-05-17T04:04:12Z",
      "title": "Trump heads to Minnesota to campaign after attending his son Barron's Florida high school graduation",
      "url": "https://apnews.com/4f7ebfe7a2e1949d38a7c9894616a985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7a10c495f164ba3ad03146e29554d67/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican on Friday overhauled its process for evaluating alleged visions of the Virgin Mary, weeping statues and other seemingly supernatural phenomena that have marked church history, putting the brakes on making definitive declarations unless the event is obviously fabricated.",
      "publishedAt": "2024-05-17T04:09:25Z",
      "title": "Vatican moves to adapt to hoaxes, Internet and overhauls its process for evaluating visions of Mary",
      "url": "https://apnews.com/f9b5659e2947e7eb966db2e491e17267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc9318f913fc49709df1334b9786692e/2000.jpeg"
    },
    {
      "author": "SHARON LURYE",
      "description": "On May 17, 1954, the Supreme Court laid out a new precedent: Separate but equal has no place in American schools.The message of Brown v.",
      "publishedAt": "2024-05-17T04:01:30Z",
      "title": "70 years after Brown v. Board, America is both more diverse — and more segregated",
      "url": "https://apnews.com/ed5ef043609496ddf0575d1c704f5c16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec898382d6dd4d6bbe0eac5a7e8c4cec/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "FORT COLLINS, Colorado (AP) — Tick season is starting across the U.S., and experts are warning the bloodsuckers may be as plentiful as ever.Another mild winter and other favorable factors likely means the 2024 tick population will be equal to last year or larger, some researchers say.",
      "publishedAt": "2024-05-17T14:10:25Z",
      "title": "Tick season has arrived. Protect yourself with these tips",
      "url": "https://apnews.com/a28b25bc0d6103b02b48b2fbba65b5a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1993d1e179d41d1bf3efc0e9fd7e70a/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "LOUISVILLE, Ky. (AP) — Masters champion Scottie Scheffler was arrested Friday morning on his way to the PGA Championship, with stunning images showing him handcuffed as he was taken to jail for not following police orders during a pedestrian fatality investigation.",
      "publishedAt": "2024-05-17T11:35:14Z",
      "title": "Scheffler, charged with assault after officer dragged near fatal crash, tees off at PGA Championship",
      "url": "https://apnews.com/a421bfdb346f00dec95c95a0ab04e4d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df18b1b1933b42a6ac0f1a4dff239971/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}