{
  "articles": [
    {
      "author": "TERRY SPENCER and KATE PAYNE",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton barreled into the Atlantic Ocean on Thursday after plowing across Florida, where it knocked out power to more than 3 million customers and whipped up 150 tornadoes.",
      "publishedAt": "2024-10-10T05:21:44Z",
      "title": "Milton knocks out power to millions and spawns 150 tornadoes across Florida. At least 4 dead",
      "url": "https://apnews.com/5f6a112986eb6e21720f0f17c504afe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6a9b710a4e6482f951926db266c67e0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hurricane Milton brought powerful winds, a dangerous storm surge and flooding to much of Florida after making landfall along the Gulf Coast as a Category 3 storm.",
      "publishedAt": "2024-10-10T07:46:51Z",
      "title": "The Latest: Hurricane Milton is weaker but still dangerous",
      "url": "https://apnews.com/cec55add05a1d5f0228656232523335b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5054c173dc3c42e389ca81a6e92d8305/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a school sheltering displaced people in the Gaza Strip killed at least 27 people on Thursday, Palestinian medical officials said.",
      "publishedAt": "2024-10-10T09:10:39Z",
      "title": "An Israeli strike on a school-turned-shelter in Gaza kills at least 27 people",
      "url": "https://apnews.com/a5e53cdd4fca30be1909506b5c777922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20f7254bd99940bb9b502df2c5b5217f/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation in the United States dropped last month to its lowest point since it first began surging more than three years ago, adding to a spate of encouraging economic news in the closing weeks of the presidential race.",
      "publishedAt": "2024-10-10T04:01:28Z",
      "title": "US inflation reaches lowest point in 3 years, though some price pressures remain",
      "url": "https://apnews.com/cd6d9712bfd484d6e1bc4ccb958dcf23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db64146ce15a40acb9a36abbc581e3ee/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Millions of Social Security recipients will get a 2.5% cost-of-living increase to their monthly checks beginning in January, the Social Security Administration announced Thursday.",
      "publishedAt": "2024-10-10T04:07:47Z",
      "title": "Social Security recipients will get a 2.5% cost-of-living boost in 2025, smaller than in recent past",
      "url": "https://apnews.com/e25d292b6c0af80fc9cce9d309e48f02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cdf58965a714259a7c4ce0e20821ede/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY and STEVE LeBLANC",
      "description": "BOSTON, Mass. (AP) — Ethel Kennedy, the wife of Sen. Robert F. Kennedy who raised their 11 children after he was assassinated and remained dedicated to social causes and the family’s legacy for decades thereafter, died on Thursday, her family said.",
      "publishedAt": "2024-10-10T15:30:05Z",
      "title": "Ethel Kennedy, social activist and wife of Robert F. Kennedy, has died",
      "url": "https://apnews.com/00eb88951db24e0cada9bd48b66ad8ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23248ccc4bb148199dd844e7e5c82417/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris visits Nevada and Arizona while former President Donald Trump talks economic issues in Michigan, as presidential campaigning continues even with Hurricane Milton hitting Florida.",
      "publishedAt": "2024-10-10T13:49:01Z",
      "title": "Trump and Harris keep campaigning after Milton hits Florida",
      "url": "https://apnews.com/2a9db630d1318e78de91efd2df5a16f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57c8161345b4f55aa5dc455ed2eb4f0/3000.jpeg"
    },
    {
      "author": "DAN MERICA, AARON KESSLER and RICHARD LARDNER",
      "description": "WASHINGTON (AP) — Donald Trump’s contributions from small-dollar donors have plummeted since his last White House campaign, presenting the former president with a financial challenge as he tries to keep pace with the Democrats' fundraising machine.",
      "publishedAt": "2024-10-10T04:03:01Z",
      "title": "Trump's small-dollar donor fundraising is beset by confusion and fatigue",
      "url": "https://apnews.com/f1a6b238d15edb3f72260e4c86d2c552",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fd540a8e2604189a3c303b4e3575ede/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "She blames greedy companies for price-gouging. He blames the Biden administration’s economic policies.Kamala Harris and Donald Trump agree on one thing: Tapping into sour consumer sentiment about high grocery prices is one way to court voters.",
      "publishedAt": "2024-10-10T13:46:52Z",
      "title": "Bacon hogs the spotlight in election debates, but reasons for its sizzling inflation are complex",
      "url": "https://apnews.com/68aa2bdb957809eaa133758a99f516eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e6cac22a916432780505eb766ae664b/3000.jpeg"
    },
    {
      "author": "TALES AZZONI and HOWARD FENDRICH",
      "description": "MADRID (AP) — Rafael Nadal is retiring from professional tennis at age 38, he announced in a video message Thursday, after winning 22 Grand Slam titles — 14 at the French Open — during an unprecedented era he shared with rivals Roger Federer and Novak Djokovic.",
      "publishedAt": "2024-10-10T09:52:30Z",
      "title": "22-time Grand Slam champion Rafael Nadal will retire from tennis after next month's Davis Cup finals",
      "url": "https://apnews.com/e8d5c3ea277d4bb9e060a350319c66c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f17f4407f046698536a664cea93102/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}