{
  "articles": [
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Earlier this month, when Tucker Carlson asked Vladimir Putin about his reasons for invading Ukraine two years ago, Putin gave him a lecture on Russian history.",
      "publishedAt": "2024-02-21T05:27:32Z",
      "title": "How the Kremlin weaponized Russian history — and has used it to justify the war in Ukraine",
      "url": "https://apnews.com/80cb70fff9820357eddb83170695bdbb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f36036e17e24165a81f13ddb5799144/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Kateryna Dmytryk had been waiting for this moment for almost two years — nearly all of her young son’s life.",
      "publishedAt": "2024-02-21T05:13:11Z",
      "title": "For many Ukrainians, life is split in two: Before and after the war. This is one family's story",
      "url": "https://apnews.com/9af6c5f03ca93a2f96dbcffbdea42f40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32fd5cf8b37a4b358d66335f9e79f18c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes across Gaza killed at least 67 Palestinians overnight and into Wednesday, including in areas where civilians have been told to seek refuge.The Al-Aqsa Martyrs hospital in Deir al-Balah says it received 44 bodies after multiple strikes in central Gaza.",
      "publishedAt": "2024-02-21T09:00:45Z",
      "title": "Live updates | Israeli strikes across Gaza kill 67 Palestinians overnight",
      "url": "https://apnews.com/958e47556cdb77bc8edee3aed1e769e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0d794f183de40dab60cc1efe10a7bbd/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Israeli sabotage attack on an Iranian natural gas pipeline caused the multiple explosions that struck it a week ago, Iran's oil minister alleged Wednesday, further raising tensions between the regional archenemies amid Israel's war on Hamas in the Gaza Strip.",
      "publishedAt": "2024-02-21T08:15:17Z",
      "title": "Iran accuses Israel of sabotage attack that saw explosions strike natural gas pipeline",
      "url": "https://apnews.com/152640dd550f27f718312b4ad3684a3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6809b0a38424a57bb152a8d62b82de5/3000.jpeg"
    },
    {
      "author": "NICK INGRAM and MARGERY A. BECK",
      "description": "KANSAS CITY, Mo. (AP) — Two men charged with murder in last week's shooting after the Kansas City Chiefs’ Super Bowl parade were strangers who pulled out guns and began firing within seconds of starting an argument, according to court documents released Tuesday.",
      "publishedAt": "2024-02-20T20:09:42Z",
      "title": "2 men are charged with murder in the deadly shooting at Kansas City's Super Bowl celebration",
      "url": "https://apnews.com/7cb29dc9956d325103df9bf766a0c407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/472fe44100454bba9b915d8caf085574/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and LINDSAY WHITEHURST",
      "description": "LAS VEGAS (AP) — A former FBI informant charged with making up a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company had contacts with Russian intelligence-affiliated officials, prosecutors said Tuesday.",
      "publishedAt": "2024-02-20T23:16:54Z",
      "title": "Ex-FBI informant charged with lying about Bidens had Russian intelligence contacts, prosecutors say",
      "url": "https://apnews.com/ef48c7543e7a45cd3b8b671d0e2f60e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240cfb012400421f82f19697cee99c0f/3000.jpeg"
    },
    {
      "author": "BILL BARROW and JONATHAN J. COOPER",
      "description": "GREENVILLE, S.C. (AP) — Donald Trump doubled down Tuesday on comparing his criminal indictments to the circumstances of Russian dissident Alexei Navalny, the top political opponent of Russia’s autocratic leader Vladimir Putin who died in a remote arctic prison after being jailed by the Kremlin leader.",
      "publishedAt": "2024-02-21T00:57:02Z",
      "title": "Donald Trump again compares his criminal indictments to imprisonment and death of Putin's top rival",
      "url": "https://apnews.com/71513abe8f128ab885d9d2382f92e9d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b55ca14dd44841dd875dc897e54bf894/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — Ruby Franke, a Utah mother of six who gave parenting advice to millions via a once-popular a YouTube channel, shared a tearful apology to her children for physically and emotionally abusing them before a judge delivered a sentence that could put her in prison for years, if not decades.",
      "publishedAt": "2024-02-20T17:26:07Z",
      "title": "YouTube mom Ruby Franke apologizes at sentencing in child abuse case",
      "url": "https://apnews.com/4f4985c1cab9243d4eaf8b6a58f087ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b606dc6087cd4ccead36fad54c480857/2677.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Lawyers for the American government are to tell a London court on Wednesday why they think Julian Assange should face espionage charges in the United States, in response to a last-ditch bid by his defense to stop the extradition of the WikiLeaks founder.",
      "publishedAt": "2024-02-21T09:05:02Z",
      "title": "Lawyers for the US to tell a British court why WikiLeaks’ Julian Assange should face spying charges",
      "url": "https://apnews.com/25a5f66df1e8d94d0db1e9d6bb323ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30258e6421ee403db34e6ffb2db7eae9/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "NEW YORK (AP) — Emily Hollenbeck lived with a deep, recurring depression she likened to a black hole, where gravity felt so strong and her limbs so heavy she could barely move.",
      "publishedAt": "2024-02-21T05:11:41Z",
      "title": "A pacemaker for the brain helped a woman with crippling depression. It may soon be available widely",
      "url": "https://apnews.com/26383d6e5f9eb797485b7bc277cac59c",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}