{
  "articles": [
    {
      "author": "ABDUL SATTAR",
      "description": "QUETTA, Pakistan (AP) — A powerful bomb exploded in a crowd of people celebrating the Prophet Muhammad’s birthday in southwestern Pakistan on Friday, killing at least 52 people and wounding nearly 70 others, authorities said.",
      "publishedAt": "2023-09-29T06:58:53Z",
      "title": "Dozens dead after blast in southwestern Pakistan at a rally celebrating birthday of Islam's prophet",
      "url": "https://apnews.com/f9d1fab750bc8fcb03bb11e09e22d9de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/932aa0a0d9754c9096b314f03b5cfd45/2183.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — With little time left to prevent a government shutdown, the House is in a familiar position: effectively paralyzed as conservatives feud with Speaker Kevin McCarthy over matters large and small.",
      "publishedAt": "2023-09-29T04:01:43Z",
      "title": "The far right has been feuding with McCarthy for weeks. Here's how it's spiraling into a shutdown",
      "url": "https://apnews.com/585c82607c00c2cfc45768faff6e1cda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f73863ead43145d49b8bcefffb100b56/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Entrances to national parks will be blocked and thousands of park rangers will be furloughed if Congress doesn’t reach a budget agreement this weekend, the Department of Interior said Friday.",
      "publishedAt": "2023-09-29T10:02:43Z",
      "title": "Gates will be locked and thousands of rangers furloughed at national parks if government shuts down",
      "url": "https://apnews.com/55c06261c51650e34f4591626bd9f236",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e121889efe1439daf8426c13815f543/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The swift fall of the Armenian-majority enclave of Nagorno-Karabakh to Azerbaijani troops and the exodus of much of its population has stunned the large Armenian diaspora around the world.",
      "publishedAt": "2023-09-29T04:06:27Z",
      "title": "The fall of an enclave in Azerbaijan stuns the Armenian diaspora, extinguishing a dream",
      "url": "https://apnews.com/dc00e20d1c684877e5b0e67d3de76388",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a750ec6d95f4e0383c77497499fb0a3/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin has ordered one of the top commanders of the Wagner military contractor to take charge of “volunteer units” fighting in Ukraine, signaling the Kremlin’s effort to keep using the mercenaries after the death of their chief, Yevgeny Prigozhin.",
      "publishedAt": "2023-09-29T11:00:57Z",
      "title": "Putin orders former Wagner commander to take charge of 'volunteer units' in Ukraine",
      "url": "https://apnews.com/e9bda6dd302012bd74dfcfeb6e1f5010",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93e8710878514d51960af0c64766a06d/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Pennsylvania's Democratic Gov. Josh Shapiro is set to address presidential primary voters in New Hampshire on Saturday.Michigan Gov.",
      "publishedAt": "2023-09-29T04:10:46Z",
      "title": "Democratic rising stars rally around Biden's reelection. They're also eyeing 2028 bids of their own",
      "url": "https://apnews.com/e335f0b82972e683cdd346f0d9ea881b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cf9e9316d1d476dbddf3c6a32a9c72c/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "STE MERE EGLISE, France (AP) — The soldier had target fixation. He had three beers in hand, a full day of leave and a group of young women waiting. But a crowd of Army uniforms also gathered for this French village’s D-Day celebrations stood in the way.",
      "publishedAt": "2023-09-29T04:08:19Z",
      "title": "Traveling with Milley: A reporter recalls how America's top soldier was most at home with his troops",
      "url": "https://apnews.com/07e77553722f4db8fac50e4d07f63eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81b2493801024fdcabd3c782a68b7942/1920.jpeg"
    },
    {
      "author": "JAKE BLEIBERG",
      "description": "DALLAS (AP) — An American soldier who sprinted into North Korea and was held there for two months before being returned to the U.S.",
      "publishedAt": "2023-09-28T23:53:55Z",
      "title": "What to know and what's next for Travis King, the American soldier who ran into North Korea",
      "url": "https://apnews.com/d9afac30fa93096af0fd4c1ffff76c3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ae60f69be7b41eea5f187830498d21b/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS and ED WHITE",
      "description": "PONTIAC, Mich. (AP) — A teenager who killed four students at Michigan's Oxford High School will learn Friday whether he will spend his life in prison or get a chance for parole in the decades ahead.",
      "publishedAt": "2023-09-29T04:33:58Z",
      "title": "Michigan judge to decide whether Oxford High School shooter gets life in prison or chance at parole",
      "url": "https://apnews.com/ae0daea14a19152ad4cee603b7b1f0e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a31e9b330ed4a62bf050f8ae132168e/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — In the last few years, China’s government has promoted increasingly conservative social values, encouraging women to focus on raising children. It has cracked down on civil society movements and made laws to drive out foreign influence.",
      "publishedAt": "2023-09-29T04:14:33Z",
      "title": "As China censors homegrown feminism, a feminist scholar from Japan is on its bestseller lists",
      "url": "https://apnews.com/3a7ef7a9e8d5a8ed87314fac69ba768d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cba73b3bb9a492eb9648f04d3a5db83/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}