{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "A federal appeals court late Tuesday issued an order that again prevents Texas from arresting migrants suspected of entering the U.S. illegally, hours after the Supreme Court allowed the strict new immigration law to take effect.",
      "publishedAt": "2024-03-19T18:26:17Z",
      "title": "Court order puts Texas law allowing police to arrest migrants who cross illegally back on hold",
      "url": "https://apnews.com/13ffaed316d16f42e928f6958f0658f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e486f5f981c14cf2a59d28b23e598ebc/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, JONATHAN J. COOPER and PATRICK ORSAGOS",
      "description": "TEMPE, Arizona (AP) — As Joe Biden and Donald Trump moved closer to a November rematch, primary voters around the country on Tuesday urged their favored candidate to keep up the fight and worried about what might happen if their side loses this fall.",
      "publishedAt": "2024-03-19T04:04:29Z",
      "title": "Biden and Trump notch more wins Tuesday as primary voters urge them to keep up the fight",
      "url": "https://apnews.com/8b2414273d7e4d46f5696268ae89a7f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c38cef1ba54a8bb37d40c41eccb0d2/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Explosions and shootings shook the Gaza Strip’s biggest hospital and surrounding neighborhoods as Israeli forces stormed through the facility for a second day Tuesday. The military said it had killed 50 Hamas militants in the hospital, but it could not be independently confirmed that the dead were combatants.",
      "publishedAt": "2024-03-19T17:44:31Z",
      "title": "Heavy fighting rages around Gaza's biggest hospital as Israel raids it for a second day",
      "url": "https://apnews.com/a46aed2d25a6d95d9f3d67edcd60dd50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7cf5170070f4cf9b40014c743153b19/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Catastrophic hunger is so dire in two world hotspots that famine is imminent in northern Gaza and approaching in Haiti, with hundreds of thousands of people in both places struggling to avoid starvation.",
      "publishedAt": "2024-03-19T18:41:45Z",
      "title": "Gaza and Haiti are on the brink of famine, experts say. Here's what that means",
      "url": "https://apnews.com/16215137be084e51849c41a83335119d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53378c23351e42dcb35842864e34a4ca/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump suggested Tuesday that he’d support a national ban on abortions around 15 weeks of pregnancy, voicing for the first time support for a specific limit on the procedure.",
      "publishedAt": "2024-03-20T02:39:02Z",
      "title": "Trump suggests he'd support a national ban on abortions around 15 weeks of pregnancy",
      "url": "https://apnews.com/91a9e0ce87d11dff0fa761f327bd0566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/690f648384ff4b33b8d790b305af6fe8/2872.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The House impeachment inquiry into President Joe Biden has hit a crossroads, lacking the political appetite from within Republican ranks to go forward with an actual impeachment, but facing political pressure to deliver after months of work.",
      "publishedAt": "2024-03-20T04:12:26Z",
      "title": "Biden impeachment inquiry is at a crossroads. As Hunter Biden declines to appear, GOP eyes next move",
      "url": "https://apnews.com/f09ba1ae3b7bda703a5a84530f56d70f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9b63afa6324234a345623517c205a5/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Warnings about deepfakes and disinformation fueled by artificial intelligence. Concerns about campaigns and candidates using social media to spread lies about elections. Fears that tech companies will fail to address these issues as their platforms are used to undermine democracy ahead of pivotal elections.",
      "publishedAt": "2024-03-20T04:05:29Z",
      "title": "Election misinformation is a problem in any language. But some gets more attention than others",
      "url": "https://apnews.com/ed829171343812cbe55fab99615c77e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a221fb50a61c47ae955ed5681b024a16/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea successfully tested a solid-fuel engine for its new-type intermediate-range hypersonic missile, state media reported Wednesday, claiming a progress in efforts to develop a more powerful, agile missile designed to strike faraway U.S.",
      "publishedAt": "2024-03-20T00:09:26Z",
      "title": "North Korea claims progress in developing a hypersonic missile designed to strike distant US targets",
      "url": "https://apnews.com/af9f8c69e4ff004cd04592d2c80cda47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17f7e794c90a4e35b08e3062355b713f/3000.jpeg"
    },
    {
      "author": null,
      "description": "TOKYO (AP) — A South Korean tanker capsized off an island in southwestern Japan early Wednesday, and the coast guard said it had rescued four crew members and was still searching for seven who were missing.",
      "publishedAt": "2024-03-20T04:07:31Z",
      "title": "South Korean tanker capsizes off southwestern Japan, 4 crewmembers rescued and 7 missing",
      "url": "https://apnews.com/b947a1a32ae089882edc6b033bfa2fef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e32e1498ac4f4ca4afac000d9da0ffca/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES and MAURICIO SAVARESE",
      "description": "RIO DE JANEIRO (AP) — As Brazilian President Jair Bolsonaro's term wound down in the final days of December 2022, he had decided to skip the ritual of handing over the presidential sash to his successor, and instead made plans to travel abroad.",
      "publishedAt": "2024-03-20T04:10:43Z",
      "title": "Several probes target Brazil's Bolsonaro, but his COVID decisions are catching up to him first",
      "url": "https://apnews.com/2e9194bb1a6dc56e421f71016487e76f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9f37f1ccab14545b007a3e5f7302da9/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}