{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump’s new ban on travel to the United States by citizens from 12 mainly African and Middle Eastern countries is now in effect. The ban took effect on Monday and comes as tensions escalate over the president’s campaign of immigration enforcement. Trump signed the new proclamation last week. It applies to citizens of Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It also imposes heightened restrictions on people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela who are outside the U.S. and don’t hold a valid visa.",
      "publishedAt": "2025-06-08T18:26:49Z",
      "title": "Trump's new travel ban takes effect",
      "url": "https://apnews.com/article/trump-travel-ban-immigration-enforcement-visas-b1eb79c7b5717c96daf51e978db83d1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a1a146/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F24%2F798081743f495a251f64db83f53f%2F145a13541b364c1b80157b28574a4457"
    },
    {
      "author": null,
      "description": "Russia launched 479 drones at Ukraine in the war’s biggest overnight drone bombardment, the Ukrainian air force said. As well as the drones, 20 missiles of various types were fired at different parts of Ukraine, the air force said Monday. The attacks usually start late in the evening and end in the morning, because drones are harder to spot in the dark. Russia has targeted civilian areas of Ukraine with Shahed drones since the start of the war. The attacks have killed more that 12,000 Ukrainian civilians, according to the United Nations. A recent escalation in aerial attacks has coincided with a renewed Russian battlefield push on eastern and northeastern parts of the roughly 1,000-kilometer (620-mile) front line.",
      "publishedAt": "2025-06-09T08:22:36Z",
      "title": "Ukraine says Russia launched 479 drones",
      "url": "https://apnews.com/article/ukraine-russia-drones-attack-air-force-a1b092efaaad6886659a9230109a48db",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Thousands of protesters took to the street in Los Angeles on Sunday in response to President Donald Trump's extraordinary deployment of the National Guard against Gov. Gavin Newsom's wishes. The demonstrations centered on a cluster of federal buildings including a detention center where immigrants arrested on Friday were taken. As the protests swelled on Sunday, demonstrators blocked a freeway entrance, set self-driving cars on fire and threw objects including concrete and electric scooters at law enforcement officers and vehicles. Los Angeles Police Chief Jim McDonnell says some of the protesters engaging in the most aggressive behavior are agitators looking to cause trouble.",
      "publishedAt": "2025-06-09T04:25:10Z",
      "title": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops",
      "url": "https://apnews.com/article/los-angeles-protests-national-guard-trump-14c9dda32663d7d2c45f2b1c5a1d219c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3af0f0d/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fca%2F0e3b7a85ec3116cc0548a446acee%2Fb0ec65081ab14f35b8ab14d75cba5f5f"
    },
    {
      "author": null,
      "description": "Israeli forces have stopped a Gaza-bound aid boat and detained Greta Thunberg and other activists on board, enforcing a longstanding blockade of the Palestinian territory that has been tightened during the war with Hamas. The Freedom Flotilla Coalition, which had organized the voyage to deliver humanitarian aid to the Gaza Strip and protest Israel’s blockade and wartime conduct, said the activists had been “kidnapped by Israeli forces.” Israel said the passengers would return to their home countries and the aid would be delivered to Gaza through established channels.",
      "publishedAt": "2025-06-09T01:20:54Z",
      "title": "Israeli forces detain Greta Thunberg after halting Freedom Flotilla aid boat",
      "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be",
      "urlToImage": "https://dims.apnews.com/dims4/default/be50b33/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Fc7%2Fcd0bf01bc66a2cbb83e57fecc5d8%2Fa38136d8c5344e9badbd78e93dda8702"
    },
    {
      "author": null,
      "description": "Warner Bros. Discovery will calve off cable operations from its streaming service, creating two independent companies as the number of people “cutting the cord” brings with it a sustained upheaval in the entertainment industry. HBO, and HBO Max, as well as Warner Bros. Television, Warner Bros. Motion Picture Group, DC Studios, will become part of the streaming and studios company. The cable company will include CNN, TNT Sports in the U.S., and Discovery, top free-to-air channels across Europe, and digital products such as the Discovery+ streaming service and Bleacher Report. Shares of Warner Bros. Discovery, based in New York City, jumped 11% at the opening bell.",
      "publishedAt": "2025-06-09T11:37:50Z",
      "title": "Warner Bros. Discovery to split into two companies, dividing cable and streaming services",
      "url": "https://apnews.com/article/warner-brothers-discovery-streaming-cable-cnn-tnt-1cdafec11e6cb542ca644e20dd29e826",
      "urlToImage": "https://dims.apnews.com/dims4/default/c76697f/2147483647/strip/true/crop/4422x2487+0+187/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Ff4%2F2f61af945f575f759a4a9cf4e326%2F33b9bc88e87c4cb494bdad7cd54b677a"
    },
    {
      "author": null,
      "description": "Scores of National Institutes of Health researchers and staffers have come forward to send their Trump-appointed leader a letter challenging policies they say undermine the NIH mission. The letter says the Republican Trump administration's policies waste public resources and “harm the health” of people worldwide. By signing their names Monday, the NIH employees give up the veil of anonymity so common in Washington and jeopardize their jobs. President Donald Trump’s pick to lead the NIH, Jay Bhattacharya, in his confirmation hearings pledged openness to views that might conflict with his own, saying dissent is the \"essence of science.” The NIH employees' letter says, “We dissent.” The White House hasn't commented.",
      "publishedAt": "2025-06-09T12:00:44Z",
      "title": "NIH scientists go public with criticism over Trump cuts",
      "url": "https://apnews.com/article/nih-letter-bethesda-declaration-bhattacharya-89724aee201f3e99fc1159adcbf9ac94",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1ed686/2147483647/strip/true/crop/5423x3050+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F67%2F575b1e75bb089548def17ad55df1%2F5e261141ba9644428a38b7aac346a8b4"
    },
    {
      "author": null,
      "description": "China has reported its exports rose 4.8% in May from a year earlier, lower than expected as shipments to the United States fell nearly 10%. Imports declined 3.4% year-on-year, leaving a trade surplus of $103.2 billion. Chinese customs data released Monday show China's exports to the U.S. in May totaled $28.8 billion, while imports fell 7.4% year-on-year to $10.8 billion. China's global exports jumped 8.1% in April. They slowed even after U.S. President Donald Trump struck a deal with Beijing to delay implementation of stiff tariff hikes to allow time for talks. The next round of U.S.-China talks was due to take place later Monday in London.",
      "publishedAt": "2025-06-09T03:39:21Z",
      "title": "China's exports climb 4.8% in May as shipments to the US fall nearly 10%",
      "url": "https://apnews.com/article/china-trade-exports-trump-tariffs-a6f55570462e4ffce106698ef23ac7be",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e17425/2147483647/strip/true/crop/7146x4020+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F95%2F4d87b81028b4940e771caa582c53%2F20e4f76db0e9426e9f404129a87519b4"
    },
    {
      "author": null,
      "description": "The third U.N. Ocean Conference has opened as pressure mounts for nations to turn decades of promises into real protection for the sea. French President Emmanuel Macron, delivering the keynote address in the host city of Nice on Monday, urged countries to move “from words to deeds” in safeguarding the oceans. He warned that “the fight for the ocean is at the heart of the years-long battles we’ve been waging — for biodiversity, for climate, for our environment and for our health.” Atop this year’s agenda is ratification of the High Seas Treaty, which would for the first time allow nations to establish marine protected areas in international waters, which cover nearly two-thirds of the ocean and are largely ungoverned.",
      "publishedAt": "2025-06-09T03:06:31Z",
      "title": "Acting to protect the oceans is the focus of a UN conference",
      "url": "https://apnews.com/article/un-oceans-conference-france-high-seas-treaty-9d46d372dc1f2d44bedbe41c84598bc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/0154f7a/2147483647/strip/true/crop/5123x2882+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fae%2F440b413ee49956ae043d0ba4c676%2Fa5a6d763ed00485a98861259fb3123c9"
    },
    {
      "author": null,
      "description": "After stumbling out of the starting gate in Big Tech’s pivotal race to create artificial intelligence, Apple will try to regain its footing Monday with its annual showcase for the next generation of software powering the iPhone and other popular products. The presummer rite is expected be more subdued than the feverish anticipation that surrounded the event in 2023 when Apple unveiled a mixed-reality headset and last year when the company hyped AI features that didn't pan out as envisioned. Now Apple is facing nagging questions about its ability to innovate and ability to navigate a gauntlet of other challenges as it heads into this year's World Wide Developers Conference.",
      "publishedAt": "2025-06-09T04:01:06Z",
      "title": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump's trade war",
      "url": "https://apnews.com/article/apple-conference-iphone-artificial-intelligence-ba918c2091e0d49a8b3f164e4f980b6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d5b419d/2147483647/strip/true/crop/6769x3808+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fff%2F81ecc765fde16ba08cad2bf9de14%2Fb88223b8094c40b1bf7271fdbb40386c"
    },
    {
      "author": null,
      "description": "Most big collections have only a fraction of their items on display, with the rest locked away in storage. But not at the new V&A East Storehouse, where London’s Victoria and Albert Museum has opened up its storerooms for visitors to view — and in many cases touch — the items within. The 170,000-square-foot building is bigger than 30 basketball courts. It holds more than 250,000 objects, 350,000 books and 1,000 archives. And anyone can book a one-on-one appointment with any object, from a Vivienne Westwood mohair sweater to a tiny Japanese netsuke figurine. Museum official Kate Parsons says it lets visitors get close to “5,000 years of creativity.”",
      "publishedAt": "2025-06-09T04:04:44Z",
      "title": "At this museum, no one will shush you, and you can touch the objects",
      "url": "https://apnews.com/article/va-museum-storehouse-london-46f10fb4b22b27aac3a154188c5bf198",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d40a5f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2F38%2F776eb1d0b1e87f8860422c2fa4fa%2F51bd6389c00041af8be7a180aa25dc3d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}