{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Qatar’s foreign ministry said the ceasefire between Israel and Hamas will go into effect at 0630 GMT on Sunday. This will pause the fighting after 15 months of war and see the release of dozens of hostages held by the militants in the Gaza Strip and hundreds of Palestinians imprisoned by Israel. Israel’s Cabinet approved the deal early on Saturday. Under the deal, 33 hostages are to be freed over the next six weeks, in exchange for more than 700 Palestinians imprisoned by Israel. The remaining hostages, including male soldiers, are to be released in a second phase that will be negotiated during the first.",
      "publishedAt": "2025-01-18T08:04:41Z",
      "title": "Middle East latest: Ceasefire between Israel and Hamas will go into effect at 0630 GMT on Sunday",
      "url": "https://apnews.com/article/israel-hamas-war-syria-lebanon-news-01-18-2025-13bc9e5d1ae5cc13014cc300c95803b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/5205c4c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F0d%2F15028e22601496e8ef904bd9b720%2Fbdf789ef216543c0b63c119628b8e5d1"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "A team of doctors in Israel is preparing for the return of the hostages from Gaza with the expectation that many are likely to have severe, life-threatening complications from spending more than a year in captivity. So much about their conditions is unknown, and hospitals and experts are preparing for multiple scenarios. Some physicians say they expect the hostages to return with cardiovascular and respiratory issues due to lack of ventilation in the tunnels where many were held. They also expect to see numerous other afflictions. They range from cognitive impairment and vision problems resulting from lack of daylight to infectious diseases and broken bones.",
      "publishedAt": "2025-01-17T21:52:08Z",
      "title": "Israel prepares for hostages' return with scant knowledge of their condition",
      "url": "https://apnews.com/article/israel-gaza-war-hamas-ceasefire-hostages-fc917915b770487c8ea70f7ee05a7a42",
      "urlToImage": "https://dims.apnews.com/dims4/default/7856842/2147483647/strip/true/crop/8477x4768+0+441/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F09%2Fffec7193698e9c8b0d50d61ca8ba%2F23752901d12d4cb6931b3d299ce02c27"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Republican Gov. Jeff Landry says the “Make America Great Again” flag will be raised at the governor’s mansion in honor of President-elect Donald Trump’s inauguration. Landry also rescheduled a day of mourning and flag-lowering for Edward Pettifer, one of the victims of the New Orleans terror attack. Earlier this week, House Speaker Mike Johnson ordered flags at the U.S. Capitol to be raised to full height on Inauguration Day, interrupting a 30-day flag-lowering order after the death of former President Jimmy Carter last month. Other governors, mostly Republicans, have announced they will also raise flags on Inauguration Day.",
      "publishedAt": "2025-01-17T23:55:53Z",
      "title": "Louisiana governor to fly MAGA flag for Trump's inauguration",
      "url": "https://apnews.com/article/trump-inauguration-maga-flag-louisiana-governor-ffeef1888d4e9e1f87aafea86dee0d2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/567bc0c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F7c%2F9d3f204acf954816e3c05d6e2888%2Ff3666036eb804fc6ab2f5486b36e6c0f"
    },
    {
      "author": null,
      "description": "Russia attacked the Ukrainian capital with a barrage of drones and missiles Saturday, leaving at least four people dead, while industrial sites in Russia were set ablaze by Ukrainian strikes. Four people were killed in the Shevchenkivskyi district, said Kyiv City Military Administration head Timur Tkachenko on Saturday. The city's mayor, Vitali Klitschko, also said that windows were broken and there was smoke at the entrance of a residential building. He also said the Lukyanivska metro station was shuttered after the attacks damaged its glass entrance.",
      "publishedAt": "2025-01-18T07:01:41Z",
      "title": "Russian attack kills 4 people in Kyiv as Ukrainian drone strikes set Russian fuel stores alight",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-drones-missiles-ff186b035b953470587ae941a4a7fd0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/86e91e1/2147483647/strip/true/crop/7875x4430+0+410/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F7b%2Fb578cfdf0c59ca4194a960fc283a%2F1a287a32975f4dd8b71f7da31ab41dca"
    },
    {
      "author": "JOHN LOCHER",
      "description": "A quick-strike crew of Native American firefighters and journeymen utility workers from the Navajo Nation are helping Los Angeles residents cut through landslides, mangled trees and charred debris of the Eaton Fire that rampaged though the Los Angeles area. The Navajo Scouts have spent eight days battling the fire. For the Navajo utility workers, their work means they're able to reciprocate after Los Angeles Department of Water & Power helped electrify 170 remote households on the Navajo Nation in a yearslong mission. The Southern California fires have killed at least 27 people, destroyed more than 12,000 structures and put more than 80,000 under evacuation orders.",
      "publishedAt": "2025-01-18T05:10:56Z",
      "title": "Navajo Nation firefighters battle wildfires in Los Angeles",
      "url": "https://apnews.com/article/navajo-scouts-firefighters-southern-california-f0e50604c9a7e6609da50775725330e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/68c0c84/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fc6%2Ff5fd913e530c81623bb2f9079e8b%2Fbd0e66053d8941d7a5522e7a01d2d29f"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Donald Trump is returning to Washington to kick off days of pageantry to herald his second inauguration as president. Trump will leave his Florida home Saturday and fly to the nation's capital. He will attend an evening reception and fireworks show at Trump National Golf Club in Sterling, Virginia. On Sunday, Trump is scheduled to participate in a wreath-laying ceremony at Arlington National Cemetery before heading to a rally at Capital One Arena in Washington. On Monday, he will be sworn in inside the U.S. Capitol because of the cold weather.",
      "publishedAt": "2025-01-18T05:04:58Z",
      "title": "Trump to arrive in Washington for inaugural celebrations marking his return to power",
      "url": "https://apnews.com/article/trump-inauguration-return-to-washington-1389014f70bd04793a8dbc83048bba07",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d6041b/2147483647/strip/true/crop/7527x4234+0+392/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fb9%2F37cba23d34c60bbb29e4e8fa1756%2Ff74391e06a2549a7b831984b4bcd67c2"
    },
    {
      "author": null,
      "description": "Nearly eight years since its historic first march, the Women’s March is returning to the nation's capital just before President-elect Donald Trump’s inauguration. Rebranded and reorganized, Saturday's rally has a new name — the People’s March — as a means to broaden support. The march is expected to be about one-tenth that size of the first Women's March in 2017 and comes amid a restrained moment of reflection as many progressive voters navigate feelings of exhaustion, disappointment and despair after Vice President Kamala Harris’ loss in November. A goal of the organizers is to help progressive voters find their political homes in various participating organizations at the local, state and national level.",
      "publishedAt": "2025-01-18T05:06:08Z",
      "title": "Thousands are converging on Washington for a march days before Trump takes office",
      "url": "https://apnews.com/article/peoples-march-reproductive-rights-climate-immigration-democracy-a8c0d6a1351bb03f4b2b6436fa79fe58",
      "urlToImage": "https://dims.apnews.com/dims4/default/237d708/2147483647/strip/true/crop/4813x2707+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fdc%2Fbf297f4f1e98e6f9324aeba9d2b0%2F6bdecde309224e9d9bdb8949508cbcd2"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "Some of the same Donald Trump supporters who stormed the U.S. Capitol four years ago are allowed to return to Washington, D.C., on Monday to celebrate the Republican's return to the White House. An Associated Press review of court records found that at least 19 defendants charged with or convicted of joining the Jan. 6, 2021, riot have asked federal judges for permission to attend Trump’s second inauguration. Most of them can go. Several others cannot. In most cases, Justice Department prosecutors argued that Capitol riot defendants shouldn’t be allowed to return to the scene of their crimes while they’re under the court’s supervision.",
      "publishedAt": "2025-01-18T05:07:18Z",
      "title": "Judges let some Capitol riot defendants attend Trump's inauguration",
      "url": "https://apnews.com/article/trump-inauguration-capitol-riot-pardons-ea4469b47bd7d4b1d9feba5fd448dc94",
      "urlToImage": "https://dims.apnews.com/dims4/default/67f4ee1/2147483647/strip/true/crop/3938x2215+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F21%2F47df090f1a6423c1031908608451%2F8b9ad23b24604a2ab83c8dc55cf1eb93"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "President-elect Donald Trump has yet to take office, but his influence already is rippling through state capitols. Republican governors have announced Trump-themed policies on immigration, crime and anti-diversity initiatives in states including Florida, Missouri, Tennessee and West Virginia. Others have imitated Trump's “Department of Government Efficiency” by creating their own panels aimed at shrinking state government. Some Democratic governors also are tapping into the themes Trump used to get elected, such as New York's governor proposing tax cuts and public safety changes.",
      "publishedAt": "2025-01-18T05:10:55Z",
      "title": "Trump's influence rippling through state capitols",
      "url": "https://apnews.com/article/trump-states-governors-doge-flags-immigration-4cdec264a564427e1d2b5468f2e03b06",
      "urlToImage": "https://dims.apnews.com/dims4/default/1438ed7/2147483647/strip/true/crop/4834x2719+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F5a%2F925d7b0c8d944f5803267062556b%2Fa84d8adc85cb4ce2aceaaee5e7af081e"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "TikTok arrived in the U.S. almost 6 1/2 years ago. The possibility the U.S. would outlaw the video-sharing app has kept influencers and users in anxious limbo for more than four of the years since then. Now, the moment its fans dreaded is here, but uncertainty over TikTok’s future lingers. On Friday, the Supreme Court upheld a federal law that bans the social media platform starting Sunday unless its China-based parent company sells to an approved buyer. An official says the Biden administration plans to leave the law’s implementation to President-elect Donald Trump, who takes office Monday. During its short life, TikTok has been both a global cultural phenomenon and the subject of political wrangling.",
      "publishedAt": "2025-01-18T05:07:43Z",
      "title": "The rise - and potential fall - of TikTok in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-supreme-court-36c3c3b42f743a35c69e1c74341f1f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae6eb1d/2147483647/strip/true/crop/3000x1688+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F83%2F4f60ee36f017f9afad99ea82ca35%2F1a89d699dc0448b4a1d47a79dbbe7f1e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}