{
  "articles": [
    {
      "author": null,
      "description": "Health officials in Gaza say Israeli strikes have killed at least 34 Palestinians. The bloodshed comes a day after Israel eased aid restrictions due to a worsening humanitarian crisis. On Sunday, Israel announced a pause in military operations in certain areas for 10 hours daily to improve aid flow. Despite these measures, Israel continues military operations outside the pause timeframe. Aid agencies welcomed the new measures but say they are insufficient. Images of emaciated children have sparked global outrage. Most of Gaza's population now relies on aid and accessing food has become increasingly dangerous.",
      "publishedAt": "2025-07-28T09:01:28Z",
      "title": "Israeli strikes in Gaza kill at least 34 people as some aid restrictions are eased",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-28-2025-7586cb243643b9a875f87624277127b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef65979/2147483647/strip/true/crop/3916x2203+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fd7%2Fb5304ad9ad45e009cf92dd6d990a%2F3f92071cce3b41a5a579f0cf915b65f4"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu says no one in Gaza is starving. President Donald Trump disagrees and notes the images emerging of emaciated people. Trump says “those children look very hungry.” Here’s what we know as the World Health Organization says 63 of the 74 malnutrition-related deaths in Gaza this year have occurred this month. Those included 24 children under the age of 5. After international pressure, Israel over the weekend announced humanitarian pauses, airdrops and other measures meant to allow more aid to Palestinians in Gaza. But people there say little or nothing has changed on the ground.",
      "publishedAt": "2025-07-28T20:25:47Z",
      "title": "Witnesses and data say malnutrition-related deaths in Gaza have shot up",
      "url": "https://apnews.com/article/gaza-starvation-israel-palestinians-aid-netanyahu-war-5315b1bdf244a21790a056570bb0ae19",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c5cfbf/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F70%2F5bcd6bc702191bafaa465613c18a%2F4e09f4354e3f4fb2a4b7a2ac7ee4a87d"
    },
    {
      "author": null,
      "description": "At least two people, including a New York City police officer, have been shot in Manhattan office building. That's according to person familiar with the matter who was not authorized to publicly discuss the ongoing investigation and spoke to AP on condition of anonymity. The person did not immediately know the victims' conditions. The office building houses some of the country’s top financial firms and the National Football League. The Fire Department of New York says emergency crews were called to the Park Avenue office building Monday evening for a report of someone shot.",
      "publishedAt": "2025-07-28T23:05:36Z",
      "title": "At least 2 people shot at Manhattan office building housing financial firms and NFL, source tells AP",
      "url": "https://apnews.com/article/new-york-city-shooting-nfl-building-274f8b4f6147d21298a08f8003ef13c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dd0d09/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Ff0%2F93e27924aafebe2638b3b5a5ff66%2Fffc741809e884b31806b9727dff702c1"
    },
    {
      "author": null,
      "description": "Officials say a man with a rifle killed an off-duty New York City police officer and three other people before taking his own life at a Manhattan office tower. Law enforcement officials are working to unravel what took place on Monday and determine why the location may have been targeted. The city had recently announced it was on pace to have its fewest murders and fewest people hurt by gunfire than any year in recent decades. Shane Tamura, of Las Vegas, was identified as the gunman by police, although his motive and reasoning for targeting the building was not immediately clear.",
      "publishedAt": "2025-07-29T04:14:07Z",
      "title": "NYC shooting: What we know so far about the shooting and the gunman",
      "url": "https://apnews.com/article/new-york-city-shooting-killed-0d002f9e3a3fdab7d7ad93616d42e865",
      "urlToImage": "https://dims.apnews.com/dims4/default/8564470/2147483647/strip/true/crop/4800x2700+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F74%2F8fca2e63efa1a92442ce2acab911%2Fcf6345883bde4ae8809b1a65bbc4517f"
    },
    {
      "author": null,
      "description": "President Donald Trump says his friendship with Jeffrey Epstein ended after Epstein hired people who had worked for Trump. The Republican president said Monday that he had warned Epstein about hiring Trump staff and that when Epstein did it again, “I threw him out of the place.” The place Trump refers to is his Mar-a-Lago club in Palm Beach, Florida. Authorities say the disgraced financier killed himself in a New York jail cell in 2019 as he awaited trial on sex trafficking charges. The case has dogged Trump after he and his top allies stoked conspiracy theories about Epstein's death.",
      "publishedAt": "2025-07-28T18:43:03Z",
      "title": "Trump says he ended friendship with Jeffrey Epstein during Scotland visit",
      "url": "https://apnews.com/article/trump-epstein-friendship-scotland-falling-out-a9896c04fcf932f232f1b319154eb800",
      "urlToImage": "https://dims.apnews.com/dims4/default/e179e48/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F80%2F1261f4c28f41226b8aa572617abd%2Fd185e32d376a4366b7816f174a6ce287"
    },
    {
      "author": null,
      "description": "Matthew Kolakowski was shopping with his daughter at a Michigan Walmart when he heard screams and saw a man with a knife. Authorities have since identified the suspect as Bradford Gille. He is charged with terrorism and attempted murder, accused of stabbing 11 people at the Traverse City store on Saturday. Kolakowski, a disabled veteran, says he and other shoppers managed to disarm and restrain the man with the knife until police arrived. The victims all are expected to survive. At his arraignment Monday, Gille seemed agitated. A not-guilty plea was entered for him. Bond was set at $100,000.",
      "publishedAt": "2025-07-28T23:44:59Z",
      "title": "Strangers confront a man and end stabbing spree that injured 11 at a Michigan Walmart",
      "url": "https://apnews.com/article/michigan-walmart-stabbing-matthew-kolakowski-3f231b61026b7d137ce7903a8327db49",
      "urlToImage": "https://dims.apnews.com/dims4/default/059b0b2/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F6b%2Feae9d7a8956cd27c9456f7e19885%2F0f40ebae35d8462ebcc8c522f920c001"
    },
    {
      "author": null,
      "description": "Police in Nevada say a gunman opened fire just outside a casino and resort in Reno and shot multiple people. The conditions of the victims were not immediately known. Reno police spokesperson Chris Johnson said the gunman was taken into custody Monday and was being treated at a hospital. Johnson says the shooting was reported around 7:30 a.m. Monday outside the casino in the valet area. Reno police warned residents to stay out of the vicinity. Multiple emergency vehicles, including several ambulances, responded outside the casino.",
      "publishedAt": "2025-07-28T16:00:03Z",
      "title": "Multiple injuries reported in Reno Grand Sierra Resort shooting and suspect is in custody",
      "url": "https://apnews.com/article/reno-nevada-grand-sierra-resort-shooting-e8892d51ec4dd2d61b507012773a8c4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/93d0468/2147483647/strip/true/crop/2000x1125+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F6b%2Fb5be04bea301db0e35cfa87ef398%2F81ec8d5d53ec4a7da2e22ebf6261a5bb"
    },
    {
      "author": null,
      "description": "Two kids have died, and two others are in critical condition after a barge reportedly struck their sailing boat near Miami. Authorities say six people were on the boat Monday, and responders pulled them from the water. According to the U.S. Coast Guard, four were taken to a nearby hospital. The group included five kids and one adult who were part of the Miami Youth Sailing Foundation. Two of the rescued individuals are in good condition. The Coast Guard is investigating the crash.",
      "publishedAt": "2025-07-28T18:38:45Z",
      "title": "2 kids killed at Miami sailing camp after barge collides with their boat, authorities say",
      "url": "https://apnews.com/article/boat-crash-rescue-kids-star-island-miami-daa055e70c9529df65a05b7b0c2bc767",
      "urlToImage": "https://dims.apnews.com/dims4/default/31bb881/2147483647/strip/true/crop/2955x1662+12+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fba%2F7ccbf4f9806ee76a4a685a284a1f%2Fcd9a2671191e4800a3ff0b9751bd88fd"
    },
    {
      "author": null,
      "description": "Former Colombian President Álvaro Uribe has been found guilty of witness tampering and bribery charges in a historic trial that gripped the South American nation and threatened to tarnish the conservative strongman’s legacy. The ruling was announced on Monday by a judge in Bogota, the country’s capital, following a nearly six-month trial in which prosecutors presented evidence that Uribe attempted to influence witnesses who accused the law-and-order leader of having links to a paramilitary group founded by ranchers in the 1990s. Uribe faces up to 12 years in prison and the sentencing will be delivered in a separate hearing. He is expected to appeal the ruling in a high court.",
      "publishedAt": "2025-07-29T00:11:25Z",
      "title": "Former Colombian President Uribe found guilty in bribery trial that threatens the strongman's legacy",
      "url": "https://apnews.com/article/colombia-uribe-trial-c5d7fa2bb152ef57f3dab83011e052db",
      "urlToImage": "https://dims.apnews.com/dims4/default/d09706b/2147483647/strip/true/crop/8162x4591+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Ffb%2Fcb67306436e69653e0faf554ed68%2Ff1a2ef41e17540b2a69e003b4c7cc1c7"
    },
    {
      "author": null,
      "description": "Chinese state media say that 30 people have died in heavy rains and flooding in Beijing. State broadcaster CCTV said on Tuesday that 28 people had died in Beijing’s hard-hit Miyun district and two others in Yanqing as of midnight. More heavy rain fell overnight in the Chinese capital. Reports on Monday said heavy rains and flooding killed four people, with eight other still missing. The victims were caught in a landslide in Hebei province. That brings the death toll from the storms to at least 34 people.",
      "publishedAt": "2025-07-28T07:02:47Z",
      "title": "30 people die in heavy rains and flooding in Beijing",
      "url": "https://apnews.com/article/china-beijing-hebei-floods-tianjin-a4b948153bd59fc3614ac8765b44e0e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/918a11d/2147483647/strip/true/crop/8499x4781+0+443/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Fe9%2Faa6995b92e63afb4c345441d55de%2F69f824e573e3457ab985b6eff9942e05"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}