{
  "articles": [
    {
      "author": "CHRIS MEGERIAN and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Declaring that U.S. leadership \"holds the world together,” President Joe Biden told Americans on Thursday night the country must deepen its support of Ukraine and Israel in the middle of two vastly different, unpredictable and bloody wars.",
      "publishedAt": "2023-10-19T16:28:36Z",
      "title": "Biden declares Israel and Ukraine support is vital for US security, will ask Congress for billions",
      "url": "https://apnews.com/49354728b347178a4bf7508a0dc8f1d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f74c7d31adc4ff1b2ef949a84d4a555/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel pounded the Gaza Strip with airstrikes Thursday, including in the south where Palestinians were told to take refuge, as the Israeli defense minister ordered ground troops to prepare to see Gaza “from the inside”, though he didn’t indicate when the ground assault would begin.",
      "publishedAt": "2023-10-19T07:59:07Z",
      "title": "As Israel readies troops for ground assault, Gaza awaits urgently needed aid from Egypt",
      "url": "https://apnews.com/b084e9c453cc99f7bec6f66d7b5913d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/132381cec4a0417a9c390ca37f723d54/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN and JACK JEFFERY",
      "description": "CAIRO (AP) — President Joe Biden says he struck a deal with his Egyptian counterpart to allow a first run of 20 trucks carrying humanitarian aid to enter Gaza, which Israel sealed off after the Hamas attack on Oct.",
      "publishedAt": "2023-10-19T18:51:35Z",
      "title": "'Drop in the ocean': UN-backed aid could soon enter Gaza from Egypt, but only at a trickle for now",
      "url": "https://apnews.com/4ecadba7ae32d755e4680ffa237460f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19b3748c87ba47e6ae6ede821a0f73cd/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI, STEPHEN GROVES and KEVING FREKING",
      "description": "WASHINGTON (AP) — Refusing to give up, Rep. Jim Jordan told GOP colleagues Thursday he was still running for the House gavel — leaving Republicans few viable options after his hardline backers resisted a plan to expand the temporary speaker's powers to re-open the House.",
      "publishedAt": "2023-10-19T04:07:42Z",
      "title": "GOP's Jordan says he's still running for House gavel, but plan for a temporary speaker falls flat",
      "url": "https://apnews.com/abdef873a8d14979848b658e4ef46fd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea8dc9a94281482c9cb9ca8ff2506822/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and ERIC TUCKER",
      "description": "WASHINGTON (AP) — An Army private who fled to North Korea before being returned home to the United States last month has been detained by the U.S.",
      "publishedAt": "2023-10-20T02:02:43Z",
      "title": "Army private who fled to North Korea charged with desertion, held by US military, officials tell AP",
      "url": "https://apnews.com/14794185ea3dfc197a86ba376b1626ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a27e74dceb9497a94c21826211f259d/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Lawyer Sidney Powell pleaded guilty to reduced charges Thursday over efforts to overturn Donald Trump’s loss in the 2020 election in Georgia, becoming the second defendant in the sprawling case to reach a deal with prosecutors.",
      "publishedAt": "2023-10-19T14:06:14Z",
      "title": "Sidney Powell pleads guilty over efforts to overturn Trump's loss in Georgia and agrees to cooperate",
      "url": "https://apnews.com/ec7dc601ad78d756643aa2544028e9f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c09dd91602ec4626ba6256f84901ebd1/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The spotlight at former President Donald Trump's civil fraud trial turned Thursday to his son Eric, with testimony and documents suggesting the scion envisioned a “lofty” value for a suburban golf course and was actively involved in appraisals he has said he doesn't remember.",
      "publishedAt": "2023-10-19T19:48:34Z",
      "title": "At Donald Trump's civil trial, appraiser recalls Eric Trump's 'lofty' views on property value",
      "url": "https://apnews.com/3b367d170ed036b08210bf539c7a554e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4eb7be341e164f95855ade1633670222/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — Federal regulators on Thursday approved the expansion of a natural gas pipeline in the Pacific Northwest over the protest of environmental groups and top officials in West Coast states, who said it goes against the region’s plans to address climate change and could pose a wildfire risk.",
      "publishedAt": "2023-10-19T16:34:43Z",
      "title": "Feds OK natural gas pipeline expansion in Pacific Northwest over environmentalist protests",
      "url": "https://apnews.com/5e9c79c412b407ddc9bcb21c1ff8ee26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39f0410916db4ae398be262f37004807/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "BIRMINGHAM, Ala. (AP) — Beth Holloway was after one thing for 18 years: answers about what happened to her missing daughter.She said she got them Wednesday when Joran van der Sloot, long considered the chief suspect in her daughter’s 2005 disappearance in Aruba, admitted in submitted court filings to bludgeoning Natalee Holloway to death on a beach and dragging her body out to sea.",
      "publishedAt": "2023-10-19T05:12:36Z",
      "title": "Joran van der Sloot's confession in Natalee Holloway case provides long-sought answers, mother says",
      "url": "https://apnews.com/eab59b1e91aad341cc3a77949cfe80df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0546ace785d44e33a57deb1e57142000/1920.jpeg"
    },
    {
      "author": "DAVID BRANDT",
      "description": "PHOENIX (AP) — More than 15 minutes after the game, Ketel Marte stood at his clubhouse locker, gulping water while trying to finally catch his breath after delivering the Arizona Diamondbacks' latest clutch postseason moment.",
      "publishedAt": "2023-10-20T00:12:19Z",
      "title": "Marte hits walk-off single in ninth, D-backs beat Phillies 2-1 and close to 2-1 in NLCS",
      "url": "https://apnews.com/9de8d9035a7dfa4293fb1f9177494d3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84882cd92aac4113b1bdcc95d680ce1b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}