{
  "articles": [
    {
      "author": "SEUNG MIN KIM, JILL COLVIN and COLLEEN LONG",
      "description": "BROWNSVILLE, Texas (AP) — On the banks of the same Rio Grande but 300 miles apart, President Joe Biden and GOP challenger Donald Trump on Thursday surveyed the U.S.-Mexico border and tussled from a distance over who is to blame for the nation's broken immigration system and how to fix it.",
      "publishedAt": "2024-02-29T05:10:02Z",
      "title": "On the Rio Grande, 300 miles apart, Biden and Trump try to use immigration to election advantage",
      "url": "https://apnews.com/42c945d02742b169bde40601a27fde02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bc09a2a04a042b89b9be3fbd87a5683/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Turkey has joined Saudi Arabia, Egypt and Jordan in condemning Israeli forces firing on Palestinians waiting for the delivery of aid, with its foreign ministry calling the event “yet another crime against humanity.”",
      "publishedAt": "2024-03-01T08:00:18Z",
      "title": "The Latest | Condemnation of Israel's actions in Gaza grows after dozens killed while seeking aid",
      "url": "https://apnews.com/b94d426cddfa0b9dcf3d1574a6a81ec6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/178ba54df24f46ffab5d8e78abdc66b3/1600.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "DUBAI, United Arab Emirates (AP) — Iran on Friday held the country's first parliamentary election since the mass 2022 protests over mandatory hijab laws after the death in police custody of Mahsa Amini, with questions looming over just how many people will turn out at the polls.",
      "publishedAt": "2024-03-01T04:31:22Z",
      "title": "Iran votes in its first parliament election since 2022 protests as questions over turnout loom",
      "url": "https://apnews.com/64c628103ff5d193da974c25a13fbb12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a1e1d5ac22a4e0287491f68a999c2d4/1920.jpeg"
    },
    {
      "author": "KATIE MARIE DAVIES",
      "description": "Hundreds of people gathered to bid farewell to Alexei Navalny at a funeral Friday in Moscow under a heavy police presence, following a battle with authorities over the release of his body after his still-unexplained death in an Arctic penal colony.",
      "publishedAt": "2024-03-01T05:02:54Z",
      "title": "Navalny's family and supporters are laying the opposition leader to rest after his death in prison",
      "url": "https://apnews.com/9263c4d0688b883fa9f853f5d0310e45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b2bbdaa234b47b983bac64fdadc9b2a/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "STINNETT, Texas (AP) — As the largest wildfire in Texas history engulfed his town, Danny Phillips was left helpless.“We had to watch from a few miles away as our neighborhood burned,” he said, his voice trembling with emotion.",
      "publishedAt": "2024-03-01T05:12:37Z",
      "title": "Some left helpless to watch as largest wildfire in Texas history devastates their town",
      "url": "https://apnews.com/fa792a7ad71808c0ca8ec758941e68c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/797924dd553847318891024dce969368/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, ADRIANA GOMEZ LICON and FREIDA FRISARO",
      "description": "FORT PIERCE, Fla. (AP) — The federal judge overseeing the classified documents prosecution of Donald Trump is expected to set a trial date on Friday, a crucial decision that could affect whether the former president and leading Republican candidate faces a jury this year on charges that he hoarded top secret records and hid them from government investigators.",
      "publishedAt": "2024-03-01T05:05:46Z",
      "title": "Judge in Trump's classified documents case expected to set trial date during crucial hearing",
      "url": "https://apnews.com/37c55a10c4ae304eb673292145cc9cf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae3f905b5d8d4fcbbeaa06301665c3df/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — After several days of extraordinary testimony, the judge in the Georgia election interference case against former President Donald Trump is set to hear arguments Friday over whether Fulton County District Attorney Fani Willis should be removed from the prosecution over a romantic relationship.",
      "publishedAt": "2024-03-01T05:06:42Z",
      "title": "With salacious testimony finished, legal arguments to begin over Fani Willis' future in Trump case",
      "url": "https://apnews.com/0ede9d18ae072efd6d71f38ea4705beb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e359af32b66e47c19c30b7a19f7caa61/3000.jpeg"
    },
    {
      "author": null,
      "description": "DHAKA, Bangladesh (AP) — A six-story shopping mall that caught fire in the Bangladeshi capital had no fire exits, the country's prime minister said Friday, as the death toll climbed to at least 46 and rescuers continued to search for more victims.",
      "publishedAt": "2024-03-01T10:02:28Z",
      "title": "Bangladeshi leader says a shopping mall that caught fire had no emergency exits. Death toll climbs",
      "url": "https://apnews.com/32b7fee567511126776d074ddd2d614c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61bb8213abec498f97582230f39692a4/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Campaigning formally starts Friday for Mexico's biggest election in history.Voters will choose the president, along with the winners of 628 seats in Congress and tens of thousands of local positions.",
      "publishedAt": "2024-03-01T05:18:23Z",
      "title": "Mexico is about to have its biggest election ever. Here's what to know",
      "url": "https://apnews.com/d104184b02bf5bcf9e08f570a5ba37e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00aa7ef5b33b476bba43f7466c83de83/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER AND OLGA R. RODRIGUEZ",
      "description": "RENO, Nev. (AP) — The most powerful Pacific storm of the season is forecast to bring up to 10 feet (3 meters) of snow into the Sierra Nevada by the weekend, forcing residents to take shelter and prompting at least one Lake Tahoe ski resort to close Friday.",
      "publishedAt": "2024-03-01T05:57:30Z",
      "title": "Parts of the Sierra Nevada likely to get 10 feet of snow from powerful storm by weekend",
      "url": "https://apnews.com/7f8892b9f253848b47fa15b8a135b569",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/037ff02d5361454ba1c35fdab1ffb44d/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}