{
  "articles": [
    {
      "author": "JILL COLVIN and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former President Donald Trump began his day as a criminal defendant lashing out at the judge and prosecutors, casting himself as a victim and angrily posting on social media.",
      "publishedAt": "2024-04-16T01:10:20Z",
      "title": "Donald Trump brings his campaign to the courthouse as his criminal hush money trial begins",
      "url": "https://apnews.com/833ca03359cb76331f16580ac04e398e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/305de40f7cbb412f9ad6ce9307a37d82/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — The first criminal trial facing former President Donald Trump is also the one in which Americans are least convinced he committed a crime, a new AP-NORC Center for Public Affairs Research poll finds.",
      "publishedAt": "2024-04-16T04:02:27Z",
      "title": "Only 1 in 3 US adults think Trump acted illegally in New York hush money case, AP-NORC poll shows",
      "url": "https://apnews.com/b3d9a555993faf22e6ebfaf798bfbd2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d00179105f7c4eb280c74bb5c89e1d0c/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israel’s military chief said Monday that his country will respond to Iran’s weekend attack, but he did not elaborate on when and how as world leaders urged against retaliation, trying to avoid a spiral of violence in the Middle East.",
      "publishedAt": "2024-04-15T17:38:44Z",
      "title": "Israel’s military chief says that Israel will respond to Iran’s weekend missile attack",
      "url": "https://apnews.com/aec3627b0b19b42dcafc89a7408dc296",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c18b022b90aa4078893cbb260b2a91a7/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military renewed warnings on Monday for Palestinians not to return to northern Gaza, a day after witnesses and medical officials said Israeli troops opened fire and killed five people among throngs of displaced residents trying to walk back to their homes in the devastated area.",
      "publishedAt": "2024-04-15T10:20:35Z",
      "title": "Israeli military tells Palestinians not to return to north Gaza after witnesses say troops killed 5",
      "url": "https://apnews.com/5d6b5dc1483771045113eea2c1904449",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df72ae7804643f8ba7605e82a8acf1d/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson is pushing toward action this week on aid for Israel, Ukraine and Taiwan, unveiling an elaborate plan Monday to break the package into separate votes to squeeze through the House's political divides on foreign policy.",
      "publishedAt": "2024-04-15T20:54:26Z",
      "title": "House Speaker Mike Johnson pushes towards a vote on aid for Israel, Ukraine and Taiwan",
      "url": "https://apnews.com/42a2f281a5437beaa8af4c3345987637",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15f75452699941f8963db41b44ab37f8/3000.jpeg"
    },
    {
      "author": "MANISH SWARUP",
      "description": "NEW DELHI (AP) — Raj Sud, 94, has voted in almost every election held in independent India, bearing witness to the eventful journey of a diverse, and now the world’s most populous, democracy over the last 76 years.",
      "publishedAt": "2024-04-16T04:13:00Z",
      "title": "AP PHOTOS: What's on the voters’ minds as India heads into a 6-week national election",
      "url": "https://apnews.com/79038bb02d02679ec7cff91a4b30e1e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bd91ebbf71f424ca3a3fca58383ab78/3000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "SPARROWS POINT, Md. (AP) — Nearly three weeks since Baltimore’s Francis Scott Key Bridge collapsed under the impact of a wayward cargo ship, crews are using the largest crane on the Eastern Seaboard to haul the wreckage to a nearby salvage yard.",
      "publishedAt": "2024-04-16T05:05:59Z",
      "title": "Salvage crews race against the clock to remove massive chunks of fallen Baltimore bridge",
      "url": "https://apnews.com/1f536d3dcf6f4af7352a9e9bba21eea9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6680755a3d9a4d8bb30d6cb15f0f6aec/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — The giant stuffed bear, its face a twisted smile, lumbers across the screen. Menacing music swells. Shadows mask unknown threats. Christopher Robin begs for his life. And is that a sledgehammer about to pulverize a minor character's head?",
      "publishedAt": "2024-04-16T04:03:45Z",
      "title": "Characters enter the public domain. Winnie the Pooh becomes a killer. Where is remix culture going?",
      "url": "https://apnews.com/c0c7c5815f7993fe16978bfd948105e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fc09d4d37fd403aa14067d716ec701a/2084.jpeg"
    },
    {
      "author": "ZEN SOO",
      "description": "HONG KONG (AP) — China’s economy expanded at a faster than expected pace in the first three months of the year, helped by policies aimed at stimulating growth and stronger demand, the government said Tuesday.",
      "publishedAt": "2024-04-16T02:15:32Z",
      "title": "China's economy grew 5.3% in first quarter, beating expectations",
      "url": "https://apnews.com/a0743b0982996194c07713c5c701918f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2b7ed4c956947e2a9d66b1a65681ed7/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "NEW YORK (AP) — Caitlin Clark admitted she was a bit nervous before being chosen with the No. 1 pick in the WNBA draft by the Indiana Fever, even though it was no surprise.",
      "publishedAt": "2024-04-15T17:10:46Z",
      "title": "Caitlin Clark taken No. 1 in the WNBA draft by the Indiana Fever, as expected",
      "url": "https://apnews.com/6aa5dddaedbe7da5a2b147da6d39e832",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96858a03fdc54994b745fc65c5e8acd0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}