{
  "articles": [
    {
      "author": "JAIMIE DING, JANIE HAR and JULIE WATSON",
      "description": "LOS ANGELES (AP) — A wildfire whipped up by extreme winds swept through a Los Angeles hillside dotted with celebrity residences Tuesday, burning homes in Pacific Palisades and prompting evacuation orders for tens of thousands.",
      "publishedAt": "2025-01-07T06:10:15Z",
      "title": "California governor says Pacific Palisades wildfire has destroyed many structures as winds kick up",
      "url": "https://apnews.com/c48661615061eb631784b666cddfa4ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbfe29866b874397a84ddf28f6c6e653/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "PALM BEACH, Fla. (AP) — President-elect Donald Trump on Tuesday said he would not rule out the use of military force to seize control of the Panama Canal and Greenland, as he declared U.S.",
      "publishedAt": "2025-01-07T17:14:56Z",
      "title": "Trump refuses to rule out use of military force to take control of Greenland and the Panama Canal",
      "url": "https://apnews.com/fa66f8d072eb39c00a8128a8941ede75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d97618cdf414b89b578dd336c0144cd/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge on Tuesday temporarily blocked the public release of special counsel Jack Smith's report on investigations into Donald Trump as an appeals court weighs a challenge to the disclosure of a much-anticipated document just days before the president-elect reclaims office.",
      "publishedAt": "2025-01-07T13:13:49Z",
      "title": "Judge temporarily blocks release of special counsel report on Trump cases as court fight simmers",
      "url": "https://apnews.com/e73a42b03cc6dc807de32c42dc824f3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65c55c3c2a1643c79dc9ca734f3e6999/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and BEN FINLEY",
      "description": "NORFOLK, Va. (AP) — The plunging polar vortex brought subfreezing temperatures Tuesday to some of the southernmost points of the U.S., threatening to dump snow on parts of Texas and Oklahoma in coming days and contributing to a power outage in Virginia's capital that made the water unsafe to drink.",
      "publishedAt": "2025-01-07T06:05:02Z",
      "title": "The polar vortex brings its bitter cold to the Southern US",
      "url": "https://apnews.com/3d4a3826d070d9e84d69bbf2800198a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1615cfdad45243eaa5adc1bf36b79134/1920.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Rescue workers in the cold, high-altitude Tibet region in western China searched for more survivors and victims Wednesday, one day after a strong earthquake leveled thousands of houses and killed at least 126 people.",
      "publishedAt": "2025-01-08T04:13:42Z",
      "title": "Tents arrive for survivors of earthquake in high-altitude, wintry Tibet that killed 126",
      "url": "https://apnews.com/59a9f2e80c4ccede1ffcd962eb3e4488",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0efd6f100e4c4d29808918265c1bbbd2/3000.jpeg"
    },
    {
      "author": "BILL BARROW, JONATHAN J. COOPER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Nearly 44 years after Jimmy Carter left the nation's capital in humbling defeat, the 39th president returned to Washington on Tuesday for state funeral rites that featured the kind of bipartisan praise and ceremonial pomp the Georgia Democrat rarely enjoyed at his political peak.",
      "publishedAt": "2025-01-07T11:14:24Z",
      "title": "Jimmy Carter eulogized by Kamala Harris and others as 39th president returns to Washington",
      "url": "https://apnews.com/9200a643ca205719d94895c9a5deb36f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06b250bdbd384312aed0e5fc86c26261/1920.jpeg"
    },
    {
      "author": "MIKE CATALINI",
      "description": "The highly decorated soldier who exploded a Tesla Cybertruck outside the Trump hotel in Las Vegas used generative AI including ChatGPT to help plan the attack, Las Vegas police said Tuesday.Nearly a week after 37-year-old Matthew Livelsberger fatally shot himself, officials said according to writings, he didn't intend to kill anyone else.",
      "publishedAt": "2025-01-07T21:31:49Z",
      "title": "Man who exploded Tesla Cybertruck outside Trump hotel in Las Vegas used generative AI, police say",
      "url": "https://apnews.com/248b41d87287170aa7b68d27581fdb4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/343113f7c36d442cbbf29182c94ff8e9/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — The U.S. Justice Department is suing several large landlords for allegedly coordinating to keep Americans’ rents high by using both an algorithm to help set rents and privately sharing sensitive information with their competitors to boost profits.",
      "publishedAt": "2025-01-07T23:56:33Z",
      "title": "US Justice Department accuses six major landlords of scheming to keep rents high",
      "url": "https://apnews.com/0849c1cb50d8a65d36dab5c84088ff53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37f64308fa6b40aabb7f615c5bdfa6fe/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS, HUMERA LODHI and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — More Americans say immigration should be a top focus for the U.S. government in 2025, as the country heads toward a new Republican administration in which President-elect Donald Trump has promised the mass deportations of migrants and an end to birthright citizenship.",
      "publishedAt": "2025-01-07T12:07:01Z",
      "title": "Immigration is a higher priority for Americans than it was a year ago, an AP-NORC poll shows",
      "url": "https://apnews.com/e6cb1e8eaca01d315f56d6560f0cc332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f123c607da664e1ebac39d54c3aaad7a/3000.jpeg"
    },
    {
      "author": "DOUG GLASS",
      "description": "Strong winds that sent wildfires ripping through the mountains and foothills around Los Angeles on Tuesday fed a spectacle of smoke, flames and flight.Large flames\r\nVivid orange flames lit the sky in the Pacific Palisades neighborhood, where firefighters dragged hoses to meet blazes flaring up in brush dried out by persistent drought.",
      "publishedAt": "2025-01-07T23:21:15Z",
      "title": "See photos of fire, smoke and flight as wildfires race across Southern California",
      "url": "https://apnews.com/4b67b7f29d0d6eb7321a52ef60c17d60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ee18a49749f46ec96926a124b9f541a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}