{
  "articles": [
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — The mother of a student in class with the boy accused of killing four people in a Georgia high school shooting says information that school officials were warned that the boy was having a crisis shows the shooting could have been prevented.",
      "publishedAt": "2024-09-08T21:19:34Z",
      "title": "Mother's warning to Georgia school about suspect raises questions about moments before shooting",
      "url": "https://apnews.com/cbaf55d23ae14a68a2e70b9bd3f6dd29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d33736ce58d1414ebcd447fef3551cdf/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — From her earliest campaigns in California to her serving as President Joe Biden's running mate, Kamala Harris has honed an aggressive but calibrated approach to debates.",
      "publishedAt": "2024-09-09T04:02:54Z",
      "title": "Harris' past debates: A prosecutor's style with narrative flair but risks in a matchup with Trump",
      "url": "https://apnews.com/240d0978bd7d38d9757b5d314359b7d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e38fc71173f459a86e49083808d5b3c/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He claimed she would raise taxes and accused her of supporting open border policies that would allow an influx of unvetted migrants into the country. He blamed her for a litany of the current administration's failures and cast her potential presidency as four more years of the same.",
      "publishedAt": "2024-09-09T04:04:34Z",
      "title": "What the Trump-Clinton debates might tell us about Tuesday's match with Harris",
      "url": "https://apnews.com/fa04981a2d74df1fb2f269d54aaac081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efdb5b174d3441ac955957c35bc7294e/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — Pope Francis arrived in East Timor on Monday to encourage its recovery from a bloody and traumatic past and celebrate its development after two decades of independence from Indonesian rule.",
      "publishedAt": "2024-09-09T05:23:45Z",
      "title": "Pope arrives in deeply Catholic East Timor to encourage its recovery from bloody independence",
      "url": "https://apnews.com/324de6a22f78299cf4bc4b664fc50de9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9210e85f471d4b138311087a0785ed7d/3000.jpeg"
    },
    {
      "author": "MAHMOUD ILLEAN and NATALIE MELZER",
      "description": "ALLENBY CROSSING, West Bank (AP) — Three Israelis were shot and killed Sunday at the border crossing between the West Bank and Jordan, Israeli officials said, in what appeared to be an attack linked to the 11-month-old war in Gaza.",
      "publishedAt": "2024-09-08T07:27:02Z",
      "title": "Shooting attack at the West Bank-Jordan border crossing kills 3 Israelis",
      "url": "https://apnews.com/5278cf1f7ec254fb6ecca0f2758e7e3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe728306f8a4278aa726dcd6bfa3d3d/3000.jpeg"
    },
    {
      "author": "NAYARA BATSCHKE",
      "description": "SANTIAGO, Chile (AP) — Arms raised high. Banners denouncing the war in Gaza. Crowds united in song and wrapped in keffiyehs, the black-and-white checkered scarves that have become a badge of Palestinian identity.",
      "publishedAt": "2024-09-09T04:22:05Z",
      "title": "A Palestinian team in Chile offers soccer with a heavy dose of protest",
      "url": "https://apnews.com/1bdf2593993b39bd9527b5e6987319d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d960a9ad2704f759fced6679293b1f6/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — For millions of Venezuelans and dozens of foreign governments, Edmundo González was the undisputed winner of the country's July 28 presidential election.But on Sunday, he joined the swelling ranks of once-prominent government opponents who have fled into exile, leaving his political future uncertain and tightening Nicolás Maduro's grip on power.",
      "publishedAt": "2024-09-08T17:20:02Z",
      "title": "Opposition candidate burst into Venezuelan politics just months before being chased into exile",
      "url": "https://apnews.com/e819ef0671e938ae54643973a900af30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0e8c9a951554dbb8fc5065ff7087a02/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "LONDON, Ky. (AP) — As a grueling manhunt stretched into a third day Monday for a suspect in an interstate shooting that struck 12 vehicles and wounded five people, authorities vowed to keep up a relentless search as the stress level remained high for a rural area where some schools canceled classes.",
      "publishedAt": "2024-09-09T04:41:48Z",
      "title": "Authorities vow relentless search as manhunt for interstate shooter enters third day in Kentucky",
      "url": "https://apnews.com/12c876f065c5ce9e0265dd1b65e772f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ada518756448f79c9b0118c901a630/3000.jpeg"
    },
    {
      "author": "GABE STERN",
      "description": "OWYHEE, Nev. (AP) — The family placed flowers by a pair of weathered cowboy boots, as people quietly gathered for the memorial of the soft-spoken tribal chairman who mentored teens in the boxing ring and teased his grandkids on tractor rides.",
      "publishedAt": "2024-09-09T04:28:13Z",
      "title": "A remote tribe is reeling from widespread illness and cancer. What role did the US government play?",
      "url": "https://apnews.com/121a13698b876ddcd67b4a13b2ad830a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0946bfc7f40a4d04a4ae36c24f99b33f/3000.jpeg"
    },
    {
      "author": "ELSIE CHEN",
      "description": "WASHINGTON (AP) — A blockbuster new Chinese video game hailed as a milestone for the country’s gaming industry has put an unexpected spotlight on longstanding claims of rampant sexism in China’s male-dominated gaming culture.",
      "publishedAt": "2024-09-09T03:16:26Z",
      "title": "A blockbuster Chinese video game sparks debate on sexism in the nation’s gaming industry",
      "url": "https://apnews.com/f95cd1b9fc8fd20f9dafd1a43ec51048",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09d6e4c20dcd4f4bbeaf530b2b4227a2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}