{
  "articles": [
    {
      "author": "ROB MAADDI",
      "description": "LAS VEGAS (AP) — Patrick Mahomes, Travis Kelce and the Kansas City Chiefs are back-to-back Super Bowl champions.Mahomes threw a 3-yard touchdown pass to Mecole Hardman in overtime, and the Chiefs rallied to beat the San Francisco 49ers 25-22 on Sunday, becoming the first repeat Super Bowl champs in 19 years and ninth overall.",
      "publishedAt": "2024-02-12T03:50:48Z",
      "title": "Patrick Mahomes rallies the Chiefs to second straight Super Bowl title, 25-22 over 49ers in overtime",
      "url": "https://apnews.com/49b5dca51c05ab0f259cef0d7da76c2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ccc62aa87ac4af4821aaf8352d3a9ea/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and JOSEF FEDERMAN",
      "description": "RAFAH, Gaza Strip (AP) — The Israeli military said it rescued two hostages from captivity in the Gaza Strip early Monday, marking a small but symbolically significant success in its quest to bring home over 100 captives believed to be held by the Hamas militant group.",
      "publishedAt": "2024-02-12T02:48:20Z",
      "title": "The Israeli military says it has rescued 2 hostages from captivity in the Gaza Strip",
      "url": "https://apnews.com/4ade5edf47711c6b0c13d1380980de2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b951905f2de94bdb8dd6e5940feee6a1/1536.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — As chances rise of a Joe Biden-Donald Trump rematch in the U.S. presidential election, America’s allies are bracing for a bumpy ride.",
      "publishedAt": "2024-02-11T05:04:45Z",
      "title": "Allies fear the US is becoming less reliable, with growing concern over a possible Trump return",
      "url": "https://apnews.com/36e0d605c5fadd2887f6fe4c60f945a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fdb04e13fa74f6384e5b0c8dd051641/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A woman in a trenchcoat opened fire with a long gun Sunday inside celebrity pastor Joel Osteen’s megachurch in Texas, sending worshippers rushing to find safety while two off-duty officers confronted and killed the shooter.",
      "publishedAt": "2024-02-11T21:25:19Z",
      "title": "Woman killed after she opened fire in Joel Osteen's megachurch, boy with her shot, hospitalized",
      "url": "https://apnews.com/3415e1bac4582fb4e4d4ff5ea1c216bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/468bf2ab5ba940c2995fbfcd3ba84570/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — As former President Donald Trump and a growing number of Republicans oppose U.S.",
      "publishedAt": "2024-02-11T19:06:25Z",
      "title": "Senators push forward with Ukraine aid package as their leaders say the world is watching",
      "url": "https://apnews.com/13d5461154e2755510d7149a5af9b97a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0db0c715581f4b03944ff3be934fc09d/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian forces launched 45 drones over Ukraine in a five-and-a-half-hour barrage Sunday, officials said, as Ukrainian President Volodymyr Zelenskyy continued the reshuffle of his war cabinet as the war enters its third year.",
      "publishedAt": "2024-02-11T10:29:07Z",
      "title": "Russia launches barrage of 45 drones over Ukraine as Kyiv changes more military leaders",
      "url": "https://apnews.com/a8cfc77e01401e448e05c77e37b746c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/790cba8ce40b4a869ee6825bd44f40c9/3000.jpeg"
    },
    {
      "author": "VANESSA GERA and LORNE COOK",
      "description": "WARSAW, Poland (AP) — The head of the NATO military alliance warned Sunday that Donald Trump was putting the safety of U.S.",
      "publishedAt": "2024-02-11T15:47:14Z",
      "title": "NATO leader says Trump puts allies at risk by saying Russia can 'do whatever the hell they want’",
      "url": "https://apnews.com/277d1b30ba6fd0ee37ca626c59ab05ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6bf47e0613344779326d0afd8fb3e67/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin was hospitalized again Sunday to address a bladder issue as he continues to recover from prostate cancer and has transferred authorities to his deputy, the Pentagon said.",
      "publishedAt": "2024-02-11T21:58:25Z",
      "title": "Defense Secretary Austin hospitalized with bladder issue, transfers powers to his deputy",
      "url": "https://apnews.com/83e7184212e9dad1c86fe4686347f60b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/054f1e89a24542efab44e1aa0bd554ce/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WILMINGTON, Del. (AP) — First lady Jill Biden said in an email to campaign donors that she didn't know what the special counsel was trying to achieve when he suggested President Joe Biden could not remember when his son Beau died.",
      "publishedAt": "2024-02-11T03:43:44Z",
      "title": "First lady questions whether special counsel referenced son's death to score political points",
      "url": "https://apnews.com/9d14eaea2a414b91bbe891d71952c5e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23d98c20ee4847358c496fefea7c49ef/3000.jpeg"
    },
    {
      "author": "TOM ODULA, MUTWIRI MUTUOTA and GERALD IMRAY",
      "description": "NAIROBI, Kenya (AP) — Marathon world record-holder Kelvin Kiptum, who was set to be a superstar of long-distance running, was killed along with his coach in a car crash in Kenya late Sunday.Kiptum was 24 and had the world record he set last year at the Chicago Marathon ratified by international track federation World Athletics just last week.",
      "publishedAt": "2024-02-11T23:24:05Z",
      "title": "Marathon world record-holder Kelvin Kiptum, who was set to be a superstar, has died in a car crash",
      "url": "https://apnews.com/314b41c92c9166a3a698a2860fa3fc15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c4a91a6ffb343aa89998f3e761b6b54/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}