{
  "articles": [
    {
      "author": "BELA SZANDELSZKY and KAREL JANICEK",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — Slovakia’s populist Prime Minister Robert Fico was shot multiple times and gravely wounded Wednesday, but his deputy prime minister said he believed Fico would survive.",
      "publishedAt": "2024-05-15T13:08:10Z",
      "title": "Slovakia’s prime minister is expected to survive assassination attempt, deputy says",
      "url": "https://apnews.com/bdaaf0bba01035a700145a67d871a482",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bec8ee4c4ce64ae9a855537474e90a4d/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Slovakian Prime Minister Robert Fico was shot multiple times after a political event Wednesday afternoon, an episode of violence that punctuated his decades-long career in politics.",
      "publishedAt": "2024-05-15T15:10:55Z",
      "title": "Who is Robert Fico, the populist Slovak prime minister wounded in a shooting?",
      "url": "https://apnews.com/751051f2a36391919790c62d664a5e6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10ee483690c74c00a52f6be1b533c8f0/1920.jpeg"
    },
    {
      "author": "EMILY WANG FUJIYAMA and CHRISTOPHER BODEEN",
      "description": "BEIJING (AP) — China’s leader Xi Jinping welcomed Russia’s President Vladimir Putin on Thursday as he began a two-day state visit while Moscow presses forward with a new offensive in Ukraine, underscoring the close relationship between the autocratic leaders.",
      "publishedAt": "2024-05-15T12:00:15Z",
      "title": "Xi welcomes Russia's Putin on a state visit to China that's a show of unity between the allies",
      "url": "https://apnews.com/3212ef85d8318cf853f956173f3a682a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20e3494c3f3d484ba14ccc7b18266e56/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and ABBY SEWELL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Wednesday fended off criticism that he is not planning for a postwar reality in the Gaza Strip, saying it was impossible to prepare for any scenario in the embattled Palestinian enclave until Hamas is defeated.",
      "publishedAt": "2024-05-15T08:01:54Z",
      "title": "Netanyahu fends off criticism at home and abroad over his lack of a postwar plan for Gaza",
      "url": "https://apnews.com/e9696aa2da25e447219f2be0c1926b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28d7cc667e94e94ac97a7a460a90985/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — With prosecutors' hush money case against Donald Trump barreling toward its end, their star witness will be back in the hot seat Thursday as defense lawyers try to chip away at Michael Cohen's crucial testimony implicating the former president.",
      "publishedAt": "2024-05-16T04:01:37Z",
      "title": "Will jurors believe Michael Cohen? Defense keys on witness' credibility at Trump hush money trial",
      "url": "https://apnews.com/ec08be1219703deb3cd10604844deacb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0a763f491a443e0888582ced26bb844/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — The nonpartisan Commission on Presidential Debates, which has planned presidential faceoffs in every election since 1988, has an uncertain future after President Joe Biden and former President Donald Trump struck an agreement to meet on their own.",
      "publishedAt": "2024-05-16T04:13:53Z",
      "title": "The Commission on Presidential Debates faces an uncertain future after Biden and Trump bypassed it",
      "url": "https://apnews.com/01a7cfe1817dc110d14635536f1f86b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d8c90cc8a94d8db5b715aec54772d4/3000.jpeg"
    },
    {
      "author": "TARA COPP and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — In 2020, the top enlisted leader of the Air Force went public with his fear of waking up to the news that a Black airman had been killed by a white police officer.",
      "publishedAt": "2024-05-16T04:11:33Z",
      "title": "Florida deputy's killing of Black airman renews debate on police killings and race",
      "url": "https://apnews.com/c7ed2a69f5a3c2365486e50750fe6e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd7e9891eb75468986a1484888181978/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "TOPEKA, Kan. (AP) — The lesson on diversity started slowly in a first-grade classroom in Topeka, where schools were at the center of the case that struck down segregated education.“I like broccoli.",
      "publishedAt": "2024-05-16T04:09:05Z",
      "title": "Topeka was at the center of Brown v. Board. Decades later, segregation of another sort lingers",
      "url": "https://apnews.com/23484a18792637324f9720a26839acc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b250bfed076448678497f50952d0750a/3000.jpeg"
    },
    {
      "author": "VERONICA ANDREA SAUCHELLI, MARIA GRAZIA MURRU and GIADA ZAMPANO",
      "description": "RIETI, Italy (AP) — Ella Anthony knew it was time to leave her native Nigeria when she escaped an abusive, forced marriage only to face angry relatives who threatened to turn her in to police because she was gay.",
      "publishedAt": "2024-05-16T04:12:23Z",
      "title": "As countries tighten anti-gay laws, more and more LGBTQ+ migrants seek safety and asylum in Europe",
      "url": "https://apnews.com/d45a4c29db43d0384a9ea81a7fabbe94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1956481a5c14925b76a8699355fb55e/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "CANNES, France (AP) — Francis Ford Coppola on Thursday will premiere at the Cannes Film Festival a film on which he has risked everything, one that's arriving clouded by rumors of production turmoil.",
      "publishedAt": "2024-05-16T00:25:05Z",
      "title": "All eyes are on Coppola in Cannes. Sound familiar?",
      "url": "https://apnews.com/60e6fe4b066e91f1ceeea5feac0dc0bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9206d0ebfca64accb97c8d7c1f21b94f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}