{
  "articles": [
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The Middle East braced for a potential flare-up in violence on Sunday after Israeli authorities said a rocket from Lebanon struck a soccer field in the Israeli-controlled Golan Heights, killing 12 children and teens in what the military called the deadliest attack on civilians since Oct.",
      "publishedAt": "2024-07-28T09:54:36Z",
      "title": "A strike from Lebanon killed 12 youths. Could that spark war between Israel and Hezbollah?",
      "url": "https://apnews.com/e9430da6eefada8e2f833f5f914190aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1256eed2de4d6dbb32175ece24d24d/1920.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "An election year that was already bitterly partisan has been completely upended by President Joe Biden’s decision to drop out of the 2024 White House race and endorse Vice President Kamala Harris. But it’s not just Harris’s late entry that has electrified things.",
      "publishedAt": "2024-07-28T12:31:26Z",
      "title": "Kamala Harris has America focused on multiracial identity",
      "url": "https://apnews.com/b57f251022d549e38b3c17946347f025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12e5a731a769425b8590b9382c17717e/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, MICHELLE L. PRICE, and ALI SWENSON",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris' campaign has raised $200 million since she emerged as the likely Democratic presidential nominee last week, an eyepopping haul in her race against the Republican nominee, former President Donald Trump.",
      "publishedAt": "2024-07-28T09:02:00Z",
      "title": "Harris raised $200M in first week of White House campaign and signed up 170,000 volunteers",
      "url": "https://apnews.com/5db5d7c5001c87377e4ba11250fff597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca2f138bb1904265888b88de73ab395b/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and JOSHUA GOODMAN",
      "description": "COLUMBUS, Ohio (AP) — Bernie Moreno was ready with a quip when a radio host in his native Colombia asked why he would want to trade his successful professional and personal life in Ohio for the toils of the U.S.",
      "publishedAt": "2024-07-28T12:12:30Z",
      "title": "Senate candidate Bernie Moreno campaigns as an outsider. His wealthy family is politically connected",
      "url": "https://apnews.com/f4e60027ce4e95dc2f1583160548078a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd8c3c048ed04aeeae207539ce78cb76/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelans are voting Sunday in a presidential election whose outcome will either lead to a seismic shift in politics or extend by six more years the policies that caused the world’s worst peacetime economic collapse.",
      "publishedAt": "2024-07-28T04:03:03Z",
      "title": "Venezuelan election could lead to a seismic shift in politics or give President Maduro 6 more years",
      "url": "https://apnews.com/5ce255ae90614162590bfe1207d2e1d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e90ac9a2ac0546f8bfa25b9f9d1da57f/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — New blood tests could help doctors diagnose Alzheimer’s disease faster and more accurately, researchers reported Sunday – but some appear to work far better than others.",
      "publishedAt": "2024-07-28T11:02:30Z",
      "title": "Blood tests for Alzheimer's may be coming to your doctor's office. Here's what to know",
      "url": "https://apnews.com/5c18dda10a3629b727008b9d7f9f7518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909df18d85ba467998d2e51b8aae18b1/3000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD and JANIE HAR",
      "description": "LOS ANGELES (AP) — Billions of dollars have been spent on efforts to get homeless people off the streets in California, but outdated computer systems with error-filled data are all too often unable to provide even basic information like where a shelter bed is open on any given night, inefficiencies that can lead to dire consequences.",
      "publishedAt": "2024-07-28T04:04:10Z",
      "title": "Can tech help solve the Los Angeles homeless crisis? Finding shelter may someday be a click away",
      "url": "https://apnews.com/faf6d31b0851fc9053b07cffb07607a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d4b88a0fb3542fc97941865cd1cfabc/3000.jpeg"
    },
    {
      "author": "DAKE KANG",
      "description": "BEIJING (AP) — Lawmakers from at least six countries say Chinese diplomats are pressuring them not to attend a China-focused summit in Taiwan, in what they describe as efforts to isolate the self-governed island.",
      "publishedAt": "2024-07-28T06:20:52Z",
      "title": "Lawmakers from 6 countries say Beijing is pressuring them not to attend summit in Taiwan",
      "url": "https://apnews.com/a4dc59a25bce5315f8446587bab0d652",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d877672f18f4d22a94149b3577a3cc3/3000.jpeg"
    },
    {
      "author": "NIC COURY and OLGA R. RODRIGUEZ",
      "description": "FOREST RANCH, Calif. (AP) — Wildfires across the western United States and Canada put millions of people under air quality alerts Sunday as thousands of firefighters battled the flames, including the largest wildfire in California this year.",
      "publishedAt": "2024-07-28T17:11:29Z",
      "title": "Thousands battle Western wildfires as smoke puts millions under air quality alerts",
      "url": "https://apnews.com/0efabc7891459d4f8cdfa038a895e69d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f707a9f557884e989adb9f26179c7737/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "PARIS (AP) — The fans’ first standing ovation for Rafael Nadal occurred when he wasn’t even in their presence, merely an image shown on a video screen as he waited in a stadium hallway to walk out on the court used for the Paris Olympics and the French Open, a tournament he made his domain.",
      "publishedAt": "2024-07-28T11:29:17Z",
      "title": "Rafael Nadal wins in Olympic singles and will play rival Novak Djokovic next",
      "url": "https://apnews.com/16bfd83a58fe62901cd8732e3f160356",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94ad31ed23224df08226896473ac1cb4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}