{
  "articles": [
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "CHICAGO (AP) — Vice presidential nominee Tim Walz and former President Bill Clinton are headlining the Democratic National Convention’s third day on Wednesday, as the party hopes to build on the momentum that Kamala Harris has brought since joining the race a month ago.",
      "publishedAt": "2024-08-21T10:27:26Z",
      "title": "Tim Walz and Bill Clinton headline the Democrats' third day, focusing on a 'fight for our freedoms'",
      "url": "https://apnews.com/4f299bd2684c0284dd100f7f0731172f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0610cb2abf0e462297714cdb6fc7faf9/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Vice presidential nominee Tim Walz and former President Bill Clinton will headline the Democratic National Convention on Wednesday, the third day of the party’s choreographed rollout of a new candidate, Kamala Harris, and her pitch to voters.",
      "publishedAt": "2024-08-21T11:43:47Z",
      "title": "The Latest: Walz is expected to accept the party’s nomination for vice president at DNC Day 3",
      "url": "https://apnews.com/88a54976f2747ca8b7bb9151b93e7f55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41cfd8ec8e4442808e2385868eb168e6/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "ASHEBORO, N.C. (AP) — At his first outdoor rally since last month’s attempted assassination, Donald Trump spoke from behind bulletproof glass Wednesday in North Carolina at an event focused on national security.",
      "publishedAt": "2024-08-21T16:31:56Z",
      "title": "Trump speaks from behind bulletproof glass at first outdoor rally since his attempted assassination",
      "url": "https://apnews.com/60de08931c1a964e8e1fb21d3778d35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/760e66dbea8747db9c8e0cb17b8b4dbd/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ALI SWENSON",
      "description": "PHOENIX (AP) — Independent presidential candidate Robert F. Kennedy Jr. will speak Friday “about the present historical moment and his path forward,” his campaign announced Wednesday, fueling growing speculation that Kennedy could drop out and support Republican nominee Donald Trump.",
      "publishedAt": "2024-08-21T19:37:09Z",
      "title": "RFK Jr. to speak Friday, fueling speculation he could drop out and support Trump",
      "url": "https://apnews.com/e25e70090bba36db07cb8d7d4a4d00d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77e713c85997437fb32eb6aae57cb9cd/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Key mediator Egypt expressed skepticism Wednesday about the proposal meant to bridge gaps in cease-fire talks between Israel and Hamas as more details emerged a day before negotiations were expected to resume in Cairo.",
      "publishedAt": "2024-08-21T14:36:39Z",
      "title": "Key mediator Egypt expresses skepticism about the Gaza cease-fire proposal as more details emerge",
      "url": "https://apnews.com/4153fa5fe0daf904f570f4e73f31d2c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/136fe8a5e91d41999694aa96465d8a1f/1920.jpeg"
    },
    {
      "author": "AMY TAXIN and ALANNA DURKIN RICHER",
      "description": "LOS ANGELES (AP) — An attorney for Hunter Biden accused prosecutors Wednesday of wanting to introduce salacious details about partying and spending by President Joe Biden's son to smear his character in front of jurors at his upcoming trial on federal tax charges.",
      "publishedAt": "2024-08-21T04:21:21Z",
      "title": "Hunter Biden's lawyer accuses prosecutors of trying to smear him with salacious details at tax trial",
      "url": "https://apnews.com/2d4087a52c60264c5ab284437475d2b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5863bbf9a95e486ba11c0fa2356e0c5d/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Brazil will begin imposing restrictions on the entry of some foreign citizens from Asia who are seeking refuge in the South American nation as a means to migrate to the United States and Canada, the justice ministry’s press office said Wednesday.",
      "publishedAt": "2024-08-21T21:29:49Z",
      "title": "Brazil will restrict entry of some foreign nationals, aiming to curb migration to US and Canada",
      "url": "https://apnews.com/b6f490d8005ee22fa26b55dea8f2f76d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a2772c9ad6b4f109a80e105c6e8d983/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, DANICA KIRKA and SILVIA STELLACCI",
      "description": "PORTICELLO, Sicily (AP) — Divers searching the wreck of a superyacht that sank off Sicily found the bodies of five passengers Wednesday, leaving one still missing as questions intensified about why the vessel sank so quickly when a nearby sailboat remained largely unscathed.",
      "publishedAt": "2024-08-21T14:13:01Z",
      "title": "Divers recover 5 bodies from wrecked superyacht off Sicily; 1 still missing",
      "url": "https://apnews.com/cb3a667f240fba758198164678eaf01b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76aae4cf0bc54f378b1934712e6e4d83/1920.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — A former babysitter pleaded guilty to manslaughter Wednesday for the 2019 death of a man she was accused of disabling as an infant 40 years ago and was sentenced to three years in prison, finally admitting that she hit him numerous times.",
      "publishedAt": "2024-08-21T14:29:28Z",
      "title": "Babysitter pleads guilty to manslaughter for death of man she injured when he was a baby in 1984",
      "url": "https://apnews.com/b03429448bcfe1b739d744cfd26e2930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e46db349e36c49a984d3be187b125ad3/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Two weeks after organizers scrubbed Taylor Swift's concerts in Vienna amid a foiled terror plot, the singer issued her first statement on the cancellations.",
      "publishedAt": "2024-08-21T22:39:37Z",
      "title": "Taylor Swift calls cancellation of Vienna shows 'devastating' and explains her silence",
      "url": "https://apnews.com/8cabe53d7762bc3f80c0510918ed0aa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a0085b75ae740abb08d158ee7519cac/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}