{
  "articles": [
    {
      "author": "AAMER MADHANI, PAUL WISEMAN and ELAINE KURTENBACH",
      "description": "WASHINGTON (AP) — There’s been no shortage of tough news for China’s economy as some of the world’s biggest brands consider or take action to shift manufacturing to friendlier shores at a time of unease about security controls, protectionism and wobbly relations between Beijing and Washington.",
      "publishedAt": "2023-12-28T05:01:35Z",
      "title": "US companies are picky about investing in China. The exceptions? Burgers and lattes",
      "url": "https://apnews.com/e4e1876afc8dea6ef6a1db6e3a3174d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d172493ff29d45688d701785e1e1b5d1/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — Maine’s Democratic secretary of state on Thursday removed former President Donald Trump from the state’s presidential primary ballot under the Constitution’s insurrection clause, becoming the first election official to take action unilaterally as the U.S.",
      "publishedAt": "2023-12-28T23:56:11Z",
      "title": "Maine bars Trump from ballot as US Supreme Court weighs states' authority to block former president",
      "url": "https://apnews.com/081fd38ce1f20be9b8423cb2f8c66dee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5ce5ba4c3e44c47872434560cf1fa8c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces bombarded cities, towns and refugee camps across Gaza on Thursday, killing dozens of people in a widening air and ground offensive against Hamas that has forced thousands more to flee from homes and shelters in recent days.",
      "publishedAt": "2023-12-28T09:48:40Z",
      "title": "Israeli strikes across Gaza kill dozens of Palestinians, even in largely emptied north",
      "url": "https://apnews.com/382e5c3abfee7e98fc73b51e8cee2b7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787ce479adc04a66b3465a142ddd34bc/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "RAMAT GAN, Israel (AP) — Igor Tudoran spent just 12 hours inside the Gaza Strip before a missile slammed into his tank, leaving him with a life-altering injury.",
      "publishedAt": "2023-12-28T05:04:16Z",
      "title": "The number of wounded Israeli soldiers is mounting, representing a hidden cost of war",
      "url": "https://apnews.com/2b0357365480cc242e30794666b41203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2364a44ba5fc42d39c4e6dcec252fce9/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — For election officials preparing for the 2024 presidential election, the list of security challenges just keeps growing.Many of the concerns from four years ago persist: the potential for cyberattacks targeting voter registration systems or websites that report unofficial results, and equipment problems or human errors being amplified by those seeking to undermine confidence in the outcome.",
      "publishedAt": "2023-12-28T14:21:04Z",
      "title": "Election officials see a range of threats in 2024, from hostile countries to conspiracy theorists",
      "url": "https://apnews.com/69b130e9896a8e8a229b7a668000183f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/044f87adb072408cae2723ae2b9b1745/3000.jpeg"
    },
    {
      "author": "MANUEL RUEDA",
      "description": "BOGOTA, Colombia (AP) — President Nicolás Maduro ordered Venezuela’s armed forces to conduct defensive exercises in the Eastern Caribbean after the United Kingdom sent a warship toward Guyana’s territorial waters as the South American neighbors dispute a large border region.",
      "publishedAt": "2023-12-28T20:12:47Z",
      "title": "Venezuela will hold military exercises off its shores as a British warship heads to Guyana",
      "url": "https://apnews.com/5610400f4af662156e5e111fc17705c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/469cc75d76f948da9f2e9116eb7191fd/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and ABBY SEWELL",
      "description": "TEL AVIV, Israel (AP) — Israeli officials are stepping up threats against the Lebanese militant group Hezbollah, warning that Israel is running out of patience as the two sides continue to trade fire along Israel's volatile northern border.",
      "publishedAt": "2023-12-28T19:01:08Z",
      "title": "As Gaza war grinds on, tensions soar along Israel's volatile northern border with Lebanon",
      "url": "https://apnews.com/b7bac0bb9890681b538ca95cd9d792b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c925cdc21d84419297960de8ab1d8f21/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "MYKOLAIV, Ukraine (AP) — They recognized the TV repairman. The residents of Oleshky in Russian-occupied southern Ukraine could not identify many of those they buried after a catastrophic dam collapse in June sent water coursing through their homes and shattered their lives.",
      "publishedAt": "2023-12-28T05:30:10Z",
      "title": "AP concludes at least hundreds died in floods after Ukraine dam collapse, far more than Russia said",
      "url": "https://apnews.com/daacdc431f42912dfb91548794f03a3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f727e1b23aee4c0c9b00512a41d36dc9/1920.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "The world population grew by 75 million people over the past year and on New Year's Day it will stand at more than 8 billion people, according to figures released by the U.S. Census Bureau on Thursday.",
      "publishedAt": "2023-12-28T19:47:58Z",
      "title": "World population up 75 million this year, standing at 8 billion on Jan. 1",
      "url": "https://apnews.com/b2a32ff77b9f3ae977c943014fe2b853",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a23fbad3a46945dfb84b46dc51522b01/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military on Thursday opened a new chapter in how it investigates and prosecutes cases of sexual assault and other major crimes, putting independent lawyers in charge of those decisions and sidelining commanders after years of pressure from Congress.",
      "publishedAt": "2023-12-28T13:00:57Z",
      "title": "Independent lawyers begin prosecuting cases of sexual assault and other crimes in the US military",
      "url": "https://apnews.com/e6cb6e700338b1471501777a09ca467e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a148578f9cf44166889488a1bee39a03/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}