{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump’s border czar Tom Homan says immigration enforcement will reduce the number of officers in Minnesota. Homan suggested during a news conference Thursday that a drawdown would happen only after ‘cooperation’ from state officials. Trump sent Homan to Minnesota in the wake of the Saturday fatal shooting of a protester at the hands of a federal immigration officer. Homan doubled down on the need for local jails to alert Immigration and Customs Enforcement to people in their custody who ICE can remove from the country.",
      "publishedAt": "2026-01-29T14:08:50Z",
      "title": "Homan: Drawdown in Minnesota but only after ‘cooperation’",
      "url": "https://apnews.com/article/homan-minneapolis-immigration-enforcement-0d559bf53b630d7cc525fd3219f430ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking, Lisa Mascaro",
      "description": "Senate Democrats are poised to block legislation that would fund the Department of Homeland Security and several other agencies on Thursday. That would bring the government a step closer to a partial shutdown if Republicans and the White House do not agree to new restrictions on President Donald Trump’s surge of immigration enforcement. As the country reels from the deaths of two protesters at the hands of federal agents in Minneapolis, irate Senate Democrats laid out a list of demands Wednesday, including that officers take off their masks and identify themselves and obtain warrants for arrest.",
      "publishedAt": "2026-01-29T05:34:50Z",
      "title": "Democrats poised to trigger government shutdown over ICE reform",
      "url": "https://apnews.com/article/senate-democrats-budget-shutdown-trump-homeland-security-5e6788e433e51399c8aa4399035aee22",
      "urlToImage": "https://dims.apnews.com/dims4/default/90bdea3/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F45%2F5ebc78b72f468d7ec4d555217983%2Ff5b38bc5ffad4dae83a13d12f5dc2880"
    },
    {
      "author": "Sam McNeil, Jon Gambrell",
      "description": "The European Union appears poised to sanction Iran’s paramilitary Revolutionary Guard over Tehran’s deadly crackdown on nationwide protests. Kaja Kallas said that she expects foreign ministers meeting in Brussels on Thursday to agree on adding Iran’s Guard to its terrorist list. She said the move would put the Guard on the same footing as al-Qaida, Hamas and the Islamic State group. Iran had no immediate comment, but it has been criticizing Europe in recent days as it considered the move, which follows the U.S. earlier sanctioning the Guard.",
      "publishedAt": "2026-01-29T07:03:45Z",
      "title": "EU appears poised to sanction Iran's Revolutionary Guard",
      "url": "https://apnews.com/article/european-union-iran-revolutionary-guard-terrorist-f7d9d64b1302cfc2d9311417b2dfeaf6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7db0713/2147483647/strip/true/crop/7194x4794+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fec%2F0afd1ded6fb418af8946e1528b78%2Faab32e561e9f417099fd66b862f63416"
    },
    {
      "author": "Sophie Bates, Jeff Martin, Russ Bynum",
      "description": "The situation for some of the most vulnerable people trapped in homes in Tennessee and Mississippi without electricity is reaching a breaking point. Officials say it could be days before power is restored across the South and more subfreezing temperatures are expected by Friday. The growing misery and anxiety comes amid what Mississippi officials say is the state’s worst winter storm in more than 30 years. Roughly 298,000 homes and businesses remained without power Wednesday night. The vast majority of them are in Tennessee and Mississippi, where many are unaccustomed to and ill-equipped for freeing temperatures. At least 70 people have died across the U.S. in states afflicted by the dangerous cold.",
      "publishedAt": "2026-01-29T06:14:42Z",
      "title": "Ongoing frigid temperatures in US South pose danger to those lacking electricity",
      "url": "https://apnews.com/article/frigid-temperatures-power-outages-mississippi-tennessee-4dc03f84a5f6c2ae8b8c8de39995e8ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/25a0c7b/2147483647/strip/true/crop/2529x1685+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Ff5%2F5f4c99f97d1c6d3ca33ff6e09e4c%2F84bf3db1531948f9af16a63b87701811"
    },
    {
      "author": "Matthew Lee",
      "description": "The Trump administration is looking at basing the new Board of Peace in the Washington building that formerly housed the U.S. Institute of Peace. That word comes from four administration officials. The Board of Peace's initial task is to oversee President Donald Trump’s Gaza ceasefire plan, but he seems to have broader ambitions for the initiative. The U.S. Institute of Peace is an independent nongovernmental organization established by Congress. The administration seized the building last year and fired almost all the institute's staff. The building has since been renamed the Donald J. Trump U.S. Institute of Peace, but its name and status are in legal limbo.",
      "publishedAt": "2026-01-29T15:29:55Z",
      "title": "Trump considers housing his new Board of Peace at disputed DC building",
      "url": "https://apnews.com/article/trump-board-of-peace-institute-building-washington-5f4957668fcbcb2d02ce0f2ddafcacd2",
      "urlToImage": "https://dims.apnews.com/dims4/default/34bf5f9/2147483647/strip/true/crop/4586x3056+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F99%2F89af0cca538e8298f332941bd53d%2F2f67ffc2bd5840c08693078a3307a611"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "Donald Trump lost his bid for reelection in 2020. But for more than five years, he’s been trying to convince Americans the opposite is true by falsely saying the election was marred by widespread fraud. Now that he’s president again, Trump is pushing the federal government to back up those bogus claims. On Wednesday, the FBI served a search warrant at the election headquarters of Fulton County, Georgia, which includes most of Atlanta, seeking ballots from the 2020 election. It marks an escalation of Trump's obsession with the election he lost to Democrat Joe Biden, and some observers say his administration is using Georgia as a blueprint for challenging results this November.",
      "publishedAt": "2026-01-29T05:02:32Z",
      "title": "FBI's Georgia raid highlights Trump's obsession with 2020 election",
      "url": "https://apnews.com/article/trump-2020-election-false-claims-fraud-georgia-55786848ca20c02cbcf749ede2db8852",
      "urlToImage": "https://dims.apnews.com/dims4/default/f862d71/2147483647/strip/true/crop/5405x3601+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F41%2F7b64d033590bdd36fc654cd8fd3a%2F88b24e93fc3143abb18cb20955bc4f6a"
    },
    {
      "author": "Gary Fields, Josh Funk, Nathan Ellgren",
      "description": "Families and emergency responders are marking the one-year anniversary of the deadly plane collision over the Potomac River. American Airlines Flight 5342 collided with a Black Hawk helicopter, killing all 67 people on board both aircraft. The plane crash on Jan. 29, 2025, was the deadliest on U.S. soil since a 2001 crash that killed 265 people. Emergency crews faced challenging conditions as they searched for victims, their personal belongings and pieces of the wreckage. Emergency response officials said the priority was recovering bodies and returning them to families. The recovery of personal items provided some closure for grieving families.",
      "publishedAt": "2026-01-29T13:49:52Z",
      "title": "Responders recall the grim recovery a year after the midair DC collision",
      "url": "https://apnews.com/article/american-flight-5342-army-black-hawk-collision-b2bf65bee790ee9878842663cb708905",
      "urlToImage": "https://dims.apnews.com/dims4/default/2881331/2147483647/strip/true/crop/5511x3672+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F8f%2F48fd83e5dfba1e34c0fd6ef863ff%2F05f2ac896a6443ed825c3a7619df9890"
    },
    {
      "author": "John O'connor",
      "description": "A former Illinois sheriff’s deputy has been sentenced to 20 years in prison for fatally shooting Sonya Massey, a Black women who dialed 911 asking for help. Sean Grayson was convicted of second-degree murder in October. He was sentenced on Thursday. The white former deputy killed Massey, who was Black, on July 6, 2024. The 36-year-old single mother had called the police saying she feared there was a prowler outside her Springfield home. Grayson shot her in the face. Grayson can shorten his sentence by half with good behavior. He has been incarcerated since he was charged in Massey’s killing.",
      "publishedAt": "2026-01-29T05:05:36Z",
      "title": "Ex-Illinois deputy is sentenced to 20 years in Sonya Massey’s death",
      "url": "https://apnews.com/article/sonya-massey-grayson-murder-sentence-b4af388a9e7133449e861033a741d2ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/3cb1613/2147483647/strip/true/crop/7555x5034+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F4a%2Fdd0e32931240e9297500313d4600%2F09b3e62bb2754c368a85e91afdccb629"
    },
    {
      "author": "Darlene Superville",
      "description": "Melania Trump is capping her first year after becoming first lady again with the global release of a documentary about the 20 days before she and President Donald Trump returned to the White House. The Kennedy Center in Washington has scheduled a screening for the movie, “Melania,” on Thursday, one day before its release in theaters worldwide. The Trumps are expected to walk the red carpet. Melania Trump says the film will offer rare insight into her life as she juggled her private businesses and planned her family's return to the White House in the run-up to the 2025 inauguration.",
      "publishedAt": "2026-01-29T05:08:59Z",
      "title": "Melania Trump's documentary premieres at the Kennedy Center",
      "url": "https://apnews.com/article/melania-trump-documentary-premiere-kennedy-center-6e6b899671f91a00ca46f059f1c4fc94",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f183a0/2147483647/strip/true/crop/6808x4536+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F9e%2Fd8a000047b101511841b663adf2a%2F76f80882b8e24ba3af115b88d4e25647"
    },
    {
      "author": "Stan Choe",
      "description": "The worst day for Microsoft in nearly five years is pulling the U.S. stock market away from its record heights. The S&P 500 fell 1.3% Thursday after flirting earlier in the morning with its all-time high. The Dow Jones Industrial Average dropped 307 points, and the Nasdaq composite sank 2.3%. Microsoft and Tesla helped drag the market lower following their profit reports. But the majority of stocks in the S&P 500 rose, led by Meta Platforms. Gold’s price zigzagged after rising to another record. Its price fell sharply, as did the price for silver. Treasury yields eased in the bond market.",
      "publishedAt": "2026-01-29T03:54:22Z",
      "title": "Microsoft weighs on Wall Street as gold's price suddenly snaps back",
      "url": "https://apnews.com/article/stock-markets-dollar-gold-fed-2a3715ff96ba5c10b97c49e04ad9f8ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a8157e/2147483647/strip/true/crop/7225x4814+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F48%2F2fb567b380783640576e06d57d61%2Fc9e7c94a698f417390ea9a292301ab1b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}