{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — An Army veteran driving a pickup truck that bore the flag of the Islamic State group wrought carnage on New Orleans’ raucous New Year’s celebration, killing at least 10 people as he steered around a police blockade and slammed into revelers before being shot dead by police.",
      "publishedAt": "2025-01-01T11:42:45Z",
      "title": "Driver rams New Year's revelers in New Orleans, killing 10; FBI doesn't believe he acted alone",
      "url": "https://apnews.com/63a1b43d615af365cb8ba6f5f0583eca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd989f72354b40a2b538cf5571742b12/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — A driver behind the wheel of a pickup truck rammed into a crowd of New Orleans revelers on Bourbon Street early on New Year’s Day, killing at least 10 people in what the FBI is investigating as an act of terrorism.",
      "publishedAt": "2025-01-01T18:03:07Z",
      "title": "The Latest: FBI believes suspect in deadly New Orleans attack did not act alone",
      "url": "https://apnews.com/e1b3b1c13802df69ce0f89e827aadbfc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dd7ba52323845bc8b6e0a120df19301/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Seven years ago, New Orleans officials began installing adjustable barriers at intersections in the famed French Quarter to temporarily prevent vehicles from entering the tourist area where the narrow streets are typically teeming with pedestrians every night of the week.",
      "publishedAt": "2025-01-01T20:52:40Z",
      "title": "New Orleans barriers to prevent vehicle attacks were in the process of being replaced",
      "url": "https://apnews.com/361d9acb509a37a7b7ec1253e32ec3ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb4c36bcbadd484f90d122a4c6f36728/2089.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Authorities say the driver of a pickup truck sped through a crowd of pedestrians gathered in New Orleans’ bustling French Quarter district early on New Year's Day, killing at least 10 people and injuring more than 30 other revelers.",
      "publishedAt": "2025-01-01T14:40:46Z",
      "title": "What we know about a vehicle attack on pedestrians in New Orleans that killed at least 10",
      "url": "https://apnews.com/1685016388d65039ce62e720aab2ba14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27781d03090541dc8c31d68e7a65ac8d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW ORLEANS (AP) — Police say a man who drove a pickup truck at high speed into a crowd of people celebrating the new year in New Orleans early Wednesday was hell-bent on creating carnage.",
      "publishedAt": "2025-01-01T16:53:30Z",
      "title": "New Orleans New Year's Day ramming is the latest attack to use a vehicle as a deadly weapon",
      "url": "https://apnews.com/8af368ea95bea1eec9bc15ebaf43f7ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df8afdf07d3b4f1082a2df730f06d71d/3000.jpeg"
    },
    {
      "author": "TY O'NEIL",
      "description": "LAS VEGAS (AP) — One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las Vegas hotel, authorities said.",
      "publishedAt": "2025-01-01T19:32:11Z",
      "title": "1 person dies when Tesla Cybertruck catches fire and explodes outside Trump's Las Vegas hotel",
      "url": "https://apnews.com/ad4c171c7a6af64f08db93d9fdc2d749",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b88ab465bff4529861f00295448451f/3000.jpeg"
    },
    {
      "author": "BRETT MARTEL",
      "description": "NEW ORLEANS (AP) — The College Football Playoff quarterfinal at the Sugar Bowl between Georgia and Notre Dame was postponed a day because of an attack about a mile away from the Superdome early Wednesday, when a truck plowed into a New Year’s crowd and killed at least 10 people.",
      "publishedAt": "2025-01-01T17:18:46Z",
      "title": "Sugar Bowl CFP quarterfinal between Georgia and Notre Dame postponed after deadly truck attack",
      "url": "https://apnews.com/650b5773a37f0eaa2b03f4412c835674",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6a918ea979c41dfa1005f882c00adea/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "ATLANTA (AP) — Texas avoided the first big upset of the College Football Playoff, hitting a fourth-and-long touchdown pass to keep the game going and beating Cam Skattebo and Arizona State 39-31 in double overtime when an interception by Andrew Mukuba finally ended a Peach Bowl quarterfinal classic Wednesday.",
      "publishedAt": "2025-01-01T22:30:34Z",
      "title": "Texas avoids huge upset, beats Arizona State 39-31 in double overtime in Peach Bowl",
      "url": "https://apnews.com/8064c9423b5f5cfe94a4f6d5289d924a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0b6e0ec9bc44bd6bd50d4bb067573ee/2718.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Before reaching the 1978 peace deal between Egypt’s Anwar Sadat and Israel’s Menachem Begin, Jimmy Carter managed months of intense preparation, high-stakes negotiations at Camp David and a field trip to the Gettysburg battlefield to demonstrate the consequences of war.",
      "publishedAt": "2025-01-01T05:04:25Z",
      "title": "Jimmy the Baptist: Carter redefined ‘evangelical,’ from campaigns to race and women’s rights",
      "url": "https://apnews.com/93343181bb9fac49723470c7e10561d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3257457bc654dfdaef5eb362564a458/1920.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Movie ticket sales took a bit of a hit in 2024. The annual domestic box office is expected to end up at around $8.75 billion, down more than 3% from 2023, according to estimates from Comscore.",
      "publishedAt": "2025-01-01T20:17:53Z",
      "title": "Movies in 2024: Lessons from a turbulent year at the box office",
      "url": "https://apnews.com/cbdff5fc420047d187987d2aeed4db9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ba656be3db14c838c71fdc84328e3af/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}