{
  "articles": [
    {
      "author": "MICHAEL CASEY",
      "description": "Residents across the country from the Northern Plains to the tip of Maine are bracing for dangerously low temperatures as residents along the East Coast contend with a thick blanket of snow — and more snowfall in the forecast. Winter storm warnings are in effect for parts of the Mid-Atlantic and New England. Heavy lake-effect snow is expected in western New York state Monday through Wednesday morning. Meanwhile, an area from the Rockies into the Northern Plains is expected to see temperatures drop unusually low, up to minus 55 degrees Fahrenheit. Sub-zero wind chills are forecast to reach as far south as Oklahoma and the Tennessee Valley.",
      "publishedAt": "2025-01-20T05:17:07Z",
      "title": "Millions across the US brace for plummeting temperatures and winter storms",
      "url": "https://apnews.com/article/extreme-cold-winter-storm-snow-5840ab2626b23dba983bbac7c00390d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b453a5/2147483647/strip/true/crop/3568x2007+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F46%2F7d2d0b9b28ee8f3b7b0d3b57804e%2F4261278bbf3a45a6b31fb25cce1952c5"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "Heavy snow is expected to blanket large portions of the Eastern U.S. while much of the country will endure dangerously cold temperatures in the coming days. Winter storm warnings issued by the National Weather Service are already in effect for parts of the Mid-Atlantic and will begin Sunday afternoon in New England. Up to a half-foot of snow is expected in areas from Maryland to Maine. That will be followed a blast of frigid air forecasted for the Rockies and Northern Plains into New England. The Gulf Coast and Southeast could see an unusual wintry mix of snow, sleet and freezing rain starting Monday in Texas.",
      "publishedAt": "2025-01-19T16:45:09Z",
      "title": "Heavy snow puts 70 million across the U.S. under winter storm warnings",
      "url": "https://apnews.com/article/extreme-cold-winter-storm-snow-bd087a602a49846d53604f97ccc80146",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b453a5/2147483647/strip/true/crop/3568x2007+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F46%2F7d2d0b9b28ee8f3b7b0d3b57804e%2F4261278bbf3a45a6b31fb25cce1952c5"
    },
    {
      "author": null,
      "description": "Southern Californians are bracing for gusty winds and a heightened risk of wildfires less than two weeks after deadly blazes that have killed at least 27 people and ravaged thousands of homes. The National Weather Service has issued a warning of a “particularly dangerous situation” for parts of Los Angeles and Ventura counties from Monday afternoon through Tuesday morning because of low humidity and swift Santa Ana winds. Critical fire weather with wind gusts of up to 60 mph is also forecast for other Southern California communities stretching to San Diego. The warnings come as firefighters continue to battle two major blazes in the Los Angeles area.",
      "publishedAt": "2025-01-19T23:18:10Z",
      "title": "Southern California braces for gusty winds and heightened wildfire risk",
      "url": "https://apnews.com/article/california-fires-los-angeles-winds-red-flag-warnings-f65206e790a912a0ce7d7b99c52e4ea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/57c4e01/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fa7%2F02d8ee2aac3967a9e73068396e49%2F3203f687f64e484d9636896781f477fd"
    },
    {
      "author": "JEFF MARTIN",
      "description": "Martin Luther King Jr. Day celebrations have kicked off at King's former congregation in Atlanta with a 70-member choir's rendition of Hallelujah and stern words from his youngest daughter warning against anti-woke rhetoric. The service at Ebenezer Baptist Church in Atlanta was one of many planned across the country on Monday's holiday in King's honor. the Rev. Bernice King, King's daughter, said anti-woke rhetoric is being used to divide and distract people from real issues of injustice. The U.S. was also set to inaugurate President-elect Donald Trump back into office Monday. The juxtaposition was uneasy for civil rights leaders who have opposed Trump’s rhetoric and stances on race and civil rights.",
      "publishedAt": "2025-01-20T16:24:37Z",
      "title": "MLK Day kicks off at King's Atlanta congregation with daughter's warning about anti-woke rhetoric",
      "url": "https://apnews.com/article/mlk-day-king-ce69f51605082d2495ebaa7082ba1280",
      "urlToImage": "https://dims.apnews.com/dims4/default/b33b80a/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F72%2F8ddd1316828e5f84e180e47a0ae5%2F676fc1165b014f3d91ded70c7088882e"
    },
    {
      "author": "JILL COLVIN, BARBARA ORTUTAY",
      "description": "During his first term as president, Donald Trump led the effort to ban TikTok, the hugely popular video-sharing site he said posed threats to U.S. national security. But on the eve of his return to the White House, the president-elect is being hailed as the app’s savior. The developments over the weekend served as a reminder of how dramatically debates over technology, social media and national security have changed since Trump was last in the White House. It also signaled how closely Trump is following those shifts after waging a successful campaign in which he made inroads with voters in part by harnessing the appeal of some social media platforms.",
      "publishedAt": "2025-01-20T01:47:37Z",
      "title": "Trump's evolution on TikTok: From backing a ban to being hailed as a savior",
      "url": "https://apnews.com/article/trump-tiktok-ban-da11df6d59c17e2c17eea40c4042386d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ef3fe3/2147483647/strip/true/crop/5150x2897+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fc3%2F1eb1175f6616a32f5efa83bfaf85%2F368baa94a8bb4a2a9e87f988641da384"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, MELANIE LIDMAN, SAM MEDNICK",
      "description": "Dozens of Palestinian prisoners have been freed by Israel after three hostages left Hamas captivity in an exchange that took place after 15 months of collective grief and anxiety. Both Israelis and Palestinians are torn between celebration and trepidation as the ceasefire between Israel and Hamas took hold Sunday. The skies above Gaza and Israel were silent for the first time in over a year, and Palestinians began returning to what was left of the homes. After months of tight Israeli restrictions, more than 600 trucks carrying humanitarian aid rolled into the devastated territory. The ceasefire has stirred modest hopes for ending the Israel-Hamas war. But many questions and more challenging negotiations are ahead.",
      "publishedAt": "2025-01-19T05:44:46Z",
      "title": "3 Israeli hostages, 90 Palestinians prisoners freed on Gaza ceasefire Day 1",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-19-2025-437f7f1bf49c9d2936718cf78bdf272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c12222/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F39%2Ff3f91737299562aab4b23d857ac4%2F872eb22497134f3a9a75f4af108a7dad"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER",
      "description": "Dr. Anthony Fauci and retired Gen. Mark Milley say they appreciate their pardons from President Joe Biden. The Democratic president on Monday pardoned Milley, Fauci and members of the House committee that investigated the Jan. 6 attack on the Capitol, using the extraordinary powers of his office in his final hours to guard against potential “revenge” by the incoming Republican Trump administration. Donald Trump has warned of an enemies list filled with those who’ve crossed him politically or sought to hold him accountable for his attempt to overturn his 2020 election loss and his role in the storming of the Capitol on Jan. 6, 2021. Fauci spoke to ABC.",
      "publishedAt": "2025-01-20T12:13:18Z",
      "title": "Biden pardons Fauci, Milley, and members of the Jan. 6 committee",
      "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747",
      "urlToImage": "https://dims.apnews.com/dims4/default/92e0ad2/2147483647/strip/true/crop/5647x3176+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fa8%2F654c69a432ed6eb6cfebe318e280%2Ffcf24b94e060459ea4889bcaea1b6082"
    },
    {
      "author": "ERIC TUCKER",
      "description": "A longtime FBI deputy director who had been expected to replace Director Christopher Wray on an acting basis is retiring from the bureau. That's according to an email deputy Paul Abbate sent to senior executives and obtained by The Associated Press on Monday. It's clear who will run the FBI as confirmation proceedings are underway for President-elect Donald Trump’s pick for the director, Kash Patel.",
      "publishedAt": "2025-01-20T16:39:58Z",
      "title": "FBI acting director says in email that he's retiring from bureau",
      "url": "https://apnews.com/article/trump-fbi-e2013df7ee230573ad695d88fd0838ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/4050033/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F2a%2F67818d618958976e36d3dc1fc5bf%2F225c291c50624262be7bb4e8c5f2eacb"
    },
    {
      "author": "GISELA SALOMON, SOPHIA TAREEN",
      "description": "For millions in the U.S. illegally or with temporary legal status, the start of Donald Trump’s second term as president comes with a feeling their time in the U.S. may end soon. Trump made mass deportations a signature issue of his campaign and has promised a raft of orders to remake immigration policy when he takes office Monday. Plans for deportation arrests appear to be in flux after news leaked of an operation in Chicago this week. Trump’s “border czar” Tom Homan said on Fox News Sunday that Chicago was not off the table, but officials were reconsidering when and how to conduct enforcement. So-called sanctuary cities such as Chicago, which limit how local police cooperate with federal immigration authorities, have been a favorite Trump target.",
      "publishedAt": "2025-01-20T05:23:58Z",
      "title": "As Trump returns to the White House, families prepare for mass deportations",
      "url": "https://apnews.com/article/trump-deportation-immigration-homan-asylum-inauguration-ac10480dc636b758ab3c435b974aeb19",
      "urlToImage": "https://dims.apnews.com/dims4/default/371c6b7/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F54%2F32d72acb57b1059cde5885752880%2Fa064e4d4571f465daa90f052618d710a"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "One of the Israeli hostages freed on the first day of the Gaza ceasefire said Monday in her first comments since being released that she has “returned to life.” Emily Damari, 28, was one of three hostages freed Sunday after spending 471 days in captivity. Officials at a hospital that received them said their condition was stable. In an Instagram story, which was shared by Israeli media, Damari thanked her family and the large protest movement that coalesced to advocate for the release of the hostages. “Thank you thank you thank you I’m the happiest in the world,” she said. Damari is a dual Israeli-British citizen.",
      "publishedAt": "2025-01-20T08:28:55Z",
      "title": "Middle East latest: Released Israeli hostage says she has 'returned to life'",
      "url": "https://apnews.com/article/israel-hamas-war-syria-lebanon-news-01-20-2025-51ff7d97ae0d6e3760377c1ac1c003f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e126349/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F92%2F00b3a6c7359f2df2c48d73e94071%2Fe78b998f227f4ea5a89649c98d54ca84"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}