{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Judge alters Trump’s gag order, allowing comments about witnesses and jurors after his hush money case felony conviction.",
      "publishedAt": "2024-06-25T17:36:27Z",
      "title": "Judge alters Trump’s gag order, allowing comments about witnesses and jurors after his hush money case felony conviction",
      "url": "https://apnews.com/aad25ba9581902c696c02ee4859c2644",
      "urlToImage": ""
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israel’s Supreme Court on Tuesday ruled unanimously that the military must begin drafting ultra-Orthodox men for compulsory service, a landmark decision that could lead to the collapse of Prime Minister Benjamin Netanyahu’s governing coalition as Israel continues to wage war in Gaza.",
      "publishedAt": "2024-06-25T08:12:14Z",
      "title": "Israel's high court orders the army to draft ultra-Orthodox men, rattling Netanyahu's government",
      "url": "https://apnews.com/e2a8359bcea1bd833f71845ee6af780d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d415b0a1d8438b8565bc2dd54dc332/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI, ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "BANGKOK (AP) — A plane carrying WikiLeaks founder Julian Assange departed Bangkok after refueling Tuesday, taking him to Saipan to enter a plea deal with the U.S.",
      "publishedAt": "2024-06-25T05:33:34Z",
      "title": "WikiLeaks founder Julian Assange's plane leaves Bangkok on his way to a US court and later freedom",
      "url": "https://apnews.com/00eb380879ff636cc9b916f82f82ed40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1d7303a648d4a7faa43717495307136/1920.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY and JILL LAWLESS",
      "description": "WELLINGTON, New Zealand (AP) — He emerged on the information security scene in the 1990s as a “famous teenage hacker\" following what he called an “ itinerant minstrel childhood” beginning in Townsville, Australia.",
      "publishedAt": "2024-06-25T12:47:37Z",
      "title": "Who is Julian Assange, the polarizing founder of the secret-spilling website WikiLeaks?",
      "url": "https://apnews.com/e6f55737c9cf6e5059eb43991e89e1f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddba871f129b4083b3b8c894268f9cc3/2000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge on Tuesday modified Donald Trump's gag order, freeing the former president to comment publicly about witnesses and jurors in the hush money criminal trial that led to his felony conviction but keeping others connected to the case off limits at least until he's sentenced July 11.",
      "publishedAt": "2024-06-25T17:38:52Z",
      "title": "Judge alters Trump’s gag order, letting him talk about witnesses, jury after hush money conviction",
      "url": "https://apnews.com/cd8e983664e238385572b9b6dff909ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7915238d0abc4bf19686652741599111/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — It could be a well-rehearsed zinger or an offhand, too-loud sigh.Notable moments from past presidential debates demonstrate how the candidates' words and body language can make them look especially relatable or hopelessly out-of-touch.",
      "publishedAt": "2024-06-25T04:06:21Z",
      "title": "Laugh (or cringe) at these history-making moments from presidential debates",
      "url": "https://apnews.com/93b3700715c2f16092ddfaee59ca49cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0302aed3302b42a48194d82060ed9de8/3000.jpeg"
    },
    {
      "author": "JOSH FUNK, TOM KRISHER and PATRICK ORSAGOS",
      "description": "EAST PALESTINE, Ohio (AP) — Norfolk Southern and its contractors botched the decision to blow open five vinyl chloride tank cars after last year's disastrous derailment in East Palestine, Ohio, and trackside detectors that might have prevented the crash failed to accurately detect the temperature of a burning wheel bearing 20 miles (32.19 kilometers) beforehand, according to the National Transportation Safety Board.",
      "publishedAt": "2024-06-25T05:04:59Z",
      "title": "Norfolk Southern botched decision to blow open vinyl chloride cars in East Palestine, NTSB says",
      "url": "https://apnews.com/944991c7a44286aa9675995f5eb677f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7239bf37826246088fc70dd497ca5893/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI",
      "description": "NAIROBI, Kenya (AP) — Part of Kenya's parliament building was burned Tuesday as thousands of protesters against a new finance bill entered and legislators fled, in the most direct assault on the government in decades.",
      "publishedAt": "2024-06-25T11:25:06Z",
      "title": "Kenya's parliament burns as protesters object to new taxes. Clashes spread and bodies are counted",
      "url": "https://apnews.com/33a20092285f1d663264f7b0d513e1da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f21b9dadd404c75ab4be3dfc0b4bf62/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — More than 500 people — some linked to transnational cartels and organized crime rings — have been charged with gun trafficking and other crimes under the landmark gun safety legislation President Joe Biden signed two years ago Tuesday.",
      "publishedAt": "2024-06-25T12:32:05Z",
      "title": "More than 500 people have been charged with federal crimes under the gun safety law Biden signed",
      "url": "https://apnews.com/7733f5cab2614f39288b0dc157573651",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/131fa8d32046464aa9c103cd1e6d6a74/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and JIM MUSTIAN",
      "description": "SAVANNAH, Ga. (AP) — Julian Lewis didn’t pull over for the Georgia State Patrol cruiser flashing its blue lights behind him on a rural highway. He still didn't stop after pointing a hand out the window and turning onto a darkened dirt road as the trooper sounded his siren.",
      "publishedAt": "2024-06-25T04:09:45Z",
      "title": "Shot in 1.6 seconds: Video raises questions about how trooper avoided charges in Black man's death",
      "url": "https://apnews.com/e5ac7de893189c11c88137fe9b81829e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1e3c966f45044eab4442fa4b2cb974a/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}