{
  "articles": [
    {
      "author": "Darlene Superville, Mari Yamaguchi",
      "description": "President Donald Trump says he's joining some of his top economic advisers for negotiations at the White House over tariffs and trade with a top Japanese official who's traveling to Washington for the talks. The Republican president says in a post on his social media platform he'll attend the meeting Wednesday alongside Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick. Trump recently announced a round of global tariffs but then quickly put them on hold for 90 days after the markets tanked. Japan's 24% across-the-board tariff is on hold. But a 10% baseline tariff and a 25% tariff on cars, auto parts, steel and aluminum exports to the U.S. remain in place.",
      "publishedAt": "2025-04-16T12:16:35Z",
      "title": "Trump says he'll join Bessent and Lutnick for trade negotiations with the Japanese",
      "url": "https://apnews.com/article/trump-trade-tariffs-japan-negotiations-bessent-lutnick-9134808d0e4aaf30bc60b28d7adc9b32",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f8d837/2147483647/strip/true/crop/4898x2755+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F11%2F30b5c33b9ce0332b1fa060462492%2F221a04a5f8194d3a9b029a66455b9331"
    },
    {
      "author": "Colleen Barry",
      "description": "Italian Premier Giorgia Meloni will test her mettle as an EU facilitator when she meets with Donald Trump in the White House. The meeting on Thursday marks the first face-to-face between a European leader and the U.S. president since he announced, and then temporarily suspended, tariffs of 20% on European exports. Meloni is traveling in her role as Italy’s leader, but she has been in close contact with EU Commission President Ursula Von Der Leyen ahead of the trip. The 90-day pause on the retaliatory tariffs has raised some hopes for negotiation, and experts say that Meloni’s margins for progress are more in bringing clarity on Trump's goals than in outright concessions.",
      "publishedAt": "2025-04-17T04:05:04Z",
      "title": "Meloni will test her mettle as EU-US bridge when she meets Trump in Washington",
      "url": "https://apnews.com/article/trump-meloni-white-house-meeting-eu-us-tariffs-a524f386ad4fa628c17949043ecd91e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e1e97c/2147483647/strip/true/crop/5107x2873+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2Fcb%2F537e587414a97a4de41d5ce48197%2F16895e23eda0488f9a9d96bac87c661b"
    },
    {
      "author": "Wafaa Shurafa, Fatma Khaled, Lee Keath",
      "description": "Israeli strikes on the Gaza Strip have killed at least 23 people, including a family of 10. The United Nations meanwhile raised alarm over the mounting impact of Israel’s six-week-old blockade preventing all food and other supplies from entering the territory. Israel ended its ceasefire with Hamas last month and renewed its bombardment, killing hundreds of people and seizing large parts of the territory to pressure the militants to accept changes to the agreement. The U.N. humanitarian office said that almost all of Gaza’s more than 2 million people now rely for food on the only 1 million prepared meals produced daily by charity kitchens supported by aid groups.",
      "publishedAt": "2025-04-17T08:40:19Z",
      "title": "Israeli strike kills family of 10 in Gaza as UN raises alarm over food cutoff",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-17-2025-69292810abbd0512ded90fdfd0ba7692",
      "urlToImage": "https://dims.apnews.com/dims4/default/5549379/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F64%2F4a087c951d5aa79334830a065534%2Ffdcc0d31ed85499b946861be5a9c58d8"
    },
    {
      "author": "Jon Gambrell, Amir Vahdat",
      "description": "Talks between Iran and the United States over Tehran’s rapidly advancing nuclear program are “in a very crucial” stage. That's what the head of the United Nations’ nuclear watchdog said Thursday while on a visit to the Islamic Republic. The comments by Rafael Mariano Grossi of the International Atomic Energy Agency in Tehran included an acknowledgment his agency likely would be key in verifying compliance by Iran should a deal be reached. Iran and the U.S. will meet again Saturday in Rome for a new round of talks after last weekend’s first meeting in Oman.",
      "publishedAt": "2025-04-17T11:11:54Z",
      "title": "Talks between Iran, US at 'very crucial' stage, IAEA chief says",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-iaea-rome-oman-ffa109ded4049f550fe9a116e2fdf8e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/50a5135/2147483647/strip/true/crop/1680x945+0+87/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Fad%2F91be3da50d06c43038ca27d08a8a%2Fbbaae230aa5d42d59a93ee770cb699c6"
    },
    {
      "author": null,
      "description": "Ukrainian officials say Russian forces launched a massive drone attack on the southeastern Ukrainian city of Dnipro, killing three people including a child and wounding dozens. The strike was the latest in a string of Russian attacks that have caused civilian casualties and intensified in recent weeks as the United States continues efforts to negotiate a ceasefire between Moscow and Kyiv. In reaction to the Dnipro attack, Ukraine’s President Volodymyr Zelenskyy urged allies to support the country with air defense weapons. A Ukrainian team is in Paris for a round of talks with allies including France, Germany and the United Kingdom as well as a U.S. delegation.",
      "publishedAt": "2025-04-17T09:43:11Z",
      "title": "Russia strikes Dnipro as Ukrainian officials seek security pledges in Paris",
      "url": "https://apnews.com/article/russia-ukraine-war-dnipro-paris-58bbd055c7b3db9dd26fee9e5782230f",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb556d7/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F2f%2F4a0ae59c5292377f78de5f43c556%2F4f265c7f977c4caab3cd593bdcb66ece"
    },
    {
      "author": null,
      "description": "Paris is hosting a series of high-level talks about Ukraine and its security. U.S. Secretary of State Marco Rubio and presidential envoy Steve Witkoff are taking part. So are Ukrainian presidential adviser Andrii Yermak and Ukraine's foreign and defense ministers. There are also meetings with countries considering a way to police an eventual peace deal. Thursday's meetings come as concerns grow about U.S. President Donald Trump’s readiness to draw closer to Russia as he seeks to broker a ceasefire in Ukraine.",
      "publishedAt": "2025-04-17T08:42:24Z",
      "title": "Ukraine's future is at the center of talks in Paris with Rubio, Witkoff and top European officials",
      "url": "https://apnews.com/article/ukraine-rubio-witkoff-coalition-paris-74e93e2943687a7d8c7b23608919459a",
      "urlToImage": "https://dims.apnews.com/dims4/default/864d569/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F90%2F0dda881701e9d191f252c3e2f871%2Ffdfd012d1dcb446fac68eb8375a9bffb"
    },
    {
      "author": "By Alanna Durkin Richer",
      "description": "A federal judge says he's found probable cause to hold the Trump administration in criminal contempt of court for violating his orders to turn around planes carrying deportees to El Salvador. U.S. District Judge James E. Boasberg said Wedneday that the administration must try to “purge” itself of a contempt finding or he'll launch hearings and potentially refer the matter for prosecution. The move by Boasberg marks an escalation in a battle between the judicial and executives branches of government over a president’s powers to carry out key White House priorities.",
      "publishedAt": "2025-04-16T16:32:58Z",
      "title": "Judge finds probable cause to hold Trump administration in contempt for violating deportation order",
      "url": "https://apnews.com/article/trump-deportees-el-salvador-contempt-boasberg-da282511ac6f5c8dd19af620995ca440",
      "urlToImage": "https://dims.apnews.com/dims4/default/f302e67/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F7d%2F5f1c43a327eb23fb85f5d5d37d37%2Fbd67517eae3a45bebe8972e155380f5f"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Vatican opens solemn run-up to Easter with recovering Pope Francis on the sidelines",
      "url": "https://apnews.com/article/vatican-pope-easter-pneumonia-7fc3e1c6ebc191987e7d4c9162bf6a98",
      "urlToImage": null
    },
    {
      "author": "Jaimie Ding",
      "description": "A Los Angeles judge is set to listen to arguments this week over whether Erik and Lyle Menendez should receive reduced sentences. They are convicted of murdering their parents in 1989. Their attorneys are expected to argue over the course of a two-day hearing starting Thursday that the brothers have worked hard to better themselves and give back to the prison community. They have the support of their extended family. Prosecutors have said they oppose resentencing because the brothers have not admitted to lies told during their trial about why they killed their parents.",
      "publishedAt": "2025-04-17T04:01:49Z",
      "title": "A California judge is set to decide whether the Menendez brothers deserve reduced sentences",
      "url": "https://apnews.com/article/menendez-brothers-resentencing-2fd1b7882fc828e4eaeff5b86c9b3705",
      "urlToImage": "https://dims.apnews.com/dims4/default/eced0e1/2147483647/strip/true/crop/3021x1699+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2Ff3%2Fb58a56875505e1016430a716c17b%2Fba99f3eed6bb407b953b40e448bd4bbf"
    },
    {
      "author": "Dánica Coto",
      "description": "Crews are working to restore power to Puerto Rico after a blackout across the entire island that affected the main airport, several hospitals and hotels filled with Easter vacationers. The blackout left 1.4 million customers without electricity and 328,000 without water. About 12% had power back at the end of the day Wednesday. The blackout snarled traffic, forced businesses to close and left those unable to afford generators scrambling to buy ice and candles. It’s the second islandwide blackout in less than four months. The cause wasn't yet known, but Puerto Rico has had chronic outages due to hurricane damage and a lack of maintenance and investment in its power grid.",
      "publishedAt": "2025-04-17T06:52:45Z",
      "title": "Crews work to restore power after Puerto Rico blackout",
      "url": "https://apnews.com/article/puerto-rico-power-blackout-5b13e983386e13fb6894cb3960902a8c",
      "urlToImage": "https://dims.apnews.com/dims4/default/57e72a3/2147483647/strip/true/crop/6753x3799+0+353/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F4b%2Fa87c3ac434736323e1eb37178395%2Ff9ed75ccfb0c4560838af785a3972457"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}