{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and JILL COLVIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump has named Susie Wiles, the defacto manager of his victorious campaign, as his White House chief of staff, the first woman to hold the influential role.",
      "publishedAt": "2024-11-07T22:48:07Z",
      "title": "President-elect Trump names Susie Wiles as chief of staff, first woman in the post",
      "url": "https://apnews.com/f917aa91b030d836b3bac01659b6fab4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28679767300b44b185e0b6612d1acd44/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Republican leaders projected confidence Thursday that they will keep control of the U.S. House as more races were decided in their favor, while Democrats insisted they still see a path toward the majority and sought assurances every vote will be counted.",
      "publishedAt": "2024-11-07T22:08:48Z",
      "title": "GOP picks up more key House seats while Democrats insist they still have a path to a majority",
      "url": "https://apnews.com/6ec946a40d2b794496455e6c92fa71f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8eabc4a73534679854e090bf604222e/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Joe Biden's name wasn't on the ballot, but history will likely remember Kamala Harris' resounding defeat as his loss too.",
      "publishedAt": "2024-11-07T05:01:54Z",
      "title": "Biden gets blamed by Harris allies for the vice president's resounding loss to Trump",
      "url": "https://apnews.com/5588bafd05471d4c4fb0145db21291d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c52538cdce8b4f33bf0826c8ecef8d9f/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER and NOAH BERGER",
      "description": "CAMARILLO, Calif. (AP) — A Southern California wildfire has destroyed 132 structures, mostly homes, in less than two days, fire officials said Thursday as raging winds were forecast to ease.",
      "publishedAt": "2024-11-07T08:10:04Z",
      "title": "132 structures destroyed in Southern California wildfire as fierce winds expected to subside",
      "url": "https://apnews.com/e89f8cad94f132c9700180025e5b05fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05fa638672344516821e742f0edb77df/1920.jpeg"
    },
    {
      "author": "AYANNA ALEXANDER, ALI SWENSON and GARY FIELDS",
      "description": "WASHINGTON (AP) — Racist text messages invoking slavery raised alarm across the country this week after they were sent to Black men, women and students, including middle schoolers, prompting inquiries by the FBI and other agencies.",
      "publishedAt": "2024-11-08T00:08:53Z",
      "title": "Racist text messages referencing slavery raise alarms in multiple states and prompt investigations",
      "url": "https://apnews.com/708973521d2974bec7514b8622877290",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f1718ea4654ebab02bd3eadbef1e74/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The Federal Reserve cut its key interest rate Thursday by a quarter-point in response to the steady decline in the once-high inflation that had angered Americans and helped drive Donald Trump’s presidential election victory this week.",
      "publishedAt": "2024-11-07T05:01:27Z",
      "title": "Federal Reserve cuts its key interest rate by a quarter-point amid postelection uncertainty",
      "url": "https://apnews.com/e6b837fd85cff5ad71d4e40939b97237",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a6a7d4761464b26821274709ee5e816/3000.jpeg"
    },
    {
      "author": "ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES (AP) — Three people have been charged in connection with the death of Liam Payne, a former member of musical group One Direction who died after falling from the balcony of his hotel room in Buenos Aires last month, Argentine prosecutors said Thursday.",
      "publishedAt": "2024-11-07T22:30:13Z",
      "title": "Argentine prosecutors charge 3 people linked to the death of former One Direction star Liam Payne",
      "url": "https://apnews.com/e73f589a37a4a8f0e80e0b0e71d0f0f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e92ac7c38d454ef0a40ff8bd4e78e177/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau said Thursday he is re-establishing a special Cabinet committee on Canada-U.S. relations to address his administration's concerns about another Donald Trump presidency.",
      "publishedAt": "2024-11-07T18:56:57Z",
      "title": "Canada's Trudeau revives a Cabinet-level panel to address concerns about a Trump presidency",
      "url": "https://apnews.com/075ccb2e68238c3b00c4b5cd24a19b4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bc02849ba014cb98c355f591e6d4ae4/3000.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Cuba was left reeling Thursday after a fierce Category 3 hurricane ripped across the island, destroying hundreds of homes, knocking out the country’s power grid and damaging other infrastructure.",
      "publishedAt": "2024-11-07T04:15:52Z",
      "title": "Cuba left reeling after Category 3 hurricane ravages island and knocks out power grid",
      "url": "https://apnews.com/fc83c4db8e13b9da1a3fa7ec5b6f3319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfb2004980bd4e5dab61353f1c8f7e1d/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and CHRIS LEHOURITES",
      "description": "ROME (AP) — The New Orleans Saints may be one of the worst teams in the NFL this season, but at least they can count on continued prayers from Pope Francis.",
      "publishedAt": "2024-11-07T23:59:35Z",
      "title": "Fans flood @Pontifex account after it inadvertently cites New Orleans Saints amid dreadful season",
      "url": "https://apnews.com/e42784b6c180611d78d821c9e909a76b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01307c10930d448bbb4eb4e6350c3501/2197.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}