{
  "articles": [
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden issued a stark warning to Israeli Prime Minister Benjamin Netanyahu on Thursday that future U.S. support for Israel's Gaza war depends on the swift implementation of new steps to protect civilians and aid workers.",
      "publishedAt": "2024-04-04T17:51:11Z",
      "title": "Biden tells Israel's Netanyahu future US support for war depends on new steps to protect civilians",
      "url": "https://apnews.com/3591fb5f82b22cf8e5d1060fccaef115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e055863a3e5439696531a8f35068c36/3000.jpeg"
    },
    {
      "author": "ERIKA KINETZ and SOLOMIIA HERA",
      "description": "DOVHENKE, Ukraine (AP) — The smell in the car is sick and sweet, the overpowering scent of corpses that have lain too long in muck and ruin, the ones the dogs didn’t devour. Oleksii Yukov, a 38-year-old martial arts instructor who leads a team of volunteer body collectors in Ukraine, doesn’t notice.",
      "publishedAt": "2024-04-04T08:16:27Z",
      "title": "The true toll of the war in Ukraine is measured in bodies. This man brings them home, one at a time",
      "url": "https://apnews.com/43bfc0848fdaa9b36d63abfa8c24f885",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00c7905e99e74251b6e52f4fddf4ac40/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump offered a tough message to Israel over its war against Hamas on Thursday, urging the country to: “Get it over with.”",
      "publishedAt": "2024-04-04T17:51:29Z",
      "title": "Trump says Israel has to get war in Gaza over 'fast' and warns it is 'losing the PR war'",
      "url": "https://apnews.com/21faee332d95fec99652c112fbdcd35d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5a10ff1d6ba491fa16a6c9a7d175aad/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — More than 600 British jurists, including three retired judges from the U.K. Supreme Court, are calling on the government to suspend arms sales to Israel, piling pressure on Prime Minister Rishi Sunak after the deaths of three U.K.",
      "publishedAt": "2024-04-04T11:15:24Z",
      "title": "Senior UK jurists have joined calls to stop arms sales to Israel. Other allies face similar pressure",
      "url": "https://apnews.com/19430d222e6a2f61ffd264e9e494bf63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f8eb41d7be64f16b80ef066bc65b564/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — More than 68,000 illegally trafficked firearms in the U.S. came through unlicensed dealers who aren’t required to perform background checks over a five-year period, according to new data released Thursday by the Bureau of Alcohol, Tobacco Firearms and Explosives.",
      "publishedAt": "2024-04-04T21:32:55Z",
      "title": "Federal report finds 68,000 guns were illegally trafficked through unlicensed dealers over 5 years",
      "url": "https://apnews.com/fd07592977bf4512e742513bb68aea7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/decaf0800d3b4e78a209bd9b0533da06/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "A major spring storm brought heavy snow, rain and high winds to the Northeast into Thursday, downing trees and power lines and leaving nearly 700,000 homes and businesses without power at some point.",
      "publishedAt": "2024-04-04T14:48:38Z",
      "title": "April nor'easter with heavy, wet snow bears down on Northeast, 630,000 still without power",
      "url": "https://apnews.com/74cc15230cdd6e0a20d3431df41484be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e45e28731ffd4b8984999289b5803f21/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and JONATHAN J. COOPER",
      "description": "NEW YORK (AP) — The No Labels group said Thursday it will not field a presidential candidate in November after strategists for the bipartisan organization failed to attract a high-profile centrist willing to seize on the widespread dissatisfaction with President Joe Biden and Donald Trump.",
      "publishedAt": "2024-04-04T18:40:45Z",
      "title": "No Labels won’t run a third-party campaign after trying to recruit a centrist presidential candidate",
      "url": "https://apnews.com/c7477857e1dd05535326b8850f4500a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7a551f7c0d34620bf79202da05ddd68/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge refused Thursday to throw out the classified documents prosecution of Donald Trump, turning aside defense arguments that a decades-old law permitted the former president to retain the sensitive records after he left office.",
      "publishedAt": "2024-04-04T19:06:55Z",
      "title": "Judge rejects Trump request to dismiss classified documents prosecution",
      "url": "https://apnews.com/b862ec627ac0070e5353ac324d8d333f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Video and photos of suspects in a mass shooting show them apparently being brutalized by Russian security forces — without any rebuke from authorities.",
      "publishedAt": "2024-04-04T05:16:34Z",
      "title": "In the aftermath of the Moscow concert hall attack, is a harsher era under Putin in the works?",
      "url": "https://apnews.com/a59085c6fe690ea55d43d132ea628eb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5785d560a19f44dd984a4d1ae163b4e2/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "CLEVELAND (AP) — Dawn Staley did a masterful job guiding a young South Carolina team back to the Final Four with an undefeated record for the second straight season.",
      "publishedAt": "2024-04-04T17:03:19Z",
      "title": "South Carolina's Dawn Staley is the AP Coach of the Year for the 2nd time",
      "url": "https://apnews.com/f231d31902adb0f9bcffbf942a43f6f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b94c3901cf9a4d25a4e4abd7367c420e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}