{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump extended a trade truce with China for another 90 days Monday, at least delaying once again a dangerous showdown between the world’s two biggest economies. The previous deadline was set to expire at 12:01 a.m. Tuesday. Had that happened the U.S. would have ratcheted up taxes on Chinese imports from an already high 30%, and Beijing would have responded by raising retaliatory levies on U.S. exports to China. The pause buys time for the two countries to work out some of their differences, perhaps clearing the way for a summit later this year between Trump and Chinese President Xi Jinping.",
      "publishedAt": "2025-08-12T00:17:15Z",
      "title": "US and China extend trade truce another 90 days, easing tension between world's largest economies",
      "url": "https://apnews.com/article/trump-trade-tariffs-china-deadline-ad2c003e9a709a1dfdfc9a9fd3798baf",
      "urlToImage": "https://dims.apnews.com/dims4/default/826ad09/2147483647/strip/true/crop/4174x2348+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F40%2F915c31044682195c261846ceed69%2Ffc5c44eabb15459ba6b08009a1414c47"
    },
    {
      "author": null,
      "description": "European Union leaders are appealing to U.S. President Donald Trump to defend their security interests at a key summit with his Russian counterpart Vladimir Putin over the war in Ukraine. The Europeans are desperate to exert some influence over a meeting that they have been sidelined from. It's unclear whether whether even Ukraine will take part. Trump says he wants to see on Friday whether Putin is serious about ending the war. But he has disappointed U.S. allies by saying that Ukraine will have to give up some Russian-held territory. In a statement early Tuesday, the EU leaders welcomed his efforts to end the war, but insisted that “the path to peace in Ukraine cannot be decided without Ukraine.”",
      "publishedAt": "2025-08-12T05:00:02Z",
      "title": "EU leaders appeal to Trump to defend Europe's security interests at his war summit with Putin",
      "url": "https://apnews.com/article/europe-trump-putin-summit-ukraine-territory-ba56ddbd24d1b7e8e0aca7754d0f180a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b1f5de/2147483647/strip/true/crop/3725x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F66%2Fc4a5e93388823b426030f9d3cdcc%2F2eb12f4eac6d47e5b9ac00538428fb50"
    },
    {
      "author": null,
      "description": "President Donald Trump is promising new steps to tackle homelessness and crime in Washington. And that's leading the city’s mayor to voice concerns about the potential use of the National Guard to patrol the streets in the nation’s capital. Trump says in a social media post that he plans a White House news conference at 10 a.m. Monday to discuss his plans to make the District of Columbia, in his words, “safer and more beautiful than it ever was before.” On Thursday, the Republican president directed an increased federal law enforcement presence in the Democratic-run city for seven days, “with the option to extend as needed.” Federal agencies including the FBI assigned more than 120 officers and agents to assist in Washington.",
      "publishedAt": "2025-08-11T04:02:28Z",
      "title": "Trump is promising new steps to tackle crime in Washington",
      "url": "https://apnews.com/article/trump-washington-crime-national-guard-homelessness-655bc22834223c7dc93115bbcb2b215c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266a77/2147483647/strip/true/crop/5153x2899+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F63%2F8baa7c6be3d31be5eca593125cca%2F6e1d0893946249429e055b72185c5b67"
    },
    {
      "author": null,
      "description": "U.S. lawmakers are urging the Trump administration to maintain a security partnership with Australia and the United Kingdom to supply nuclear-powered submarines. The Pentagon has announced a review of the AUKUS agreement, raising concerns about U.S. shipbuilding capabilities. The review is expected to be completed in the fall. The partnership is seen as crucial to countering China's influence in the Indo-Pacific. However, a report warns that U.S. shipbuilding limitations could jeopardize the agreement. Australia has invested heavily in the U.S. submarine industrial base, aiming to accelerate production and support its defense strategy.",
      "publishedAt": "2025-08-12T01:00:58Z",
      "title": "Lawmakers urge Trump to keep Australia and UK security pact",
      "url": "https://apnews.com/article/trump-aukus-congress-pentagon-australia-9611e2b5f0167e62e22f388051cec582",
      "urlToImage": "https://dims.apnews.com/dims4/default/c210d4c/2147483647/strip/true/crop/4256x2394+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fa8%2Fbd09782babbaf464373ad167f4b7%2F358f8181f01a48abb203ca0ae3ee2931"
    },
    {
      "author": null,
      "description": "Washington, D.C., Mayor Muriel Bowser has responded to President Donald Trump's plan to take over the Metropolitan Police Department and call in the National Guard. Bowser emphasized that crime has been dropping and Trump's state of emergency doesn't match the numbers. She acknowledged that the city has little choice but to comply. Bowser linked the takeover to the larger issue of D.C. statehood, stating that limited autonomy makes the city vulnerable. Trump's decision fits a pattern of using emergency declarations to rule by executive order. Bowser maintains that violent crime has decreased, a claim supported by Trump's former U.S. attorney nominee.",
      "publishedAt": "2025-08-12T04:02:21Z",
      "title": "Washington, D.C., grapples with notion of Trump federal intervention",
      "url": "https://apnews.com/article/washington-dc-takeover-trump-mayor-crime-48b8c936a19531cacf6bfb75e2f32231",
      "urlToImage": "https://dims.apnews.com/dims4/default/417b2b1/2147483647/strip/true/crop/5061x2847+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F39%2F4c600552f7f6b04ebfe148c13a86%2F9997c994e7ef427b9c88953d4de9358d"
    },
    {
      "author": null,
      "description": "President Donald Trump has taken control of the District of Columbia’s law enforcement and ordered National Guard troops to deploy onto the streets of the nation’s capital. He argued Monday the extraordinary move is a response to an urgent public safety crisis. But his rhetoric echoed that of conservative politicians going back decades who have denounced American cities, especially those with majority non-white populations or led by progressive politicians, as lawless or crime-ridden and in need of outside intervention. Advocates in Washington's Black community say they had been preparing for a potential federal crackdown in the district since 2020, when Trump deployed U.S. troops during racial justice protests after the murder of George Floyd.",
      "publishedAt": "2025-08-12T04:03:28Z",
      "title": "Trump's DC police takeover echoes history of racist narratives about crime",
      "url": "https://apnews.com/article/trump-washington-dc-takeover-race-39388597bad7e70085079888fe7fb57b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e77f9e1/2147483647/strip/true/crop/5029x2829+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F0c%2F238a8e41758041a5bd37364ec2ea%2F0e37d2d1134d4bb88a35ca990cc6800c"
    },
    {
      "author": null,
      "description": "Officials are still working to determine the cause of an explosion that rocked a steel plant outside Pittsburgh, leaving two dead and 10 injured. The blast occurred Monday at the Clairton plant in the Mon Valley. Emergency services say a fire started late morning, and a rescue effort continued into the night. The plant is still partially operational. Allegheny Health Network treated seven patients, discharging five. The rumbling from the explosion, and several smaller blasts that followed, was felt through the community about 15 miles southeast of Pittsburgh. U.S. Steel, now part of Nippon Steel, has promised a full investigation.",
      "publishedAt": "2025-08-12T04:16:10Z",
      "title": "Officials investigate what caused Pennsylvania steel plant explosion",
      "url": "https://apnews.com/article/pennsylvania-steel-plant-explosion-c0f27dce378e1f6654682c5479620196",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc7a22/2147483647/strip/true/crop/7974x4485+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F35%2Fc707d413a64158f99433dc75f23f%2F5c6b65a5eabf44d6bfb62fb79595e1d9"
    },
    {
      "author": null,
      "description": "Inflation likely ticked up in July for the third straight month as tariffs lift the cost of imported goods such as furniture, appliances, and toys, which could make it harder for the Federal Reserve to cut short-term interest rates as President Donald Trump has demanded. Consumer prices are forecast to have risen 2.8% in July from a year earlier, according to a survey of economists by data provider FactSet. That annual pace would be up from 2.7% in June and a post-pandemic low of 2.3% in April. Excluding volatile food and energy costs, core inflation is expected to rise to 3%, from 2.9% in June. Both figures are well above the Fed’s 2% price target.",
      "publishedAt": "2025-08-12T04:01:06Z",
      "title": "Inflation likely moved higher last month as tariffs bite, putting the Fed in bind",
      "url": "https://apnews.com/article/inflation-consumer-prices-jerome-powell-fed-interest-rates-7956da9c097730929b12c269f8c08399",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa6d791/2147483647/strip/true/crop/3720x2093+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fe4%2F62094a573fdbaa0441caece556da%2F14727f7ca931479ba887e14ccdd28b44"
    },
    {
      "author": null,
      "description": "Asian shares are mostly higher after President Donald Trump delayed raising tariffs on China for another 90 days. Tokyo's Nikkei 225 reached a new record high. Trump signed an executive order putting on hold a possible showdown between the world’s two major economies, to allow time for talks. Without an extension, taxes on Chinese imports might have jumped from an already high 30%. Beijing could have responded by raising retaliatory levies on U.S. exports to China but it issued a similar statement about the extension of the tariff pause. U.S. stocks edged back from record highs. The S&P 500 lost 0.3%, the Dow industrials fell 0.5% and the Nasdaq composite was down 0.3%.",
      "publishedAt": "2025-08-12T04:21:54Z",
      "title": "Asian shares advance on relief that Trump is delaying higher China tariffs",
      "url": "https://apnews.com/article/stock-markets-inflation-trump-china-3b9c602e05756778028b70f97e15ccb2",
      "urlToImage": "https://dims.apnews.com/dims4/default/52fceb0/2147483647/strip/true/crop/7688x4325+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F4e%2F71c339e45a099793a4effecee83c%2F8196b32e19f74b4aaae9cacd6dc1a61b"
    },
    {
      "author": null,
      "description": "Look what you made her do. Taylor Swift has announced her 12th studio album, “The Life of a Showgirl.” The full-length follows her last original album, 2024’s “The Tortured Poets Department.\" That album was released during her record-breaking “Eras Tour.” The tour raked in over $2.2 billion across two years and five continents, making it the highest-grossing tour of all time. “The Life of a Showgirl” is also her first release since Swift regained control over her entire body of work. In May, that pop star said she purchased her catalog of recordings, originally released through Big Machine Records, from their most recent owner, the private equity firm Shamrock Capital.",
      "publishedAt": "2025-08-12T04:25:06Z",
      "title": "'The Life of a Showgirl': Taylor Swift announces 12th studio album",
      "url": "https://apnews.com/article/taylor-swift-new-album-life-of-showgirl-c4262686b5b68ee210f7571b8716ab51",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed23bf1/2147483647/strip/true/crop/3180x1789+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2Fba%2Fb75c336397d5d91df2b931141ba4%2Fdc2c7d9c32134a23959897d9a92ec15e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}