{
  "articles": [
    {
      "author": null,
      "description": "Authorities say firefighters who rushed to put out a blaze in a northern Idaho mountain community found themselves instead in an unexpected shootout. A man who had intentionally set the fire to ambush the crew on Sunday was perched in a sniper position, firing at the firefighters on Canfield Mountain just north of Coeur d’Alene. Authorities say they took cover behind firetrucks, but two died and a third was wounded during a barrage of gunfire over several hours. First responders made urgent calls for help. Authorities eventually found the suspect dead in the mountains. It is unknown how he died, and authorities have not yet revealed a motive.",
      "publishedAt": "2025-06-30T13:36:16Z",
      "title": "2 Idaho firefighters shot and killed in ambush, authorities say",
      "url": "https://apnews.com/article/coeur-dalene-idaho-shooting-firefighters-024d26274e0faacec1687f6dde789ced",
      "urlToImage": "https://dims.apnews.com/dims4/default/83e178a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F86%2Fadc96fa995d92e5f8d324923f981%2F3525bb7167224f0eb1218d2e1acd88b9"
    },
    {
      "author": null,
      "description": "Authorities say two firefighters were killed and another was badly injured after they were ambushed and shot while responding to a wildfire near Coeur d’Alene, Idaho on Sunday afternoon. The gunman was later found dead with a weapon nearby. A shelter-in-place order was lifted Sunday night after a tactical response team used cell phone data to “hone in” on a wooded area where they found the suspect’s body with a firearm nearby as flames rapidly approached. Officials did not release his name.",
      "publishedAt": "2025-06-30T06:03:28Z",
      "title": "What to know about the Idaho shooting",
      "url": "https://apnews.com/article/idaho-shooting-coeur-dalene-firefighters-mountain-d3ceec2c795aaa13d0ede2993f1681ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/bf8fa74/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F52%2Fbef085e4be1348a76e35a7c6450a%2F420b980d247046518b79a2522ee9d6d7"
    },
    {
      "author": null,
      "description": "The Senate will try to sprint ahead on President Donald Trump’s big bill of tax breaks and spending cuts after a weekend of setbacks. An all-night session to consider an endless stream of proposed amendments, called a vote-a-rama, was abruptly postponed. It's now scheduled to launch when the Senate gavels open Monday. With Democrats united against the Republican president's legislation, the voting could take all day. The day ahead could be pivotal for Republicans, who are racing to meet Trump's Fourth of July deadline to pass the bill. The House is being called back to session for votes as soon as Wednesday, if the Senate can pass the bill.",
      "publishedAt": "2025-06-30T10:29:02Z",
      "title": "Senate Republicans in sprint on Trump's big bill after weekend of setbacks",
      "url": "https://apnews.com/article/senate-bill-trump-tax-breaks-spending-cuts-549c2fdd47c1965007282b8461687bc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7eaf6a/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F0e%2Fafab358123c3efa36f33789af47d%2Fd64c2d696da34d30a01d25a30402daa8"
    },
    {
      "author": null,
      "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations. Now it’s up to the Republican-controlled Congress to decide whether President Donald Trump’s signature’s domestic policy package will become law. The bill is nearing a final Senate vote. If it passes, it would then move to the House. Democrats are united against it. The bill would make permanent many of the tax breaks passed in Trump's first term while adding new ones such as no tax on tips or overtime.",
      "publishedAt": "2025-06-30T19:56:54Z",
      "title": "What's in the latest version of Trump's big bill",
      "url": "https://apnews.com/article/trump-tax-cuts-bill-republicans-medicaid-snap-4ff35843e6a5247f37d048bde9b1f5ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/640fa02/2147483647/strip/true/crop/5876x3305+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F4f%2F9b40c7c90634883fa7b2cbb22d9f%2F4848db0607744a889293d7af549eb407"
    },
    {
      "author": null,
      "description": "Multiple media outlets report Bryan Kohberger has agreed to plead guilty to murdering four University of Idaho students as part of a deal with prosecutors to avoid the death penalty. ABC News reports that the news was delivered to families of the victims in a letter from prosecutors. A change of plea hearing is set for Wednesday. Kohberger’s trial had been set to begin in August. Kohberger, 30, is accused in the stabbing deaths of Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves at a rental home near campus in Moscow, Idaho, in November 2022. Kohberger was arrested in Pennsylvania weeks after the killings. He had been a criminal justice graduate student at Washington State University.",
      "publishedAt": "2025-06-30T04:04:57Z",
      "title": "Bryan Kohberger to plead guilty to killing 4 University of Idaho students, multiple media report",
      "url": "https://apnews.com/article/kohberger-idaho-students-killed-91eeb98eebd3d9b007e4a5cae0f81030",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7feec4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F24%2Fbc0f88655b584fce0e2b246f8080%2F242b342dd39d4aca86f39763dca3c3cd"
    },
    {
      "author": null,
      "description": "Witnesses and medics in Gaza say Israeli forces have killed at least 22 people and wounded 20 others when they fired on crowds returning from a food aid site. The Israeli military says it is reviewing the incidents. Palestinians have reported intensified Israeli bombings in Gaza City with widespread destruction. Ambulances are struggling to reach stricken areas due to ongoing attacks and blocked access. More than 500 people have been reported killed in the chaotic and controversial aid distribution program run by Israeli and U.S.-backed Gaza Humanitarian Fund in southern Gaza. Israel wants it to replace a U.N.-run system.",
      "publishedAt": "2025-06-30T12:23:15Z",
      "title": "22 Palestinians killed in Gaza as Israeli forces fire on crowds at food aid sites, medics say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-food-c08079f831c44442a19ffd21fcea8de4",
      "urlToImage": "https://dims.apnews.com/dims4/default/8568db4/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fda%2F87db7b49b70378a1a0e7df569368%2Fdd23046562754fac9e0ca21ddd4ecc3f"
    },
    {
      "author": null,
      "description": "A federal judge in Tennessee has ruled that Kilmar Abrego Garcia will stay in jail for now over concerns from his lawyers that he could be deported if he’s released. The judge was preparing to release him to await trial on human smuggling charges. Abrego Garcia’s attorneys had asked the judge Friday to delay his release. They raised concerns over what they described as “contradictory statements” by President Donald Trump’s administration. The Justice Department has said it intends to try Abrego Garcia on the smuggling charges before any moves are made to remove him from the U.S. again. A federal prosecutor had earlier told a judge there were plans to deport Abrego Garcia, though he didn’t say when.",
      "publishedAt": "2025-06-30T19:22:42Z",
      "title": "Judge again delays Abrego Garcia’s release from jail",
      "url": "https://apnews.com/article/abrego-garcia-deportation-immigration-trump-a94b2d9101bb0da10e6998bead07b9c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2bb06ef/2147483647/strip/true/crop/7789x4381+0+406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F52%2F6c8c92c99106604cabdddbf45ee2%2F1feb7bd890de4689b60a6b86f9a5a0d4"
    },
    {
      "author": null,
      "description": "Jurors are set to start deliberating in Sean “Diddy” Combs’ sex trafficking case. The jury of eight men and four women will weigh on Monday charges that could put the hip-hop mogul in prison for life. The 55-year-old Combs has pleaded not guilty. Jurors heard seven weeks of sometimes graphic and emotional testimony about Combs’ propensity for violence and his sexual predilections, including drug-fueled sex marathons dubbed “freak-offs” or “hotel nights.” Defense lawyers acknowledge that Combs could be violent but maintain that the sex acts were consensual. In all, 34 witnesses testified, headlined by Combs’ former girlfriend Cassie.",
      "publishedAt": "2025-06-30T04:03:37Z",
      "title": "Sean ‘Diddy’ Combs’ jury due to start deliberating",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-5e9a6752cd04d079597266243ae1cd0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64d65c/2147483647/strip/true/crop/3500x1969+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F44%2F4892f01350fcda375d34cf73655a%2Fe0ee6ee7b3d446b48cb2b373f33586a8"
    },
    {
      "author": null,
      "description": "An 82-year-old Colorado woman who was injured in a Molotov cocktail attack on demonstrators in support of Israeli hostages in Gaza has died. The Boulder County District Attorney’s Office said in a statement Monday that Karen Diamond died as a result of the injuries she suffered in the June 1 attack in Boulder, Colorado. Mohamed Sabry Soliman faces dozens of charges, now including first-degree murder. Prosecutors say he injured more than a dozen people by throwing Molotov cocktails while yelling “Free Palestine.” If convicted on all counts, he faces over 100 years in prison. His attorney has not commented on the case.",
      "publishedAt": "2025-06-30T16:52:01Z",
      "title": "A woman has died after being hurt in a firebomb attack during a demonstration in Colorado",
      "url": "https://apnews.com/article/boulder-attack-death-e6e45ad5a6e6becab9026994c758e09b",
      "urlToImage": "https://dims.apnews.com/dims4/default/50fde23/2147483647/strip/true/crop/2491x1401+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F8d%2F2ba07a33bda1882e2d643e38a241%2F10c8eb0f88cc4343a45bc263577c3e82"
    },
    {
      "author": null,
      "description": "Cleveland, Detroit and Philadelphia are set to join the WNBA as expansion franchises starting in 2028. The Ohio team will join that season, Detroit in 2029 and Philadelphia in 2030. All three teams will have NBA ownership groups.",
      "publishedAt": "2025-06-30T13:54:21Z",
      "title": "Cleveland, Detroit, Philadelphia set to join WNBA",
      "url": "https://apnews.com/article/wnba-expansion-teams-1302d6179e283cf76293d09d7e019a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/80e117b/2147483647/strip/true/crop/1903x1070+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2Fe7%2F52d85bc8b6b1e88980adcf95c22c%2F51837f0c562046ad97bd3d8b0ad9f967"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}