{
  "articles": [
    {
      "author": null,
      "description": "The Republican-controlled Senate has advanced President Donald Trump’s package of tax breaks, spending cuts and increased deportation money, but there's more weekend work ahead as Congress races to meet his Fourth of July deadline for passage. By a 51-49 tally and with Vice President JD Vance at the Capitol to break a potential tie, the Senate cleared a key procedural step Saturday as midnight approached. Voting had come to a standstill, dragging for more than three hours, with holdout senators huddling for negotiations and taking private meetings off the Senate floor. The Senate's top Democrat has forced a full reading of 940-page bill. That began late Saturday and has continued into Sunday morning.",
      "publishedAt": "2025-06-29T12:40:14Z",
      "title": "After a dramatic vote, the Senate pushes ahead on Trump's bill",
      "url": "https://apnews.com/article/senate-trump-tax-breaks-spending-cuts-daf7c76ac9481d177050df5932025c56",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d9d2e6/2147483647/strip/true/crop/5066x2850+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F42%2Ffe1360f9b2859b5c254cb7bbb2c9%2F3b0ac930f04b4f3da94958b2a5934698"
    },
    {
      "author": null,
      "description": "Republican Sen. Thom Tillis of North Carolina says he won't seek reelection. That news Sunday comes one day after he announced his opposition to President Donald Trump’s tax breaks and spending cuts package because of its reductions to health care programs. Tillis said in a statement that he was proud of his career in public service but acknowledged the difficult political environment for those who buck their party and go it alone. Trump, in social media posts, had berated Tillis for being one of two Republican senators who voted on Saturday night against advancing the massive bill. Tillis would have been up for a third term in 2026.",
      "publishedAt": "2025-06-29T17:47:30Z",
      "title": "North Carolina Sen. Thom Tillis won't run in 2026 after opposing Trump bill",
      "url": "https://apnews.com/article/tillis-senate-north-carolina-trump-reelection-republicans-382f72ff5228d864b38009904cbc4e6b",
      "urlToImage": "https://dims.apnews.com/dims4/default/38b32e9/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fb0%2F5817684a42e3e2ce4b57dcf175f7%2F7d4a41abd2ef4115a882c87e07fa0f16"
    },
    {
      "author": null,
      "description": "President Donald Trump says he's not planning to extend a 90-day pause on tariffs on most nations beyond July 9. He says his administration will notify countries that the trade penalties will take effect unless there are deals with the United States. During a wide-ranging interview with Fox News Channel's “Sunday Morning Futures,” the Republican president also said a group of investors will step forward within weeks to announce a plan to buy TikTok. And he floated the idea of giving some relief to hotels and farms reeling from immigration raids.",
      "publishedAt": "2025-06-29T17:28:42Z",
      "title": "Trump says he's not planning to extend a tariffs pause beyond July 9",
      "url": "https://apnews.com/article/trump-tariffs-china-tiktok-iran-immigration-trade-9041fa893f99cfba5eb3663749dd10d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b7e666/2147483647/strip/true/crop/4290x2413+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fd4%2F745bde5de8af81f37e1be93803ec%2F769af5a146ca43839e6f81278cf53ecc"
    },
    {
      "author": null,
      "description": "Court records show that the Trump administration has agreed to spare from deportation a key witness in the federal prosecution of Kilmar Abrego Garcia in exchange for his cooperation in the case. Jose Ramon Hernandez Reyes has been convicted of smuggling migrants and illegally reentering the United States after having been deported. Records reviewed by The Washington Post show that Hernandez Reyes has been released early from federal prison to a halfway house and has been given permission to stay in the U.S. for at least a year. Prosecutors have identified Hernandez Reyes as the “first cooperator” in the case against Abrego, according to court filings.",
      "publishedAt": "2025-06-29T19:38:27Z",
      "title": "Star witness against Kilmar Abrego Garcia won't be deported",
      "url": "https://apnews.com/article/jose-ramon-hernandez-reyes-kilmar-abrego-garcia-immigration-trump-7e54840d58c071ddd5fe3e507bdc6ca7",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebba8a6/2147483647/strip/true/crop/6408x3605+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F52%2F4fa4e5f2ffec93f56a77560ede73%2Fcd1d9df3efa24ca9aee714579eabd7c4"
    },
    {
      "author": null,
      "description": "Authorities in western Idaho are urging residents to shelter in place because of law enforcement activity following a shooting in Kootenai County near Coeur d’Alene. The sheriff’s office in neighboring Soshone County said Sunday afternoon on Facebook that authorities were “dealing with an active shooter situation where the shooter is still at large.” An alert by the Kootenai County Emergency Management Office asked people to avoid the area around Canfield Mountain Trailhead and Nettleton Gulch Road. No details were provided.",
      "publishedAt": "2025-06-29T23:11:36Z",
      "title": "Western Idaho residents urged to shelter in place due to 'active shooter situation,' authorities say",
      "url": "https://apnews.com/article/coeur-dalene-idaho-shooting-57e4143642c5a0e98d134051a7147a89",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump is calling for a deal on the war in Gaza. In between posts about a Senate vote on his tax cuts and spending bill, Trump pleaded early Sunday on his social media platform Truth Social for a deal and the release of hostages. Trump has suggested a ceasefire agreement could happen within a week. An Israeli official says plans are underway for Prime Minister Benjamin Netanyahu to travel to Washington in the coming weeks, with a top adviser already heading there for discussions. In Gaza, Israel has ordered evacuations in northern areas during intensifying military operations.",
      "publishedAt": "2025-06-29T07:50:40Z",
      "title": "Signs of progress as Trump calls for a Gaza deal",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-29-2025-f72d5701a985213e12b1ff80d1357670",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6b9379/2147483647/strip/true/crop/7456x4194+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F3c%2F7209a7a2eb06f6c6798293190d3a%2F83ebd299747441bf97a9ea4b4e27f7f7"
    },
    {
      "author": null,
      "description": "Iran’s judiciary reports that at least 71 people were killed in Israel's attack on Tehran’s Evin prison. The attack occurred Monday and targeted several prison buildings. A judiciary spokesperson said Sunday that the dead included staff, soldiers, prisoners and visiting family members. Rights groups have raised concerns about inmate safety following the incident. Iran also confirmed Sunday that top prosecutor Ali Ghanaatkar, known for prosecuting dissidents, was among those killed. Ghanaatkar had faced criticism from human rights groups for his actions, including prosecuting Nobel Peace Prize winner Narges Mohammadi. He will be buried at a shrine in Qom.",
      "publishedAt": "2025-06-29T07:18:42Z",
      "title": "Iran's judiciary says at least 71 killed in Israel's attack on Tehran's notorious Evin prison",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-29-2025-da0d0f6e1a9bf89a30a2589e73cff2ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc05acf/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F47%2F7ffc348a02d9ec126bd26625eafb%2F7d46f901139d4c73b1f182cfc8e42228"
    },
    {
      "author": null,
      "description": "Zohran Mamdani, an outspoken critic of Israel, is the expected Democratic nominee for mayor in America’s most Jewish city and that's raising alarms among some in the New York's Jewish community. They're worried about rising antisemitism and their waning influence. Mamdani's performance in this past week's Democratic primary also signals a sea change in the priorities of one of the party’s most loyal voting groups. An ideological realignment has been taking place among American Jews since the Hamas attack on Israel in 2023. And many Democratic voters, including Jews, have grown dismayed by Israel’s conduct in the war.",
      "publishedAt": "2025-06-29T12:56:06Z",
      "title": "How Democrats in America’s most Jewish city turned to Mamdani for mayor",
      "url": "https://apnews.com/article/new-york-mamdani-mayor-democrats-jews-israel-39e3a3df4ce9d05c090a78ba7a1eb48b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f6f369c/2147483647/strip/true/crop/5053x2842+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fba%2F4ddcfa80c511baddba9960d5b937%2F07db4d8ba49d4f75a0c2407f4d9d1303"
    },
    {
      "author": null,
      "description": "Prosecutors doubled down during closing arguments on their theory that Sean “Diddy” Combs carried out a sex trafficking criminal scheme for two decades as he enjoyed fame atop the hip-hop music world. Then a defense lawyer belittled the government's decision to prosecute his client, saying it was an unjust intrusion into the bedroom of Americans. The two differing views came across during closing arguments Thursday and Friday that will weigh heavily on a jury that begins deliberations on Monday. At stake is Combs' freedom after his arrest last September at a New York hotel. The 55-year-old entertainer has pleaded not guilty to sex trafficking and racketeering conspiracy charges.",
      "publishedAt": "2025-06-29T18:43:22Z",
      "title": "Key moments from the closing arguments at Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-closings-564d626da5c1be0f4a794861e5aaa11f",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f15fd8/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F27%2F88fd798cc1d8b136d3b4534b850b%2F48f477e2e7004ef290613abdf88394df"
    },
    {
      "author": null,
      "description": "NBA free agent Malik Beasley is under investigation by the U.S. District Attorney’s office regarding gambling allegations tied to league games, a person familiar with the situation told The Associated Press on Sunday. The person spoke on condition of anonymity because they were not authorized to comment on the matter. “We are cooperating with the federal prosecutors’ investigation,” NBA spokesman Mike Bass said in a statement released to the AP and other outlets on Sunday. The probe into Beasley comes 14 months after the NBA banned Toronto’s Jontay Porter, who was linked to a prop bet investigation and eventually pleaded guilty to committing wire fraud.",
      "publishedAt": "2025-06-29T17:12:07Z",
      "title": "NBA player Malik Beasley under investigation for gambling",
      "url": "https://apnews.com/article/malik-beasley-gambling-investigation-01ac1407f1db21d8c82079cee0b1cf9b",
      "urlToImage": "https://dims.apnews.com/dims4/default/6006372/2147483647/strip/true/crop/2565x1443+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F2b%2Fb3e6e52a8bcb9a994411d23c5b15%2F81d94a3e988e436490bb13e8575711d5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}