{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and RAVI NESSMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israel escalated its bombardment of targets in the Gaza Strip, the military said Tuesday, ahead of an expected ground invasion against Hamas militants that the U.S.",
      "publishedAt": "2023-10-24T07:15:30Z",
      "title": "Israel increases strikes on Gaza and 2 more hostages are freed. UN says aid sent so far is a trickle",
      "url": "https://apnews.com/c2482817f230580c20b898bd65e5a4c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/979203658b7d43b2b3dc9ba1d1e8dee7/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and NAJIB JOBAIN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Yousra Abu Sharekh’s days begin in the southern Gaza Strip often after sleepless nights amid blaring ambulance sirens and the clamor of neighbors in the brief pause between relentless Israeli airstrikes.",
      "publishedAt": "2023-10-23T17:13:04Z",
      "title": "Two weeks ago she was thriving. Now, a middle-class mom in Gaza struggles to survive",
      "url": "https://apnews.com/24f139484879b0f388e864c6463d7e8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c082d2b1c31a4e3a9cd844b48a97dc24/3000.jpeg"
    },
    {
      "author": "TARA COPP and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Pentagon has sent military advisers, including a Marine Corps general versed in urban warfare, to Israel to aid in its war planning and is speeding multiple sophisticated air defense systems to the Middle East days ahead of an anticipated ground assault into Gaza.",
      "publishedAt": "2023-10-23T19:39:02Z",
      "title": "Pentagon rushes defenses and advisers to Middle East as Israel's ground assault in Gaza looms",
      "url": "https://apnews.com/1a906598be5baccc614897768b1824a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/995ec04853de4d23a4502f07f08f57af/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES, FARNOUSH AMIRI and KEVING FREKING",
      "description": "WASHINGTON (AP) — Three weeks now since the ouster of Kevin McCarthy, House Republicans will meet privately to try nominating a new House speaker to accomplish the seemingly impossible job of uniting a broken, bitter GOP majority and returning to the work of governing in Congress.",
      "publishedAt": "2023-10-24T04:25:10Z",
      "title": "There's a long list of candidates for House speaker as Republicans try voting again on a new leader",
      "url": "https://apnews.com/c7ddb6abf4c7322f9fc44fdaa07791fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dae4bcf7262849b3be9db39307609afe/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Michael Cohen once proclaimed he'd “take a bullet” for Donald Trump. Now, after breaking with the former president amid his own legal troubles, the fixer-turned-foe is poised to testify against his old boss Tuesday as a key witness at the civil fraud trial that threatens to upend Trump's real estate empire and wealthy image.",
      "publishedAt": "2023-10-24T04:28:57Z",
      "title": "Donald Trump expected back at civil fraud trial with fixer-turned-foe Michael Cohen set to testify",
      "url": "https://apnews.com/8e49619e3f5ebb6931e6947c4dabda87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12064676c95e45719800dcf7e34a310a/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — At least seven people were killed Monday after a “superfog” of smoke from marsh fires and dense morning fog caused a series of wrecks on Interstate 55 near New Orleans that left a long stretch of mangled and scorched cars, trucks and tractor-trailers.",
      "publishedAt": "2023-10-23T17:04:30Z",
      "title": "'Superfog' near New Orleans blamed for highway crashes that killed at least 7",
      "url": "https://apnews.com/d645f3494bc98b587c7d78ce09f90e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fdc4c3b1b544318aab3f0fec346f879/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Since Israel activated the Iron Dome in 2011, the cutting-edge rocket-defense system has intercepted thousands of rockets fired from the Gaza Strip.The system has given residents a sense of security, and Israelis can often be seen watching the projectiles flying through the skies and destroying their targets overhead.",
      "publishedAt": "2023-10-24T04:01:30Z",
      "title": "Is Israel's Iron Dome missile defense system ironclad?",
      "url": "https://apnews.com/f57508d0e53945d1071d4582fcdae8d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e38403c424f4e0290f2d2b9de538285/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — Tensions from the war in Gaza could help accelerate the move away from planet-warming fossil fuels like oil and gas and toward renewable energy, electric cars and heat pumps — similar to how sharp increases in the price of oil during the 1970s unleashed efforts to conserve fuel, the head of the International Energy Agency said.",
      "publishedAt": "2023-10-24T04:04:53Z",
      "title": "Gaza has oil markets on edge. That could build more urgency to shift to renewables, IEA head says",
      "url": "https://apnews.com/7b0cf535f33a3b33a2bfd8a462850ff4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa86b63188c54e90a1cabb56b3c415ec/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — All of West Maui except for burned-out sections of historic Lahaina will reopen to tourism on Nov. 1 following the deadliest U.S. wildfire in more than century, the mayor of Maui County said Monday.",
      "publishedAt": "2023-10-24T03:53:58Z",
      "title": "Mayor says West Maui to reopen to tourism on Nov. 1 after fire and workers are ready to return",
      "url": "https://apnews.com/3e19bd1b77611763455fd4bc8c615295",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39039d6885c14c52b910b08caa02dc1a/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NASHVILLE, Tenn. (AP) — It’s long after midnight when the bustling operating room suddenly falls quiet –- a moment of silence to honor the man lying on the table.This is no ordinary surgery. Detrick Witherspoon died before ever being wheeled in, and now two wide-eyed medical students are about to get a hands-on introduction to organ donation.",
      "publishedAt": "2023-10-24T05:02:49Z",
      "title": "Few transplant surgeons are Black. Giving medical students a rare peek at organ donation may help",
      "url": "https://apnews.com/a00f3e7b43f3d4e176a9647c49487e92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e65f049da3544e88b9145917b32769c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}