{
  "articles": [
    {
      "author": null,
      "description": "National Guard troops have begun arriving in Los Angeles on orders from President Donald Trump to stamp out protests that have broken out in recent days against federal immigration authorities seeking to carry out deportations in the region. The members of California’s National Guard were seen staging early Sunday at the federal complex in downtown Los Angeles that includes the Metropolitan Detention Center, where confrontations occurred the last two days.",
      "publishedAt": "2025-06-08T15:00:10Z",
      "title": "National Guard troops arrive in LA to quell protests against ICE",
      "url": "https://apnews.com/article/immigration-protests-raids-los-angeles-78eaba714dbdd322715bf7650fb543d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/73dbd0d/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Ffa%2Fd6e136fd0f4920f023d112f3e151%2F240d88867ccc4af2a9b0c0eb573bbafd"
    },
    {
      "author": null,
      "description": "Israel’s government has vowed to prevent an aid boat carrying Greta Thunberg and other activists from reaching the Gaza Strip. Defense Minister Israel Katz said Sunday that Israel wouldn't allow anyone to break its naval blockade of the Palestinian territory which he said was aimed at preventing Hamas from importing arms. The activists had said they planned to reach Gaza’s territorial waters as early as Sunday to deliver aid and raise awareness about the humanitarian crisis in the war-ravaged enclave. An attempt last month by Freedom Flotilla to reach Gaza by sea failed after another of the group’s vessels was attacked by two drones while sailing in international waters off Malta.",
      "publishedAt": "2025-06-08T11:43:42Z",
      "title": "Israel vows to prevent aid boat carrying Greta Thunberg from reaching Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-aid-flotilla-greta-thunberg-5899bcc088496dbcba4cb192c84ea367",
      "urlToImage": "https://dims.apnews.com/dims4/default/17cf41b/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F38%2F986cf828823c2c36e82a9f86d7bf%2F36b185b1dfe84e18ab59eb4c2d53925d"
    },
    {
      "author": null,
      "description": "Palestinian health officials and witnesses say that at least four people were killed and others were wounded by Israeli fire around a kilometer from an aid distribution point in the Gaza Strip run by an Israeli and U.S.-backed group. Israel’s military said it fired warning shots at people who approached its forces. The bodies were brought to Nasser Hospital in Gaza's southern city of Khan Younis, which confirmed the toll. Palestinian witnesses said Israeli forces had fired on them at a roundabout in the nearby city of Rafah as they went to get food from a site run by the Gaza Humanitarian Foundation. There was no immediate comment from the foundation.",
      "publishedAt": "2025-06-08T08:32:09Z",
      "title": "At least 4 are killed by Israeli fire near a Gaza aid site, Palestinians say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-08-2025-e6a2ae2ca7bc02225ef3c75e7d62ebc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Russian officials say that Moscow is still awaiting confirmation from Kyiv on a planned exchange of 6,000 bodies of soldiers killed in action and is accusing Ukraine of delaying the process. Lt. Gen. Alexander Zorin, a Russian negotiator, said on Sunday that Russia delivered 1,212 bodies of Ukrainian troops to a border site and is receiving “signals” the transfer may be postponed until next week. The swap was agreed during direct talks in Istanbul, though both sides have since accused each other of undermining the plan. Ukraine has denied a date was agreed and accused Russia of manipulating facts and submitting incorrect repatriation lists.",
      "publishedAt": "2025-06-08T09:41:32Z",
      "title": "Russia accuses Ukraine of delaying exchange of dead fighters",
      "url": "https://apnews.com/article/russia-ukraine-war-prisoner-swap-bodies-743d264ed87083e16846e668c35144f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/5abe438/2147483647/strip/true/crop/4129x2323+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Ff7%2F9b91deb17e6413ef3d21324c0e4e%2Ff3fe84febe914d4c956d35f1bba6324e"
    },
    {
      "author": null,
      "description": "Six decades after the federal government ordered Concordia Parish to desegregate its schools, the district remains racially divided. Black students make up more than 92% of Ferriday High School, while 15 minutes away, Vidalia High is 62% white. Yet state and local officials say it’s time to free Concordia Parish and other districts from court-ordered desegregation orders dating back decades. In a stunning shift that reverses decades of policy, they have allies in the federal government. The Trump administration has vowed to lift more desegregation plans from the 1960s. Civil rights activists say it would leave families with little recourse when they face discrimination.",
      "publishedAt": "2025-06-08T04:01:20Z",
      "title": "School desegregation: Trump officials vow to end Civil Rights-era orders",
      "url": "https://apnews.com/article/desegregation-race-consent-decree-school-1dd1a8be59bb0f9568d5685b8459f413",
      "urlToImage": "https://dims.apnews.com/dims4/default/53fe72e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4e%2Fd2424279efd6868272c0337ad51b%2F3f25246eef8a4b088a920d86b0749719"
    },
    {
      "author": null,
      "description": "Hackers tied to China's government have tried repeatedly to access the phones of prominent Americans, part of Beijing's sprawling cyberespionage efforts. Smartphones and other mobile devices present significant national security and cybersecurity risks, as foreign government hackers exploit vulnerabilities in mobile networks and apps to spy on people and steal secrets. And people's careless use of mobile devices to share sensitive information is another concern. National security experts say that mobile security hasn't kept up as mobile devices and networks have proliferated, making them a significant vulnerability in the nation's cyber defenses.",
      "publishedAt": "2025-06-08T11:40:45Z",
      "title": "Smartphones have become an intelligence treasure trove",
      "url": "https://apnews.com/article/china-cybersecurity-hacking-smartphones-37bb5f10c6e21fec2863b1faf269cecc",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3484a2/2147483647/strip/true/crop/2916x1640+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Ffe%2F8d50b11bc9259364cec917eef058%2F03fc68090be04bd8b5bbe3541ab3d062"
    },
    {
      "author": null,
      "description": "Iran’s intelligence minister has claimed without offering evidence that Tehran seized an “important treasury” of information regarding Israel’s nuclear program. The remarks Sunday by Esmail Khatib follow Iranian state television claiming that Iranian intelligence officials seized documents, again without any evidence. Israel, whose undeclared atomic weapons program makes it the only country in the Mideast with nuclear bombs, has not acknowledged any such Iranian operation targeting it — though there have been arrests of Israelis allegedly spying for Tehran amid the Israel-Hamas war in the Gaza Strip.",
      "publishedAt": "2025-06-08T13:34:32Z",
      "title": "Iran claims without evidence it seized Israeli nuclear files",
      "url": "https://apnews.com/article/iran-israel-nuclear-us-negotiations-hamas-war-6da132a0cf9a37d7a693d5335590410a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b859b23/2147483647/strip/true/crop/6188x3481+0+323/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F76%2Fc8f4d0b6bed3af6e5c96fe99140c%2F53f3f5936bb34e1e807bc14fed82abfe"
    },
    {
      "author": null,
      "description": "U.S.-China trade talks in London this week are expected to take up a series of disputes that have buffeted relations. Both sides agreed in Geneva last month to a 90-day suspension of most of the tariffs they had imposed on each other in an escalating trade war. Since then, the U.S. and China have exchanged angry words over advanced semiconductors, “rare earths” that are vital to many industries and visas for Chinese students at American universities. The meeting in London follows a phone call last week between U.S. President Donald Trump and Chinese leader Xi Jinping.",
      "publishedAt": "2025-06-08T07:36:34Z",
      "title": "What's at stake in US-China trade talks in London",
      "url": "https://apnews.com/article/us-china-tariff-trump-xi-trade-london-talks-7db44c1697a7c4cf781e0e1796470625",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0c4813/2147483647/strip/true/crop/3775x2123+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fe5%2F278a1c94f1d2c83094bbe54211bc%2F7af34119a3a64029b839891e5bea5a08"
    },
    {
      "author": null,
      "description": "Mohammad Sharafoddin, his wife and young son managed to make it out of Afghanistan as refugees nine years ago, at one point walking 36 hours over mountain passes. Sharafoddin hoped his wife's niece could follow them to their new home in South Carolina. But President Donald Trump's travel ban on people from Afghanistan and 11 other countries appears to have shut that door. Sharafoddin says his niece wants to be a doctor, and it is especially hard because she can't study in her home country under the Taliban, who returned to power in 2021 .",
      "publishedAt": "2025-06-08T04:10:24Z",
      "title": "Travel ban may shut door for Afghan family to bring niece to US for a better life",
      "url": "https://apnews.com/article/trump-travel-ban-afghanistan-d8221314a74a83a80cec37dd1bf101bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/20458ee/2147483647/strip/true/crop/5460x3071+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F26%2Fdd2bdb3c8d0c0032133b4f984f93%2Fd49625447f4141f1b116ff367768da3c"
    },
    {
      "author": null,
      "description": "Jannik Sinner has dropped a set for the first time at Roland-Garros this year but still leads two sets to one in the French Open final against defending champion Carlos Alcaraz. After falling behind early in the third, Alcaraz won four consecutive games then took the set 6-4 to keep his title defense alive. Sinner, the top-ranked player, leads 6-4, 7-6 (4), 4-6.",
      "publishedAt": "2025-06-08T06:00:06Z",
      "title": "Alcaraz fights back to take third set in French Open final",
      "url": "https://apnews.com/article/french-open-men-final-alcaraz-sinner-e0de8f0c10f4b3e988f31257a3e08a9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d6a09c/2147483647/strip/true/crop/5209x2930+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe4%2Fa38b9b8b4ef3cac3e6d926de7c89%2Fab875bd395fc4390b7e329fed266d677"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}