{
  "articles": [
    {
      "author": "JALAL BWAITEL, NAJIB JOBAIN, JOSEF FEDERMAN, SAMY MAGDY and BASSEM MROUE",
      "description": "AL BIREH, West Bank (AP) — Hamas militants on Saturday released 17 hostages, including 13 Israelis, from captivity in the Gaza Strip, while Israel freed 39 Palestinian prisoners in the latest stage of a four-day cease-fire.",
      "publishedAt": "2023-11-25T07:24:36Z",
      "title": "Israel and Hamas complete 2nd day of swaps after tense delay, as Gaza cease-fire holds",
      "url": "https://apnews.com/7d83895eb736c09fab3eada4c31524b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecea10c927c04b5eacc5653e50a5786b/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A container ship owned by an Israeli billionaire came under attack by a suspected Iranian drone in the Indian Ocean as Israel wages war on Hamas in the Gaza Strip, an American defense official said Saturday.",
      "publishedAt": "2023-11-25T08:08:40Z",
      "title": "An Israeli-owned ship was targeted in suspected Iranian attack in Indian Ocean, US official tells AP",
      "url": "https://apnews.com/39929cae42a191b2f242896a053123a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52f333bfd302473db051683447ade5f0/3000.jpeg"
    },
    {
      "author": "FRANK BAJAK",
      "description": "NATIONAL HARBOR, Md. (AP) — Artificial intelligence employed by the U.S. military has piloted pint-sized surveillance drones in special operations forces’ missions and helped Ukraine in its war against Russia.",
      "publishedAt": "2023-11-25T15:50:10Z",
      "title": "Pentagon's AI initiatives accelerate hard decisions on lethal autonomous weapons.",
      "url": "https://apnews.com/0773b4937801e7a0573f44b57a9a5942",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d009fdbe8d064455a89a5c22e04bcb61/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK AND TRISHA AHMED",
      "description": "MINNEAPOLIS (AP) — An attorney for Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, said Saturday that Chauvin's family has been kept in the dark by federal prison officials after he was stabbed in prison.",
      "publishedAt": "2023-11-25T19:18:57Z",
      "title": "Derek Chauvin's family has received no updates after prison stabbing, attorney says",
      "url": "https://apnews.com/23c704a8cd441d270b7b542e835b69fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — One of the world’s largest icebergs is drifting beyond Antarctic waters, after being grounded for more than three decades, according to the British Antarctic Survey.The iceberg, known as A23a, split from the Antarctic's Filchner Ice Shelf in 1986.",
      "publishedAt": "2023-11-25T17:16:31Z",
      "title": "One of world's largest icebergs drifting beyond Antarctic waters after it was grounded for 3 decades",
      "url": "https://apnews.com/b6fcfc99939659aaa26fdba0b3e17f1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/604dcad693c74a548c1096df36774ed6/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and BILL BARROW",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump used college football rivalry weekend to bask among his supporters in a state and region that are key to his presidential fortunes, while trying to upstage his Republican opponent Nikki Haley on her home turf at the Clemson-South Carolina football game.",
      "publishedAt": "2023-11-25T05:03:54Z",
      "title": "Donald Trump draws cheers in Nikki Haley's backyard at Clemson-South Carolina football game",
      "url": "https://apnews.com/62ca25d5ad44bb8f1fb352805b3bcd2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2bedf1de2da4927bf0c9b8b1bebf3b2/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russia on Saturday morning launched its most intense drone attack on Ukraine since the beginning of its full-scale invasion in 2022, targeting the Ukrainian capital, military officials said.",
      "publishedAt": "2023-11-25T08:40:10Z",
      "title": "Ukraine's military says Russia launched its largest drone attack since the start of the invasion",
      "url": "https://apnews.com/ad3eef50f980a4df023fad78d7bc197d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04702d1b3a724115a30a5d19e6769f0b/3000.jpeg"
    },
    {
      "author": "VANESSA GERA and JARI TANNER",
      "description": "HELSINKI (AP) — When Finland joined NATO earlier this year, Russia threatened retaliation.",
      "publishedAt": "2023-11-25T16:03:50Z",
      "title": "Why Finland is blaming Russia for a sudden influx of migrants on its eastern border",
      "url": "https://apnews.com/0e1ba68a783e3aa392539074c4dc39e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/172f4a1ff55f415497adc2ea2100ec2e/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Rep. George Santos said he expects to be expelled from Congress following a scathing report by the House Ethics Committee that found substantial evidence of lawbreaking by the New York Republican.",
      "publishedAt": "2023-11-25T18:49:51Z",
      "title": "Rep. George Santos says he expects to be kicked out of Congress as expulsion vote looms",
      "url": "https://apnews.com/bf33ec0df1997467617f5d19531a4b26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/004cc31cb4444e619705a249dc7ef446/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "ANN ARBOR, Mich. (AP) — With more than two years of excellence being questioned and their coach banned from the Big House, J.J. McCarthy, Blake Corum and No. 3 Michigan stared down No. 2 Ohio State again and earned a victory that will go down as one of the biggest in the history of college football’s winningest program.",
      "publishedAt": "2023-11-25T20:58:59Z",
      "title": "No. 3 Michigan beats No. 2 Ohio State 30-24 for 3rd straight win in rivalry",
      "url": "https://apnews.com/20131d4e3ac7662c51362bc72059c54a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e413bd78e576467ba81bd66bc87fc59d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}