{
  "articles": [
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — DeAnna Mireau reached into a container and fished out a scrap of paper.“The next one is — do we have a drumroll?\" she called out to a room crowded with some two dozen older adults and a half-dozen journalists.",
      "publishedAt": "2024-06-14T04:13:50Z",
      "title": "'Biden Bingo': The president's campaign adapts a classic game to include malarkey and aviators",
      "url": "https://apnews.com/2be372b532d28eb9eee5246cc161d6c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9cdda373bde401c942ea2b9b204f7fe/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israel's military said Saturday that eight soldiers were killed in southern Gaza in the deadliest attack on Israeli forces in months.The troops were killed in an explosion, the army said, without elaborating.",
      "publishedAt": "2024-06-15T15:31:58Z",
      "title": "8 Israeli soldiers killed in southern Gaza",
      "url": "https://apnews.com/d8726708ab503c29b6e652aa81f361e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fff816b9daf46778a7f95768dfc734c/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "OBBÜRGEN, Switzerland (AP) — Dozens of world leaders converged on a Swiss resort Saturday to discuss how to bring peace to war-ravaged Ukraine, though any hopes of a real breakthrough were muted by the absence of Russia.",
      "publishedAt": "2024-06-15T07:02:32Z",
      "title": "World leaders meet in Switzerland to discuss a Ukraine peace roadmap. Russia is notably absent",
      "url": "https://apnews.com/2a8abeb9e6e2714f6af032593706d9e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd4dc109d8014a08b345f4ce45ab93e6/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and JOEY CAPPELLETTI",
      "description": "DETROIT (AP) — Donald Trump will use back-to-back stops Saturday to court Black voters and a conservative group that has been accused of attracting white supremacists as the Republican presidential candidate works to stitch together a coalition of historically divergent interests in battleground Michigan.",
      "publishedAt": "2024-06-15T11:32:46Z",
      "title": "Trump's Michigan trip will include stops at a Black church and a gathering of far-right activists",
      "url": "https://apnews.com/2ddab35eceecb42ee8899f0720715b32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4da206fc62d840e699801aa6791f36a1/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "LOS ANGELES (AP) — After flying through the night across nine time zones, from southern Italy to Southern California, President Joe Biden is shifting his focus from Russia's challenge of Western unity to raking in big money for his reelection campaign at a Hollywood fundraiser featuring George Clooney and Julia Roberts.",
      "publishedAt": "2024-06-15T04:02:37Z",
      "title": "Biden goes straight from G7 to Hollywood fundraiser, balancing geopolitics with his reelection bid",
      "url": "https://apnews.com/40081471c93faa68de5c4aa30455303b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b75ac15cbe914dba8a963a09e54cdbcb/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Britain put on a display of birthday pageantry Saturday for King Charles III, a military parade that marked the Princess of Wales ’ first appearance at a public event since her cancer diagnosis early this year.",
      "publishedAt": "2024-06-15T09:30:38Z",
      "title": "UK royals unite on palace balcony, with Kate back at her first public event since cancer diagnosis",
      "url": "https://apnews.com/2b3598b61e05207cb35c4df69365eec2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b17a8d9ffe574d3eb77ddb4cc4f27942/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "A judge has overturned the conviction of a Missouri woman who was a psychiatric patient when she incriminated herself in a 1980 killing that her attorneys argue was actually committed by a now-discredited police officer.",
      "publishedAt": "2024-06-15T16:43:58Z",
      "title": "Missouri woman's murder conviction tossed after 43 years. Her lawyers say a police officer did it",
      "url": "https://apnews.com/3cb4c9ae74b2e95cb076636d52453228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b15ca1e5ca64c418ed7928f8224266f/2000.jpeg"
    },
    {
      "author": "DAVE COLLINS, JUAN A. LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — Bombastic conspiracy theorist Alex Jones has been ordered to liquidate his personal assets as he owes $1.5 billion for his false claims that the 2012 Sandy Hook Elementary School shooting, which killed 20 first graders and six educators in Newtown, Connecticut, was a hoax.",
      "publishedAt": "2024-06-15T04:15:06Z",
      "title": "What we know about the fight between conspiracist Alex Jones and Sandy Hook families over his assets",
      "url": "https://apnews.com/0c3576e3c4bd853ac2cc5342118fca8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/479bcfa4e293436cba9d17fe1b8ae619/3000.jpeg"
    },
    {
      "author": "EVENS SANON and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haitian leaders have ousted Frantz Elbé, the beleaguered director of Haiti’s National Police, following months of criticism that he wasn’t doing enough to protect officers under assault by gangs.",
      "publishedAt": "2024-06-15T15:09:40Z",
      "title": "Haitian leaders oust police chief and appoint a new one as gang violence claims officers’ lives",
      "url": "https://apnews.com/036106ec40a55acb6a59eab25faf7c90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93e0faa749fe4256bebbc7a72ee26df9/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "The mailings promised “Life Without Pain!” via stem cell injections or IVs administered in a patient’s own home. The allure was obvious: more than 20% of U.S. adults endure chronic pain.The flyers invited Iowans to free dinners across the state.",
      "publishedAt": "2024-06-15T04:14:54Z",
      "title": "Some hawking stem cells say they can treat almost anything. They can't",
      "url": "https://apnews.com/23789b100f28a9abda6e287773369790",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1676cf75a9694e3a9acdac4de475faf1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}