{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT, BILL BARROW and DARLENE SUPERVILLE",
      "description": "ATLANTA (AP) — President Joe Biden and his Republican rival, Donald Trump, were set to face off Thursday evening for a debate that offered an unparalleled opportunity for the two candidates to try to reshape the presidential race.",
      "publishedAt": "2024-06-27T04:08:30Z",
      "title": "Biden and Trump arrive for a debate that could change the trajectory of the 2024 campaign",
      "url": "https://apnews.com/0e7577e9a354a69f50675494fea54ca9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c893ff1f39934584a4143329d87f01f5/1920.jpeg"
    },
    {
      "author": null,
      "description": "ATLANTA (AP) — U.S. President Joe Biden and his Republican rival, Donald Trump, will meet Thursday for the first general election debate of the 2024 season — a chance for both candidates to try to reshape the political narrative and persuade undecided voters.",
      "publishedAt": "2024-06-27T20:28:11Z",
      "title": "The Latest | Biden and Trump prepare to debate for the first time in 2024 election season",
      "url": "https://apnews.com/5689d5716e242c3360267c76298d6b6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d4135a6ccf9483fbe5b1dab8880f498/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — The U.S. Supreme Court did not settle the debate over whether federal law requires hospitals to stabilize pregnant patients with emergency abortions on Wednesday, despite saying Idaho hospitals can provide abortions in medical emergencies even with the state’s restrictions.",
      "publishedAt": "2024-06-27T18:45:16Z",
      "title": "Despite Supreme Court ruling, the future of emergency abortions is still unclear for US women",
      "url": "https://apnews.com/7fd5f3026778b9e65ca2afe2f399a877",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9129d6d5ae66493ebda3289a1755869f/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — The former Uvalde schools police chief and another former officer have been indicted over their role in the slow police response to the 2022 massacre at a Texas elementary school that left 19 children and two teachers dead, according to multiple reports Thursday.",
      "publishedAt": "2024-06-27T23:15:28Z",
      "title": "Former Uvalde school police chief and officer indicted over Robb Elementary response, reports say",
      "url": "https://apnews.com/e603acfc25c452695e6e29dd756152d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df2f72b96e6c460c958f0487570ea104/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday rejected a nationwide settlement with OxyContin maker Purdue Pharma that would have shielded members of the Sackler family who own the company from civil lawsuits over the toll of opioids but also would have provided billions of dollars to combat the opioid epidemic.",
      "publishedAt": "2024-06-27T14:08:49Z",
      "title": "The Supreme Court rejects a nationwide opioid settlement with OxyContin maker Purdue Pharma",
      "url": "https://apnews.com/9859e83721f74f726ec16b6e07101c7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c017713245bc4818aba87675005fa30d/1920.jpeg"
    },
    {
      "author": "PAOLA FLORES and ISABEL DEBRE",
      "description": "LA PAZ, Bolivia (AP) — Supporters of Bolivia’s president rallied outside his palace on Thursday, giving some political breathing room to the embattled leader as authorities made more arrests in a failed coup that shook the economically troubled country a day earlier.",
      "publishedAt": "2024-06-27T11:55:30Z",
      "title": "After failed coup attempt, many Bolivians rally behind president, though some are wary",
      "url": "https://apnews.com/568a17444e3356bce9812b7979e933f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/accbfe4036004df4a922c70b3ac9e15b/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — Oklahoma’s top education official ordered public schools Thursday to incorporate the Bible into lessons for grades 5 through 12, the latest effort by conservatives to incorporate religion into classrooms.",
      "publishedAt": "2024-06-27T20:31:00Z",
      "title": "Oklahoma state superintendent orders schools to teach the Bible in grades 5 through 12",
      "url": "https://apnews.com/d15be2f74df2ffbbdfdc549569d06c4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0f1a472c25b48a7944c1ef7f0dbf032/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The federal judge presiding over the classified documents case of former President Donald Trump granted his request Thursday for a hearing on whether prosecutors had been permitted to improperly breach attorney-client privilege when they obtained crucial evidence from one of his ex-lawyers.",
      "publishedAt": "2024-06-27T16:58:13Z",
      "title": "Judge in Trump classified docs case grants his request for hearing on key evidence in indictment",
      "url": "https://apnews.com/8f91da1d6983abdf304be657df3c5ec1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84536b07d4a0423284dcbbbdcef41ab9/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — The most severely wounded survivor of the 2018 massacre at Parkland's Marjory Stoneman Douglas High School now owns shooter Nikolas Cruz's name, and Cruz cannot give any interviews without his permission, under a settlement reached in a lawsuit.",
      "publishedAt": "2024-06-27T21:44:51Z",
      "title": "Survivor of Parkland school massacre wins ownership of shooter's name in lawsuit settlement",
      "url": "https://apnews.com/99026cc37e145980dd763e1fd5b0952d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bc27539181543d293c7ccb21828eec1/2000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "BOSTON (AP) — Drivers for Uber and Lyft will earn a minimum pay standard of $32.50 per hour under a settlement announced Thursday by Massachusetts Attorney General Andrea Campbell, in a deal that also includes a suite of benefits and protections.",
      "publishedAt": "2024-06-27T23:24:02Z",
      "title": "Uber and Lyft agree to pay drivers $32.50 per hour in Massachusetts settlement",
      "url": "https://apnews.com/e366742fee78c342dc76c6ba9d47e60a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/711665448b254395b6bd7ad873200cdc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}