{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran fired air defenses at a major air base and a nuclear site near the central city of Isfahan after spotting drones early Friday morning, raising fears of a possible Israeli strike in retaliation for Tehran's unprecedented drone-and-missile assault on the country.",
      "publishedAt": "2024-04-19T01:55:21Z",
      "title": "Iran fires air defense batteries at Isfahan air base and nuclear site after drones spotted",
      "url": "https://apnews.com/a7ccbae2e2844bab089e8e4377a24ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/465894d5bc0b4cb795acbf166f9e659d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Iran fired air defense batteries Friday reports of explosions near a major air base at the city of Isfahan, the state-run IRNA news agency reported. It remained unclear if the country was under attack, but tensions remain high after Iran’s unprecedented missile-and-drone attack on Israel.",
      "publishedAt": "2024-04-18T12:55:20Z",
      "title": "The Latest | Iran says air defense batteries fire after explosions reported near major air base",
      "url": "https://apnews.com/dc34b0c2986834549da9fabd64ef1f7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02f9b417f1574adead845e7a348ba576/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — A third panel of potential jurors will be questioned Friday in Donald Trump’s hush money case, drawing jury selection a step closer to completion in the first criminal trial of a former U.S.",
      "publishedAt": "2024-04-19T04:03:35Z",
      "title": "Jury selection could be nearing a close in Donald Trump's hush money trial in New York",
      "url": "https://apnews.com/24147c3774c8a411044c530cafcab292",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a288a3db60b41e88fd4069719ebd065/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Millions of Indians began voting Friday in a six-week election that's a referendum on Narendra Modi, the populist prime minister who has championed an assertive brand of Hindu nationalist politics and is seeking a rare third term as the country's leader.",
      "publishedAt": "2024-04-19T01:33:50Z",
      "title": "Indians vote in the first phase of the world's largest election as Modi seeks a third term",
      "url": "https://apnews.com/7ea0983c9b7bc7506c8457f44afcfd64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e1b975b797c4e7abb398e6ebc9edf01/1920.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — One woman miscarried in the restroom lobby of a Texas emergency room as front desk staff refused to admit her. Another woman learned that her fetus had no heartbeat at a Florida hospital, the day after a security guard turned her away from the facility.",
      "publishedAt": "2024-04-19T04:03:06Z",
      "title": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom",
      "url": "https://apnews.com/9ce6c87c8fc653c840654de1ae5f7a1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/353ade75acd44a2cb2dbc02f7d7cc414/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "CHICAGO (AP) — The closure of Wadsworth Elementary School in 2013 was a blow to residents of the majority-Black neighborhood it served, symbolizing a city indifferent to their interests.So when the city reopened Wadsworth last year to shelter hundreds of migrants, without seeking community input, it added insult to injury.",
      "publishedAt": "2024-04-19T04:17:44Z",
      "title": "Chicago's response to migrant influx stirs longstanding frustrations among Black residents",
      "url": "https://apnews.com/ab8d7f22eea423d86fb350665b9e66f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d330cc6fed74dfd85d1a09e623bdca1/3000.jpeg"
    },
    {
      "author": "PAMELA SAMPSON",
      "description": "RAMAT GAN, Israel (AP) — When Ben Binyamin was left for dead, his right leg blown off during the Hamas attack on the Tribe of Nova music festival, the Israeli professional soccer player thought he would never again play the game he loved.",
      "publishedAt": "2024-04-19T04:12:43Z",
      "title": "Soldiers who lost limbs in Gaza fighting are finding healing on Israel's amputee soccer team",
      "url": "https://apnews.com/dbe42c8792fdcda4f315279ff02b09e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/179f35ab2a9a4b97b5225fec6cfd35df/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — The 12 students and one teacher killed in the Columbine High School shooting will be remembered Friday in a vigil on the eve of the 25th anniversary of the tragedy.",
      "publishedAt": "2024-04-19T04:03:43Z",
      "title": "12 students and teacher killed at Columbine to be remembered at 25th anniversary vigil",
      "url": "https://apnews.com/33c152265a36da8d47790ba17b5bf686",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/298e376ab8624a5c94635cd0a26f9976/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — House congressional leaders were toiling Thursday on a delicate, bipartisan push toward weekend votes to approve a $95 billion package of foreign aid for Ukraine, Israel and Taiwan, as well as several other national security policies at a critical moment at home and abroad.",
      "publishedAt": "2024-04-18T18:49:38Z",
      "title": "House leaders toil to advance Ukraine and Israel aid. But threats to oust speaker grow",
      "url": "https://apnews.com/21cc09d310a33d1d8ca88eadea896a36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d9d65a143124a1e8b638fe5a71ee018/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "Who knew what Taylor Swift's latest era would bring? Or even what it would sound like? Would it build off the moodiness of “Midnights” or the folk of “evermore”?",
      "publishedAt": "2024-04-19T04:01:25Z",
      "title": "Music Review: Taylor Swift's 'The Tortured Poets Department' is great sad pop, meditative theater",
      "url": "https://apnews.com/b24d2275df5cf78ffa9069c61b9825ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89ec7e787b02406480cddac1826146f4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}