{
  "articles": [
    {
      "author": "TIA GOLDENBERG and JOSEF FEDERMAN",
      "description": "TEL AVIV, Israel (AP) — Israeli leaders on Sunday credited an international military coalition with helping thwart a direct Iranian attack involving hundreds of drones and missiles, calling the coordinated response a starting point for a “strategic alliance” of regional opposition to Tehran.",
      "publishedAt": "2024-04-14T06:33:30Z",
      "title": "Israel is quiet on next steps against Iran -- and on which partners helped shoot down missiles",
      "url": "https://apnews.com/f27cda966ac274982d968cbcc033eff0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a93672df6f1447cf824dff66911c7fb9/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The unprecedented attack by Iran on Israel early Sunday ratcheted up regional tensions, confirming long-held fears about the Israel-Hamas war spiraling into a broader conflagration.",
      "publishedAt": "2024-04-14T09:56:16Z",
      "title": "Iran's attack on Israel raises fears of a wider war, but all sides have also scored gains",
      "url": "https://apnews.com/8ffb1a81e6769bb1d27c849e6108da36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9393a67f6d394d258c028e067098939a/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "TEL AVIV, Israel (AP) — Iran's dramatic aerial attack on Israel follows years of enmity between the countries and marks the first time Iran has launched a direct military assault on Israel. The hostility between the countries has only worsened in the six months since Hamas launched its attack on Israel, which set off a war that continues to threaten to drag the entire region toward a broader conflict.",
      "publishedAt": "2024-04-14T20:26:20Z",
      "title": "Iran and Israel have a history of enmity. What key recent events led to Iran's assault on Israel?",
      "url": "https://apnews.com/2df3508a73e8919050baf29b60855210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89f62a987791454a80a4ac2fadd7181d/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — President Joe Biden lauded American forces who helped Israel down “nearly all” of the drones and missiles fired by Iran and vowed to coordinate a global response to Tehran's unprecedented attack.",
      "publishedAt": "2024-04-13T17:52:29Z",
      "title": "US helps Israel shoot down 'nearly all' Iran-launched attack drones as Biden pledges support",
      "url": "https://apnews.com/c57e89a9cbe178b20b53bac404a86728",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e55f558891654644a814a994e9254e69/1920.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — Scottie Scheffler had no doubts about this Masters, and neither did anyone watching. He pulled ahead with magnificent shots Sunday around the turn and poured it on along the back nine at Augusta National for a 4-under 68 to claim his second green jacket in three years.",
      "publishedAt": "2024-04-14T13:32:26Z",
      "title": "Scottie Scheffler unstoppable and wins another Masters green jacket",
      "url": "https://apnews.com/8f9bcddc2f3c8aa4298a83c016286918",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69734f0eb85c440ca1ff78563ff093ba/2873.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Donald Trump's history-making criminal trial is set to start Monday with a simple but extraordinary procedural step that is vital to American democracy.",
      "publishedAt": "2024-04-14T03:58:26Z",
      "title": "A jury of his peers: A look at how jury selection will work in Donald Trump's first criminal trial",
      "url": "https://apnews.com/56d540406cd174ab143fe12469e9adef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c45f26b52d545e4845d808f2923f0d5/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson said Sunday he will try to advance wartime aid for Israel this week as he attempts the difficult task of winning House approval for a national security package that also includes funding for Ukraine and allies in Asia.",
      "publishedAt": "2024-04-14T16:44:51Z",
      "title": "House Speaker Mike Johnson says he will push for aid to Israel and Ukraine this week",
      "url": "https://apnews.com/912a7419b00749fbc2f472df93f67bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3ab269c7d924e5e9b706548733e2846/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Twelve news organizations on Sunday urged presumptive presidential nominees Joe Biden and Donald Trump to agree to debates, saying they were a “rich tradition” that have been part of every general election campaign since 1976.",
      "publishedAt": "2024-04-14T11:03:41Z",
      "title": "News organizations urge Biden and Trump to commit to presidential debates during the 2024 campaign",
      "url": "https://apnews.com/aa66e90b425e89578f3fe0358bffff5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac3bf561f545479bb99bb84eedd0ebab/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "GRANTS PASS, Oregon (AP) — A pickleball game in this leafy Oregon community was suddenly interrupted one rainy weekend morning by the arrival of an ambulance. Paramedics rushed through the park toward a tent, one of dozens illegally erected by the town's hundreds of homeless people, then play resumed as though nothing had happened.",
      "publishedAt": "2024-04-14T04:15:18Z",
      "title": "Can homeless people be fined for sleeping outside? A rural Oregon city asks the US Supreme Court",
      "url": "https://apnews.com/a8dcddb518bd76b11d409666c06701b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9406e3d90a849e8a5946e35526eb27d/1920.jpeg"
    },
    {
      "author": null,
      "description": "RICH CREEK, Va. (AP) — Gene Herrick, a retired Associated Press photographer who covered the Korean War and is known for his iconic images of Martin Luther King Jr., Rosa Parks and the trial of the killers of Emmett Till in the early years of the Civil Rights Movement, died Friday.",
      "publishedAt": "2024-04-14T16:27:44Z",
      "title": "Gene Herrick, AP photographer who covered the Korean war and civil rights, dies at 97",
      "url": "https://apnews.com/99c286e7b6802a626e23655605c7e2a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47dbe7e96f064e56a9a776bc2665b1e5/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}