{
  "articles": [
    {
      "author": "LOLITA C. BALDOR and JON GAMBRELL",
      "description": "WASHINGTON (AP) — Trucks carrying badly needed aid for the Gaza Strip rolled across a newly built U.S. pier and into the besieged enclave for the first time Friday as Israeli restrictions on border crossings and heavy fighting hindered the delivery of food and other supplies.",
      "publishedAt": "2024-05-17T06:14:53Z",
      "title": "US military says first aid shipment has been driven across a newly built US pier into the Gaza Strip",
      "url": "https://apnews.com/336c810724d107a41bb6628c721aea7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/475b1e85eed9410abddc2aa162533f22/2859.jpeg"
    },
    {
      "author": "BY BASSEM MROUE",
      "description": "BEIRUT (AP) — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles. The attack wounded three soldiers, one of them seriously, according to the Israeli military.",
      "publishedAt": "2024-05-17T05:17:35Z",
      "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on",
      "url": "https://apnews.com/cd9f59ffa7f876aa755b3c6612246763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ec92e7a45094755a9544ccb867d4db5/3000.jpeg"
    },
    {
      "author": "DAVID J. PHILLIP, LISA BAUMANN and CHRISTOPHER WEBER",
      "description": "HOUSTON (AP) — Fast-moving thunderstorms pummeled southeastern Texas for the second time this month, killing at least four people, blowing out windows in high-rise buildings, downing trees and knocking out power to more than 900,000 homes and businesses in the Houston area.",
      "publishedAt": "2024-05-17T01:04:14Z",
      "title": "Severe storms kill at least 4 in Houston, knock out power in Texas and Louisiana",
      "url": "https://apnews.com/d14447267de0a8900e1475a8ad7ed8ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd93920052dd49afa14706675bb8cdb7/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin said Friday that Moscow’s offensive in Ukraine’s northeastern Kharkiv region aims to create a buffer zone but has no plans to capture the city.",
      "publishedAt": "2024-05-17T06:29:04Z",
      "title": "Putin says Russia wants a buffer zone in Ukraine's Kharkiv but has no plans to capture the city",
      "url": "https://apnews.com/ce31e2e73cbb8dd59aa73baa6cd87d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44477062e2d848e1bd5f4fa8d9e61e6f/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "ST. PAUL, Minn. (AP) — Former President Donald Trump will head to Minnesota on a day off from his hush money trial for a Republican fundraiser Friday night in a traditionally Democratic state that he boasts he can carry in November.",
      "publishedAt": "2024-05-17T04:04:12Z",
      "title": "Trump will campaign in Minnesota after attending his son Barron's graduation",
      "url": "https://apnews.com/4f7ebfe7a2e1949d38a7c9894616a985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecdaced4077e4a8abb0a46b6ee5a3eff/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and EMILY WANG FUJIYAMA",
      "description": "BEIJING (AP) — Russian President Vladimir Putin focused on trade and cultural exchanges Friday during his state visit to China that started with bonhomie in Beijing and a meeting with Chinese leader Xi Jinping that deepened their “ no limits ” partnership as both countries face rising tensions with the West.",
      "publishedAt": "2024-05-17T04:42:12Z",
      "title": "Putin focuses on trade and cultural exchanges in Harbin, China, after reaffirming ties with Xi",
      "url": "https://apnews.com/907134e5d2ec2cc62376caca5d8df79b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae22039ad9624b60a799f13f66170778/1920.jpeg"
    },
    {
      "author": "JEFFREY SCHAEFFER and JOHN LEICESTER",
      "description": "ROUEN, France (AP) — French police shot and killed a man armed with a knife and a metal bar who is suspected of having set fire to a synagogue in the Normandy city of Rouen early on Friday, the latest apparent act in a storm of antisemitism roiling France amid the Israel-Hamas war.",
      "publishedAt": "2024-05-17T06:40:51Z",
      "title": "French police fatally shoot a man suspected of setting fire to a synagogue",
      "url": "https://apnews.com/08a1aaf0f60d5aa4bee9ef2c5e48e411",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80933fe9852e4c73bbf234b3b8ffdfb0/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN and CURT ANDERSON",
      "description": "STONECREST, Ga. (AP) — A funeral will be held Friday for a Black U.S. Air Force senior airman who was shot and killed in his Florida home by a sheriff's deputy, a day after the decorated military member's mother vowed during an emotional news conference to get justice for her son.",
      "publishedAt": "2024-05-17T04:10:28Z",
      "title": "Funeral set for Roger Fortson, the Black US Air Force member killed in his home by Florida deputy",
      "url": "https://apnews.com/6decf235d8acee616daaa5b9a08f85c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cebf789beb6b48be99a3f778fe9e7fe6/1920.jpeg"
    },
    {
      "author": "SHARON LURYE",
      "description": "On May 17, 1954, the Supreme Court laid out a new precedent: Separate but equal has no place in American schools.The message of Brown v.",
      "publishedAt": "2024-05-17T04:01:30Z",
      "title": "70 years after Brown v. Board, America is both more diverse — and more segregated",
      "url": "https://apnews.com/ed5ef043609496ddf0575d1c704f5c16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec898382d6dd4d6bbe0eac5a7e8c4cec/3000.jpeg"
    },
    {
      "author": "LERPONG AMSA-NGIAM",
      "description": "BANGKOK (AP) — Brazil will host the 2027 Women’s World Cup after a vote of FIFA’s full membership chose the South American bid over a joint proposal from Belgium, Netherlands and Germany.The FIFA Congress on Friday voted 119-78 for Brazil in the reduced field of two candidates to host the 2027 tournament after a joint bid by the United States and Mexico was pulled late last month, and South Africa withdrew its candidacy in November.",
      "publishedAt": "2024-05-17T05:56:04Z",
      "title": "Brazil picked by FIFA to get soccer's 2027 Women's World Cup, a first for South America",
      "url": "https://apnews.com/715931c7a235886e47a21498ec5d2229",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67482f25a83546398f9af8a8a413c037/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}