{
  "articles": [
    {
      "author": "SEUNG MIN KIM, JILL COLVIN and COLLEEN LONG",
      "description": "BROWNSVILLE, Texas (AP) — On the banks of the same Rio Grande but 300 miles apart, President Joe Biden and GOP challenger Donald Trump on Thursday surveyed the U.S.-Mexico border and tussled from a distance over who is to blame for the nation's broken immigration system and how to fix it.",
      "publishedAt": "2024-02-29T05:10:02Z",
      "title": "On the Rio Grande, 300 miles apart, Biden and Trump try to use immigration to election advantage",
      "url": "https://apnews.com/42c945d02742b169bde40601a27fde02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2827647381014feabca861cd2596b323/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops fired on a crowd of Palestinians racing to pull food off an aid convoy in Gaza City on Thursday, witnesses said. More than 100 people were killed in the chaos, bringing the death toll since the start of the Israel-Hamas war to more than 30,000, according to health officials.",
      "publishedAt": "2024-02-29T08:58:06Z",
      "title": "Palestinians say Israeli troops fired at people seeking food. Israel says scene was deadly stampede",
      "url": "https://apnews.com/f9b5a62a80d8b83eac4946d3c85af58b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a6206154a9345e683bd3cba850866c8/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "STINNETT, Texas (AP) — A dusting of snow covered a desolate landscape of scorched prairie, dead cattle and burned out homes in the Texas Panhandle on Thursday, giving firefighters brief relief in their desperate efforts to corral a blaze that has grown into the largest in state history.",
      "publishedAt": "2024-02-29T05:26:45Z",
      "title": "Texas battles historic wildfires as snow covers scorched land in the Panhandle",
      "url": "https://apnews.com/cbbb6a279bef1bd020722ed48927114a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/797924dd553847318891024dce969368/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congress passed another short-term spending measure Thursday that would keep one set of federal agencies operating through March 8 and another set through March 22, avoiding a shutdown for parts of the federal government that would otherwise kick in Saturday.",
      "publishedAt": "2024-02-29T18:58:34Z",
      "title": "Congress approves short-term extension to avoid shutdown, buy more time for final spending agreement",
      "url": "https://apnews.com/ca365b6aa96b00a718e491ef7449d9d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75d1653c14b24a7d9d12e4a274e19fdb/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — The transcript of the congressional deposition of Hunter Biden was released late Thursday, providing a full view of the contentious testimony that took place behind closed doors Wednesday as Republicans aggressively questioned the central figure in their impeachment inquiry.",
      "publishedAt": "2024-03-01T03:49:57Z",
      "title": "Takeaways from Hunter Biden's combative deposition with Republican lawmakers",
      "url": "https://apnews.com/50acadad1afc1efc1426828edb1b3ad9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4d61c99ea524a3096e72482a38931f6/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER AND OLGA R. RODRIGUEZ",
      "description": "RENO, Nev. (AP) — The most powerful Pacific storm of the season started barreling into the Sierra Nevada on Thursday, packing multiple feet of snow and dangerous winds that forecasters say will create blizzard conditions likely to close major highways and trigger power outages into the weekend.",
      "publishedAt": "2024-02-29T05:33:49Z",
      "title": "Blizzard warning, avalanche watch as storm packing up to 10 feet of snow moves into Sierra Nevada",
      "url": "https://apnews.com/07b91294ec6970453150a3df6d4135f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/037ff02d5361454ba1c35fdab1ffb44d/2000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Attorneys for Donald Trump and other defendants in the Georgia election interference case hoped that lawyer Terrence Bradley would provide key testimony in support of their effort to remove Fulton County District Attorney Fani Willis — and they had good reason for their optimism.",
      "publishedAt": "2024-03-01T01:16:23Z",
      "title": "Texts show prosecutor's ex-law partner gave info for effort to remove Fani Willis from election case",
      "url": "https://apnews.com/b10041b3446df0426ca8e3192a042162",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4eebd46b30da480bb57ca4be1fb65dc9/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "BOSTON (AP) — Jack Teixeira, the Massachusetts Air National Guard member accused of leaking highly classified military documents on a social media platform, is expected to plead guilty in his federal case, according to court papers filed Thursday.",
      "publishedAt": "2024-02-29T22:01:37Z",
      "title": "Pentagon leak suspect Jack Teixeira expected to plead guilty in federal case",
      "url": "https://apnews.com/cf5ef91310c58ebd1fffd2f6da148e8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f53131d8a3544e487dccee7726af95d/2556.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge held veteran investigative reporter Catherine Herridge in civil contempt on Thursday for refusing to divulge her source for a series of Fox News stories about a Chinese American scientist who was investigated by the FBI but never charged.",
      "publishedAt": "2024-02-29T23:35:51Z",
      "title": "Judge holds veteran journalist Catherine Herridge in civil contempt for refusing to divulge source",
      "url": "https://apnews.com/63f6b2cde67fceae192daebe5d11b1a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/179b0d78bb5a4a28944b8b5d0dc0cc2c/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR and JAKE COYLE",
      "description": "Ahead of the 96th Academy Awards on March 10, Associated Press Film Writers Jake Coyle and Lindsey Bahr share their predictions.",
      "publishedAt": "2024-02-29T14:43:10Z",
      "title": "What will win at the Oscars? AP's film writers set their predictions",
      "url": "https://apnews.com/e0e45fcb337adf4c62594a640320250c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56c8097d9b3b4210b37144658a11dabb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}