{
  "articles": [
    {
      "author": "EMMA BURROWS and DASHA LITVINOVA",
      "description": "Russians crowded outside polling stations at midday Sunday on the last day of a three-day presidential election, apparently heeding an opposition call to protest against President Vladimir Putin.",
      "publishedAt": "2024-03-17T05:27:51Z",
      "title": "Russians crowd polling stations in apparent protest as Putin is set to extend his rule",
      "url": "https://apnews.com/d4dcaa5c93dc44b745cec7d811831daa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d736fff197534bccb9513a82ac5eb778/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Stalled talks aimed at securing a cease-fire in the Israel-Hamas war are expected to resume in earnest in Qatar as soon as Sunday, according to Egyptian officials.",
      "publishedAt": "2024-03-16T10:21:21Z",
      "title": "Cease-fire talks with Israel and Hamas are expected to resume on Sunday in Qatar",
      "url": "https://apnews.com/53a0fff49d9196fc38f75ad1b37a64bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Hamas’ unprecedented raid on southern Israel has prompted a legal predicament: How does a country scarred by the deadliest attack in its history bring the perpetrators to justice?",
      "publishedAt": "2024-03-17T04:19:33Z",
      "title": "How should Israel bring to justice the perpetrators behind the worst attack in its history?",
      "url": "https://apnews.com/2af944dfd5a55dff0876fd3a9743afb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dc88efc70ac4845a30a86dfead636f4/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The big news this week, President Joe Biden said at a weekend Washington roast, was that two candidates had clinched their party's nomination for president.",
      "publishedAt": "2024-03-17T04:03:06Z",
      "title": "Biden says at DC roast that of 2 presidential candidates, 1 was mentally unfit. 'The other's me'",
      "url": "https://apnews.com/247fef0a2b13eac1e51eb1e4f93e7a8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10473c3c1e93420493a1188c12b78f3d/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and JILL COLVIN",
      "description": "VANDALIA, Ohio (AP) — Former President Donald Trump claimed that he — not President Joe Biden — will protect Social Security and warned of a “bloodbath” if he loses in November as he campaigned for Senate candidate Bernie Moreno in Ohio.",
      "publishedAt": "2024-03-16T22:52:17Z",
      "title": "Trump ramps up dark rhetoric in Ohio stump speech for Senate candidate Bernie Moreno",
      "url": "https://apnews.com/3b450dcfc24a02c8cac3a3feb657ddc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ba397c940fa45bd8e561a812792b01a/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Bhavani Mani Muthuvel and her family of nine have around five 20-liter (5-gallon) buckets worth of water for the week for cooking, cleaning and household chores. “From taking showers to using toilets and washing clothes, we are taking turns to do everything,” she said.",
      "publishedAt": "2024-03-17T02:11:03Z",
      "title": "India's Bengaluru is fast running out of water, and a long, scorching summer still looms",
      "url": "https://apnews.com/17554235dba0741a266f2251b91aec8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f181998565754fc5bd241f742879bcf1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A suspected attack by Yemen's Houthi rebels saw an explosive detonate near a ship early Sunday in the Gulf of Aden, potentially marking their latest assault on shipping through the crucial waterway leading to the Red Sea.",
      "publishedAt": "2024-03-17T02:15:14Z",
      "title": "A suspected attack by Yemen's Houthi rebels has targeted a ship in the Gulf of Aden",
      "url": "https://apnews.com/bf077f026a9f177ec87f4131d695cafc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e5366c4e28b4193a4297c308887667f/3000.jpeg"
    },
    {
      "author": "PATRICK ORSAGOS",
      "description": "LAKEVIEW, Ohio (AP) — Residents in a swath of the central U.S. hit by deadly tornadoes were cleaning up, assessing damage and helping neighbors on Saturday. But it will be a long recovery from the storms that ripped through parts of Ohio, Kentucky, Indiana and Arkansas.",
      "publishedAt": "2024-03-16T19:08:52Z",
      "title": "Long recovery ahead for some in path of deadly tornadoes in central US",
      "url": "https://apnews.com/b0fdb2f9945218f501bc218331a5b41d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27cb7f0baa2a4a6e83f0477faad483c1/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Two people have been killed and five others injured in a shooting in the nation’s capital early Sunday.Police were looking for a single gunman after the seven people were shot around 3 a.m.",
      "publishedAt": "2024-03-17T09:42:53Z",
      "title": "Shooting in Washington leaves 2 dead, 5 injured. Police are looking for a single gunman",
      "url": "https://apnews.com/83cfa06a0b09aa6e8c060a62a8811594",
      "urlToImage": ""
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Judge Juan M. Merchan looked across his high-ceilinged courtroom, facing the defendant in a complicated case.Not the one everyone knows about. Yes, Merchan could become the first judge ever to oversee a former U.S.",
      "publishedAt": "2024-03-17T05:23:05Z",
      "title": "'There's no agenda here': A look at the judge who is overseeing Trump's hush money trial",
      "url": "https://apnews.com/c227f5eab200cccffb19ed931b4dac92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5f9f4ebb4804490b7874a3648a9ab61/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}