{
  "articles": [
    {
      "author": "NICOLE WINFIELD",
      "description": "ABOARD THE PAPAL PLANE (AP) — Pope Francis on Friday slammed both U.S. presidential candidates for what he called anti-life policies on abortion and migration, and he advised American Catholics to choose who they think is the “lesser evil” in the upcoming U.S.",
      "publishedAt": "2024-09-13T17:52:47Z",
      "title": "Pope slams both Harris and Trump as 'against life' and urges Catholics to vote for 'lesser evil'",
      "url": "https://apnews.com/0e0faef49ff587098f75b265e386bf22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d8ddff5d6984c7b9aea8a2ed4866fe7/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, AAMER MADHANI, JILL COLVIN and BILL BARROW",
      "description": "RANCHO PALOS VERDES, Calif. (AP) — Donald Trump refused on Friday to condemn recent racist and conspiratorial comments from right-wing provocateur Laura Loomer, who traveled with him earlier this week to Tuesday night's presidential debate and several 9/11 memorial events.",
      "publishedAt": "2024-09-13T04:06:06Z",
      "title": "Trump refuses to criticize Laura Loomer amid concerns from Republican allies about her influence",
      "url": "https://apnews.com/4d01558e10a3cbf9bd8b921971e03de2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/098152d444c94521ba2b85e51376404c/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — Even as she promoted her efforts to boost clean energy, Vice President Kamala Harris said in Tuesday's debate that the Biden-Harris administration has overseen “the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over rely on foreign oil.″",
      "publishedAt": "2024-09-13T04:02:25Z",
      "title": "Harris supported the Green New Deal. Now, she's promoting domestic oil drilling",
      "url": "https://apnews.com/1b86dfb4297facd0b89c487724a9e5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da8ea37e7ffe43e6a7c03a5872d81558/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Ahead of the 2022 school year, the education technology company 21stCentEd was seeking to expand its presence in New York City's public schools. So they turned to a man, Terence Banks, whose new consulting firm promised to connect clients with top government stakeholders.",
      "publishedAt": "2024-09-13T17:49:09Z",
      "title": "A tech company hired a top NYC official's brother. A private meeting and $1.4M in contracts followed",
      "url": "https://apnews.com/b2369819ff7ccd4e630899eb08538bae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e365628cd5a3450b920bc6a809d69c00/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MEAD GRUVER",
      "description": "DENVER (AP) — A Colorado paramedic convicted in the death of Elijah McClain, a Black man whose name became part of the rallying cries for social justice that swept the U.S.",
      "publishedAt": "2024-09-13T21:09:30Z",
      "title": "Judge frees Colorado paramedic convicted in death of Elijah McClain from prison",
      "url": "https://apnews.com/9714cd7113c1bfead80714c0dbe461b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cfac16d82f441ad92da5174d76d2bf1/2748.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER, AUDREY McAVOY and GENE JOHNSON",
      "description": "HONOLULU (AP) — Investigators reviewing the emergency response to last year's wildfire that killed 102 people on Maui said in a report released Friday they found “no evidence” Hawaii officials made preparations for it, despite days of warnings that critical fire weather was coming.",
      "publishedAt": "2024-09-13T19:51:45Z",
      "title": "Report finds 'no evidence' Hawaii officials prepared for wildfire that killed 102 despite warnings",
      "url": "https://apnews.com/35b977e373d67c9bf721a7073fba543d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/374d3b33cdfc4dce8b1e1028c362b1f3/3000.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — U.S. stocks closed out their best week of the year with more gains on Friday and climbed to the cusp of their records.The S&amp;P 500 rose 0.5% for a fifth straight gain and is just 0.7% below its all-time high set in July.",
      "publishedAt": "2024-09-13T05:01:46Z",
      "title": "Stock market today: Wall Street’s best week of 2024 closes with indexes near their records",
      "url": "https://apnews.com/992f9fad504f4676f6b91a6ab2def6e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e7a5cd741a24e8787ca35dfb576f513/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "As the pregnant woman's contractions rolled in every two minutes, staff at Our Lady of the Lake Regional Medical Center in Baton Rouge, Louisiana, dispatched an ambulance to send her elsewhere.Just two minutes later, she gave birth to a 6-pound baby girl in the cab of the ambulance down the road from the 900-bed hospital.",
      "publishedAt": "2024-09-13T14:02:02Z",
      "title": "Feds rarely punish hospitals for turning away pregnant patients",
      "url": "https://apnews.com/6a0fa0a16a42e4ceb4c8c14c5cd2c0f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1f28378b6924ab49a9d0bc6216751f0/3000.jpeg"
    },
    {
      "author": "WAYNE PARRY",
      "description": "ATLANTIC CITY, N.J. (AP) — Just hours after it began, legal betting on the outcome of U.S. Congressional elections has been put on hold by a federal appeals court.The Court of Appeals for the District of Columbia Circuit issued an order Thursday night temporarily freezing the matter until it can consider and rule on the issue.",
      "publishedAt": "2024-09-13T19:23:44Z",
      "title": "After just a few hours, U.S. election bets put on hold by appeals court ruling",
      "url": "https://apnews.com/c060aad4d12f9622d36f83e525088dcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad200705fab649f7af69d44a37717851/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "SAG HARBOR, N.Y. (AP) — Justin Timberlake urged drivers not to get behind the wheel of a car after even a single alcoholic drink on Friday, shortly after pleading guilty to driving while impaired in New York’s Hamptons earlier this year.",
      "publishedAt": "2024-09-13T04:03:19Z",
      "title": "Justin Timberlake pleads guilty to impaired driving in New York",
      "url": "https://apnews.com/cef669c8c25fad277f47bd17536a2940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d18c08d8fc3043fea964ed416c4139c5/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}