{
  "articles": [
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israel sought Tuesday to contain the fallout from a request by the chief prosecutor of the world’s top war crimes court for arrest warrants for Israeli and Hamas leaders, a move supported by three European countries, including key ally France.",
      "publishedAt": "2024-05-21T07:38:07Z",
      "title": "Israel tries to contain the fallout after some allies support ICC prosecutor's request for warrants",
      "url": "https://apnews.com/a3320a77a3a6ccff41db2a4bc63e4aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0731ab89e44561a9536e4e96d48b13/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Mourners in black began gathering Tuesday for days of funerals and processions for Iran's late president, foreign minister and others killed in a helicopter crash, a government-led series of ceremonies aimed at both honoring the dead and projecting strength in an unsettled Middle East.",
      "publishedAt": "2024-05-21T08:19:46Z",
      "title": "Mourners begin days of funerals for Iran's president and others killed in helicopter crash",
      "url": "https://apnews.com/7bb445b5885fdf0ac8616820bf7f59f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6a1fd2010f34e48bf32995c6bbbadb2/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — A defense witness in Donald Trump's hush money case whom the judge threatened to remove from the trial over his behavior will return to the stand Tuesday as the trial nears its end.",
      "publishedAt": "2024-05-21T04:06:57Z",
      "title": "Defense witness who angered the judge in Trump's hush money trial will return to the stand",
      "url": "https://apnews.com/b1beb56a666c398ae5393ede16c326da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c014a47713e2402c8d01a71a2898028f/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and LISA MASCARO",
      "description": "WASHINGTON (AP) — In the hours after the attack on the U.S. Capitol on Jan. 6, 2021, Ohio’s then-Republican senator, Rob Portman, voted to accept President Joe Biden’s win over the defeated former president, Donald Trump, despite Trump’s false allegations that Biden only won because of fraud.",
      "publishedAt": "2024-05-21T04:01:28Z",
      "title": "Election deniers moving closer to GOP mainstream, report shows, as Trump allies fill Congress",
      "url": "https://apnews.com/460cde281d48e62e09e24c7573d6a9ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24eb1a23d5d74e3e829b41a7b9309c30/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — As president, Donald Trump imposed a 25% tariff on foreign steel, which hurt Clips &amp; Clamps Industries, a Michigan auto supplier — raising its materials prices, making it harder to compete with overseas rivals and costing it several contracts.",
      "publishedAt": "2024-05-21T10:00:24Z",
      "title": "Trump or Biden? Either way, US seems poised to preserve heavy tariffs on imports",
      "url": "https://apnews.com/1c17b1d223080b7a594326905380845a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee6b3e098ef7467f996944b733a1a101/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — One person has died aboard a London-Singapore flight that encountered severe turbulence, Singapore Airlines said Tuesday, in which the plane apparently plummeted for a number of minutes before it was diverted to Bangkok, where emergency crews rushed to help injured passengers amid stormy weather.",
      "publishedAt": "2024-05-21T10:26:03Z",
      "title": "1 dead, others injured after London-Singapore flight hit severe turbulence, Singapore Airlines says",
      "url": "https://apnews.com/5a9a268e1a6a6fb9ece7e58b5ea9231b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/517a74a64de34e3997b1feb7d7592e3f/2588.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — French President Emmanuel Macron is making a surprise trip to riot-hit New Caledonia, signaling French authorities’ growing confidence that reinforced security and emergency measures are bringing deadly unrest on the French Pacific territory under control.",
      "publishedAt": "2024-05-21T09:52:06Z",
      "title": "French president Emmanuel Macron is to visit violence-hit New Caledonia",
      "url": "https://apnews.com/0d1af256d3c782b7df0c90cbe6de8fae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d363014570554471ab06d54f4c130fe3/2000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "ABOARD THE THIRUKKURAL EXPRESS, India (AP) — The 1,800-mile (2,900-kilometer) journey south from New Delhi to Kanyakumari is one of the longest train rides in India, passing through cities, villages, scrub forests and deep ravines.",
      "publishedAt": "2024-05-21T04:23:25Z",
      "title": "Indian voters dissect Modi's politics while traversing the country by train",
      "url": "https://apnews.com/bc24fc9d405eb3bc50af63686fe06adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e727c41b90749778d59f37aff8e28dd/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and HAN GUAN NG",
      "description": "JINAN, China (AP) — Shi Mei and her husband earn a decent enough living by growing corn and millet on their small farm in eastern China's Shandong province. In 2021, they diversified by investing in solar energy — signing a contract to mount some 40 panels on their roof to feed energy to the grid.",
      "publishedAt": "2024-05-21T01:10:01Z",
      "title": "Corn, millet and ... rooftop solar? Farm family’s newest crop shows China’s solar ascendancy",
      "url": "https://apnews.com/34ec874e5b0ac1b3e370f928337ae752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a586171fa3784a4cb52ec21ba2543488/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KELVIN CHAN",
      "description": "SEOUL, South Korea (AP) — The world's leading artificial intelligence companies pledged at the start of a mini summit on AI to develop the technology safely, including pulling the plug if they can't rein in the most extreme risks.",
      "publishedAt": "2024-05-21T05:18:26Z",
      "title": "Seoul AI summit opens with companies including Google, Meta, OpenAI pledging to develop AI safely",
      "url": "https://apnews.com/2cc2b297872d860edc60545d5a5cf598",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83962646c1fe4ad8a625d59867549f15/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}