{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK, FARNOUSH AMIRI",
      "description": "The Senate has confirmed Pete Hegseth as the nation’s defense secretary in a dramatic late-night vote. Vice President JD Vance cast the tie-breaking vote Friday in a late-night session. Republicans had pushed back questions about Hegseth's qualifications amid allegations of heavy drinking and aggressive behavior toward women. GOP senators prioritized the former Fox News host and combat veteran’s vow to create a “warrior culture” at the Pentagon. President Donald Trump said, “We have a great secretary of defense and we’re very happy.\" Trump said. Hegseth's confirmation rounds out Trump’s top national security Cabinet officials.",
      "publishedAt": "2025-01-24T20:33:11Z",
      "title": "Hegseth confirmed as Trump's defense secretary in tie-breaking vote despite turmoil over his conduct",
      "url": "https://apnews.com/article/pete-hegseth-defense-secretary-trump-cabinet-confirmation-12491935023692bce0a04d149663e784",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1a0b30/2147483647/strip/true/crop/4890x2751+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F73%2F88c6c7501939221f3b3ee10fbd33%2F4c100b9254aa4e89b698e92b17486b91"
    },
    {
      "author": "GRAHAM LEE BREWER, JANIE HAR",
      "description": "U.S. President Donald Trump has said since his first administration that he wants to end birthright citizenship, a constitutional right for everyone born in the United States. This week he issued an executive order that would eliminate it, upending more than a century of precedent. The Department of Justice used the citizenship status of Native Americans as a legal analogy while defending the order in court. Over the years the right to citizenship has been won by various oppressed or marginalized groups after hard-fought legal battles.",
      "publishedAt": "2025-01-25T05:05:50Z",
      "title": "Trump's attempt to end birthright citizenship would overturn more than a century of precedent",
      "url": "https://apnews.com/article/trump-birthright-citizenship-native-chinese-executive-order-c163bbadd20609bd09fd5c5bccc6ba8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7c6c3a/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F29%2Fb22e290274be50eeb85a19479875%2F29629ecba735475ca929fe47a4651e30"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate is heading towards a vote on confirming South Dakota Gov. Kristi Noem as homeland security secretary. It would place her at the head of a sprawling agency that will be essential to both national security and President Donald Trump’s plans to squash illegal immigration. Republicans were determined to barrel through on Noem’s confirmation, threatening to keep the Senate working through the weekend to install Trump’s national security Cabinet officials. Defense Secretary Pete Hegseth won confirmation Friday night, and Secretary of State Marco Rubio and CIA Director John Ratcliffe were already in place.",
      "publishedAt": "2025-01-25T05:07:11Z",
      "title": "Senate moves to confirm Kristi Noem as Trump's homeland security secretary",
      "url": "https://apnews.com/article/kristi-noem-border-trump-44925ad8670cd4ad57427513915bb140",
      "urlToImage": "https://dims.apnews.com/dims4/default/194c1b3/2147483647/strip/true/crop/5921x3331+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fa6%2F182a753a42455a13bb68a15a1a07%2F7069a409e2db44c29709d97eb45919d6"
    },
    {
      "author": "MIKE CATALINI, REBECCA SANTANA",
      "description": "Less than a week into his presidency, the Trump administration is touting deportation efforts and has published new rules making it easier to remove people. Those are part of a flurry of actions to make good on campaign promises to crack down on illegal immigration. Amid officials’ latest show of force, waves of worry reverberated in parts of the country. Officials in Newark, New Jersey, are lashing out over what they called illegal arrests by immigration agents. Many of the ICE actions were not unusual. However, rumors of arrests and news reports or social media posts about the presence of agents are sparking concerns in some communities.",
      "publishedAt": "2025-01-24T16:31:17Z",
      "title": "Just days into the new Trump administration, worries spike amid a show of force on immigration",
      "url": "https://apnews.com/article/immigration-trump-border-migrants-immigration-enforcement-a24389b7fd7875ef98b4ab45c14e8418",
      "urlToImage": "https://dims.apnews.com/dims4/default/a00a88c/2147483647/strip/true/crop/2842x1599+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fb7%2F13124247868f25e9c8112f15bfa6%2Ff581fa4e128d46ccafa474e143bd416f"
    },
    {
      "author": "ELLEN KNICKMEYER, FARNOUSH AMIRI",
      "description": "The State Department has frozen new funding for almost all U.S. aid programs worldwide, making exceptions to allow humanitarian food programs and military aid to Israel and Egypt to continue. The order was sent Friday in a cable to U.S. embassies worldwide. The order threatened a quick halt to many of the billions of dollars in U.S.-funded projects globally to support health, education, development, job training, anti-corruption, security assistance and other efforts. The State Department will conduct a review of which of the thousands of programs can continue. Its order spells out the execution of an executive order signed by President Donald Trump on Monday.",
      "publishedAt": "2025-01-24T19:11:02Z",
      "title": "State Department freezes new funding for nearly all US aid programs worldwide",
      "url": "https://apnews.com/article/state-department-trump-foreign-aid-bf047e17ef64cb42a1a1b7fdf05caffa",
      "urlToImage": "https://dims.apnews.com/dims4/default/0dd4ec6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F6b%2F6fda641d2cd43a37c10569f0253a%2F02007acf720a4451aa00629cbe1fbe6c"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "China’s veteran foreign minister has issued a veiled warning to America’s new secretary of state: Behave yourself. Foreign Minister Wang Yi conveyed the message in a phone call Friday, their first conversation since Marco Rubio’s confirmation as secretary of state. Wang used a phrase typical of a Chinese teacher or boss warning a student or employee to behave and be responsible for their actions. The phrase seemed aimed at Rubio’s vocal criticism of China and its human rights record when he was a U.S. senator, which prompted the Chinese government to put sanctions on him twice in 2020.",
      "publishedAt": "2025-01-25T08:30:55Z",
      "title": "China warns Rubio to behave himself",
      "url": "https://apnews.com/article/china-us-rubio-wang-phone-0c2dfd278aa002cfb6100683daec5b7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f7a0bf1/2147483647/strip/true/crop/4852x2729+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F18%2F3b153abc416b3cb09ae8d3d26e52%2F29f76ff48834477c9a9ad7b003406231"
    },
    {
      "author": "WILL WEISSERT, CHRIS MEGERIAN",
      "description": "President Donald Trump is heading to hurricane-battered western North Carolina and wildfire-ravaged Los Angeles. It's the first trip of his second term. Trump has frequently blended politics and disasters, and Friday will likely be no different. He has sharply criticized President Joe Biden's administration for its handling of Hurricane Helene in North Carolina, and he's suggested withholding money from California unless it changes water policies. Trump will follow those stops with a Saturday victory rally in Las Vegas, where he plans to start detailing how he can begin keeping a campaign promise to exclude tips from federal taxes.",
      "publishedAt": "2025-01-24T05:05:04Z",
      "title": "Trump to visit disaster zones in North Carolina and California on first trip of second term",
      "url": "https://apnews.com/article/trump-first-trip-california-north-carolina-nevada-b906880254ce7bf249c3dcefa45bf846",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2e286f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F39%2F1e68945b0535510cdd007e62811b%2Ff0988800cf5c4ac3ba66c8d5add1f771"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Hamas militants have released four female Israeli soldiers they held captive for 15 months to the Red Cross in a planned exchange for 200 Palestinian prisoners or detainees in Israel. It’s the second exchange since a fragile ceasefire took effect last weekend. It has halted the fighting in Gaza for at least six weeks during which dozens of Israeli hostages and hundreds of Palestinian prisoners will be freed while more aid flows in. In exchange for the four soldiers being released Saturday, Israel should free 200 Palestinian prisoners or detainees, including 120 militants serving life sentences after being convicted of deadly attacks.",
      "publishedAt": "2025-01-25T09:15:59Z",
      "title": "Middle East latest: Hamas releases 4 Israeli soldiers in exchange for 200 Palestinian prisoners",
      "url": "https://apnews.com/article/israel-hamas-war-syria-lebanon-news-01-25-2025-bbd51c5e062ad0d256b4a017a9ccfc47",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ea0c0e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F29%2Fbec4b5382c3733914f82eed5f601%2F4bf7040553fe424d895a62da720307f4"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "Israel and Hamas are expected to swap more hostages for Palestinian prisoners. It would be the second such exchange since a ceasefire began in the Gaza Strip last weekend. It is another test for the truce that is aimed at winding down the deadliest and most destructive war ever fought between Israel and the militant group. The fragile deal has so far held, quieting airstrikes and rockets and allowing for increased aid to flow into the tiny coastal territory. When the ceasefire began Sunday, three hostages held by the militants were released in exchange for 90 Palestinian prisoners, all women and children. On Saturday, four hostages are expected to be freed for 200 prisoners.",
      "publishedAt": "2025-01-25T03:41:50Z",
      "title": "Israel and Hamas are set to swap more hostages for prisoners in another test of the Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-25-2025-150674e17bd8b22f2c2c3aa4991cf061",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b0ac5a/2147483647/strip/true/crop/5267x2963+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F7b%2F6892e7a3d64804b0c00056288851%2F2f20458ee9294e5bb5d01ba7c3d1df67"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Yemen’s Houthi rebels have unilaterally released 153 war detainees. That's according to a statement Saturday from the International Committee of the Red Cross. The Houthis had signaled Friday night they planned a release of prisoners, part of their efforts to ease tensions after the ceasefire in the Israel-Hamas war in the Gaza Strip. The Red Cross said it “welcomes this unilateral release as another positive step towards reviving negotiations” over ending the country’s long-running war. However, the release follows the Houthis detaining another seven Yemeni workers from the United Nations, sparking anger from the world body.",
      "publishedAt": "2025-01-25T08:21:14Z",
      "title": "Yemen's Houthis release 153 war detainees",
      "url": "https://apnews.com/article/yemen-houthi-rebels-prisoner-release-war-israel-hamas-7caad980b54c6097d727febf720cb090",
      "urlToImage": "https://dims.apnews.com/dims4/default/94b8824/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F5d%2F4d0f14a8d30ce34edbec56cfed7a%2Fa13c96c955f2424f8c47d4d2df154689"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}