{
  "articles": [
    {
      "author": "BILL BARROW, STEVE PEOPLES and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Two days after surviving an attempted assassination, former President Donald Trump appeared triumphantly at the Republican National Convention’s opening night with a bandage over his right ear, the latest compelling scene in a presidential campaign already defined by dramatic turns.",
      "publishedAt": "2024-07-16T04:04:51Z",
      "title": "Republican convention to focus on immigration a day after a bandaged Trump makes triumphant entrance",
      "url": "https://apnews.com/d832fedbbd0df0a4fa68f941474c0209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78369d7cd2084deaab5ac6f759e53fda/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "MILWAUKEE (AP) — The Republican National Convention heads into its second day Tuesday in Milwaukee — now with Donald Trump officially as its presidential nominee.",
      "publishedAt": "2024-07-16T04:08:36Z",
      "title": "What to watch as the Republican National Convention enters its second day in Milwaukee",
      "url": "https://apnews.com/1b9b66c874ac9a71a4e103f411857ab1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35ea74451e124c0fbfa0bf5e037bab7c/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and FARNOUSH AMIRI",
      "description": "MILWAUKEE (AP) — JD Vance is supposed to help Donald Trump win the Midwest this fall.",
      "publishedAt": "2024-07-16T04:12:45Z",
      "title": "JD Vance is a relative political unknown. He's been asked to help Donald Trump avenge his loss",
      "url": "https://apnews.com/5b698796a382d313155476b1ee3b7e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d61f1442834a4e7f92e7c53495049e81/1920.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — Jarring, chaotic and sudden, the bullet whizzed toward the stage where former President Donald Trump stood behind a podium speaking. In its wake: the potential for a horrifying and tragic chapter in American history.",
      "publishedAt": "2024-07-16T04:10:54Z",
      "title": "Trump's escape from disaster by mere inches reveals a tiny margin with seismic impact",
      "url": "https://apnews.com/1636c4cfc7d8a239bf83b9f64817eab0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f7a9e9e6da54f0c8ac87c4bfbf2f972/3000.jpeg"
    },
    {
      "author": "URI BLAU and MILAN CZERNY OF SHOMRIM and JOSEF FEDERMAN OF THE ASSOCIATED PRESS",
      "description": "JERUSALEM (AP) — Under American pressure, Israel has pledged to deliver large quantities of humanitarian aid into the war-ravaged Gaza Strip.",
      "publishedAt": "2024-07-16T04:24:05Z",
      "title": "Far-right groups that block aid to Gaza receive tax-deductible donations from US and Israel",
      "url": "https://apnews.com/69582d193ce270d63d5865ac0ead2df0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a371070803c64936be94e579ff5d4a32/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Police fired tear gas and charged with batons during violent clashes between a pro-government student body and student protesters overnight, leaving dozens injured at a public university outside Bangladesh’s capital, police and students said Tuesday.",
      "publishedAt": "2024-07-16T04:34:02Z",
      "title": "Violent clashes over quota system in government jobs leave scores injured in Bangladesh",
      "url": "https://apnews.com/c3982590332a1639c88a22257e20f7d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a90a4682ea9483da49f4cedd5c06371/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHICAGO (AP) — Storms spawning multiple tornadoes blew through Iowa, Illinois — including Chicago — and Indiana, Monday downing trees and power poles and cutting power to more than 460,000 customers and businesses.",
      "publishedAt": "2024-07-16T00:30:51Z",
      "title": "Severe storms with tornadoes whip through Midwest, cutting power to 460K",
      "url": "https://apnews.com/949aa0d324988c7920e2c16b2f7a2f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a4d7a80f62e4d838318e3ba9cc6490d/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO and NADIA LATHAN",
      "description": "AUSTIN, Texas (AP) — The majority of Houston outages that followed Hurricane Beryl should be fixed within the next two days, the city’s main utility company said Monday as Texas Gov. Greg Abbott threatened to punish CenterPoint Energy even after the lights come back.",
      "publishedAt": "2024-07-15T22:11:16Z",
      "title": "Texas governor criticizes Houston energy as utility says power will be mostly restored by Wednesday",
      "url": "https://apnews.com/23bb8aa69874c8019de237e5299492b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e532545b8cdb46e8916d7b25ad89750b/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS and HALELUYA HADERO",
      "description": "NEW YORK (AP) — Amazon Prime Day is here, and experts are reminding consumers to be wary of scams.",
      "publishedAt": "2024-07-16T04:08:48Z",
      "title": "Amazon Prime Day is a big event for scammers, experts warn",
      "url": "https://apnews.com/0059befef607ea6649b119e4ed7c6eae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c0bbc0b32784eb78c79091164eb1eb2/3000.jpeg"
    },
    {
      "author": "TOM NOUVIAN and SUMAN NAISHADHAM",
      "description": "PARIS (AP) — With the Paris Olympics less than two weeks away, a question hangs over the Games: Will the Seine River be clean enough for athletes to swim in?",
      "publishedAt": "2024-07-16T02:05:50Z",
      "title": "Will the Seine be clean enough by the Olympics? Not even the experts know yet",
      "url": "https://apnews.com/abde9a6ba9cc1617df1d0336743ee204",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2832180db034aa781bf0e85ce208fd9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}