{
  "articles": [
    {
      "author": "Matthew Lee, Aamer Madhani",
      "description": "President Donald Trump and French President Emmanuel Macron are starting their day by taking part in a virtual meeting with fellow leaders of the Group of Seven economies to discuss Russia's war in Ukraine. Trump welcomed Macron to the White House on Monday at a moment of deep uncertainty about the future of transatlantic relations. The Republican meets with British Prime Minister Keir Starmer on Thursday. Trump has transformed American foreign policy and effectively tuned out European leadership as he looks to quickly end the war. The “America First” president has cast a shadow over what veteran U.S. diplomats and ex-government officials had regarded as America’s calming presence of global stability.",
      "publishedAt": "2025-02-24T05:02:06Z",
      "title": "Trump meets Macron as uncertainty grows about US ties to Europe and Ukraine",
      "url": "https://apnews.com/article/trump-macron-ukraine-russia-starmer-8869d05f2cd8db5da277dd927cf959d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb72087/2147483647/strip/true/crop/4576x2574+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F96%2Fef70452e530099d7ff0fdad87a51%2F4924916f737f43149c764561aff1d36c"
    },
    {
      "author": "Edith M. Lederer",
      "description": "On the third anniversary of Russia’s invasion of Ukraine, the U.N. General Assembly is expected to vote on dueling resolutions. One is Ukraine’s European-backed proposal demanding an immediate withdrawal of Russian forces from the country. The other is a U.S. resolution for a swift end to the war that never mentions Moscow’s aggression. The Monday votes are a reflection of the tensions that have emerged between the U.S. and Ukraine after President Donald Trump suddenly opened negotiations with Russia in a bid to quickly resolve the conflict. General Assembly resolutions aren't legally binding but are seen as a barometer of world opinion.",
      "publishedAt": "2025-02-24T05:07:52Z",
      "title": "The UN will vote to demand Russia pull troops out of Ukraine. But the US wants a softer approach",
      "url": "https://apnews.com/article/un-russia-ukraine-war-resolution-trump-zelenskyy-cde221e5850196776525403e788c272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/80659f7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fac%2F38033569d166ffa08b0e3841d037%2Fbb62e87d3b264e148d436d3ff609f9ae"
    },
    {
      "author": "Adriana Gomez Licon, Eric Tucker",
      "description": "A former U.S. Secret Service agent who has penned best-selling books, ran unsuccessfully for office and gained fame as a conservative pundit with TV shows and a popular podcast has been chosen to serve as FBI deputy director. President Donald Trump announced the appointment on Dan Bongino on Sunday, praising him as “a man of incredible love and passion for our Country.” Trump says it's “great news for Law Enforcement and American Justice.” The selection places two staunch Trump allies atop the nation’s premier federal law enforcement agency when Democrats are concerned the Republican president could seek to target his adversaries. Bongino would serve under Kash Patel, who was sworn in as FBI director Friday.",
      "publishedAt": "2025-02-24T02:34:35Z",
      "title": "President Trump appoints Dan Bongino as FBI deputy director",
      "url": "https://apnews.com/article/trump-fbi-bongino-patel-cad5f4ea22ada9768ea90a08168568d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/adcabc9/2147483647/strip/true/crop/2668x1501+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F84%2F939857f3b7295d34048af2b1e100%2Fe5bb391e1aad4e50804f2b41846d2978"
    },
    {
      "author": "Joey Cappelletti",
      "description": "President Donald Trump’s real-time confrontation with Maine’s governor over transgender athletes captured the conundrum many Democratic governors are facing in the Republican’s second term. Gov. Janet Mills’ vow that she would see Trump in court over his threat to withhold money from the state if it didn’t comply with his executive order delighted Democrats who want more strident pushback. But the dust-up that played out in the open Friday as Trump hosted governors at the White House ticked off a president known to retaliate against people he considers enemies. Democratic governors are trying to strike a balance between their states’ needs and their feelings about Trump.",
      "publishedAt": "2025-02-23T21:26:17Z",
      "title": "Democratic governors mull whether to fight or pacify after Trump threatens one of their own",
      "url": "https://apnews.com/article/governors-trump-whitmer-mills-transgender-musk-tariffs-486b591a9a3362906c4f7a60a88da231",
      "urlToImage": "https://dims.apnews.com/dims4/default/90c317e/2147483647/strip/true/crop/7702x4332+0+401/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F69%2F976a4959fc5ee35253f8bed3d127%2F0104a34b655b48749688361d40576d6c"
    },
    {
      "author": "Joshua Goodman, Jim Mustian, Eric Tucker",
      "description": "Emil Bove is President Donald Trump’s chief enforcer at the Justice Department. In just a month as the agency’s acting No. 2 official, Bove has plowed through norms and niceties, whether scolding FBI leadership for “insubordination” in refusing his request to hand over the names of agents who investigated the January 2021 assault on the U.S. Capitol or forcing out attorneys who worked those cases. The moves have spurred intense criticism from legal scholars and former prosecutors. But Bove has brushed aside such concerns in a way that is not at all surprising to many who knew him when he was litigating drug and terrorism cases as a federal prosecutor in New York City.",
      "publishedAt": "2025-02-24T13:27:32Z",
      "title": "Emil Bove, Trump's Justice Department enforcer, is no stranger to complaints about his conduct",
      "url": "https://apnews.com/article/emil-bove-trump-fbi-enforcer-firings-3f85887e92154b14f7e04cfc521a0399",
      "urlToImage": "https://dims.apnews.com/dims4/default/5688acc/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd2%2Fdbafab1b6c61cd45b33c040a85e6%2F06d1369792c24a9e9353588fcedb52d8"
    },
    {
      "author": "Geir Moulson",
      "description": "Germany faces its second change of leader in less than four years after the head of the center-right opposition won Sunday’s election. The vote saw a surge for a far-right party and a stinging defeat for outgoing Chancellor Olaf Scholz. After the collapse of Scholz’s three-party government in November, it’s now up to Friedrich Merz to restore stability to Germany. His most realistic option is to form a coalition with Scholz's Social Democrats. The two parties were Germany's post-World War II heavyweights. But their combined showing Sunday was their weakest since the postwar republic was founded. Meanwhile, while the far-right Alternative for Germany made the biggest gains, the Left Party made the most unexpected.",
      "publishedAt": "2025-02-24T11:41:56Z",
      "title": "The biggest takeaways from Germany's election",
      "url": "https://apnews.com/article/german-elections-2025-results-afd-merz-20b81137f6e9087d631a59fe13cc8d0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/741e137/2147483647/strip/true/crop/3862x2172+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2Fe5%2F17aadb211046a909e84968ce635e%2F1e91d10fce4440f38952a80b19801ecd"
    },
    {
      "author": "Tia Goldenberg, Majdi Mohammed",
      "description": "Israeli tanks have moved into the occupied West Bank for the first time since 2002, shortly after the defense minister said troops will remain “for the coming year” in parts of the Palestinian territory. Associated Press journalists saw a handful of tanks move Sunday into Jenin, long a bastion of armed struggle against Israel. Israel is deepening its crackdown on the Palestinian territory and has said it is determined to stamp out militancy amid a rise in attacks. Israel launched the broad offensive in the West Bank on Jan. 21 — two days after the current ceasefire in Gaza took hold.",
      "publishedAt": "2025-02-23T09:21:59Z",
      "title": "Israel expands into West Bank and says troops to remain for a year",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-23-2025-1c2dc86afd2e05888d5d588f462e898b",
      "urlToImage": "https://dims.apnews.com/dims4/default/71dc539/2147483647/strip/true/crop/5363x3017+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F96%2F5ae87cce7489a7e4639afafa8f19%2F415a1f18aaa84a9dbd1ba9549a9e8ae4"
    },
    {
      "author": "Cora Lewis",
      "description": "If you're an American with a disability who receives government assistance, you likely qualify for an ABLE account, or you may starting next year. These little-known accounts allow Americans with disabilities to save and invest money without the risk of losing benefits like Supplemental Security Income or Medicaid. Beginning in 2026, they'll become available to people diagnosed with a disability before the age of 46, up from the current threshold of 26, increasing access to the accounts by 6 million people. But state treasurers and experts say raising awareness of the accounts is a challenge.",
      "publishedAt": "2025-02-24T10:01:50Z",
      "title": "These little-known bank accounts allow Americans with disabilities to save and invest",
      "url": "https://apnews.com/article/able-account-disabilities-savings-439fe21204ff443a1c0d907a112b99a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f010c9/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F3d%2F018d95edc9a5493eac8fa28ee4cf%2F7f6f7559a8404948be147923331cf5b3"
    },
    {
      "author": "Lindsay Whitehurst, Chris Megerian",
      "description": "Attorneys for federal workers say in a lawsuit billionaire Trump adviser Elon Musk violated the law with his weekend demand that employees explain their accomplishments or risk being fired. Their updated lawsuit was filed in federal court in California on Monday. Musk is pressing his demand despite confusion spreading through the government and conflicting instructions from top officials. The deadline is 11:59 p.m. EST Monday. Lawmakers in both major political parties say Musk’s mandate may be illegal. President Donald Trump over the weekend called for Musk to be more aggressive in his cost-cutting crusade through the Department of Government Efficiency. The Republican president posted a meme on social media mocking federal employees.",
      "publishedAt": "2025-02-24T05:13:23Z",
      "title": "Federal workers sue over Elon Musk's threat to fire them if they don't explain their accomplishments",
      "url": "https://apnews.com/article/musk-trump-federal-workers-firings-email-9785e7f74eb2a8b8fde5e01ff0c7717f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d42628/2147483647/strip/true/crop/5596x3148+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F2c%2Fffa647c4ee6f99be0f67986359eb%2Fb7390a153f264c67954cb0fc36549e12"
    },
    {
      "author": null,
      "description": "A dozen leaders from Europe and Canada arrived in Ukraine’s capital by train Monday morning to mark the third anniversary of Russia’s invasion. The visitors were greeted at the station by Ukrainian Foreign Minister Andrii Sybiha and the president’s chief of staff Andrii Yermak. Among them were European Commission President Ursula von der Leyen and Canadian Prime Minister Justin Trudeau. Von der Leyen wrote on social media that Europe's destiny was at stake. The guests were set to attend events dedicated to the anniversary and discuss supporting Ukraine amid a recent U.S. policy shift under President Donald Trump.",
      "publishedAt": "2025-02-24T06:32:17Z",
      "title": "Foreign leaders visit Ukraine's capital to mark third war anniversary",
      "url": "https://apnews.com/article/russia-ukraine-war-anniversary-84e4c62519fc15b34e17f661cf3dd20e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d41efa0/2147483647/strip/true/crop/6889x3875+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fad%2F065b365e7b2ab1dbefa1d23dc59c%2F72d93c5e7f7a4a31a2243ec36b3a9567"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}