{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — At least 30 premature babies were evacuated from Gaza's main hospital on Sunday and will be transferred to facilities in Egypt, the territory's Health Ministry said, as scores of other critically wounded patients remained stranded there days after Israeli forces entered the compound.",
      "publishedAt": "2023-11-19T07:14:03Z",
      "title": "At least 30 premature babies evacuated from Gaza’s main hospital and will be transferred to Egypt",
      "url": "https://apnews.com/08a2f441a9ea03bf0bb3db0de6fc5408",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1769b23d94674a63ae6383ed414060e7/3000.jpeg"
    },
    {
      "author": "JEFFREY SCHAEFFER and HELENA ALVES",
      "description": "PARIS (AP) — Survivors of Nazi atrocities joined young Jewish activists outside the Paris Holocaust memorial Saturday to sound the alarm about resurgent antisemitic hate speech, graffiti and abuse linked to the Israel-Hamas war.",
      "publishedAt": "2023-11-18T18:07:14Z",
      "title": "French Holocaust survivors are recoiling at new antisemitism, and activists are pleading for peace",
      "url": "https://apnews.com/ebdd7e9afad5c2cfc6b58c71fa75b80a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/835c0f7528134958b03e127cca4338a6/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEMPHIS, Tenn. (AP) — A suspect in Tennessee died of an apparent self-inflicted gunshot while on the run early Sunday after he allegedly killed four and seriously injured a fifth victim during a deadly outbreak of domestic violence Saturday night, police said.",
      "publishedAt": "2023-11-19T08:12:25Z",
      "title": "Memphis shooting suspect kills self after 3 women and girl killed and teen girl wounded",
      "url": "https://apnews.com/71e638797ec0f07d06e4ec260e5776fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ef81bb6efb46a09c6cc71b4ee93f8e/2000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL and CHINEDU ASADU",
      "description": "Skyrocketing sugar prices left Ishaq Abdulraheem with few choices. Increasing the cost of bread would mean declining sales, so the Nigerian baker decided to cut his production by half.For scores of other bakers struggling to stay afloat while enduring higher costs for fuel and flour, the stratospheric sugar prices proved to be the last straw, and they closed for good.",
      "publishedAt": "2023-11-19T05:22:07Z",
      "title": "Sugar prices are rising worldwide after bad weather tied to El Nino damaged crops in Asia",
      "url": "https://apnews.com/7c3cc615764b97b7d821fd6b31658f41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c2ee0798a19491ab5e32c0da78bc74d/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — Officials trying to reach 41 workers who have been trapped in a collapsed tunnel in northern India for eight days were contemplating alternative rescue plans Sunday after snags with a drilling machine caused them to halt digging.",
      "publishedAt": "2023-11-19T05:48:41Z",
      "title": "41 workers in India are stuck in a tunnel for an 8th day. Officials consider alternate rescue plans",
      "url": "https://apnews.com/89fbf613cdcf81e90da770e60670916c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/873450e3876e4059945421749a36b650/2894.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "ALBANY, N.Y. (AP) — For a year, a special New York law has cleared the way for a wave of headline-grabbing lawsuits against famous men accused of sexual misconduct, including former President Donald Trump, hip hop mogul Sean “Diddy” Combs and the comedian and actor Russell Brand.",
      "publishedAt": "2023-11-19T06:57:39Z",
      "title": "A law that launched 2,500 sex abuse suits is expiring. It’s left a trail of claims vs. celebs, jails",
      "url": "https://apnews.com/6fd16aa4cc992c089e91c6fef064f375",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b02ee2b5f8d24b27b7f075b5e7733767/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — Oregon's first-in-the-nation law that decriminalized the possession of small amounts of heroin, cocaine and other illicit drugs in favor of an emphasis on addiction treatment is facing strong headwinds in the progressive state after an explosion of public drug use fueled by the proliferation of fentanyl and a surge in deaths from opioids, including those of children.",
      "publishedAt": "2023-11-19T05:07:32Z",
      "title": "Oregon's first-in-the-nation drug decriminalization law faces growing pushback amid fentanyl crisis",
      "url": "https://apnews.com/bb209e6ba9835c69f95b093c8ee00279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d73b558d7794246856a1bdecc444c30/2500.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "TORVAIANICA, Italy (AP) — Pope Francis’ recent gesture of welcome for transgender Catholics has resonated strongly in a working class, seaside town south of Rome, where a community of trans women has found help and hope through a remarkable relationship with the pontiff forged during the darkest times of the pandemic.",
      "publishedAt": "2023-11-19T05:10:19Z",
      "title": "For this group of trans women, the pope and his message of inclusivity are a welcome change",
      "url": "https://apnews.com/b3d67868504ba701cce09da9ecc94de0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b0416fffb3b4673847ef6d62df03e5c/3000.jpeg"
    },
    {
      "author": "THOMAS PEIPERT and JESSE BEDAYN",
      "description": "COLORADO SPRINGS, Colo. (AP) — After the mass shooting last November at an LGBTQ+ nightclub in Colorado Springs that turned a drag queen’s birthday celebration into a massacre, the conservative community was forced to reckon with its reputation for being unwelcoming to gay, lesbian and transgender people.",
      "publishedAt": "2023-11-19T06:06:25Z",
      "title": "LGBTQ+ advocates say work remains as Colorado Springs marks anniversary of nightclub attack",
      "url": "https://apnews.com/7acaa2b5716cae8d52291d071119a624",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbe25c21f6c145aa9c6da1603bd32547/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Voters in Argentina were heading to the polls Sunday in a presidential runoff election that will determine whether South America’s second-largest economy will take a rightward shift.",
      "publishedAt": "2023-11-19T05:12:12Z",
      "title": "Argentines vote in an election that could lead a Trump-admiring populist to the presidency",
      "url": "https://apnews.com/a4811c5229d35551f8dbf7056d87aae6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ccddc5fb9ae479089829555a515f4f6/2879.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}