{
  "articles": [
    {
      "author": "NICK PERRY",
      "description": "GILFORD, N.H. (AP) — A costumed skier races down a slope, hits a pond and hydroplanes halfway across. He pirouettes and then plunges into the icy water before jumping up and waving to the cheering crowd.",
      "publishedAt": "2024-04-20T04:04:54Z",
      "title": "Soar, slide, splash? It’s skiers’ choice as spring’s wacky pond skimming tradition returns",
      "url": "https://apnews.com/50186ca74a45637e34e364ca10715a26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb712c2b277947d2808d39e2b9d2c45a/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House swiftly approved $95 billion in foreign aid for Ukraine, Israel and other U.S.",
      "publishedAt": "2024-04-20T04:50:16Z",
      "title": "The House passes billions in aid for Ukraine and Israel after months of struggle. Next is the Senate",
      "url": "https://apnews.com/a8910452e623413bf1da1e491d1d94ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb86aa4e6cdf407d8102694c4031c337/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and HALELUYA HADERO",
      "description": "WASHINGTON (AP) — The House passed legislation Saturday that would ban TikTok in the United States if the popular social media platform's China-based owner doesn’t sell its stake within a year, but don't expect the app to go away anytime soon.",
      "publishedAt": "2024-04-20T17:23:26Z",
      "title": "The House votes for possible TikTok ban in the US, but don't expect the app to go away anytime soon",
      "url": "https://apnews.com/de12b4d22aa8095e62cb0982a6e62235",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da6d32fa06b04a91bae651a5527e8aff/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WILMINGTON, N.C. (AP) — Donald Trump had to cancel his first planned rally Saturday since the start of his criminal hush money trial because of a storm in North Carolina, an added complication for the former president and presumptive Republican nominee as he juggles legal troubles and his rematch against President Joe Biden.",
      "publishedAt": "2024-04-20T04:27:46Z",
      "title": "Donald Trump has to cancel North Carolina rally because of weather",
      "url": "https://apnews.com/3ec1ed00dec83a0a528b4c55932ad362",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/989e7a27467143cb92058739134ff751/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israel demonstrated its military dominance over adversary Iran in its apparent precision strikes that hit near military and nuclear targets deep in the heart of the country, meeting little significant challenge from Iran's defenses and providing the world with new insights into both militaries' capabilities.",
      "publishedAt": "2024-04-20T04:40:01Z",
      "title": "Israel and Iran's apparent strikes and counterstrikes give new insights into both militaries",
      "url": "https://apnews.com/fdc927f764375fabf88041f5a63f3e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0afb8bf42903465c9eee0cafae235ac4/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden can breathe a bit easier, at least for the moment, now that Israel and Iran appear to have stepped back from the brink of tipping the Middle East into all-out war.",
      "publishedAt": "2024-04-20T13:13:52Z",
      "title": "Biden avoids a further Mideast spiral as Israel and Iran show restraint. But for how long?",
      "url": "https://apnews.com/1c1da43c7a8482e9e415dc73d8c34013",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38e80b4d8cc34425b4acab35888d2143/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — An Israeli airstrike on a house in Gaza’s southernmost city of Rafah killed at least nine people, six of them children, hospital authorities said Saturday, as Israel pursued its nearly seven-month offensive in the besieged Palestinian territory.",
      "publishedAt": "2024-04-20T09:33:08Z",
      "title": "An Israeli airstrike in Gaza's south kills at least 9 Palestinians in Rafah, including 6 children",
      "url": "https://apnews.com/05df312cfce4dc546837b2499fdbae02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a24e01178354408d965003bfa9102935/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The most significant case in decades on homelessness has reached the Supreme Court as record numbers of people in America are without a permanent place to live.",
      "publishedAt": "2024-04-20T13:04:26Z",
      "title": "Record numbers in the US are homeless. Can cities fine them for sleeping in parks and on sidewalks?",
      "url": "https://apnews.com/e036c7041cba08d50e3d855942961253",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9406e3d90a849e8a5946e35526eb27d/1920.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "CONCORD, Calif. (AP) — A year before I-Ting Quinn's son was old enough for kindergarten, she and her husband had the option to enroll him in “transitional kindergarten,” a program offered for free by California elementary schools for some 4-year-olds.",
      "publishedAt": "2024-04-20T04:39:48Z",
      "title": "California is rolling out free preschool. That hasn't solved challenges around child care",
      "url": "https://apnews.com/b30a4aa930e28228d3046543bdb6e242",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acb6ec7b818a4be48a8ae8cfea63b3a6/3000.jpeg"
    },
    {
      "author": "DAVID CRARY",
      "description": "Passover is a major Jewish holiday, celebrated over seven or eight days each year, commemorating the exodus of ancient Israelites from slavery in Egypt, as recounted in the Bible. To many Jews, it symbolizes freedom and the birth of a Jewish nation.",
      "publishedAt": "2024-04-20T12:02:51Z",
      "title": "War, hostages, antisemitism: A somber backdrop to this year's Passover observances",
      "url": "https://apnews.com/0c029de3a2db1ffe4474daa7a881cdf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff2577d6801742d9ad1eade6d90e2968/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}