{
  "articles": [
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — An unusually strong solar storm hitting Earth could produce northern lights in the U.S. this weekend and potentially disrupt power and communications.The National Oceanic and Atmospheric Administration issued a rare severe geomagnetic storm warning when a solar outburst reached Earth on Friday afternoon, hours sooner than anticipated.",
      "publishedAt": "2024-05-10T14:12:06Z",
      "title": "Strong solar storm hits Earth, could disrupt communications and produce northern lights in US",
      "url": "https://apnews.com/fc23251025efc2d20dc128dc0b6a7c68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c45b540af0b4404b019d997f4783882/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The alleged sexual encounter at the center of Donald Trump's criminal hush money trial got a graphic airing in court this past week as porn actor Stormy Daniels shared her account before a rapt jury.",
      "publishedAt": "2024-05-11T04:06:20Z",
      "title": "Trump trial turns to sex, bank accounts and power: Highlights from the third week of testimony",
      "url": "https://apnews.com/c69d54c51e2fccbbc0b19e2220222b0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f885f342e878451e99a1bc6026de0c5d/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, AAMER MADHANI and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration said Friday that Israel's use of U.S.-provided weapons in Gaza likely violated international humanitarian law but that wartime conditions prevented U.S. officials from determining that for certain in specific airstrikes.",
      "publishedAt": "2024-05-10T16:21:18Z",
      "title": "US says Israel’s use of US arms likely violated international law, but evidence is incomplete",
      "url": "https://apnews.com/c83b6f39ce2799e5d2c473a337e2f857",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dd00633bff5426a9f8f9de4e3a81002/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI and MICHAEL CASEY",
      "description": "Police made dozens of arrests as pro-Palestinian protest encampments were dismantled Friday at the University of Pennsylvania and the Massachusetts Institute of Technology, hours after police tear-gassed demonstrators and took down a similar camp at the University of Arizona.",
      "publishedAt": "2024-05-10T10:02:57Z",
      "title": "Police arrest dozens as they break up pro-Palestinian protests at several US universities",
      "url": "https://apnews.com/7d9cd0a1f4ac7eaca41b38de798a2217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa86470672cf475ead31a722ce032d06/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER and TOM KRISHER",
      "description": "TUSCALOOSA, Ala. (AP) — After 20 years at the Mercedes-Benz factory in Alabama, Brett Garrard said he is “not falling for the lies anymore” and will vote for a union. The company has repeatedly promised to improve pay and conditions, but Garrard said those promises have not materialized.",
      "publishedAt": "2024-05-11T04:07:25Z",
      "title": "The United Auto Workers faces a key test in the South with upcoming vote at Alabama Mercedes plant",
      "url": "https://apnews.com/74fab1ec4b1a5d026b3852a009a2ebb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8657627730fc4dbdb82afd8047f21946/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — For Mike Johnson it was effectively a Day 1 priority. It's well past time, the newly elected House speaker said in October, to establish a bipartisan commission to tackle the federal government's growing $34.6 trillion in debt.",
      "publishedAt": "2024-05-11T04:04:38Z",
      "title": "America's debt tops $34 trillion, but a commission to address it appears dead in Congress",
      "url": "https://apnews.com/5075a3c7890d2f3b7f21b4eeda9372eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2bbb82ac1db41c18c16475a7f1598fb/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and ELÉONORE HUGHES",
      "description": "ELDORADO DO SUL, Brazil (AP) — More heavy rain is forecast for Brazil’s already flooded Rio Grande do Sul state, where many of those remaining are poor people with limited ability to move to less dangerous areas.",
      "publishedAt": "2024-05-11T04:02:14Z",
      "title": "Flooding forecast to worsen in Brazil's south, where often only the poor remain",
      "url": "https://apnews.com/8a1d0e3a00bfd9a5b7918e62d6aab02a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/860a7b904d7b4094be9d0df4a61fd053/1920.jpeg"
    },
    {
      "author": "ALMA SOLÍS",
      "description": "PANAMA CITY (AP) — Panama is on the verge of a dramatic change to its immigration policy that could reverberate from the dense Darien jungle to the U.S. border.President-elect José Raúl Mulino says he will shut down a migration route used by more than 500,000 people last year.",
      "publishedAt": "2024-05-11T04:06:48Z",
      "title": "Panama's next president says he'll try to shut down one of the world's busiest migration routes",
      "url": "https://apnews.com/f46becc989e0f2c944922b03e6417a3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bcac7545cc948e18706e13f44e74215/3000.jpeg"
    },
    {
      "author": "ANNA FURMAN",
      "description": "Over the past two decades, Gee’s Bend quilts have captured the public’s imagination with their kaleidoscopic colors and their daring geometric patterns. The groundbreaking art practice was cultivated by direct descendants of slaves in rural Alabama who have faced oppression, geographic isolation and intense material constraints.",
      "publishedAt": "2024-05-11T04:35:26Z",
      "title": "They made one-of-a-kind quilts that captured the public's imagination. Then Target came along",
      "url": "https://apnews.com/c6e1d9500ef044e34c2ae329ce0917c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/506b85fafb3048b1bf546d0a162a25bd/2048.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "As cars and trucks get smarter and more connected, the humble lights that have controlled the flow of traffic for more than a century could also be on the cusp of a major transformation.Researchers are exploring ways to use features in modern cars, such as GPS, to make traffic safer and more efficient.",
      "publishedAt": "2024-05-11T04:13:50Z",
      "title": "Red, yellow, green ... and white? Smarter vehicles could mean big changes for the traffic light",
      "url": "https://apnews.com/757d6151e85565e9656d7b95c6e72490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d525446f65404b398a4354ecc3cf1f7f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}