{
  "articles": [
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — A crane appeared at the site of a collapsed highway bridge in Baltimore as crews prepared Friday to begin clearing wreckage that has stymied the search for four missing workers and blocked ships from entering or leaving the city's vital port.",
      "publishedAt": "2024-03-29T04:08:40Z",
      "title": "Cranes arriving to start removing wreckage from deadly Baltimore bridge collapse",
      "url": "https://apnews.com/7d27a5c561f9f3359935a56139623108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b8d551e2e34d3e8e4e047f9a99e986/1920.jpeg"
    },
    {
      "author": "BEN FINLEY and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Rebuilding Baltimore’s collapsed Francis Scott Key Bridge could take anywhere from 18 months to several years, experts say, while the cost could be at least $400 million — or more than twice that.",
      "publishedAt": "2024-03-29T04:10:34Z",
      "title": "Building a new Key Bridge could take years and cost at least $400 million, experts say",
      "url": "https://apnews.com/a126a3b732af95e86d1fbef01e9fb487",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98069b3fc77645b6a085e66af04c7dc3/3000.jpeg"
    },
    {
      "author": "MITCH WEISS and KRISTIN M. HALL",
      "description": "BRISTOL, Tenn. (AP) — It was in the den that Karen Goodwin most strongly felt her son’s presence: On the coffee table were his ashes, inside a clock with its hands forever frozen at 12:35 a.m., the moment that a doctor had pronounced him dead.",
      "publishedAt": "2024-03-29T10:04:12Z",
      "title": "For years she thought her son had died of an overdose. The police video changed all that",
      "url": "https://apnews.com/e318b9b7c8e673f2a5f8e0c1174ccb93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aeca25d781a43d290ac1ebdffccb021/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Louis Gossett Jr., the first Black man to win a supporting actor Oscar and an Emmy winner for his role in the seminal TV miniseries “Roots,” has died.",
      "publishedAt": "2024-03-29T12:57:15Z",
      "title": "Louis Gossett Jr., 1st Black man to win supporting actor Oscar, dies at 87",
      "url": "https://apnews.com/1e86e1441ec8b614a282f3de22490a07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d64ce47929147978aabcdd0cd7a0130/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — Americans are more worried about legal immigrants committing crimes in the U.S. than they were a few years ago, a change driven largely by increased concern among Republicans, while Democrats continue to see a broad range of benefits from immigration, a new poll shows.",
      "publishedAt": "2024-03-29T04:02:50Z",
      "title": "Many Americans say immigrants contribute to economy but there's worry over risks, AP-NORC poll finds",
      "url": "https://apnews.com/39246ef896ebccc51b67f6ed46de8061",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a760d8a327f4fe28d12e8da42256fb1/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and ERIC TUCKER",
      "description": "TALLINN, Estonia (AP) — A journalist on a reporting trip in a Ural Mountains city.",
      "publishedAt": "2024-03-29T05:03:09Z",
      "title": "A growing number of Americans end up in Russian jails. The prospects for their release are unclear",
      "url": "https://apnews.com/2a53c30a7ee686ee85de412ee833d154",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0c7ea634b15499399379a3c064451ba/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — While eclipse watchers look to the skies, people who are blind or visually impaired will be able to hear and feel the celestial event.Sound and touch devices will be available at public gatherings on April 8, when a total solar eclipse crosses North America, the moon blotting out the sun for a few minutes.",
      "publishedAt": "2024-03-29T13:48:00Z",
      "title": "Blind people can hear and feel April's total solar eclipse with new technology",
      "url": "https://apnews.com/dafc717b14115f9164befd911612aa3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c661408b06cc476884add349a532edb9/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Hundreds of Christians participated in a customary Good Friday procession through the limestone walls of Jerusalem's Old City, commemorating one of the faith's most sacred days with noticeably thinner crowds amid the ongoing Israel-Hamas war.",
      "publishedAt": "2024-03-29T13:07:15Z",
      "title": "In Jerusalem, Palestinian Christians observe scaled-down Good Friday rituals",
      "url": "https://apnews.com/25e8c0243c0c97a5823d509d36fb04cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e04bab2c9942f5a0c07cce6cb73c2b/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and NQOBILE NTSHANGASE",
      "description": "MMAMATLAKALA, South Africa (AP) — Forensic investigators in South Africa were searching Friday for the bodies of victims after a bus carrying pilgrims to an Easter gathering plunged off a bridge and caught fire.",
      "publishedAt": "2024-03-29T12:00:48Z",
      "title": "Investigators search for bodies of Easter pilgrims in bus that crashed off a bridge in South Africa",
      "url": "https://apnews.com/629834eb5a308166afe7cdbbd4c7de3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266605ddd0334f2cbebf6ca4c66433f2/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — One of the nation's most prominent news outlets has found itself in an embarrassing mess over the hiring — and quick firing — of someone who isn't even a journalist in the first place.",
      "publishedAt": "2024-03-29T04:04:36Z",
      "title": "Network political contributors have a long history. But are they more trouble than they're worth?",
      "url": "https://apnews.com/03d9cb245b61500720cc4d9fb3fa7385",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/431837c08d104f9ea302cae5e2658717/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}