{
  "articles": [
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE (AP) — The world’s top war-crimes court issued arrest warrants Thursday for Israeli Prime Minister Benjamin Netanyahu, his former defense minister and Hamas’ military chief, accusing them of crimes against humanity in connection with the 13-month war in Gaza.",
      "publishedAt": "2024-11-21T12:02:05Z",
      "title": "Top war-crimes court issues arrest warrants for Netanyahu, ex-defense minister and a Hamas leader",
      "url": "https://apnews.com/73c854d072e0a1a41b19b2cb2cdd07fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e770576983e4f2e9825b9d35ba737bd/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and FATMA KHALED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The death toll in the Gaza Strip from the 13-month-old war between Israel and Hamas has surpassed 44,000, local health officials said Thursday.",
      "publishedAt": "2024-11-21T11:39:23Z",
      "title": "Death toll in Gaza from Israel-Hamas war passes 44,000, Palestinian officials say",
      "url": "https://apnews.com/5da3ce43df8662fe9eeab4ad804bdc0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4c86120cb5745f49ad1cae799fc1688/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — When Elon Musk first suggested a new effort to cut the size of government, Donald Trump didn't seem to take it seriously.",
      "publishedAt": "2024-11-21T16:55:34Z",
      "title": "Elon Musk's budget crusade could cause a constitutional clash in Trump's second term",
      "url": "https://apnews.com/8e2fffc27df6acc1b275b1614e66fd01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7e2b0156e9c44ca9dbce3b4acd322a4/3000.jpeg"
    },
    {
      "author": "MARTHA MENDOZA, BRIAN SLODYSKO and JULIET LINDERMAN",
      "description": "SANTA CRUZ, Calif. (AP) — A woman told police that she was sexually assaulted in 2017 by Pete Hegseth after he took her phone, blocked the door to a California hotel room and refused to let her leave, according to a detailed investigative report made public late Wednesday.",
      "publishedAt": "2024-11-21T07:10:44Z",
      "title": "Police report reveals assault allegations against Hegseth, Trump's pick for defense secretary",
      "url": "https://apnews.com/e6ebec0a1a5c7fb51cb5e2198f5e12a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de7fbe0252ca4fc4b42e335a1eac7af9/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The leaders of the FBI and the Department of Homeland Security declined to testify publicly at a scheduled Senate hearing Thursday on global national security threats, a break from precedent following years of open testimony before the panel.",
      "publishedAt": "2024-11-21T15:08:31Z",
      "title": "The FBI and DHS leaders won't testify publicly about national security threats before the Senate",
      "url": "https://apnews.com/fef3808a3773d06314ac3b01b845a9fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/127e79ff6d864cdbadfdc611a3c13b5c/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine claimed Thursday that Russia launched an intercontinental ballistic missile overnight at one of its cities, but American officials said an initial U.S.",
      "publishedAt": "2024-11-21T09:12:40Z",
      "title": "Ukraine says Russia launched intercontinental missile but US officials say it was intermediate-range",
      "url": "https://apnews.com/38b0faf6eed2cef98bdbc9be18f58244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4f28164054341d88cc9769d3a0a8f08/1600.jpeg"
    },
    {
      "author": "JOHN O'CONNOR",
      "description": "SPRINGFIELD, Ill. (AP) — The Illinois Supreme Court on Thursday overturned actor Jussie Smollett’s conviction on charges that he staged a racist and homophobic attack against himself in downtown Chicago in 2019 and lied to police.",
      "publishedAt": "2024-11-21T15:53:09Z",
      "title": "Jussie Smollett’s conviction in 2019 attack on himself is overturned",
      "url": "https://apnews.com/91178cf27f6ef0aec8a5eef67a3a6125",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0824d6b5961a4f9e8c1f867dbd165983/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — For about 50 years, adding cavity-preventing fluoride to drinking water was a popular public health measure in Yorktown, a leafy town north of New York City. But in September, the town’s supervisor used his emergency powers to stop the practice.",
      "publishedAt": "2024-11-21T15:02:35Z",
      "title": "US towns plunge into debates about fluoride in water",
      "url": "https://apnews.com/47a0067edb128dbd9b9211a36e674b2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/065af8875ed846d79611f6ecd8e06966/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Did stand-up comedians help reelect Donald Trump?Not a joke, as outgoing President Joe Biden might say.",
      "publishedAt": "2024-11-21T16:42:10Z",
      "title": "Was it all a joke? How stand-up comedy helped reelect Trump",
      "url": "https://apnews.com/81aaaa0748f8ab432ac7423e71fcb510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/132c1a1ed4f9403097e2804d8c2fb4d7/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Shohei Ohtani is expected to win his third Most Valuable Player Award and first in the National League, and Aaron Judge is likely to earn his second AL honor when the Baseball Writers' Association announces its balloting Thursday.",
      "publishedAt": "2024-11-21T15:46:35Z",
      "title": "Shohei Ohtani likely to win his third MVP award and Aaron Judge his second",
      "url": "https://apnews.com/b1084cc2de55746a1595e4fa2fd29bdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8458b2a1b3254759b446b42852281211/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}