{
  "articles": [
    {
      "author": "Konstantin Toropin, Jon Gambrell",
      "description": "The world’s largest aircraft carrier, the USS Gerald R. Ford, has been ordered to sail from the Caribbean Sea to the Middle East. That's according to a person familiar with the matter who spoke Thursday on condition of anonymity. It comes as U.S. President Donald Trump considers whether to take possible military action against Iran. The move, first reported by The New York Times, will put two carriers and their accompanying warships in the region as Trump increases pressure on Iran to make a deal over its nuclear program.",
      "publishedAt": "2026-02-13T04:44:52Z",
      "title": "Second US aircraft carrier is going to the Middle East, AP source says",
      "url": "https://apnews.com/article/trump-iran-aircraft-carrier-military-8db3fab10476949acda8b973be416204",
      "urlToImage": "https://dims.apnews.com/dims4/default/09e5af1/2147483647/strip/true/crop/4724x3148+2+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F1d%2F114777173880f03ca451fcd761a3%2Fd295d48c402440db8abee8c9da00efe3"
    },
    {
      "author": "Steve Karnowski",
      "description": "Former CNN host Don Lemon and four other people are set to be arraigned on federal civil rights charges in Minnesota, accused in a protest at a church in St. Paul where an Immigration and Customs Enforcement official is a pastor. Civil rights attorney and prominent local activist Nekima Levy Armstrong is also being arraigned in the case Friday. Lemon says he was reporting on the protesters as an independent journalist at Cities Church on Jan. 18, while prosecutors accuse him of joining a “mob.” Lemon did not comment to reporters as he entered the courthouse. Nine people have been indicted in the case.",
      "publishedAt": "2026-02-13T05:10:38Z",
      "title": "Don Lemon to be arraigned in Minnesota church protest case",
      "url": "https://apnews.com/article/don-lemon-cnn-minnesota-church-protest-immigration-4a110d3e097f86b696281b5c36ce3339",
      "urlToImage": "https://dims.apnews.com/dims4/default/d39d5ae/2147483647/strip/true/crop/1909x1272+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F23%2Fb408bbc1d17dc5c27faa4d32b2db%2F0407ca0a3ae14b5d99bdd6fda19b80ea"
    },
    {
      "author": "Michael Biesecker, Jim Mustian, Jack Brook",
      "description": "Federal authorities have opened a criminal probe into whether two immigration officers lied under oath about a shooting in Minneapolis last month, as all charges were dropped against two Venezuelan men. Immigration and Customs Enforcement Director Todd Lyons said Friday that his agency had opened a joint probe with the Justice Department after video evidence revealed “sworn testimony provided by two separate officers appears to have made untruthful statements” about the shooting of one of the Venezuelan men. The officers have been placed on administrative leave pending the completion of an internal investigation. Lyons added that the U.S. Attorney’s Office is actively investigating.",
      "publishedAt": "2026-02-13T05:35:47Z",
      "title": "Feds investigating if ICE officers lied about a Minneapolis shooting",
      "url": "https://apnews.com/article/immigration-prosecutors-assault-shooting-minneapolis-charges-d713836a06471af9f38ee6ee8976a20c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3f9c86/2147483647/strip/true/crop/8261x5505+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Ff1%2F62e0fda7abda84475e301fc5a317%2Fd22523d053694d60b87218827e882500"
    },
    {
      "author": "Ken Sweet",
      "description": "Kathy Ruemmler's resignation as Goldman Sachs’ top lawyer comes after emails show she stayed close with Jeffrey Epstein long after his conviction on sex crimes. Emails between her and Epstein show thousands of pages of correspondence, warm exchanges and expensive presents that go beyond a standard lawyer-client relationship. Emails show she received spa treatments, luxury items, and chicken soup when she felt sick. In some instances, she advised Epstein on how he might go about trying to repair his image and defend himself publicly against new claims of misconduct. The fallout raised questions inside Goldman about her judgment and conflicts.",
      "publishedAt": "2026-02-13T19:49:26Z",
      "title": "Trove of emails reveals a close relationship between Goldman Sachs' top lawyer and Epstein",
      "url": "https://apnews.com/article/epstein-goldman-sachs-ruemmler-106dfb8e950acd8a3146b384eaa24453",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e6828c/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Ff4%2F4ae461c5bfe3f3e3a015076f4791%2Fb01396fca75d45ef8354397abe7eeece"
    },
    {
      "author": "Meg Kinnard",
      "description": "Another shutdown for parts of the federal government is expected this weekend. Funding for the Department of Homeland Security is set to expire Saturday as lawmakers debate new restrictions on President Donald Trump’s immigration enforcement agenda. The White House has been negotiating with the Democrats, but the two sides failed to reach a deal by the deadline. Unlike the record 43-day shutdown last fall, the closures will be narrowly confined, as only agencies that are part of Homeland Security will be affected. Still some federal workers could begin to miss paychecks and services like airport screening could be affected if the shutdown drags on for weeks.",
      "publishedAt": "2026-02-13T14:01:20Z",
      "title": "What to know about Homeland Security shutdown starting this weekend",
      "url": "https://apnews.com/article/homeland-security-shutdown-ice-funding-7bf62bc50ca0a6a6013a714bee2ffdb4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1799fcd/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F95%2F510d851cc0f531e401e92dd7eea0%2F6d2f920c710d42bb9fb45900c6bb125f"
    },
    {
      "author": "Will Weissert",
      "description": "President Donald Trump is on his way to North Carolina's Fort Bragg, where he plans to spotlight special forces involved in the capture of Venezuela’s Nicolás Maduro. First lady Melania Trump joined the president on Friday's trip, and they plan to meet with military families. Trump told reporters as he was leaving the White House that he was happy with new data showing that inflation is slowing. The White House has been trying to promote Trump’s economic policies, including attempts to bring down the cost of living at a time when many people are growing frustrated with his efforts to improve affordability.",
      "publishedAt": "2026-02-13T05:15:39Z",
      "title": "Trump heads to Fort Bragg to celebrate Maduro's capture by special forces",
      "url": "https://apnews.com/article/trump-fort-bragg-venezuela-special-forces-economy-e0f3ef918509c5137c434110dc090ffe",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2a75b4/2147483647/strip/true/crop/5533x3687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2Fc6%2Fb00d7dbed18acc6333d3d4181118%2F5d061ef03ee343b1a775dd99343f453d"
    },
    {
      "author": "John Seewer",
      "description": "Those frightening images of a masked man on Nancy Guthrie’s porch could provide valuable clues to investigators. The FBI already has analyzed the videos from Guthrie’s doorbell camera to identify the suspect’s backpack. Former criminal investigators say it’s almost certain that authorities now are using the footage to build a physical and psychological profile of the suspect in Guthrie’s disappearance. The footage released to the public this week totals less than a minute in length. It shows not only the suspect’s clothes and shoes, but also the way he moves. Investigators who have worked on high-profile cases say that's all valuable information.",
      "publishedAt": "2026-02-13T19:36:07Z",
      "title": "Video from Nancy Guthrie's porch could hold valuable clues",
      "url": "https://apnews.com/article/nancy-guthrie-suspect-video-disappearance-clues-02d1288f5b80b5e350d6f97db7deada9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca9514c/2147483647/strip/true/crop/1500x999+0+500/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F7a%2F82c5a50e812aaa943cd6b51eda7d%2F89acada3beab481eb36bb8ac79798f8a"
    },
    {
      "author": "Olivia Diaz",
      "description": "A Brazilian au pair got the maximum 10-year sentence after confessing to scheming with her lover to kill his wife and another man. Juliana Peres Magalhães pleaded guilty to manslaughter in the February 2023 killing of Joseph Ryan. She testified that she fired the shot that killed Ryan as Brendan Banfield was fatally stabbing his wife Christine. Brendan Banfield will likely remain behind bars for life after a jury found him guilty in both killings. Prosecutors recommended her immediate release in exchange for her cooperation, but the judge rejected that deal, sentencing her to the maximum for the downgraded charge.",
      "publishedAt": "2026-02-13T05:01:41Z",
      "title": "Brazilian au pair gets maximum penalty in double homicide",
      "url": "https://apnews.com/article/virginia-au-pair-sentencing-brendan-banfield-8601da63d6c29a96428cf07d67ff762b",
      "urlToImage": "https://dims.apnews.com/dims4/default/66ebdf5/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F60%2F33de66fe71eae78cd5c6e13d35fd%2F8e45a7d857f645f292522b5b2e91fd56"
    },
    {
      "author": "Christopher Rugaber",
      "description": "A key measure of inflation fell to nearly a five-year low last month as apartment rental price growth slowed and gas prices fell, offering some relief to Americans still grappling with the sharp increase in costs of the past five years. Friday’s report suggests inflation could be cooling, but it comes after the cost of food, gas, and apartment rents have soared since the pandemic, with consumer prices about 25% higher than they were five years ago. The increase in such a broad range of costs has become a high-profile political issue under the rubric of “affordability.”",
      "publishedAt": "2026-02-13T05:01:36Z",
      "title": "Inflation measure falls to nearly five-year low as gas prices fall and housing costs cool",
      "url": "https://apnews.com/article/inflation-trump-economy-prices-d489cfa4b48e32232f136830333d1db0",
      "urlToImage": "https://dims.apnews.com/dims4/default/ead5334/2147483647/strip/true/crop/5300x3532+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Ff8%2F304c49b715159b3c9aa7b2c9ec7e%2F27ce0876d3ca4aa18d4928bca8826a71"
    },
    {
      "author": "Tim Reynolds",
      "description": "Chris Paul has announced he is retiring from the NBA after a 21-season career that stacks up as Hall of Fame worthy. He shared the news Friday during All-Star weekend at the Clippers’ arena in Inglewood. Paul finished the year in a strange way. The Clippers sent him home in December. They traded him to Toronto earlier this month, even though he never planned to play there. Paul said he wants to “show up for others.” He leaves as a 12-time All-Star and a two-time Olympic gold medalist. He also ranks near the top in assists and steals.",
      "publishedAt": "2026-02-13T18:34:36Z",
      "title": "Chris Paul retires, ending a 21-year NBA career",
      "url": "https://apnews.com/article/chris-paul-retires-nba-f28d0406b033ce6b8809a706c6f14170",
      "urlToImage": "https://dims.apnews.com/dims4/default/775c00c/2147483647/strip/true/crop/3240x2159+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Fb6%2Fff9428f023a7c2aaf08acf9a46a9%2F4d3a7d2a859445cc8f0626b3e7f0dfed"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}