{
  "articles": [
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s main opposition party on Wednesday urged President Yoon Suk Yeol to resign immediately or face impeachment, hours after Yoon ended short-lived martial law that prompted troops to encircle parliament before lawmakers voted to lift it.",
      "publishedAt": "2024-12-04T01:14:46Z",
      "title": "South Korean President Yoon is urged to resign or face impeachment over martial law",
      "url": "https://apnews.com/25a2a7c957e77a19f771b6b7c56a2173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01e70dab69524a3d97854c0c5e196e79/1920.jpeg"
    },
    {
      "author": "ZIMO ZHONG",
      "description": "HONG KONG (AP) — Asian markets retreated Wednesday after overnight political drama in South Korea added to regional uncertainties, though the Kospi in Seoul fell less than 2%. U.S. futures rose while oil prices were little changed.",
      "publishedAt": "2024-12-04T03:58:41Z",
      "title": "Stock market today: Asian stocks slide after South Korea's political drama, but Kospi falls only 2%",
      "url": "https://apnews.com/d8b662da846c8ae5b32ab3a91e3529f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8e683538eff49ab9bba5c8648930c98/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and TARA COPP",
      "description": "WASHINGTON (AP) — Pete Hegseth, President-elect Donald Trump's pick for Defense Secretary, spent a second day Tuesday on Capitol Hill, meeting privately with Republican senators amid rising questions about his ability to effectively lead the Pentagon.",
      "publishedAt": "2024-12-04T01:08:57Z",
      "title": "Trump's defense pick Pete Hegseth faces deepening scrutiny in Senate",
      "url": "https://apnews.com/c5209938f7ccf7afe6ade7818817ca07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06f88c4deca649cb8a08f92fc5bfd12f/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.",
      "publishedAt": "2024-12-03T22:56:24Z",
      "title": "Chad Chronister, Donald Trump’s pick to run the DEA, withdraws name from consideration",
      "url": "https://apnews.com/032bd91a5ef447e820e2b1f63e50861e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ffe008754447c69e8f20222b5dd89f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden's decision to break his word and pardon his son Hunter has spurred a broader discussion about what else he should be doing with the broad clemency powers of the presidency before he leaves office in January, including whether he should be pardoning Donald Trump.",
      "publishedAt": "2024-12-03T14:33:56Z",
      "title": "Joe Biden's pardon of his son Hunter spurs broader discussion on who else should be granted clemency",
      "url": "https://apnews.com/e2d0ce366c6980cd31c6717edbc9938a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c8ef89274c34fcb8d778546504a5332/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and JOSEF FEDERMAN",
      "description": "CAIRO (AP) — Palestinian officials say Fatah and Hamas are closing in on an agreement to appoint a committee of politically independent technocrats to administer the Gaza Strip after the war.",
      "publishedAt": "2024-12-03T09:08:42Z",
      "title": "Hamas and Fatah are near an agreement on who will oversee postwar Gaza",
      "url": "https://apnews.com/acc4da6042ed030f65d0cd0745b82217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d894fd1de9f497aab4aae9bd9a0df64/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "BONNE TERRE, Mo. (AP) — Rowan Ford knew Christopher Collings as “Uncle Chris” after he spent several months living with her family.",
      "publishedAt": "2024-12-03T05:03:25Z",
      "title": "Missouri executes a man for sexually assaulting and strangling a 9-year-old girl in 2007",
      "url": "https://apnews.com/f5a027c86c53725556a5a66751abd36d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/755d5f2c9efa4ee88325a03720df774d/2304.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "BANGKOK (AP) — China announced Tuesday it is banning exports to the United States of gallium, germanium, antimony and other key high-tech materials with potential military applications, as a general principle, lashing back at U.S.",
      "publishedAt": "2024-12-03T10:23:48Z",
      "title": "China bans exports to US of gallium, germanium, antimony in response to chip sanctions",
      "url": "https://apnews.com/6b4216551e200fb719caa6a6cc67e2a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad755cfa20f14e2a8a73a30b741a6fea/3000.jpeg"
    },
    {
      "author": "RODRIQUE NGOWI and PATRICK WHITTLE",
      "description": "QUINCY, Mass. (AP) — As global warming fills the plankton-rich waters of New England with death traps for sea turtles, the number of stranded reptiles has multiplied over the last 20 years, filling one specialized animal hospital with the endangered creatures.",
      "publishedAt": "2024-12-03T18:30:42Z",
      "title": "Global warming fills New England's rich waters with death traps for endangered sea turtles",
      "url": "https://apnews.com/81c4ce3829f2c583feab1543644ada95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a78e381c5e384115a0dfb1c169ca9820/1920.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "Miami's playoff hopes took an all-but-final nosedive while Alabama's got a boost Tuesday night in the last rankings before the 12-team College Football Playoff bracket is set next weekend.",
      "publishedAt": "2024-12-03T17:15:01Z",
      "title": "Miami's playoff hopes nosedive as Alabama rises in the latest College Football Playoff rankings",
      "url": "https://apnews.com/290f36c33dc40dd7cc059a054037ccef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79ca7d2c37dc49ec928173ebe650ff4f/2959.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}