{
  "articles": [
    {
      "author": "TY O'NEIL, CLAIRE RUSH, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — A search of the wildfire devastation on the Hawaiian island of Maui on Thursday revealed a wasteland of obliterated neighborhoods and landmarks charred beyond recognition, as the death toll rose to at least 53 and survivors told harrowing tales of narrow escapes with only the clothes on their backs.",
      "publishedAt": "2023-08-10T05:46:33Z",
      "title": "53 people have died from the Maui wildfires, governor says, and historic Lahaina has burned down",
      "url": "https://apnews.com/f5a7047d407f836f89e90dd7f10faa94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1c445788aac432f8fb912016d5e2a7c/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, MICHAEL KUNZELMAN and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The federal judge overseeing the 2020 election conspiracy case against Donald Trump will hear arguments Friday over a request by prosecutors for a protective order seeking to bar the former president from publicly disclosing evidence shared by the government.",
      "publishedAt": "2023-08-11T04:17:45Z",
      "title": "Judge Chutkan to hear arguments in protective order fight in Trump's 2020 election conspiracy case",
      "url": "https://apnews.com/7129afbb11d968b42c9500559109f522",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34e229fbe85247a68a7753ce6c95aafa/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — California regulators on Thursday approved an expansion that will allow two rival robotaxi services to operate throughout San Francisco at all hours, despite safety worries spurred by recurring problems with unexpected stops and other erratic behavior that resulted in unmanned vehicles blocking traffic, including emergency vehicles.",
      "publishedAt": "2023-08-10T04:02:08Z",
      "title": "Two rival robotaxi services win approval to operate throughout San Francisco despite safety concerns",
      "url": "https://apnews.com/98f0dab03984bd71685b92c2ac7aad0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fc0d96465c94ba9a30f7bab96d0dbe6/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Biden administration says it could soon launch a formal evaluation of risks posed by vinyl chloride, the cancer-causing chemical that burned in a towering plume of toxic black smoke following the fiery train derailment in East Palestine, Ohio.",
      "publishedAt": "2023-08-11T04:13:56Z",
      "title": "EPA weighs formal review of vinyl chloride, toxic chemical that burned in Ohio train derailment",
      "url": "https://apnews.com/54bb0a943f4f4af0e4f68cc60ce4edb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/297d280f5d8f478a95aa8d23587d2f0a/3000.jpeg"
    },
    {
      "author": "GONZALO SOLANO and REGINA GARCIA CANO",
      "description": "QUITO, Ecuador (AP) — Ecuador’s transformation into a major drug trafficking hub and the ensuing three-year surge of violence is weighing on the nation following the killing of a presidential candidate whose life’s work was to fight crime and corruption.",
      "publishedAt": "2023-08-11T04:04:34Z",
      "title": "Ecuador arrests 6 Colombians in slaying of presidential candidate as violence weighs on nation",
      "url": "https://apnews.com/4ffb2030f439a6f1e6039326e1ee64b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fa9f507bebe4240bc196c5fc00cda4b/1920.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "When philosophy professor Darren Hick came across another case of cheating in his classroom at Furman University last semester, he posted an update to his followers on social media: “Aaaaand, I’ve caught my second ChatGPT plagiarist.”",
      "publishedAt": "2023-08-10T04:17:47Z",
      "title": "Paper exams, chatbot bans: Colleges seek to 'ChatGPT-proof' assignments",
      "url": "https://apnews.com/1b654b44de2d0dfa4e50bf0186137fc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbb3e1ec5f1a471bb0006bf238ca39b7/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "ST. LOUIS (AP) — Firefighter and paramedic Mike Camilleri once had no trouble hauling heavy gear up ladders. Now battling long COVID, he gingerly steps onto a treadmill to learn how his heart handles a simple walk.",
      "publishedAt": "2023-08-10T04:12:14Z",
      "title": "COVID-19 took a toll on heart health and doctors are still grappling with how to help",
      "url": "https://apnews.com/3dd8f26c663e96bffcc2980830626153",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ad5f3747274082a474217cf3bda763/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday temporarily blocked a nationwide settlement with OxyContin maker Purdue Pharma that would shield members of the Sackler family who own the company from civil lawsuits over the toll of opioids.",
      "publishedAt": "2023-08-10T19:41:52Z",
      "title": "Supreme Court blocks, for now, OxyContin maker bankruptcy deal that would shield Sacklers",
      "url": "https://apnews.com/bd417e036d9f6db4b2916fdfbdb56252",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/152fe9ac93f44136b811eb846e12be28/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — About 49,500 people took their own lives last year in the U.S., the highest number ever, according to new government data posted Thursday.The Centers for Disease Control and Prevention, which posted the numbers, has not yet calculated a suicide rate for the year, but available data suggests suicides are more common in the U.S.",
      "publishedAt": "2023-08-10T18:09:28Z",
      "title": "US suicides hit an all-time high last year",
      "url": "https://apnews.com/48511d74deb24d933e66cec1b6f2d545",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f006dacc18e24fd7b54ac935a78cf392/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "Phil Mickelson has wagered more than $1 billion over the last three decades and wanted to place a $400,000 bet on the 2012 Ryder Cup while playing for Team USA, according to a much-anticipated book by renowned gambler Billy Walters.",
      "publishedAt": "2023-08-10T15:47:09Z",
      "title": "Phil Mickelson has wagered more than $1 billion, according to book by renowned gambler Billy Walters",
      "url": "https://apnews.com/6d753cfad771bb45cfbe3b500c7e5eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d139849f2964400fa0ed1c4a778a4f02/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}