{
  "articles": [
    {
      "author": "BY OLIVIA DIAZ and BRIAN WITTE",
      "description": "WASHINGTON (AP) — Worries of being uprooted from their jobs have returned for Laura Dodson and other federal workers, who have long been the economic backbone of the nation's capital and its suburbs.",
      "publishedAt": "2024-09-02T04:13:00Z",
      "title": "Federal workers around nation's capital worry over Trump's plans to send some of them elsewhere",
      "url": "https://apnews.com/675c08a888cd27d0a75b01134114460a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f84c7840f05240bb9690e6cdd1c9ea3c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Justice Department announced criminal charges Tuesday against Hamas leader Yahya Sinwar and other senior militants in connection with the Oct.",
      "publishedAt": "2024-09-03T21:00:24Z",
      "title": "US charges Hamas leader, other militants in connection with Oct. 7 massacre in Israel",
      "url": "https://apnews.com/87674285aa9b066392953db1310312ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62c0bfd29d93409db97a9301c690435a/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A federal judge on Tuesday swiftly rejected Donald Trump’s request to intervene in his New York hush money criminal case, spurning the former president’s attempt at an end-run around the state court where he was convicted and is set to be sentenced in two weeks.",
      "publishedAt": "2024-09-03T16:46:33Z",
      "title": "Federal judge rejects Donald Trump's request to intervene in wake of hush money conviction",
      "url": "https://apnews.com/a905207c7db9fc48d022d68ac6cc12e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36474db466ce442b8b572bfc130ed9a6/3000.jpeg"
    },
    {
      "author": "LORI HINNANT and ILLIA NOVIKOV",
      "description": "POLTAVA, Ukraine (AP) — Two ballistic missiles blasted a military academy and nearby hospital Tuesday in Ukraine, killing more than 50 people and wounding more than 200 others, Ukrainian officials said, in one of the deadliest Russian strikes since the war began.",
      "publishedAt": "2024-09-03T11:39:17Z",
      "title": "Russian missiles blast Ukrainian military academy and hospital, killing more than 50, officials say",
      "url": "https://apnews.com/a53f1a4500ef52e4bf8217ee0e8bca84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2a1886069fb4b8da12dea8daf643492/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris plans to propose on Wednesday a tenfold increase in federal tax incentives for small business startup expenses, from $5,000 to $50,000, hoping to help spur a record 25 million new small business applications over her four-year term should she win the presidency in November.",
      "publishedAt": "2024-09-03T21:00:34Z",
      "title": "Harris to propose tenfold startup tax incentive increase she says will spur small business creation",
      "url": "https://apnews.com/12f34210263458ddb1b02fbd846d2be5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b94e795e869c4bb798040cdf7035d215/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis is opening his visit to Indonesia with a packed first day Wednesday, meeting political and religious leaders and setting a rigorous pace for an 11-day, four-nation trip through tropical Asia and Oceania that will test his stamina and health.",
      "publishedAt": "2024-09-03T01:08:07Z",
      "title": "Pope has packed first day in Indonesia with visits to president, clergy in test of stamina, health",
      "url": "https://apnews.com/05c710ad993231bd8840c75f959f2b05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c84ca912d874aa4858b441d4ba0316e/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER and MARK CARLSON",
      "description": "BOULOGNE-SUR-MER, France (AP) — A boat carrying migrants ripped apart in the English Channel as they attempted to reach Britain from northern France on Tuesday, plunging dozens into the treacherous waterway and leaving 12 dead, authorities said.",
      "publishedAt": "2024-09-03T12:20:46Z",
      "title": "A boat with dozens of migrants rips apart in the English Channel off France, killing 12",
      "url": "https://apnews.com/1a08adf9475b48bd5f35baf47dc7ae35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c66b344fc2034cf489a2c39b62e00911/1905.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Columbia University resumed classes Tuesday with students sunbathing and eating ice cream on the lawn that was home to a pro-Palestinian encampment last spring. But there were also fresh demonstrations just off campus, and students and faculty say they're planning for more as the new school year unfolds.",
      "publishedAt": "2024-09-03T11:12:08Z",
      "title": "As Columbia resumes classes, student activists vow to carry on with protests against Israel",
      "url": "https://apnews.com/980e22266c6a6d1c86b670a3d6be655a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/697a9c71d8a148799504791a8225e06d/3000.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — U.S. stocks tumbled Tuesday to their worst day since an early August sell-off, as a week full of updates on the economy got off to a discouragingly weak start. The S&amp;P 500 sank 2.1% to give back a chunk of the gains from a three-week winning streak that had carried it to the cusp of its all-time high.",
      "publishedAt": "2024-09-03T03:25:37Z",
      "title": "Stock market today: Wall Street tumbles on worries about the economy, and Dow drops more than 600",
      "url": "https://apnews.com/aa764f4e90e3a90e892ba3fe5f649031",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33c08581e88e4cc4a6d2dc3f0acbc98c/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Florida State fell out of The Associated Press college football poll on Tuesday after starting the season 0-2, becoming just the third team to go from preseason top 10 to unranked in the first regular-season poll since the rankings expanded to 25 in 1989.",
      "publishedAt": "2024-09-03T18:00:33Z",
      "title": "Florida State drops out of AP Top 25 after 0-2 start. Texas up to No. 3 behind Georgia, Ohio State",
      "url": "https://apnews.com/2c4f6dd7f305cd00fcf9cc368437c60b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/507ad29dc5b444dc83ea840f749c7a6d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}