{
  "articles": [
    {
      "author": null,
      "description": "Iranian state television says the head of Iran’s paramilitary Revolutionary Guard is feared dead after an Israeli attack. The report offered few other details about what happened to Gen. Hossein Salami of the Guard. The report on air added that one other top Guard officials, as well as two nuclear scientists were also feared dead. State television also reported the attack set the headquarters of Iran’s paramilitary Revolutionary Guard ablaze. Multiple sites in the capital had been hit in the attack, which Israeli Prime Minister Benjamin Netanyahu said targeted both nuclear and military sites and officials leading Iran’s nuclear program and its ballistic missile arsenal.",
      "publishedAt": "2025-06-13T00:13:47Z",
      "title": "Explosions heard across Iran’s capital as Israel claims it is attacking",
      "url": "https://apnews.com/article/iran-explosions-israel-tehran-00234a06e5128a8aceb406b140297299",
      "urlToImage": "https://dims.apnews.com/dims4/default/49e05ae/2147483647/strip/true/crop/5915x3327+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F40%2Fef6d174d5e49a3d63c42bbec6d25%2Ff6f2cbef8b32466e9c8eaba4049ea7ae"
    },
    {
      "author": null,
      "description": "President Donald Trump is urging Iran to make a nuclear deal now that Israel has launched strikes against the country. Trump says on social media Iran should make a deal “before there is nothing left and save what was once known as the Iranian Empire.” Trump is holding onto hope the long-simmering dispute over Tehran’s nuclear program can be resolved. But with the Israeli military operation now underway and likely to continue for some time, Trump will be tested anew on his ability to deliver on a campaign promise to disentangle the U.S. from foreign conflicts. The Republican president is already struggling to find an endgame to the conflicts in Ukraine and Gaza.",
      "publishedAt": "2025-06-13T04:23:40Z",
      "title": "Trump faces new test after Israeli strikes on Iran",
      "url": "https://apnews.com/article/iran-israel-nuclear-weapon-trump-4fcc4013bae363f781c632ce03fea55d",
      "urlToImage": "https://dims.apnews.com/dims4/default/86fcbbe/2147483647/strip/true/crop/4641x2611+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F0b%2F9b1ce093c92d6630021a8ea26730%2F778a5685aab442aca3042c224a5a5b4d"
    },
    {
      "author": null,
      "description": "Homeland Security Secretary Kristi Noem is promising to move forward with the Trump administration’s immigration crackdown in Los Angeles despite the waves of unrest. Noem spoke Thursday, hours before a judge directed the president to return control to California over National Guard troops he deployed after protests erupted over the immigration crackdown. But the 9th U.S. Circuit Court of Appeals quickly put the brakes on that and temporarily blocked the judge's order, which was to go into effect on Friday. The judge’s order said the Guard deployment was illegal and both violated the Tenth Amendment and exceeded President Donald Trump’s statutory authority.",
      "publishedAt": "2025-06-13T05:43:24Z",
      "title": "DHS vows Trump's immigration crackdown will continue despite unrest",
      "url": "https://apnews.com/article/immigration-raids-national-guard-lawsuit-los-angeles-f4809c7f39d09e4fdfa01982f44ec995",
      "urlToImage": "https://dims.apnews.com/dims4/default/b782467/2147483647/strip/true/crop/4737x2665+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F3f%2F680e47f224ad85d4c1bd6b3f95ae%2Fcf6f81a1c61d4d51bf1312fc92fec446"
    },
    {
      "author": null,
      "description": "A federal judge has issued a temporary restraining order directing President Donald Trump to return control of the National Guard to California. The order takes effect at noon Friday. It says the deployment of the Guard was illegal and both violated the Tenth Amendment and exceeded Trump’s statutory authority. The White House had no immediate comment on the ruling.",
      "publishedAt": "2025-06-12T04:01:30Z",
      "title": "Judge says Trump illegally deployed National Guard to help with LA protests, must return control",
      "url": "https://apnews.com/article/california-immigration-national-guard-newsom-trump-lawsuit-aedf8cdd95ee899c9559d5e54a2e4833",
      "urlToImage": "https://dims.apnews.com/dims4/default/6542c5b/2147483647/strip/true/crop/3976x2237+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2F0a%2Fec90cd01f755298ffff474620e73%2F6abd20de9da449ec94b19b87f35e05c7"
    },
    {
      "author": null,
      "description": "Authorities have begun investigating one of India’s worst aviation disasters after an Air India plane crashed a day earlier, killing all but one of the total 242 passengers and crew onboard. The Indian government has launched an investigation into the fatal crash of the London-bound Air India plane that came down in a in a residential area in the northwestern city of Ahmedabad, minutes after takeoff on Thursday. Civil Aviation Minister Ram Mohan Naidu in a statement said the Aircraft Accident Investigation Bureau has initiated the probe in line with global protocols set by the International Civil Aviation Organization. A team from the U.S. is expected in India to help with the probe.",
      "publishedAt": "2025-06-13T04:55:54Z",
      "title": "Indian authorities begin probe of Air India plane crash as Modi visits the site",
      "url": "https://apnews.com/article/air-india-plane-crash-ahmedabad-survivor-boeing-787-18a1e45cb65bd716d6529b8922cc94b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4138789/2147483647/strip/true/crop/7048x3965+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fa0%2F7541be4f6eb1138c26a91a1daaf8%2F5ba76ed4bea84d86ac28c1db2ed25980"
    },
    {
      "author": null,
      "description": "The lone passenger who survived the Air India crash that killed 241 people onboard couldn’t believe he was alive when he opened his eyes, surrounded by flames, debris and charred bodies. Vishwashkumar Ramesh was headed to London when the flight crashed minutes after taking off from India’s northwestern city of Ahmedabad on Thursday afternoon. He narrated his ordeal to India’s national broadcaster, saying the aircraft seemed stuck midair after takeoff. Seated in 11A, he said his side of the plane where he was seated fell onto the ground floor of a building and there was space for him to escape after the door broke open.",
      "publishedAt": "2025-06-13T11:20:35Z",
      "title": "Air India's sole crash survivor narrates his escape",
      "url": "https://apnews.com/article/air-india-survivor-crash-boeing-e88b0ba404100049ee730d5714de4c67",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a5979/2147483647/strip/true/crop/624x351+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Fe5%2Fd0e49fd42d9dd63093fa5ead768c%2F97592849c6954053baf16c97299f2bf2"
    },
    {
      "author": null,
      "description": "South African President Cyril Ramaphosa is expected to visit the sites of devastating floods that have left at least 78 people dead in the southeast of the country. Ramaphosa's office says he will travel to the Eastern Cape province Friday as search and rescue operations continue and authorities say they expect the death toll to rise. Ramaphosa's visit comes after a local official said rescue efforts were “paralyzed” in the first few hours of the floods because of a lack of resources. The floods hit in the predawn hours of Tuesday and caught many unaware despite weather warnings issued last week.",
      "publishedAt": "2025-06-13T08:51:48Z",
      "title": "South African president to visit flood sites with death toll at 78 and expected to climb",
      "url": "https://apnews.com/article/floods-south-africa-mthatha-weather-77c415129c8da4e481b54e2aaec3fef1",
      "urlToImage": "https://dims.apnews.com/dims4/default/a195ce2/2147483647/strip/true/crop/6151x3460+0+321/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F30%2F8cadfc76d7a33447c2c70e10074c%2F57f4dab1c00c4df5af11515462d0af24"
    },
    {
      "author": null,
      "description": "Texas Gov. Greg Abbott says he has ordered the deployment of more than 5,000 Texas National Guard troops across the state, along with more than 2,000 state police. Abbott said Thursday the troops and state police will help local law enforcement manage protests against President Donald Trump and ongoing federal immigration raids. Abbott's statement does not detail where the Guard troops have been sent. Some were seen at a protest Wednesday night in downtown San Antonio. More protests are planned for Saturday in cities such as Houston, Austin and Dallas as part of the national “No Kings” movement.",
      "publishedAt": "2025-06-12T16:06:07Z",
      "title": "Texas governor deploys National Guard ahead of planned 'No Kings' protests",
      "url": "https://apnews.com/article/immigration-protests-texas-national-guard-4f8ffc07788515c0d0e7ae40c7980565",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c4ede6/2147483647/strip/true/crop/5557x3126+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F6a%2F84a802c16c1ecc5feb1f5fd31439%2F4760f38e41d14294baf19f9254e4b452"
    },
    {
      "author": null,
      "description": "A lawyer for Sean “Diddy” Combs is protesting the rising tide of secrecy at the hip-hop icon's sex trafficking and racketeering conspiracy trial after Combs and the public were excluded from lengthy legal arguments. Attorney Marc Agnifilo complained to Judge Arun Subramanian after Combs was left out of an hour-long robing room meeting Thursday, delaying testimony by a key witness by nearly two hours. Agnifilo said the need for a public trial was “an important issue, a constitutional issue” and objected to so much happening out of the earshot of his client. Combs has pleaded not guilty to sex trafficking charges.",
      "publishedAt": "2025-06-12T20:21:48Z",
      "title": "Sean 'Diddy' Combs' lawyer complains about trial secrecy as a famous rapper's name goes unmentioned",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-6e3fe9e45247979532cc3ebb0805dfcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "The Air India plane crash this week was one of India’s worst aviation disasters, killing 241 people on board and several people on the ground. The Air India plane crashed after takeoff Thursday in the northwestern city of Ahmedabad. The crash was the first of a Boeing 787, which began service in 2009. Investigators were searching the crash site Friday, and the investigation is expected to include experts from the plane’s maker Boeing and U.S. aviation regulators. There was no word on the cause or if the flight data and cockpit voice recorders had been recovered.",
      "publishedAt": "2025-06-13T06:45:08Z",
      "title": "Things to know about the Air India plane crash",
      "url": "https://apnews.com/article/india-plane-crash-what-to-know-4e99be1a0ed106d2f57b92f4cc398a6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a14a573/2147483647/strip/true/crop/4581x2577+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F9d%2Fb8ce987153d7048044e621a3faef%2Fcadfe40b11dc485fb9550dc95445df53"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}