{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and JILL COLVIN",
      "description": "WASHINGTON (AP) — Republican Donald Trump has launched his general election campaign not merely rewriting the history of the Jan.",
      "publishedAt": "2024-03-19T04:12:04Z",
      "title": "Trump is making the Jan. 6 attack a cornerstone of his bid for the White House",
      "url": "https://apnews.com/2401ead35cb1402a7b289c2c99761373",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6bc9b5226d948e8a204238864556efb/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER and JULIA FRANKEL",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu on Monday agreed to send a team of Israeli officials to Washington to discuss with Biden administration officials a prospective Rafah operation as each side is looking to make “clear to the other its perspective,” White House national security adviser Jake Sullivan said.",
      "publishedAt": "2024-03-18T15:58:45Z",
      "title": "Netanyahu agrees to send Israeli officials to Washington to discuss prospective Rafah operation",
      "url": "https://apnews.com/24b8ff4a6ce61ed410fe5a1beb640b4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e055863a3e5439696531a8f35068c36/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "RAFAH, Gaza Strip (AP) — Famine is \"imminent” in northern Gaza, where 70% of people are experiencing catastrophic hunger, according to a report Monday that warned escalation of the war could push half of Gaza's total population to the brink of starvation.",
      "publishedAt": "2024-03-18T07:54:23Z",
      "title": "Famine is said to be 'imminent' in northern Gaza as Israel raids the main hospital again",
      "url": "https://apnews.com/eefc526aec97821fe5f1e845801a6640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/400662388ac24158b7707081425edcc8/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday continued to block, for now, a Texas law that would give police broad powers to arrest migrants suspected of illegally entering the U.S.",
      "publishedAt": "2024-03-18T21:16:54Z",
      "title": "Supreme Court extends block on Texas law that would allow police to arrest migrants",
      "url": "https://apnews.com/7de1b444bede16e5c502c3215087cfae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f04d6887f8145ccb26da2e6743f9b50/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden will host Japanese Prime Minister Fumio Kishida and Philippines President Ferdinand Marcos Jr. for a White House summit next month amid growing concerns about North Korea's nuclear program, provocative Chinese action in the South China Sea and differences over a Japanese company's plan to buy an iconic American steel company.",
      "publishedAt": "2024-03-19T01:07:17Z",
      "title": "Biden to host Japan PM Kishida, Philippines President Marcos for White House summit",
      "url": "https://apnews.com/ad10c4a585b16bb8eb6e10eb1dd5b495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd0806f965194790817bfeee10f5bb0c/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers told a New York appellate court Monday that it's impossible for him to post a bond covering the full amount of a $454 million civil fraud judgment while he appeals, suggesting the former president's legal losses have put him in a serious cash crunch.",
      "publishedAt": "2024-03-18T15:17:47Z",
      "title": "Trump's lawyers say it is impossible for him to post bond covering $454 million civil fraud judgment",
      "url": "https://apnews.com/75ef3efb5b70d6ea43bea85b65ff7810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9150914901174c4fb9d7ff3a47eb096b/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Japan’s central bank raised its benchmark interest rate Tuesday for the first time in 17 years, ending a longstanding policy of negative rates meant to boost the economy. The short-term rate was raised to a range of 0 to 0.1% from minus 0.1% at a policy meeting that confirmed expectations of a shift away from ultra-lax monetary policy.",
      "publishedAt": "2024-03-19T03:50:54Z",
      "title": "The Bank of Japan ends its negative interest rate policy, opting for its first hike in 17 years",
      "url": "https://apnews.com/b650a9b8a517bcf3a31c32ffdcf651c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee9c1bd9c1714087b31b5f4faf3c9e13/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — To no one's surprise, President Vladimir Putin secured another six years in power in a preordained election landslide that comes amid the harshest crackdown on the opposition and free speech since Soviet times.",
      "publishedAt": "2024-03-18T18:10:56Z",
      "title": "Takeaways from the predictable Russian election that gave Putin another 6 years in power",
      "url": "https://apnews.com/05fda6611fd31d424d4e347551d28af3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c2becca9fba4169a53707b93ae3058c/3000.jpeg"
    },
    {
      "author": "DAKE KANG",
      "description": "BEIJING (AP) — In the last recorded moments before the 13-year-old boy's death, surveillance cameras showed him sitting on a scooter, surrounded by three classmates. An hour later, his phone went dead, kicking off a frantic search by relatives.",
      "publishedAt": "2024-03-18T14:42:25Z",
      "title": "Detention of 3 teens over gruesome killing of 13-year-old classmate sparks debate in China",
      "url": "https://apnews.com/d697fe277133af51537eca80cad21a72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad3200fd86c24b83b0b983653facef28/3000.jpeg"
    },
    {
      "author": "NOAH TRISTER",
      "description": "March Madness this year comes at a time of great uncertainty in college sports. In addition to eyeing potential 5-12 upsets and trying to figure out which sleeper to put in the Elite Eight, fans also have to consider more existential questions about college basketball's future.",
      "publishedAt": "2024-03-18T01:17:51Z",
      "title": "March Madness brackets are here. Here's how to pick your teams",
      "url": "https://apnews.com/a434b9217393bb638db7e4338cbe3245",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f2d1959b224665ac11f3ed64f1524b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}