{
  "articles": [
    {
      "author": "MATTHEW LEE, BARAA ANWER, DASHA LITVINOVA",
      "description": "Top Russian and U.S. officials are set to hold talks hold talks in Saudi Arabia in a bid to improve their ties and negotiate an end to the war in Ukraine. The meeting between the two countries’ top diplomats in Riyadh on Tuesday would be their most significant since the Russia invaded its neighbor almost three years ago, and is meant to pave the way for a meeting between U.S. President Donald Trump and Russian President Vladimir Putin. Earlier this month, Trump upended U.S. policy toward Ukraine and Russia, saying he and Putin had agreed to begin negotiations on ending the war.",
      "publishedAt": "2025-02-18T06:18:20Z",
      "title": "Top Russian and US officials are set to hold talks on Ukraine war without Kyiv",
      "url": "https://apnews.com/article/russia-ukraine-war-riyadh-talks-trump-putin-rubio-0c3beebfef5839e9d509ff58239a6bc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd21604/2147483647/strip/true/crop/4819x2711+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2Fea%2Fe7d22ebe1e90de0ea053ccb510c6%2F5e52c5603e5f4db59f4166d4fc68b1cc"
    },
    {
      "author": "RAF CASERT, SYLVIE CORBET",
      "description": "European leaders are seeking to form a united front at emergency talks in Paris, called after a U.S. diplomatic blitz on Ukraine which has thrown a once-solid alliance into turmoil and left the Europeans questioning the reliability of their key transatlantic partner. Shortly before the meeting, French President Emmanuel Macron spoke with U.S. President Donald Trump, but Macron’s office would not disclose details about the 20-minute discussion. European leaders have been stunned by a weeklong diplomatic blitz on Ukraine from the Trump administration that seemed to embrace the Kremlin while it cold-shouldered many of its age-old European allies. Gen. Keith Kellogg, Trump’s special envoy for Ukraine and Russia, underlined Monday that Europe has no place at the negotiating table.",
      "publishedAt": "2025-02-17T05:08:58Z",
      "title": "European leaders gather for a meeting over fear Trump has isolated age-old allies",
      "url": "https://apnews.com/article/eu-europe-ukraine-nato-security-summit-trump-060c8661c59f8f75b96711d3889ce559",
      "urlToImage": "https://dims.apnews.com/dims4/default/59ee152/2147483647/strip/true/crop/6655x3743+0+347/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Ff2%2Ffc136217b1d120d02f8b401316bb%2F1ceac54ab17d4039b91051046c93f8ea"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "After nearly three years of living under constant threat of Russian airstrikes while their troops fight a grinding campaign against Russia’s invasion, many Ukrainians long for an end to the war. But they now fear it could come on unfavorable terms. Top U.S. and Russian officials plan to meet Tuesday in Saudi Arabia to discuss an end to the war. Kyiv won't participate. That rankles some Ukrainians who worry they will be sidelined. While Ukraine will not take part in Tuesday’s talks, U.S. State Department spokesperson Tammy Bruce said any actual peace negotiations would only take place with Ukraine’s involvement.",
      "publishedAt": "2025-02-17T17:54:29Z",
      "title": "Many weary Ukrainians long for an end to the war but now fear it will come on unfavorable terms",
      "url": "https://apnews.com/article/ukraine-russia-war-peace-talks-trump-reaction-a3135cb1dfecc7dbcde663d3bb512e77",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bf9454/2147483647/strip/true/crop/5393x3034+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F1c%2F09a7558a32f2fc8588c3db078b95%2Fe6027cc7b26c43b8bdae301f7dedae08"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Ukraine's President Volodymyr Zelenskyy traveled to the United Arab Emirates as momentum grows for potential peace talks ending Russia's war. U.S. President Donald Trump last week suggested he would be meeting Russian President Vladimir Putin in Saudi Arabia. The UAE, home to Abu Dhabi and Dubai, long has been floated as a possible site for peace talks as well given the large population of Russian and Ukrainian expatriates who have flooded the country since the war began, and due to the Emirates’ work on prisoner exchanges in the past. Zelenskyy met with UAE leader Sheikh Mohammed bin Zayed Al Nahyan on Monday.",
      "publishedAt": "2025-02-17T02:16:25Z",
      "title": "Russia-Ukraine war: Zelenskyy in UAE as momentum grows for peace talks",
      "url": "https://apnews.com/article/uae-russia-ukraine-war-a09b2fc2d81276551f40d89383a348c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d051cd/2147483647/strip/true/crop/1650x928+0+86/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fac%2F096e4d1b9e43a98885b0deefd70a%2Fd870ecafac1449ae86886335298480c7"
    },
    {
      "author": null,
      "description": "A Delta Airlines plane has flipped upon arrival at Toronto’s Pearson Airport and paramedics say at least eight people are injured. The Canadian Press reports that one passenger is critically injured and seven others were also hurt on the flight from Minneapolis on Monday. Images posted on social media show the plane flipped over on the tarmac. The airport has confirmed on X that an “incident” occurred with the Delta flight from Minneapolis and that all passengers and crew are accounted for. Video from the scene showed the plane upside down on the snowy tarmac as emergency workers hose it down.",
      "publishedAt": "2025-02-17T20:45:42Z",
      "title": "Delta plane crash: Toronto airport confirms “incident” with flight from Minneapolis",
      "url": "https://apnews.com/article/delta-toronto-airport-minneapolis-4ab235ef49b2d3757c9bd5fd8c6606ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/6616487/2147483647/strip/true/crop/320x180+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F51%2F37521145e7eb4cb0ee992ce4e471%2Fcan-plane-crash-20250217i-1920x1080.jpg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "Egypt is developing a plan to rebuild Gaza without forcing Palestinians out of the strip in a counter to President Donald Trump’s proposal to depopulate the territory so the U.S. can take it over. Egypt’s state-run Al-Ahram newspaper said the proposal calls for establishing “secure areas” within Gaza where Palestinians can live initially while Egyptian and international construction firms remove and rehabilitate the strip’s infrastructure. Egyptian officials have been discussing the plan with European diplomats and Arab countries, as well as ways to fund it.",
      "publishedAt": "2025-02-17T17:21:58Z",
      "title": "Egypt is developing a plan to rebuild Gaza, countering Trump's call to depopulate the territory",
      "url": "https://apnews.com/article/egypt-gaza-reconstruction-plan-76941b11e6746078da113e36605ec462",
      "urlToImage": "https://dims.apnews.com/dims4/default/f06f32a/2147483647/strip/true/crop/8251x4641+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fe6%2Ff754bf4e4213c761fdd48041ec1f%2F73c3acf5e0024ce4861066a72caaff1a"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "South Korean actor Kim Sae-ron’s death this week has triggered an outpouring of grief and calls for changes to the way the country’s celebrities are treated in the public arena and on social media, which critics say can foster a culture of harassment. The 24-year-old began her career as a child actor and earned acclaim for her roles in several domestic films, including the 2010 crime noir “The Man from Nowhere.” She as found dead by a friend at her home in the country’s capital, Seoul, on Sunday. The National Police Agency has said that officers are not suspecting foul play and that Kim left no note.",
      "publishedAt": "2025-02-18T06:03:17Z",
      "title": "Death of South Korean actor at 24 sparks discussion about social media and internet culture",
      "url": "https://apnews.com/article/south-korea-actor-death-kim-sae-ron-a2ce58f4d63b423afb328709027429ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/44102cf/2147483647/strip/true/crop/2694x1515+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F7d%2Ff5bb22d22e76febfd0caf30b8ceb%2Fc2423f45e8694ce68d0d2ac83733d12d"
    },
    {
      "author": "MELANIE LIDMAN, SALLY ABOU ALJOUD",
      "description": "Israel’s military says its forces will remain in five strategic locations in southern Lebanon after Tuesday’s deadline for their withdrawal under a ceasefire with the Hezbollah militant group. Lebanon’s government has expressed frustration over another delay. A separate ceasefire in Gaza is also in doubt as the region marks 500 days of Israel’s war with Hamas. Talks are yet to start on the ceasefire’s second phase, which would release more hostages and see the withdrawal of Israeli forces from the territory. An Israeli official says four bodies are expected to be returned to Israel on Thursday, with no details.",
      "publishedAt": "2025-02-17T07:21:29Z",
      "title": "Israeli forces to remain in 5 Lebanon areas after withdrawal deadline",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-17-2025-c20c9664938b267354c9ac4812621a1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6af9d3/2147483647/strip/true/crop/7833x4406+0+408/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2Fc4%2F5aea4460250d77f399355fc4421a%2F81bed296c6264dc4a9961826e239ddd6"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "The Social Security Administration’s acting commissioner has stepped down from her role at the agency over Department of Government Efficiency requests to access Social Security recipient information. That's according to two people familiar with the official’s departure who were not authorized to discuss the matter publicly. Acting Commissioner Michelle King’s departure from the agency —after more than 30 years of service — was initiated after King refused to provide Department of Government Efficiency staffers at the Social Security Administration with access to sensitive information, the people said.",
      "publishedAt": "2025-02-18T02:28:02Z",
      "title": "Social Security head steps down over DOGE access of recipient information: AP sources",
      "url": "https://apnews.com/article/social-security-elon-musk-doge-164c91f8477d5e7833af7f6de4bbde57",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "JACK DURA, MATTHEW BROWN",
      "description": "Harsh has cold descended on the nation’s midsection as a polar vortex grips the Rockies and northern Plains. The bitter cold comes on the heels of weekend storms that pummeled the eastern U.S. with floods, killing at least 14 people. The National Weather Service is warning of life-threatening cold as wind chills drop to minus 60 Fahrenheit in parts of North Dakota. Weather forces in the Arctic are combining to push the chilly air that usually stays near the North Pole into the U.S. and Europe. Extreme cold warnings have been issued for an 11-state swath of the U.S. stretching from the Canada border to Oklahoma and central Texas.",
      "publishedAt": "2025-02-17T05:06:38Z",
      "title": "Polar vortex to send 'life-threatening cold' across the U.S.",
      "url": "https://apnews.com/article/winter-weather-60715bce197e1668e9a225801acc967e",
      "urlToImage": "https://dims.apnews.com/dims4/default/59ff1d3/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F8a%2F5ebbe47719e3c12187abf1f624d3%2F0c3ef53d4d864463be89b42671cc5b1f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}