{
  "articles": [
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — FBI Director Christopher Wray told bureau workers Wednesday that he plans to resign at the end of President Joe Biden's term in January, an announcement that came a week and a half after President-elect Donald Trump said he would nominate loyalist Kash Patel for the job.",
      "publishedAt": "2024-12-11T19:21:25Z",
      "title": "FBI Director Wray says he intends to resign before Trump takes office in January",
      "url": "https://apnews.com/ca7553c92819b5487ce12de252a5a543",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef37b74d26b44cdeb2337417ce6f1ab4/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The gun found on the man charged with killing United Healthcare’s CEO matched shell casings found at the site of the shooting, New York City’s police commissioner said Wednesday as authorities scrutinized evidence and the suspect's experiences with the victim's industry.",
      "publishedAt": "2024-12-11T05:07:34Z",
      "title": "Gun found on suspect in killing of UnitedHealthcare CEO matches shell casings at scene, police say",
      "url": "https://apnews.com/64ba21747f41c3a81f661900e797b6d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18a92bf82ff45728637089b785bba40/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea's president defended his martial law decree as an act of governance and denied rebellion charges, vowing Thursday to “fight to the end” in the face of attempts to impeach him and intensifying investigations into last week’s dramatic move.",
      "publishedAt": "2024-12-12T01:01:49Z",
      "title": "South Korea's Yoon defends martial law as an act of governance and vows to 'fight to the end'",
      "url": "https://apnews.com/76af91dfc6a252a536ee1d80c0bdfccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ae866da70db483e9b4968755eaebc5c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Wednesday that he's picking Kari Lake as director of Voice of America, installing a staunch loyalist who ran unsuccessfully for Arizona governor and a Senate seat to head the congressionally funded broadcaster that provides independent news reporting around the world.",
      "publishedAt": "2024-12-12T03:22:37Z",
      "title": "Trump taps immigration hard-liner Kari Lake as head of Voice of America",
      "url": "https://apnews.com/e894cf2e84791b35528baa0cbdd66b22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/101c1166aa1041dba0b11228df135856/3000.jpeg"
    },
    {
      "author": "MIKE CATALINI",
      "description": "Is he a hero? A killer? Both? About the same time the #FreeLuigi memes featuring the mustachioed plumber from “Super Mario Brothers” mushroomed online this week, commenters shared memes showing Tony Soprano pronouncing Luigi Mangione, the man charged with murdering the UnitedHealthcare CEO in Manhattan, a hero.",
      "publishedAt": "2024-12-11T19:33:55Z",
      "title": "Arguments over whether Luigi Mangione is a 'hero' offer a glimpse into an unusual American moment",
      "url": "https://apnews.com/3a8c64a0bc412e0eeb84bca0c99b6e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5c32f18582444ae8fcabe7173c91f9e/1741.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, COLLEEN LONG and DAVID BAUDER",
      "description": "NEW YORK (AP) — Donald Trump used his image as a successful New York businessman to become a celebrity, a reality television star and eventually the president.",
      "publishedAt": "2024-12-11T17:50:53Z",
      "title": "Donald Trump will ring the New York Stock Exchange bell as he's named Time's Person of the Year",
      "url": "https://apnews.com/eb10badaba2347eeb3d44e7ddf805c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5aca641397f4aa6ab8432329da5e107/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "The large mysterious drones reported flying over parts of New Jersey in recent weeks appear to avoid detection by traditional methods such as helicopter and radio, according to a state lawmaker briefed Wednesday by the Department of Homeland Security.",
      "publishedAt": "2024-12-11T18:47:51Z",
      "title": "Homeland Security shares new details of mysterious drone flights over New Jersey",
      "url": "https://apnews.com/a978470fa3bb07ed3e98c5b7c18f0abb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52f3bd86bb05433c95a59002cf7bfb50/1920.jpeg"
    },
    {
      "author": "ROB MAADDI and AARON BEARD",
      "description": "Bill Belichick had seemingly been waiting for the right opportunity to return to an NFL sideline. Instead, the six-time Super Bowl-winning head coach is headed to the college ranks to take over at North Carolina.",
      "publishedAt": "2024-12-12T00:31:47Z",
      "title": "North Carolina announces 5-year deal with Bill Belichick to take over as coach of the Tar Heels",
      "url": "https://apnews.com/8d004be5ec1a4b55ba84adc75238c758",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b75d5664f9874d278de207d57c777aaf/2637.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Hannah Kobayashi, the missing Hawaii woman whose disappearance prompted a massive search and a missing persons investigation in Los Angeles, has been found safe, police said Wednesday.",
      "publishedAt": "2024-12-11T21:19:15Z",
      "title": "Hannah Kobayashi, missing Hawaii woman whose disappearance prompted a massive search, is found safe",
      "url": "https://apnews.com/f2f0dc2855b4a2a020b6e5623ef9ecbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9842ce74ef4d4c7e9a570f88f365c67f/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — The U.S. East Coast began a whiplash-inducing stretch of weather Wednesday with a deluge of rain, rapid snowmelt and powerful gusts, creating dangerous conditions, due in part to an atmospheric river and developing bomb cyclone.",
      "publishedAt": "2024-12-11T05:22:27Z",
      "title": "Atmospheric river brings weather whiplash to East Coast as bomb cyclone develops",
      "url": "https://apnews.com/81196e02e6fd13ce37bbb1f3c6ba88e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc20015f1cc54d5a99d2be3b900bc0e7/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}