{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JOE KRAUSS and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Benny Gantz, a popular centrist member of Israel’s three-member War Cabinet, threatened Saturday to resign from the government if it doesn't adopt a new plan in three weeks' time for the war in Gaza, a decision that would leave Prime Minister Benjamin Netanyahu more reliant on far-right allies.",
      "publishedAt": "2024-05-18T15:07:52Z",
      "title": "Member of Israel's War Cabinet says he'll quit the government June 8 unless there's a new war plan",
      "url": "https://apnews.com/3ac9d8e59198d5884d0faa6649a53e4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a436c70825d444f6890512aa17127dde/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "As Donald Trump increasingly infuses his campaign with Christian trappings while coasting to a third Republican presidential nomination, his support is as strong as ever among evangelicals and other conservative Christians.",
      "publishedAt": "2024-05-18T12:30:28Z",
      "title": "Jesus is their savior, Trump is their candidate. Ex-president's backers say he shares faith, values",
      "url": "https://apnews.com/43f25118c133170c77786daf316821c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cecbbbca2d9e4691882c4ea61baf7427/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and JOANNA KOZLOWSKA",
      "description": "KYIV, Ukraine (AP) — A divisive mobilization law in Ukraine came into force on Saturday, as Kyiv struggles to boost troop numbers after Russia launched a new offensive that some fear could close in on Ukraine’s second-largest city.",
      "publishedAt": "2024-05-18T10:19:03Z",
      "title": "Ukraine's divisive mobilization law comes into force as a new Russian push strains front-line troops",
      "url": "https://apnews.com/599753d08518b46e22bf38d1360cce86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27273adeddad4acc90f0f56e6b80f499/1920.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — One political party is holding urgent news conferences and congressional hearings over the topic. The other says it’s a dangerous distraction meant to seed doubts before this year's presidential election.",
      "publishedAt": "2024-05-18T04:10:18Z",
      "title": "Noncitizen voting, already illegal in federal elections, becomes a centerpiece of 2024 GOP messaging",
      "url": "https://apnews.com/1c65429c152c2a10514b5156eacf9ca7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6cc54eb6ba743c6aa5c923362fb0495/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "DALLAS (AP) — Former President Donald Trump urged gun owners to vote in the 2024 election as he addressed thousands of members of the National Rifle Association, which officially endorsed him just before Trump took the stage at their annual meeting in Texas on Saturday.",
      "publishedAt": "2024-05-18T04:11:44Z",
      "title": "Trump receives NRA endorsement as he vows to protect gun rights",
      "url": "https://apnews.com/de03ae7672f2b1e213da6acbf25df378",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a2ca82fe2e14cb4b345ef88ff87ed13/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — By the time Jesse Fernandez turned 18, the federal government had paid out thousands of dollars in Social Security survivor's benefits because of the death of his mother. But Jesse's bank account was empty.",
      "publishedAt": "2024-05-18T04:16:38Z",
      "title": "For decades, states have taken foster children's federal benefits. That's starting to change",
      "url": "https://apnews.com/c326723c64df9370b0e3331e49d4c297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44eba5fb40ff47a09606ab182f3a9bc6/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — U.S. officials have developed specific and highly credible intelligence suggesting that an American citizen who disappeared seven years ago while traveling in Syria has died, the man's daughter said Saturday.",
      "publishedAt": "2024-05-18T14:00:29Z",
      "title": "US intelligence suggests American who vanished in Syria in 2017 has died, daughter says she was told",
      "url": "https://apnews.com/7d56dc594bb6299c8d49957ec37c362e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b56aec4db505441989f65d77dfabf858/3000.jpeg"
    },
    {
      "author": "LEKAN OYEKANMI DAVID J. PHILLIP and KEN MILLER",
      "description": "HOUSTON (AP) — As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and scorching temperatures that could pose health risks.",
      "publishedAt": "2024-05-18T04:12:46Z",
      "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm",
      "url": "https://apnews.com/86643a6d7decd28e971774e03b52e51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd93920052dd49afa14706675bb8cdb7/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Newly released video appears to show Sean “Diddy” Combs beating his former singing protege and girlfriend Cassie in a Los Angeles hotel in 2016.",
      "publishedAt": "2024-05-18T13:53:58Z",
      "title": "Sean 'Diddy' Combs abuse allegations: A timeline of key events",
      "url": "https://apnews.com/dc31b0a748bdcfb43c4eb1cf39109f07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2885b309e8f64b3992655c108e31139e/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "Seize the Grey went wire to wire to win the Preakness Stakes on Saturday, giving 88-year-old Hall of Fame trainer D. Wayne Lukas a seventh victory in the race and ending Mystik Dan’s Triple Crown bid.",
      "publishedAt": "2024-05-18T10:00:23Z",
      "title": "Seize the Grey wins the Preakness for D. Wayne Lukas and ends Mystik Dan’s Triple Crown bid",
      "url": "https://apnews.com/2c27b76792b3b064d30baa07c3466ad3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e38d7aec029f4f299ff83e3b6df21812/2777.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}