{
  "articles": [
    {
      "author": "Angela Charlton, Hanna Arhirova",
      "description": "U.S. Secretary of State Marco Rubio says the U.S. may “move on” from efforts for a Russia-Ukraine peace deal if there is no progress in the coming days. He spoke in Paris after a marathon day of landmark talks among U.S., Ukrainian and European officials. Rubio said the discussions had been constructive and produced an outline for steps toward peace. French officials said a new meeting in the same format is expected in London in the coming days. Rubio said he could join that meeting, and it’s expected early in the week.",
      "publishedAt": "2025-04-18T07:29:24Z",
      "title": "Rubio says the US will drop Ukraine-Russia peace efforts if no progress within days",
      "url": "https://apnews.com/article/rubio-ukraine-russia-war-trump-a90e3e49c276b75ed2542f2f0422ddd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8d668ed/2147483647/strip/true/crop/6532x3674+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fe1%2F6f797f6937d75fa03de15b8c1c3a%2F7bdafe00088e49f485e901af67f65a9d"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen's Houthi rebels say U.S. airstrikes targeting the Ras Isa oil port have killed 20 people and wounded 50 others. The strikes were confirmed by the U.S. military’s Central Command, which did not acknowledge any casualties. The airstrikes represent one of the highest death tolls so far in the campaign launched under President Donald Trump that has involved hundreds of strikes since March 15. Central Command said U.S. forces acted to eliminate fuel for the Houthis and deprive them of illegal revenue.",
      "publishedAt": "2025-04-18T01:21:03Z",
      "title": "US strikes on oil port in Yemen kill 20, Houthi rebels say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a57bd/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F64%2F7202dc2069d1c5e6e7f243dbb0a6%2F44231e4191474113b7476d5342b9fa2c"
    },
    {
      "author": "Wafaa Shurafa, Fatma Khaled",
      "description": "Israeli airstrikes across Gaza have killed at least 17 people including children as the new U.S. ambassador to Israel made his first public appearance in Jerusalem. Gaza hospitals say among the dead early Friday were 10 people in the urban Jabaliya refugee camp, including eight from the same house. The strikes come a day after more than two dozen people died in Gaza as Israel ramps up attacks to pressure Hamas to return the hostages and disarm. U.S. Ambassador to Israel Mike Huckabee appeared at the Western Wall, the holiest Jewish prayer site in Jerusalem’s Old City, where he inserted a prayer handwritten by President Donald Trump.",
      "publishedAt": "2025-04-18T09:37:55Z",
      "title": "Israeli strikes kill at least 17 in Gaza and Huckabee makes first appearance as US ambassador",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-18-2025-4b267bb6600d0a41f899815bf3361563",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": null,
      "description": "Approximately 10,000 pages of records related to the 1968 assassination of Sen. Robert F. Kennedy have been released. The Friday release continues the disclosure of national secrets ordered by President Donald Trump. Director of National Intelligence Tulsi Gabbard says in a statement the RFK files’ release will “shine a long-overdue light on the truth.” Gabbard says, “Nearly 60 years after the tragic assassination of Senator Robert F. Kennedy, the American people will, for the first time, have the opportunity to review the federal government’s investigation thanks to the leadership of President Trump.” The U.S. National Archives and Records Administration posted roughly 229 files containing the pages on its website.",
      "publishedAt": "2025-04-18T14:38:11Z",
      "title": "10,000 pages of records related to the 1968 assassination of Robert F. Kennedy are released",
      "url": "https://apnews.com/article/rfk-assassination-files-released-74af7098faf255d92a5bff32899a7ce7",
      "urlToImage": "https://dims.apnews.com/dims4/default/cad272d/2147483647/strip/true/crop/2983x1678+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F02%2F8682526de983ff108e1ef6a3166d%2F9d900b37d98843d5ad73d1f4ce8d3480"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal judge who blocked the Trump administration from dismantling the Consumer Financial Protection Bureau has ruled that the agency can’t go forward immediately with plans to mass fire hundreds of employees. During a hearing on Friday, U.S. District Judge Amy Berman Jackson expressed concern that administration officials aren’t complying with her earlier order that maintains the agency’s existence until she rules on the merits of a lawsuit seeking to preserve the bureau. Jackson says she will bar officials from carrying out any mass firings or cutting off employees’ access to agency computer systems on Friday. She scheduled a hearing on April 28 to hear testimony from officials.",
      "publishedAt": "2025-04-18T16:04:15Z",
      "title": "Federal judge is pausing Trump administration's plans for mass layoffs at the CFPB",
      "url": "https://apnews.com/article/trump-consumer-financial-protection-bureau-65c7953b6d79043fc2ac58b660c3847d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0d82f3/2147483647/strip/true/crop/5447x3064+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd2%2Fb5ee1c7633d2e95aeac799aabb78%2F0d7a88f3f4f344fbbbf7a84c8114a6f1"
    },
    {
      "author": "Kate Payne, David Fischer",
      "description": "When a 20-year-old opened fire at Florida State University, terrified students barricaded doors and fled across campus, abandoning chemistry notes and even shoes. By early Friday, memorials of candles and flowers dotted the campus and a school-wide vigil had been scheduled as students and faculty tried to start healing from the shooting that investigators said killed two men and wounded at least six others. Investigators say the son of a sheriff’s deputy opened fire with his mother’s former service weapon. Officers who arrived almost immediately shot and wounded the shooter who is believed to be a Florida State student.",
      "publishedAt": "2025-04-18T04:42:19Z",
      "title": "Florida State University students felt fear and panic in deadly shooting",
      "url": "https://apnews.com/article/florida-state-university-shooting-c9a33f571466ce1ab1045dafebb30b82",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb88c98/2147483647/strip/true/crop/3773x2122+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F8e%2F70fa7758688151cac453eb0c9c82%2F1f2a016d09314784a8ebcf4a2c174e66"
    },
    {
      "author": "Jon Gambrell, Amir Vahdat",
      "description": "As far as biographies go, the two men in charge of the delicate negotiations between Iran and the United States over Tehran’s rapidly advancing nuclear program couldn’t be more different. On the American side, billionaire real estate magnate Steve Witkoff leads the effort by President Donald Trump’s administration to restrict Tehran’s atomic program, which they fear could allow Iran to build a nuclear weapon. Representing Iran is Foreign Minister Abbas Araghchi, who like many of his generation is a veteran of the bloody Iran-Iraq war. He rose through the ranks of Iran’s diplomatic corps and served as a trusted negotiator during talks that led to Iran’s 2015 nuclear deal with world powers.",
      "publishedAt": "2025-04-18T08:32:23Z",
      "title": "Iran-US talks hinge on a billionaire and a seasoned diplomat",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiators-witkoff-araghchi-5aeb1f0bec7a77637410800a2fd65d99",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e612c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F6c%2F6b0926d74b7f3b46c797a3c00f77%2F2c0db1dcce4d4e049345e370ba1c2e53"
    },
    {
      "author": "Scott Bauer",
      "description": "The Wisconsin Supreme Court has ruled that the Democratic governor legally used the state’s uniquely powerful veto to lock in a school funding increase for 400 years. The split ruling from the liberal-controlled court on Friday affirms the partial veto power of Wisconsin governors. The veto has been used by both Republican and Democratic governors to reshape spending bills passed by the Legislature. Gov. Tony Evers took an increase for the 2023-24 and 2024-25 school years and vetoed the “20” and the hyphen to make the end date 2425. The justices said governors are allowed to strike digits or create a longer duration than what the Legislature approved.",
      "publishedAt": "2025-04-18T14:26:58Z",
      "title": "Wisconsin governor can lock in 400-year school funding increase using a veto, court says",
      "url": "https://apnews.com/article/wisconsin-400-year-veto-supreme-court-5a1be188f78ab5e4223b2c7c7ad3ca7d",
      "urlToImage": "https://dims.apnews.com/dims4/default/15f1afd/2147483647/strip/true/crop/5360x3015+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fed%2F4883b116757ca410e3421f63445a%2Fd88799c2326c41a89d958a0b23b6d893"
    },
    {
      "author": "Michael R. Sisak",
      "description": "Harvey Weinstein has been moved to a New York City hospital after a judge approved the ailing ex-studio boss’s request to stay there rather than in jail when he’s not in court for his #MeToo retrial. Judge Paul Goetz late Thursday ordered that Weinstein be relocated from the Rikers Island jail complex to the prison ward at Bellevue Hospital so he can receive necessary medical treatment. Weinstein’s lawyers lobbied for the move as jury selection began this week. Goetz scheduled a hearing for next Thursday to discuss the matter further. A different judge, Curtis Farber, is presiding over Weinstein’s retrial. The case resumes Monday with more jury selection.",
      "publishedAt": "2025-04-18T16:25:27Z",
      "title": "Harvey Weinstein can stay in hospital during #MeToo retrial, judge rules",
      "url": "https://apnews.com/article/harvey-weinstein-sexual-misconduct-metoo-retrial-hospital-e2d4d25fd4abe858510d09a0772cbf8c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a5715d6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F82%2F172487125c8ebd45f95c7a94d785%2F32e4482f3d9f436595bbfb0016be3fbf"
    },
    {
      "author": "Deepa Bharath Of The Associated Press, Bob Smietana Of Religion News Service",
      "description": "James Gunn's upcoming film “Superman” is generating conversations about the place and relevance of this superhero who turned 87 on Friday, observed as Superman Day. Superman's origin story of escaping a destroyed homeland is relatable to Jewish people and several other immigrant experiences. Numerous comics and recent films and television shows have also attempted Christ-like portrayals of Superman. But scholars, writers and fans agree that Superman does not belong to one faith tradition or even one nation. Rather, he's a symbol of hope and transcendence for all.",
      "publishedAt": "2025-04-18T12:01:23Z",
      "title": "Fans of Superman relate to comic's religious and ethical themes",
      "url": "https://apnews.com/article/superman-comics-religion-morals-movie-fans-828f16fb956c487368d94676b04fa2c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/c445546/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F03%2F8e8fa299cd0090773bbe068780ea%2F664527f905fe46b3836e00a865530bd9"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}