{
  "articles": [
    {
      "author": "SAM METZ and AHMED HATEM",
      "description": "MOULAY BRAHIM, Morocco (AP) — The ground shook with a force few had ever felt, thundering through the remote Moroccan village in the dark of night. When the earthquake was over late Friday, the town carved into the Atlas Mountains lay in devastation — possibly dozens dead, scores of homes crumpled and walls reduced to rubble.",
      "publishedAt": "2023-09-10T04:43:44Z",
      "title": "Moroccan villagers mourn after earthquake brings destruction to their rural mountain home",
      "url": "https://apnews.com/52cc12e8b556bc86970fff8575e79581",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b5b69aea7404e76a49691b8efcd3b7e/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW DELHI (AP) — G20 leaders paid their respects at a memorial site dedicated to Indian independence leader Mahatma Gandhi on Sunday — a day after the forum added a new member and reached agreements on a range of issues but softened their language on Russia's war in Ukraine.",
      "publishedAt": "2023-09-10T04:29:54Z",
      "title": "G20 leaders pay their respects at a Gandhi memorial on the final day of the summit in India",
      "url": "https://apnews.com/9a44765ce588f9ed1b690a0f475a61ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e44030c795f4462906ad25cfd3bbd49/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "After a year and a half of fighting in Ukraine, Russia needs to replenish its supplies of ammunition for what could be a long war of attrition. Along with ramping up its domestic arms production, Moscow is turning to an old ally with a vast arsenal — North Korea.",
      "publishedAt": "2023-09-10T04:03:25Z",
      "title": "Russia is turning to old ally North Korea to resupply its arsenal for the war in Ukraine",
      "url": "https://apnews.com/95a4249a8c3746682f6649e13c718fb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f0418331b7f4b778504e1171fcc4c7c/3000.jpeg"
    },
    {
      "author": null,
      "description": "HONOLULU (AP) — Most of West Maui will officially reopen to travelers Oct.",
      "publishedAt": "2023-09-09T20:13:03Z",
      "title": "Most of West Maui will welcome back visitors next month under a new wildfire emergency proclamation",
      "url": "https://apnews.com/931f3611be9e80b53e0adca3d8449a6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1e3d91a8b38436ab2703ae7eb53d7c6/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER, GABE STERN and KEN RITTER",
      "description": "New Mexico Gov. Michelle Lujan Grisham's emergency order suspending the right to carry firearms in public in and around Albuquerque drew an immediate court challenge from a gun-rights group Saturday, as legal scholars and advocates said they expected.",
      "publishedAt": "2023-09-09T20:29:27Z",
      "title": "Group sues after New Mexico governor suspends right to carry guns in Albuquerque in public",
      "url": "https://apnews.com/3fbe91683934057fe3036ccf187a7f1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5db81b523890407abe341d693b0f683b/1725.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "AMES, Iowa (AP) — Donald Trump stepped out of a fraternity house to the cheers of hundreds of Iowa State University students and tossed autographed footballs into the crowd.",
      "publishedAt": "2023-09-09T04:19:13Z",
      "title": "Trump stops at a fraternity house on his way to Iowa-Iowa State football game, outdrawing his rivals",
      "url": "https://apnews.com/f398a634ce11048c5e49b207263994c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93ab185eaeda48b596c26830762a7a31/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The cost of building an artificial intelligence product like ChatGPT can be hard to measure. But one thing Microsoft-backed OpenAI needed for its technology was plenty of water, pulled from the watershed of the Raccoon and Des Moines rivers in central Iowa to cool a powerful supercomputer as it helped teach its AI systems how to mimic human writing.",
      "publishedAt": "2023-09-09T13:14:43Z",
      "title": "Artificial intelligence technology behind ChatGPT was built in Iowa — with a lot of water",
      "url": "https://apnews.com/f551fde98083d17a7e8d904f8be822c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c363406331a4942848999df02e84f49/3000.jpeg"
    },
    {
      "author": null,
      "description": "PHOENIX (AP) — How hot is it in Phoenix? In what has been the hottest summer ever measured, the sizzling city in the Sonoran Desert broke yet another record Saturday when temperatures topped 110 degrees Fahrenheit (43.3 Celsius).",
      "publishedAt": "2023-09-09T22:50:00Z",
      "title": "Phoenix has set another heat record by hitting 110 degrees on 54 days this year",
      "url": "https://apnews.com/9ef9fd938ad0e5d3e1be759189bfc444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f61262e4cc340ce995d3cc9cf55a2d3/3000.jpeg"
    },
    {
      "author": "NOREEN NASIR, AARON MORRISON and AISHA I. JEFFERSON",
      "description": "The racist motivations of the white shooter who targeted and fatally shot Black people in Jacksonville, Florida, two weeks ago have revived concerns about the threat of hate violence and domestic terrorism against African Americans.",
      "publishedAt": "2023-09-09T14:02:37Z",
      "title": "As Jacksonville shooting victims are eulogized, advocates call attention to anti-Black hate crimes",
      "url": "https://apnews.com/92e8e5fd940276c8dd6d90b6f89acd32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e1d015fdb884afd90185f2909eaa674/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israeli security forces on Saturday killed a 16-year-old Palestinian in a confrontation in the southern occupied West Bank, Palestinian health officials said, the latest violence to roil the territory during one of the most violent stretches of the Israeli-Palestinian conflict in nearly two decades.",
      "publishedAt": "2023-09-09T21:00:01Z",
      "title": "Israeli army kills 16-year-old Palestinian in West Bank, claiming youths threw explosives",
      "url": "https://apnews.com/152ed7794215af8711b1f1b895188d16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/512750dab29748cda39fd6cd38f69f49/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}