{
  "articles": [
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump hosted a rally featuring crude and racist insults at New York’s Madison Square Garden, turning what his campaign had dubbed as the event where he would deliver his closing message into an illustration of what turns off his critics.",
      "publishedAt": "2024-10-27T04:02:46Z",
      "title": "Trump's Madison Square Garden event features crude and racist insults",
      "url": "https://apnews.com/fcfe75be7f8281fde7bffa3adb3bba5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90442bea31574317964c9f74b71439ad/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MARYCLAIRE DALE and CHRIS MEGERIAN",
      "description": "PHILADELPHIA (AP) — Kamala Harris said Sunday that “no one can sit on the sidelines” in this year's presidential election, capping a day of campaigning across the largest city in the crucial battleground state of Pennsylvania.",
      "publishedAt": "2024-10-27T09:28:21Z",
      "title": "Harris rallies Philadelphia voters at church, barbershop, bookstore, restaurant and basketball court",
      "url": "https://apnews.com/640ea532f6de541a5e03509bfe1471ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f00bdf07945428b88922b29427973e7/1920.jpeg"
    },
    {
      "author": "GARY FIELDS, ALI SWENSON and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — American voters are approaching the presidential election with deep unease about what could follow, including the potential for political violence, attempts to overturn the election results and its broader implications for democracy, according to a new poll.",
      "publishedAt": "2024-10-28T04:09:44Z",
      "title": "US voters concerned about post-election violence and efforts to overturn the results: AP-NORC poll",
      "url": "https://apnews.com/3016f595faea0dfc81c487e856aafb04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f7d6b71be9544b0883305739d59f2e9/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — There is no doubt that the U.S. election will determine the trajectory of the war in Ukraine.",
      "publishedAt": "2024-10-28T05:58:12Z",
      "title": "The trajectory of Ukraine's fight against Russia hangs on the outcome of the US election",
      "url": "https://apnews.com/b709d17bf1e81531853bd85fb8414ece",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19d7f24f3e8d4fe4bca68de43bdac5f4/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "AIN EL DELB, Lebanon (AP) — It was Sunday, family time for most in Lebanon, and Hecham al-Baba was visiting his sister. She insisted he and their older brother stay for lunch, hoping to prolong the warm gathering in stressful times.",
      "publishedAt": "2024-10-27T04:09:33Z",
      "title": "A Lebanese family was holding a Sunday gathering when an Israeli strike toppled their building",
      "url": "https://apnews.com/963fceb3514518420b579a4a381ac286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/010c0ee5685d4704a8a01bd901aae288/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and MIKE PESOLI",
      "description": "WASHINGTON (AP) — Polarizing. Challenging. A lot of wasted time. That’s how six lawmakers described what it is like being in the U.S.",
      "publishedAt": "2024-10-28T04:19:55Z",
      "title": "In their own words: What it's like in a 'chaos' Congress and why these lawmakers keep coming back",
      "url": "https://apnews.com/50e562326d5c1d8a43cc86381d5705f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a98b52b4fad746c6b62272c01a863d27/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese Prime Minister Shigeru Ishiba’ s ruling coalition lost a majority in the 465-seat lower house in a key parliamentary election Sunday, a punishment by voters' outrage over the governing party’s extensive financial scandals.",
      "publishedAt": "2024-10-27T00:12:09Z",
      "title": "Japan's ruling coalition loses a majority in the lower house, creating political uncertainty",
      "url": "https://apnews.com/5c6509c7b83963ffe40588c50998967c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8c249a8580d469bb5983d7d376aedba/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "TBILISI, Georgia (AP) — Opposition supporters in Georgia planned to hold a protest in the country's capital on Monday against the official results of a weekend parliamentary election in which the governing party was declared victorious amid voting irregularities and allegations of Russian meddling.",
      "publishedAt": "2024-10-28T09:18:11Z",
      "title": "Georgia's opposition plans protest against governing party's declared election victory",
      "url": "https://apnews.com/f6667dd64b537bd2082bfc5396f4a955",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55561c48ca5f49ef9f1fbf9a54e72999/2270.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — They play on the same team, but they couldn’t be further apart. One member of the women’s volleyball team at San Jose State University has signed on to being part of a federal lawsuit against the NCAA challenging the presence of transgender athletes in women’s college sports.",
      "publishedAt": "2024-10-28T04:04:05Z",
      "title": "The dispute around a women's volleyball team touches on a broader question: How to define 'fair'",
      "url": "https://apnews.com/0e4da0292b4c5315e053e53c064d5a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97f9e124e07b436686b8296d0a547b71/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — McDonald’s announced Sunday that Quarter Pounders will again be on its menu at hundreds of its restaurants after testing ruled out beef patties as the source of the outbreak of E.",
      "publishedAt": "2024-10-27T22:34:22Z",
      "title": "McDonald’s Quarter Pounder back on the menu after testing rules out beef patties as E. coli source",
      "url": "https://apnews.com/fe0b86b40857b09dc01c001eacea3b67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50917ab551b6428592857c412690f556/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}