{
  "articles": [
    {
      "author": "Samya Kullab",
      "description": "A peace proposal by the Trump administration that includes recognizing Russian authority over Crimea shocked Ukrainian officials. They say they will not accept any formal surrender of the peninsula, even though they expect to concede the territory to the Kremlin, at least temporarily. Experts say giving up the land that was illegally annexed by Russia in 2014 is also politically and legally impossible. It would require a change to the Ukrainian constitution and a nationwide vote, and it could be considered treason. Lawmakers and the public are firmly opposed to the idea.",
      "publishedAt": "2025-04-27T05:11:09Z",
      "title": "Shocked by US peace proposal, Ukrainians say they will not accept any formal surrender of Crimea",
      "url": "https://apnews.com/article/russia-ukraine-war-crimea-peace-talks-concession-58de3cf0bd289e2e2377a9e4914285c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0db2d07/2147483647/strip/true/crop/7000x3937+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F08%2Ff1ba792f127855742e702e661401%2F3c05b3fedb0b4b67bf803810338e98f7"
    },
    {
      "author": "Darlene Superville, Aamer Madhani",
      "description": "President Donald Trump says he doubts Russia’s Vladimir Putin wants to end his war in Ukraine. Trump is expressing new skepticism that a peace deal can be reached soon. And his comments come only a day after saying Ukraine and Russia were “very close to a deal.” Trump said in a social media post Saturday as he flew back to the United States after Pope Francis’ funeral that “there was no reason for Putin to be shooting missiles into civilian areas, cities and towns, over the last few days.” Trump hinted at further sanctions against Russia. Trump said, “It makes me think that maybe he doesn’t want to stop the war, he’s just tapping me along.”",
      "publishedAt": "2025-04-26T11:41:11Z",
      "title": "Trump express doubts that Putin is willing to end the war in Ukraine",
      "url": "https://apnews.com/article/trump-russia-ukraine-zelenskyy-funeral-francis-vatican-7b3b3e6e194e7099e5463d1f23b5f3cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/c4b52ac/2147483647/strip/true/crop/1407x791+0+73/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fc3%2F9a70df4b57195e1a38dda0d0dcb0%2F3cbef852c0814b73b2c7ca99356e71a6"
    },
    {
      "author": null,
      "description": "A massive explosion and fire has struck the Iranian port city of Bandar Abbas. A provincial disaster management official told Iranian state television there were injuries in Saturday's blast, without elaborating. He added that first responders were trying to reach the area while others were attempting to evacuate the site. The official said the blast came from containers at Rajaei port in the city. Social media videos showed a huge plume of black smoke. Rajaei port mainly handles container traffic and also has oil tanks and other petrochemical facilities.",
      "publishedAt": "2025-04-26T09:32:07Z",
      "title": "A massive explosion and fire strikes the Iranian port city of Bandar Abbas",
      "url": "https://apnews.com/article/iran-explosion-fire-bandar-abbas-72637c6b3e152a30045275f57ace29ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/2234569/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fb8%2F550c1603af5b86e16d9bc8ba03a2%2Feb18966322944b7193001e9520f9a1a2"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are preparing to start in-depth negotiations in Oman over Tehran’s rapidly advancing nuclear program, talks that likely will hinge on the Islamic Republic’s enrichment of uranium. Iranian state television suggested the talks could start mid-day Saturday in Muscat, the mountain-wrapped capital of this sultanate on the eastern edge of the Arabian Peninsula. However, neither Iranian Foreign Minister Abbas Araghchi nor U.S. Mideast envoy Steve Witkoff offered any immediate specifics or details on the talks that they’ll lead. Witkoff on Friday was in Moscow meeting Russian President Vladimir Putin. He arrived Saturday to Oman.",
      "publishedAt": "2025-04-26T06:15:16Z",
      "title": "Iran and US prepare for expert nuclear talks in Oman",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-f2e4ecf49c62c11a0240153d7f900d0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a61f09e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F65%2F301cb2baf511f99243fbbbdce856%2F19bff9aab044437d911586b47ad11611"
    },
    {
      "author": "Jalal Bwaitel",
      "description": "Palestinian President Mahmoud Abbas has named a veteran aide and confidant as his new vice president. It’s a major step by the aging leader to designate a successor. The appointment Saturday of Hussein al-Sheikh as vice president of the Palestine Liberation Organization does not guarantee he will be the next Palestinian president. But it makes him the front-runner among longtime politicians in the dominant Fatah party who hope to succeed the 89-year-old Abbas. Abbas hopes to play a major role in postwar Gaza. He has been under pressure from Western and Arab allies to rehabilitate the Palestinian Authority, which has limited autonomy in parts of the Israeli-occupied West Bank.",
      "publishedAt": "2025-04-26T17:20:54Z",
      "title": "Palestinian President Mahmoud Abbas has appointed a new deputy in a major step in naming a successor",
      "url": "https://apnews.com/article/abbas-vice-president-palestinians-dbf76332c0ae895145c51e99345837a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/d66c82c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F08%2F8cb143bd65cd4fd8958bd3689d8c%2F00a53ad26f074b5a8e4442d40018eefd"
    },
    {
      "author": null,
      "description": "Police in Canada say the driver of a car struck revelers at a street festival, killing and injuring an unknown number of people. The Vancouver Police Department says the vehicle drove into a crowd at a Filipino community festival at 8:14 p.m. Saturday. The exact number of dead or injured was not immediately available. Police say the driver was taken into custody. The Lapu Lapu Day festival was being held in a South Vancouver neighbourhood. Video posted on social media showed victims and debris strewn across a long stretch of road, with at least seven people lying immobile on the ground. A black SUV with a crumpled front section could be seen in still photos.",
      "publishedAt": "2025-04-27T05:41:10Z",
      "title": "Lapu Lapu Day: Car kills and injures people attending street festival in Vancouver",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-6635b400430a7015341d3ca0c4c1e7fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/115816b/2147483647/strip/true/crop/3600x2025+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fe6%2F5b097ab3916a6fb1867990f1ce81%2Fc0812d82118c45daa131b00d0c4efb7c"
    },
    {
      "author": "Molly Quell",
      "description": "The top United Nations court on Monday will begin hearing from 40 countries on what Israel must do to provide desperately needed humanitarian assistance to Palestinians in Gaza and the occupied West Bank. The U.N. General Assembly has asked the International Court of Justice to weigh in on Israel’s legal obligations after the country effectively banned the U.N. agency for Palestinian refugees from operating. The agency had been the main provider of aid to Gaza. The court has been asked to give a non-binding but legally definitive answer. These are the latest judicial proceedings involving Israel and the 18-month war in Gaza.",
      "publishedAt": "2025-04-27T06:01:52Z",
      "title": "What is the International Court of Justice and why is it weighing in on humanitarian aid in Gaza?",
      "url": "https://apnews.com/article/israel-icj-court-gaza-palestinians-d372177d46cc3e21740631a1acb2169b",
      "urlToImage": "https://dims.apnews.com/dims4/default/033fd29/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F67%2F85a685e97539a239ba228deed214%2F2d70dc4c87c84a25830f81ca01747f8f"
    },
    {
      "author": "Nicole Winfield",
      "description": "Cardinals this week will start in-depth discussions on planning the conclave to choose Pope Francis' successor. No date has been set. But there's already a wrinkle going into the meetings. One of Francis’ enduring legacies was that he greatly expanded the ranks of the cardinals who will elect his successor, naming “princes of the church” from faraway countries that had never had one before. That legacy is now throwing a wrench in the traditional sport of speculating about the next pope, since these cardinals don’t know one another well and haven’t coalesced into clear voting blocs.",
      "publishedAt": "2025-04-27T04:02:03Z",
      "title": "Cardinals who will pick the next pope don't know each other well",
      "url": "https://apnews.com/article/vatican-conclave-pope-b4883723cbbba159b0264dd76526b55d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b447e68/2147483647/strip/true/crop/8009x4505+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2Ff3%2Fbb1a765874420dcdb179ecdc3bfb%2F94509dddd8fd4a2d8965f907cf7d3d22"
    },
    {
      "author": "Matt O'Brien",
      "description": "Artificial intelligence technology that works well for the world’s billions of people of color was a business imperative for Google when the company asked sociologist Ellis Monk to help make its AI products more inclusive. But less than three years after Google showcased Monk’s breakthrough in portraying a diversity of human faces in AI tools, broader efforts to combat the algorithmic bias deeply ingrained in AI technology are under fire from President Donald Trump’s administration and the Republican-led Congress. “Woke AI” has replaced harmful algorithmic discrimination as the problem that needs fixing.",
      "publishedAt": "2025-04-27T10:00:08Z",
      "title": "Tech industry tried reducing AI's pervasive bias. Now Trump wants to end its 'woke AI' efforts",
      "url": "https://apnews.com/article/artificial-intelligence-dei-trump-algorithmic-bias-woke-ai-8302e12dd74df69a1adc6565710f033d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0636c47/2147483647/strip/true/crop/7331x4124+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F0c%2Fab748cd48755428efd1aedec64e8%2Fbaf0cd4b49c148888a257de51e54926c"
    },
    {
      "author": "Seung Min Kim, Linley Sanders",
      "description": "An AP-NORC poll finds many Americans don't agree with President Trump’s aggressive efforts to quickly enact his agenda, and even Republicans aren't overwhelmingly convinced his attention has been in the right place. Americans are nearly twice as likely to say Trump has been mostly focusing on the wrong priorities as to say he's been focusing on the right ones. The findings suggest Democrats are even unhappier with the reality of the second Trump term than before he was sworn in. While about 7 in 10 Republicans say Trump has been at least a “good” president so far, only about half say he’s emphasized the right things.",
      "publishedAt": "2025-04-26T11:23:37Z",
      "title": "Only about half of Republicans say Trump's priorities are right, poll finds",
      "url": "https://apnews.com/article/trump-economy-immigration-trade-100-days-poll-625efe6128d5f2e90e04bcc7f30479eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e1b039/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Ff0%2F030b88fe7d8fee886c3dc11bb0f9%2F2610ee8fca9a4779b7ad6287619a5703"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}