{
  "articles": [
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — If some U.S. lawmakers have their way, the United States and China could end up with something in common: TikTok might not be available in either country.",
      "publishedAt": "2024-03-14T04:05:14Z",
      "title": "US lawmakers see TikTok as China's tool, even as it distances itself from Beijing",
      "url": "https://apnews.com/2d851c716d6454d7c87762a056604c7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dde72244d91745b7a9a735eda8422d2f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and TERRY SPENCER",
      "description": "FORT PIERCE, Fla. (AP) — A federal judge will hear arguments Thursday on whether to dismiss the classified documents prosecution of Donald Trump, with his attorneys asserting that the former president was entitled to keep the sensitive records with him when he left the White House and headed to Florida.",
      "publishedAt": "2024-03-14T04:09:00Z",
      "title": "Judge to hear arguments on whether to dismiss Trump's classified documents prosecution",
      "url": "https://apnews.com/200d4c73d7c7dd75d9c9d878b77d05ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The Israeli military said Wednesday it plans to direct a significant portion of the 1.4 million displaced Palestinians living in the Gaza Strip’s southernmost town of Rafah toward “humanitarian islands” in the center of the territory ahead of its planned offensive in the area.",
      "publishedAt": "2024-03-13T18:48:58Z",
      "title": "Israel says it plans to direct Palestinians out of Rafah ahead of anticipated offensive",
      "url": "https://apnews.com/1ecd20b754890b623f523be41591aadf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28682e2ae6cc4ae397895810846b38ea/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — A brother contemplated suicide. A sister stopped going to school. A father barely speaks. With each passing day, the relatives of hostages held in Gaza since Oct. 7 face a deepening despair.",
      "publishedAt": "2024-03-14T05:15:18Z",
      "title": "Families of hostages held in Gaza despair as Ramadan cease-fire deadline passes",
      "url": "https://apnews.com/d1b0da2f7bd2e9882f79ebae874561be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d4196c7e4cf4d458a2de51b7c8b37ca/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Ukraine fired at least eight missiles at Russia’s Belgorod border region, killing one person and wounding six, local officials said Thursday, as Kyiv’s forces apparently kept up their efforts to rattle the Kremlin on the eve of Russia’s presidential election, a vote that is taking place amid a ruthless crackdown on dissent.",
      "publishedAt": "2024-03-14T10:42:38Z",
      "title": "Russia says Ukraine has fired more missiles at a border region on the eve of election favoring Putin",
      "url": "https://apnews.com/76c1c3031e803c79ff80351d2bcd34b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5bf3cf048b34f769952af249f8324e3/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and KELVIN CHAN",
      "description": "LONDON (AP) — Artificial intelligence is supercharging the threat of election disinformation worldwide, making it easy for anyone with a smartphone and a devious imagination to create fake – but convincing – content aimed at fooling voters.",
      "publishedAt": "2024-03-14T05:08:38Z",
      "title": "Election disinformation takes a big leap with AI being used to deceive worldwide",
      "url": "https://apnews.com/bc283e7426402f0b4baa7df280a4c3fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50315b595ec84105a0216af3bdb592b3/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — Massive chunks of hail pelted parts of Kansas and Missouri on Wednesday night, bringing traffic to a standstill along Interstate 70 and unleashing a possible tornado, as meteorologists urged residents to stay indoors.",
      "publishedAt": "2024-03-13T21:30:17Z",
      "title": "Storm carrying massive 'gorilla hail' hits parts of Kansas and Missouri",
      "url": "https://apnews.com/3d813afdc4b07eef5212695fb459450e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bc51e3818ec450281d4e2c300b6c540/1350.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "KANEOHE, Hawaii (AP) — A pinky and thumb extended with the remaining fingers curled down: That’s the “shaka” in Hawaii. The gesture is sometimes known outside the islands as the “hang loose” sign associated with surf culture, but it was a fixture of daily life in the islands long before it caught on in California, Brazil and beyond.",
      "publishedAt": "2024-03-14T04:12:45Z",
      "title": "It's not just 'hang loose.' Lawmakers look to make the friendly 'shaka' Hawaii's official gesture",
      "url": "https://apnews.com/8259a7dacaa8d383515f1aaed0aa6f80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f8f385c97194c68b4ae01c30e632d22/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "Math enthusiasts around the world, from college kids to rocket scientists, celebrate Pi Day on Thursday, which is March 14 or 3/14 — the first three digits of an infinite number with many practical uses.",
      "publishedAt": "2024-03-14T07:15:13Z",
      "title": "What's Pi Day all about? Math, science, pies and more",
      "url": "https://apnews.com/f426c8659529cb07655b5f07b99ce1dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fc7423eead84e83a85baf26f92b55a7/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO and LINLEY SANDERS",
      "description": "As Dartmouth men's basketball players move toward forming the first labor union in college sports, a majority of Americans say they are against college athletes unionizing — though younger respondents are more supportive.",
      "publishedAt": "2024-03-14T10:10:25Z",
      "title": "Majority of U.S. adults are against college athletes joining unions, according to AP-NORC survey",
      "url": "https://apnews.com/34c52d9f57c2801860c2a059467c670c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c51affb055f24573aedd5101a4618fad/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}