{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — President Biden signs bill passed by Congress to fund agencies until Nov. 17, averting government shutdown.",
      "publishedAt": "2023-10-01T03:28:36Z",
      "title": "President Biden signs bill passed by Congress to fund agencies until Nov. 17, averting government shutdown",
      "url": "https://apnews.com/2c729a16c79f2fa7cc9492160bc9fa0b",
      "urlToImage": ""
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The threat of a federal government shutdown suddenly lifted late Saturday as President Joe Biden signed a temporary funding bill to keep agencies open with little time to spare after Congress rushed to approve the bipartisan deal.",
      "publishedAt": "2023-09-30T04:09:40Z",
      "title": "Government shutdown averted with little time to spare as Biden signs funding before midnight",
      "url": "https://apnews.com/732baaa19c91f981e492fd0e6a76aba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78169ce4053f48af8afb1d17378cdb0e/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR and COLLEEN SLEVIN",
      "description": "SPRINGFIELD, Ill. (AP) — Five people were killed and five were seriously injured after a truck overturned in central Illinois, causing a toxic substance to leak from its cargo and forcing the evacuation of hundreds of area residents, authorities said Saturday.",
      "publishedAt": "2023-09-30T07:57:48Z",
      "title": "A truck crash in Illinois kills 5, seriously injures 5 and forces an evacuation due to ammonia leak",
      "url": "https://apnews.com/4e86653cb60515022dea05c45046329d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e04ad0f023c5411cbbcc65df1e866451/1500.jpeg"
    },
    {
      "author": "JEFF McMILLAN",
      "description": "Dianne Feinstein once stood at the center of a pivotal moment in LGBTQ+ history. Decades later, in death, she's being lauded by LGBTQ+ leaders as a longtime ally who, if she didn't always initially do the right thing, was able to learn and evolve.",
      "publishedAt": "2023-09-30T14:14:08Z",
      "title": "Dianne Feinstein was at the center of a key LGBTQ+ moment. She's being lauded as an evolving ally",
      "url": "https://apnews.com/a736eb15f16c9f29da807b77fea72d12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b08e8bdee91413f9afaa6247fefc190/1981.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — The first arrest in the 1996 slaying of Tupac Shakur had its roots in the investigation of the killing of Biggie Smalls.",
      "publishedAt": "2023-09-30T04:09:20Z",
      "title": "Arrest in Tupac Shakur killing stemmed from Biggie Smalls death investigation",
      "url": "https://apnews.com/4a65a9936866f18be6ed7859b67904bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89a69994eba542acb5ee8a3d14d525a1/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is returning to a new term to take up some familiar topics — guns and abortion — and concerns about ethics swirling around the justices.",
      "publishedAt": "2023-09-30T13:49:02Z",
      "title": "The Supreme Court will take up abortion and gun cases in its new term while ethics concerns swirl",
      "url": "https://apnews.com/a3974d91476564a80875604b4a642e03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/407eec8babf04b1582a94ed6466977da/3000.jpeg"
    },
    {
      "author": "BRITTANY PETERSON and MICHAEL PHILLIS",
      "description": "Hours before devastating fires scorched the historic town of Lahaina on Maui, Kyle Ellison labored to save his rental house in Kula, a rural mountain town 24 miles away, from a different blaze.",
      "publishedAt": "2023-09-30T13:38:03Z",
      "title": "When Kula needed water to stop wildfire, it got a trickle. Many other US cities are also vulnerable",
      "url": "https://apnews.com/285a21f64d20d2a58a5c420f5a04a218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bb3605286ac487eb1ade1a051668b7d/3000.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — California won't be giving unemployment checks to workers on strike, with Democratic Gov. Gavin Newsom vetoing a bill Saturday that had been inspired by high-profile work stoppages in Hollywood and the hotel industry.",
      "publishedAt": "2023-10-01T02:28:05Z",
      "title": "California governor rejects bill to give unemployment checks to striking workers",
      "url": "https://apnews.com/d934620ebe0eedc4579293edac2f9709",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c76084790b049dca7be325ccde552a1/3000.jpeg"
    },
    {
      "author": "SUMMER BALLENTINE",
      "description": "The police chief who led a highly criticized raid of a small Kansas newspaper has been suspended, the mayor confirmed to The Associated Press on Saturday.",
      "publishedAt": "2023-09-30T20:31:02Z",
      "title": "The police chief who led a raid of a small Kansas newspaper has been suspended",
      "url": "https://apnews.com/306638d67f4cdeef834a7b20523c40cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71c9e118e0724130a3044af8322b4ce3/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "A federal agency has sued the restaurant chain Chipotle, accusing it of religious harassment and retaliation after a manager at a Kansas location forcibly removed an employee's hijab, a headscarf worn by some Muslim women.",
      "publishedAt": "2023-09-30T19:30:21Z",
      "title": "Federal agency sues Chipotle after a Kansas manager allegedly ripped off an employee's hijab",
      "url": "https://apnews.com/f4dacb3837044be206202ddca52f92d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c9f7f9d94474528ba5ce2bb3c152bbe/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}