{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "Word spread through an Oregon hospital last month that a visitor was causing trouble in the maternity ward, and nurses were warned the man might try to abduct his partner's newborn.Hours later, the visitor opened fire, killing a security guard and sending patients, nurses and doctors scrambling for cover.",
      "publishedAt": "2023-08-07T04:22:13Z",
      "title": "Attacks at US medical centers show why health care is one of the nation's most violent fields",
      "url": "https://apnews.com/aa6918569ff8f76ff8a15b9813e31686",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b93adc60a05d44908a34135e170e4e3e/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Tou Thao, the last former Minneapolis police officer convicted in state court for his role in the killing of George Floyd, did not show any repentance or admit any wrongdoing as he was sentenced Monday to 4 years and 9 months.",
      "publishedAt": "2023-08-07T04:47:01Z",
      "title": "Ex-Minneapolis officer unrepentant as he gets nearly 5 years in George Floyd killing",
      "url": "https://apnews.com/586deaeb4d14807ef3f2bdd0196d0b86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5718d32e6c814e9f82f727116335ffd1/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Republican presidential candidate Ron DeSantis said definitively that rival Donald Trump lost the 2020 election, an acknowledgment the Florida governor made after years of equivocating answers.",
      "publishedAt": "2023-08-07T14:37:24Z",
      "title": "'Of course' Trump lost the 2020 election, DeSantis says after years of hedging",
      "url": "https://apnews.com/cd1d41616af686bb4ed43d1cef593418",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82aafba1322341be82f02e6e14ef0f2d/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A federal judge tossed out former President Donald Trump's countersuit against the writer who won a sex abuse lawsuit against him, ruling Monday that Trump can’t claim she defamed him by continuing to say she was not only sexually abused but raped.",
      "publishedAt": "2023-08-07T19:13:12Z",
      "title": "Judge tosses Trump's defamation suit against writer who won sexual abuse lawsuit against him",
      "url": "https://apnews.com/ce51d06c2cd71cca6f455527a9baacf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8775c6c412d4163bbcc424cebc011ca/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and NICHOLAS RICCARDI",
      "description": "DENVER (AP) — The U.S. Justice Department is cooperating with the International Criminal Court and supporting Ukrainian prosecutors carrying out war crime investigation s, Attorney General Merrick Garland said Monday as he reaffirmed his department's aid more than a year after the Russian invasion.",
      "publishedAt": "2023-08-07T17:55:52Z",
      "title": "Justice Department helping Ukraine in war crimes investigations, Attorney General Garland says",
      "url": "https://apnews.com/e97f813c4bc4cba74b5415c46d70aa32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/313fcad47b0e403fa0f6639f471d0091/3000.jpeg"
    },
    {
      "author": null,
      "description": "CABAZON, Calif. (AP) — Two firefighting helicopters collided while responding to a blaze in Southern California, sending one to the ground in a crash that killed all three people on board. The accident late Sunday afternoon in the desert about 85 miles (137 kilometers) east of Los Angeles involved a huge Sikorsky S-64E and a smaller Bell 407.",
      "publishedAt": "2023-08-07T05:01:41Z",
      "title": "Firefighting helicopters collide over Southern California desert, killing 3 in crash",
      "url": "https://apnews.com/10d52bcc63b4ab6cc9c8d6285b65d322",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4059a074b538419f83f5858cd095798e/1920.jpeg"
    },
    {
      "author": null,
      "description": "HARRISBURG, Pa. (AP) — A bus carrying up to 50 people traveling from New York to Ohio crashed and hit another vehicle on a Pennsylvania interstate, killing three passengers, state police said.The wreck happened during heavy rain around 11:50 p.m.",
      "publishedAt": "2023-08-07T10:43:21Z",
      "title": "A survivor of the fatal Pennsylvania bus crash describes chaos, heroism after it turned over",
      "url": "https://apnews.com/cb01e4aee7e992ace8b578c6b1296602",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf195a6ef86640768db9125fdefb8d4d/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHICAGO (AP) — An 8-year-old Chicago girl riding a scooter was fatally shot in the head by a man who was upset over noise, witnesses said.\"It just didn’t make sense. None of it made sense,” a neighbor, Megan Kelley, told the Chicago Sun-Times.",
      "publishedAt": "2023-08-07T13:12:54Z",
      "title": "8-year-old Chicago girl fatally shot by man upset with kids making noise, witnesses say",
      "url": "https://apnews.com/e7f119f69235be7453e57f76df8efaff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0506d49785684c50911ca57a57981dec/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Rapper Tory Lanez 's father grew emotional in court as he described his son losing his mother at age 11 as a judge prepares to sentence Lanez on Monday for shooting and wounding hip-hop star Megan Thee Stallion in the feet.",
      "publishedAt": "2023-08-07T05:06:31Z",
      "title": "Tory Lanez's father, son appeal to judge before rapper's sentencing for shooting Megan Thee Stallion",
      "url": "https://apnews.com/5eeaafd1a913ebf46094bcb0358364ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/701f5a8df90c425199f3c567bd8a67d3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}