{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Hospitals in Gaza faced collapse Monday as water, power and medicine neared depletion, and hundreds of thousands of Palestinians searched for dwindling food supplies while Israel maintained punishing airstrikes in retaliation for last week's deadly rampage by Hamas.",
      "publishedAt": "2023-10-16T03:24:13Z",
      "title": "Humanitarian aid is stuck at Gaza-Egypt border as Israeli siege strains hospitals, water supply",
      "url": "https://apnews.com/781b3c63af4ae6e51c313a68f314e66d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d47e0acceff422e9a57180e70b77e1b/1920.jpeg"
    },
    {
      "author": "SOPHIA TAREEN and ED WHITE",
      "description": "CHICAGO (AP) — A 71-year-old Illinois landlord upset over the Israel-Hamas war attacked a Palestinian American woman with a knife when she proposed they “pray for peace” and killed her 6-year-old son, authorities said Monday.",
      "publishedAt": "2023-10-16T16:15:29Z",
      "title": "Muslim woman stabbed in Illinois, son killed after she urged landlord to 'pray for peace'",
      "url": "https://apnews.com/9f30f422e47ed8ef36ea6a25a4052341",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b41cbd29203c477a85e0de04edd6841e/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The federal judge overseeing the 2020 election interference case against Donald Trump in Washington imposed a narrow gag order on him on Monday, barring the Republican former president from making statements targeting prosecutors, possible witnesses and court staff.",
      "publishedAt": "2023-10-16T04:26:49Z",
      "title": "Trump has narrow gag order imposed on him by federal judge overseeing 2020 election subversion case",
      "url": "https://apnews.com/b5f59c6688504c952df5f70029228f9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca0674059278430c8cfa52dcb1c01044/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden postponed a trip to Colorado on Monday to stay in Washington and focus on the growing conflict in the Middle East, setting aside an opportunity to pitch his economic accomplishments as he runs for reelection.",
      "publishedAt": "2023-10-16T09:05:49Z",
      "title": "Biden postpones trip to Colorado to discuss domestic agenda as the Israel-Hamas conflict intensifies",
      "url": "https://apnews.com/ab1424ffde9a8178083fe987db5cc839",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b86d30e8660486198e8c282bfbb39d8/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Normal life in Israel stopped when Hamas attacked on Oct.",
      "publishedAt": "2023-10-16T18:11:56Z",
      "title": "The Israeli public finds itself in grief and shock, but many pledge allegiance to war effort",
      "url": "https://apnews.com/7de831d6cb74ff263438a1f2758b681d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98f87f3193cb411692cc771397d20a17/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Two weeks without a House speaker, Republicans will meet behind closed doors Monday evening to try to unite around their new nominee, far-right firebrand Rep.",
      "publishedAt": "2023-10-16T17:34:30Z",
      "title": "GOP's Jim Jordan is shoring up support and peeling off detractors ahead of a House speaker vote",
      "url": "https://apnews.com/0b92b9a88864dcbc9edcba94aede74f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/affe6d8820a24e8983805bfbc88fcc09/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GONZALO SOLANO",
      "description": "QUITO, Ecuador (AP) — Ecuador 's youngest elected and richest president on Monday faced the practically impossible task of reducing a terrifying, drug-driven crime wave within a greatly shortened 1.5 years in office.",
      "publishedAt": "2023-10-16T05:00:39Z",
      "title": "Ecuador’s youngest elected president faces a practically impossible task",
      "url": "https://apnews.com/549b7ca192e4e995cdfab96a39939381",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b8373fb9ead433daced8cce8b0da413/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "SUAMICO, Wis. (AP) — Kim Pytleski could barely sleep the night before. She replayed the PowerPoint slides in her head, packed her notebook and took a deep breath.The clerk from a rural Wisconsin county north of Green Bay was preparing for a public meeting to explain the election process to residents.",
      "publishedAt": "2023-10-16T04:13:43Z",
      "title": "Few Republicans have confidence in elections. It's a long road for one group trying to change that",
      "url": "https://apnews.com/ab1809a325b22e86437722dc6d7e607f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a436946290f4ebf99505cc1bdc2d698/3000.jpeg"
    },
    {
      "author": "TOM MURPHY and ELAINE KURTENBACH",
      "description": "Rite Aid has filed for bankruptcy protection and plans to sell part of its business as it attempts to restructure while dealing with losses and opioid-related lawsuits.The company said Rite Aid stores will continue to fill prescriptions, and customers will still be able to visit its locations or shop online while it goes through its voluntary Chapter 11 process.",
      "publishedAt": "2023-10-16T04:58:50Z",
      "title": "Rite Aid seeks Chapter 11 bankruptcy protection as it deals with lawsuits and losses",
      "url": "https://apnews.com/f80c3d231946d675b03e4e797f627fa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0bce0f27e3d48cdb9dcada16ac05b3a/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — The federal government would be barred from immigration policies that separate parents from children for eight years under a proposed court settlement announced Monday that also provides families that were split under the Trump administration with temporary legal status and short-term housing aid.",
      "publishedAt": "2023-10-16T16:13:02Z",
      "title": "Settlement over Trump family separations at the border limits future separations for 8 years",
      "url": "https://apnews.com/f9a73685d0ddbcda86e5b69997f5f7dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0272da80cbe74829884d2dbda9393737/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}