{
  "articles": [
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is set to use his State of the Union address Thursday to promote his vision for a second term to a dispirited electorate who questions whether he's up to the job and to warn that GOP front-runner Donald Trump would be a dangerous alternative.",
      "publishedAt": "2024-03-07T05:03:44Z",
      "title": "Biden is hoping to use his State of the Union address to show a wary electorate he's up to the job",
      "url": "https://apnews.com/1a42ff9d4ef3e0f2753e43ac8d39fc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8977b0e34a64947ab8eb2bf3f66c5e4/3000.jpeg"
    },
    {
      "author": "BILL BARROW and WILL WEISSERT",
      "description": "ATLANTA (AP) — Joe Biden and Donald Trump each won the White House by razor-thin margins in key states.",
      "publishedAt": "2024-03-07T05:11:18Z",
      "title": "The Biden and Trump campaigns are readying for their rematch, starting with rival events in Georgia",
      "url": "https://apnews.com/c02530a6e86e63f72eb6a616c16b0b4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/603576ecb1f240a4aad85faa4816e5e4/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Egyptian officials said Thursday that negotiations over a cease-fire in Gaza are at an impasse as Hamas insists on a process to end to the war. After nearly five months of war, much of Gaza is in ruins, and international pressure is growing for Israel and Hamas to reach a deal that would halt the fighting and release the remaining Israeli hostages held by Hamas.",
      "publishedAt": "2024-03-07T08:45:11Z",
      "title": "The Latest | Gaza cease-fire talks are at an impasse, Egyptian officials say",
      "url": "https://apnews.com/4ab403e8416f44640ed26160843e4540",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95bdc557882b471c8b3219a6657bf063/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — The first fatal attack by Yemen's Houthi rebels on shipping threatens to further sever a crucial maritime artery for global trade and carries with it risks beyond those just at sea.",
      "publishedAt": "2024-03-07T09:15:49Z",
      "title": "Analysis: First fatal attack on shipping by Yemen's Houthi rebels escalates risk for reeling Mideast",
      "url": "https://apnews.com/a60e865cab24689ee6f69b65f438e4f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0fbdafdfd3842f4b492be4bebc8c107/618.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Facing pressure to get in vitro fertilization services restarted in the state, Alabama's governor swiftly signed legislation into law Wednesday shielding doctors from potential legal liability raised by a court ruling that equated frozen embryos to children.",
      "publishedAt": "2024-03-06T06:01:46Z",
      "title": "Alabama governor signs legislation protecting IVF providers from legal liability into law",
      "url": "https://apnews.com/cab8171e80c88a088778dc7a187b7b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/633dd09f0cba452cae1515eb9de03f37/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — It's not just opposition politicians who are targeted in the crackdown by Russian President Vladimir Putin's government in recent years.",
      "publishedAt": "2024-03-07T05:13:28Z",
      "title": "Putin's crackdown casts a wide net, ensnaring the LGBTQ+ community, lawyers and many others",
      "url": "https://apnews.com/d9c96f550e6c0cb61363003c735fabec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a9babe5dab745aaa5c715ee7cc7e20a/3000.jpeg"
    },
    {
      "author": "AYSE WIETING and SUZAN FRASER",
      "description": "ISTANBUL (AP) — Muhterem Evcil was stabbed to death by her estranged husband at her workplace in Istanbul, where he had repeatedly harassed her in breach of a restraining order. The day before, authorities detained him for violating the order but let him go free after questioning.",
      "publishedAt": "2024-03-07T05:23:03Z",
      "title": "Turkey struggles to stop violence against women. At least 71 have been killed this year",
      "url": "https://apnews.com/bd261ad004ded6a8b7ca32c83cab315c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4d09294d3934256be4a3e4cb3e8f2c8/3000.jpeg"
    },
    {
      "author": "EILEEN NG",
      "description": "KUALA LUMPUR, Malaysia (AP) — Over the past decade, Grace Subathirai Nathan graduated from law school, got married, opened a law firm and had two babies. But part of her is frozen in time, still in denial over the loss of her mother on a missing Malaysia Airlines plane in 2014.",
      "publishedAt": "2024-03-07T02:21:19Z",
      "title": "Frozen in time: Families of those on missing Flight 370 cannot shake off their grief without answers",
      "url": "https://apnews.com/e3a5a40ed7fc49cca79871583c236209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36a0c827a00b41afa0ea395153fad87a/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Once again, most Americans will set their clocks forward by one hour this weekend, losing perhaps a bit of sleep but gaining more glorious sunlight in the evenings as the days warm into summer.",
      "publishedAt": "2024-03-07T06:08:26Z",
      "title": "Why are clocks set forward in the spring? Thank wars, confusion and a hunger for sunlight",
      "url": "https://apnews.com/41beeca27270e67482b6a2e2904034bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a20e766ca3642abb3e9b06206ab0cda/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA and WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Once upon a time, there was a brief outage on some social media platforms. It got fixed. The end. On the face of it, kind of a boring story.But the widespread attention given to the blanking of Meta’s Facebook, Instagram, Threads and Messenger platforms on Tuesday suggests another, perhaps less obvious tale: the one that shows that social media platforms, like the books or newspapers or insert-medium-here of other times in history, matter more than just being entertaining pastimes.",
      "publishedAt": "2024-03-07T05:07:14Z",
      "title": "For social platforms, the outage was short. But people's stories vanished, and that's no small thing",
      "url": "https://apnews.com/09715654c00988b5f1144282fc509ac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef9c684669904e0183df2b8eb16ed16d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}