{
  "articles": [
    {
      "author": null,
      "description": "The risk of life-threatening flooding is still high in central Texas with more rain on the way. The urgent search for the missing continues following a holiday weekend deluge that killed at least 82 people including children at summer camps. Officials say the death toll is sure to rise. Gov. Greg Abbott says more than 40 people are unaccounted for. Searchers now have found 68 bodies in Kerr County, where a wall of water came down the Guadalupe River. Sheriff Larry Leitha says the dead include 28 children. Abbott warned Sunday that additional rounds of heavy rains lasting into Tuesday could produce more flash flooding.",
      "publishedAt": "2025-07-07T04:06:20Z",
      "title": "More than 80 dead, dozens missing in Texas flooding as search continues",
      "url": "https://apnews.com/article/texas-flash-flood-severe-weather-camp-mystic-ef8e596833b145fef61451db92f32609",
      "urlToImage": "https://dims.apnews.com/dims4/default/738f522/2147483647/strip/true/crop/3600x2025+0+98/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2Fea%2Fd31d346a5c32b59bb3a8b71af6a5%2F6e234350183a4cee91a68653a78d0693"
    },
    {
      "author": null,
      "description": "Flash floods in Texas have killed nearly 70 people, many of them children. An unknown number of people are missing. Heavy rains fell quickly in the predawn hours Friday in the Texas Hill Country, causing the Guadalupe River to rise 26 feet in just 45 minutes. Among the missing are 27 girls from Camp Mystic, a Christian summer camp. Officials are resisting estimating the total number of missing. The July Fourth holiday weekend likely brought an influx of visitors to the area outside San Antonio, making it difficult to track all the people who may have been in the area.",
      "publishedAt": "2025-07-06T16:25:30Z",
      "title": "What to know about the Texas flash floods and the rising death toll",
      "url": "https://apnews.com/article/flash-flood-texas-camp-mystic-aec9181a07d3ce8ff85197922e108b13",
      "urlToImage": "https://dims.apnews.com/dims4/default/154f53b/2147483647/strip/true/crop/3600x2025+0+80/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F78%2Fd1cad5f70533b8ed2593e866e61c%2F71337bc08bf34e5ebd8267d8fc6fb9a3"
    },
    {
      "author": null,
      "description": "President Donald Trump on Monday set a 25% tax on goods imported from Japan and South Korea, as well as new tariff rates on a dozen other countries. Trump provided notice of the tariffs to begin on Aug. 1 by posting letters on Truth Social that were addressed to the leaders of the various countries. The letters warned them to not retaliate by increasing their own import taxes, or else the Trump administration would further increase import taxes. The higher tariffs could hinder economic growth, if not increase recession risks.",
      "publishedAt": "2025-07-07T16:40:16Z",
      "title": "Trump announces more tariffs on Japan, South Korea, Malaysia, other nations",
      "url": "https://apnews.com/article/trump-japan-south-korea-tariff-25-2c725e8f06367e20f9300c1081ea4ec0",
      "urlToImage": "https://dims.apnews.com/dims4/default/04b9b5d/2147483647/strip/true/crop/7308x4111+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fe6%2F8707d986cd61d645b72eb551835d%2Ff3a1477a770e4df0a343abb3419f5ec5"
    },
    {
      "author": null,
      "description": "The Israeli military says five soldiers were killed in an attack in northern Gaza, while health officials in the Palestinian territory say 18 people were killed in Israeli strikes. The bloodshed came as Israeli Prime Minister Benjamin Netanyahu was visiting the White House for talks with President Donald Trump about a ceasefire plan to pause the Gaza fighting. While there was no announcement of a breakthrough from that meeting, there were signs of progress toward a deal. The killings of the soldiers could add to the pressure on Netanyahu to strike a deal in Israel, where polls have shown widespread support for ending the war.",
      "publishedAt": "2025-07-08T05:15:21Z",
      "title": "5 Israeli soldiers killed in northern Gaza and 18 Palestinians dead in Israeli strikes",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-08-2025-ec0e95f8988e8624d1d4e051116709f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/bac925d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F18%2Fc8a8d1291de0c139da2e4eff2e34%2F59bc416ceeac4ebba142c159761692a8"
    },
    {
      "author": null,
      "description": "Houthi rebels in Yemen have launched attacks on cargo ships in the Red Sea, raising fears of renewed conflict in the vital shipping corridor. On Tuesday, authorities reported an ongoing assault on the Liberian-flagged ship Eternity C, leaving two crew members injured and two missing. The attack followed a similar strike on Sunday, where the rebels sank another vessel, Magic Seas, forcing its crew to abandon ship. These incidents mark a return to Houthi aggression against shipping after a pause since March. The attacks threaten trade routes and could escalate tensions involving U.S. and Western forces in the region.",
      "publishedAt": "2025-07-08T08:36:55Z",
      "title": "Yemen rebels launch hourslong attack on ship in Red Sea",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-6dc55ee05a9d1e78621788aa0bc52168",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbee862/2147483647/strip/true/crop/2160x1215+0+113/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F29%2Fdb54ca2792baddf0596de42025cb%2Fd7565b207b9b4d4ab47edd6927d74dc9"
    },
    {
      "author": null,
      "description": "President Donald Trump says the U.S. will have to send more weapons to Ukraine, just days after ordering pause in critical weapons deliveries to Kyiv. The comments from Trump on Monday appear to be an abrupt change in posture. The Pentagon announced last week that it would hold back delivering to Ukraine some air defense missiles, precision-guided artillery and other weapons as part of its announced pause to some arms shipments. There are U.S. concerns that its own stockpiles have declined too much.",
      "publishedAt": "2025-07-07T10:40:04Z",
      "title": "Trump says the US to send more weapons to Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-attacks-c7a1bf1a28ecd2853c037f1864ef7edc",
      "urlToImage": "https://dims.apnews.com/dims4/default/c014b6e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F75%2F0c3805e108c34d313217bf8790c8%2F101b885abc8b49e287ead0db609c2bb3"
    },
    {
      "author": null,
      "description": "World shares are mostly higher, with financial markets shrugging off U.S. tariff pressures on its trading partners. Germany’s DAX rose 0.2% in early European trading. Britain’s FTSE 100 edged 0.2% higher while France’s CAC 40 shed 0.1%. In Asia, Japan’s Nikkei 225 added 0.3%. South Korea’s Kospi surged 1.8% and Hong Kong’s Hang Seng index climbed 1.1%. On Wall Street on Monday, stocks fell as the Trump administration stepped up pressure on trading partners to make deals before punishing tariffs imposed by the U.S. take effect. The S&P 500 lost 0.8%, the Dow Jones Industrial Average gave back 0.9% and the Nasdaq composite fell 0.9%.",
      "publishedAt": "2025-07-08T05:00:10Z",
      "title": "World shares mostly rise as markets shrug off US tariff pressures",
      "url": "https://apnews.com/article/asia-us-stocks-trump-tariff-pressures-22360b275c91795bcb71f43f8c77d577",
      "urlToImage": "https://dims.apnews.com/dims4/default/f60a878/2147483647/strip/true/crop/4209x2368+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F85%2F84c62d855f95bf1ac5455e905ad0%2Fcaed0f2a26d84253adc3e930854610d3"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu and U.S. President Donald Trump are meeting to discuss key Middle East issues. Both leaders have celebrated their joint actions, including strikes on Iran’s nuclear facilities, as successes. However, unresolved challenges remain, especially Israel’s 21-month war with Hamas in Gaza. Trump is pushing for a ceasefire, which could lead to a halt in fighting, aid for Gaza and the release of hostages. Hamas demands an Israeli withdrawal, while Netanyahu insists on Hamas disarming. Trump also aims to revive his regional peace vision, including expanding the Abraham Accords. Ending the Gaza war could be crucial to achieving these broader goals. The two leaders are meeting Monday over a private dinner in the White House.",
      "publishedAt": "2025-07-07T04:00:34Z",
      "title": "Gaza war looms over Trump-Netanyahu meeting",
      "url": "https://apnews.com/article/trump-iran-israel-netanyahu-gaza-ceasefire-30dba4ae46fbec44dbe977a547e612f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6838ff/2147483647/strip/true/crop/4835x2720+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fce%2Fa8616f8dd55e9521c05b1408c6c4%2Fba51121e8b6e4ec9953e511698efce89"
    },
    {
      "author": null,
      "description": "U.S. military troops and federal immigration officers have made a brief but mighty show of force at MacArthur Park in Los Angeles. It was unclear if any arrests were made Monday before the National Guard soldiers and federal immigration agents left but their appearance baffled local officials and shook up an area dubbed the “Ellis Island of the West Coast.\" The park is a community hub in a largely immigrant neighborhood. Bass and Gov. Gavin Newsom called it a political stunt and spectacle meant to intimidate the city’s immigrant communities. The Department of Homeland Security says it does not discuss its operations and declined to comment.",
      "publishedAt": "2025-07-08T00:35:28Z",
      "title": "Why did troops and federal agents go to LA's MacArthur Park",
      "url": "https://apnews.com/article/what-happened-ice-raid-la-macarthur-park-cc04479ed94ed68d11acf807d97914e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c39784/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F33%2F615a2e277009d2e0ca4b21f0f43e%2F70e4cd78b5eb430788186d33dc6294a5"
    },
    {
      "author": null,
      "description": "A Swiss village has cashed in on a pay-for-entry turnstile used by avid tourists who flock each day to a lakeside dock featured in the hit South Korean Netflix series “Crash Landing On You,” often to snap souvenir photos. Visitors now pay $6.30 to access the dock in Iseltwald, generating nearly $307,000 in 2024. Local officials say the funds cover village upkeep, including garbage disposal and restroom cleaning, rather than making residents wealthy. The influx of fans has strained the small village, which lacks the infrastructure to handle about 1,000 daily visitors.",
      "publishedAt": "2025-07-08T08:38:09Z",
      "title": "Swiss village cashes in as tourists pay to visit dock featured in hit K-drama 'Crash Landing On You'",
      "url": "https://apnews.com/article/iseltwald-netflix-series-kdrama-switzerland-ea813ea1011cc843023f6fba6d071600",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4476c0/2147483647/strip/true/crop/5505x3097+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F87%2Fcac477a91a7c2fc699330f6aec19%2F1254c5bf2f9949568ee252b217065a2b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}