{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Russia's deputy foreign minister says preparations have begun for a face-to-face meeting between U.S. President Donald Trump and Russia's Vladimir Putin. Sergei Ryabkov told Russian state media on Saturday that a possible summit could involve broad talks on global issues, including the war in Ukraine. But he said efforts to bring it about are at an early stage. Last week Russian and U.S. representatives agreed to start working toward ending the war and improving their diplomatic and economic ties, at high-level talks in Saudi Arabia that marked an extraordinary about-face in U.S. foreign policy under President Trump.",
      "publishedAt": "2025-02-22T12:36:47Z",
      "title": "Trump-Putin summit preparations are underway, Russia says",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-talks-89e19bc56677064f6f9a6d6e03de7362",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e95ea0/2147483647/strip/true/crop/4730x2661+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Ff3%2F72fe7b8ef362f1f0cb1220ae473f%2F9f0d8c65f7ba4fbaa7b4c6787cd1261f"
    },
    {
      "author": "Justin Spike",
      "description": "As Ukraine approached the three-year mark of Russia’s full-scale invasion, the country’s hoped-for path to a favorable and lasting peace has been upended in a matter of days by the administration of U.S. President Donald Trump. Kyiv had benefited from years of staunch support by its allies in the United States and Europe which had provided crucial military and financial support to help defend against Moscow’s grinding incursions. But when Trump held a lengthy phone call with Russian President Vladimir Putin last week — undoing years of U.S. policy to isolate the Russian leader — it was taken as a signal in Kyiv and other European capitals that their alliance to contain Moscow was fraying.",
      "publishedAt": "2025-02-22T05:21:54Z",
      "title": "After years of firm support, 10 days upended the US approach to Ukraine",
      "url": "https://apnews.com/article/ten-days-that-upended-us-support-for-ukraine-8930c01a15910a7ad8a7f7c7fac9ba3a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    },
    {
      "author": null,
      "description": "The United States has proposed a draft resolution for the U.N. General Assembly that stops far short of a competing European-backed statement demanding an immediate withdrawal of all of Moscow’s forces from Ukraine. Both are timed to the third anniversary of Russia’s invasion of Ukraine, which falls on Monday, when the General Assembly will vote on the nonbinding resolutions. It pits the United States against Europe as the strength of the transatlantic alliance has been called into question over the Trump administration’s extraordinary turnaround on Russia, opening negotiations with Moscow after years of isolation as the U.S. looks to broker a rapid end to the war. Russia’s U.N. ambassador said of the U.S. resolution, “It’s a good move.”",
      "publishedAt": "2025-02-22T01:30:38Z",
      "title": "US offers UN resolution on war in Ukraine that stops far short of competing European statement",
      "url": "https://apnews.com/article/russia-ukraine-war-united-nations-resolutions-5a8af28518c4a81d70613f1e19702ae8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4faf88a/2147483647/strip/true/crop/5287x2974+106+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F58%2F3812800357017c31e06401de5e60%2F78f59aad851447e99963b353cc226612"
    },
    {
      "author": "Aamer Madhani",
      "description": "The White House and Ukraine have made significant progress toward reaching an agreement that would provide the U.S. with access to Ukraine’s rare earth minerals and tighten the long-term relationship between Kyiv and Washington. That's according to a person familiar with the negotiations who was not authorized to comment publicly. The progress in talks comes after President Donald Trump and Ukraine President Volodymyr Zelenskyy traded sharp rhetoric this week about their differences over the matter. But the two sides made significant progress during a three-day visit to Ukraine this week by retired Lt. Gen. Keith Kellogg, Trump’s special envoy to Ukraine and Russia.",
      "publishedAt": "2025-02-22T03:37:27Z",
      "title": "White House and Ukraine nearing rare earths deal that would tighten relationship, AP source says",
      "url": "https://apnews.com/article/ukraine-rare-earths-minerals-russia-trump-36090d67358d93b8aa70240761634d4a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": null,
      "description": "Red Cross ambulances have arrived in Gaza’s southernmost city of Rafah in preparation for the handover of six Israeli hostages to be freed Saturday under the Israel-Hamas ceasefire deal. AP video showed the ambulances waiting among a crowd with a line of Hamas fighters nearby in Rafah, where two of the hostages are expected to be handed over. The other four are to be handed over in central Gaza.",
      "publishedAt": "2025-02-22T06:23:32Z",
      "title": "Family confirms second body released by militants was Shiri Bibas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-22-2025-364c7abeb679e910cb5acba234469574",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1bf97d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F43%2F476efdca70eadb16c08f1e79432d%2F465de4ee09d343a18485466b3b56195c"
    },
    {
      "author": "Josh Funk",
      "description": "A crash landing of a Delta Air Lines flight in Toronto has highlighted the potential dangers of flying with a young child on an adult's lap. The plane flipped over this week, which would have made holding onto a baby extremely difficult. Airline plane crashes are rare despite the recent rash of aviation disasters, but children could easily get hurt if they are on a parent's lap when a plane encounters turbulence. Experts agree it’s safer for children younger than 2 years old to have their own plane seats and ride in approved car seats when flying even if families have to pay for an extra ticket. Still, it isn't required.",
      "publishedAt": "2025-02-22T11:07:20Z",
      "title": "Everyone agrees kids are safer flying in their own seats, but no one requires it. Why?",
      "url": "https://apnews.com/article/toronto-delta-plane-flipped-lap-baby-safety-d4bf3ecada5972f129ba88511ba28dd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b0028d/2147483647/strip/true/crop/1596x898+0+83/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Ff4%2F0cc8bd0665bb00dec943770c35cb%2Fd4026317b092492daf33c74cced9e677"
    },
    {
      "author": "Dylan Lovan",
      "description": "Witnesses and authorities described a chaotic scene in which three people were shot and killed outside of a Kentucky driver’s license office, including one man shot multiple times by masked assailants. The Jefferson County Coroner’s Office identified the victims late Friday as ranging in age from 18 to 33 years old. Officers who responded around noon Friday found one man dead at the scene and two women wounded, who later died after being taken to a hospital, according to a statement from the Louisville Metro Police Department. The coroner’s statement said that the man died of multiple gunshot wounds at the scene, while the two women each died of a gunshot wound at a hospital.",
      "publishedAt": "2025-02-22T14:13:24Z",
      "title": "Chaotic scene unfolded as 3 were shot and killed outside Kentucky driver's license office",
      "url": "https://apnews.com/article/louisville-dmv-shooting-license-office-f84721795dc04031c3af63179dff540c",
      "urlToImage": "https://dims.apnews.com/dims4/default/53557d1/2147483647/strip/true/crop/4148x2333+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F94%2F0d725730f4fca649408734a5807a%2F62fa83f391d34f3abcad503e480ab5d5"
    },
    {
      "author": "Calvin Woodward",
      "description": "President Donald Trump is moving with light speed and brute force to reshape America at home and abroad. In his first month back in office, he's performed a pirouette in foreign policy as he pulls the U.S. back from historic alliances, reaches out to Russia and chokes foreign aid. At home, he's fired thousands of federal workers and mandated an about-face in the missions of department after department. How much of this sticks will largely depend on courts, which appear to be the only check on Trump's expansive use of executive power. Congress has so far been compliant as Trump pursues his ends by edict instead of legislation.",
      "publishedAt": "2025-02-22T13:49:33Z",
      "title": "Trump moves with light speed and brute force in shaking the core of what America has been",
      "url": "https://apnews.com/article/trump-reshaping-america-democracy-musk-executive-power-0e8b6724d45fcdb3e6f0cef05ae7b952",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b3fb7/2147483647/strip/true/crop/3024x1701+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F40%2Fc8566d5c48341b5fed2c6e2b1f35%2F287ed54c254b46eca9e61bb0fe1bdd48"
    },
    {
      "author": "Nicole Winfield, Silvia Stellacci",
      "description": "The Vatican is carrying on with its Holy Year celebrations without the pope. Pope Francis remains hospitalized with pneumonia and a complex respiratory infection. Doctors say it will keep him hospitalized for at least another week and regardless is still touch-and-go. In a brief early update Saturday, the Vatican said Francis slept well overnight. But doctors have warned that the main threat facing the 88-year-old Francis would be the onset of sepsis, a serious infection of the blood that can occur with pneumonia. As of Friday, there was no evidence of any sepsis, and Francis was responding to the various drugs he is taking.",
      "publishedAt": "2025-02-22T11:34:24Z",
      "title": "Sepsis a threat in pope's pneumonia battle as Vatican Holy Year celebrations march on without him",
      "url": "https://apnews.com/article/pope-francis-pneumonia-sepsis-vatican-respiratory-infection-bab5b9a141517171d4efc71fadafa0a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5775990/2147483647/strip/true/crop/3445x1938+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F6b%2Fe8a8c0c84a588615d96e4939864f%2Fd3d35ff587814047b6884cca820ff090"
    },
    {
      "author": "Jaimie Ding",
      "description": "When 11-year-old Ceiba Phillips returned to his Southern California neighborhood a month after the devastating Eaton fire, he couldn’t believe his eyes. The fire that tore through the community of Altadena on Jan. 7 left only a few houses standing among the rubble, leaving families dealing with the trauma and painful aftermath of one of the most destructive fires in California history. Kids are navigating the grief of losing everything that was familiar, while their parents are learning how to help them cope. Experts say re-establishing routine as quickly as possible after disaster is key to helping kids cope.",
      "publishedAt": "2025-02-22T05:09:03Z",
      "title": "LA wildfires: Parents help kids navigate grief as they return home",
      "url": "https://apnews.com/article/california-wildfires-children-recovery-grief-4a8c5c0e2fcc483d73c0e23d4922ce26",
      "urlToImage": "https://dims.apnews.com/dims4/default/18c4fff/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F33%2F58bee6cded6f74eec4d935e3c0f7%2F50d52d0f3083487aa201c7e25dc843f3"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}