{
  "articles": [
    {
      "author": null,
      "description": "The FBI says a glove containing DNA was found about 2 miles from Nancy Guthrie’s home and appears to match those worn by a masked person outside her front door in Tucson the night she vanished. The glove, found in a field near the side of the road, was sent off for DNA testing. The discovery was revealed days after investigators had released surveillance videos of the masked person outside Guthrie’s front door. Guthrie is the mother of “Today” show host Savannah Guthrie and was last seen at her Arizona home on Jan. 31.",
      "publishedAt": "2026-02-15T19:52:22Z",
      "title": "FBI: DNA recovered from glove found near Guthrie home",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-710d3acdef86d1c3935b94f58f763d72",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a2a4ae/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F4c%2Fc7a7d27bf013bbc768c23fed57c7%2Fd63fe040e41049319f17801f1a0aa4fd"
    },
    {
      "author": "Ben Finley",
      "description": "More than 1,000 immigration agents have left Minnesota’s Twin Cities area and hundreds more will depart in the days ahead as part of the Trump administration’s drawdown of its immigration enforcement surge. That word comes from White House border czar Tom Homan. He tells CBS' “Face the Nation” that a “small” security force will stay for a short period to protect remaining immigration agents and will respond “when our agents are out and they get surrounded by agitators and things got out of control.” He didn't define “small.” The Trump administration announced last week it was drawing down its immigration enforcement surge in Minneapolis and St. Paul.",
      "publishedAt": "2026-02-15T17:35:18Z",
      "title": "Trump's border czar says 'small' security force will remain in Minnesota",
      "url": "https://apnews.com/article/homan-immigration-agents-minnesota-enforcement-operation-drawdown-5a7940eb9b5100d46efc33a97f524da0",
      "urlToImage": "https://dims.apnews.com/dims4/default/725cae7/2147483647/strip/true/crop/5188x3457+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fbb%2F42940b607106d659d721aa04de9e%2F20573de1323e4dfa825488522ef3eac8"
    },
    {
      "author": "Aamer Madhani",
      "description": "Lawmakers and the White House are offering no signs of compromise in their battle over oversight of federal immigration officers. That impasse has led to a pause in funding for the Department of Homeland Security. A partial government shutdown began Saturday after congressional Democrats and President Donald Trump’s team failed to reach a deal on legislation to fund the department through September. Democrats are demanding changes to how immigration operations are conducted after the fatal shootings of two U.S. citizens by federal officers in Minneapolis last month. Congress on recess until Feb. 23, and both sides appear dug into their positions.",
      "publishedAt": "2026-02-15T18:49:03Z",
      "title": "No clear path to ending the partial government shutdown",
      "url": "https://apnews.com/article/government-shutdown-homeland-security-democrats-ice-bd2b84b6f38f1c916637b205854a3c83",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fe5376/2147483647/strip/true/crop/3725x2482+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fed%2F35f6073fe9bf911382b67745e398%2Fb5735dd5817a4aa4829f08af3cad1527"
    },
    {
      "author": "Ben Finley",
      "description": "The U.S. military says it's boarded another sanctioned oil tanker in the Indian Ocean. The Pentagon said in a statement Sunday that U.S. forces boarded the Veronica III after tracking it from the Caribbean Sea. Venezuela had faced U.S. sanctions on its oil for several years and relied on a shadow fleet of tankers. President Donald Trump ordered a quarantine of sanctioned tankers in December to pressure then-President Nicolás Maduro before Maduro was captured in a U.S. military operation. The Defense Department says U.S. forces boarded the Veronica III overnight. The Pentagon’s social media post doesn't say whether the ship was formally seized.",
      "publishedAt": "2026-02-15T13:56:40Z",
      "title": "US military boards another oil tanker in Indian Ocean",
      "url": "https://apnews.com/article/venezuela-oil-tanker-boarded-sanctions-pentagon-quarantine-682ddfc053bbd54ba3c477929c5b13f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/072efe5/2147483647/strip/true/crop/4879x3251+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fcf%2F02e9e41a9c1be97b8a06ccc96ea7%2F6310313575204abc9c201340230aba6b"
    },
    {
      "author": null,
      "description": "Iranian state media reports that Iran’s top diplomat is traveling to Geneva where the second round of nuclear negotiations with the U.S. will take place. Foreign Minister Abbas Araghchi and his delegation left for the Swiss city on Sunday after the first round of indirect talks took place in Oman last week. Oman will mediate the talks in Geneva, the IRNA state-run news agency reported on its Telegram channel. Araghchi is also expected to meet with his Swiss and Omani counterparts, as well as the director general of the U.N.’s atomic watchdog, the International Atomic Energy Agency.",
      "publishedAt": "2026-02-15T16:02:24Z",
      "title": "Iran's top diplomat heads to Geneva for crucial nuclear talks with US",
      "url": "https://apnews.com/article/iran-us-indirect-talks-geneva-report-02f5495590387700ab5fbbb593aa6a2b",
      "urlToImage": "https://dims.apnews.com/dims4/default/81de47f/2147483647/strip/true/crop/8488x5656+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F37%2F1a36192aebe16fa3e70a80b0d9b2%2F37a95c0c0c8b4ff7937a35f4bda38d22"
    },
    {
      "author": "Emma Burrows, Geir Moulson",
      "description": "A top European Union official has rejected the notion that Europe faces “civilizational erasure,” pushing back at criticism of the continent by the Trump administration. EU foreign policy chief Kaja Kallas addressed the Munich Security Conference on Sunday, a day after U.S. Secretary of State Marco Rubio offered a somewhat reassuring message to European allies. He struck a less aggressive tone than Vice President JD Vance last year but maintained a firm tone on Washington’s intent to reshape the trans-Atlantic alliance and push its policy priorities.",
      "publishedAt": "2026-02-15T11:03:27Z",
      "title": "EU official dismisses 'civilizational erasure' claims at Munich conference",
      "url": "https://apnews.com/article/munich-conference-europe-trump-rubio-kallas-0efc0b3d464f118e3e5d6748113c9271",
      "urlToImage": "https://dims.apnews.com/dims4/default/f50ae26/2147483647/strip/true/crop/7590x5057+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F29%2Fcafafbeb47d9244712f9278ae11d%2Ff1f09a4064544bd18caeeea8f35107d8"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump says that members of his newly created Board of Peace have pledged $5 billion toward rebuilding Gaza and will commit thousands of personnel to international stabilization and police forces for the territory. Trump said Sunday that the pledges will be formally announced when members of the board gather for their first meeting Thursday in Washington. Trump isn't detailing which board member nations are making the pledges for reconstruction or would contribute personnel to the stabilization force. But Indonesia’s military says up to 8,000 of its troops are expected to be ready by the end of June for a potential deployment to Gaza.",
      "publishedAt": "2026-02-15T16:45:49Z",
      "title": "Trump says his Board of Peace has $5 billion in Gaza reconstruction pledges",
      "url": "https://apnews.com/article/trump-gaza-board-peace-reconstruction-stabilization-685251b3e8f24cf8779d6fe3f5f2ca04",
      "urlToImage": "https://dims.apnews.com/dims4/default/67969ed/2147483647/strip/true/crop/5908x3937+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F6f%2F813c1c65046089042a9c32c61f53%2Fceae1da4453b4b6f82716382a7dfc617"
    },
    {
      "author": null,
      "description": "A strong storm system is bringing tornado watches and widespread damage across the Southeast just as the Northeast starts to warm up. On Sunday, the National Weather Service reports some of the worst damage near Lake Charles, Louisiana. High winds overturned a horse trailer and a Mardi Gras float. They also damaged an airport jet bridge and knocked an awning into power lines. The weather service also reports snapped and toppled power poles near Jena, Cheneyville, and Donaldsonville. No deaths or serious injuries are being reported. Forecasters have tornado watches up for south Georgia and the Florida Panhandle.",
      "publishedAt": "2026-02-15T17:02:44Z",
      "title": "Tornado watch issued as storm system hits Mississippi and Louisiana",
      "url": "https://apnews.com/article/severe-weather-thunderstorms-tornado-cold-ed98b3ad57a2a59b0c61f4fc98e2b4d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/310393a/2147483647/strip/true/crop/3946x2629+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2Fac%2F00e18b02c3a6bad622bef99706c6%2F7f276ab72c9a4529aed0461d38e41d61"
    },
    {
      "author": "Laura Ungar",
      "description": "As the definition of autism has widened, there’s been a growing push to separate profound autism into its own diagnosis. Proponents seek to ensure that autistic people who need lifelong care get the support and services they need. Judith Ursitti, president of the Profound Autism Alliance, said people in this category now lack appropriate treatments, support and enough providers trained to handle their level of care. And the vast majority of clinical research doesn’t include them. But some in the autism community worry that creating a separate diagnosis of profound autism would reduce attention on the broader spectrum and the individual needs of everyone on it.",
      "publishedAt": "2026-02-15T12:37:39Z",
      "title": "Should people with autism and very high needs have a separate diagnosis?",
      "url": "https://apnews.com/article/profound-autism-asd-trump-rfk-jr-dd46d3c79dd4b5afc4d23943a358e844",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fc6f20/2147483647/strip/true/crop/4240x2825+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F86%2F32f1874f3f14b60c03c66e26afae%2Fa10e0c67a72240ea9bba406775da1079"
    },
    {
      "author": "James Ellingworth",
      "description": "Federica Brignone and Johannes Hoesflot Klaebo have glided into history at the Winter Olympics in very different ways. Host nation Italy was delighted as Brignone’s sensational comeback continued with a second gold medal of the Olympics, still in pain after a badly broken leg last year. Klaebo has the most gold medals of any Winter Olympian in history with nine after taking gold with Norway’s cross-country men’s relay team. Later Sunday, Dutch speedskater Jutta Leerdam and Erin Jackson of the United States compete for the women’s 500-meter gold.",
      "publishedAt": "2026-02-15T16:34:47Z",
      "title": "Winter Olympics Day 9 recap: Brignone's double gold after broken leg, Klaebo sets a medal record",
      "url": "https://apnews.com/article/milan-cortina-winter-olympics-bf4dd32834eddafd36ce524654045731",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c0ba4b/2147483647/strip/true/crop/3091x2060+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fea%2F68402482cfb56d904625ae9074f2%2Fe83b78eae3764f0083929c300b74f282"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}