{
  "articles": [
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam",
      "description": "President Donald Trump is heading to Capitol Hill to seal the deal on his “big, beautiful bill.” Using his power of political persuasion, Trump will try to unify divided House Republicans on the multitrillion-dollar package that is at risk of collapsing ahead of planned votes this week. The president has implored GOP holdouts to “STOP TALKING, AND GET IT DONE.” But negotiations are slogging along. It’s not at all clear the package, with its sweeping tax breaks and cuts to Medicaid, food stamps and green energy programs, has the support needed. With all Democrats opposed, the Republicans can handle only a few defections from their slim House majority.",
      "publishedAt": "2025-05-20T04:08:38Z",
      "title": "Trump heads to Capitol Hill to push 'big, beautiful' bill",
      "url": "https://apnews.com/article/congress-republicans-tax-cuts-trump-johnson-ebc172c76ac51434e9bfa28d867bd9a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/d216e72/2147483647/strip/true/crop/4631x2605+0+240/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fe6%2Fbebe00b9b250652d29ff92b4a229%2F88f087a2871c4a05b6e15bc48b6d5e2f"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Israeli strikes overnight and into Tuesday have killed at least 60 people across the Gaza Strip. That's according to Palestinian health officials. Israel has launched another major offensive in the territory in recent days, saying it aims to return dozens of hostages held by Hamas and destroy the militant group. The Gaza Health Ministry says two strikes in northern Gaza hit a family home and a school-turned-shelter, killing at least 22 people, more than half of them women and children. There was no immediate comment from the Israeli military,",
      "publishedAt": "2025-05-20T06:14:06Z",
      "title": "Israeli strikes across Gaza have killed at least 60 people",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-05-20-2025-402954f7424825ef73ad57f17a701fac",
      "urlToImage": "https://dims.apnews.com/dims4/default/f816b91/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F5e%2F0a1b0e8efec26cd9e4781ed90595%2F6d8a47706f524cb3928c1f30e36cbe92"
    },
    {
      "author": null,
      "description": "Iran’s supreme leader has pushed back against U.S. criticism of the country’s nuclear program. Ayatollah Ali Khamenei said Tuesday that Tehran won’t seek permission from anyone to enrich uranium and called American statements “nonsense.” Khamenei made the comments during a memorial for the late President Ebrahim Raisi who died in a helicopter crash last year. Khamenei said that “no one in Iran is waiting for their permission\" and that “the Islamic Republic has its own policies and direction.” His comments reflect Tehran’s growing frustration with the stalled nuclear discussions as well as the broader tensions that have defined U.S.-Iran relations in recent years.",
      "publishedAt": "2025-05-20T10:22:36Z",
      "title": "Iran’s supreme leader rejects US stance on uranium enrichment",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-uranium-enrichment-ayatollah-bad3bcd548ea6e06872fd15287062718",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d883b6/2147483647/strip/true/crop/2550x1434+0+118/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fd5%2Ff6a4584978aa290cb2d2d105a53d%2F6c4ce2af2a6844f0b43d8ef87b346dee"
    },
    {
      "author": "Mike Catalini, Alanna Durkin Richer, Eric Tucker",
      "description": "Federal prosecutors allege Democratic Rep. LaMonica McIver of New Jersey pushed and grabbed officers while attempting to block the arrest of the Newark mayor outside an immigration detention facility. In an eight-page complaint unsealed on Tuesday interim U.S. Attorney Alina Habba’s office says McIver was protesting the removal of Newark Mayor Ras Baraka from a congressional tour of the Delaney Hall detention center in Newark on May 9. McIver has denied wrongdoing and says prosecutors are distorting her actions.",
      "publishedAt": "2025-05-20T15:04:17Z",
      "title": "Prosecutor charges Democratic Rep. McIver pushed, grabbed agents while trying to stop mayor's arrest",
      "url": "https://apnews.com/article/new-jersey-mciver-habba-baraka-ice-facility-f4c995ea685e9085f585be345649f57a",
      "urlToImage": "https://dims.apnews.com/dims4/default/28b0d87/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F29%2Fcc56e4a86b280fcc1ddfc7f972df%2F0332e1455d774f0a8696c98ab4093169"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A former personal assistant to Sean “Diddy” Combs has given a glimpse into the hip-hop promoter’s world when he worked for him nearly two decades ago. David James testified Tuesday at Combs' sex trafficking trial that when he worked for Combs from 2007 to 2009, Combs took drugs daily, including Percocet and ecstasy. The Bad Boy Records founder has pleaded not guilty to all charges. James testified that he quit the job after he grew worried about his own safety. James’ testimony came in the second week of a trial in Manhattan federal court that is scheduled to last up to two months.",
      "publishedAt": "2025-05-20T15:53:12Z",
      "title": "Sean 'Diddy' Combs' personal assistant tells jury about guns, drugs and lie detector tests",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-1aee36aa9513611fc4d8c7adc2435137",
      "urlToImage": "https://dims.apnews.com/dims4/default/f2b0311/2147483647/strip/true/crop/4080x2295+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F8d%2Fdeea2f1a26204397f2f6e788566a%2F2361d4fa92484401add343a3ba55e7d2"
    },
    {
      "author": "Illia Novikov, Yehor Konovalov",
      "description": "U.S. President Donald Trump’s phone calls with the leaders of Russia and Ukraine have deepened expectations that progress might soon be made on ending those countries’ more than three-year war. At the same time, frustration at the slow pace of negotiations and the absence of any significant breakthrough have kept hopes low. Ukrainian President Volodymyr Zelenskyy said Tuesday that “it is obvious that Russia is trying to buy time to continue the war.” Trump said his personal intervention was needed to push peace efforts forward, and on Monday he held separate talks over the phone with Zelenskyy and Russian President Vladimir Putin. Trump announced that Russia and Ukraine will “immediately” begin ceasefire negotiations, though no details were provided.",
      "publishedAt": "2025-05-20T10:18:09Z",
      "title": "Slow progress and no major breakthroughs dampen hopes for Russia-Ukraine peace deal",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-trump-83979d718b73cb9bd655dd9aaa915573",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6a07fe/2147483647/strip/true/crop/6071x3415+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F22%2F6001ef4b83560b5e95ae7aac2abf%2Ffc31216809c540e785bf75039e303800"
    },
    {
      "author": "Tara Copp",
      "description": "President Donald Trump is expected to announce the concept he wants for his future Golden Dome missile defense program. It would cost taxpayers tens of billions of dollars and take years to make a reality. Golden Dome for the first time will put U.S. weapons in space, which could be fired to destroy an incoming missile during flight. Pentagon planners have been developing options for the system, which a U.S. official described as medium, high and “extra high” choices based on their cost. The official says the administration picked the “high” version, with an initial cost ranging between $30 billion and $100 billion.",
      "publishedAt": "2025-05-20T15:54:58Z",
      "title": "Trump expected to announce 'Golden Dome' space missile defenses",
      "url": "https://apnews.com/article/golden-dome-missile-defense-trump-space-e74d637feac06edcfde79214d8acf179",
      "urlToImage": "https://dims.apnews.com/dims4/default/14bfc37/2147483647/strip/true/crop/6076x3418+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F13%2Ff9c43422a973f34df3367a4e2139%2Fb93f48f886a14080b35d91c50d122275"
    },
    {
      "author": "Jack Brook, Sara Cline",
      "description": "Authorities have arrested an Orleans Parish Sheriff's Office maintenance worker in connection with the escape of 10 jail inmates. The office said in a statement Tuesday that Sterling Williams admitted he turned the water off in a cell before the men slipped away through a hole behind the toilet. Williams told authorities an inmate threatened to stab him if he didn't help. Orleans Parish Sheriff Susan Hutson last week told reporters her agency had suspended three employees pending an investigation into the escape early Friday. Four of the fugitives have been apprehended and six remain at large.",
      "publishedAt": "2025-05-20T14:08:34Z",
      "title": "A New Orleans jail worker is charged after admitting he helped inmates to escape",
      "url": "https://apnews.com/article/new-orleans-jail-escape-inmates-arrest-45f2a4be028254cc2587f50deb9af44d",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c1bd7e/2147483647/strip/true/crop/5000x2813+0+9/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fb1%2Fbb5dde0dec4f7365b308d01246eb%2F88b2efc7a6a34e2ab75c46792f438fa6"
    },
    {
      "author": "Matthew Perrone, Lauran Neergaard",
      "description": "Federal health officials will no longer routinely approve annual COVID-19 shots for younger adults and children who are healthy. Companies that want to market their vaccines to those Americans will need to conduct large, new studies, the Food and Drug Administration said Tuesday. It’s a major shift in FDA’s approach to updating vaccines that protect against the virus. It comes as Health Secretary Robert F. Kennedy and his appointees continue to scrutinize the use of vaccines for a number of diseases. The FDA said Tuesday annual COVID shots will still be regularly approved for seniors and younger people with increased health risks from the virus.",
      "publishedAt": "2025-05-20T15:00:56Z",
      "title": "Trump officials set new requirements for COVID vaccines in healthy adults and children",
      "url": "https://apnews.com/article/vaccines-fda-kennedy-covid-shots-rfk-trump-bb4de15b6ff955d6cd0b406aaec3cdc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d97966d/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F1a%2F7b5f51f113c5c9d2e69e781448b6%2Ffe4ecd650ea6441c9967e9bc3680cc28"
    },
    {
      "author": "Chris Megerian, Thomas Beaumont, Ryan J. Foley",
      "description": "Elon Musk, the richest person in the world and a key financial supporter of President Donald Trump, says he’ll be spending less on political campaigns. He disclosed his decision via videoconference during a Bloomberg forum in Doha, Qatar, on Tuesday. It could be a setback for Republicans before next year’s midterm elections. His decision also speaks to his disenchantment with politics after his tumultuous experience with the Department of Government Efficiency, which has fallen far short of its goals for reducing federal spending. Musk said he's \"going to do a lot less in the future,” and added, “I think I’ve done enough.”",
      "publishedAt": "2025-05-20T14:40:23Z",
      "title": "Elon Musk says he will cut back on political spending",
      "url": "https://apnews.com/article/elon-musk-campaign-donations-ff47d9b4cf02b2e63633edf37823c8ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/862c2e1/2147483647/strip/true/crop/4509x2536+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F5e%2Fe405405c4aafb5e794c495c1aa11%2F789bca21d3fd41829945f8ab34afaaed"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}