{
  "articles": [
    {
      "author": "MELINA WALLING and JOSHUA A. BICKEL",
      "description": "EAST GARAFRAXA, Ontario (AP) — Julie Thurgood-Burnett had no idea that her COVID-19 lockdown whim of starting a lavender patch on her husband's family farm outside Toronto would turn into a small business.",
      "publishedAt": "2024-08-27T13:35:25Z",
      "title": "Complex supply chains and climate change make \"clean beauty\" near impossible, but some keep trying",
      "url": "https://apnews.com/c2f15deede243c28c973a9791d532905",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a99b6889ea2486c9e30b70fd43c9af9/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and NASSER NASSER",
      "description": "AL-FARAA REFUGEE CAMP, West Bank (AP) — Israeli forces launched a large operation in the occupied West Bank overnight and into Wednesday, killing at least 10 Hamas militants, carrying out arrests and sealing off the volatile city of Jenin.",
      "publishedAt": "2024-08-28T06:03:07Z",
      "title": "Israeli forces launch a big operation in the West Bank and kill at least 10 militants",
      "url": "https://apnews.com/41d98ed3cda2ba4a783913b06fbdc7d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90a2d799a59243efa018898127f12657/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "KHIRBET KARKUR, Israel (AP) — An Israeli hostage rescued from Gaza returned to a hero’s welcome tinged with a bitter reality: Much of the small village he calls home – Khirbet Karkur -- is targeted for demolition.",
      "publishedAt": "2024-08-28T19:47:49Z",
      "title": "An Israeli freed from Gaza returns to a Bedouin village targeted for demolition",
      "url": "https://apnews.com/7f67ea47c7fb96a966dd8e45a2556a15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31c0e3863f644b358a0f00abc8e0de7a/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The gunman in the assassination attempt on former President Donald Trump searched online for events of both Trump and President Joe Biden, looked up information about explosives over the last five years and eyed the Pennsylvania campaign rally where he opened fire last month as a “target of opportunity,” a senior FBI official said Wednesday.",
      "publishedAt": "2024-08-28T17:46:59Z",
      "title": "Gunman in Trump assassination attempt saw rally as 'target of opportunity,' FBI official says",
      "url": "https://apnews.com/919bc3a7bba02f6e340fed321b20dfdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32954b9652824e92be3df95815165df8/3000.jpeg"
    },
    {
      "author": "BARBARA SURK and ANGELA CHARLTON",
      "description": "PARIS (AP) — French authorities handed preliminary charges to Telegram CEO Pavel Durov on Wednesday for allowing alleged criminal activity on his messaging app, and barred him from leaving France pending further investigation.",
      "publishedAt": "2024-08-28T09:29:38Z",
      "title": "French authorities issue preliminary charges against Telegram messaging app CEO",
      "url": "https://apnews.com/6e213d227458f330ed16e7fe221a696c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecafb659b7f84f0fabd30e82e921dab1/1894.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith is pressing forward with his 2020 election interference case against Donald Trump, with a new indictment that aims to salvage the prosecution after the Supreme Court slammed the door on the possibility of a trial before the November election.",
      "publishedAt": "2024-08-28T17:07:59Z",
      "title": "What a new indictment means for Donald Trump's federal 2020 election interference case",
      "url": "https://apnews.com/b2a490d6c4faa2ee188f8b6749cfd0c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bb6956d37b64f10be63ef5a90446865/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "HINESVILLE, Ga. (AP) — Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, dropped in on a high school band practice Wednesday as part of a two-day bus tour through southeast Georgia campaigning for the critical battleground state, as the students performed their school fight song for the Democratic ticket.",
      "publishedAt": "2024-08-28T15:08:49Z",
      "title": "Harris and Walz travel by bus in southeast Georgia to reach out to voters in GOP strongholds",
      "url": "https://apnews.com/ca2f9e33dba69763503c1dcec7641e31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67c22bdc66154616b9ac6e66b4744d72/1920.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD",
      "description": "PHOENIX (AP) — Michael Lacey, a founder of the lucrative classified site Backpage.com, was sentenced Wednesday to five years in prison and fined $3 million for a single money laundering count in a sprawling case involving allegations of a yearslong scheme to promote and profit from prostitution through classified ads.",
      "publishedAt": "2024-08-28T21:44:09Z",
      "title": "Backpage.com founder Michael Lacey sentenced to 5 years in prison, fined $3M for money laundering",
      "url": "https://apnews.com/fdc90e3293eec40a2f63d2e0d828ff5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3e0996513754a15820689071b37a113/3000.jpeg"
    },
    {
      "author": "KEN RITTER",
      "description": "LAS VEGAS (AP) — A Democratic former Las Vegas-area politician is guilty of murder and has been sentenced to life in prison with parole eligibility at 20 years for the killing of an investigative journalist who wrote articles critical of his conduct in elected office, a jury in Nevada ruled Wednesday.",
      "publishedAt": "2024-08-28T16:12:33Z",
      "title": "Ex-politician convicted in 2022 killing of Las Vegas reporter sentenced to 20 years to life",
      "url": "https://apnews.com/393c5588c1babe5b111ca905363f6a45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10f62d783d0349aca401f170f15d5e52/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "SpaceX launches are on hold after a booster rocket toppled over in flames while landing Wednesday. The Federal Aviation Administration grounded the company's Falcon 9 rockets and ordered an investigation following the predawn accident off the Florida coast.",
      "publishedAt": "2024-08-28T20:34:10Z",
      "title": "FAA grounds SpaceX after rocket falls over in flames at landing",
      "url": "https://apnews.com/db396897fbb90d00ef18be886b3b1ce0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48290d3d807b4b9fa9b7223af4770889/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}