{
  "articles": [
    {
      "author": "Lea Skene, Lindsay Whitehurst",
      "description": "A federal judge has largely blocked sweeping executive orders from President Donald Trump that sought to end government support for programs promoting diversity, equity and inclusion. Judge Adam Abelson in Baltimore found they likely violate free-speech rights and granted an injunction blocking them as a lawsuit plays out. Trump signed an order his first day in office directing federal agencies to terminate all “equity-related” grants or contracts. The city of Baltimore and higher education groups sued, arguing the executive orders are unconstitutional and an overreach of presidential authority. The Trump administration has argued that the president was targeting only DEI programs that violate federal civil rights laws.",
      "publishedAt": "2025-02-22T00:22:03Z",
      "title": "Judge largely blocks Trump’s executive orders ending federal support for DEI programs",
      "url": "https://apnews.com/article/dei-diversity-equity-inclusion-trump-federal-judge-5b04fbc742bd32adf98ca108b4b12b37",
      "urlToImage": "https://dims.apnews.com/dims4/default/2358533/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fc9%2F34743f2919558f5d65f8684810e0%2Fc171b7026f2342f6974000840b2a618c"
    },
    {
      "author": "David Bauder",
      "description": "The Associated Press is suing three Trump administration officials over access to presidential events. It's citing freedom of speech in asking a federal judge to stop the 10-day blocking of its journalists. The lawsuit was filed in U.S. District Court in Washington, D.C. The AP says its case is about an unconstitutional effort by the White House to control speech — in this case refusing to change its style from the Gulf of Mexico to the “Gulf of America,” as President Donald Trump did last month with an executive order.",
      "publishedAt": "2025-02-21T21:22:22Z",
      "title": "AP sues 3 Trump administration officials, citing freedom of speech",
      "url": "https://apnews.com/article/ap-lawsuit-trump-administration-officials-0352075501b779b8b187667f3427e0e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff100e7/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F55%2F676e4909e174619cf5dda330e9d9%2Fab43d87a07d24d6fb726565b1eea2cf1"
    },
    {
      "author": "Tara Copp, Lolita C. Baldor",
      "description": "President Donald Trump has abruptly fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff. The move Friday sidelines a history-making fighter pilot and respected officer as part of a targeted campaign to rid the military of leaders who support diversity and equity in the ranks. Brown is only the second Black general to serve as chairman. His 16 months in the job had been consumed with the war in Ukraine and the expanded conflict in the Middle East. But Brown’s future was called into question during the Senate Armed Services Committee’s confirmation hearing for Defense Secretary Pete Hegseth.",
      "publishedAt": "2025-02-22T00:40:47Z",
      "title": "Trump fires chairman of the Joint Chiefs of Staff and two other military officers",
      "url": "https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf",
      "urlToImage": "https://dims.apnews.com/dims4/default/8691eba/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F03%2F146b5adf1793acabc1bf2b6b425f%2F31247abc2b8b44d0bc34bbf9c0f2ad32"
    },
    {
      "author": "Michelle L. Price, Patrick Whittle",
      "description": "President Donald Trump has sparred with Maine’s governor during a meeting of governors at the White House. Democratic Gov. Janet Mills told the Republican president, “We’ll see you in court,” over his push to deny federal funding to the state over allowing transgender athletes to compete in girls' and women's sports. Trump told the governor he looked forward to it, and predicted the end of her political career for opposing his order. Their exchange Friday came after Mills and Trump traded statements over the past 24 hours over his push to bar transgender athletes and evolved into an unusual breach of the typically courteous interactions that public officials, even of opposing parties, have historically shared at the White House.",
      "publishedAt": "2025-02-21T19:37:21Z",
      "title": "Trump spars with Maine Gov. Janet Mills at the White House over transgender athletes",
      "url": "https://apnews.com/article/trump-janet-mills-governors-transgender-athletes-7cc3a7a6f29748d4b95eaf743b023926",
      "urlToImage": "https://dims.apnews.com/dims4/default/48a520a/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F44%2F1d79df65fa290167c219f7320fea%2Fd091064b4e0a4a58888215e42c3a78e4"
    },
    {
      "author": "The Associated Press",
      "description": "Hamas has released the names of six living Israeli hostages who the militants plan to release from Gaza this weekend under the terms of the ceasefire deal. The Hamas-linked Palestinian prisoners media office said over 600 Palestinians are also to be freed from Israeli prisons on Saturday in exchange for the hostages. The announcements Friday are a sign the fragile ceasefire deal remains on track. That's despite the tensions following Israeli allegations overnight that hostage Shiri Bibas’ body was not returned to Israel as promised by Hamas. The militant group insists it is sticking to the truce deal and “has no interest in withholding any bodies in its possession.”",
      "publishedAt": "2025-02-21T07:26:06Z",
      "title": "Middle East latest: Hamas names 6 living hostages to be freed on Saturday",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-ceasefire-news-02-21-2025-f067e34268e5011e5874fa8398b5f0c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/acd3cdf/2147483647/strip/true/crop/5298x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fdb%2Fba46c7c1dddc3be2a1b61be7f821%2Fa22913b56c9c4da38fc4168e61edc766"
    },
    {
      "author": "Illia Novikov",
      "description": "President Donald Trump’s envoy to Ukraine and Russia says he's held “extensive and positive discussions” with Ukraine’s President Volodymyr Zelenskyy about the three-year war. He praised the Ukrainian leader as an “embattled and courageous leader of a nation at war.” Retired U.S. Lt. Gen. Keith Kellogg — who traveled to Kyiv on Wednesday and whose planned news conference with Zelenskyy on Thursday was changed at the last minute to a simple photo opportunity — struck a positive tone Friday after saying it was “a long and intense day” of talks with Ukraine’s senior leadership. His comments marked a departure from rebukes of Zelenskyy by Trump and other senior U.S. officials that appeared to reflect an abrupt deterioration of relations.",
      "publishedAt": "2025-02-21T15:17:20Z",
      "title": "US envoy praises Zelenskyy after Trump's censure of the Ukrainian leader",
      "url": "https://apnews.com/article/russia-ukraine-zelenskyy-trump-0bc41d62c4fdfa00b4358f9043ee9991",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": "Meg Kinnard",
      "description": "Thousands of federal government employees have been shown the door in the first month of President Donald Trump’s administration. There’s no official figure available of the total firings or layoffs, but The Associated Press has tallied how agencies across the government are being affected, based on AP reporting and statements from lawmakers and employee unions. The job-cutting is affecting more than just the national capital region, which is home to about 20% of the 2.4 million members of the civilian federal workforce. That workforce doesn't include military personnel and postal workers. More than 80% of that civilian workforce lives outside the Washington area.",
      "publishedAt": "2025-02-19T14:05:45Z",
      "title": "A comprehensive look at DOGE's firings and layoffs so far",
      "url": "https://apnews.com/article/doge-firings-layoffs-federal-government-workers-musk-d33cdd7872d64d2bdd8fe70c28652654",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc4c334/2147483647/strip/true/crop/5716x3215+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F7c%2Fc74b16d9797ab2de49c83372a787%2Fa4c8677ab9994303bd8b315883e0f752"
    },
    {
      "author": "Areej Hazboun",
      "description": "Israeli Prime Minister Benjamin Netanyahu has vowed revenge for what he described as a “cruel and malicious violation” of the ceasefire agreement with Hamas. His remarks followed the release of a body that Israeli authorities found was not that of an Israeli mother of two young boys, as the Palestinian militants had promised. Hamas said it would conduct a review of the information regarding the body. The group suggested a possible mix-up of remains might have occurred due to Israeli bombing of the area where the Israeli hostages were being held. The incident raised doubts about the future of the fragile ceasefire.",
      "publishedAt": "2025-02-21T09:40:25Z",
      "title": "Netanyahu decries release of wrong body as a ceasefire violation. Hamas pledges to investigate",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-21-2025-e8f2f233b4c07a23f06040a808081642",
      "urlToImage": "https://dims.apnews.com/dims4/default/62c641f/2147483647/strip/true/crop/5457x3070+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F0a%2F540657b6f11d42903e28b9fac0d9%2F4c92992dc9e24aa08582a72774757573"
    },
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "Pope Francis’ medical team says the pontiff's condition isn’t life-threatening. But they said Friday that Francis isn't out of danger. The 88-year-old pontiff marked his first week in a hospital with pneumonia on top of chronic bronchitis. Francis’ doctors delivered their first in-person update on the pope's condition. They said that he would remain hospitalized at least all of next week. The pope is receiving occasional supplements of oxygen and is responding to strengthened drug therapy for pneumonia. Francis was admitted to Rome’s Gemellli hospital on Feb. 14 after his bronchitis worsened. Doctors have diagnosed pneumonia in both lungs and a complex infection.",
      "publishedAt": "2025-02-21T08:00:50Z",
      "title": "Pope Francis isn't out of danger but his condition isn't life-threatening, medical team says",
      "url": "https://apnews.com/article/pope-francis-pneumonia-hospital-b211a400c4cedc1f419d932447cfc189",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7c2a74/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2Faf%2F1de410f58a43c4905f8bb64614a5%2Feac43fab9ad34999a53396705b57e56c"
    },
    {
      "author": "Michael R. Blood",
      "description": "Six weeks after devastating wildfires, Los Angeles Mayor Karen Bass ousted the city’s fire chief amid a public rift over preparations for the fires and finger-pointing between the chief and City Hall. Bass says in a statement Friday that she is removing Chief Kristin Crowley immediately. Bass says 1,000 firefighters could have been on duty the morning the fires broke out but “were instead sent home on Chief Crowley’s watch.” Bass also says Crowley bucked doing a report requested by the city’s Fire Commission.",
      "publishedAt": "2025-02-21T19:38:44Z",
      "title": "LA mayor dismisses fire chief over response to most destructive wildfire in city history",
      "url": "https://apnews.com/article/california-wildfires-fire-chief-146e4421e4bac52dadca6164040eff39",
      "urlToImage": "https://dims.apnews.com/dims4/default/c30ab15/2147483647/strip/true/crop/8209x4618+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F33%2Ff45462d4444d66a065a31e117564%2F52ca21e1d9494d428cef177e675006ff"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}