{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump plans to speak at Fort Bragg to celebrate the 250th anniversary of the U.S. Army. The Republican president's trip to the North Carolina base comes as he faces criticism over deploying the National Guard and now U.S. Marines in an attempt to quell immigration protests in Los Angeles. Defense Secretary Pete Hegseth and Army Secretary Dan Driscoll will also be at Tuesday’s event, along with service members, veterans and their families. Trump has promoted the Army’s anniversary as a reason to hold a military parade in Washington, D.C., on Saturday, which is also his 79th birthday.",
      "publishedAt": "2025-06-10T04:02:45Z",
      "title": "Trump visits Fort Bragg as he sends military to Los Angeles protests",
      "url": "https://apnews.com/article/donald-trump-fort-bragg-6df36485dec1df2350d5b7be0882a703",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9812f6/2147483647/strip/true/crop/5576x3137+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Fb7%2Fbc975010af41e4511bd3c2d38fd6%2Fbf2e7bdee8b046e7a7f6af05667da6ed"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth is expected to field sharp questions from members of Congress about his tumultuous start as Pentagon chief in a series of hearings beginning Tuesday. He's likely to be asked about his sharing of sensitive military details over a Signal chat. Lawmakers have made it clear they are unhappy that Hegseth has not provided details on the administration’s first proposed defense budget, which President Donald Trump has said would total $1 trillion. It will be members’ first chance to ask about a myriad of other controversial spending by the Pentagon and the deployment of troops to quell protests in Los Angeles.",
      "publishedAt": "2025-06-10T04:07:42Z",
      "title": "Hegseth faces Congress for first time since Signal leaks",
      "url": "https://apnews.com/article/pentagon-congress-hegseth-signal-hearings-c53cd37c2eae4327dd74e4c717057469",
      "urlToImage": "https://dims.apnews.com/dims4/default/c17bcef/2147483647/strip/true/crop/4004x2252+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F08%2Fabddb42d7a5bb289b5a6c59ec028%2F709d6e04dd1d48e0ba9128f7a3bf936b"
    },
    {
      "author": null,
      "description": "President Donald Trump has authorized the deployment of an additional 2,000 National Guard members to help respond to protests in Los Angeles over immigration raids. The authorization followed mostly peaceful protests Monday. The 2,000 Guard members are an addition to the 2,100 Guard troops the president previously mobilized for the protests Sunday morning. Trump also deployed 700 Marines to help them Monday. Gov. Gavin Newsom called the deployments reckless and “disrespectful to our troops.\" Trump said Monday that the city would have been “completely obliterated” if he had not deployed the Guard.",
      "publishedAt": "2025-06-10T05:34:56Z",
      "title": "Marines deployed to LA to respond to immigration protests",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-9dfd2d025070bb6060d908dd3cf9b1f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e867fc/2147483647/strip/true/crop/8172x4597+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F2c%2F240e2cf4aad83dc1c20040efda7d%2Fcf8990a828ee4430972f17bf4e2786f0"
    },
    {
      "author": null,
      "description": "Several people have been killed at a school in the Austrian city of Graz on Tuesday, authorities said. Police said they deployed to the school after shots were heard there. The Interior Ministry said there were several fatalities but did not specify how many. There was also no immediate information on any injuries or on the status of the perpetrator. Special forces were among those sent to the high school after a call at 10 a.m. Graz, Austria’s second-biggest city, is located in the southeast of the country and has about 300,000 inhabitants.",
      "publishedAt": "2025-06-10T08:54:11Z",
      "title": "Several people dead in a shooting at a school in the Austrian city of Graz",
      "url": "https://apnews.com/article/austria-graz-school-police-deployment-43bc60f2016faa40f8a73dfa372b8a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Activist Greta Thunberg is being deported from Israel, Israel’s Foreign Ministry said Tuesday, after the Gaza-bound ship she was on was seized by the Israeli military. In a post on X, the Foreign Ministry shared a photo of Thunberg on a plane, saying that she was headed for France. Thunberg was one of 12 passengers on board the Madleen, a boat carrying aid destined for people in war-torn Gaza. The activists said they were protesting the ongoing war and the humanitarian crisis in Gaza. Israel says such ships violate its naval blockade of Gaza.",
      "publishedAt": "2025-06-10T07:12:28Z",
      "title": "Israel deports Greta Thunberg after seizing the Gaza-bound ship she was on",
      "url": "https://apnews.com/article/thunberg-deported-mideast-gaza-israel-7d6868f213dfcf78969f8e3d982788c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7dc5f28/2147483647/strip/true/crop/4201x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2Fbe%2Fcdf95d1118e2e5b03413f490bb76%2Ff3acc905ea994a0c9fcc01045e7512d9"
    },
    {
      "author": null,
      "description": "Ukrainian officials say two people were killed and thirteen wounded when Russia attacked the country with waves of drones and missiles. The attack early Tuesday struck the capital, Kyiv, and the southern port city of Odesa. President Volodymyr Zelenskyy called it “one of the biggest” in the more than three-year-old war. Explosions and the buzzing of drones were heard for hours in Kyiv. The fresh Russian attacks followed Russia's biggest overnight drone bombardment of Ukraine in the three-year war. Russia has been launching a record-breaking number of drones and missiles targeting Ukraine while the two countries continue to swap prisoners of war, the only tangible outcome of direct peace talks. A ceasefire, long sought by Kyiv, remains elusive.",
      "publishedAt": "2025-06-10T05:37:45Z",
      "title": "Russia attacks Ukraine with drones and missiles, killing 2",
      "url": "https://apnews.com/article/ukraine-russia-drones-attack-kyiv-odesa-a885df12bc7040cbbc4897b7bddf165f",
      "urlToImage": "https://dims.apnews.com/dims4/default/5686e92/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Fdc%2F7522eba2ac3afc670b1688abdd89%2F9b2fca79e7334a4f804a2e35ee970c61"
    },
    {
      "author": null,
      "description": "The Palestinian Health Ministry says Palestinians desperately trying to access aid in Gaza have come under fire again, killing 36 people and wounding 207. Experts and humanitarian aid workers say Israel’s blockade and 20-month military campaign have pushed Gaza to the brink of famine. At least 163 people have been killed and 1,495 wounded in a number of shootings near aid sites run by the Israeli and U.S.-backed Gaza Humanitarian Foundation, which are in military zones that are off-limits to independent media. The Israeli military has acknowledged firing warning shots on previous occasions at people who it says approached its forces in a suspicious manner.",
      "publishedAt": "2025-06-10T10:05:40Z",
      "title": "Palestinians say 36 killed trying to access aid in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-10-2025-fe6c6c36e302ee1766f1b0f2a7d5bc19",
      "urlToImage": "https://dims.apnews.com/dims4/default/15c2042/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fa9%2Fee204f17d55ddae49298893c415e%2F250b41b84f8b4756ac9e0a2bd552bf7b"
    },
    {
      "author": null,
      "description": "Health Secretary Robert F. Kennedy Jr. has removed every member of a scientific committee that advises the Centers for Disease Control and Prevention on how to use vaccines. He is pledging to replace them with his own picks. The 17-member Advisory Committee on Immunization Practices had been in a state of flux since Kennedy took over. He recently took the unusual step of changing COVID-19 recommendations without first consulting the panel. Kennedy says the committee members had too many conflicts of interest.",
      "publishedAt": "2025-06-09T21:12:29Z",
      "title": "RFK Jr. ousts ACIP group that advises CDC on vaccines",
      "url": "https://apnews.com/article/kennedy-cdc-acip-vaccines-3790c89f45b6314c5c7b686db0e3a8f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c043c4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe2%2F28c228082ac7fec6650f9b798653%2F0e0d4807b56a45ecb350f4a6f2f449be"
    },
    {
      "author": null,
      "description": "The City Council of San Jose, California, is voting on a controversial proposal that would make homeless people eligible for arrest if they reject three offers of housing. The mayor says homeless people who refuse offers of shelter and treatment are often too sick from drug addiction or mental illness to know what to do. Critics of the proposal before the City Council Tuesday say criminalizing homelessness is cruel and counterproductive. The proposal is eye-opening because it comes from a liberal city headed by a Democrat in the left-leaning San Francisco Bay Area. California Gov. Gavin Newsom also has called to ban encampments.",
      "publishedAt": "2025-06-10T16:50:06Z",
      "title": "Homeless people could be arrested after refusing three offers of shelter in Silicon Valley city",
      "url": "https://apnews.com/article/san-jose-homeless-shelter-arrests-dc558aa848621a8d4c8eb34c5a961cc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/3f6e646/2147483647/strip/true/crop/4808x2705+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F5f%2Fa662618f203adb76e11db5fa4c8f%2F679e627ab4b34fe5b4b7d86f91389680"
    },
    {
      "author": null,
      "description": "Under cross-examination, Sean “Diddy” Combs' ex-girlfriend says she performed for him sexually with male sex workers because it made her feel loved by the entertainer. However, she now resents him for leading her into the what she called the “cuckold” lifestyle. The woman testifying under the pseudonym “Jane” was treated gently by defense lawyer Teny Geragos on Tuesday. The cross-examination is likely to last several days. During her first three days on the witness stand, Jane described a tempestuous relationship with the hip-hop artist that culminated last spring in a blowup in Florida that left her with welts on her head and a black eye.",
      "publishedAt": "2025-06-10T17:23:38Z",
      "title": "Diddy's ex says she had 'cuckold' sex marathons to feel loved by him",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-1eabf057c72cefbce5098dfab8cb9065",
      "urlToImage": "https://dims.apnews.com/dims4/default/b23893a/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F21%2F0648a7fb5a77565263e0bf56bdf4%2F42829eefa2b842cf8e34d7f8cf1de00c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}