{
  "articles": [
    {
      "author": "JILL COLVIN, STEVE PEOPLES and JONATHAN J. COOPER",
      "description": "MILWAUKEE (AP) — JD Vance introduced himself to a national audience Wednesday after being chosen as Donald Trump’s running mate, sharing the story of his hardscrabble upbringing and making the case that his party best understands the challenges facing struggling Americans.",
      "publishedAt": "2024-07-17T04:07:37Z",
      "title": "JD Vance introduces himself as Trump's running mate and makes direct appeal to his native Rust Belt",
      "url": "https://apnews.com/67880a3003a69938aebd3ac8a586dc65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/061b673c527e4a1485d52bbd47932a85/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, MIKE BALSAMO, MARY CLARE JALONICK and MICHAEL R. SISAK",
      "description": "BUTLER, Pa. (AP) — The young man was pacing around the edges of the Donald Trump campaign rally, shouldering a big backpack and peering into the lens of a rangefinder toward the rooftops behind the stage where the former president would stand within the hour.",
      "publishedAt": "2024-07-17T21:33:07Z",
      "title": "Multiple failures, multiple investigations: Unraveling the attempted assassination of Donald Trump",
      "url": "https://apnews.com/a1bcbaa4a604e09be8cc22893751895b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224594c93c3e4832a00fd1868c15b39f/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, ZEKE MILLER and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Democrats worried about President Joe Biden's ability to win this November are making a renewed push for him to reconsider his reelection bid, using mountains of data, frank conversations and now, his own time off the campaign trail after testing positive for COVID, to encourage a reassessment.",
      "publishedAt": "2024-07-18T05:33:53Z",
      "title": "Democrats making a fresh push for Biden to reconsider running in runup to their own party convention",
      "url": "https://apnews.com/3f9e3d15431fd4974771a54e1d0e4ea7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eeac4c4f6b9047f3badead55c511372e/3000.jpeg"
    },
    {
      "author": "FATMA KHALED and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Nabila Hamada gave birth to twin boys in Gaza early in the war, in a hospital reeking of decaying bodies and full of displaced people.",
      "publishedAt": "2024-07-18T04:25:22Z",
      "title": "Bedwetting, nightmares and shaking. War in Gaza takes a mental health toll, especially on children",
      "url": "https://apnews.com/370c7ccc24dcc8a2c4b81acd5345221b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9295d0055c34cc996e73476b1c29e52/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Discontented, economically squeezed voters have turned against sitting governments on both right and left during many of the dozens of elections held this year, as global power blocs shift and political certainties crumble.",
      "publishedAt": "2024-07-18T04:21:30Z",
      "title": "Uncertainty is the winner and incumbents the losers so far in a year of high-stakes global elections",
      "url": "https://apnews.com/08f20983fc7fdf74484baa6dbf9c0fcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/424f3d6049974f2dace39dcc7ce60a01/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Leaders from across Europe gather at an English country mansion on Thursday for a summit clouded by worries about whether the United States would remain a reliable ally if Donald Trump secures a second presidency.",
      "publishedAt": "2024-07-18T04:28:22Z",
      "title": "European leaders will discuss migration and Ukraine at a UK summit amid worry about Trump",
      "url": "https://apnews.com/998e252d7f14f819b395736ac80ff97e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/652a96d2a60e4a2db55f20b3a16a9a61/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s president on Thursday appointed a former North Korean diplomat as a vice minister, the highest-level government job for any of the thousands of North Koreans who have resettled in South Korea.",
      "publishedAt": "2024-07-18T04:15:39Z",
      "title": "Ex-North Korean diplomat appointed a vice minister in South Korea, the highest post for any defector",
      "url": "https://apnews.com/71adf4c5df0b3145b498e91b0c1cbc50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b97bb18f0ea0467289f1b673f004fc7c/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — A former president is shot, the gunman quickly neutralized, and all of it is caught on camera. But for those who don't believe their eyes, that's just the start of the story.For some supporters of former President Donald Trump, the failure of the Secret Service to prevent the attempted assassination point to a conspiracy orchestrated by President Joe Biden.",
      "publishedAt": "2024-07-18T04:23:43Z",
      "title": "'One screen, two movies': Conflicting conspiracy theories emerge from Trump shooting",
      "url": "https://apnews.com/bf345b7cd72cc8c243084fe6ba8fa53a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/075c1583012449fcb87b9b75d338bee6/3000.jpeg"
    },
    {
      "author": "ANDREW DeMILLO and ED WHITE",
      "description": "LITTLE ROCK, Ark. (AP) — Another wave of severe storms pummeled a wide swath of the United States and Canada, leading to flash floods and water rescues Wednesday in the Ozark Mountains, dropping a tornado that ravaged a community in upstate New York and stranding drivers in high water around Toronto.",
      "publishedAt": "2024-07-17T13:38:15Z",
      "title": "Storms flood the Ozarks and strand drivers in Toronto. New York community is devastated by tornado",
      "url": "https://apnews.com/7e42c3a1e418758313ea8e85800661ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e151d76bb2a4bba9d37e6c9d604ee43/1920.jpeg"
    },
    {
      "author": "ALICIA RANCILIO",
      "description": "With less overall entries due to the shortened TV season, this year's Emmy nominations probably won't spark any protest campaigns.",
      "publishedAt": "2024-07-17T20:30:28Z",
      "title": "Selena Gomez gets her due, Netflix and FX top HBO and 2 Queen Elizabeths get nominated for Emmys",
      "url": "https://apnews.com/2de104d745e9a4716e59950f05f76e82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41390480164a441ba555b84fcff5a736/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}