{
  "articles": [
    {
      "author": "MICHAEL KUNZELMAN, ERIC TUCKER and NOMAAN MERCHANT",
      "description": "WASHINGTON (AP) — Donald Trump is due in federal court Thursday to answer to charges that he sought to overturn the results of the 2020 presidential election, facing a judge near the U.S.",
      "publishedAt": "2023-08-03T04:04:52Z",
      "title": "Trump is due to face a judge in DC over charges he tried to overturn the 2020 presidential election",
      "url": "https://apnews.com/a79f2d3683c7591058635c9b3d870070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18ec19f1ea834cf3bb1c74be07a6162d/1920.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — Tennessee Reps. Justin Pearson and Justin Jones, who became Democratic heroes as members of the “Tennessee Three,” are hoping to once again reclaim their legislative seats Thursday after they were expelled for involvement in a gun control protest on the House floor.",
      "publishedAt": "2023-08-03T05:11:06Z",
      "title": "2 members of expelled 'Tennessee Three' vie to win back their legislative seats",
      "url": "https://apnews.com/1ae19a1bd5f042624568e94b30c8fc1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0ff4d5de8c34579b2baef8eb00a2900/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A woman who escaped her kidnapper by punching her way out of a homemade cinder block cell at a home in southern Oregon likely saved other women from a similar fate, authorities said, by alerting them to a man they now suspect in sexual assaults in at least four more states.",
      "publishedAt": "2023-08-03T04:11:45Z",
      "title": "Woman's escape from cinder block cell likely spared others from similar nightmare, FBI says",
      "url": "https://apnews.com/df4798fc7c34b827517b43c902c417e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91fdfcde40634f9199a6eba3fd34fd1c/1920.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — At least 13 people were injured in South Korea on Thursday when a man rammed a car onto a sidewalk and then stepped out of the vehicle and began stabbing people near a subway station in the city of Seongnam.",
      "publishedAt": "2023-08-03T11:33:49Z",
      "title": "13 injured in South Korea when a man rams a car onto a sidewalk, stabs pedestrians",
      "url": "https://apnews.com/9dddc21d452f7d97d4be02202992c025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c2006dec0a4f2c83e7369606b8c084/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "PARKLAND, Fla. (AP) — Ballistics experts will fire up to 139 shots at Marjory Stoneman Douglas High School on Friday during a reenactment of the 2018 Parkland massacre organized as part of a lawsuit that accuses a sheriff’s deputy of failing in his duty to protect the victims.",
      "publishedAt": "2023-08-03T05:13:54Z",
      "title": "The Parkland school massacre will be reenacted, with gunfire, in lawsuit against sheriff's deputy",
      "url": "https://apnews.com/88011ab4bace76ab6ea5fab01211b348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d21e66be86a346279e0527079d67cce9/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Hundreds of people rallied in support of Niger's ruling junta in the capital on Thursday, denouncing France and others who have criticized a recent coup — as the country’s military leaders sought to exploit anti-Western sentiment to shore up their takeover.",
      "publishedAt": "2023-08-03T06:53:31Z",
      "title": "Hundreds rally in Niger, denouncing France, as the country's new junta seeks to justify its coup",
      "url": "https://apnews.com/2d30a7baf36ed2df180fb9edab59c53a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/853bbc98dd1149a18b4bf016e6340db0/1920.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — Adidas brought in 400 million euros ($437 million) from the first release of Yeezy sneakers left over after breaking ties with Ye, the rapper formerly known as Kanye West, as the German sportswear maker tries to offload the unsold shoes and donate part of the proceeds to groups fighting antisemitism and other forms of hate.",
      "publishedAt": "2023-08-03T08:44:49Z",
      "title": "Adidas brings in $437 million from the first Yeezy sale. Part of that will go to anti-hate groups",
      "url": "https://apnews.com/6a6d0fce740317b7c569ccea624e0e19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d02d9196bcd4e4badfe704765614eed/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russian shelling on Thursday damaged a landmark church in the southern city of Kherson that once held the remains of a renowned 18th-century Russian commander.",
      "publishedAt": "2023-08-03T08:40:51Z",
      "title": "Russian shelling hits a landmark church in the Ukrainian city of Kherson",
      "url": "https://apnews.com/88e389198e8d5d087693cecc1971f66f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1e3d5a5a69f4c3cb8a3e6248e12c64b/3000.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "SAN DIEGO (AP) — Waves are getting bigger and surf at least 13 feet (about 4 meters) tall is becoming more common off California’s coast as the planet warms, according to innovative new research that tracked the increasing height from historical data gathered over the past 90 years.",
      "publishedAt": "2023-08-02T21:58:22Z",
      "title": "Waves grow up to 13 feet tall in California as Earth warms, research finds",
      "url": "https://apnews.com/2dba8b958acf6642647b40a716924765",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/531ed68fe3414a519864355d466c0065/3000.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "NAIROBI, Kenya (AP) — As the U.S. government was considering Kenya to lead a multinational force in Haiti, it was also openly warning Kenyan police officers against violent abuses.",
      "publishedAt": "2023-08-03T05:05:46Z",
      "title": "The US wants Kenya to lead a force in Haiti with 1,000 police. Watchdogs say they'll export abuse",
      "url": "https://apnews.com/2464c509c8d6742fdc6c1d7ea4683979",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a7d5ef97c044327a51d8eec6f43168c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}