{
  "articles": [
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The U.S. paused a shipment of bombs to Israel last week over concerns that Israel was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah against the wishes of the U.S., a senior administration official said Tuesday.",
      "publishedAt": "2024-05-08T01:56:54Z",
      "title": "US paused bomb shipment to Israel to signal concerns over Rafah invasion, official says",
      "url": "https://apnews.com/432aa51e3569d1a73b22273295b1a53f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fad33c20b6a4aad91dbfcd90b889227/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS, SAMY MAGDY and MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — The Israeli military said Wednesday that it has reopened the Kerem Shalom crossing into Gaza, a key terminal for the entry of humanitarian aid that was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby.",
      "publishedAt": "2024-05-08T06:25:24Z",
      "title": "Israel says it reopened a key Gaza crossing after a rocket attack but the UN says no aid has entered",
      "url": "https://apnews.com/495e6dabfdddc5587bd20e71b6ad421d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db169ceb86374c81b558b3e2d234c72e/1920.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Police began to clear a pro-Palestinian tent encampment at George Washington University early Wednesday and arrested dozens of protesters, hours after dozens left the site and marched to President Ellen Granberg’s home.",
      "publishedAt": "2024-05-08T10:05:43Z",
      "title": "Police clearing pro-Palestinian tent encampment at George Washington University, dozens arrested",
      "url": "https://apnews.com/eac5c1cc396551bee1b110b48a94aefd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4f6ecc6bb594a2c8726e14a1d127ae9/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump squirmed and scowled, shook his head and muttered as Stormy Daniels described the unexpected sex she says they had nearly two decades ago, saying she remembered “trying to think of anything other than what was happening.”",
      "publishedAt": "2024-05-08T01:06:23Z",
      "title": "Inside the courtroom where Trump was forced to listen to Stormy Daniels",
      "url": "https://apnews.com/7883af6da39566472d0e6e1736d2f90a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed7cd38cdc684d658f89083e62ae093b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is racing into yet another battleground state Wednesday, continuing to push a contrast with Donald Trump on economic policy as his own reelection campaign readies a new $14 million advertising blitz aimed in part at Black, Latino and Asian American voters.",
      "publishedAt": "2024-05-08T09:52:47Z",
      "title": "Biden heads to Wisconsin to laud a new Microsoft facility, meet voters — and troll Trump",
      "url": "https://apnews.com/ec3501d041d7b8b563563b22fcc23db5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca74fb0b411740828ad04c5f37e561e1/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN and KRISTEN GELINEAU",
      "description": "MEULABOH, Indonesia (AP) — The boat glided across waters that were dark and still, under a night sky that was cloudless and calm. But on board, the 12-year-old girl quaked with fear.The captain and crew who she says had tortured her and three other women and girls were not finished.",
      "publishedAt": "2024-05-08T03:07:46Z",
      "title": "Rape, terror and death at sea: How a boat carrying Rohingya children, women and men capsized",
      "url": "https://apnews.com/1d2ad5595a5240ea4d2c35e26ddf9394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d400778a426f4b1384fd7e32217bc580/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian forces unleashed a nighttime barrage of more than 50 cruise missiles and explosive drones at Ukraine’s power grid Wednesday, targeting a wide area in what President Volodymyr Zelenskyy called a “massive” attack on the day the country celebrates the defeat of Nazism in World War II.",
      "publishedAt": "2024-05-08T07:18:49Z",
      "title": "Russia hits Ukraine's power grid with a 'massive' attack on a day marking the WWII defeat of Nazism",
      "url": "https://apnews.com/e4b4507e3f17965a8ad69fdfb8dfa48d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5214683713674d53abe916028db9e5f6/1920.jpeg"
    },
    {
      "author": "ED WHITE, ALEXA ST. JOHN and SEAN MURPHY",
      "description": "DETROIT (AP) — Severe storms continued to barrel through the Midwest early Wednesday, unleashing a curtain of heavy rain, gusty winds and tornadoes that forecasters warned could spill out of the region.",
      "publishedAt": "2024-05-08T04:49:04Z",
      "title": "Storms battering the Midwest bring tornadoes, hail and strong winds",
      "url": "https://apnews.com/1ac4133f09069997f926e434a28c75ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40a906a116b54cfea82a70740c69c209/1024.jpeg"
    },
    {
      "author": "SYLVIE CORBET and BARBARA SURK",
      "description": "MARSEILLE, France (AP) — Excitement is building in the southern French city of Marseille, where a majestic three-mast ship carrying the Olympic torch arrived from Greece ahead of a welcoming ceremony at sunset Wednesday.",
      "publishedAt": "2024-05-08T06:04:49Z",
      "title": "A ship carrying the Olympic torch arrives in Marseille amid fanfare and high security",
      "url": "https://apnews.com/d954536cfeef8e000b36260c5a5f1853",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d14f8f3b9984d0f8cb51e494795e1d7/1920.jpeg"
    },
    {
      "author": "LISA LEFF",
      "description": "LONDON (AP) — Thousands of ride-or-die Taylor Swift fans who missed out on her U.S.",
      "publishedAt": "2024-05-08T06:01:29Z",
      "title": "Fans are following Taylor Swift to Europe after finding Eras Tour tickets less costly there",
      "url": "https://apnews.com/bcf8a207f06fd1f3e17a2f3f3b24dab5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e23cbb89e4c4748bedaa4dccfc8e0f6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}