{
  "articles": [
    {
      "author": "RAF CASERT, LORNE COOK and SAMUEL PETREQUIN",
      "description": "BRUSSELS (AP) — Far-right parties made major gains in European Union parliamentary elections Sunday, dealing stunning defeats to two of the bloc’s most important leaders: French President Emmanuel Macron and German Chancellor Olaf Scholz.",
      "publishedAt": "2024-06-09T04:02:15Z",
      "title": "Far-right gains in EU election deal stunning defeats to France's Macron and Germany's Scholz",
      "url": "https://apnews.com/0fbfcb7bd987008e802d70f759fa870b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c5df287a3a847539507aad852bb6c04/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — President Emmanuel Macron dissolved the lower house of France's parliament in a surprise announcement sending voters back to the polls in the coming weeks to choose lawmakers, after his party was handed a humbling defeat by the far-right in the European elections Sunday.",
      "publishedAt": "2024-06-09T18:11:56Z",
      "title": "Macron dissolves the French parliament and calls a snap election after defeat in EU vote",
      "url": "https://apnews.com/b132616d24de829660d8dbe0659e50fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee2081139ec548fea4884a23665251c2/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Benny Gantz, a centrist member of Israel’s three-man war Cabinet, announced his resignation Sunday, accusing Prime Minister Benjamin Netanyahu of mismanaging the war effort and putting his own “political survival” over the country's security needs.",
      "publishedAt": "2024-06-09T17:48:53Z",
      "title": "Centrist Benny Gantz is quitting Israel's war Cabinet, citing frustrations with Netanyahu",
      "url": "https://apnews.com/48a4a60ccccdb7f74b4bf7816f9a7c67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37c1e4d00e7b4fc480d705db0699a66b/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 274 Palestinians, including dozens of children, were killed, and hundreds more were wounded, in the Israeli raid that rescued four hostages held by Hamas, Gaza's Health Ministry said Sunday.",
      "publishedAt": "2024-06-09T10:07:06Z",
      "title": "Gaza's Health Ministry says 274 Palestinians were killed in Israeli raid that rescued 4 hostages",
      "url": "https://apnews.com/61eb1be9a9d0cf2dbf250cd4a8ed4dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/329310f4c3d54b89ac226cdeec341231/2217.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ADRIANA GOMEZ LICON",
      "description": "LAS VEGAS (AP) — Former President Donald Trump rallied voters in the scorching heat of Las Vegas, at points telling his supporters to ask for help if needed and appearing irritable with the teleprompters that he said were not working.",
      "publishedAt": "2024-06-09T12:16:17Z",
      "title": "Trump complains about his teleprompters at a scorching Las Vegas rally",
      "url": "https://apnews.com/90b0c766b9bfc41b370953834b70f7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff23ae4992414ecaa971d0c11d1ed061/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "Former President Donald Trump is scheduled to be interviewed by New York probation officials Monday, a required step before his July sentencing in his criminal hush money case, according to three people familiar with the plan.",
      "publishedAt": "2024-06-09T19:53:56Z",
      "title": "Trump to undergo probation interview Monday, a required step before his New York sentencing",
      "url": "https://apnews.com/ff76617722766fb305d32d84a2bf3600",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/280f7d9635f345e095bb7f62f2fc7bf3/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, DARLENE SUPERVILLE and CLAUDIA LAUER",
      "description": "WILMINGTON, Del. (AP) — In a span of less than 48 hours this past week, first lady Jill Biden shuttled from a Normandy ceremony marking the 80th anniversary of the D-Day invasion in France to the front row of a Delaware courtroom, where Hunter Biden is on trial in a gun case, and then back to Paris for an elaborate state visit at Élysée Palace.",
      "publishedAt": "2024-06-09T11:50:21Z",
      "title": "Hunter Biden's family weathers a public and expansive airing in federal court of his drug addiction",
      "url": "https://apnews.com/cbaa8bad6c41e2ed0cc3aa61ae7de407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fefaf667ae34d558a8dfe948859f2d7/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Independent presidential candidate Robert F. Kennedy Jr. has reached 15% or more in three approved national polls. One more, and he will have met one of CNN's benchmarks to qualify for the debate June 27 with Democratic President Joe Biden and presumptive Republican nominee Donald Trump.",
      "publishedAt": "2024-06-09T11:59:09Z",
      "title": "Why Robert F. Kennedy's Jr.'s current presidential polling numbers might not hold up into November",
      "url": "https://apnews.com/71ffff6d34b0bad8b92cb8e82369d2e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddd729352226435c80e91876fb017524/3000.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "EL AMRA, Tunisia (AP) — For many migrants who’ve long dreamed of Europe, one of the last stops is an expanse of olive trees on North Africa's Mediterranean coastline.But in Tunisia, less than 100 miles (161 kilometers) from the Italian islands that form the European Union’s outermost borders, for many that dream has become a nightmare.",
      "publishedAt": "2024-06-09T08:11:48Z",
      "title": "Stranded migrants confront violence and despair as Tunisia partners to keep them from Europe",
      "url": "https://apnews.com/e6162d4221062bf09dd13de690da9f91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750916ef1bd942709a55bdbea8c6b0af/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "PARIS (AP) — As Carlos Alcaraz began constructing his comeback in Sunday's French Open final, a 6-3, 2-6, 5-7, 6-1, 6-2 victory over Alexander Zverev for a first championship at Roland Garros and third Grand Slam title in all, there arrived the sort of magical shot the kid is making a regular part of his varied repertoire.",
      "publishedAt": "2024-06-09T07:00:53Z",
      "title": "Carlos Alcaraz wins the French Open for a third Grand Slam title at 21 by beating Alexander Zverev",
      "url": "https://apnews.com/84b987ef5a0bf17c2d188a5a9bbd2d28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13a88bf90cbf41a9bf1d347ea2fc73eb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}