{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — The jury in former President Donald Trump’s hush money trial resumed deliberations Thursday after revisiting portions of the judge's instructions and rehearing testimony from multiple key witnesses about the alleged scheme at the heart of the history-making case.",
      "publishedAt": "2024-05-30T04:03:01Z",
      "title": "Jury in Trump hush money trial resumes deliberations after rehearing instructions, testimony",
      "url": "https://apnews.com/85558c6d08efb434d05b694364470aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a27ab00f86d5416baafd6dcd86c71374/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Slovenia’s government endorsed a motion Thursday to recognize a Palestinian state and asked the parliament to do the same. It comes just two days after Spain, Norway and Ireland recognized a Palestinian state, a move that was condemned by Israel.",
      "publishedAt": "2024-05-30T06:41:44Z",
      "title": "The Latest | Slovenia moves to recognize a Palestinian state as Israel fights in Rafah",
      "url": "https://apnews.com/db1561901fcab2ab0835c981a885d661",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d884ae1083544069ba82ae1b0b08686/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Boeing told federal regulators Thursday how it plans to fix the safety and quality problems that have plagued its aircraft-manufacturing work in recent years.",
      "publishedAt": "2024-05-30T04:07:50Z",
      "title": "Boeing tells federal regulators how it plans to fix aircraft safety and quality problems",
      "url": "https://apnews.com/32ebe104f397d20e28f72c173234460b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6498e420012c470fa034dd5969c42c08/3000.jpeg"
    },
    {
      "author": "HELEN WIEFFERING and JOSHUA GOODMAN",
      "description": "Abdul Nasser Saleh says he rarely got a good night’s sleep during the near-decade he spent working without pay on a cargo ship abandoned by its owner at ports along the Red Sea.By night, he tossed and turned in his bunk on the aging Al-Maha, he said, thinking of the unpaid wages he feared he’d never get if he left the ship.",
      "publishedAt": "2024-05-30T11:05:19Z",
      "title": "Stuck at sea for years, a sailor's plight highlights a surge in shipowner abandonment",
      "url": "https://apnews.com/83ad0a42debbaf67c18373393fcea753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da586307f00d47f59dd1eb0f735d0316/2000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Lab-grown meat is not currently available in any U.S. grocery stores or restaurants. If some lawmakers have their way, it never will be.",
      "publishedAt": "2024-05-30T11:32:41Z",
      "title": "Lab-grown meat isn't on store shelves yet, but some states have already banned it",
      "url": "https://apnews.com/8dee6ce8e1282efe953ca4115db4b2c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e58777ed406f4b92a2b21906023dbb4f/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "SAN FRANCISCO (AP) — If you use Facebook, WhatsApp or Instagram, you've probably noticed a new character pop up answering search queries or eagerly offering tidbits of information in your feeds, with varying degrees of accuracy.",
      "publishedAt": "2024-05-30T11:14:48Z",
      "title": "One Tech Tip: Want to turn off Meta AI? You can't — but there are some workarounds",
      "url": "https://apnews.com/fd778171e2a1e7098d7b3756deb5587b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fb07d7c78ca4edf824c29be925886e4/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Manure. Cigarette butts. Scraps of cloth. Waste batteries. Even, reportedly, diapers. This week, North Korea floated hundreds of huge balloons to dump all of that trash across rival South Korea — an old-fashioned, Cold War-style provocation that the country has rarely used in recent years.",
      "publishedAt": "2024-05-30T15:11:38Z",
      "title": "North Korea's trash rains down onto South Korea, balloon by balloon. Here's what it means",
      "url": "https://apnews.com/1bcc854e438968a824b4838c519114a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8a85aea5aad4a84a40827a6c5a2202a/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A unanimous Supreme Court on Thursday cleared the way for a National Rifle Association lawsuit against a former New York state official over claims she pressured companies to blacklist it following the deadly 2018 school shooting in Parkland, Florida.",
      "publishedAt": "2024-05-30T14:17:11Z",
      "title": "NRA can sue ex-NY official it says tried to blacklist it after Parkland shooting, Supreme Court says",
      "url": "https://apnews.com/953424f3fd33f279b0cc2ce050069d48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c065fadf04d14d869aa1d1b2a119f605/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON and MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico goes into Sunday’s election deeply divided: friends and relatives no longer talk politics for fear of worsening unbridgeable divides, while drug cartels have split the country into a patchwork quilt of warring fiefdoms.",
      "publishedAt": "2024-05-30T04:41:20Z",
      "title": "A violent, polarized Mexico goes to the polls to choose between 2 women presidential candidates",
      "url": "https://apnews.com/4d5f620f0f8f9b7ef6efa8b3083561a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a4c009be27e441e998dfb737350914c/1920.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — The incarceration of 120,000 Japanese Americans, including children, labeled enemies during World War II is an historical experience that has traumatized, and galvanized, the Japanese American community over the decades.",
      "publishedAt": "2024-05-30T04:40:36Z",
      "title": "'Star Trek' actor George Takei is determined to keep telling his Japanese American story",
      "url": "https://apnews.com/07c2b803a951b766962ac029ce59da14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5819a21012a3434383b6b5388711070d/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}