{
  "articles": [
    {
      "author": "TERRY SPENCER and HAVEN DALEY",
      "description": "TAMPA, Fla. (AP) — Fearful Florida residents streamed out of the Tampa Bay region Tuesday ahead of what could be a once-in-a-century direct hit from Hurricane Milton, as crews worked furiously to prevent furniture, appliances and other waterlogged wreckage from the last big storm from becoming deadly projectiles in this one.",
      "publishedAt": "2024-10-08T04:08:46Z",
      "title": "Fearful residents flee Tampa Bay region as Hurricane Milton takes aim at Florida coast",
      "url": "https://apnews.com/7678939c52fdf00da748937d22df1fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/930b871939ac4e198f62aadc152f384c/1920.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — Two weeks ago, Hurricane Helene “spared” the Tampa Bay region a direct hit and yet storm surge still caused catastrophic damage, flooding homes, drowning people who decided to stay near the coast and leaving massive piles of debris that still sit along roadsides.",
      "publishedAt": "2024-10-08T18:53:33Z",
      "title": "Milton's storm surge is a threat that could be devastating far beyond the Tampa Bay region",
      "url": "https://apnews.com/20b1480a5113bf8a643e7efecbb36f97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21352f63012142bab28575f4d6b28807/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Hezbollah fired another barrage of rockets into Israel on Tuesday, and the militant group’s acting leader vowed to keep up pressure that has forced tens of thousands of Israelis from their homes near the Lebanese border.",
      "publishedAt": "2024-10-08T09:15:08Z",
      "title": "Hezbollah steps up rocket fire as Israel sends more troops into Lebanon",
      "url": "https://apnews.com/0bc0a8970c066c048ee1875bcdc8df79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/711c0fba80f34a64920cf0d98822b1fb/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "NEW YORK (AP) — Kamala Harris wanted to help voters get to know her better with a cascade of media appearances on Tuesday, but the most lasting impression might have been her unwillingness to break with Joe Biden.",
      "publishedAt": "2024-10-08T04:10:54Z",
      "title": "Harris gets personal in media blitz, balks at breaking with Biden on policy",
      "url": "https://apnews.com/5a2af60ba0b1099e19cca151955c9855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fc94e10e68a4b3d82c9d5e3c89995fb/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court seemed likely Tuesday to uphold a Biden administration regulation on ghost guns, the difficult-to-trace weapons found in increasing numbers at crime scenes.",
      "publishedAt": "2024-10-08T04:24:23Z",
      "title": "Supreme Court seems open to upholding regulations on ghost guns, hard to trace weapons used in crime",
      "url": "https://apnews.com/9c93df5fa88081f7bcef75a7ecfb0239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49000ba06e7949e4b6be1939d04a9736/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The FBI has arrested an Afghan man who officials say was inspired by the Islamic State militant organization and was plotting an Election Day attack targeting large crowds in the U.S., the Justice Department said Tuesday.",
      "publishedAt": "2024-10-08T22:04:58Z",
      "title": "FBI arrests Afghan man who officials say planned Election Day attack in the US",
      "url": "https://apnews.com/2e13aac1b28342be32513eaf58212ada",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66cbd6c495bc47df9eebda41de03cd2a/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY and MICHAEL PHILLIS",
      "description": "WASHINGTON (AP) — A decade after the Flint, Michigan, water crisis raised alarms about the continuing dangers of lead in tap water, President Joe Biden on Tuesday set a 10-year deadline for cities across the nation to replace their lead pipes, finalizing an aggressive approach aimed at ensuring that drinking water is safe for all Americans.",
      "publishedAt": "2024-10-08T09:23:32Z",
      "title": "Biden sets 10-year deadline for US cities to replace lead pipes nationwide",
      "url": "https://apnews.com/4aae63134894762cbe904ee460e62708",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d7fe0c7bd2548349917577915b56211/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and BARBARA ORTUTAY",
      "description": "SAO PAULO (AP) — The Brazilian Supreme Court's Justice Alexandre de Moraes on Tuesday authorized the restoration of social media platform X´s service in Brazil, over a month after its nationwide shutdown, according to a court document that was made public.",
      "publishedAt": "2024-10-08T20:33:12Z",
      "title": "Musk's X to be reinstated in Brazil after complying with Supreme Court demands",
      "url": "https://apnews.com/e32c4b4171e78cbe8994f53713a922f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b633877af32e4052becc56b437df5133/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A former Houston police officer was sentenced to 60 years in prison on Tuesday for the murder of a married couple during a drug raid that revealed systemic corruption in the department’s narcotics unit.",
      "publishedAt": "2024-10-08T17:38:56Z",
      "title": "Retired Houston officer gets 60 years in couple's drug raid deaths that revealed corruption",
      "url": "https://apnews.com/1ee81ed2947a72e43ebf9e6f6435e1f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/330a3b6c24464bf29d1cad0971fc7251/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN, SETH BORENSTEIN and MATT O'BRIEN",
      "description": "STOCKHOLM (AP) — Two pioneers of artificial intelligence — John Hopfield and Geoffrey Hinton — won the Nobel Prize in physics Tuesday for helping create the building blocks of machine learning that is revolutionizing the way we work and live but also creates new threats for humanity.",
      "publishedAt": "2024-10-08T07:50:55Z",
      "title": "Pioneers in artificial intelligence win the Nobel Prize in physics",
      "url": "https://apnews.com/fc0567de3f2ca45f81a7359a017cd542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99e40320b3ff40ffa83eafed27d81821/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}