{
  "articles": [
    {
      "author": "MEG KINNARD and ALANNA DURKIN RICHER",
      "description": "New charges — and a new defendant — added to the classified documents case against former President Donald Trump underscore how the Mar-a-Lago investigation is still very much ongoing, even as the focus has been on an expected indictment in a separate case related to the 2020 election.",
      "publishedAt": "2023-07-28T02:17:25Z",
      "title": "Donald Trump faces new charges in the Mar-a-Lago classified documents case. Here's what to know",
      "url": "https://apnews.com/bee867f48da593d351c5a91e87c356a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8d497cca6b64a5bb06baee018092205/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Former President Donald Trump faced new charges Thursday in a case accusing him of illegally possessing classified documents, with prosecutors alleging that he asked a staffer to delete camera footage at his Florida estate in an effort to obstruct a federal investigation into the records.",
      "publishedAt": "2023-07-27T22:01:08Z",
      "title": "Trump accused of asking staffer to delete camera footage in Florida classified documents case",
      "url": "https://apnews.com/2025feb3f0f4e3820d14387c67ce4316",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202f5335493a45bdb3be08d4946c0c51/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The unraveling of Hunter Biden's plea agreement has thrust his criminal case into uncertain waters and given new fodder to Republican critics in Congress as they push ahead with investigations into the president's youngest son.",
      "publishedAt": "2023-07-27T17:58:31Z",
      "title": "What's next for Hunter Biden in court and Congress after his plea deal derails",
      "url": "https://apnews.com/ad80b195c8c0f48241740881cf9b9bce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f699ef9c9090419997ec70b2049ce30a/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "A teenager with special needs was repeatedly sexually assaulted by an employee at a small private boarding school in South Carolina, his parents said in a lawsuit as they advocate for more oversight of similar therapeutic facilities.",
      "publishedAt": "2023-07-28T04:01:26Z",
      "title": "Teen was sexually abused at therapeutic boarding school, lawsuit says as parents advocate oversight",
      "url": "https://apnews.com/a75b56695ebf547fe3def1e11449c512",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70556ee38508424199b5dff590752fd1/3000.jpeg"
    },
    {
      "author": "THOMAS MACHOWICZ and ANITA SNOW",
      "description": "PHOENIX (AP) — Homeless in America's hottest big metro, Stefon James Dewitt Livengood was laid out for days inside his makeshift dwelling, struggling to breath, nauseous and vomiting.Every day this month, temperatures have soared past 110 degrees Fahrenheit (43.3 degrees Celsius).",
      "publishedAt": "2023-07-28T04:00:51Z",
      "title": "Homeless struggle to stay safe from record high temperatures in blistering Phoenix",
      "url": "https://apnews.com/a47f04ee21b96651585f3684ac35cb6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b00a05499194b86b3596c2eb04447d5/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "FULTON, Mo. (AP) — At the entrance to Missouri prisons, large signs plead for help: “NOW HIRING” ... “GREAT PAY &amp; BENEFITS.\"No experience is necessary. Anyone 18 and older can apply. Long hours are guaranteed.",
      "publishedAt": "2023-07-28T04:20:32Z",
      "title": "Mounting job vacancies push state and local governments into a wage war for workers",
      "url": "https://apnews.com/74d1689d573e298be32f3848fcc88f46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eead6ef67e584eae9507d88ae206e6c5/2016.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Randy Meisner, a founding member of the Eagles who added high harmonies to such favorites as “Take It Easy” and “The Best of My Love” and stepped out front for the waltz-time ballad “Take It to the Limit,” has died, the band said Thursday.",
      "publishedAt": "2023-07-27T23:41:28Z",
      "title": "Randy Meisner, founding member of the Eagles and singer of 'Take It to the Limit,' dies at 77",
      "url": "https://apnews.com/b4f9bdabdc17f8e789262fb8023c5f7d",
      "urlToImage": ""
    },
    {
      "author": "STEVE PEOPLES, BRENDAN FARRINGTON and KAT STAFFORD",
      "description": "TALLAHASSEE, Fla. (AP) — Civil rights activists cheered when Ron DeSantis pardoned four Black men wrongfully convicted of rape as one of his first actions as Florida's governor.",
      "publishedAt": "2023-07-27T14:14:41Z",
      "title": "DeSantis is defending new slavery teachings. Civil rights leaders see a pattern of 'policy violence'",
      "url": "https://apnews.com/1fb51d663e6051051aa23b71421b9479",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd789fb720064504ba21d2aa2fda9c01/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and RENATA BRITO",
      "description": "SAINT-LOUIS, Senegal (AP) — In the seaside town of Saint-Louis, Senegal, officials and residents say bodies of migrants from capsized boats attempting the dangerous trip from West Africa to Spain are buried in unmarked beach graves.",
      "publishedAt": "2023-07-28T04:23:19Z",
      "title": "Takeaways from AP's report on bodies from migrant boats buried on the beach in Senegal",
      "url": "https://apnews.com/e4d5108fe5ba2437a27d1bdfc5c35f7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e1bf1aebd77428980e6bb9fd60accdd/3000.jpeg"
    },
    {
      "author": "CARLOS VALDEZ and DANIEL POLITI",
      "description": "LA PAZ, Bolivia (AP) — Bolivia is now using the yuan to pay for imports and exports, becoming the latest country in South America to regularly use the Chinese currency in a small but growing challenge to the hegemony of the U.S.",
      "publishedAt": "2023-07-28T02:24:26Z",
      "title": "Bolivia is the latest South American nation to use China's yuan for trade in challenge to the dollar",
      "url": "https://apnews.com/696bfb7c5ab68d4f0a87a7f6557678f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/119f2b558bc44744b896ceb18bb1ac78/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}