{
  "articles": [
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The FBI should have done more to gather intelligence before the Capitol riot, according to a watchdog report Thursday that also said no undercover FBI employees were on the scene on Jan.",
      "publishedAt": "2024-12-12T18:02:51Z",
      "title": "Watchdog finds FBI intelligence missteps before Jan. 6 riot, but no undercover agents were present",
      "url": "https://apnews.com/79c7ea02cf66c874f9201ae8e9294239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fa90853de6b481b9456c71fadc38903/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is commuting the sentences of roughly 1,500 people who were released from prison and placed on home confinement during the coronavirus pandemic and is pardoning 39 Americans convicted of nonviolent crimes.",
      "publishedAt": "2024-12-12T10:00:45Z",
      "title": "Biden commutes roughly 1,500 sentences and pardons 39 people in biggest single-day act of clemency",
      "url": "https://apnews.com/4432002d67334e6716c2776fd73f3cc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50832057f3e344e998f760e703ec8a56/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The man charged with killing UnitedHealthcare CEO Brian Thompson was never a client of the medical insurer and may have targeted it because of its size and influence, a senior police official said Thursday.",
      "publishedAt": "2024-12-12T22:24:38Z",
      "title": "Police say suspect in UnitedHealthcare CEO killing wasn't a client of the insurer",
      "url": "https://apnews.com/d148fbdde498c3ea4cf768945889d7e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e2ae7a1e94a4927a718cdbadc64ede0/2667.jpeg"
    },
    {
      "author": "JILL COLVIN, LISA MASCARO and HANNAH FINGERHUT",
      "description": "WASHINGTON (AP) — She’s an Iraq War combat veteran and sexual assault survivor who has advocated for years to improve how the military handles claims of sexual misconduct.But when Sen.",
      "publishedAt": "2024-12-12T12:26:36Z",
      "title": "Pressure on a veteran and senator shows what's next for those who oppose Trump",
      "url": "https://apnews.com/dd15a8b031ca8cad2a99237ab99b53a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2348af25fab54b1e9325d4af1d07b87d/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump has nvited Chinese President Xi Jinping to attend his inauguration next month — extending a diplomatic olive branch even as Trump threatens to levy massive tariffs on Chinese goods.",
      "publishedAt": "2024-12-12T14:25:10Z",
      "title": "Trump invited China's Xi to his inauguration even as he threatened massive tariffs on Beijing",
      "url": "https://apnews.com/d654da01f90bf3bec071bb9890ffbd29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd1a80e28c0b4a39be0bfdf0d632614c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit the central Gaza Strip on Thursday, killing at least 25 Palestinians and wounding dozens more, Palestinian medics said, as U.S. President Joe Biden’s two top national security officials were in the region making a renewed push for an Israel-Hamas ceasefire.",
      "publishedAt": "2024-12-12T20:18:17Z",
      "title": "Israeli strike in Gaza kills 25 people as US makes new push for a ceasefire",
      "url": "https://apnews.com/a39e98286d8d270b6e81608a3d17fa4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c514a9c2ff6043bdabdb9df55b0145f6/1920.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "TOMS RIVER, N.J. (AP) — A U.S. senator has called for mysterious drones spotted flying at night over sensitive areas in New Jersey and other parts of the Mid-Atlantic region to be “shot down, if necessary,” even as it remains unclear who owns the unmanned aircraft.",
      "publishedAt": "2024-12-12T17:07:31Z",
      "title": "US senator says mysterious drones spotted in New Jersey should be 'shot down, if necessary'",
      "url": "https://apnews.com/8bfe84cf2678400181292b75f9193395",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d148cb9750d4aa6aedfc44e3d585c34/3000.jpeg"
    },
    {
      "author": "DYLAN LOVAN and ALANNA DURKIN RICHER",
      "description": "LOUISVILLE, Ky. (AP) — The U.S. Justice Department and the city of Louisville have reached an agreement to reform the city’s police force after an investigation prompted by the fatal police shooting of Breonna Taylor and police treatment of protesters, officials said Thursday.",
      "publishedAt": "2024-12-12T16:41:31Z",
      "title": "Justice Department, Louisville reach deal after probe prompted by Breonna Taylor killing",
      "url": "https://apnews.com/3aa7638bc8026f5a5a6e808757d56309",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1129df42de0d4d63a4476c10921892db/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS and MEG KINNARD",
      "description": "WASHINGTON (AP) — As several of President-elect Donald Trump’s choices for high-level positions in his incoming administration face scrutiny on Capitol Hill, a poll from The Associated Press-NORC Center for Public Affairs Research shows that Americans have their own doubts.",
      "publishedAt": "2024-12-12T12:11:41Z",
      "title": "What Americans think about Hegseth, Gabbard and key Trump Cabinet picks AP-NORC poll",
      "url": "https://apnews.com/2e6a3b7a9f5fad9fb7527681f1f5a9aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09a51aedf9834bff9858eeec95866ce5/3000.jpeg"
    },
    {
      "author": "AARON BEARD",
      "description": "Bill Belichick had just been introduced Thursday as North Carolina's next football coach when chancellor Lee Roberts came armed with a gift: a short-sleeved gray hoodie — a bit of a trademark from Belichick's NFL coaching days — bearing a blue interlocking “NC” logo.",
      "publishedAt": "2024-12-12T15:47:59Z",
      "title": "Bill Belichick 'always wanted' to give college coaching a try. Now he will at North Carolina",
      "url": "https://apnews.com/ac27d942da2cb40a0c282eb2786db593",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bb40af818bc46a190284be33129b403/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}