{
  "articles": [
    {
      "author": null,
      "description": "Kilmar Abrego Garcia has surrendered to immigration authorities in Baltimore and faces possible efforts by the Trump administration to deport him to Uganda. The Maryland construction worker became the face of President Donald Trump’s immigration policies when he was wrongfully deported in March to a notorious prison in his native El Salvador. Abrego Garcia was returned to the U.S. in June, but only to face human smuggling charges that his lawyers call preposterous. A judge in Tennessee determined that Abrego Garcia wasn’t a danger or flight risk. He was released from jail on Friday. The Trump administration has said it will try to deport him before his trial.",
      "publishedAt": "2025-08-25T11:50:19Z",
      "title": "Kilmar Abrego Garcia surrenders to ICE in Baltimore, faces possible deportation to Uganda",
      "url": "https://apnews.com/article/abrego-garcia-deportation-uganda-ice-2bad172b72c4871bc20bfa221b49b8bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d50e202/2147483647/strip/true/crop/3759x2114+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F09%2F2289d355afa645eb7bc7e87d6285%2Ff2e8193498eb45c189b736a9184a4e29"
    },
    {
      "author": null,
      "description": "A hospital strike in southern Gaza has killed at least eight people, including four journalists. The attack happened on Monday. Among the victims was Mariam Dagga, a freelancer for the Associated Press. She had been covering the Gaza war, focusing on doctors at Nasser Hospital. Al Jazeera confirmed that its journalist Mohammed Salam was also killed in the strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed, and photographer Hatem Khaled was wounded. The incident highlights the dangers journalists face while reporting in conflict zones.",
      "publishedAt": "2025-08-25T09:13:38Z",
      "title": "Multiple journalists killed by Israeli strikes on Gaza hospital",
      "url": "https://apnews.com/article/mideast-wars-gaza-journalists-killed-5c33e999ee88effd89566a993b31d9cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Chris Rugaber",
      "description": "President Donald Trump has fired Federal Reserve Governor Lisa Cook, a sharp escalation in his battle to exert greater control over what has long been considered an institution independent from day-to-day politics. Trump said in a letter posted Monday on his Truth Social platform that he is firing Cook because of allegations that she committed mortgage fraud. Bill Pulte, a Trump appointee to the agency that regulates mortgage giants Fannie Mae and Freddie Mac, made the accusations last week. Cook had said she wouldn’t leave her post despite Trump previously calling for her to resign.",
      "publishedAt": "2025-08-26T00:24:24Z",
      "title": "Trump fires Federal Reserve Governor Lisa Cook",
      "url": "https://apnews.com/article/federal-reserve-lisa-cook-trump-6fca3d2fbb54ba204cc91398e6a7b020",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e4ca1a/2147483647/strip/true/crop/5693x3202+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2Faa%2F5aa90a355ed95c3ff6ca070ccd37%2Fbf09d936711b40d49bd68f0b484543b6"
    },
    {
      "author": "Darlene Superville",
      "description": "President Donald Trump has signed an executive order requiring the Justice Department to investigate instances of flag burning despite a 1989 U.S. Supreme Court ruling that such activity is legitimate political expression protected by the Constitution. It was among several crime-related orders the Republican president signed Monday. The executive order says that flag burning done in a way that incites violence isn't protected by the Constitution. The order calls on the attorney general to prioritize enforcement “to the fullest extent possible” of criminal and civil laws against flag burning that cause harm unrelated to the First Amendment.",
      "publishedAt": "2025-08-25T17:08:39Z",
      "title": "Trump moves to ban flag burning",
      "url": "https://apnews.com/article/trump-executive-order-flag-burning-4628d588350db4f6baf10ae1d91f49c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/c15a29f/2147483647/strip/true/crop/2253x1267+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fa2%2Fbd0ce70c8c16065daa518f775dae%2F0ce45a5fbc4f4034b8f8347399f62240"
    },
    {
      "author": "Gabriela Aoun Angueira",
      "description": "More than 180 current and former FEMA employees have published a letter warning of potential disaster due to cuts in the agency. The letter coincides with the 20th anniversary of Hurricane Katrina, highlighting concerns about management and capacity at FEMA. It warns that current practices echo conditions the Post-Katrina Emergency Management Reform Act aimed to prevent. The letter criticizes policies like expenditure approval and reassignment of staff to ICE. It calls for FEMA to be an independent Cabinet-level agency. Thirty-five signatories included their names, while 141 remained anonymous due to fear of suppression.",
      "publishedAt": "2025-08-25T15:15:15Z",
      "title": "FEMA staff calls out Trump cuts in public letter of dissent",
      "url": "https://apnews.com/article/fema-letter-kristi-noem-disasters-836712f383a8b7d393c5ebf0f80143cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ed1385/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F9d%2F6d528cc872f9dfe6031193f5a727%2Fd268db7921d44b14b7f39179d348b28b"
    },
    {
      "author": "Mark Sherman",
      "description": "Public schools have reopened in the nation’s capital with parents on edge over the presence of thousands of National Guard troops, some armed, and federal law enforcement officers. Even as President Donald Trump again touted a drop in crime he attributed to his extraordinary effort to take over policing in Washington, D.C., the district’s mayor on Monday lamented the effect of Trump’s actions on children. Mayor Muriel Bowser says parents in the city are anxious. She noted that some might keep their children out of school because of immigration concerns.",
      "publishedAt": "2025-08-25T18:39:52Z",
      "title": "Schools reopen in DC with parents on edge over Trump's armed patrols",
      "url": "https://apnews.com/article/capital-intervention-trump-national-guard-school-d39c34d3e6a2ec367682f13926b3e0b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6d4755/2147483647/strip/true/crop/6950x3909+0+362/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F85%2Fd0adeeed69d303d95d99d8ee7198%2F979d576691e6442a9d8ca991221e86b9"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump’s special envoy Keith Kellogg says officials are “working very, very hard” on efforts to end the three-year war between Russia and Ukraine. Kellogg said in Kyiv on Monday that officials are “hoping to get to a position where, in the near term, we have, with a lack of a better term, security guarantees” that address Ukraine’s fears of another invasion by Russia in the future. A lack of progress in talks is fueling doubts about whether a peace settlement could be on the horizon.",
      "publishedAt": "2025-08-25T11:38:14Z",
      "title": "Trump envoy says officials working hard on ending Russia-Ukraine war",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-norway-kellogg-08940b28d8c97ae3eb547e3eae74572e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f00191d/2147483647/strip/true/crop/5657x3182+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F0f%2Fdc718b8e0c5cc3e58735d9d127e8%2F75fa9a4d58574a8090d78bddf5a9270b"
    },
    {
      "author": null,
      "description": "Keurig Dr Pepper says it will buy Peet’s Coffee owner JDE Peet’s in an $18 billion (15.7 billion euro) deal. When the acquisition is complete, the company plans to split into two separate companies, one focused on coffee and the other focused on beverages including Dr Pepper, Canada Dry, 7Up and energy drinks. The coffee business will have about $16 billion in combined sales and the beverage business about $11 billion. In addition to Peet’s, Amsterdam-based JDE Peet’s brands include L’OR, Jacobs, Douwe Egberts, Kenco, Pilao, OldTown, Super and Moccona.",
      "publishedAt": "2025-08-25T08:55:07Z",
      "title": "Dr Pepper buys Peet's for $18 billion and will split into separate coffee and cold drink sellers",
      "url": "https://apnews.com/article/keurig-dr-pepper-peets-acquisition-coffee-904c356a8eb57a6b256b7f45a0f59d8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/07c7df2/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fc0%2Fa28b99a1a17b68af990adfa23b17%2Fbce7cf6f5a3547818e2a833511288bf2"
    },
    {
      "author": "Howard Fendrich",
      "description": "Australian Open champion Madison Keys has been undone by 89 unforced errors during a 6-7 (10), 7-6 (3), 7-5 loss to Mexico’s Renata Zarazua in the first round of the U.S. Open. The sixth-seeded Keys, who was the runner-up at Flushing Meadows in 2017, made so many mistakes Monday, including 14 double-faults, that Zarazua needed to produce just eight winners to earn the biggest victory of her career. The 82nd-ranked Zarazua had lost in either the first or second round in all eight of her previous Grand Slam appearances. Keys earned her first major championship at Melbourne Park in January, defeating No. 1 Aryna Sabalenka in the final.",
      "publishedAt": "2025-08-25T19:12:16Z",
      "title": "Renata Zarazua of Mexico upsets Madison Keys at the US Open",
      "url": "https://apnews.com/article/us-open-8-25-2025-results-keys-zarazua-e1f3350a35ae819d40c57de302619306",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0d0ff8/2147483647/strip/true/crop/4800x2700+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F57%2Fa03845928532bf24b5e911cec738%2F25129552f8f8493a8aa046936385ca71"
    },
    {
      "author": "Andrew Dalton",
      "description": "Lil Nas X has been charged with four felonies, including three counts of battery on a police officer. Authorities say he charged at officers who confronted him for walking naked down a Los Angeles street last week. Prosecutors on Monday also charged him with resisting an executive officer. He is set to be arraigned later Monday. Police found the musician whose legal name is Montero Lamar Hill walking naked on busy Ventura Boulevard early Friday. Suspecting a possible overdose, they took him to a hospital before arresting him. Known for hits like “Old Town Road,” Lil Nas X remains in jail. His representatives haven't responded to requests for comment.",
      "publishedAt": "2025-08-25T17:42:15Z",
      "title": "Lil Nas X charged with attacking police officers as he walked naked on Los Angeles street",
      "url": "https://apnews.com/article/lil-nas-x-lapd-felony-charges-780ef8560cd075102257a5404f882b8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4942e59/2147483647/strip/true/crop/3813x2145+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fbd%2F9ec771842b0639fb6220af6e5e17%2F3beb1bdd284b4ea4a28c90fda7a40640"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}