{
  "articles": [
    {
      "author": null,
      "description": "National Guard troops have begun arriving in Los Angeles on orders from President Donald Trump to stamp out protests that have broken out in recent days against federal immigration authorities seeking to carry out deportations in the region. The members of California’s National Guard were seen staging early Sunday at the federal complex in downtown Los Angeles that includes the Metropolitan Detention Center, where confrontations occurred the last two days.",
      "publishedAt": "2025-06-08T15:00:10Z",
      "title": "National Guard troops arrive in LA to quell protests against ICE",
      "url": "https://apnews.com/article/immigration-protests-raids-los-angeles-78eaba714dbdd322715bf7650fb543d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/73dbd0d/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Ffa%2Fd6e136fd0f4920f023d112f3e151%2F240d88867ccc4af2a9b0c0eb573bbafd"
    },
    {
      "author": null,
      "description": "President Donald Trump says he’s deploying 2,000 California National Guard troops to Los Angeles to respond to immigration protests, over the objections of California Gov. Gavin Newsom. It’s not the first time Trump has activated the National Guard to quell protests. In 2020, he asked governors of several states to send troops to Washington, D.C. to respond to demonstrations that arose after George Floyd was killed by Minneapolis police officers. Here are some things to know about when and how the president can deploy troops on U.S. soil.",
      "publishedAt": "2025-06-08T04:24:03Z",
      "title": "What to know about Trump's deployment of National Guard troops to LA protests",
      "url": "https://apnews.com/article/insurrection-act-trump-troops-newsom-military-national-guard-a842f79e1c0e244039be274a6f266a7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/84a9b9b/2147483647/strip/true/crop/2974x1673+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fae%2Fa7bb5b876204248d3fcacd653669%2Ffbe5a926360b401d8c56d0bc5cda2a32"
    },
    {
      "author": null,
      "description": "President Donald Trump’s new ban on travel to the United States by citizens from 12 mainly African and Middle Eastern countries is set to take effect on Monday. The ban comes amid escalating tension over the president’s unprecedented campaign of immigration enforcement. Trump signed the new proclamation on Monday. It applies to citizens of Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It also imposes heightened restrictions on people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela who are outside the U.S. and don’t hold a valid visa.",
      "publishedAt": "2025-06-08T18:26:49Z",
      "title": "Trump's new travel ban set to take effect amid escalating tension over immigration enforcement",
      "url": "https://apnews.com/article/trump-travel-ban-immigration-enforcement-visas-b1eb79c7b5717c96daf51e978db83d1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6d26fe/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F4e%2F6b69e6e719df174b0468b87899ce%2Fa389db7b896f41c68b200dd5fedc5afe"
    },
    {
      "author": null,
      "description": "Jannik Sinner has dropped a set for the first time at Roland-Garros this year but still leads two sets to one in the French Open final against defending champion Carlos Alcaraz. After falling behind early in the third, Alcaraz won four consecutive games then took the set 6-4 to keep his title defense alive. Sinner, the top-ranked player, leads 6-4, 7-6 (4), 4-6.",
      "publishedAt": "2025-06-08T06:00:06Z",
      "title": "Alcaraz fights back to take third set in French Open final",
      "url": "https://apnews.com/article/french-open-men-final-alcaraz-sinner-e0de8f0c10f4b3e988f31257a3e08a9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d6a09c/2147483647/strip/true/crop/5209x2930+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe4%2Fa38b9b8b4ef3cac3e6d926de7c89%2Fab875bd395fc4390b7e329fed266d677"
    },
    {
      "author": null,
      "description": "A pair of singing androids. Two Pulitzer Prize-winning plays. A drunken Mary Todd Lincoln. A musical with a corpse as its hero. A “Romeo and Juliet” with teddy bears and rave music. Not to mention George Clooney. Broadway has had a stuffed season with seemingly something for everyone and now it’s time to recognize the best with the Tony Awards. They're set for Sunday night on CBS and streaming on Paramount+ with Cynthia Erivo as host. Broadway buzz is usually reserved for musical but this year plays powered by A-list talent are driving the conversation.",
      "publishedAt": "2025-06-08T04:24:25Z",
      "title": "2025 Tony Awards offer many intriguing matchups",
      "url": "https://apnews.com/article/tony-awards-2025-337e617e5b3601503d65dbd7159856e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e37dcf2/2147483647/strip/true/crop/8058x4533+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F00%2Ffd6fc0d067ad7d1c01bb85004392%2F23d5fa950f61431f917517d9251aebac"
    },
    {
      "author": null,
      "description": "Palestinian health officials and witnesses say Israeli fire killed at least 12 people as they headed toward two aid distribution points in Gaza. Israel’s military said it fired warning shots at people who approached its forces Sunday. The sites are run by an Israeli and U.S.-backed group. The past two weeks have seen frequent shootings near the new hubs where thousands of Palestinians are directed to collect food. Many are desperate after 20 months of war. The sites are inside Israeli military zones where independent media have no access. Gaza's Health Ministry says in all, at least 108 bodies were brought to hospitals over the past 24 hours. Israel says it identified Hamas chief Mohammed Sinwar’s body, who was killed last month.",
      "publishedAt": "2025-06-08T08:32:09Z",
      "title": "At least 12 are killed by Israeli fire near Gaza aid sites, Palestinians say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-08-2025-e6a2ae2ca7bc02225ef3c75e7d62ebc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/325dc15/2147483647/strip/true/crop/5594x3147+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F27%2F7214d8d04baf1d625155a0b549ab%2F14835dfc01f14081a363ba2a737687c5"
    },
    {
      "author": null,
      "description": "After the raucous rainbow-hued festivities of Saturday’s parade, the final day of World Pride 2025 in the nation’s capital kicked off on a more downbeat note. Thousands gathered under grey skies Sunday morning at the Lincoln Memorial for a rally and protest march, as the community gathers its strength for a looming fight under President Donald Trump’s second administration. The speeches didn’t just target the Trump administration or the Republican party. Some turned their ire on Democratic politicians, who they say have wilted under the pressure of Republican control of the White House and both houses of Congress.",
      "publishedAt": "2025-06-08T16:13:53Z",
      "title": "World Pride celebrations end with anti-Trump sentiment on display",
      "url": "https://apnews.com/article/pride-trump-dc-gay-washington-f3ed5feaec4f98916cf55933351a0d8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/31e77ba/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F46%2F898b02b38c952ea7a7d348305612%2Fed32a7e5273540a5af2aca2fa8f2f649"
    },
    {
      "author": null,
      "description": "Russian officials say that Moscow is still awaiting confirmation from Kyiv on a planned exchange of 6,000 bodies of soldiers killed in action and is accusing Ukraine of delaying the process. Lt. Gen. Alexander Zorin, a Russian negotiator, said on Sunday that Russia delivered 1,212 bodies of Ukrainian troops to a border site and is receiving “signals” the transfer may be postponed until next week. The swap was agreed during direct talks in Istanbul, though both sides have since accused each other of undermining the plan. Ukraine has denied a date was agreed and accused Russia of manipulating facts and submitting incorrect repatriation lists.",
      "publishedAt": "2025-06-08T09:41:32Z",
      "title": "Russia accuses Ukraine of delaying exchange of dead fighters",
      "url": "https://apnews.com/article/russia-ukraine-war-prisoner-swap-bodies-743d264ed87083e16846e668c35144f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/5abe438/2147483647/strip/true/crop/4129x2323+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Ff7%2F9b91deb17e6413ef3d21324c0e4e%2Ff3fe84febe914d4c956d35f1bba6324e"
    },
    {
      "author": null,
      "description": "Six decades after the federal government ordered Concordia Parish to desegregate its schools, the district remains racially divided. Black students make up more than 92% of Ferriday High School, while 15 minutes away, Vidalia High is 62% white. Yet state and local officials say it’s time to free Concordia Parish and other districts from court-ordered desegregation orders dating back decades. In a stunning shift that reverses decades of policy, they have allies in the federal government. The Trump administration has vowed to lift more desegregation plans from the 1960s. Civil rights activists say it would leave families with little recourse when they face discrimination.",
      "publishedAt": "2025-06-08T04:01:20Z",
      "title": "School desegregation: Trump officials vow to end Civil Rights-era orders",
      "url": "https://apnews.com/article/desegregation-race-consent-decree-school-1dd1a8be59bb0f9568d5685b8459f413",
      "urlToImage": "https://dims.apnews.com/dims4/default/53fe72e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4e%2Fd2424279efd6868272c0337ad51b%2F3f25246eef8a4b088a920d86b0749719"
    },
    {
      "author": null,
      "description": "Hackers tied to China's government have tried repeatedly to access the phones of prominent Americans, part of Beijing's sprawling cyberespionage efforts. Smartphones and other mobile devices present significant national security and cybersecurity risks, as foreign government hackers exploit vulnerabilities in mobile networks and apps to spy on people and steal secrets. And people's careless use of mobile devices to share sensitive information is another concern. National security experts say that mobile security hasn't kept up as mobile devices and networks have proliferated, making them a significant vulnerability in the nation's cyber defenses.",
      "publishedAt": "2025-06-08T11:40:45Z",
      "title": "Smartphones have become an intelligence treasure trove",
      "url": "https://apnews.com/article/china-cybersecurity-hacking-smartphones-37bb5f10c6e21fec2863b1faf269cecc",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3484a2/2147483647/strip/true/crop/2916x1640+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Ffe%2F8d50b11bc9259364cec917eef058%2F03fc68090be04bd8b5bbe3541ab3d062"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}