{
  "articles": [
    {
      "author": "SEUNG MIN KIM and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is interviewing a half-dozen potential running mates this weekend ahead of a formal announcement and a battleground tour with her new No.",
      "publishedAt": "2024-08-02T21:57:19Z",
      "title": "Kamala Harris is interviewing six potential vice president picks this weekend, AP sources say",
      "url": "https://apnews.com/3b792c18b033b330ae59b45570ca56c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/861df4a929164f7483d01bf504f12f3f/1920.jpeg"
    },
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "ATLANTA (AP) — Former President Donald Trump returns Saturday to Georgia, which he lost four years ago, to campaign in a state that both Democrats and Republicans see as up for grabs yet again.",
      "publishedAt": "2024-08-03T04:06:03Z",
      "title": "Trump and Vance return to Georgia days after a Harris event in the same arena",
      "url": "https://apnews.com/b21c25bbbfafdd0343c8812f6c3d7c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2936aabedfea4f70a49b4a03c085e840/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. will move a fighter jet squadron to the Middle East and maintain an aircraft carrier in the region, the Pentagon said Friday, beefing up the American military presence to help defend Israel from possible attacks by Iran and its proxies and safeguard U.S.",
      "publishedAt": "2024-08-02T22:14:58Z",
      "title": "US to boost military presence in Mideast, sending fighter jet squadron and keeping carrier in region",
      "url": "https://apnews.com/418a990ab69cb766e126c60dbaebedb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578cc78112c84ae3b20d1166602ee2f9/3000.jpeg"
    },
    {
      "author": "JOANNA KOZLOWSKA",
      "description": "President Vladimir Putin strode along the red carpet between two rows of rifle-toting honor guards and warmly greeted intelligence operatives freed in the biggest prisoner swap with the West since the Cold War.",
      "publishedAt": "2024-08-03T04:04:45Z",
      "title": "US and Russia tout prisoner swap as a victory. But perceptions of the deal show stark differences",
      "url": "https://apnews.com/d3498148da77947034d7b743377c3913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9a053aafaa479b9c11439f5228bab2/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ZEKE MILLER AND MATTHEW LEE",
      "description": "WASHINGTON (AP) — It was December 2022 and the U.S. government's chief hostage negotiator had just delivered Brittney Griner back to America after her 10-month imprisonment in Russia.",
      "publishedAt": "2024-08-02T16:42:38Z",
      "title": "An assassin, a Putin foe's death, secret talks: How a sweeping US-Russia prisoner swap came together",
      "url": "https://apnews.com/efae784bb95d3e496bb53b0fbf0b185b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d245b2688d461ba415f799540d0395/3000.jpeg"
    },
    {
      "author": "AREF TUFAHA and JACK JEFFERY",
      "description": "ZEITA, West Bank (AP) — An Israeli airstrike on a vehicle in the occupied West Bank killed five Palestinians, according to Israel's army and Palestinian health authorities, as violence flares in the Israeli-occupied territory.",
      "publishedAt": "2024-08-03T09:46:00Z",
      "title": "Israeli airstrike in northern West Bank kills 5, who army says were planning an attack",
      "url": "https://apnews.com/4ccf2a50855866662cd21a0315395286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b315fc1350b04a39a8bf99c509d8e2f3/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO, JOSHUA GOODMAN and ANGELIKI KASTANIS",
      "description": "CARACAS, Venezuela (AP) — An AP analysis of vote tally sheets released Friday by Venezuela’s main opposition indicates that their candidate won significantly more votes in Sunday’s election than the government has claimed, casting serious doubt on the official declaration that President Nicolás Maduro won.",
      "publishedAt": "2024-08-02T13:47:51Z",
      "title": "AP review of Venezuela opposition-provided vote tallies casts doubt on government’s election results",
      "url": "https://apnews.com/a625eb01979bc9cf5570d03242f198b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7d4035c40944d4b4121a859e96177b/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — The parties in lawsuits seeking damages for last year’s Maui wildfires have reached a $4 billion global settlement, a court filing said Friday, nearly one year after the deadliest U.S.",
      "publishedAt": "2024-08-03T01:42:15Z",
      "title": "Parties in lawsuits seeking damages for Maui fires reach $4B global settlement, court filings say",
      "url": "https://apnews.com/b4e6206cf7d8045e8e9e0473f37423c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85995b47422044afb6da140eb4b685aa/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin on Friday overrode a plea agreement reached earlier this week for the accused mastermind of the Sept.",
      "publishedAt": "2024-08-03T00:48:05Z",
      "title": "Defense secretary overrides plea agreement for accused 9/11 mastermind and two other defendants",
      "url": "https://apnews.com/bf450589039b761c028492a348da4ea5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1652c7424af47e396a6d2d68b48dc34/3000.jpeg"
    },
    {
      "author": "GIOVANNA DELL’ORTO",
      "description": "MARSEILLE, France (AP) — Her black headscarf flying up, a teen jumped into the sparkling Mediterranean from a concrete pier at a city marina, then scrambled back to shore and onto a giant paddle board for a quick tour with a dozen excited comrades.",
      "publishedAt": "2024-08-03T05:13:02Z",
      "title": "Marseille and the sea: A portrait of the millennia-old port city that is hosting Olympic sailing",
      "url": "https://apnews.com/5fea773dd22a9f96084fe67a639813e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eb9e51f21a44b17851a00ee7a11d153/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}