{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit a tent camp in the courtyard of a crowded hospital in central Gaza on Sunday, killing two Palestinians and wounding another 15, including journalists working nearby.",
      "publishedAt": "2024-03-31T11:31:42Z",
      "title": "An Israeli airstrike hits a Gaza hospital tent camp, killing 2 Palestinians and hurting journalists",
      "url": "https://apnews.com/2dfbc154409ae6160b4e594b1b346e13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba2f0033b40846b1969bc62a192f80d2/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis rallied from a winter-long bout of respiratory problems to lead some 60,000 people in Easter celebrations Sunday, making a strong appeal for a cease-fire in Gaza and a prisoner swap between Russia and Ukraine.",
      "publishedAt": "2024-03-31T08:40:45Z",
      "title": "Pope overcomes health concerns to preside over a blustery Easter Sunday Mass in St. Peter's Square",
      "url": "https://apnews.com/a89541850baa416f69060ae8e699abac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f06ddaa33d5043d3a0db076fca5936fd/2000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Generations of Maryland workers — longshoremen, seafarers, steelworkers and crabbers whose livelihoods depend on Baltimore’s port — watched in disbelief this week as an iconic symbol of their maritime culture crumbled into the Patapsco River.",
      "publishedAt": "2024-03-31T04:03:25Z",
      "title": "In Key Bridge collapse, Baltimore lost a piece of its cultural identity",
      "url": "https://apnews.com/91c3bfe8c235eff0157808691259a514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36ecae7ebc0f43178c70c7ea40bc32e7/3000.jpeg"
    },
    {
      "author": "SERKAN GURBUZ and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — Teams of engineers worked Saturday on the intricate process of cutting and lifting the first section of twisted steel from the collapsed Francis Scott Key Bridge, which crumpled into the Patapsco River this week after a massive cargo ship crashed into one of its supports.",
      "publishedAt": "2024-03-30T04:04:36Z",
      "title": "Crews carefully start removing first piece of twisted steel from collapsed Baltimore bridge",
      "url": "https://apnews.com/3edebfb3b7fb48fd81be81cf69ebfbf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b0c6214077848bfb4d03acc578c00e8/1920.jpeg"
    },
    {
      "author": "TERRY CHEA and ADAM BEAM",
      "description": "LIVERMORE, Calif. (AP) — Most fast food workers in California will be paid at least $20 an hour beginning Monday when a new law is scheduled to kick in giving more financial security to an historically low-paying profession while threatening to raise prices in a state already known for its high cost of living.",
      "publishedAt": "2024-03-31T04:45:39Z",
      "title": "New $20 minimum wage for fast food workers in California set to start Monday",
      "url": "https://apnews.com/a04c2e559b09cbcd26dd5702e0755a83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/975a56d4358b496fb17b090794294c4b/1920.jpeg"
    },
    {
      "author": "SUZAN FRASER and CINAR KIPER",
      "description": "ANKARA, Turkey (AP) — Voters in Turkey cast ballots on Sunday in local elections that will decide who gets to control Istanbul and other key cities. The vote is also a barometer of Turkish President Recep Tayyip Erdogan’s popularity as he seeks to win back control of key urban areas he lost to the opposition five years ago.",
      "publishedAt": "2024-03-31T04:06:09Z",
      "title": "Voters in Turkey cast ballots in local elections to decide who runs Istanbul and other key cities",
      "url": "https://apnews.com/8adc4df56cdbce24f78900e1d142ff21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/287749c8c9744f788847a3fe7baab368/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — King Charles III shook hands and chatted with onlookers after attending an Easter service at Windsor Castle on Sunday in his most significant public outing since being diagnosed with cancer last month.",
      "publishedAt": "2024-03-31T09:16:42Z",
      "title": "King Charles shakes hands, chats with crowd at most significant public outing since cancer diagnosis",
      "url": "https://apnews.com/b8f580bd6bdbc5c146dab2b279adab54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac7f841c84544763823db5d2cd7021d2/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japan said Sunday its experts have held talks with their Chinese counterparts to try to assuage Beijing’s concerns over the discharge of treated radioactive wastewater from the wrecked Fukushima Daiichi nuclear power plant into the sea.",
      "publishedAt": "2024-03-31T10:44:29Z",
      "title": "Japan confirms experts met in China to ease concerns over discharge of treated radioactive water",
      "url": "https://apnews.com/10907cf4618cfc499eae164897a88724",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/967f9bee85064845923d1083018eed0e/2751.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A Russian cruise missile strike on infrastructure in Ukraine’s western Lviv region killed one man, while another died in an attack in the northeast, officials said Sunday.The attack in Lviv destroyed a building and sparked a fire, Gov.",
      "publishedAt": "2024-03-31T09:49:25Z",
      "title": "2 dead as Russia launches attacks on Ukraine's energy infrastructure",
      "url": "https://apnews.com/de446fa5182eb4b1480783b402b01d9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c68a6b878a479daa69bad6141268f2/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — Google co-founders Larry Page and Sergey Brin loved pulling pranks, so much so they began rolling outlandish ideas every April Fool's Day not long after starting their company more than a quarter century ago.",
      "publishedAt": "2024-03-31T09:28:18Z",
      "title": "Gmail revolutionized email 20 years ago. People thought it was Google's April Fool's Day joke",
      "url": "https://apnews.com/8ca1601944845282ecbc87ac9c335a6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/309b8fac5df54567bf79b8ade294ee17/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}