{
  "articles": [
    {
      "author": "Ohad Zwigenberg, Sam Metz, Samy Magdy",
      "description": "Protesters in Israel have torched tires and blocked highways to demand a ceasefire to free hostages in Gaza. This comes as Israeli leaders push for an offensive against Hamas. The protest Tuesday follows deadly strikes on Gaza's main hospital that killed 20 people, including medics and journalists. Prime Minister Benjamin Netanyahu is expected meet his cabinet later on Tuesday. Relatives of hostages hope steady pressure can push the government to commit to ceasefire talks. But far-right coalition members have threatened to bolt if Israel agrees to a truce. Most hostages taken on October 7, 2023, have been released, but 50 remain in captivity in Gaza.",
      "publishedAt": "2025-08-26T10:33:05Z",
      "title": "Protesters in Israel demand release of hostages as Gaza strikes kill 16, hospitals say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-26-2025-0f1be1b4e3231e0cbec54ce837cc6af9",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e2a443/2147483647/strip/true/crop/5428x3053+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F54%2Fd7416eb3ffa0036e77cbff939584%2F1d6e562a18a442f08ba4f144848bb75f"
    },
    {
      "author": "Rodney Muhumuza",
      "description": "Opposition figures in Uganda have criticized a deal with the U.S. to accept deported migrants. They question the lack of parliamentary approval and suggest it eases political pressure on President Yoweri Museveni. Ugandan officials have shared few details, but have said they prefer deportees of African origin without criminal records. Still, U.S. officials say they are processing Kilmar Abrego Garcia, a Salvadoran national charged with human smuggling, for deportation to Uganda. Critics argue the agreement benefits Museveni politically and economically. The deal comes amid U.S. sanctions on Ugandan officials over corruption and rights abuses. The lack of transparency and parliamentary oversight has raised concerns.",
      "publishedAt": "2025-08-26T09:35:02Z",
      "title": "Ugandan opposition figures question deal to receive deportees from the US",
      "url": "https://apnews.com/article/uganda-us-deportations-criticism-692a6cbf61c96ac3ed837b567bf2d72c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Kilmar Abrego Garcia has surrendered to immigration authorities in Baltimore and faces possible efforts by the Trump administration to deport him to Uganda. The Maryland construction worker became the face of President Donald Trump’s immigration policies when he was wrongfully deported in March to a notorious prison in his native El Salvador. Abrego Garcia was returned to the U.S. in June, but only to face human smuggling charges that his lawyers call preposterous. A judge in Tennessee determined that Abrego Garcia wasn’t a danger or flight risk. He was released from jail on Friday. The Trump administration has said it will try to deport him before his trial.",
      "publishedAt": "2025-08-25T11:50:19Z",
      "title": "Kilmar Abrego Garcia surrenders to ICE in Baltimore, faces possible deportation to Uganda",
      "url": "https://apnews.com/article/abrego-garcia-deportation-uganda-ice-2bad172b72c4871bc20bfa221b49b8bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d50e202/2147483647/strip/true/crop/3759x2114+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F09%2F2289d355afa645eb7bc7e87d6285%2Ff2e8193498eb45c189b736a9184a4e29"
    },
    {
      "author": null,
      "description": "A hospital strike in southern Gaza has killed at least eight people, including four journalists. The attack happened on Monday. Among the victims was Mariam Dagga, a freelancer for the Associated Press. She had been covering the Gaza war, focusing on doctors at Nasser Hospital. Al Jazeera confirmed that its journalist Mohammed Salam was also killed in the strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed, and photographer Hatem Khaled was wounded. The incident highlights the dangers journalists face while reporting in conflict zones.",
      "publishedAt": "2025-08-25T09:13:38Z",
      "title": "Multiple journalists killed by Israeli strikes on Gaza hospital",
      "url": "https://apnews.com/article/mideast-wars-gaza-journalists-killed-5c33e999ee88effd89566a993b31d9cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Babar Dogar, Munir Ahmed",
      "description": "Officials say rescuers in eastern Pakistan have evacuated tens of thousands of people to safer areas after neighboring India released water from overflowing dams and swollen rivers into low-lying border regions. The move came a day after New Delhi alerted Islamabad about possible cross-border flooding, marking the first public diplomatic contact between the two nuclear-armed rivals in months. Pakistan’s National Disaster Management Authority said Tuesday it had issued an advance alert about a surge in the Sutlej River and the risk of flooding. It said more evacuations from various districts in the eastern Punjab province are still underway.",
      "publishedAt": "2025-08-26T07:26:48Z",
      "title": "Pakistan evacuates more than 100,000 as India releases water from dams",
      "url": "https://apnews.com/article/pakistan-mass-evacuations-india-released-water-rains-4201f92cd951b36a2b9d9b534df1cd82",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e6bd5d/2147483647/strip/true/crop/2455x1381+0+128/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Fac%2Fdae80c1b6742bd0e0314dd539af0%2F60558353fa284237a24bc1327a5f0d5a"
    },
    {
      "author": "Chris Rugaber",
      "description": "President Donald Trump has fired Federal Reserve Governor Lisa Cook, a sharp escalation in his battle to exert greater control over what has long been considered an institution independent from day-to-day politics. Trump said in a letter posted Monday on his Truth Social platform that he is firing Cook because of allegations that she committed mortgage fraud. Bill Pulte, a Trump appointee to the agency that regulates mortgage giants Fannie Mae and Freddie Mac, made the accusations last week. Cook had said she wouldn’t leave her post despite Trump previously calling for her to resign.",
      "publishedAt": "2025-08-26T00:24:24Z",
      "title": "Trump fires Federal Reserve Governor Lisa Cook",
      "url": "https://apnews.com/article/federal-reserve-lisa-cook-trump-6fca3d2fbb54ba204cc91398e6a7b020",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e4ca1a/2147483647/strip/true/crop/5693x3202+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2Faa%2F5aa90a355ed95c3ff6ca070ccd37%2Fbf09d936711b40d49bd68f0b484543b6"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Shares are lower in Europe and Asia after President Donald Trump said he was firing Federal Reserve Gov. Lisa Cook. The announcement came after trading closed Monday on Wall Street, where benchmarks reversed some of their big gains from last week. Trump announced his plan to dismiss Cook on his Truth Social platform. On Monday, the S&P 500 fell 0.4% and the Dow Jones Industrial Average gave back 0.8% after setting a record on Friday. The Nasdaq composite shed 0.2%. Apart from rattling financial markets, Trump's latest move is likely to touch off an extensive legal battle that will probably go to the Supreme Court. Oil prices lost more than $1 a barrel.",
      "publishedAt": "2025-08-26T02:41:55Z",
      "title": "World shares sink after Trump escalates feud with the Federal Reserve",
      "url": "https://apnews.com/article/stock-markets-ai-inflation-fed-d3cfca075104241f4285a316d0f2143d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5dbe0d3/2147483647/strip/true/crop/2806x1578+0+146/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Ffd%2F2ea1f0682ca0cc5e63b092438924%2F5c5fa057edba4c5790782741e3e47ec1"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australian Prime Minister Anthony Albanese is accusing Iran of directing at least two antisemitic attacks in Australia and says the country is cutting off diplomatic relations in response. Albanese says that Australian intelligence services has connected Iran to arson attacks on a Sydney restaurant and a Melbourne synagogue. There has been a steep rise in antisemitic events in the two cities since the Israel-Hamas war began in 2023. He added that Iran has tried to disguise its involvement, but ASIO assesses it was behind the attacks.",
      "publishedAt": "2025-08-26T03:23:51Z",
      "title": "Australia cuts off diplomatic relations with Iran",
      "url": "https://apnews.com/article/australia-iran-antisemitism-attacks-fad2dc76125807a643bfe14cae33d2c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/cfcc720/2147483647/strip/true/crop/5823x3275+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fa7%2Fd96ba7a38a21e7395b8999f8883f%2Fdad3d2a0067942e1a8b31a1c7ebee1c3"
    },
    {
      "author": "Darlene Superville",
      "description": "President Donald Trump has signed an executive order requiring the Justice Department to investigate instances of flag burning despite a 1989 U.S. Supreme Court ruling that such activity is legitimate political expression protected by the Constitution. It was among several crime-related orders the Republican president signed Monday. The executive order says that flag burning done in a way that incites violence isn't protected by the Constitution. The order calls on the attorney general to prioritize enforcement “to the fullest extent possible” of criminal and civil laws against flag burning that cause harm unrelated to the First Amendment.",
      "publishedAt": "2025-08-25T17:08:39Z",
      "title": "Trump moves to ban flag burning",
      "url": "https://apnews.com/article/trump-executive-order-flag-burning-4628d588350db4f6baf10ae1d91f49c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/c15a29f/2147483647/strip/true/crop/2253x1267+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fa2%2Fbd0ce70c8c16065daa518f775dae%2F0ce45a5fbc4f4034b8f8347399f62240"
    },
    {
      "author": "Gabriela Aoun Angueira",
      "description": "More than 180 current and former FEMA employees have published a letter warning of potential disaster due to cuts in the agency. The letter coincides with the 20th anniversary of Hurricane Katrina, highlighting concerns about management and capacity at FEMA. It warns that current practices echo conditions the Post-Katrina Emergency Management Reform Act aimed to prevent. The letter criticizes policies like expenditure approval and reassignment of staff to ICE. It calls for FEMA to be an independent Cabinet-level agency. Thirty-five signatories included their names, while 141 remained anonymous due to fear of suppression.",
      "publishedAt": "2025-08-25T15:15:15Z",
      "title": "FEMA staff calls out Trump cuts in public letter of dissent",
      "url": "https://apnews.com/article/fema-letter-kristi-noem-disasters-836712f383a8b7d393c5ebf0f80143cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ed1385/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F9d%2F6d528cc872f9dfe6031193f5a727%2Fd268db7921d44b14b7f39179d348b28b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}