{
  "articles": [
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Pagers used by hundreds of members of the militant group Hezbollah exploded near simultaneously in Lebanon and Syria on Tuesday, killing at least nine people – including an 8-year-old girl -- and wounding several thousand, officials said.",
      "publishedAt": "2024-09-17T13:55:58Z",
      "title": "Hezbollah hit by a wave of exploding pagers in Lebanon and Syria. At least 9 dead, hundreds injured",
      "url": "https://apnews.com/8893a09816410959b6fe94aec124461b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a8b157d7df4cde80ce1c52262abc48/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — Florida law enforcement officials will launch their own criminal investigation into the apparent assassination attempt on former President Donald Trump that will run parallel to the federal probe, Gov.",
      "publishedAt": "2024-09-17T13:40:11Z",
      "title": "Florida will launch criminal probe into apparent assassination attempt of Trump, governor says",
      "url": "https://apnews.com/f0852cfc0dcb3d66d3d051838e63276c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e43597258abb44ccaec0a20e2679a364/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Presidential election campaigning revved back up Tuesday, with Donald Trump heading to Michigan and Vice President Kamala Harris answering questions at a forum for Black journalists in Pennsylvania — all while authorities investigate the second apparent assassination attempt against Trump that's roiled the race.",
      "publishedAt": "2024-09-17T14:17:45Z",
      "title": "Trump and Harris resume campaigning after second apparent assassination attempt",
      "url": "https://apnews.com/400c592c567d330d995f8dd6633dc782",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77254701329a4d97b5bb0a63128b0d22/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER, MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Sean “Diddy” Combs presided over a sordid empire of sexual crimes, coercing and abusing women for years, threatening them to keep them in line and enlisting a cast of aides to cover it up, according to an indictment unsealed Tuesday.",
      "publishedAt": "2024-09-17T11:01:56Z",
      "title": "Sean 'Diddy' Combs has been indicted on sex trafficking and racketeering charges",
      "url": "https://apnews.com/5d570cab4625ca5f9dd16dfd7df4437c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88ea78839914bf5a7cc2957349d3f34/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson will move ahead with a temporary spending bill that would prevent a partial government shutdown when the new budget year begins on Oct. 1, despite the headwinds that prompted him to pull the bill from consideration last week.",
      "publishedAt": "2024-09-17T16:11:53Z",
      "title": "Speaker Johnson sets House vote on government funding bill after a one-week postponement",
      "url": "https://apnews.com/9421630c6eea06147e1187ac8f34a7df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cc5d8831bc84a4daddfe3b9166a6239/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "Parts of southeastern North Carolina were still underwater Tuesday after a storm that wasn't quite organized enough to get a name dropped historic amounts of rain on an area that has suffered floods of a lifetime at least four other times in the past 25 years.",
      "publishedAt": "2024-09-17T15:50:31Z",
      "title": "North Carolina's coast has been deluged by the fifth historic flood in 25 years",
      "url": "https://apnews.com/aa8bab9dd77613eef76398da6660895f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a0ab5f973094b0383bf615650fe1909/1536.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "AVIGNON, France (AP) — A 71-year-old French man admitted in court Tuesday that for nearly a decade, he repeatedly drugged his unwitting wife and invited dozens of men to rape her while she lay unconscious in their bed.",
      "publishedAt": "2024-09-17T08:09:28Z",
      "title": "A French man admits in court to drugging his wife so that he and dozens of men could rape her",
      "url": "https://apnews.com/943400b83a8b111bcd42a0fb23a1cfda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98e12baa2b7c4431ac11707d92814a4a/1920.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — A bipartisan group of lawmakers introduced legislation Tuesday that would prohibit political campaigns and outside political groups from using artificial intelligence to misrepresent the views of their rivals by pretending to be them.",
      "publishedAt": "2024-09-17T11:01:47Z",
      "title": "Congress is gridlocked. These members are convinced AI legislation could break through",
      "url": "https://apnews.com/6ef47dcc0e71470957e29767ed5422b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81a8f59f1f994167bdece8f47f30f84d/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "A key employee who labeled a doomed experimental submersible unsafe prior to its last, fatal voyage testified Tuesday that he frequently clashed with the company’s co-founder and felt the company was committed only to making money.",
      "publishedAt": "2024-09-17T05:02:12Z",
      "title": "A key employee who called the Titan unsafe testifies the company only wanted to make money",
      "url": "https://apnews.com/3e698a31c32d753b2d34e28900f65bdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90640a96ac354b3abf56a8467c50a02e/1920.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Instagram is making teen accounts private by default as it tries to make the platform safer for children amid a growing backlash against how social media affects young people's lives.",
      "publishedAt": "2024-09-17T12:16:24Z",
      "title": "Instagram makes teen accounts private as pressure mounts on the app to protect children",
      "url": "https://apnews.com/425a05cc37f81b6ff2b7439d3884c54a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/267902d7e3154f7fb54dfbd83ca40755/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}