{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The U.N. agency for Palestinian refugees said Sunday it is halting aid deliveries through the main cargo crossing into the war-ravaged Gaza Strip because of the threat of armed gangs who have looted convoys.",
      "publishedAt": "2024-12-01T07:41:27Z",
      "title": "UN halts aid shipments through Gaza's main crossing after looting. It blames the crisis on Israel",
      "url": "https://apnews.com/6118019c9bc11204026b686206be8f6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5c5877945043ec82f37f2e6048e512/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and FADI TAWIL",
      "description": "TYRE, Lebanon (AP) — Israeli jets Sunday launched an airstrike over a southern Lebanese border village, while troops shelled other border towns and villages still under Israeli control, Lebanon's state-run National News Agency reported.",
      "publishedAt": "2024-12-01T15:41:45Z",
      "title": "Israeli strikes hit southern Lebanon, but tense ceasefire holds",
      "url": "https://apnews.com/ae002af23c7ec9e19a0cea08fecc9f62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c33cc1c29efa4943a5e82f640fad3463/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep, Citroën and Ram, amid an ongoing struggle with slumping sales.",
      "publishedAt": "2024-12-01T20:14:41Z",
      "title": "Stellantis CEO Carlos Tavares steps down as carmaker continues struggle with slumping sales",
      "url": "https://apnews.com/df052376ff0ace08fd94a7821cb73317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/454cf38d6b894e1da1f769b27826d237/3000.jpeg"
    },
    {
      "author": "CARA ANNA and CAROLYN THOMPSON",
      "description": "LOWVILLE, N.Y. (AP) — Heavy snowfall and numbing temperatures kept parts of the U.S. in a deep freeze Sunday as the Thanksgiving holiday weekend drew to a close.",
      "publishedAt": "2024-12-01T05:45:28Z",
      "title": "Heavy snow keeps parts of the US in a deep freeze as holiday weekend comes to a close",
      "url": "https://apnews.com/e38431108b6441a859f9664388b321d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aafe7fd2b44647ae9a31d50544e091d3/1920.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canada's ambassador to the United States said Sunday that Prime Minister Justin Trudeau was successful in getting President-elect Donald Trump and key Cabinet nominees to understand that lumping Canada in with Mexico over the flow of drugs and migrants into the U.S.",
      "publishedAt": "2024-12-01T20:17:18Z",
      "title": "Canada's ambassador says Trudeau told Trump the Canadian border can't be compared to Mexico's",
      "url": "https://apnews.com/42878c1cac442fc7a51c36fbc5fc78a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e93a8bd806842b99b6db67f71292f14/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Republicans will control the White House and both houses of Congress come January. But President-elect Donald Trump's intent to nominate loyalists to fill key Cabinet posts has set up a possible confrontation with the Senate, which has the constitutional responsibility for “advice and consent” on presidential nominees.",
      "publishedAt": "2024-12-01T12:42:07Z",
      "title": "Recess appointments could put Trump at odds with conservatives on the Supreme Court",
      "url": "https://apnews.com/55004d00cfa7d4b4832e9701cad48a06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81bc1ad668bc4f4fb35189640b9c441b/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump’s stunning announcement that he will nominate Kash Patel as FBI director sets the stage for a fresh round of turbulence at a law enforcement agency tasked with protecting the homeland and investigating federal crimes.",
      "publishedAt": "2024-12-01T05:03:41Z",
      "title": "Trump says he'll nominate Kash Patel as FBI director to remake the agency. Here's what happens next",
      "url": "https://apnews.com/6b2678baba229362d25b468ed2f61f87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/127e79ff6d864cdbadfdc611a3c13b5c/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Shopping on Temu can feel like playing an arcade game. Instead of using a joystick-controlled claw to grab a toy, visitors to the online marketplace maneuver their computer mouses or cellphone screens to browse colorful gadgets, accessories and trinkets with prices that look too good to refuse.",
      "publishedAt": "2024-12-01T12:32:03Z",
      "title": "Shopping on Shein and Temu for holiday gifts? You're not the only one.",
      "url": "https://apnews.com/2d551895e123dedd49fa35ec58d07634",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e403d76734f46bbb02e1b2a88369ee3/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The Syrian military rushed reinforcements to the northwest and launched airstrikes Sunday in an attempt to push back insurgents who seized the country’s largest city of Aleppo, as Iran pledged to help the government counter the surprise offensive.",
      "publishedAt": "2024-12-01T10:20:09Z",
      "title": "Syria launches counterattacks in an attempt to halt insurgency, as Iran's top diplomat meets Assad",
      "url": "https://apnews.com/a8d7ddd45d3cb6b7aa943957b2ac6d9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/617d1fe8ba804ae4a5be135a9b37780d/3000.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "Ohio State, Miami and Clemson plunged in The Associated Press Top 25 college football poll Sunday following their losses during a wild weekend, eight of the top 10 teams moved up one spot and Oregon was No.",
      "publishedAt": "2024-12-01T19:03:45Z",
      "title": "AP Top 25: Ohio St, Miami, Clemson drop; Texas, Penn St, Notre Dame, Georgia in line behind Oregon",
      "url": "https://apnews.com/13fcda111d7bf58edfa8cf214c0938ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0f77ab1e9b14453802fc19de1f0ff40/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}