{
  "articles": [
    {
      "author": "WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An agreement for a four-day cease-fire in Gaza and the release of dozens of hostages held by militants and Palestinians imprisoned by Israel appeared to have hit a last-minute snag.",
      "publishedAt": "2023-11-23T06:50:08Z",
      "title": "Temporary cease-fire in Gaza and hostage release now expected to start Friday",
      "url": "https://apnews.com/fae556c7bdcc5d120b7617d72238b26e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f93c32b890c419d90e7d570e5f8a34c/1920.jpeg"
    },
    {
      "author": "VICTOR CAIVANO",
      "description": "GAZA CITY, Gaza Strip (AP) — The Israeli military on Wednesday unveiled what it claimed was a Hamas military facility under Gaza's largest hospital, showing what appeared to be a subterranean dormitory to a group of foreign journalists who were given a rare glimpse inside the besieged enclave.",
      "publishedAt": "2023-11-23T00:42:03Z",
      "title": "Israel unveils what it claims is a major Hamas militant hideout beneath Gaza City's Shifa Hospital",
      "url": "https://apnews.com/c71ebee136e018fd5a3572a54040f73e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44d5859dba26462aa42cec3a029506fe/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and RAF CASERT",
      "description": "THE HAGUE, Netherlands (AP) — The party of anti-Islam populist Geert Wilders won a huge general election victory in the Netherlands, according to a nearly complete vote count early Thursday, that showed a stunning lurch to the far right for a nation once famed as a beacon of tolerance.",
      "publishedAt": "2023-11-23T09:02:41Z",
      "title": "In political shift to the far right, anti-Islam populist Geert Wilders wins big in Dutch elections",
      "url": "https://apnews.com/9ed5752f49315517876f1646d4c2d4f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/157105fc800d4ce0a49ce42dde00a22e/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Beloved characters like Snoopy and SpongeBob SquarePants will take to the skies above New York City Thursday while bands march along the streets below as the annual Macy’s Thanksgiving Day Parade ushers in the holiday season.",
      "publishedAt": "2023-11-23T05:08:06Z",
      "title": "Balloons, bands, celebrities and Santa: Macy’s Thanksgiving Day Parade kicks off",
      "url": "https://apnews.com/7387ef24a7f51b1f1ed902997fd49a4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/639e9075367a4ce0be7725465248cfd8/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "The late crush of holiday travelers picked up steam Wednesday, with about 2.7 million people expected to board flights and millions more planning to drive or take the train to Thanksgiving celebrations.",
      "publishedAt": "2023-11-22T05:06:39Z",
      "title": "Record Thanksgiving travel rush off to a smooth start despite snowy forecast",
      "url": "https://apnews.com/7858946c4d16fdf4291a66d82ea91ac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5aad664ce4c43068bd9795a6e5c4c37/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON, JOHN WAWROW and JENNIFER PELTZ",
      "description": "NIAGARA FALLS, N.Y. (AP) — A vehicle speeding toward a U.S.-Canada bridge from the American side crashed and exploded at a checkpoint in Niagara Falls on Wednesday, killing two people and prompting the closing of multiple border crossings for hours.",
      "publishedAt": "2023-11-22T18:36:22Z",
      "title": "Fiery crash kills 2 at Niagara Falls' Rainbow border bridge. Officials say no sign of terrorism",
      "url": "https://apnews.com/4e8f9bfeabd94a0d8aa4d96eccd179b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91185cc4c6614251bc8d0a318c6b78df/1920.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina ’s President-elect Javier Milei has called for the wholesale reinvention of the government but he has precious little time.",
      "publishedAt": "2023-11-22T21:57:29Z",
      "title": "Argentina's President-elect is racing against the clock to remake the government",
      "url": "https://apnews.com/77df30d1ae36465ee68f755a541cd837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/128564e38d884a0b9c1f315db7e0526e/2062.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Just minutes after President John F. Kennedy was fatally shot as his motorcade rolled through downtown Dallas, Associated Press reporter Peggy Simpson rushed to the scene and immediately attached herself to the police officers who had converged on the building from which a sniper's bullets had been fired.",
      "publishedAt": "2023-11-22T05:04:31Z",
      "title": "JFK assassination remembered 60 years later by surviving witnesses to history, including AP reporter",
      "url": "https://apnews.com/822f26b3a850508fb1e6530b86ebf809",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2984e3d46adc425ba6f469e6d66a2306/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — It's been quite a week for ChatGPT-maker OpenAI — and co-founder Sam Altman.Altman, who helped start OpenAI as a nonprofit research lab back in 2015, was removed as CEO Friday in a sudden and mostly unexplained exit that stunned the industry.",
      "publishedAt": "2023-11-22T21:05:00Z",
      "title": "What does Sam Altman's firing — and quick reinstatement — mean for the future of AI?",
      "url": "https://apnews.com/51ae332acc18a41b51df5a39efa146d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b764f7c94dd64d279b23510acb603bea/1920.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "The oil and gas sector, one of the major emitters of planet-warming gases, will need a rapid and substantial overhaul for the world to avoid even worse extreme weather events fueled by human-caused climate change, according to a report released Thursday.",
      "publishedAt": "2023-11-23T05:06:57Z",
      "title": "To save the climate, the oil and gas sector must slash planet-warming operations, report says",
      "url": "https://apnews.com/746bd9895e84a47e86855714408f5de0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86883736661e4ed7ba02376ade5a724c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}