{
  "articles": [
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "JERUSALEM (AP) — International mediators are hoping to kickstart stalled cease-fire negotiations between Israel and Hamas with a new round of talks meant to finally clinch a deal between the sides. But the chances of a breakthrough appear slim.",
      "publishedAt": "2024-08-14T04:44:48Z",
      "title": "A new round of Gaza cease-fire talks is starting. Why is a deal so elusive?",
      "url": "https://apnews.com/f43a53d4a2ee75ef320ef385ee9e659f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/977c2cb7ee5e4eb6a87e1ed5b7f65e5d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian health officials say Israeli strikes across the Gaza Strip overnight and into Wednesday killed at least 17 people, including five children and their parents.The strikes came on the eve of new talks aimed at reaching a cease-fire in the 10-month war.",
      "publishedAt": "2024-08-14T07:49:49Z",
      "title": "Israel-Hamas war latest: Israeli strikes kill at least 17 in Gaza overnight, Palestinians say",
      "url": "https://apnews.com/050bd6ae0fe1d4694c351ae67e6c5d2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4032516396504d0eac074cf085b7b3c8/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has a perceived advantage over former President Donald Trump on several leadership qualities such as honesty, a poll from The Associated Press-NORC Center for Public Affairs Research finds, although Americans are slightly more likely to trust Trump on the economy and immigration.",
      "publishedAt": "2024-08-14T04:01:58Z",
      "title": "Americans give Harris an advantage over Trump on honesty and discipline, an AP-NORC poll finds",
      "url": "https://apnews.com/f025463df08beacbaa0c51e7bbb7eda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cccd65de662449db96ed4bb00d765e9f/3000.jpeg"
    },
    {
      "author": "DAN MERICA, NICHOLAS RICCARDI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden, watching tens of thousands of migrants from Central America reach the U.S.-Mexico border just a few months into his administration, tapped his second-in-command to help address the influx — a decision that has exposed Vice President Kamala Harris to one of her biggest political liabilities.",
      "publishedAt": "2024-08-14T04:13:32Z",
      "title": "Presented with rise in border crossings, Harris chose a long-term approach to the problem",
      "url": "https://apnews.com/46d23ad3b0e8a1780ac0a6a306120b3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/911e244df70841ba9ea2bc91b36677f2/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Ukrainian forces pushed on with their major cross-border incursion into Russia's Kursk region for a second week Wednesday, claiming to have taken more ground, captured more Russian prisoners and destroyed a jet bomber.",
      "publishedAt": "2024-08-14T10:14:28Z",
      "title": "Ukraine claims more advances, prisoners taken as it presses an incursion into Russia",
      "url": "https://apnews.com/6f65e2d6b295e898f4a59118a2c0c735",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86b0789c70e4435390aba2fbccaad088/2443.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — The Taliban celebrated the third anniversary of its return to power at a former U.S.",
      "publishedAt": "2024-08-14T08:40:22Z",
      "title": "The Taliban are celebrating 3 years in power, but they’re not talking about Afghans",
      "url": "https://apnews.com/68f5bc4a3cdd9d07dcecd5d6d391df5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/494e98bb86014e26a6972f55fd18812d/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ASHEVILLE, N.C. (AP) — Donald Trump will have another opportunity Wednesday to recalibrate his presidential comeback bid, this time with a rally and speech in North Carolina that his campaign is billing as a significant economic address.",
      "publishedAt": "2024-08-14T04:08:31Z",
      "title": "Donald Trump is going to North Carolina for an economic speech. Can he stick to a clear message?",
      "url": "https://apnews.com/bc81b98a425e46c32065c02650b2b44c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55ae1678a4a94b9ba8d6d97037aee21e/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — French prosecutors opened an investigation into an online harassment complaint made by Olympic boxing champion Imane Khelif after a rain of criticism and false claims about her sex during the Summer Games, the Paris prosecutor's office said Monday.",
      "publishedAt": "2024-08-14T10:09:20Z",
      "title": "French prosecutors investigate gender-based cyber harassment of Algerian Olympic champ Imane Khelif",
      "url": "https://apnews.com/cfc710d52ec0830936b0b3b0758fbf0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63e5b271a00045ae85f13c337b8c2881/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Ernesto was poised to become a hurricane shortly after brushing past Puerto Rico late Tuesday as officials closed schools, opened shelters and moved dozens of the U.S.",
      "publishedAt": "2024-08-13T11:38:22Z",
      "title": "A strengthening Ernesto is poised to become a hurricane after brushing past Puerto Rico",
      "url": "https://apnews.com/15ff3b85e54780fa89aa51087a87d5dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37ae85e91f604e799f8c08e8a5e29b29/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — If the Federal Reserve needs any further evidence that the worst price spike in four decades is steadily easing, it's likely to come Wednesday, when the government is expected to report that inflation cooled further last month.",
      "publishedAt": "2024-08-14T04:01:20Z",
      "title": "Inflation likely stayed low last month as Federal Reserve edges closer to cutting rates",
      "url": "https://apnews.com/f8de2672173407d3a126cc13493fed85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f7bffd6f1be4f55b8b54a1d223b3405/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}