{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Aggrieved and defiant, former President Donald Trump sat through hours of sometimes testy opening statements Monday in a fraud lawsuit that could cost him control of Trump Tower and other prized properties.",
      "publishedAt": "2023-10-02T02:45:44Z",
      "title": "A riled Trump sounds off outside the New York fraud trial that accuses him of lying about wealth",
      "url": "https://apnews.com/eb98c99fe918da139b0d8b6347211afe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ea5dc3750f40178e5ebaf2d7240d78/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — “How would you be different as speaker, compared to Mr. Boehner?” a reporter asked then-House Majority Leader Kevin McCarthy in September 2015 as the California Republican pursued, and eventually gave up, his first attempt at the speakership.",
      "publishedAt": "2023-10-02T04:02:06Z",
      "title": "Rep. Matt Gaetz is threatening to oust Speaker Kevin McCarthy. It won't be easy",
      "url": "https://apnews.com/eba874f3a76ab8ebe03236514d981810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/991b46eedbd44b82ac1ec9fd84ce6bbc/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — The European Union’s foreign policy chief on Monday led a delegation of top diplomats on an unannounced visit to Kyiv and dismissed concerns about political tension in the bloc over its long-term support for Ukraine's fight against Russia.",
      "publishedAt": "2023-10-02T08:16:40Z",
      "title": "Europe Union's top diplomat dismisses concern about bloc's long-term support for Ukraine",
      "url": "https://apnews.com/9fe7150d40e1944ec3c08b04b99df060",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/562e14d653904ffe997d5cacb1890205/3000.jpeg"
    },
    {
      "author": "DAVID KEYTON, MIKE CORDER and MADDIE BURAKOFF",
      "description": "STOCKHOLM (AP) — Two scientists won the Nobel Prize in medicine on Monday for discoveries that enabled the creation of mRNA vaccines against COVID-19 that were critical in slowing the pandemic — technology that's also being studied to fight cancer and other diseases.",
      "publishedAt": "2023-10-02T07:06:36Z",
      "title": "Karikó and Weissman win Nobel Prize in medicine for work that enabled mRNA vaccines against COVID-19",
      "url": "https://apnews.com/71306bd18785477f3a85a69caa6e09c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5e2f617fdbe4a51bac507cdc43a16ec/1920.jpeg"
    },
    {
      "author": "ALFREDO PEÑA",
      "description": "CIUDAD MADERO, Mexico (AP) — The collapse of a church roof during a service in northern Mexico has killed at least 10 people and injured 60, and searchers said Monday that no further people were believed to be trapped in the wreckage.",
      "publishedAt": "2023-10-01T22:54:47Z",
      "title": "10 people are dead after Mexico church roof collapses. No more people believed buried in rubble",
      "url": "https://apnews.com/fa4f4a42499533ee8d3517f349ae5d14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d1321f138d4ee78dd1f0843eafefef/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court opened its new term Monday with a case about prison terms for drug dealers and rejections of hundreds of appeals, including one from an attorney who pushed a plan to keep former President Donald Trump in power.",
      "publishedAt": "2023-10-02T04:03:22Z",
      "title": "The Supreme Court opens its new term with a case about prison terms for drug dealers",
      "url": "https://apnews.com/e6bcb8eb37d6a2fdd286dbc3c1799441",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd327b195d4f427e9371e8f5684821c7/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and TRISHA THOMAS",
      "description": "VATICAN CITY (AP) — A few years ago, Pope Francis told the head of the main Vatican-backed Catholic women's organization to be “brave” in pushing for change for women in the Catholic Church. Maria Lia Zervino took his advice and in 2021 wrote Francis a letter, then made it public, saying flat out that the Catholic Church owed a big debt to half of humanity and that women deserved to be at the table where church decisions are made, not as mere “ornaments” but as protagonists.",
      "publishedAt": "2023-10-02T04:07:20Z",
      "title": "Women's voices and votes loom large as pope is set to open a Vatican meeting on church's future",
      "url": "https://apnews.com/23a8114eea28c94622d4143f029987d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a227f48dbdd46d292b1d9a527e3109a/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY, JOCELYN GECKER and EMILY SWANSON",
      "description": "WASHINGTON (AP) — Americans view college campuses as far friendlier to liberals than to conservatives when it comes to free speech, with adults across the political spectrum seeing less tolerance for those on the right, according to a new poll.",
      "publishedAt": "2023-10-02T04:14:12Z",
      "title": "Few Americans say conservatives can speak freely on college campuses, an AP-NORC/UChicago poll shows",
      "url": "https://apnews.com/0b2811fb35c9c6288b7517da7c9affd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96adaa995b4d4d3c92ae0909016cb558/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. health officials plan to endorse a common antibiotic as a morning-after pill that gay and bisexual men can use to try to avoid some increasingly common sexually transmitted diseases.",
      "publishedAt": "2023-10-02T13:13:47Z",
      "title": "US health officials propose using a cheap antibiotic as a 'morning-after pill' against STDs",
      "url": "https://apnews.com/1de6323a834339e79cda1e124a455964",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8121208a14f4f2cb1adb64348ce2040/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "DENVER (AP) — When Kirsten Hawkes, a one-time elite fencer, reached out to her childhood coach for advice about starting her own fencing club, their meeting turned awkward right away. It began, she said, with an unwanted kiss on the lips when the two met at a bar during a fencing tournament in Minneapolis last October.",
      "publishedAt": "2023-10-02T04:02:10Z",
      "title": "Forced kiss claim leads to 'helplessness' for accuser who turned to Olympics abuse-fighting agency",
      "url": "https://apnews.com/0770975926e77c1c0aa681c71bc13704",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6874a16611c4ae69c2f639fbaf6872f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}