{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are poised Friday to hold negotiations in Oman at least over Tehran’s nuclear program. The talks follow a chaotic week that initially saw plans for regional countries to take part in talks in Turkey. Previous rounds of meetings turned to ash following Israel’s launch of a 12-day war against Iran back in June. The U.S. bombed Iranian nuclear sites during that war. Meanwhile, nationwide protests have shaken Iran's theocracy. It responded with a bloody crackdown that killed thousands and reportedly saw tens of thousands arrested. President Donald Trump has threatened to strike the country in the time since, spurring the talks.",
      "publishedAt": "2026-02-06T02:59:03Z",
      "title": "Iran and US set for talks in Oman over nuclear program",
      "url": "https://apnews.com/article/iran-us-protests-nuclear-negotiations-oman-muscat-32d621b98f7a3a68831f885d262bb70e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a239a1/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Ffc%2F656f9a9b6faed54cc26b99bc5926%2F265e9954c2334a6c863434b160aa85b2"
    },
    {
      "author": "Eric Tucker",
      "description": "Attorney General Pam Bondi says a key participant in the 2012 attack on a U.S. compound in Benghazi, Libya, that killed four Americans is in custody. Bondi says the man landed Friday morning at Joint Base Andrews in Maryland. The attack killed Americans including Ambassador Chris Stevens and immediately emerged as a divisive political issue. Republicans challenged President Barack Obama and Secretary of State Hillary Clinton on security at the facility, the military response to the violence and the Democratic administration’s changing narrative about who was responsible. A Libyan militant suspected of being a mastermind of the attacks was convicted in the U.S. and is serving a prison sentence.",
      "publishedAt": "2026-02-06T15:02:47Z",
      "title": "Key participant in 2012 Benghazi attack is in custody, Bondi says",
      "url": "https://apnews.com/article/fbi-benghazi-justice-department-a0eadc00e01e892e6dba827ccfadbae0",
      "urlToImage": "https://dims.apnews.com/dims4/default/ace5296/2147483647/strip/true/crop/2000x1333+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F95%2F666a53e7b891ebd420fe0622236e%2F114241de7ed9450b8c857fc0c416c150"
    },
    {
      "author": null,
      "description": "A deputy chief of Russian military intelligence has been shot and wounded. Officials say Lt. Gen. Vladimir Alekseyev was attacked by an unidentified assailant in Moscow. The incident happened on Friday. Investigative Committee spokesperson Svetlana Petrenko says Alekseyev was hospitalized. She did not comment on who might be behind the attack. Alekseyev has served as the first deputy head of Russia’s military intelligence since 2011.",
      "publishedAt": "2026-02-06T08:15:09Z",
      "title": "A deputy chief of Russian military intelligence was shot and wounded in Moscow",
      "url": "https://apnews.com/article/russia-military-intelligence-officer-shot-moscow-82f1878b3ad7236b1d29279b522c2a2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "UK police search two properties linked to Peter Mandelson as part of Epstein probe",
      "url": "https://apnews.com/article/peter-mandelson-jeffrey-epstein-investigation-f2f33eae657a3d3e4e1937eb7ae657f2",
      "urlToImage": null
    },
    {
      "author": "Bianca Vázquez Toness",
      "description": "For many immigrant families in Minnesota, sending a child to school each day requires faith that one of the thousands of federal immigration officers deployed around the state won’t detain them. Thousands of children are staying home, often for lack of door-to-door transportation — or simply trust that they'll make it to school. For some families, the fear has turned into reality. Many parents and at least some children have been detained. Schools, parents and community groups have mobilized to help students get to class so they can learn, socialize and have consistent access to two meals.",
      "publishedAt": "2026-02-06T05:01:16Z",
      "title": "In Minnesota immigration crackdown, attending school is act of faith",
      "url": "https://apnews.com/article/minnesota-school-children-immigration-enforcement-f5ae3c38217339d9e6630ee264b5a801",
      "urlToImage": "https://dims.apnews.com/dims4/default/d26c7ae/2147483647/strip/true/crop/5416x3609+0+130/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F28%2F67b6245f0ad7a7407baa6ba38df8%2F40e43b9c768d4cf1a2ee166f86a0f200"
    },
    {
      "author": "Michelle R. Smith/the Guardian, Ali Swenson/ap, The Guardian, Associated Press",
      "description": "Documents obtained by The Guardian and The Associated Press undermine Robert F. Kennedy Jr.'s testimony during his Senate confirmation hearings that the 2019 trip he took to Samoa before a devastating measles outbreak had “nothing to do with vaccines.” Emails sent by staffers at the U.S. Embassy and the United Nations include contemporaneous accounts suggesting Kennedy's concerns about vaccine safety motivated the visit. Samoan officials later said Kennedy’s trip bolstered the credibility of anti-vaccine activists ahead of the measles outbreak, which killed dozens of people. Kennedy has since said his “purpose” for going there was not related to vaccines. Kennedy was sworn in as U.S. health secretary last February.",
      "publishedAt": "2026-02-06T11:54:48Z",
      "title": "Emails reveal details about RFK Jr.'s trip before measles outbreak",
      "url": "https://apnews.com/article/rfk-measles-outbreak-samoa-emails-e04686f052e8c78b5a52be1e4fbcf62f",
      "urlToImage": "https://dims.apnews.com/dims4/default/94dabca/2147483647/strip/true/crop/6000x3998+0+345/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F8e%2Ffd1b9c0658b1587f1728a7b39674%2F900e216670a9456da4f1b9c4ecc88f8e"
    },
    {
      "author": "Claire Galofaro, Juliet Linderman",
      "description": "Thousands of pages of once-secret court documents show how federal officials and a Virginia court helped an American Marine adopt an Afghan war orphan, in defiance of the U.S. government’s official policy to unite the child with her family. The Associated Press fought for three years for access to the documents, which reveal how the country’s fractured bureaucracy enabled Marine Joshua Mast and his wife, Stephanie, to adopt the child who was halfway around the globe, being raised by a couple the Afghan government decided were her family. The records show the Virginia judge who granted the adoption skipped critical legal safeguards and that some federal employees helped Mast take the child, even as others in their own agencies were trying to keep him away from her.",
      "publishedAt": "2026-02-06T12:04:47Z",
      "title": "US officials helped marine adopt an Afghan war orphan despite government objections",
      "url": "https://apnews.com/article/afghan-war-orphan-adoption-government-documents-marine-ef37c65e8d5c0af015b10c71a4c46591",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd0baf5/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F57%2Fcfa4885d75bd23bd85ccb18a7d35%2Fc8afeeeef48c44c78f81ccceefbe8327"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistani officials say a suicide bomber targeted a Shiite mosque on the outskirts of Islamabad during Friday prayers, killing 31 people and wounding at least 169 others. It was a rare attack in the capital of Pakistan as its Western-allied government struggles to rein in a surge in militant attacks across the country. Some of the wounded in the attack on the sprawling mosque of Khadija Al-Kubra were reported to be in critical condition. Television footage and social media images showed police and residents transporting the wounded to nearby hospitals. No group immediately claimed responsibility for the attack. Militant groups across Pakistan often target security forces and civilians.",
      "publishedAt": "2026-02-06T10:10:10Z",
      "title": "Bombing rocks Shiite mosque on Islamabad's outskirts, killing at least 31",
      "url": "https://apnews.com/article/pakistan-islamabad-shiite-mosque-blast-8f0b7b8a8783db37644d88610512c9af",
      "urlToImage": "https://dims.apnews.com/dims4/default/12716ac/2147483647/strip/true/crop/6685x4454+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F68%2F401b9cad8c61d1774c1d7997e113%2Fbb1a9db59b9642bdbab5b627a40dc597"
    },
    {
      "author": "Jesse Bedayn, Matthew Brown",
      "description": "A Colorado funeral home owner who stashed 189 decomposing bodies and gave families fake ashes is set to be sentenced. Jon Hallford, who owned Return to Nature Funeral Home with his then-wife Carie, pleaded guilty to nearly 200 counts of corpse abuse. Investigators discovered the bodies in 2023 after reports of a stench. Families of the deceased were devastated to learn the ashes they received were not their loved ones. Jon Hallford faces between 30 and 50 years in prison on Friday. In a related case, the Hallfords admitted to defrauding the federal government of nearly $900,000 in pandemic aid.",
      "publishedAt": "2026-02-06T05:02:26Z",
      "title": "Colorado funeral home owner faces sentencing in corpse abuse case",
      "url": "https://apnews.com/article/funeral-home-decomposing-bodies-sentencing-94d5253b78791102b9eaa7dbe810d448",
      "urlToImage": "https://dims.apnews.com/dims4/default/3f57b19/2147483647/strip/true/crop/7716x5141+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F47%2F218f10a71e70e94e6c84d6e7bbbf%2F6f97a37e7c7f43baa43f66c778fec555"
    },
    {
      "author": "Chan Ho-him",
      "description": "World shares are mixed after Wall Street extended losses driven by heavy selling of technology stocks. European benchmarks were little changed and U.S. futures rose. In Asian trading early Friday, Tokyo's benchmark Nikkei 225 index gained 0.8% as tech shares in Japan bounced back. The price of bitcoin rebounded from its biggest losses, trading about 7% lower. Oil prices were higher, while gold prices rose. On Thursday, the S&P 500 was down 1.2%, the Dow Jones Industrial Average dropped 1.2% and the Nasdaq composite fell 1.6%.",
      "publishedAt": "2026-02-06T04:31:10Z",
      "title": "World shares are mixed as bitcoin bounces",
      "url": "https://apnews.com/article/stocks-markets-trump-gold-tech-199d4d65b7596d7c34f3a5d9a77c2326",
      "urlToImage": "https://dims.apnews.com/dims4/default/f156a28/2147483647/strip/true/crop/7685x5121+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F72%2Fb997d5f5fa362dd98b89d0c2f7d5%2Ff08d0ce1368f4d838f2a2caad831a37d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}