{
  "articles": [
    {
      "author": "MELANIE LIDMAN, SAMY MAGDY",
      "description": "Hamas says it will delay the further release of hostages in the Gaza Strip after accusing Israel of violating a fragile ceasefire that now faces its most serious crisis since it began three weeks ago. Israel and Hamas are in the midst of a six-week ceasefire during which Hamas has committed to freeing dozens of the hostages captured in its Oct. 7, 2023, attack in exchange for nearly 2,000 Palestinian prisoners. Three more Israeli hostages had been scheduled for release on Saturday, in exchange for hundreds of Palestinian prisoners. In a bid to improve relations with the U.S., the Palestinian president has ended a controversial system that paid stipends to the families of Palestinian prisoners, including those convicted of deadly attacks against Israel.",
      "publishedAt": "2025-02-10T16:21:12Z",
      "title": "Hamas says it will delay the release of more hostages, putting Gaza ceasefire at risk",
      "url": "https://apnews.com/article/hamas-hostage-release-delay-ceasefire-violations-76d6fd9162160f9554fec37041342714",
      "urlToImage": "https://dims.apnews.com/dims4/default/41cf47a/2147483647/strip/true/crop/8103x4558+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2Fc0%2F87084198f5c1eefa141aba0503c6%2F29c9558c54b641cea0bae3ce651d1498"
    },
    {
      "author": null,
      "description": "President Donald Trump says a precarious ceasefire agreement between Israel and Hamas should be canceled if Hamas doesn’t release all the remaining hostages it is holding in Gaza by midday on Saturday, warning if it doesn't happen, \"let hell break out.\"",
      "publishedAt": "2025-02-11T00:46:30Z",
      "title": "Trump warns 'all hell is going to break out' if Gaza hostages are not returned by Hamas",
      "url": "https://apnews.com/video/trump-warns-all-hell-is-going-to-break-out-if-gaza-hostages-are-not-returned-by-hamas-606656865a0349e8bfb6ccb0cccd505e",
      "urlToImage": "https://dims.apnews.com/dims4/default/54fc843/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2Fad%2F0eda2a7e4cdc8cb81256244c3de0%2Ftrumphamas.jpg"
    },
    {
      "author": "ZEKE MILLER, SAM MAGDY",
      "description": "President Donald Trump says that a precarious ceasefire agreement between Israel and Hamas should be canceled if Hamas doesn’t release all the remaining hostages it is holding in Gaza by midday on Saturday — though he also acknowledged that such a decision would be up to Israel. In comments to reporters after signing a series of executive orders, Trump said, “If they’re not here, all hell is going to break out” and said that he feared many scheduled for release are actually already dead. Those comments came after Trump suggested that Palestinians in Gaza would not have a right to return under his plan for U.S. “ownership” of the war-torn territory.",
      "publishedAt": "2025-02-10T16:12:05Z",
      "title": "Trump says ceasefire deal should be canceled if Hamas doesn’t release all hostages by Saturday",
      "url": "https://apnews.com/article/trump-gaza-jordan-egypt-fox-palestinians-be4c67e124f7b8c7d5ad95231fc625a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/f18dc25/2147483647/strip/true/crop/5438x3059+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2F49%2Fe5382fbe090f24b9158254089899%2F94eb614365074bf18d98bae8112c47c4"
    },
    {
      "author": "JON GAMBRELL",
      "description": "A brief protest by a performer at Kendrick Lamar’s Super Bowl halftime show unfurled a flag emblazoned with the words Sudan and Gaza, two wars in the Middle East that have killed tens of thousands of people. The New Orleans police said Monday the performer would face no charges. In the Gaza Strip, much of the territory has been obliterated in an Israeli offensive triggered by a Hamas-led attack in 2023 that killed 1,200 people and saw 250 taken hostage. The Israeli offensive has killed more than 47,000 Palestinians, according to local authorities. In Sudan, a civil war since April 2023 has killed more than 28,000 people. Other estimates suggest a far higher death toll.",
      "publishedAt": "2025-02-10T07:05:21Z",
      "title": "What's happening in the Gaza Strip and Sudan that sparked a protest at the Super Bowl halftime show?",
      "url": "https://apnews.com/article/super-bowl-protester-whats-happening-gaza-sudan-dd79957e52b06212044cae6d4ce9e87e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0a27c1e/2147483647/strip/true/crop/4333x2437+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fef%2Fe61c544c731dff0c8b51c53069be%2F9f56317ebd6246d7a28c18d0382e81dc"
    },
    {
      "author": "JAKE OFFENHARTZ, ALANNA DURKIN RICHER, ERIC TUCKER",
      "description": "A top official at the U.S. Department of Justice has ordered federal prosecutors to drop charges against New York Mayor Eric Adams and halt the ongoing investigation. The development comes after months of speculation that Trump would take steps to end the criminal case against Adams, who was accused of accepting bribes of free or discounted travel and illegal campaign contributions. Trump had hinted at the possibility of a pardon in December, telling reporters the mayor had been “treated pretty unfairly.” Adams had insisted he was innocent of any wrongdoing.",
      "publishedAt": "2025-02-10T23:55:17Z",
      "title": "Top Justice Department official orders prosecutors to drop charges against New York Mayor Eric Adams",
      "url": "https://apnews.com/article/eric-adams-indictment-109ef48bd49bc8adc1850709c99bf666",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "MEG KINNARD",
      "description": "Rep. Nancy Mace of South Carolina is raising allegations against a former fiancé and his business associates. In a nearly hour-long speech on the House floor, Mace accused her ex-fiancé of physically abusing her and recording sex acts with her and others without their consent. She said she also has evidence of him conspiring with business associates in acts of rape and sexual misconduct. The former fiancé, Patrick Bryant, categorically denied all the allegations. Mace said she was speaking out because South Carolina's top prosecutor didn’t take action. South Carolina Attorney General Alan Wilson's office called Mace's comments about the prosecutor’s conduct “categorically false.”",
      "publishedAt": "2025-02-11T02:24:41Z",
      "title": "Rep. Nancy Mace accuses ex-fiancé and associates of misconduct in speech on House floor",
      "url": "https://apnews.com/article/nancy-mace-south-carolina-7d831f415ae00d703e30fa6c701f18de",
      "urlToImage": "https://dims.apnews.com/dims4/default/20b4ee1/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc4%2F902606cfbebbb3c1d4790f6d3710%2F4825183fe3a44b7b8422b671de35d5d7"
    },
    {
      "author": "SEJAL GOVINDARAO, HALLIE GOLDEN",
      "description": "Authorities say one person has been killed and others were injured when a private jet owned by Mötley Crüe singer Vince Neil collided with another jet at the Scottsdale Airport in Arizona. A representative for Neil says the singer was not on the plane. The Federal Aviation Administration says the private jet veered off the runway and crashed into another private jet. Fire officials say of those injured, two were taken to trauma centers and one was in stable condition at a hospital. The collision Monday afternoon comes after three major U.S. aviation disasters in the past two weeks.",
      "publishedAt": "2025-02-10T23:36:31Z",
      "title": "Plane crash at Scottsdale Airport in Arizona kills 1 person, authorities say",
      "url": "https://apnews.com/article/arizona-private-jet-crash-scottsdale-airport-b3d54b61cda17a21c76a994a1b4eaf1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3569bde/2147483647/strip/true/crop/4200x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2Fed%2F756ad953f015b0b97468bfdf1d89%2F822a77d5926147df83a7a5c22c13cea9"
    },
    {
      "author": "CHRISTOPHER RUGABER, DARLENE SUPERVILLE",
      "description": "President Donald Trump says he'll announce Monday the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week. Shares of U.S. steel companies rose sharply in futures trading before the opening bell Monday. Trump also reaffirms he'll announce “reciprocal tariffs.” That means the U.S. would impose import duties on products in cases in which another country has levied duties on U.S. goods. The Republican president spoke to reporters aboard Air Force One as he flew on Sunday from Florida to attend the Super Bowl in New Orleans.",
      "publishedAt": "2025-02-09T22:02:31Z",
      "title": "Trump says he will announce 25% steel and aluminum tariffs Monday",
      "url": "https://apnews.com/article/trump-steel-aluminum-tariffs-import-duties-74d7bfde0da59e111a45e772d199f2b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0cd7bc/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2Fb9%2F8d23900ecc1261cc038f96ce30e8%2F771129d26549492dbd10bf7fc70fd76b"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "South Korea’s top economic think tank on Tuesday slashed its growth forecast for the country’s economy for the second time in four months, expressing concern about the potential impact of U.S. President Donald Trump’s expanding tariffs. The Korea Development Institute now projects South Korea’s economy to grow by 1.6% in 2025, which is 0.4 percentage points lower than its previous estimate announced in November. Kim Jiyeon, a KDI economist, said the “deterioration of the trade environment” following Trump’s inauguration was a major factor. South Korea is also grappling with political instability caused by the impeachment and criminal indictment of President Yoon Suk Yeol after he briefly imposed martial law in December.",
      "publishedAt": "2025-02-11T04:19:50Z",
      "title": "South Korea's top think tank lowers economic growth projection, citing Trump's tariffs",
      "url": "https://apnews.com/article/south-korea-economy-growth-trump-trade-tariffs-4eef3c90e8ce98a9d7fb5fbfaa3405fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/6857e6d/2147483647/strip/true/crop/6000x3375+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F93%2F1c4ab1bcc326675a052e640911fe%2F2ceabffb6e4343f497cd7cba5de30350"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Officials and federal officers have turned away scores of U.S. Agency for International staffers who showed up for work at its Washington headquarters. It comes after a court temporarily blocked a Trump administration order that would have pulled all but a fraction of workers off the job worldwide. A front desk officer told a steady stream of agency staffers Monday that they weren't on a list of people allowed to enter. A man who had earlier identified himself as a USAID official told them: “Just go.” Workers embraced who had not seen each other since President Donald Trump and billionaire Elon Musk began dismantling USAID and its programs worldwide three weeks ago.",
      "publishedAt": "2025-02-10T16:34:52Z",
      "title": "USAID staffers turned away from offices even after court order",
      "url": "https://apnews.com/article/usaid-trump-musk-leave-staffers-9099c61b33aa7e4bfd40e849853be3b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8098733/2147483647/strip/true/crop/5128x2885+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F19%2F8cc8ac88470d146d4f9e0ecefa44%2Fe1dfe4c355c44323a7cb49353926c55a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}