{
  "articles": [
    {
      "author": "ZEKE MILLER, WILL WEISSERT and DARLENE SUPERVILLE",
      "description": "CHICAGO (AP) — Vice President Kamala Harris will look to introduce herself to voters, lay out her vision for the country and prosecute her case against Republican Donald Trump Thursday night as she accepts her party's nomination at the Democratic National Convention.",
      "publishedAt": "2024-08-22T10:31:04Z",
      "title": "Democrats conclude their convention Thursday with their new standard bearer, Kamala Harris",
      "url": "https://apnews.com/807cf9d4a609a18ceaa9eee9c9422af5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05f5457856f64c87ac7e57f69445c94c/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and JACQUES BILLEAUD",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday rejected a Republican push that could have blocked more than 41,000 Arizona voters from casting ballots for president in the state that Democrat Joe Biden won by less than 11,000 votes four years ago.",
      "publishedAt": "2024-08-22T19:16:48Z",
      "title": "Supreme Court rejects GOP push to block 41K Arizona voters, but partly OKs proof of citizenship law",
      "url": "https://apnews.com/62b7e777cfdbb99242510e562de00781",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/464b3ee105fe439486537667364e23f9/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ADRIANA GOMEZ LICON",
      "description": "SIERRA VISTA, Ariz. (AP) — On a dirt road below the shrub-dotted hills of Arizona, Donald Trump used a stretch of wall and a pile of steel beams to draw a visual contrast between his approach to securing the border and that of his Democratic opponent, Vice President Kamala Harris.",
      "publishedAt": "2024-08-22T17:44:53Z",
      "title": "Trump uses a stretch of border wall and a pile of steel beams in Arizona to contrast with Democrats",
      "url": "https://apnews.com/a38e69068d0484d4adedf7a8a8c7d973",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a813791e286448a885d48e3e6ae94ed6/1920.jpeg"
    },
    {
      "author": "ROB GILLIES and JOSH FUNK",
      "description": "TORONTO (AP) — Freight trains are expected to start rolling again soon in Canada after the government forced the country’s two major railroads into arbitration with their labor union Thursday, averting potentially dire economic consequences across the country and in the U.S.",
      "publishedAt": "2024-08-22T14:23:12Z",
      "title": "Canada forces arbitration in freight train labor dispute, averting economic crisis",
      "url": "https://apnews.com/5b9290b47ad6cdb439735c10560602d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bef899e0834a4e55b3f9b3989f686432/1920.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — An unexpected highlight of the Democratic National Convention on Night Three was an outburst of pride from the son of vice presidential candidate Tim Walz.“That’s my dad!” 17-year-old Gus Walz could be seen exclaiming Wednesday night.",
      "publishedAt": "2024-08-22T20:24:54Z",
      "title": "Sudden fame for Tim Walz's son focuses attention on challenges of people with learning disabilities",
      "url": "https://apnews.com/c09cbdb10ea8f91edff051527bbcba03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cd32413e8c547698e73f94250cee601/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — U.S. regulators approved updated COVID-19 vaccines on Thursday, shots designed to more closely target recent virus strains -- and hopefully whatever variants cause trouble this winter, too.",
      "publishedAt": "2024-08-22T17:49:51Z",
      "title": "FDA approves updated COVID-19 vaccines, shots should be available in days",
      "url": "https://apnews.com/fb542f97096e9759059c0bdd82a48a74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcb2ff01b5e34af29a21d01c0091837e/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy made his first visit Thursday to the border area where his forces launched their surprise offensive into Russia, saying that Kyiv's military had taken control of another Russian village and captured more prisoners of war.",
      "publishedAt": "2024-08-22T07:56:54Z",
      "title": "Zelenskyy makes 1st visit to border area where Ukrainian forces launched offensive into Russia",
      "url": "https://apnews.com/92ba09ebaef0e8fd1777df56b3d8a706",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f48fdb0f41ef4c02a42270cbbf95d6e0/2312.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Some new Ukrainian soldiers refuse to fire at the enemy. Others, according to commanders and fellow fighters, struggle to assemble weapons or to coordinate basic combat movements.",
      "publishedAt": "2024-08-22T04:10:49Z",
      "title": "Poorly trained recruits contribute to loss of Ukrainian territory on eastern front, commanders say",
      "url": "https://apnews.com/ed2d06ad529e3b7e47ecd32f79911b83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e760302532644e5f8d514e907892b01f/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D. and JIM VERTUNO",
      "description": "A suspect arrested in Guatemala has been charged with helping coordinate the 2022 smuggling attempt that ended in the deaths of 53 migrants in Texas, the Justice Department announced Thursday, marking what U.S.",
      "publishedAt": "2024-08-22T04:04:07Z",
      "title": "US government indicts Guatemalan suspect on smuggling charges over deaths of 53 migrants in trailer",
      "url": "https://apnews.com/d1a8047a6c76e6b810e471e769d48fa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ac64d42b84443e196d835b280e485db/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "ORLANDO, Fla. (AP) — Midwife Jennie Joseph touched Husna Mixon’s pregnant belly, turned to the 7-year-old boy in the room with them and asked: “Want to help me check the baby?”With his small hand on hers, Joseph used a fetal monitor to find a heartbeat.",
      "publishedAt": "2024-08-22T15:10:37Z",
      "title": "Europe offers clues for solving America's maternal mortality crisis",
      "url": "https://apnews.com/211218f769e9a5a6e856a485fb31aef3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f3cccac99cb435086f2a022225050a6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}