{
  "articles": [
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — President Joe Biden begins an intense period of private preparations Friday at Camp David for what may be the most consequential presidential debate in decades.",
      "publishedAt": "2024-06-21T04:12:22Z",
      "title": "How Biden and Trump are taking very different approaches to preparing for next week's debate",
      "url": "https://apnews.com/2f67b119f58136b310b625e42fad3d3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef767780c0a7423f876fbc3ff85a3ac8/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military said Sunday that it was establishing a new safe corridor to deliver aid into southern Gaza. But days later, this self-declared “tactical pause” has brought little relief to desperate Palestinians.",
      "publishedAt": "2024-06-20T20:32:04Z",
      "title": "Israel's pledge to guard an aid route into Gaza falls flat as lawlessness blocks distribution",
      "url": "https://apnews.com/988f2919d00339ded5a18f26feafda6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad74baab31bb4f99a643ff9584e34e7a/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — During daytime, entire districts of Ukraine's capital are disconnected from the power grid to save energy.",
      "publishedAt": "2024-06-21T05:20:05Z",
      "title": "Navigating through darkness: Ukraine’s emergency blackouts return after Russia pounds infrastructure",
      "url": "https://apnews.com/a0f9c6a84b708dfd493230c8c26716fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45b430863e82407da146248af4b77894/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "The imagery from Pyongyang emerged quickly, notable in its variety — glimpses into North Korea in near-real time that showed its leader, Kim Jong Un, grinning and glad-handing with Russian President Vladimir Putin and showing him around the capital of one of the world's least accessible nations.",
      "publishedAt": "2024-06-20T20:06:31Z",
      "title": "The Putin-Kim summit produced an unusual — and speedy — flurry of glimpses into North Korea",
      "url": "https://apnews.com/7ff8b8b5f8b327a58d54ad6f2e2f4794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1054a87322fd426d95db9af530efb818/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — The powerful sister of North Korean leader Kim Jong Un issued a vague threat of retaliation on Friday, after South Korean activists flew balloons carrying anti-Pyongyang propaganda leaflets across the border, underscoring rising tensions on the peninsula.",
      "publishedAt": "2024-06-21T02:11:22Z",
      "title": "South Korean troops fire to repel North soldiers' 3rd border incursion. Activists fly more leaflets",
      "url": "https://apnews.com/c7b5c2d2b7a919361de086c5e32291d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e613afaf3e64cf98093ab0234b717c9/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "FORT PIERCE, Fla. (AP) — The federal judge presiding over the classified documents case against former President Donald Trump is hearing arguments Friday on a long-shot defense effort to get the indictment thrown out based on the claim that the prosecutor who brought the charges was illegally appointed.",
      "publishedAt": "2024-06-21T04:11:30Z",
      "title": "Motion after motion puts Trump Florida case in slow motion as 3-day hearing begins",
      "url": "https://apnews.com/00ca368253a7d53881ba54d83e7f6a6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b48d3b3044e4a84a6a7ce91ea5a5552/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Judges, state lawmakers and voters are deciding the future of abortion in the U.S. two years after the Supreme Court jolted the legal status quo with a ruling that overturned Roe v.",
      "publishedAt": "2024-06-21T04:05:24Z",
      "title": "Here’s the landscape 2 years after the Supreme Court overturned a national right to abortion",
      "url": "https://apnews.com/cadff0d905d1c4d7b9825c8406aadffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eeb8c51572534e0e9fa1426268a1d97b/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Louisiana has long been reliably red. The Bayou State has voted for the Republican candidate in every presidential election since 2000, with residents overwhelmingly supporting Donald Trump during the past two, and the GOP has held a majority in the statehouse for years.",
      "publishedAt": "2024-06-21T04:14:31Z",
      "title": "Ten Commandments law is Louisiana governor’s latest effort to move the state farther to the right",
      "url": "https://apnews.com/bef181b17cb5a5819514c7c68ae8f2e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf9e4edb4df6423f8ec094ee27521739/3000.jpeg"
    },
    {
      "author": "NICK PERRY, HOLLY RAMER and ROBERT F. BUKATY",
      "description": "SQUAM LAKE, N.H. (AP) — As New England baked in a heat wave Thursday, guests at one campground were keeping their food and beer cold with blocks of ice harvested months earlier from a frozen lake.",
      "publishedAt": "2024-06-20T15:50:17Z",
      "title": "As millions sweat out the heat wave, blocks of lake ice keep these campers cool",
      "url": "https://apnews.com/fd0a476d9baea83a0a470189879547c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9966efe15ec474f903fab4deaeb5ef1/1920.jpeg"
    },
    {
      "author": "JOSEPH WILSON and LAURIE KELLMAN",
      "description": "BARCELONA, Spain (AP) — Try saying “no” when a child asks for a smartphone. What comes after, parents everywhere can attest, begins with some variation of: “Everyone has one. Why can’t I?”But what if no pre-teen in sight has one — and what if having a smartphone was weird?",
      "publishedAt": "2024-06-21T05:10:52Z",
      "title": "Should young kids have smartphones? These parents in Europe linked arms and said no",
      "url": "https://apnews.com/a96775a16ba131d2cc50b27b5096fe8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bf9133bffc347dbbc2cfb38f2b42498/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}