{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza (AP) — At least 68 people were killed by an Israeli strike in central Gaza, health officials said Sunday, while the number of Israeli soldiers killed in combat over the weekend rose to 15.",
      "publishedAt": "2023-12-24T08:00:21Z",
      "title": "At least 68 killed in central Gaza in airstrike, adding to weekend's bloodshed",
      "url": "https://apnews.com/9451d609ecdf85d14795caa628e2a127",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4a88cd0d90d480f92213828cb57e9bd/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "BETHLEHEM, West Bank (AP) — The typically bustling biblical birthplace of Jesus resembled a ghost town Sunday after Christmas Eve celebrations in Bethlehem were called off due to the Israel-Hamas war.",
      "publishedAt": "2023-12-24T09:34:45Z",
      "title": "On Christmas Eve, Bethlehem resembles a ghost town. Celebrations are halted due to Israel-Hamas war.",
      "url": "https://apnews.com/e408a3e48d18c69a7a0b018505cdc732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61467ff3817a42949826a108eb2a4688/1920.jpeg"
    },
    {
      "author": null,
      "description": "VATICAN CITY (AP) — Recalling Jesus’ birth in a stable in Bethlehem, Pope Francis in a Christmas Eve homily said that “the clash of arms even today\" prevents Jesus “from finding room in the world.”",
      "publishedAt": "2023-12-24T20:26:10Z",
      "title": "Pope says 'our hearts are in Bethlehem' as he presides over the Christmas Eve Mass in St. Peter's",
      "url": "https://apnews.com/763052ffa5cbe89cb0661c4db5b684be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715049837b2d41ffbcf0880a0c6ab1c2/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH, ABDUL RAHMAN SHAHEEN and SHAZIA BHATTI",
      "description": "FRANKFURT, Germany (AP) — Christians around the world were striving on Christmas Eve to put aside the worries and fears of an unsettled, war-torn world as they prepared to celebrate the birth of Jesus of Nazareth.",
      "publishedAt": "2023-12-24T12:38:54Z",
      "title": "In a troubled world, Christians strive to put aside earthly worries on Christmas Eve",
      "url": "https://apnews.com/12aac83f3a9d1bb1c05768c02e75771b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62622830dfb04060ad5ad8ac957757cc/1920.jpeg"
    },
    {
      "author": "SAGAR MEGHANI",
      "description": "WASHINGTON (AP) — As children around the world eagerly await Santa’s arrival on Christmas, the military is closely tracking his every move.Armed with radar, sensors, aircraft and Christmas spirit, the North American Aerospace Defense Command in Colorado is reporting on the movements of Santa's sleigh since his takeoff from the North Pole for parts of the globe where Christmas comes first.",
      "publishedAt": "2023-12-22T05:03:51Z",
      "title": "A North American military command is tracking Santa's every move and kids can follow along",
      "url": "https://apnews.com/2f9a2083102decafa3186a7d6f8f8e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/662bb1e1516c46a4aeab310e364b9518/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "FORT MORGAN, Colo. (AP) — Magdalena Simon's only consolation after immigration officers handcuffed and led her husband away was the contents of his wallet, a few bills.The hopes that had pushed her to trudge thousands of miles from Guatemala in 2019, her son’s small frame clutched to her chest, ceded to despair and loneliness in Fort Morgan, a ranching outpost on Colorado’s eastern plains, where some locals stared at her too long and the wind howls so fiercely it once blew the doors half off a hotel.",
      "publishedAt": "2023-12-24T05:05:11Z",
      "title": "New migrants face fear and loneliness. A town on the Great Plains has a storied support network",
      "url": "https://apnews.com/c452a587f92c5f1b9dc9a6decc6cf8fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/735b6445366f40fab7d4aff80d69600c/3000.jpeg"
    },
    {
      "author": "ANGELA CHARLTON and ELISE MORTON",
      "description": "PARIS (AP) — A charter plane sequestered while carrying 303 Indians to Nicaragua was authorized Sunday to leave the French airport where it has been grounded for four days for a human trafficking investigation.",
      "publishedAt": "2023-12-24T11:34:59Z",
      "title": "Grounded charter jet freed to leave France. Lawyer says most passengers expected to return to India",
      "url": "https://apnews.com/98c1d9e9d86a3f1fea46403d88d4b7ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5970f9dc6894758aa0e938558d27e48/3000.jpeg"
    },
    {
      "author": "JAMES ROBSON",
      "description": "MANCHESTER, England (AP) — After failing to win the Premier League in the last 10 years, Manchester United announced Sunday that it had agreed to sell a minority stake in the storied club to Jim Ratcliffe in a deal that would also see the British billionaire and boyhood fan take control of its soccer operations.",
      "publishedAt": "2023-12-24T16:09:20Z",
      "title": "Manchester United announces deal to sell up to 25% of EPL club to UK billionaire Jim Ratcliffe",
      "url": "https://apnews.com/a78ec58384d7062b486f162fe4138cac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/105309021d414874bc0c8e9af16b644c/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — As the Senate wrapped up its work for the year, Sen. Michael Bennet took to the floor of the nearly empty chamber and made a late-night plea for Congress to redouble support for Ukraine: “Understand the stakes at this moment.\"",
      "publishedAt": "2023-12-24T13:25:23Z",
      "title": "As conflicts rage abroad, a fractured Congress tries to rally support for historic global challenges",
      "url": "https://apnews.com/31075fce7dfcb3aaa6d3eb595e62ed09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e1fee5af4dd490c845890f5a01a5170/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "MIAMI GARDENS, Fla. (AP) — Jason Sanders had waited all season for this moment. On a Miami Dolphins team that scores more touchdowns than any other in the NFL, the former All-Pro kicker hadn't needed to attempt many field goals.",
      "publishedAt": "2023-12-25T00:52:41Z",
      "title": "Dolphins nip Cowboys 22-20 on Jason Sanders' last-second field goal, secure playoff spot",
      "url": "https://apnews.com/972bafc004c2c8ebd6d378a44452d8b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd1224ad54ad4d5da123be780c2006ef/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}