{
  "articles": [
    {
      "author": null,
      "description": "RAMALLAH, West Bank (AP) — An Israeli was shot dead in a Palestinian town in the northern West Bank Saturday morning, Israel's army said, while deadly strikes rocked northern Gaza.",
      "publishedAt": "2024-06-22T07:56:53Z",
      "title": "Israeli national found dead after being shot in West Bank Palestinian town",
      "url": "https://apnews.com/39d09eccc39a7f225d573c97e73a2917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28fcf01aa0bc47999268fa26cd869ffd/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen's Houthi rebels attempting to target the shipping lane.",
      "publishedAt": "2024-06-22T04:38:14Z",
      "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home",
      "url": "https://apnews.com/ffe35adc91e25379c0c6fd420b413099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05cc162bf78341c9a564bea53a3f6568/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A family of six was found dead by rescuers in Fujian province, state media reported Saturday, adding to the extreme weather deaths after downpours caused landslides in the area, even as authorities extended a warning of more severe weather ahead.",
      "publishedAt": "2024-06-22T09:37:58Z",
      "title": "Rescuers find family of 6 dead in landslide in eastern China, as severe weather warning extended",
      "url": "https://apnews.com/38e991e0a3633ce1819c5e018fe652f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6f6d9b33c2c48a294da02d4c54074b7/3000.jpeg"
    },
    {
      "author": null,
      "description": "ROME (AP) — The Italian coast guard has recovered 14 more bodies from last week's shipwreck in the Ionian Sea off the southern Italian coastline, bringing to 34 the number of known victims from the sinking.",
      "publishedAt": "2024-06-22T07:48:29Z",
      "title": "Italian coast guard recovers 14 more bodies of shipwreck victims off Calabria, dozens still missing",
      "url": "https://apnews.com/1fe392cbd0d8151048e3b91d1891921b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a13793bfd40943f8a1b34929867eff95/2129.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — A nuclear-powered United States aircraft carrier arrived Saturday in South Korea for a three-way exercise stepping up their military training to cope with North Korean threats that escalated with its alignment with Russia.",
      "publishedAt": "2024-06-22T07:52:32Z",
      "title": "US aircraft carrier arrives in South Korea as a show of force against nuclear-armed North Korea",
      "url": "https://apnews.com/26fd868eab68e56b207f4e6b1ecf45c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8f07622722b41fab8ca16d9e0166e88/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "DOYLESTOWN, Pa. (AP) — Thirty miles north of Philadelphia, upscale subdivisions such as Colonial Commons interrupt dairy farms, centuries-old roadside stone houses and the winding Neshaminy Creek that flows between Doylestown and Newtown.",
      "publishedAt": "2024-06-22T04:06:11Z",
      "title": "Biden and allied Republicans are trying to rally GOP women in swing-state suburbs away from Trump",
      "url": "https://apnews.com/9d1e7276ddc0121a35b768c3b1486510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07fe8ed4d6124e4abc8f5d8ac49b2551/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Donald Trump is set to speak Saturday to a group of politically influential evangelicals who fiercely support him but would like to see the presumptive Republican presidential nominee promise to do more to restrict abortion.",
      "publishedAt": "2024-06-22T04:04:03Z",
      "title": "Trump will address influential evangelicals who back him but want to see a national abortion ban",
      "url": "https://apnews.com/042cd25750a43a1f9a474e793c86c0a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/895e8b74ae9b402faecc70bcc721500c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "On a lazy summer weekend a year ago, Russia was jolted by the stunning news of an armed uprising. The swaggering chief of a Kremlin-sponsored mercenary army seized a military headquarters in the south and began marching toward Moscow to oust the Defense Ministry’s leaders, accusing them of starving his force of ammunition in Ukraine.",
      "publishedAt": "2024-06-22T04:03:15Z",
      "title": "A year ago, Russian mercenary chief Yevgeny Prigozhin challenged the Kremlin with a mutiny",
      "url": "https://apnews.com/a3c617e27a67ea38364529888292efd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81a66fdf826b4d54b6272b1d20027a4c/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "Belinda Bukovitz was jolted into action by the sound of police outside her home shouting through a loudspeaker: “Go now, go now, go now!” Realizing this was not like other wildfires that had threatened her mountain village before, she, her husband, son and two cats bundled into three separate cars and fled.",
      "publishedAt": "2024-06-21T23:11:47Z",
      "title": "Escape from killer New Mexico wildfire was 'absolute sheer terror,’ says woman who fled the flames",
      "url": "https://apnews.com/be4907aa9570904e251ee193c05a2059",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad38d4e65e944369d5b0bc6c7f06b3f/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The head of the Homeland Security Department said Friday that the agency tasked with responding to disasters across the country is prepared as it goes into what is expected to be an intense hurricane and wildfire season but he's concerned about looming budget shortfalls.",
      "publishedAt": "2024-06-21T20:55:53Z",
      "title": "FEMA is ready for an extreme hurricane and wildfire season, but money is a concern, Mayorkas says",
      "url": "https://apnews.com/f6b8c8c9713a4e0ea7a7bf28c7e55aa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22708f1bb8c647809ae106bd5a750f9b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}