{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Israeli attack on Iran damaged facilities at a secretive military base southeast of the Iranian capital that experts in the past have linked to Tehran's onetime nuclear weapons program and at another base tied to its ballistic missile program, satellite photos analyzed Sunday by The Associated Press show.",
      "publishedAt": "2024-10-27T10:14:29Z",
      "title": "Satellite images show damage from Israeli attack at 2 secretive Iranian military bases",
      "url": "https://apnews.com/0c6ee6a8544268612cb7d49727d8449d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7f30693a4724180a280ee42b59b06b5/3000.jpeg"
    },
    {
      "author": "AMI BENTOV, TIA GOLDENBERG, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "TEL AVIV, Israel (AP) — Israeli strikes on northern Gaza have killed at least 22 people, mostly women and children, Palestinian officials said Sunday, as the Israeli offensive in the hard-hit and isolated north entered a third week and aid groups described a humanitarian catastrophe.",
      "publishedAt": "2024-10-27T05:30:19Z",
      "title": "Israeli strikes on Gaza kill 22, officials say, as truck ramming near Tel Aviv hurts dozens",
      "url": "https://apnews.com/b4bf551e7c7de2af29257f6d4cc74da2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/010c0ee5685d4704a8a01bd901aae288/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump is finally getting his Madison Square Garden moment.With just over a week to go before Election Day, the former president will take the stage at one of the country's most iconic venues, hosting a hometown rally to deliver his campaign's closing message against Democratic Vice President Kamala Harris.",
      "publishedAt": "2024-10-27T04:02:46Z",
      "title": "Trump veers away from swing states for his Madison Square Garden moment",
      "url": "https://apnews.com/fcfe75be7f8281fde7bffa3adb3bba5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0652503d3954460a921a296ad4b655ad/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, AAMER MADHANI and CHRIS MEGERIAN",
      "description": "KALAMAZOO, Mich. (AP) — Michelle Obama challenged men to support Kamala Harris ' bid to be America's first female president, warning at a rally in Michigan on Saturday that women's lives would be at risk if Donald Trump returned to the White House.",
      "publishedAt": "2024-10-26T15:53:29Z",
      "title": "'Take our lives seriously,' Michelle Obama pleads as she rallies for Kamala Harris in Michigan",
      "url": "https://apnews.com/61897674ddc94706031d00aca5c1dc86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa35b3d27af74a96878736e125328759/1920.jpeg"
    },
    {
      "author": "TERRY TANG and DIDI TANG",
      "description": "Diana Xue has always followed the politics of her husband, friends and neighbors in Orlando, Florida, and voted Republican. This Election Day, she'll break that pattern. When Florida's GOP-dominated Legislature and Republican governor enacted a law last year banning Chinese nationals without permanent U.S.",
      "publishedAt": "2024-10-27T03:56:32Z",
      "title": "State alien land laws drive some China-born US citizens to rethink their politics",
      "url": "https://apnews.com/a8a832335fbfda53ffa262f1e0f6e264",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69a9edd3d65c458e9b44c25227467f31/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "AURORA, Colo. (AP) — Starting seventh grade at her first American school, facing classes taught entirely in English, Alisson Ramirez steeled herself for rejection and months of feeling lost.",
      "publishedAt": "2024-10-27T04:14:36Z",
      "title": "They came to America looking for better lives — and better schools. The results were mixed",
      "url": "https://apnews.com/2aee52bc80300f5507a903cda3e441da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce90eae301114ba8b6e0f6404af62b90/3000.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "LOS ANGELES (AP) — Dodgers superstar Shohei Ohtani partially dislocated his left shoulder during the seventh inning of Saturday's Game 2 of the World Series against the New York Yankees when he tried to steal second base.",
      "publishedAt": "2024-10-27T02:51:05Z",
      "title": "Shohei Ohtani partially dislocates left shoulder during World Series Game 2, status TBD",
      "url": "https://apnews.com/332dfab365b16f5f8ae607fcb5147a01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ca03370269b4c2b996a771b22eef2b3/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese Prime Minister Shigeru Ishiba’ s conservative ruling party braced for a blow to its comfortable majority in the lower house of parliament in Sunday’s elections amid public rage over the party’s financial scandals and discontent over a stagnant economy.",
      "publishedAt": "2024-10-27T00:12:09Z",
      "title": "Japan's ruling party braces for a blow to its comfortable majority in the lower house in elections",
      "url": "https://apnews.com/5c6509c7b83963ffe40588c50998967c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6299ef921f094c92b31b76b201d7de0a/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EFREM LUKATSKY",
      "description": "KYIV, Ukraine (AP) — North Korean troops are poised to be deployed by Russia on the battlefield in Ukraine as early as this weekend, Ukrainian President Volodymyr Zelenskyy claimed Friday.Western officials have warned that North Korean units joining the fight would stoke the almost three-year war and bring geopolitical consequences as far away as the Indo-Pacific region.",
      "publishedAt": "2024-10-25T10:52:08Z",
      "title": "Ukraine's Zelenskyy says North Korean troops are poised to join the war, cancels UN chief's visit",
      "url": "https://apnews.com/9d83c419ef741259d09860b576b8a27d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94f8cc50a7fd406582151ae3c9d2ed2b/2112.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "LOS ANGELES (AP) — Yoshinobu Yamamoto walked back to his dugout and made the slightest tip of his cap to cheering fans. He left Japan for moments like this, an opportunity to put the Los Angeles Dodgers in control of the World Series.",
      "publishedAt": "2024-10-27T03:18:40Z",
      "title": "Yamamoto shuts down Yankees, Freeman homers again as Dodgers win 4-2 for 2-0 World Series lead",
      "url": "https://apnews.com/d672c41e864884be79f2629a749363a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be55a5df435d4e0ebc77c30957744b27/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}