{
  "articles": [
    {
      "author": null,
      "description": "South Korea’s new President Lee Jae-myung says he’ll pursue dialogue with North Korea while bolstering a trilateral partnership with the U.S. and Japan. He said in his inaugural address after taking office Wednesday that his government will deal with potential North Korean aggressions with “a strong deterrence” based on the solid South Korea-U.S. military alliance. But he would also leave the door open for dialogue with North Korea and establish peace on the Korean Peninsula. He said he’ll pursue pragmatic diplomacy and boost a trilateral Seoul-Washington-Tokyo cooperation based on the South Korea-U.S. alliance. Lee won a snap election Tuesday for a five-year term.",
      "publishedAt": "2025-06-04T02:42:49Z",
      "title": "Lee Jae-myung says he’ll bolster South Korea's ties with US and Japan and pursue talks with North",
      "url": "https://apnews.com/article/south-korea-president-lee-a754f6c7fe8f44d15e2898b59b9a5f3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f5a817/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Fa0%2F18c8100f07edd8bd0f1b5071aa15%2F422b1dc17b3d4b159e0e3430f456ca3f"
    },
    {
      "author": "Colleen Slevin, Jesse Bedayn, Rebecca Santana",
      "description": "Members of the Boulder community are reeling from a firebombing attack that injured 12 people demonstrating for the release of Israeli hostages. Residents are preparing to come together for a vigil Wednesday evening to support those impacted. Authorities say Mohamed Sabry Soliman had 18 Molotov cocktails but threw just two during Sunday’s attack in which he yelled “Free Palestine.” Officials say he had planned to kill all of the roughly 20 participants in the demonstration. Soliman is an Egyptian national who has been living in the U.S. illegally. He faces federal hate crime and state attempted murder charges. Federal officials say his wife and five children have been taken into custody and could be quickly deported.",
      "publishedAt": "2025-06-04T05:24:12Z",
      "title": "Boulder vigil planned after firebombing injures 12 at rally for hostages",
      "url": "https://apnews.com/article/boulder-attack-vigil-mohamed-soliman-173ac2795d12ae6b416010d45aa6fe91",
      "urlToImage": "https://dims.apnews.com/dims4/default/50fde23/2147483647/strip/true/crop/2491x1401+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F8d%2F2ba07a33bda1882e2d643e38a241%2F10c8eb0f88cc4343a45bc263577c3e82"
    },
    {
      "author": "Jonathan J. Cooper, Chris Megerian",
      "description": "Elon Musk has blasted President Donald Trump’s “big, beautiful bill” of tax breaks and spending cuts as a “disgusting abomination.\" The tech billionaire's comments on Tuesday test his own influence over the Trump-led Republican Party. Musk targeted Trump’s top congressional priority just days after the president gave him a celebratory Oval Office sendoff marking the end of Musk’s role leading the Department of Government Efficiency. Musk’s business interests stand to lose from Trump’s bill, which would slash funding for electric vehicles and related technologies.",
      "publishedAt": "2025-06-03T21:51:56Z",
      "title": "Elon Musk calls Trump's tax break bill an 'abomination'",
      "url": "https://apnews.com/article/elon-musk-trump-tax-spending-bill-abomination-157b8733b60c343a5f8e551ffc887bf3",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a7f11a/2147483647/strip/true/crop/5228x2941+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F93%2F4e3fc68dff3b0e29b00d977655d7%2F4fdd787f13a648bab59d08b08287a120"
    },
    {
      "author": null,
      "description": "Ukraine's Western backers are gathering to drum up more weapons and ammunition for the country's efforts to repel Russia's all-out war. But the Pentagon chief will be absent for the first time since the group organizing military aid for Ukraine was set up three years ago. Wednesday's Ukraine Defense Contact Group meeting at NATO headquarters is being chaired by the U.K. and Germany. U.S. Defense Secretary Pete Hegseth would only arrive in Brussels after it's over. His absence is the latest in a series of steps that the U.S. has taken to distance itself from Ukraine's war efforts. The U.K. said before the meeting that it plans a tenfold increase in drone production to help Ukraine.",
      "publishedAt": "2025-06-04T09:07:06Z",
      "title": "Ukraine's backers meet to drum up arms and ammo. The Pentagon chief is absent for the first time",
      "url": "https://apnews.com/article/russia-ukraine-weapons-ammunition-udcg-hegseth-nato-3323b6a9378d6e52fe8c90531de37837",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fae203/2147483647/strip/true/crop/2024x1139+0+105/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fce%2F35ef9206977bd47411719188f61a%2Fa808e2764f52418fa3b90892790f8e25"
    },
    {
      "author": "Sam Mednick, Lee Keath",
      "description": "Shootings have erupted nearly daily this week in the Gaza Strip in the vicinity of new hubs where desperate Palestinians are being directed to collect food. Witnesses say nearby Israeli troops have opened fire. Hospital officials say at least 80 people have been killed and hundreds wounded. The Israeli military has said it fired warning shots in several instances, and has also fired directly at a few “suspects” who ignored warnings and approached its forces. It has denied opening fire on civilians, and so far has not claimed Hamas fired in the area of the hubs, though it says it is still investigating.",
      "publishedAt": "2025-06-04T06:31:15Z",
      "title": "What we know about shootings near Gaza aid sites",
      "url": "https://apnews.com/article/gaza-humanitarian-foundation-aid-israel-hamas-d9e205966fb08bdbba0a842e1762a322",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3c47cb/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F65%2Ff84a3ecadaa235d21c1c492c799a%2F42b59263ece8458a97d2924ac265abcd"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s supreme leader has criticized an initial proposal from the United States in negotiations over Tehran’s rapidly advancing nuclear program, though he stopped short of entirely rejecting the idea of agreement with Washington. Ayatollah Ali Khamenei on Wednesday described the U.S. proposal as “100% against the idea of ‘we can,’” borrowing from an Iranian government slogan. He also insisted that Tehran needed to keep its ability to enrich uranium. Reaching a deal is one of the several diplomatic priorities being juggled by U.S. President Donald Trump and his Middle East envoy Steve Witkoff.",
      "publishedAt": "2025-06-04T06:37:24Z",
      "title": "Iran's supreme leader criticizes US proposal in nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-supreme-leader-khamenei-008d8b020be499c91b3caf345494e379",
      "urlToImage": "https://dims.apnews.com/dims4/default/1acc537/2147483647/strip/true/crop/2200x1238+0+106/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F52%2F76591b135ae537932240b9e7ef01%2F4d85516545724187ae1d382c259e8a88"
    },
    {
      "author": "Andrew DeMillo",
      "description": "Arkansas authorities have released a photo rendering of a convicted murderer and former police chief known as the “Devil in the Ozarks” who escaped from prison. The Arkansas Department of Corrections said Tuesday the rendering shows what 56-year-old Grant Hardin may look like more than a week after his escape from the Calico Rock prison. Hardin was serving sentences for rape and murder when he escaped May 25. Authorities have said he donned an outfit designed to look like a law enforcement uniform. Police continued to search the north-central Arkansas region for Hardin.",
      "publishedAt": "2025-06-03T22:26:46Z",
      "title": "Arkansas authorities release photo rendering of 'Devil in the Ozarks' as manhunt continues",
      "url": "https://apnews.com/article/devil-ozarks-calico-rock-hardin-10382e1c29c844b9a06b2b66bda9d09e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f38796b/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F4f%2Fd646f6c4030c19617c330fb0c613%2F0c1c605ae3c84a5fa2ba6e9a063aa86d"
    },
    {
      "author": "Steve Karnowski",
      "description": "Smoke from Canadian wildfires has carried another day of poor air quality south of the border to the American Midwest. Conditions in parts of Minnesota, Wisconsin and Michigan were rated “very unhealthy” on Tuesday. The smell of smoke hung over the Minneapolis-St. Paul area on Tuesday morning. The Minnesota Pollution Control Agency issued an alert for almost the entire state into Wednesday. Canada is having another bad wildfire season, and more than 27,000 people in three provinces have been forced to evacuate. The smoke is even reaching Europe, where it is causing hazy skies but isn’t expected to affect surface-air quality,",
      "publishedAt": "2025-06-03T18:53:48Z",
      "title": "Canadian wildfire smoke causes 'very unhealthy' conditions in American Midwest",
      "url": "https://apnews.com/article/canadian-wildfires-smoke-air-pollution-minnesota-midwest-europe-24237c0043f70ed64db931cb2ce48b91",
      "urlToImage": "https://dims.apnews.com/dims4/default/344c28c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2F09%2Fd5eb1d3423293671236471b76047%2F0ff2ff2166bd46c9a3640fa3a7024516"
    },
    {
      "author": "Mike Corder",
      "description": "Dutch opposition parties are calling for fresh elections as soon as possible, a day after anti-Islam lawmaker Geert Wilders sparked the collapse of the country’s four-party coalition government. Prime Minister Dick Schoof’s 11-month-old administration fell apart when Wilders withdrew his Party for Freedom ministers. Schoof and the ministers of three remaining parties remained in power Wednesday as a caretaker Cabinet. The government, with limited powers, has to lead the country for months before new elections and during talks to cobble together a new coalition in the fragmented Dutch political landscape after the vote.",
      "publishedAt": "2025-06-04T10:47:23Z",
      "title": "The Dutch government has collapsed. What happens next?",
      "url": "https://apnews.com/article/netherlands-politics-wilders-elections-parliament-c18fd4e32cc1ab8668f159d6630cf89d",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb2ae99/2147483647/strip/true/crop/7510x4224+0+391/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F8c%2Ffec104acf43dc17b54f6daee9d48%2Fe20fb0c48ee14d62a0a0316fd806f66b"
    },
    {
      "author": "Riazat Butt",
      "description": "Muslims from around the world are in the Saudi city of Mecca for this year's Hajj pilgrimage, one of the Five Pillars of Islam. In the coming days, people will immerse themselves in religious rituals and acts of worship that originated more than 1,400 years ago. They also have to contend with excess heat and other earthly factors, such as a ban on children younger than 12 and a crackdown on unauthorized entry. And although the desert kingdom spends billions on crowd control and cooling, the sheer number of pilgrims and climatic conditions make it difficult to guarantee people’s safety.",
      "publishedAt": "2025-06-04T05:05:08Z",
      "title": "Hajj 2025: Rules, permits and heat",
      "url": "https://apnews.com/article/hajj-saudi-arabia-islam-what-to-know-d0f178a46f33442a39380eb67aa38b15",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2d76f9/2147483647/strip/true/crop/7747x4358+0+404/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F0e%2F3d6ed6adefb4baea4e2cf01edeb8%2F014b37a79a7d4d15a3c59d46127614bc"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}