{
  "articles": [
    {
      "author": "JACK BROOK, STEPHEN SMITH and SARA CLINE",
      "description": "NEW ORLEANS (AP) — The man responsible for the truck attack in New Orleans on New Year's Day that killed 14 people visited the city twice before and recorded video of the French Quarter with Meta smart glasses, an FBI official said Sunday.",
      "publishedAt": "2025-01-05T17:47:48Z",
      "title": "Man behind New Year's attack visited New Orleans before, recorded video with smart glasses, FBI says",
      "url": "https://apnews.com/47fd819355e6d31475529e4f3b1328e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f14dd92b513349d293ca508b7ab16e84/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "The night, like countless others Bourbon Street has welcomed over the decades, started out ripe for celebration. With temperatures hovering in the 50s (10-15 Celsius) hours after the arrival of the new year, the open-air party pulsing down New Orleans’ famed nocturnal artery was still hot, drawing revelers from near and far.",
      "publishedAt": "2025-01-05T05:03:08Z",
      "title": "Drawn to New Orleans' iconic street of celebration, a night of partying becomes a nightmare",
      "url": "https://apnews.com/149bdb38ca0d7fc8e184eb3d32b5de40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93bcf20b61984f3f8ca8728841b69063/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and BRIAN WITTE",
      "description": "A blast of snow, ice, wind and plunging temperatures stirred up dangerous travel conditions in parts of the central U.S.",
      "publishedAt": "2025-01-05T13:03:21Z",
      "title": "The heaviest snowfall in a decade is possible as a wintry blast roils parts of the US",
      "url": "https://apnews.com/da173992b438907b477bcd03afa17897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e46724a1eb804cdca942ffd65fc8afd9/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President Joe Biden on Sunday plans to sign into law a measure that boosts Social Security payments for current and former public employees, affecting nearly 3 million people who receive pensions from their time as teachers, firefighters, police officers and in other public service jobs.",
      "publishedAt": "2025-01-05T14:07:33Z",
      "title": "Higher Social Security payments coming for millions of people from bill that Biden is signing",
      "url": "https://apnews.com/5673001497090043e786ade8a8d0fdb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df9a8b7e60504e14a5c5207902b3d705/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The fourth anniversary of the Jan. 6 attack on the Capitol has a new focus as lawmakers brace for the prospect that President-elect Donald Trump may soon pardon many of the more than 1,500 people charged with crimes for their actions related to the riot.",
      "publishedAt": "2025-01-05T12:46:38Z",
      "title": "Lawmakers brace for Trump's promised Jan. 6 pardons. Some are urging restraint",
      "url": "https://apnews.com/4443c672fc3b1492640684652647cde6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcf1236cd8fd4f79aa4f76092f50a148/3000.jpeg"
    },
    {
      "author": null,
      "description": "Hollywood is getting dressed up as the Golden Globes return for their annual champagne-soaked celebration of film and television workers at the Beverly Hilton in Beverly Hills, California.",
      "publishedAt": "2025-01-05T22:11:18Z",
      "title": "The Latest: The Golden Globes kick off award season",
      "url": "https://apnews.com/2928c45bdb8b7a37281828dc78541eed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f09f39be7834cec80fbfb1867e09b04/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — When Roselins Sequera's family of seven finally reached the U.S. from Venezuela, they spent weeks at a migrant shelter on the Texas border that gave them a place to sleep, meals and tips for finding work.",
      "publishedAt": "2025-01-05T14:10:45Z",
      "title": "Border shelters relieved the pressure during migrant surges. Under Trump, they could become a target",
      "url": "https://apnews.com/333ebd8e72707517926827acee985d7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86d7011387c541769b120ff2b1d90f78/3000.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "NAIROBI, Kenya (AP) — Jimmy Carter was the first U.S. president to make a state visit to sub-Saharan Africa. He once called helping with Zimbabwe’s transition from white rule to independence “our greatest single success.” And when he died at 100, his foundation’s work in rural Africa had nearly fulfilled his quest to eliminate a disease that afflicted millions, for the first time since the eradication of smallpox.",
      "publishedAt": "2025-01-05T05:05:23Z",
      "title": "'Our country ignored Africa,' Jimmy Carter said. He didn't",
      "url": "https://apnews.com/06e637a7554c1a1109bd2a9e1e5390de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/696f26ebda6a42bcb4fd8318aefe516f/2998.jpeg"
    },
    {
      "author": "SAM MEDNICK and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israel has helped a former soldier leave Brazil after legal action was initiated against him by a group accusing Israelis of war crimes in the Gaza Strip based in part on soldiers' social media posts.",
      "publishedAt": "2025-01-05T12:12:13Z",
      "title": "Israel helps former soldier leave Brazil over investigation into alleged war crimes in Gaza",
      "url": "https://apnews.com/43f582190c0fac0896d3e1c547747047",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04342ee58a844efa8986cc8d7cc26c8f/1920.jpeg"
    },
    {
      "author": "JONATHAN LANDRUM JR. and HALELUYA HADERO",
      "description": "Will TikTok be banned this month? That’s the pressing question keeping creators and small business owners in anxious limbo as they await a decision that could upend their livelihoods. The fate of the popular app will be decided by the Supreme Court, which will hear arguments on Jan.",
      "publishedAt": "2025-01-05T12:26:35Z",
      "title": "TikTok creators left in limbo while awaiting decision on potential platform ban",
      "url": "https://apnews.com/079d302b938f546ffedacff32b769569",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe88eee4002c45dc82f5effac5573f72/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}