{
  "articles": [
    {
      "author": null,
      "description": "Israeli warplanes pounded Iran’s capital overnight, hitting a facility used to make uranium centrifuges and another that made missile components, the Israeli military said. It said it had intercepted 10 missiles, as Iran’s retaliatory barrages have diminished since the start of the conflict. Israel has carried out blistering attacks on Iran’s nuclear program and military sites since launching its surprise bombardment on Friday. A Washington-based Iranian human rights group said at least 585 people, including 239 civilians, have been killed and more than 1,300 wounded. Iran has fired some 400 missiles and hundreds of drones in retaliatory strikes that have killed at least 24 people in Israel and wounded hundreds.",
      "publishedAt": "2025-06-18T03:07:27Z",
      "title": "Israeli warplanes hammer Iran's capital as retaliatory missile barrages diminish",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-tehran-trump-06-18-2025-c6c90028dc340e2716724412fcec2cf0",
      "urlToImage": "https://dims.apnews.com/dims4/default/b880542/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2Fd4%2F87e95b39cb6b4a20f82845b431b7%2Fc7bc4d2fe7da4057b6ebc34eb3be6822"
    },
    {
      "author": null,
      "description": "In Iran’s capital city, the streets are empty, businesses closed, communications patchy at best. Panicked masses spend restless nights on the floors of metro stations as strikes boom overhead. The country is just under a week into a fierce Israeli blitz to destroy the country’s nuclear program and its military capabilities. Thousands have fled Tehran, spending hours in gridlock as they head toward the suburbs, the Caspian Sea, or even Armenia or Turkey. But others are stuck in high-rise apartment buildings. They worry and so do their relatives elsewhere.",
      "publishedAt": "2025-06-18T10:50:02Z",
      "title": "Fear grips Tehran as Israeli bombs fall and communicating grows harder",
      "url": "https://apnews.com/article/iranians-tehran-israel-fear-evacuation-9f65e7cd976ad2feb94e5be2eb973be6",
      "urlToImage": "https://dims.apnews.com/dims4/default/19b77d6/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F8b%2F6aecd3b8d3401118f70de8595197%2F6623f3255d2e42a9978f699c841a38fd"
    },
    {
      "author": null,
      "description": "Emergency workers have pulled more bodies from the rubble of a nine-story Kyiv apartment building demolished by a Russian missile. The finds on Wednesday brought the death toll from the attack on the Ukrainian capital the previous day to 28. Authorities said that 23 of those killed were inside the building in one of Kyiv’s districts that took a direct hit and collapsed. It was the deadliest single attack on Kyiv so far this year. Russia fired more than 440 drones and 32 missiles in what Ukrainian President Volodymyr Zelenskyy said was one of the biggest bombardments of the war, now in its fourth year.",
      "publishedAt": "2025-06-18T12:26:50Z",
      "title": "Kyiv death toll rises to 28 after Russian missile attack",
      "url": "https://apnews.com/article/russia-ukraine-war-missile-apartment-building-3fdde58144b0f9b95e564bab53bead65",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d16abd/2147483647/strip/true/crop/1000x563+0+52/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fdd%2F9a289b4c5e1b19ef0f1326cac3de%2F724c5bb5d8174b789625d7ea44d66144"
    },
    {
      "author": null,
      "description": "The Supreme Court has upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights. The justices’ 6-3 decision Wednesday effectively protects from legal challenges many efforts by President Donald Trump’s Republican administration and state governments to roll back protections for transgender people. Another 26 states have laws similar to the one in Tennessee. Chief Justice John Roberts writes for a conservative majority the law does not violate the Constitution’s equal protection clause, which requires the government to treat similarly situated people the same. Justice Sonia Sotomayor writes in a dissent joined by her liberal colleagues that the majority “abandons transgender children and their families to political whims.”",
      "publishedAt": "2025-06-18T14:16:57Z",
      "title": "Supreme Court deals stunning setback to transgender rights in Tennessee case",
      "url": "https://apnews.com/article/supreme-court-transgender-health-care-trump-79fc6f3bbdab2e92d6f0184201a468a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7383f15/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fce%2F4101bc6c62f9af0878b853d89b4a%2F5a0e5010145e46e9a0363399a79c13bf"
    },
    {
      "author": null,
      "description": "The number of Americans applying for unemployment benefits dipped to 245,000 last week amid uncertainty over President Donald Trump’s trade policies. U.S. jobless claims ticked down from 250,000 the week before. Economists had forecast 250,000. The four-week average of claims, which smooths out week-to-week volatility, rose to 245,500, the highest since August 2023. The number of Americans collecting unemployment benefits the week of June 7 slid to 1.95 million.",
      "publishedAt": "2025-06-18T12:40:48Z",
      "title": "US unemployment claims dip",
      "url": "https://apnews.com/article/jobs-unemployment-benefits-claims-economy-trump-tariffs-07b68dcba6b42864913e49e6ebdf33b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/4615e34/2147483647/strip/true/crop/7830x4404+0+407/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F76%2Fa27bc996baab4634ad083efb28f3%2F344925f22a7a402fb50b1a7b5e297521"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth says the Pentagon has provided possible options to President Donald Trump as he decides any next steps on Iran. But Hegseth would not tell lawmakers on Wednesday whether the military was planning to assist with Israeli strikes, an action that could risk dragging America into a wider war in the Middle East. Hegseth is testifying in the last of a series of often combative hearings before Congress. Hegseth said “maximum force protection” is being provided for U.S. troops in the Middle East and that it is Trump’s decision whether to provide Israel a ”bunker buster” bomb to strike at the core of Iran’s nuclear program. He wouldn't indicate what the U.S. may do next.",
      "publishedAt": "2025-06-18T04:02:10Z",
      "title": "Hegseth says has Trump possible options for Israel-Iran conflict",
      "url": "https://apnews.com/article/hegseth-trump-senate-iran-signal-8a0814d29f204addede54202d40e954d",
      "urlToImage": "https://dims.apnews.com/dims4/default/464d656/2147483647/strip/true/crop/7672x4316+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fd8%2F6f6923d6697737ff03ca134602cb%2F27b2bb41a8964ecf93a689da1dc348c9"
    },
    {
      "author": null,
      "description": "Amazon is gearing up to make as 10,000 robotaxis annually at a sprawling plant near Silicon Valley as it prepares to challenge self-driving cab leader Waymo. Tesla CEO Elon Musk is also vying to join the autonomous race. The 220,000-square-foot (20,440-square-meters) robotaxi factory announced Wednesday heralds a new phase in Amazon’s push into a technological frontier. Amazon began eyeing the robotaxi market five years ago when it shelled out $1.2 billion for self-driving startup Zoox, which will be the brand behind a ride-hailing service that plans to charging for rides in Las Vegas late this year. Meanwhile, Waymo's robotaxi service has already given more than 10 million paid rides since 2020.",
      "publishedAt": "2025-06-18T15:04:06Z",
      "title": "Amazon hopes to deliver 10,000 robotaxis annually with new factory, challenging Waymo",
      "url": "https://apnews.com/article/amazon-zoox-robotaxis-manufacturing-plant-8c34ae849ccb10eaa7e6e5266d6de8e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f332dc/2147483647/strip/true/crop/2048x1152+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F6f%2F4c6bee0c91447029d2c088cefbe7%2Fccaf07b6eb844e85962c6d754c4bdba9"
    },
    {
      "author": null,
      "description": "Air India faces fresh turbulence following last week’s fatal crash as additional safety inspections on its Dreamliner fleet lead to flight delays, cancellations and growing passenger anxiety. India Directorate General of Civil Aviation says that since the June 12 crash that killed 270 people, Air India has cancelled operations of 83 wide-body flights including 66 Dreamliner. The regulator says surveillance conducted on Air India’s Dreamliner fleet has found no major safety concerns. Aviation experts say the airline's challenges are temporary and it will continue with ambitious expansion plans, albeit delayed.",
      "publishedAt": "2025-06-18T12:53:57Z",
      "title": "Air India faces turbulence as plane crash prompts deeper checks and disruptions",
      "url": "https://apnews.com/article/air-india-crash-ahmedabad-dreamliner-boeing-tata-25102fbb58822ea572b00fa3da048682",
      "urlToImage": "https://dims.apnews.com/dims4/default/16b20de/2147483647/strip/true/crop/4906x2760+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2Fa8%2F60137538a8ee543780ea936cc1de%2F8c8365cddb534fda9991f57f1540e123"
    },
    {
      "author": null,
      "description": "The European Union has summoned Russia’s envoy to Brussels for an explanation after one of the bloc’s officials was attacked in the Russian city of Vladivostok last month. EU spokesperson Anitta Hipper said Wednesday that the assault occurred on May 26. But the name, nationality and medical condition of the person weren't provided. German news outlet Der Spiegel reports that the diplomat was a Romanian woman who had traveled to the city on official business. She was reportedly attacked after leaving her hotel for an early morning walk. Russia’s representative in Brussels has been summoned “for clarifications.”",
      "publishedAt": "2025-06-18T09:32:32Z",
      "title": "EU summons Russian envoy over attack on diplomat",
      "url": "https://apnews.com/article/eu-europe-diplomat-russia-attack-vladivostok-4e116210be3a8e8ac28051e73683e5f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab4c627/2147483647/strip/true/crop/4663x2623+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fd6%2F8db6ba90174e94978b3d8f91b0ac%2F8b5b5631934942d097c869821be43988"
    },
    {
      "author": null,
      "description": "Humans are the only animal that lives in virtually every possible environment, from rainforests to deserts to tundra. This adaptability is a skill that long predates the modern age. A new study published Wednesday in Nature says ancient Homo sapiens developed the flexibility to survive by finding food and other resources in a wide variety of difficult habitats before they dispersed from Africa about 50,000 years ago.",
      "publishedAt": "2025-06-18T15:01:16Z",
      "title": "Early humans knew how to adapt to challenging and extreme environments, study shows",
      "url": "https://apnews.com/article/ancient-humans-migration-adaptability-homo-sapiens-d7c15932203b50221d3ff321f10da44b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c71269a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Ffb%2Faca243ca8b50814533e6bef9e28b%2Fa346049ca7384daa91790618d37d8ba0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}