{
  "articles": [
    {
      "author": null,
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader presides over a funeral for the country's late president and others killed in a helicopter crash.",
      "publishedAt": "2024-05-22T05:38:45Z",
      "title": "Iran's supreme leader presides over a funeral for the country's late president and others killed in a helicopter crash",
      "url": "https://apnews.com/a0bcfa0518ef4e634d9d5c22bf92c683",
      "urlToImage": ""
    },
    {
      "author": "HANNAH FINGERHUT, SCOTT McFETRIDGE and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — Multiple people were killed when a tornado tore through Greenfield and left a wide swath of obliterated homes, crumpled cars and splintered trees, while outside the small town, massive wind turbines were buckled and twisted to the ground by the howling winds.",
      "publishedAt": "2024-05-22T04:39:47Z",
      "title": "Tornado kills multiple people in Iowa as powerful storms again tear through Midwest",
      "url": "https://apnews.com/26c73e14ab481ef77a1b0606a2b10adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc105154ff864226b7b100c3e9a9762e/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Chaim Otmazgin had tended to dozens of shot, burned or mutilated bodies before he reached the home that would put him at the center of a global clash.Working in a kibbutz that was ravaged by Hamas’ Oct.",
      "publishedAt": "2024-05-22T04:02:32Z",
      "title": "How 2 debunked accounts of sexual violence on Oct. 7 fueled a global dispute over Israel-Hamas war",
      "url": "https://apnews.com/ca7905bf9520b1e646f86d72cdf03244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/220ab346edef4b9686324ec0fa93fb6c/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, LEE KEATH and TIA GOLDENBERG",
      "description": "CAIRO (AP) — The United Nations suspended food distribution in the southern Gaza city of Rafah on Tuesday due to a lack of supplies and an untenable security situation caused by Israel’s expanding military operation.",
      "publishedAt": "2024-05-21T07:38:07Z",
      "title": "UN halts all food distribution in Rafah after running out of supplies in the southern Gaza city",
      "url": "https://apnews.com/a3320a77a3a6ccff41db2a4bc63e4aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0731ab89e44561a9536e4e96d48b13/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader presided over a funeral Wednesday for the country's late president, foreign minister and others killed in a helicopter crash. Ayatollah Ali Khamenei held the service at Tehran University, the caskets of the dead draped in Iranian flags with their pictures on them.",
      "publishedAt": "2024-05-22T05:15:14Z",
      "title": "Iran's supreme leader presides over funeral for president and others killed in helicopter crash",
      "url": "https://apnews.com/2a66914de4e15c5033fcd688cf262275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf35be861b1944b9b870f1cfe08ab955/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Donald Trump’s legal team rested its case Tuesday in his hush money trial after calling just two witnesses and opting not to have the former president take the stand in his own defense.",
      "publishedAt": "2024-05-21T23:29:25Z",
      "title": "Trump's lawyers rested their case after calling just 2 witnesses. Experts say that's not unusual",
      "url": "https://apnews.com/7e2f310bc30eb5ce4287e04ba8fedeb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/826f2ce8a19140c7b801f2e5d10cf110/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Sustained Russian attacks on Ukraine's power grid in recent weeks have forced leaders of the war-ravaged country to institute nationwide rolling blackouts. Without adequate air defenses to counter assaults and allow for repairs, though, the shortages could still worsen as need spikes in late summer and the bitter-cold winter.",
      "publishedAt": "2024-05-22T04:10:34Z",
      "title": "Russian attacks on Ukraine power grid touch Kyiv with blackouts ahead of peak demand",
      "url": "https://apnews.com/c763050237bcc1388747283bf336f8ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3752b1ace29d4a5680fbdf8dbbfe9e57/3000.jpeg"
    },
    {
      "author": "NAPAT KONGSAWAD",
      "description": "BANGKOK (AP) — Singapore Airlines said a relief plane flew into Singapore early Wednesday morning with most of the passengers who were on a flight that was battered by severe turbulence over the Indian Ocean and had to make an emergency landing in Bangkok after one man died and dozens of people were injured.",
      "publishedAt": "2024-05-22T04:29:53Z",
      "title": "Most of passengers from battered Singapore Airlines jetliner arrive in Singapore from Bangkok",
      "url": "https://apnews.com/a6aec916cf38cc82b122198a35b95fd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/447b546de3db49389fc13830587137e9/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Israel's shutdown and seizure of an Associated Press video camera that provided a live glimpse into Gaza alarmed many journalists, who worried Tuesday about wider implications for coverage of a war largely fought out of the world's sight to begin with.",
      "publishedAt": "2024-05-21T20:48:44Z",
      "title": "Israel's block of AP transmission shows how ambiguity in law could restrict war coverage",
      "url": "https://apnews.com/3bcd8b15d6a7a1209a1fb05ee0db860e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bca2d867bf9456c9b03a1085e95f3ba/3000.jpeg"
    },
    {
      "author": null,
      "description": "EL SEGUNDO, Calif. (AP) — Barbie dolls will honor tennis champion Venus Williams and eight other athletes as part of a project announced by Mattel on Wednesday.The others being depicted as dolls are gymnasts Rebeca Andrade and Alexa Moreno, soccer players Mary Fowler and Christine Sinclair, boxer Estelle Mossely, swimmer Federica Pellegrini, paratriathlete Susana Rodriguez and track and field sprinter Ewa Swoboda.",
      "publishedAt": "2024-05-22T04:02:25Z",
      "title": "Barbie will make dolls to honor Venus Williams and other star athletes",
      "url": "https://apnews.com/16403d9051089523fa3cc5df97838e07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b28bf1bcd36b440f98a9a9ee3a452c48/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}