{
  "articles": [
    {
      "author": "SAM MEDNICK and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — A delegation of the Palestinian militant group Hamas was in Cairo on Saturday as Egyptian state media reported “noticeable progress” in cease-fire talks with Israel, though an Israeli official downplayed the prospects for a full end to the war in Gaza.",
      "publishedAt": "2024-05-04T11:15:59Z",
      "title": "There's progress reported in Gaza truce talks, but Israel downplays chances of ending war with Hamas",
      "url": "https://apnews.com/4eae8b7a75440d4dd9a201219d60bcd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2c9169235c944e4896a869b5ba1fc33/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Crucial witnesses took the stand in the second week of testimony in Donald Trump's hush money trial, including a California lawyer who negotiated deals at the center of the case and a longtime adviser to the former president.",
      "publishedAt": "2024-05-04T11:59:24Z",
      "title": "Hulk Hogan, hurricanes and a blockbuster recording: A week in review of the Trump hush money trial",
      "url": "https://apnews.com/9be06e3d33c25af7060552a44001cc1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/309df97f299444728ec07e3af8822073/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, JILL COLVIN and CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Joe Biden and Donald Trump are two presidents with unfinished business and an itch to get it done.",
      "publishedAt": "2024-05-04T04:02:43Z",
      "title": "Biden and Trump offer worlds-apart contrasts on issues in 2024's rare contest between 2 presidents",
      "url": "https://apnews.com/1a904cd70f14581f264b851a5cb2f9e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d08e7b35ef4a38939a6264d4132856/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "NAMPA, Idaho (AP) — Waiting in a long post office line with the latest shipment of “abortion aftercare kits,” Kimra Luna got a text. A woman who’d taken abortion pills three weeks earlier was worried about bleeding — and disclosing the cause to a doctor.",
      "publishedAt": "2024-05-04T12:47:33Z",
      "title": "After Roe, the network of people who help others get abortions see themselves as 'the underground'",
      "url": "https://apnews.com/f760b2817126d56e6cfa5144c9f7e547",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3aeaa1cb9d114627a27841e58c3934a3/3000.jpeg"
    },
    {
      "author": "PATRICK ORSAGOS and MICHAEL RUBINKAM",
      "description": "KENT, Ohio (AP) — Dean Kahler flung himself to the ground and covered his head when the bullets started flying. The Ohio National Guard had opened fire on unarmed war protesters at Kent State University, and Kahler, a freshman, was among them.",
      "publishedAt": "2024-05-03T18:50:48Z",
      "title": "Troops fired on Kent State students in 1970. Survivors see echoes in today's campus protests",
      "url": "https://apnews.com/ac60fdcb2a2dc852e49ee9fc2e6aaf31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/907de74cf75a4bc4a4be9eb60e484a8f/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — High waters flooded neighborhoods around Houston on Saturday following heavy rains that have already resulted in crews rescuing more than 300 people from homes, rooftops and roads engulfed in murky water.",
      "publishedAt": "2024-05-04T05:03:47Z",
      "title": "Houston braces for flooding to worsen in wake of storms",
      "url": "https://apnews.com/bdac71b839dc0966cd03288113956279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e72ac835221b48f6b976dd5c4b9ba011/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia has put Ukrainian President Volodymyr Zelenskyy on its wanted list, Russian state media reported Saturday, citing the interior ministry’s database.",
      "publishedAt": "2024-05-04T16:10:10Z",
      "title": "Russia puts Ukrainian President Zelenskyy on its wanted list",
      "url": "https://apnews.com/e9714751f2481575aaf8935b132e0f31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ddfc9e1b34f4425a302fceefdb66493/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — The student protest movement disrupting university campuses, classes and graduation ceremonies over the war in Gaza is also roiling Senate contests across the nation as Democrats tread cautiously over an internal divide and Republicans play up their rivals' disagreements.",
      "publishedAt": "2024-05-04T15:27:20Z",
      "title": "Senate races are roiled by campus protests over the war in Gaza as campaign rhetoric sharpens",
      "url": "https://apnews.com/dda4fcf2071e08e31c84115fc10d4156",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/460f2824c7324bffb62f3f2807136b26/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — After years of delays and stumbles, Boeing is finally poised to launch astronauts to the International Space Station for NASA.It’s the first flight of Boeing’s Starliner capsule with a crew on board, a pair of NASA pilots who will check out the spacecraft during the test drive and a weeklong stay at the space station.",
      "publishedAt": "2024-05-04T12:57:50Z",
      "title": "Boeing is on the verge of launching astronauts aboard new capsule, the latest entry to space travel",
      "url": "https://apnews.com/86085ceba30de94218c7cf2f70524413",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61c6404e167a4b9c9020204db0089ede/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Warren Buffett's Berkshire Hathaway reported a steep drop in earnings Saturday as the paper value of its investments plummeted and it pared its Apple holdings. Nevertheless, tens of thousands of shareholders looked forward to hearing from Buffett directly, buoyed by a jump in performance of the many companies Berkshire operates directly.",
      "publishedAt": "2024-05-04T04:04:04Z",
      "title": "Berkshire Hathaway's profits plunge 64% even as thousands gather to soak up Buffett's wisdom",
      "url": "https://apnews.com/b345638b402f5ef2f9f9d7080eff0978",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e8b42590e104a1ba453aec05de346d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}