{
  "articles": [
    {
      "author": "AUDREY MCAVOY, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "KAHULUI, Hawaii (AP) — A wildfire tore through the heart of the Hawaiian island of Maui in darkness Wednesday, reducing much of a historic town to ash and forcing people to jump into the ocean to flee the flames.",
      "publishedAt": "2023-08-09T12:08:25Z",
      "title": "Wildfire on Maui kills at least 6, damages over 270 structures as it sweeps through historic town",
      "url": "https://apnews.com/ec23c16abfbeb6ba689f1a98263720db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb5a732fcb74c36aecacb8ddee16ecd/1920.jpeg"
    },
    {
      "author": "GONZALO SOLANO",
      "description": "QUITO, Ecuador (AP) — An Ecuadorian presidential candidate known for speaking up against corruption was shot and killed Wednesday at a political rally in the capital amid a wave of startling violence in the South American country.",
      "publishedAt": "2023-08-10T00:59:39Z",
      "title": "Anti-corruption presidential candidate assassinated at campaign event in Ecuador's capital",
      "url": "https://apnews.com/ee9c726b82c09e16e5dacde2d6f005ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64fd168b27844832aef84c70ec81a701/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Special counsel Jack Smith's team obtained a search warrant in January for records related to former President Donald Trump's Twitter account, and a judge levied a $350,000 fine on the company for missing the deadline to comply, according to court documents released Wednesday.",
      "publishedAt": "2023-08-09T16:59:24Z",
      "title": "Special counsel got a search warrant for Twitter to turn over info on Trump's account, documents say",
      "url": "https://apnews.com/9e66943fd7ebdae0038838c144b57d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf3c9e7fb9df4f6c9d1c98f833c06051/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden signed an executive order Wednesday to block and regulate high-tech U.S.-based investments going toward China — a move the administration said was targeted but it also reflected an intensifying competition between the world's two biggest powers.",
      "publishedAt": "2023-08-09T20:00:31Z",
      "title": "Biden issues an executive order restricting US investments in Chinese technology",
      "url": "https://apnews.com/dd6a5b138e6c7cba31468dc89f776e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24c60619b31e4a0782a167817857f707/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and SAM METZ",
      "description": "PROVO, Utah (AP) — An armed Utah man accused of making violent threats against President Joe Biden was shot and killed by FBI agents hours before the president landed in the state Wednesday, authorities said.",
      "publishedAt": "2023-08-09T19:51:57Z",
      "title": "Utah man suspected of threatening President Joe Biden shot and killed as FBI served warrant",
      "url": "https://apnews.com/ba3cc1d3b2f6cca8bd429febdcf04219",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcb043f447c444f2aec312f3718aabc7/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG, YONG JUN CHANG and AHN YOUNG-JOON",
      "description": "BUSAN, South Korea (AP) — A strong tropical storm blew ashore in South Korea on Thursday morning, dumping heavy rain and pummeling its southern regions after thousands of people were evacuated. More than 30 centimeters (a foot) of rain has fallen already in parts of the mainland and some streets were flooded.",
      "publishedAt": "2023-08-10T00:30:12Z",
      "title": "Khanun blows strong winds and heavy rains into South Korea, where thousands evacuated the coast",
      "url": "https://apnews.com/544ab746065f89ccc768974979fb8447",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/905cb875e13c4063ac587513f8601967/3000.jpeg"
    },
    {
      "author": "SARA BURNETT and CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Abortion wasn't technically on the ballot in Ohio's special election. But the overwhelming defeat of a measure that would have made it tougher to enshrine abortion rights in the state constitution this fall was the latest indicator that the issue remains a powerful force at the ballot box.",
      "publishedAt": "2023-08-09T15:21:57Z",
      "title": "Ohio vote shows enduring power of abortion rights at ballot box, giving Democrats a path in 2024",
      "url": "https://apnews.com/e3db04beec5c1edd860df5d648adfd60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9623e5230e164263beca8252ed967876/1920.jpeg"
    },
    {
      "author": "DENISE LAVOIE and SARAH RANKIN",
      "description": "RICHMOND, Va. (AP) — The Virginia Department of Corrections, under scrutiny over the death of an inmate that raised broader questions about conditions at a southwest Virginia prison, is refusing to release public records documenting inmate complaints about the facility.",
      "publishedAt": "2023-08-09T22:32:25Z",
      "title": "Virginia prison officials won't divulge complaints about facility where inmate died",
      "url": "https://apnews.com/50e2383280872337cb209dc0f926844b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8da71130fd5c4d28aa9d4a376c3aef9d/2000.jpeg"
    },
    {
      "author": "MICKENSON DUVERGÉ and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Kidnappers in Haiti released a U.S. nurse and her daughter Wednesday, nearly two weeks after they were snatched at gunpoint from the campus of a Christian-run school near Port-au-Prince, underscoring the severe security risks for visitors to a capital city largely controlled by gangs.",
      "publishedAt": "2023-08-09T14:04:38Z",
      "title": "Kidnappers in Haiti release US nurse and her young daughter nearly 2 weeks after their abduction",
      "url": "https://apnews.com/3235714657b1797bd682ca4ead3706f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73b4c7e4f57a4c0ea9cf18e305eaac7e/1619.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — It was born in the break, all those decades ago — that moment when a song's vocals dropped, instruments quieted down and the beat took the stage. It was then that hip-hop came into the world, taking the moment and reinventing it.",
      "publishedAt": "2023-08-09T10:02:14Z",
      "title": "Hip-hop turns 50, reinventing itself and swaths of the world along the way",
      "url": "https://apnews.com/fbedc18c6b2a0448e23e2656292b4045",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34c1dc47ac8d4d249309bcb77508c292/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}