{
  "articles": [
    {
      "author": "WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza (AP) — An international team of doctors visiting a hospital in central Gaza was prepared for the worst. But the gruesome impact Israel’s war against Hamas is having on Palestinian children still left them stunned.",
      "publishedAt": "2024-03-28T04:16:20Z",
      "title": "Doctors visiting a Gaza hospital are stunned by the war's toll on Palestinian children",
      "url": "https://apnews.com/7c7a6117efae29e22a61e82151144613",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/992bc46a3df0455d8f920a2f5630ffc1/3000.jpeg"
    },
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — The cargo ship that lost power and crashed into a bridge in Baltimore underwent “routine engine maintenance” in port beforehand, the U.S. Coast Guard said Wednesday, as divers recovered the bodies of two of six workers who plunged into the water when it collapsed.",
      "publishedAt": "2024-03-27T04:03:00Z",
      "title": "Cargo ship had engine maintenance in port before it collided with Baltimore bridge, officials say",
      "url": "https://apnews.com/6a95340e5daeff6551fc999d23feb278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85efe81048ec465ea68a041e73ad1975/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "When a 900-foot container ship struck the San Francisco–Oakland Bay Bridge in 2007, the span stood firm and no one died, either on the ship or the highway above. The bridge's supports were protected by a fendering system of concrete and other materials that was installed to absorb such strikes.",
      "publishedAt": "2024-03-27T23:28:03Z",
      "title": "Debate emerges over whether modern protections could have saved Baltimore bridge",
      "url": "https://apnews.com/2557307101e6094b43fef70c30eef808",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67ac4e552e18439e8bed01986f7ae87d/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — Former U.S. Sen. Joe Lieberman of Connecticut, who nearly won the vice presidency on the Democratic ticket with Al Gore in the disputed 2000 election and who almost became Republican John McCain's running mate eight years later, has died, according to a statement issued by his family.",
      "publishedAt": "2024-03-27T21:48:36Z",
      "title": "Former Sen. Joe Lieberman, Democrats’ VP pick in 2000, dead at 82",
      "url": "https://apnews.com/c82d9c92c1c4493fa5d708719884b12d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/743d36b7de564a65bbbd930dc217fa9d/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The charges against former President Donald Trump in the Georgia election interference case seek to criminalize political speech and advocacy conduct that the First Amendment protects, his lawyers argued in a court filing challenging the indictment.",
      "publishedAt": "2024-03-28T04:10:43Z",
      "title": "Judge forges ahead with pretrial motions in Georgia election interference case",
      "url": "https://apnews.com/b741e2e5abf40d61edb004a89bee1716",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a410fbae2cc8490f860c2aa85151f554/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and COLLEEN LONG",
      "description": "WASHINGTON (AP) — Political donors can typically expect to see one president when they buy tickets to a reelection fundraiser, but this Thursday will give them a rare opportunity to hear from three at once.",
      "publishedAt": "2024-03-28T04:03:46Z",
      "title": "3 presidents. Many stars. 1 New York fundraiser",
      "url": "https://apnews.com/ebfbc81d3b70f38745ae00c7ce6a382d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eed45efb971a426ab1e213d7c6ca36db/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — For over a month, House Speaker Mike Johnson has sat on a funding package that would send desperately needed ammunition and weaponry to Ukraine, mulling how best to gain a grasp of what is expected to be a difficult lift in the House.",
      "publishedAt": "2024-03-27T18:13:36Z",
      "title": "House Speaker Mike Johnson is committed to advancing Ukraine aid. But it will be a difficult task",
      "url": "https://apnews.com/6ca638103f0286405144891604f92de3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e7222fb3d248d0b87ae1d07cd1ed2a/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Talks have restarted aimed at bringing top Israeli officials to Washington to discuss potential military operations in Gaza, after Prime Minister Benjamin Netanyahu canceled a planned visit this week because he was angry about the U.S.",
      "publishedAt": "2024-03-27T18:22:02Z",
      "title": "Talks resume on bringing Israeli officials to the US to discuss Gaza operation, the White House says",
      "url": "https://apnews.com/44726f9157bbccbbb9756cf2aa56549c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f27e485fe8d495b988882ce4366719d/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER SHERMAN, ELLIOT SPAGAT and VALERIE GONZALEZ",
      "description": "MEXICO CITY (AP) — Venezuelan migrants often have a quick answer when asked to name the most difficult stretch of their eight-country journey to the U.S. border, and it's not the dayslong jungle trek through Colombia and Panama with its venomous vipers, giant spiders and scorpions.",
      "publishedAt": "2024-03-28T04:24:24Z",
      "title": "Venezuelans are increasingly stuck in Mexico, explaining drop in illegal crossings to US",
      "url": "https://apnews.com/09ba20bda36590024e433153800ab86d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf790c2564d44be181e2256c7d8a4c87/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Security in Congo’s mineral-rich east has deteriorated since recent elections, with a rebel group allegedly linked to neighboring Rwanda making “significant advances and expanding its territory,” the U.N.",
      "publishedAt": "2024-03-28T00:22:24Z",
      "title": "Security in Congo's mineral-rich east is deteriorating with rebel group expanding territory, UN says",
      "url": "https://apnews.com/7cb66d4e9f05931fefc350d166110d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7188d8c086a42039ed792f48276c005/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}