{
  "articles": [
    {
      "author": "JON GAMBRELL and AMIR VAHDAT",
      "description": "DUBAI, United Arab Emirates (AP) — Reformist candidate Masoud Pezeshkian won Iran’s runoff presidential election Saturday, besting hard-liner Saeed Jalili by promising to reach out to the West and ease enforcement on the country’s mandatory headscarf law after years of sanctions and protests squeezing the Islamic Republic.",
      "publishedAt": "2024-07-06T01:43:33Z",
      "title": "Reformist Pezeshkian wins Iran's presidential runoff election, besting hard-liner Jalili",
      "url": "https://apnews.com/8a10c940adc1259566791b549828a3fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96bdc4d5278c4b3aa37b1768c85ba8d9/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "MADISON, Wis. (AP) — President Joe Biden, fighting to save his endangered reelection effort, used a highly anticipated TV interview Friday to repeatedly reject taking an independent medical evaluation that would show voters he is up for serving another term in office while blaming his disastrous debate performance on a “bad episode” and saying there were “no indications of any serious condition.\"",
      "publishedAt": "2024-07-05T15:42:40Z",
      "title": "Biden dismisses age questions in interview as he tries to salvage reelection effort",
      "url": "https://apnews.com/e4657f86f5e82b10a5fefb526bc49b08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cf72a570123431992af72f3bfe704d5/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — For years it's been a Republican scare tactic.A vote to reelect President Joe Biden, the GOP often charges, is really a vote for Vice President Kamala Harris.",
      "publishedAt": "2024-07-05T23:09:49Z",
      "title": "Republicans turn their focus to Harris as talk of replacing Biden on Democratic ticket intensifies",
      "url": "https://apnews.com/1963d49f48696dafe2f7558c2dc1cc9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbc822f0e1bf482eb3e936f294ad8cf2/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — New British Prime Minister Keir Starmer doesn’t get to take a breather.",
      "publishedAt": "2024-07-06T04:09:40Z",
      "title": "A NATO summit and mending EU relations are among first tasks for new UK leader Keir Starmer",
      "url": "https://apnews.com/0da1da8a74c6196518059d7d9fbcf77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ba7a1a60ae2481480bf38d3a9f904b4/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The message to NATO from President Vladimir Putin was simple and stark: Don't go too far in providing military support for Ukraine, or you'll risk a conflict with Russia that could quickly turn nuclear.",
      "publishedAt": "2024-07-06T04:18:34Z",
      "title": "Putin sees no need for nuclear weapons to win in Ukraine. But he's also keeping his options open",
      "url": "https://apnews.com/105bc866524d32013a3a4a37ddcef98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da360c8463d74fa4bf334772d04671b2/3000.jpeg"
    },
    {
      "author": "MARTÍN SILVA and JIM VERTUNO",
      "description": "TULUM, Mexico (AP) — After battering Mexico’s Yucatan Peninsula, Beryl moved back into the warm waters of the Gulf of Mexico where it was expected to regain hurricane strength Saturday before taking aim at the Texas coast, where officials urged residents to brace for a potential hit.",
      "publishedAt": "2024-07-06T04:22:51Z",
      "title": "After hitting Yucatan Peninsula, Beryl churns in Gulf of Mexico as Texas braces for potential hit",
      "url": "https://apnews.com/44213c236b068d561b95255445d82de7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb87a92c0ab04c6a86584fec77eefc08/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH, REBECCA BOONE and SCOTT SONNER",
      "description": "PORTLAND, Ore. (AP) — Records tumbled across the West as a slow-moving heat wave of potentially historic proportions tightened its grip from the Pacific Northwest to Arizona on Friday, sending many residents in search of a cool haven from the dangerously high temperatures.",
      "publishedAt": "2024-07-05T22:13:07Z",
      "title": "Records tumble as dangerous heat wave scorches the US West and beyond, with the worst yet to come",
      "url": "https://apnews.com/53fa1470c610f1f8254a8cf9a23c51c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b685d9fade1b4c16b89f21ae68f944e8/3000.jpeg"
    },
    {
      "author": null,
      "description": "GAZA CITY, Gaza Strip (AP) — Thousands of displaced Palestinians in northern Gaza have sought refuge in one of the territory’s largest soccer arenas, where families now scrape by with little food or water as they try to keep one step ahead of Israel's latest offensive.",
      "publishedAt": "2024-07-06T00:55:18Z",
      "title": "Gaza soccer stadium is now a shelter for thousands of displaced Palestinians",
      "url": "https://apnews.com/ef44b9d786d2133bd024a55c3f0bddcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdd38dad8fc2420a936bf4cdd1201136/1920.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — The highest camp on the world’s tallest mountain is littered with garbage that is going to take years to clean up, according to a Sherpa who led a team that worked to clear trash and dig up dead bodies frozen for years near Mount Everest’s peak.",
      "publishedAt": "2024-07-06T03:09:03Z",
      "title": "Mount Everest's highest camp is littered with frozen garbage, and cleanup is likely to take years",
      "url": "https://apnews.com/0e123e215854b2c2a172492769348ee6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2962b75cd0f42ddbd1c2053a6bfdb0b/3000.jpeg"
    },
    {
      "author": "JACK DURA",
      "description": "BISMARCK, N.D. (AP) — A Native American tribe in North Dakota will soon grow lettuce in a giant greenhouse complex that when fully completed will be among the country's largest, enabling the tribe to grow much of its own food decades after a federal dam flooded the land where they had cultivated corn, beans and other crops for millennia.",
      "publishedAt": "2024-07-06T04:05:14Z",
      "title": "North Dakota tribe goes back to its roots with a massive greenhouse operation",
      "url": "https://apnews.com/83e812bc15090d73c8492b7904dddfcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a4b67bb9f1d4a60851521da15338629/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}