{
  "articles": [
    {
      "author": null,
      "description": "MELBOURNE, Australia (AP) — Defending champion U.S. crashes out of Women's World Cup after losing to Sweden on penalty kicks in round of 16.",
      "publishedAt": "2023-08-06T11:47:08Z",
      "title": "Defending champion U.S. crashes out of Women's World Cup after losing to Sweden on penalty kicks in round of 16",
      "url": "https://apnews.com/195370e4cbf2aaf440cfe8ee61f1d89c",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "The Justice Department has asked a federal judge overseeing the criminal case against former President Donald Trump in Washington to step in after he released a post online that appeared to promise revenge on anyone who goes after him.",
      "publishedAt": "2023-08-05T02:59:03Z",
      "title": "Prosecutors ask judge to issue protective order after Trump post appearing to promise revenge",
      "url": "https://apnews.com/71cd642e876c47fff4e1283c15f8ca01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7955bd9fa14f9d84d6d7d56691e48d/2915.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "KYIV, Ukraine (AP) — Three people have died during a night of air strikes and intense shelling across Ukraine, officials said Sunday, while Moscow's second-largest airport briefly suspended flights following a foiled drone attack near the Russian capital.",
      "publishedAt": "2023-08-06T09:43:01Z",
      "title": "Overnight airstrikes kill three in Ukraine as Moscow airport halts flights after foiled drone attack",
      "url": "https://apnews.com/9afba9271d343cd7f077211ff8507b88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be909addb13842e3bd87d4bb52aae871/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Monica Lee sat outside her parents' home, where a former Mississippi sheriff’s deputy pummeled her son, who died hours later in the hospital.It was a sweltering afternoon in Braxton — the same town where, in a separate episode, six white law enforcement officers tortured two other Black men in January, shaking seasoned federal prosecutors, elected officials and ordinary people to their core.",
      "publishedAt": "2023-08-06T04:03:18Z",
      "title": "Racist abuse by Mississippi officers reveals a culture of misconduct, residents say",
      "url": "https://apnews.com/1feb54483e62bef53efe1a1a16be29f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63885d539f6b41f3a630dd30bd538bd2/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, BARRY HATTON and HELENA ALVES",
      "description": "LISBON, Portugal (AP) — Pope Francis told young people on Sunday the Catholic Church needs them and urged them to follow their dreams as he wrapped up World Youth Day in Portugal with a massive open-air Mass and an announcement that the next edition would be held in Asia for the first time in three decades.",
      "publishedAt": "2023-08-06T07:56:29Z",
      "title": "Pope announces World Youth Day to return to Asia in 2027, urges young people 'not to be afraid'",
      "url": "https://apnews.com/fbba174e62a8205557140e37d5b3356c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16d09bdb206548e7bc4f535deb56eb1a/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER",
      "description": "JUNEAU, Alaska (AP) — Thousands of tourists spill onto a boardwalk in Alaska’s capital city every day from cruise ships towering over downtown. Vendors hawk shoreside trips and rows of buses stand ready to whisk visitors away, with many headed for the area’s crown jewel: the Mendenhall Glacier.",
      "publishedAt": "2023-08-06T06:13:00Z",
      "title": "Crammed with tourists, Alaska's capital wonders what will happen as its magnificent glacier recedes",
      "url": "https://apnews.com/281e736286abb62d7cee9c6bb6dc8dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acea2186c1c44de09118d0a7a8f9df62/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "ST. GEORGE, S.C. (AP) — As Ralph James settled into the restored, highbacked desk at the segregated school he attended in rural South Carolina, he remembered the old school bell, the cascading light through tall windows, the Christmas pageant and the basketball court just outside.",
      "publishedAt": "2023-08-06T04:07:58Z",
      "title": "Rosenwald Schools helped educate Black students in segregated South. Could a national park follow?",
      "url": "https://apnews.com/066bc6432ab348627120bd057c93c326",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80aa68c5137e4c95aacf74df32f76e73/3000.jpeg"
    },
    {
      "author": "JACK DURA",
      "description": "DICKINSON, N.D. (AP) — Maksym Bunchukov remembers hearing rockets explode in Zaporizhzhia as the war in Ukraine began.“It was terrible,” he said. He and his wife sent their adult daughter west to Lviv for safety and joined her later with their pets.",
      "publishedAt": "2023-08-06T04:35:57Z",
      "title": "Ukrainians move to North Dakota for oil field jobs to help families facing war back home",
      "url": "https://apnews.com/f70399d4bb0af7e043359a45c4cbcf2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ba57d632e774edaa5d54a86428398a7/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — The deadline has arrived Sunday for Niger’s military junta to reinstate the country’s ousted president, but the West Africa regional bloc that has threatened a military intervention faces prominent appeals to pursue more peaceful means.",
      "publishedAt": "2023-08-06T08:53:39Z",
      "title": "A deadline has arrived for Niger's junta to reinstate the president. Residents brace for what's next",
      "url": "https://apnews.com/90b4ce18a4235606f49597bef268b87a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/953f2e872d2f4b259160a3c7fab6f296/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}