{
  "articles": [
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The viability of a U.S.-backed proposal to wind down the 8-month-long war in Gaza was cast into doubt on Monday after Israeli Prime Minister Benjamin Netanyahu said he would only be willing to agree to a “partial” cease-fire deal that would not end the war, comments that sparked an uproar from families of hostages held by Hamas.",
      "publishedAt": "2024-06-24T07:30:44Z",
      "title": "Netanyahu says he won't agree to a deal that ends the war in Gaza, testing the latest truce proposal",
      "url": "https://apnews.com/f5de2ed8288ac3cdb02c4e9e2fbaeda1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e723d6b53d4468b9acb52fee291c357/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — In the coming days, the Supreme Court will confront a perfect storm mostly of its own making: a trio of decisions stemming directly from the Jan.",
      "publishedAt": "2024-06-24T10:12:43Z",
      "title": "Is Trump shielded from criminal charges as an ex-president? A nation awaits word from Supreme Court",
      "url": "https://apnews.com/acebc079bdaa6257bfd70a90a71a2ca0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e96f562df245e1a1f5271421833359/2028.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Millions of Americans sweated through a scorching weekend as temperatures soared across the U.S., while residents were rescued from floodwaters that forced evacuations across the Midwest.",
      "publishedAt": "2024-06-24T05:09:36Z",
      "title": "Sweltering temperatures persist across the US, while floodwaters inundate the Midwest",
      "url": "https://apnews.com/7f7211b34718fb529d2bf8e4395f1140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7ec82c00430433d900172e350d5af29/1920.jpeg"
    },
    {
      "author": "VANESSA G. SANCHEZ and PHILLIP REESE/KFF Health News and DEVNA BOSE/Associated Press",
      "description": "CHARLOTTE, N.C. (AP) — Four months after seeking asylum in the U.S., Fernando Hermida began coughing and feeling tired. He thought it was a cold. Then sores appeared in his groin and he would soak his bed with sweat.",
      "publishedAt": "2024-06-24T10:00:08Z",
      "title": "Young gay Latinos see a rising share of new HIV cases, leading to a call for targeted funding",
      "url": "https://apnews.com/ca5f73b064e5ed491ee0315dd60d69d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e321794a9842eb97255f3b5cc9b13a/3000.jpeg"
    },
    {
      "author": "JEFF AMY and BILL BARROW",
      "description": "FAYETTEVILLE, Ga. (AP) — President Joe Biden and former President Donald Trump will meet for their first general election debate Thursday in Georgia, the battleground that yielded the closest 2020 margin of any state and became the epicenter of Trump’s efforts to overturn Biden’s election.",
      "publishedAt": "2024-06-24T04:01:37Z",
      "title": "In one affluent Atlanta suburb, Biden and Trump work to win over wary Georgia voters",
      "url": "https://apnews.com/d2dcf99c2a99155d0b37436690e02596",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9d99735023042d7bb679e4c412e9ea1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Cab drivers and bikers tap away furiously on their mobile phones as they wait at red lights in the Iranian capital during an early June heatwave. Some pedestrians in Tehran are doing the same.",
      "publishedAt": "2024-06-24T05:10:56Z",
      "title": "'Hamster' crypto craze has taken Iran. It highlights economic malaise ahead of presidential election",
      "url": "https://apnews.com/934a398a0d2074c04bbf0112d701086f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75c251f3e7c408e9b5382827deb9dea/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia’s southern region of Dagestan held the first of three days of mourning Monday following a rampage by Islamic militants who killed 19 people, most of them police, and attacked houses of worship in apparently coordinated assaults in two cities.",
      "publishedAt": "2024-06-24T10:16:22Z",
      "title": "Russian region of Dagestan holds a day of mourning after attacks kill 19 people",
      "url": "https://apnews.com/84b57fbaa2d087eeb4ef87fa73b65f74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21f07d534a0d417c9a3c7b97736cbd63/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — A fire likely sparked by exploding lithium batteries swept through a manufacturing factory near South Korea’s capital on Monday, killing 22 mostly Chinese migrant workers and injuring eight, officials said.",
      "publishedAt": "2024-06-24T06:47:43Z",
      "title": "A fire at a lithium battery factory in South Korea kills 22 mostly Chinese migrant workers",
      "url": "https://apnews.com/4e668dc7248e4de274aaf910c66359a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85dedbe59a1042a284481501c89a1640/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "KIBBUTZ NIR OZ, Israel (AP) — A new kind of tourism has emerged in Israel in the months since Hamas’ Oct. 7 attack. For celebrities, politicians, influencers and others, no trip is complete without a somber visit to the devastated south that absorbed the brunt of the assault near the border with Gaza.",
      "publishedAt": "2024-06-24T04:39:10Z",
      "title": "Some visitors to Israel have a new stop on their tours: Hamas' destruction in the south",
      "url": "https://apnews.com/8b21f590c37fa6780bf9190d6bfb62b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af010d0b86cd42f88d865ed585bc9851/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Before Emperor Naruhito of Japan attends a banquet hosted by King Charles III, lays a wreath at Westminster Abbey or tours one of Britain’s premier biomedical research institutes, he'll kick off this week’s trip to the U.K.",
      "publishedAt": "2024-06-24T05:07:55Z",
      "title": "Japanese emperor to reconnect with the River Thames in state visit meant to bolster ties with UK",
      "url": "https://apnews.com/0ed3e261c150ec714e4d1a1a919238a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46de719622ea4959ad4da3c986dcac39/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}