{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump’s special envoy Steve Witkoff says the U.S. is cutting short Gaza ceasefire talks and bringing home its negotiating team from Qatar for consultations after the latest response from Hamas “shows a lack of desire to reach a ceasefire in Gaza.” Witkoff said Thursday, “While the mediators have made a great effort, Hamas does not appear to be coordinated or acting in good faith.\" Witkoff says the United States will now \"consider alternative options to bring the hostages home and try to create a more stable environment for the people of Gaza.” Witkoff adds it's “a shame that Hamas has acted in this selfish way” and the U.S. is “resolute” in seeking an end to the conflict in Gaza.",
      "publishedAt": "2025-07-24T17:11:40Z",
      "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks",
      "url": "https://apnews.com/article/mideast-wars-trump-witkoff-gaza-ceasefire-4d713a205d5d33e664b7c5853c6f5a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Health workers and aid groups fear hunger that has been building in Gaza for months under Israel's blockade is now reaching a tipping point into accelerating death. The Gaza Health Ministry says that in the past three weeks, at least 48 people died of causes related to malnutrition, including 20 children. That’s up from 10 children who died in the five previous months of 2025. At the main emergency center for malnourished kids in northern Gaza, five children died in rapid succession over four days last week, with staff unable to treat them because key medicines had run out.",
      "publishedAt": "2025-07-24T19:56:26Z",
      "title": "Starving children die in a Gaza hospital as malnutrition spreads",
      "url": "https://apnews.com/article/gaza-palestinians-starvation-famine-israel-children-3a7403d4f6ec483a03d6cbb0c45fd06a",
      "urlToImage": "https://dims.apnews.com/dims4/default/af2dd61/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2Fa9%2Fa1fb2d14b7b2d26006080af99161%2Fe1f62c9cb2d64b2f87c752f8002b62a3"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy has submitted a new bill restoring the independence of the country’s anti-corruption agencies. The development seeks to defuse tensions caused by his earlier approval of a controversial law placing them under his authority. That sparked a public outcry and protests, the first major demonstrations since the war began, as well as sharp criticism from the European Union. Zelenskyy said on Thursday the new bill that was sent to parliament for review “guarantees real strengthening of Ukraine’s law enforcement system, the independence of anti-corruption bodies, and reliable protection of the legal system from any Russian interference.” The two main agencies quickly welcomed the new bill.",
      "publishedAt": "2025-07-24T09:39:12Z",
      "title": "Zelenskyy moves to restore Ukraine anti-corruption agencies' independence",
      "url": "https://apnews.com/article/russia-ukraine-war-corruption-protests-zelenskyy-law-6766134c963f0423d88c2ac1749f8c11",
      "urlToImage": "https://dims.apnews.com/dims4/default/22fc61e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F51%2F1c099abf2a534cb59045928f2dbf%2Fae50365bbe5e4e9b92157e5344fd3ba2"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to visit the Federal Reserve as his allies scrutinize its expensive building renovations. It's a highly personal and confrontational escalation of Trump's campaign to pressure the central bank to slash interest rates. Trump administration officials have used concerns about the Washington building overhaul to cast doubt on Fed Chairman Jerome Powell’s decision making. The Trump administration officials are scheduled to inspect the site Thursday. The White House says the Republican president will also be visiting. Trump has criticized Powell for months because the chair has kept the short-term interest rate the Fed controls at 4.3%. Powell says the Fed wants to see how the economy responds to Trump’s tariffs.",
      "publishedAt": "2025-07-24T03:19:07Z",
      "title": "Trump will visit Fed as he pressures Powell to cut interest rates",
      "url": "https://apnews.com/article/trump-federal-reserve-jerome-powell-145b0189a8c7acaab9fcfb097dc376c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/129ff31/2147483647/strip/true/crop/4023x2263+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F10%2Fc22b2cb1f18413027585e87a1985%2F0c8619e9d4e94da9a2bf8b448f5ba158"
    },
    {
      "author": null,
      "description": "Justice Department officials will meet with Ghislaine Maxwell, the imprisoned girlfriend of financier and convicted sex offender Jeffrey Epstein. That's according to a person familiar with the matter. The person tells The Associated Press the meeting is Thursday in Florida, where Maxwell is held. The meeting is part of a Justice Department effort to cast itself as transparent following backlash from parts of President Donald Trump’s base over an earlier refusal to release additional Epstein records. A Justice Department spokesman hasn't returned a message seeking comment. A lawyer for Maxwell says she'll \"always testify truthfully.” Maxwell was convicted of helping Epstein sexually abuse underage girls. Epstein died in a New York jail awaiting trial.",
      "publishedAt": "2025-07-24T15:03:01Z",
      "title": "Justice Department will meet with Epstein's girlfriend Maxwell",
      "url": "https://apnews.com/article/epstein-maxwell-trump-sex-offender-b828f96be4a438edfe8051511be8c5da",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "The revelation that Attorney General Pam Bondi told President Donald Trump that his name was in the Jeffrey Epstein files has focused fresh attention on the president’s relationship with the wealthy financier and the Justice Department’s announcement this month that it would not be releasing any additional documents from the case. But at least some of the information in the briefing to Trump, which The Wall Street Journal said took place in May, should not have been a surprise. His association with Epstein is well-established and his name was included in records that his own Justice Department released back in February. Trump has never been accused of wrongdoing in connection with Epstein.",
      "publishedAt": "2025-07-24T15:21:19Z",
      "title": "Trump's friendship with Jeffrey Epstein is well-known and documented",
      "url": "https://apnews.com/article/trump-epstein-justice-department-bondi-e7a5e41ba4fa3a88736cc384078c3215",
      "urlToImage": "https://dims.apnews.com/dims4/default/d142b6d/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Ff4%2Ff39325e1523f193116962481afc2%2F8c7d29d49e864bf282d06ee283727f61"
    },
    {
      "author": null,
      "description": "Hulk Hogan, the mustachioed, headscarf-wearing icon in the world of professional wrestling, has died at the age of 71, Florida police and WWE said Thursday. Hogan's real name was Terry Bollea. He was perhaps the biggest star in WWE’s long history. He was the main draw for the first WrestleMania in 1985 and was a fixture for years, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon. Hogan was also a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, “Hogan Knows Best.”",
      "publishedAt": "2025-07-24T16:17:46Z",
      "title": "Hulk Hogan, icon in professional wrestling, dies at age 71",
      "url": "https://apnews.com/article/hulk-hogan-obit-wrestling-professional-wwe-fame-cc767794b616e155079b9f374c769ad0",
      "urlToImage": "https://dims.apnews.com/dims4/default/61b72f6/2147483647/strip/true/crop/4192x2358+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F55%2F75be87e57d96eeb77199c2598843%2F6ec384639a8e4b2cb08d499b90e48c8a"
    },
    {
      "author": null,
      "description": "Federal regulators on Thursday approved Paramount’s $8 billion merger with Skydance, clearing the way to close a deal that combined Hollywood glitz with political intrigue. The stamp of approval from the Federal Communications Commission comes after months of turmoil revolving around President Donald Trump’s legal battle with “60 Minutes,” the crown jewel of Paramount-owned broadcast network CBS. With the specter of the Trump administration potentially blocking the hard-fought deal with Skydance, Paramount earlier this month agreed to a $16 million settlement with the President.",
      "publishedAt": "2025-07-24T22:53:55Z",
      "title": "Federal regulators approve Paramount's $8B merger with Skydance",
      "url": "https://apnews.com/article/paramount-skydance-merger-fcc-approval-74836c0da9dc0b33f580f714a3f2bfbb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e259505/2147483647/strip/true/crop/3000x1688+0+173/resize/1440x810!/quality/90/?url=https%3A%2F%2Fstorage.googleapis.com%2Fafs-prod%2Fmedia%2F703a6544cdda4382a3b90f4ab9e498fa%2F3000.jpeg"
    },
    {
      "author": null,
      "description": "UnitedHealth Group says it is cooperating with federal criminal and civil investigations involving its market-leading Medicare business. The health care giant said Thursday that it had contacted the Department of Justice after reviewing media reports about investigations into certain elements of its business. The Wall Street Journal has been reporting that federal officials had launched investigations into how the company records diagnoses that lead to extra payments for its Medicare Advantage plans. Those are privately run versions of the government’s Medicare coverage program mostly for people ages 65 and over. UnitedHealth runs the nation's largest Medicare Advantage business.",
      "publishedAt": "2025-07-24T13:04:47Z",
      "title": "UnitedHealth says it is under a federal investigation and cooperating",
      "url": "https://apnews.com/article/unitedhealth-medicare-department-of-justice-investigation-e798e8c5305043d757714277e0c5a75c",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1c4674/2147483647/strip/true/crop/5300x2981+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F09%2F230dd9e4f71a151be7d5393a99ca%2Fa2962c0ee6104593aa1d3fd77b41b0ba"
    },
    {
      "author": null,
      "description": "Thai and Cambodian soldiers have clashed along the two countries' border in a major escalation of a festering dispute over territory that killed least 14 people, mostly civilians. On Thursday, the two sides fired small arms, artillery and rockets, and Thailand also called in airstrikes. Thai villagers could be seen in videos fleeing their homes. A Thai Defense Ministry spokesperson said fighting was ongoing in at least six areas along the border. The Southeast Asian neighbors have longstanding border disputes that periodically and briefly flare along their 800-kilometer frontier. But the latest clashes were far bigger in scale and intensity. A Cambodian official said clashes resumed early on Friday morning near the ancient Ta Muen Thom temple.",
      "publishedAt": "2025-07-24T03:12:02Z",
      "title": "Thailand launches airstrikes on Cambodia as border clashes kill at least 14",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-5b1e15987fb02132268913e474250c51",
      "urlToImage": "https://dims.apnews.com/dims4/default/6febfe5/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F1f%2F4be09cfc95eea35a14110a87f56f%2F7f4ee14da0054ccc80cb8f7fa0eb6975"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}