{
  "articles": [
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — With control over some of his most prized real estate holdings in jeopardy, former President Donald Trump says he will make a rare, voluntary trip to court Monday for the start of a civil trial in a lawsuit that has already resulted in a judge ruling that he committed fraud in his business dealings.",
      "publishedAt": "2023-10-02T02:45:44Z",
      "title": "Donald Trump says he will be in courtroom for New York trial scrutinizing his business practices",
      "url": "https://apnews.com/eb98c99fe918da139b0d8b6347211afe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff678d37237468da8ff0b7b31fe9b63/3000.jpeg"
    },
    {
      "author": "BY KEVIN FREKING",
      "description": "WASHINGTON (AP) — Rep. Matt Gaetz said Sunday he will try to remove House Speaker Kevin McCarthy, a fellow Republican, from his leadership position this week after McCarthy relied on Democratic support to pass legislation that avoided a government shutdown.",
      "publishedAt": "2023-10-01T14:19:43Z",
      "title": "Gaetz says he will seek to oust McCarthy as speaker this week. 'Bring it on,' McCarthy says",
      "url": "https://apnews.com/aa4efca3c68895283b4219ed3e8064ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7629024fb6ce47e3b0713a54e60a1181/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Attorney General Merrick Garland said in an interview that aired Sunday that he would resign if asked by President Joe Biden to take action against Republican presidential frontrunner Donald Trump.",
      "publishedAt": "2023-10-02T00:11:47Z",
      "title": "Attorney General Garland says in interview he'd resign if Biden asked him to take action on Trump",
      "url": "https://apnews.com/142d7a18c116439bafebe20c08916f5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ae2b14a5dbc426ca8543aaea0a23cad/3000.jpeg"
    },
    {
      "author": "LOUISE DIXON",
      "description": "LONDON (AP) — David Beckham delves back into the hateful treatment he received following his infamous 1998 World Cup red card — and its impact on him — in a new Netflix documentary series pegged to the 10th anniversary of his retirement.",
      "publishedAt": "2023-10-01T23:48:25Z",
      "title": "David Beckham reflects on highs and lows in 'Beckham' doc, calls it an 'emotional rollercoaster'",
      "url": "https://apnews.com/a8ff8abbe9a7d8765dab6dacc19f09b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cf56932a87749c9b9f2197f586b1791/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden said Sunday that American aid to Ukraine will keep flowing for now as he sought to reassure allies of continued U.S. financial support for the war effort. But time is running out, the president said in a warning to Congress.",
      "publishedAt": "2023-10-01T04:01:31Z",
      "title": "Biden says there's 'not much time' to keep aid flowing to Ukraine and Congress must 'stop the games'",
      "url": "https://apnews.com/799067491a1bba9671b4dfdf491d0a8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3d9f750473a4a9fbf476e8277f7db0c/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Jimmy Carter has always been a man of discipline and habit. But the former president broke routine Sunday, putting off his practice of quietly watching church services online to instead celebrate his 99th birthday with his wife, Rosalynn, and their children, grandchildren and great-grandchildren in Plains.",
      "publishedAt": "2023-10-01T04:15:51Z",
      "title": "Jimmy Carter turns 99 at home with Rosalynn and other family as tributes come from around the world",
      "url": "https://apnews.com/19be42d93ca052816aaa06c57c38be1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e1640380c2b4d6e9ac79182475d2ac6/3000.jpeg"
    },
    {
      "author": "SUZAN FRASER",
      "description": "ANKARA, Turkey (AP) — Turkish warplanes carried out airstrikes on suspected Kurdish militant targets in northern Iraq on Sunday following a suicide attack on a government building in the Turkish capital, Turkey's defense ministry announced.",
      "publishedAt": "2023-10-01T07:10:34Z",
      "title": "Turkey strikes suspected Kurdish militant targets in northern Iraq after suicide attack in Ankara",
      "url": "https://apnews.com/dfdbae1c7cd90f7e0a48b029c866b561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f93d9f5d2f4c4833ad06d9f1c0ac4a60/3000.jpeg"
    },
    {
      "author": null,
      "description": "MADRID, Spain (AP) — A fire broke out in a nightclub in the southeastern Spanish city of Murcia on Sunday, killing 13 people and injuring several others, authorities said.The fire started around 6 a.m.",
      "publishedAt": "2023-10-01T14:43:16Z",
      "title": "At least 13 people were killed at a nightclub fire in Spain’s southeastern city of Murcia",
      "url": "https://apnews.com/9f4a46e17de89b190438716cba27ab12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57732d1464c14e0cb6c0c93911fa30ea/1920.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "GUIDONIA MONTECELIO, Italy (AP) — The best collection of players at Marco Simone had flags from their eight countries draped around their shoulders as they took turns clutching and thrusting the gold Ryder Cup, the very trophy that turns them into one nation, one team, with one purpose.",
      "publishedAt": "2023-10-01T15:18:44Z",
      "title": "Ryder Cup in Rome stays right at home for the Europeans. The US loses its seventh straight in Europe",
      "url": "https://apnews.com/4ba506769714aff78488651db46c1dfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45774e66144043e89c79ae7a935d9027/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOREAU, N.Y. (AP) — Drones, bloodhounds and an airboat were used in the search for a missing 9-year-old girl who had been camping with her family in upstate New York, officials said Sunday.Charlotte Sena was last seen bicycling on Saturday evening in Moreau Lake State Park, about 35 miles (60 kilometers) north of Albany, and police said it was possible she was abducted.",
      "publishedAt": "2023-10-01T17:23:36Z",
      "title": "More than 100 search for 9-year-old girl who was camping with family in upstate New York",
      "url": "https://apnews.com/54d59984c34496b7fb69052aae89eaf1",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}