{
  "articles": [
    {
      "author": "KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "CRAWFORDVILLE, Fla. (AP) — Hurricane Helene made landfall in northwestern Florida as a Category 4 storm as forecasters warned that the enormous system could create a “nightmare” storm surge and bring dangerous winds and rain across much of the southeastern U.S.",
      "publishedAt": "2024-09-27T05:27:23Z",
      "title": "Helene makes landfall in northwestern Florida as a Category 4 hurricane",
      "url": "https://apnews.com/e5769b56dea81e40fae2161ad1b4e75d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc1fa9e5b61e4fb99e4ea663a9ae4335/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ZEINA KARAM",
      "description": "When she first heard about the evacuation warnings Israel was sending to residents of Lebanon, Aline Naser’s thoughts immediately turned to Gaza.For the past year, the 26-year-old Beirut resident has been following with horror the reports about besieged Palestinians in the Gaza Strip ordered to move from one place to the other, fleeing to “humanitarian zones” only to be bombed and ordered to leave again.",
      "publishedAt": "2024-09-27T04:29:38Z",
      "title": "Lebanon fears Gaza-like carnage as Israel ramps up airstrikes across the country",
      "url": "https://apnews.com/ca37a9b6314d327f8719a4f513e81233",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d82f719f854a279085d286372ba224/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York City's embattled and indicted mayor, Eric Adams, could make his initial court appearance Friday on charges that he accepted illegal campaign contributions and free overseas trips from people looking to buy his influence in city government.",
      "publishedAt": "2024-09-27T04:04:16Z",
      "title": "Indicted New York City mayor could appear before a judge Friday",
      "url": "https://apnews.com/f384ecdbf6a7b6664bd898e7ebce6e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b651ecc71cb8449e86eec6ad13f65184/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams has never been shy about his globetrotting ways. But he’s not always said how he bankrolled years' worth of overseas adventures.Federal prosecutors unsealed an indictment Thursday saying the Democrat took trips to France, China, Sri Lanka, India, Hungary, Ghana and Turkey that were partly or fully paid for by people looking to buy his influence in city government.",
      "publishedAt": "2024-09-27T01:58:48Z",
      "title": "A look inside the indictment accusing New York City's mayor of taking bribes",
      "url": "https://apnews.com/51121005f6fcc209d62279ed1d3522eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2bbfede9d404a698e99dca0df7a91d4/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — New British Prime Minister Keir Starmer took the international stage at the U.N. General Assembly on Thursday for the first time with a message: His nation is returning to “responsible global leadership.”",
      "publishedAt": "2024-09-27T02:20:39Z",
      "title": "New British leader vows his nation will reengage on global leadership",
      "url": "https://apnews.com/707e771c934adea4842f2308381ccc00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f17b63f60644e31bbe63c130aedba6a/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "UNITED NATIONS (AP) — A trio of leaders of international climate negotiations on Thursday urged colleagues to step up efforts to fight global warming, but outside groups and endangered nations told those leaders to look in the mirror, take their own advice — and stop pumping out fossil fuels.",
      "publishedAt": "2024-09-27T02:12:20Z",
      "title": "Top climate negotiators urge tougher targets, but outsiders say they aren't cutting back themselves",
      "url": "https://apnews.com/35eba065ffeb357529b399a9795f4e81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f1125da528740b78405c4d58224ad07/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japan's governing party is holding its leadership election on Friday that will determine the nation's new prime minister.The winner of the vote by the Liberal Democratic Party is assured of being chosen prime minister in a parliamentary vote next week because the governing coalition controls both houses.",
      "publishedAt": "2024-09-27T01:17:37Z",
      "title": "Japan's governing party holds leadership election that will determine the next prime minister",
      "url": "https://apnews.com/ca3ba06b79c79d5dc534a0d259a7272c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f9a5433b7bb44fea2225259a7feee8a/3000.jpeg"
    },
    {
      "author": "DAVID CRARY and HOLLY MEYER",
      "description": "Former President Donald Trump recently reissued his loyalty test to religious Americans, declaring that he can best protect their freedoms while preemptively blaming members of certain faiths should he lose the presidential election in November.",
      "publishedAt": "2024-09-27T04:03:28Z",
      "title": "Jews and Catholics warn against Trump's latest loyalty test for religious voters",
      "url": "https://apnews.com/c6b2c15a6019583b8afae4d496480469",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88d8ba45b85643c9acf0361bad407d18/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON and LISA MASCARO",
      "description": "NEW YORK (AP) — Donald Trump is set to meet with Ukrainian President Volodymyr Zelenskyy as public tensions have been rising between the two over Ukraine's defense against Russia's invasion.",
      "publishedAt": "2024-09-27T04:05:15Z",
      "title": "Trump and Zelenskyy will meet as tensions rise over US backing for Ukraine",
      "url": "https://apnews.com/7c163eb5068c5003b219b6d524436517",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e60f8344f10743679f709da604f2f462/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Every day at 7 a.m., President Andrés Manuel López Obrador strolls onto a stage in Mexico's National Palace, clad in a smart suit and tie, and peers out at a room of bleary-eyed reporters and social media personalities.",
      "publishedAt": "2024-09-27T04:26:10Z",
      "title": "Mexico's populist president held court each morning for 6 years. Now he's retiring from public life",
      "url": "https://apnews.com/81245ec04ad9843f3bfa64cfad2ce66b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d22c20d56fc54298a1c3084481141171/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}