{
  "articles": [
    {
      "author": null,
      "description": "HOUSTON (AP) — RNC votes to install Donald Trump's handpicked chairman as the former president asserts control over the party.",
      "publishedAt": "2024-03-08T16:53:10Z",
      "title": "RNC votes to install Donald Trump's handpicked chairman as the former president asserts control over the party",
      "url": "https://apnews.com/353d5f72580d191ed3f690c933859aec",
      "urlToImage": ""
    },
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "LARNACA, Cyprus (AP) — A ship bearing humanitarian aid was making preparations to leave Cyprus and head for Gaza, the European Commission president said Friday as international donors launched a sea corridor to supply the besieged territory that is facing widespread hunger after five months of war.",
      "publishedAt": "2024-03-08T08:01:57Z",
      "title": "A ship with Gaza aid is preparing to inaugurate a sea route from Cyprus to the war-ravaged strip",
      "url": "https://apnews.com/196b1e1bdef8ce28449799759c797d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7614b35c394040cf9ae2be527abf826d/2000.jpeg"
    },
    {
      "author": "MOHAMED JAHJOUH, JACK JEFFERY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — It’s not just Israeli bombs that have killed children in war-ravaged Gaza — now some are dying of hunger. Officials have been warning for months that Israel’s siege and offensive were pushing the Palestinian territory into famine.",
      "publishedAt": "2024-03-08T05:04:53Z",
      "title": "It's not just Israeli bombs that have killed children in Gaza. Now some are dying of hunger too",
      "url": "https://apnews.com/2f938b1a82d7822c7da67cc162da1a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80daf8fa9f0d4f5894044b05ff955dad/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "HOUSTON (AP) — The Republican National Committee voted Friday to install Donald Trump’s handpicked chair, completing his takeover of the national party as the former president closes in on a third straight presidential nomination.",
      "publishedAt": "2024-03-08T05:12:28Z",
      "title": "RNC votes to install Donald Trump's handpicked chair as former president tightens control of party",
      "url": "https://apnews.com/53402f8e8ac845db3cf4ab82c882ea74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d8780e1790e4db5a4e9a6032d6eb095/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Former President Donald Trump has secured a bond sufficient to support an $83.3 million jury award granted to writer E.",
      "publishedAt": "2024-03-08T16:25:29Z",
      "title": "Trump attorneys post bond to support $83.3 million award to writer in defamation case",
      "url": "https://apnews.com/298114f9b8c402643ec4747671fc75de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a67912b59f94202aa1f2a029e0fff28/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden delivered a defiant argument for a second term in his State of the Union speech Thursday night, lacing into GOP front-runner Donald Trump for espousing “resentment, revenge and retribution\" and for jeopardizing freedom at home and abroad.",
      "publishedAt": "2024-03-07T05:03:44Z",
      "title": "Biden uses feisty State of the Union to contrast with Trump, sell voters on a second term",
      "url": "https://apnews.com/1a42ff9d4ef3e0f2753e43ac8d39fc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bf829fb06024f278199680850b6a986/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — America’s employers delivered another healthy month of hiring in February, adding a surprising 275,000 jobs and again showcasing the U.S. economy’s resilience in the face of high interest rates.",
      "publishedAt": "2024-03-08T05:01:25Z",
      "title": "Another burst of hiring shows off the resilience of the US job market",
      "url": "https://apnews.com/96162ff805670eb19a44cdf67fa20e3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17c144e9165b4445bb17585dd9a73564/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The first “NYPD: Most Wanted” video was meant to be intimidating.Over a pounding soundtrack, the montage cuts among stock images and body-camera footage of actual police raids.",
      "publishedAt": "2024-03-08T16:15:47Z",
      "title": "The NYPD is using social media to target critics. That brings its own set of worries",
      "url": "https://apnews.com/1f80e5d3a1b8cac029dbb217c05cb8a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a53537f23e4e48845b7f2bc7e48db0/2778.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Most of America “springs forward” Sunday for daylight saving time and losing that hour of sleep can do more than leave you tired and cranky the next day.",
      "publishedAt": "2024-03-08T06:01:18Z",
      "title": "How springing forward to daylight saving time could affect your health -- and how to prepare",
      "url": "https://apnews.com/06088a66e5e7a86e9df4843742377d89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cda39760404648f498772891cedd5530/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN and GARY GERARD HAMILTON",
      "description": "LOS ANGELES (AP) — Throughout the billion-dollar “Barbie” film, an instrumental version of Billie Eilish’s hit “What Was I Made For” weaves in and out, soundtracking the famous doll's existential crisis.",
      "publishedAt": "2024-03-08T14:07:22Z",
      "title": "From ‘The Bodyguard’ to ‘Barbie’: Is the movie soundtrack back and bigger than ever?",
      "url": "https://apnews.com/8d7f562b3c642362dfd90b8db3154458",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df2d0f0bec7c4b3ca2018139fffd20b0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}