{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Both major presidential candidates are making appearances Thursday meant to fire up their core supporters, with Vice President Kamala Harris participating in a livestream with Oprah Winfrey and Donald Trump attending an event with prominent Jewish donors before addressing a gathering of the Israeli-American Council.",
      "publishedAt": "2024-09-19T11:12:53Z",
      "title": "Harris plans a livestream with Oprah Winfrey while Trump is set to address an Israeli-American group",
      "url": "https://apnews.com/f9384395f54a0d071ab52bca80d3659e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b685599831884f2a8f39ecf2a78dd006/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and BASSEM MROUE",
      "description": "BEIRUT (AP) — The leader of Hezbollah vowed to keep up daily strikes on Israel despite this week's mass bombing attack on its communication devices, and said Israelis displaced by the fighting from homes near the Lebanon border would not be able to return until the war in Gaza ends.",
      "publishedAt": "2024-09-19T11:14:00Z",
      "title": "Hezbollah leader vows retaliation against Israel for attacks on devices as both sides trade strikes",
      "url": "https://apnews.com/ab2436cf5bae5e2fe2dddb293671a0ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/718b7f9af95244a7ad35e66c38402e18/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Until recently, Lillian Dunsmuir of Bullhead City, Arizona, “didn’t really think about\" Kamala Harris and had no opinion of the vice president. But now she likes what she’s seeing.",
      "publishedAt": "2024-09-19T04:01:37Z",
      "title": "Voters view Harris more favorably as she settles into role atop Democratic ticket: AP-NORC poll",
      "url": "https://apnews.com/3f0a52c889027df9b46f2d9407190217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db67a953b9e446f8b8a684dd7d760116/3000.jpeg"
    },
    {
      "author": "CURTIS YEE and TIFFANY STANLEY",
      "description": "WASHINGTON (AP) — When the Rev. Lee Scott publicly endorsed Kamala Harris for president during the Evangelicals for Harris Zoom call on Aug. 14, the Presbyterian pastor and farmer said he was taking a risk.",
      "publishedAt": "2024-09-19T12:01:32Z",
      "title": "These evangelicals are voting their values — by backing Kamala Harris",
      "url": "https://apnews.com/9d5cb379dc3c2fdb3f4954c556a29ec5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b53b38f2d18476c973bb58eb63f2bd3/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and CLAIRE GALOFARO",
      "description": "SEOUL, South Korea (AP) — As the plane descended into Seoul, Robert Calabretta swaddled himself in a blanket, his knees tucked into his chest like a baby in the womb. A single tear ran down his cheek.",
      "publishedAt": "2024-09-19T04:20:20Z",
      "title": "Rampant adoption fraud separated generations of South Korean children from their families, AP finds",
      "url": "https://apnews.com/e4e7d4b8823212e3b260517c5128cd66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02f165c4cbf0466c901d285ab4333ce0/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — In the most contested races for control of the U.S. House, many Republican candidates are speaking up about women’s rights to abortion access and reproductive care in new and surprising ways, a deliberate shift for a GOP blindsided by some political ramifications of the post-Roe v.",
      "publishedAt": "2024-09-19T17:12:19Z",
      "title": "Republicans are trying a new approach to abortion in the race for Congress",
      "url": "https://apnews.com/bf0da946328ab06f122a99d696c04774",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fe722ddaf2e4488810d48c6c30481e6/2910.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — Scientists searching for the origins of COVID-19 have zeroed in on a short list of animals that possibly helped spread it to people, an effort they hope could allow them to trace the outbreak back to its source.",
      "publishedAt": "2024-09-19T16:47:34Z",
      "title": "A new genetic analysis of animals in the Wuhan market in 2019 may help find COVID-19's origin",
      "url": "https://apnews.com/05d573cfd019a20cb46d675af0c669dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d30c25379bbb4ab0ad15255e79f8c9ea/3000.jpeg"
    },
    {
      "author": "MONIKA SCISLOWSKA",
      "description": "WARSAW, Poland (AP) — European Union chief Ursula von der Leyen on Thursday pledged billions of euros for flood recovery for Central European countries that suffered enormous damage to infrastructure and housing during the current flooding that has claimed 24 lives in the region.",
      "publishedAt": "2024-09-19T10:16:14Z",
      "title": "EU chief visits flood-stricken region in Europe and pledges billions in swift aid",
      "url": "https://apnews.com/d96d5343577cd6e11c680c1ed08d604f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37de23c6984f4d089b4c8db7b5b1cc01/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "SPRINGFIELD, Ohio (AP) — In the quiet corners of Springfield, Ohio — out of sight of the drumbeat of politicians and journalists, troopers and newly installed security cameras — the people who live here are taking a breath, praying and attempting to carry on.",
      "publishedAt": "2024-09-19T04:14:58Z",
      "title": "Residents of Springfield, Ohio, hunker down and pray for a political firestorm to blow over",
      "url": "https://apnews.com/7e8b09654c0dd90d72c884dbb798c71b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76ef6de867df4f4fbffa5636dc2d2024/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "KAMITUGA, Congo (AP) — Slumped on the ground over a mound of dirt, Divine Wisoba pulled weeds from her daughter’s grave. The 1-month-old died from mpox in eastern Congo in August, but Wisoba, 21, was too traumatized to attend the funeral.",
      "publishedAt": "2024-09-19T04:07:49Z",
      "title": "A gold mining town in Congo has become an mpox hot spot as a new strain spreads",
      "url": "https://apnews.com/f9affb7a7d73c8c30daf296c51c920c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a43913f1a044d5a2aac1d25d32cffb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}