{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump and billionaire Elon Musk are showing no signs of reconciling on Friday, but Republicans are increasingly urging them to settle their dispute. They know what's at stake — a massive tax and border spending bill from the Republican Party that Musk has been railing against for days. Sen. Ted Cruz of Texas says he hopes “that both of them come back together.” Still, the feud between Trump and Musk is probably best described as a moving target. One person familiar with the president’s thinking says Musk wants to speak with Trump, but that the president doesn’t want to do it — or at least, not on Friday.",
      "publishedAt": "2025-06-06T15:27:11Z",
      "title": "Republicans urge Donald Trump and Elon Musk to end their feud",
      "url": "https://apnews.com/article/donald-trump-elon-musk-republicans-tax-border-dc762978d7749c8c39b8f62aba2dd9ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed900ce/2147483647/strip/true/crop/4989x2806+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fac%2Fc6bbcaa66e1e64b26eda04272dfc%2F94e6f38793944735baf9b37055b5636c"
    },
    {
      "author": null,
      "description": "The Trump administration is asking the Supreme Court to pause a court order to reinstate Education Department employees who were fired in mass layoffs as part of President Donald Trump’s plan to dismantle the agency. The Justice Department’s emergency appeal to the high court Friday said U.S. District Judge Myong Joun in Boston exceeded his authority last month when he issued a preliminary injunction reversing the layoffs of nearly 1,400 people and putting the broader plan on hold. Joun’s order has blocked one of Trump’s biggest campaign promises and effectively stalled the effort to wind down the department. A federal appeals court refused to put the order on hold while the administration appealed.",
      "publishedAt": "2025-06-06T15:15:04Z",
      "title": "Trump administration asks Supreme Court to leave education layoffs in place",
      "url": "https://apnews.com/article/supreme-court-trump-education-layoffs-79a160b71db85aa060b11de58926a276",
      "urlToImage": "https://dims.apnews.com/dims4/default/7383f15/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fce%2F4101bc6c62f9af0878b853d89b4a%2F5a0e5010145e46e9a0363399a79c13bf"
    },
    {
      "author": null,
      "description": "Officials say Ukraine was under an ongoing Russian ballistic missile and drone attack early Friday that wounded at least three people. Multiple explosions were heard in the capital, Kyiv, where falling debris sparked fires across several districts as air defense systems attempted to intercept incoming targets. Three people were wounded, local officials said. They urged residents to seek shelter. Authorities reported damage in several districts, and rescue workers were responding at multiple locations. In northern Chernihiv region, a Shahed drone exploded near an apartment building, shattering windows and doors, according to the regional military administration chief. He added that explosions from ballistic missiles were also recorded on the outskirts of the city.",
      "publishedAt": "2025-06-06T00:44:54Z",
      "title": "Ukraine is under an ongoing Russian missile and drone attack",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-zelenskyy-trump-80c8984bc2e52da0212da4e0d4cf8220",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5f5e59/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F6e%2F169b28ea7ecf7fa345c645d731e8%2Fa2c16881857c45358f027dce9a6a7c7b"
    },
    {
      "author": null,
      "description": "Stocks rose on Wall Street following a better-than-expected report on the U.S. job market. The S&P 500 index rose 1.2% in morning trading Friday. The Dow Jones Industrial Average added 482 points, or 1.1%, and the Nasdaq composite rose 1.4%. U.S. employers slowed their hiring last month, but still added a solid 139,000 jobs amid uncertainty over President Donald Trump’s trade wars. Lululemon Athletica sank after lowering its profit forecast for the full year. Treasury yields rose in the bond market. The yield on the 10-year Treasury note climbed to 4.48%. Markets in Asia were mixed, while markets in Europe rose.",
      "publishedAt": "2025-06-06T03:49:17Z",
      "title": "Stocks gain ground on Wall Street after solid US report",
      "url": "https://apnews.com/article/stocks-markets-musk-china-trump-61087505f58835e3c2e59ff51204f437",
      "urlToImage": "https://dims.apnews.com/dims4/default/336462c/2147483647/strip/true/crop/4991x2807+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F11%2Fcef86da74dde7cc8580b1c259280%2F37c447dbb2c24ebbbf83867eac9dc08d"
    },
    {
      "author": null,
      "description": "People across the war-ravaged Gaza Strip marked the start of one of Islam’s most important holidays with prayers outside destroyed mosques and homes, with little hope the war with Israel will end soon. With much of Gaza in rubble, men and children were forced to hold the traditional Eid al-Adha prayers Friday in the open air and with food supplies dwindling, families were having to make do with what they could scrape together for the three-day feast.",
      "publishedAt": "2025-06-06T09:54:45Z",
      "title": "Gaza marks the start of Eid with outdoor prayers amongst the rubble and food growing ever scarcer",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-eid-aid-06-06-2025-0a4f66bbc783799eb2d2151babd8e92e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2cbd65f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F69%2F817e2f0490281d2fbc121750ddd3%2Fc9fe8bfda4994cce9bdf92eee7b1be4f"
    },
    {
      "author": null,
      "description": "Veterans have gathered on the beaches of Normandy to mark the 81st anniversary of the D-Day landings — a pivotal moment during World War II that eventually led to the collapse of Adolf Hitler’s regime. Tens of thousands of people attended the commemorations, which included parachute jumps, flyovers, remembrance ceremonies, parades, and historical reenactments. The June 6, 1944, D-Day invasion of Nazi-occupied France was unprecedented in scale and audacity, using the largest-ever armada of ships, troops, planes and vehicles to punch a hole in Hitler’s defenses in western Europe. A total of 4,414 Allied troops were killed on D-Day itself.",
      "publishedAt": "2025-06-06T04:02:01Z",
      "title": "D-Day veterans gather in Normandy for 81st anniversary of landings",
      "url": "https://apnews.com/article/france-dday-anniversary-normandy-77034f1e01fac2bda85d4518832ce5c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fbf10a/2147483647/strip/true/crop/7034x3957+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fff%2F673b1aaa5fa4bfd8a381fda1c8d0%2Fb8659da4f2f1429cb7a37202e033730e"
    },
    {
      "author": null,
      "description": "The Pentagon watchdog is looking into whether any of Defense Secretary Pete Hegseth’s staffers were asked to delete Signal messages that may have shared sensitive military information with a reporter. The investigation is asking some past and current staffers who were with Hegseth on the day of the airstrikes on Houthi targets in Yemen who posted the information and who had access to his phone. That's according to two people familiar with the investigation and documents reviewed by The Associated Press. The Pentagon had no comment Friday, citing the pending investigation. Hegseth has said none of the information was classified.",
      "publishedAt": "2025-06-06T13:38:38Z",
      "title": "Pentagon watchdog looks into Hegseth's Signal messages",
      "url": "https://apnews.com/article/hegseth-signal-investigation-pentagon-trump-3cf7e90fe58f1ee10a07f386bd33c201",
      "urlToImage": "https://dims.apnews.com/dims4/default/24ee6d9/2147483647/strip/true/crop/4004x2252+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F41%2F2489a1946de07b450ba6c4a35e6e%2F1c1698f2fd624a64be6234205810e342"
    },
    {
      "author": null,
      "description": "A man who investigators say was driven by a desire “to kill all Zionist people” when he threw Molotov cocktails at demonstrators in Colorado raising awareness of Israeli hostages is set to make his first federal court appearance. Mohamed Sabry Soliman will appear Friday in federal court in Denver on a hate crime charge. He is also being prosecuted in state court for Sunday’s attack in the city of Boulder, which investigators say he planned for a year. Federal authorities say the Egyptian national was living in the U.S. illegally. He has been charged with attempted murder and assault as well as counts related to the 18 Molotov cocktails police say he carried to the demonstration.",
      "publishedAt": "2025-06-06T17:46:43Z",
      "title": "Man accused of throwing Molotov cocktails at Boulder event faces federal hate crime charge",
      "url": "https://apnews.com/article/boulder-firebombing-federal-court-hate-crime-345d15d79e31fa71a5e972aa9f8d0518",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ad8ffc/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F38%2F289bb9a351971b13b8adcd9d54a4%2F70a7b9d2c339459e9f7d3a0fd7fc3a0a"
    },
    {
      "author": null,
      "description": "Sean “Diddy” Combs’ recent ex-girlfriend is back on the witness stand testifying about how he allegedly pressured her to take part in drug-fueled sex marathons. The woman is using the pseudonym “Jane” at Combs' sex trafficking trial in New York as she testifies for a second day Friday. Combs has pleaded not guilty to running his business empire as a racketeering enterprise that enabled the abuse of women. Jane sobbed on Friday as she testified that Combs ignored her when she signaled she wanted to stop the sex encounters. She said felt obligated to participate, as Combs paid her rent and controlled many parts of her life.",
      "publishedAt": "2025-06-06T13:48:59Z",
      "title": "Diddy's recent ex-girlfriend 'Jane' testifies for a second day",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-6dece522ce1f59f874c7a31789f1dbb8",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb9f222/2147483647/strip/true/crop/4080x2295+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F3b%2F610fcca6a250e97d06e4e3628597%2F2b9c9c80f1d74c8597ef5bf1b0782e94"
    },
    {
      "author": null,
      "description": "The school graduation season is the busiest time of year for the Walmart workers who hand-decorate cakes per customers’ orders. The cakes and optional fillings come pre-baked and frozen from suppliers, but the nation's largest retailer holds a big slice of the American custom cake market. The company says one out of four cakes sold in the U.S. comes from Walmart, and that its workers will collectively decorate more than 1 million cakes during May and June. The discount retail chain's 6,200-strong army of icing artisans are Walmart's highest paid hourly workers, excluding store managers. Detractors on social media have accused the decorators of stealing ideas and undercutting professional cake artists with inexpensive products.",
      "publishedAt": "2025-06-06T09:00:36Z",
      "title": "Walmart's army of bakery decorators takes the cake when it comes to hourly store pay",
      "url": "https://apnews.com/article/walmart-custom-cakes-prices-bakery-2830911124567394d4dfb1d10ec2c4c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7051aaf/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F59%2F8a2558fdac9896972d4f976c75e2%2F104a0029436b4cf08fb19627bd93594b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}