{
  "articles": [
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Trump is on his way to Davos, where his quest to own Greenland could overshadow his other goals",
      "url": "https://apnews.com/article/trump-davos-housing-greenland-gaza-a2f3f4c18ba321c8025a3e208fc0ddf6",
      "urlToImage": null
    },
    {
      "author": null,
      "description": "Prime Minister Benjamin Netanyahu of Israel says he's agreed to join Trump’s Board of Peace. Netanyahu made the announcement Wednesday from his office. The announcement came after Israel said the makeup of the Board’s Gaza executive body did not align with Israel’s interests. A statement from Netanyahu’s office said he had accepted Trump’s invitation. The Board of Peace led by U.S. President Donald Trump was originally envisioned as a small group of world leaders overseeing the Gaza ceasefire plan. The Trump administration’s ambitions have ballooned into a more sprawling concept, with Trump extending invitations to dozens of nations and hinting it will soon broker global conflicts, like a pseudo-U.N. Security Council.",
      "publishedAt": "2026-01-21T06:42:13Z",
      "title": "Israel's Netanyahu agrees to join Trump’s Board of Peace",
      "url": "https://apnews.com/article/mideast-wars-gaza-board-of-peace-trump-1-21-2026-2f0e063d03babbd3276f31289ba5f2a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc02f2a/2147483647/strip/true/crop/5473x3079+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F70%2F7e193a65d42a9f6f203fb9c3cc55%2Ff7129cd5a24e4a3e995c2df284e4f9f1"
    },
    {
      "author": "Ghaith Alsayed",
      "description": "The U.S. military has begun transferring detainees from the Islamic State group from northeastern Syria to Iraq. U.S. Central Command says the transfer started on Wednesday, with 150 IS members moved from Syria’s Hassakeh province to secure locations in Iraq. Up to 7,000 detainees could eventually be transferred. The decision follows Syrian government forces taking control of camps with IS detainees after the U.S.-backed Syrian Democratic Forces withdrew. The SDF controls more than a dozen detention facilities with about 9,000 IS members. The situation remains tense, with ongoing security concerns in the region.",
      "publishedAt": "2026-01-21T10:27:13Z",
      "title": "US military transfers 150 Islamic State detainees from Syria to Iraq",
      "url": "https://apnews.com/article/syria-alhol-sdf-hassakeh-islamic-state-prisoners-2b4ec1e38c689b1858655de0c25e10ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/dd77c0c/2147483647/strip/true/crop/5995x3372+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2Fc0%2F09fc323bc91496f263d62d545199%2F91b761ad6cb645309c788454866b8d82"
    },
    {
      "author": "By Sam Mcneil",
      "description": "Rattled by Trump’s aggression towards Greenland, the European Union is readying counter-measures. But as primarily a trading bloc of 27 nations from Portugal to Finland, the EU's toolkit is mostly mostly financial instruments, from steep tariffs on U.S. goods to the so-called “trade bazooka” touted by French President Emmanuel Macron. “The crazy thing is that we could find ourselves in a situation where we use the anti-coercion mechanism for the very first time against the United States,” said Macron. “Can you imagine it? It’s crazy. I regret it, but it is the consequence of unnecessary aggressiveness.”",
      "publishedAt": "2026-01-21T11:38:31Z",
      "title": "Macron urges EU to consider trade 'bazooka' in response to US tariffs threat",
      "url": "https://apnews.com/article/eu-us-tensions-trade-tariffs-greenland-e30b341ce1c6d95a168067dd4348586b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f9acdc/2147483647/strip/true/crop/4432x2493+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F97%2Fbf449862d84804955d3797f09562%2F04a1367cbdbc4f0bab4f99b529f12a83"
    },
    {
      "author": "Hernán Muñoz, Suman Naishadham",
      "description": "A commuter train crash in Catalonia, Spain, has led to the suspension of rail services in the region. The crash occurred when a train hit a retaining wall that had fallen onto the tracks. At least one person died, and 37 others were injured. Emergency services responded with 20 ambulances, and the injured were taken to local hospitals. The crash happened near Gelida, about 35 minutes from Barcelona. Heavy rainfall is believed to have caused the wall to collapse. This incident follows a deadly high-speed train crash in southern Spain on Sunday that killed at least 42 people.",
      "publishedAt": "2026-01-21T08:35:56Z",
      "title": "Barcelona commuter train crash halts Catalonia rail service",
      "url": "https://apnews.com/article/spain-train-crash-adamuz-barcelona-71f6ad926cd48044df6854fdd52ba722",
      "urlToImage": "https://dims.apnews.com/dims4/default/d654ec7/2147483647/strip/true/crop/2240x1260+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F43%2F0070c36e45fa5b954a0e7ecdb364%2F1925b23951764c46890cf4e9681c4c48"
    },
    {
      "author": "Stephen Groves, Matt Brown",
      "description": "House Republicans are starting a push to hold former President Bill Clinton and former Secretary of State Hillary Clinton in contempt of Congress over the Jeffrey Epstein investigation. This opens up the prospect of the House using one of its most powerful punishments against a former president for the first time. The contempt proceedings are an initial step toward a criminal prosecution by the Department of Justice that could send the Clintons to prison. Oversight Committee chairman Rep. James Comer initiated the contempt proceedings after the Clintons refused for months to fulfill a House Oversight Committee subpoena for their testimony in the panel’s Epstein investigation. The Clintons argue the subpoenas are invalid.",
      "publishedAt": "2026-01-21T12:10:02Z",
      "title": "Republicans push to hold Clintons in contempt of Congress in Epstein probe",
      "url": "https://apnews.com/article/bill-clinton-hillary-clinton-contempt-congress-epstein-6132b63aeb1deb4513e9fa6807ae223c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f855c95/2147483647/strip/true/crop/2421x1362+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2Fd2%2F52ad63273c14656a9c44398069e2%2F19dcd8af36eb440e826f216b7227dea4"
    },
    {
      "author": "Steve Karnowski, Alanna Durkin Richer",
      "description": "Confrontations with federal officers over their massive immigration enforcement operation in Minnesota are showing no signs of stopping. Meanwhile, legal battles over the surge and the local response are also intensifying. A person familiar with the matter said Tuesday that federal prosecutors have served six grand jury subpoenas to Minnesota officials, including Gov. Tim Walz. It's part of an investigation into whether they obstructed or impeded federal law enforcement during a sweeping immigration operation in Minneapolis-St. Paul area. The person was not authorized to publicly discuss an ongoing investigation and spoke to The Associated Press on condition of anonymity. Walz has said the Trump administration is not seeking justice, only creating distractions.",
      "publishedAt": "2026-01-21T06:05:09Z",
      "title": "Legal battles over ICE operation in Minnesota intensify",
      "url": "https://apnews.com/article/subpoenas-minnesota-investigation-lawsuit-federal-officers-8693014921e7a240108cb7f58dc56a46",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ef412a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F8f%2Faac50aed8ffa74d6da57d449c080%2F417383c18c734110b2fd517ef1d1b071"
    },
    {
      "author": "Steve Karnowski",
      "description": "Former NFL sideline reporter Michele Tafoya has launched her campaign for the U.S. Senate. She hopes to win the Republican nomination for the Minnesota seat being vacated by retiring Democratic Sen. Tina Smith. Tafoya announced her candidacy Wednesday in a video posted on social media. She emphasized her knowledge of leadership from her years covering football. Tafoya has been active in Minnesota Republican politics and is best known for her work as a sideline reporter for NBC's Sunday Night Football. Other Republicans in the race include former NBA player Royce White, and military veterans Adam Schwarze and Tom Weiler.",
      "publishedAt": "2026-01-21T14:35:29Z",
      "title": "Former NFL reporter Michele Tafoya launches Senate bid in Minnesota",
      "url": "https://apnews.com/article/minnesota-senate-michele-tafoya-nfl-election-f5820b62e48bddd48490264a96d334a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/392a643/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F57%2F887672c56729e195ac8e33118b25%2F39f2a873c0444f0f80bbfd2b7d16672c"
    },
    {
      "author": "Chan Ho-him, Matt Ott",
      "description": "U.S. futures are higher and world shares are mixed ahead of U.S. President Donald Trump’s speech to the World Economic Forum in Davos, Switzerland. Markets appeared to steady somewhat after gyrating following Trump’s threats to slap higher tariffs on eight European countries over their opposition to his push for U.S. control of Greenland. Gold prices crossed the $4,800 mark for the first time, as money flowed into assets considered to be safe havens at times of uncertainty. On Tuesday, the S&P 500 fell 2.1%, the steepest drop for the benchmark index since October. The Dow industrials lost 1.8% and the Nasdaq composite fell 2.4%.",
      "publishedAt": "2026-01-21T04:51:46Z",
      "title": "World shares steady while gold price hits a record ahead of Trump's speech at Davos",
      "url": "https://apnews.com/article/stocks-markets-trump-bonds-gold-82e0341ef60b2719d79e1631e006bfed",
      "urlToImage": "https://dims.apnews.com/dims4/default/13f3cc6/2147483647/strip/true/crop/4718x2654+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fcb%2F7e1958c3b6460afacc11072301c3%2F064703fa33b24926828cedfd383185d3"
    },
    {
      "author": "Adithi Ramakrishnan",
      "description": "Handprints on the walls of Indonesian caves may be the oldest rock art studied so far, dating back at least 67,800 years. The tan-colored prints uncovered on the island of Sulawesi were made by blowing pigment over hands placed against the cave walls. Some of the fingertips were also tweaked to look more pointed. Researchers dated mineral crusts that had formed on top of the art and discovered it is the oldest to be found on cave walls. They aren't yet sure whether the prints were made by modern humans or an ancient human group called Denisovans. The new research was published Wednesday in the journal Nature.",
      "publishedAt": "2026-01-21T16:08:47Z",
      "title": "Oldest known cave art found on the walls of Indonesian caverns",
      "url": "https://apnews.com/article/oldest-cave-art-indonesia-sulawesi-dda02b8f8aa0b72e99e2bd6146c500df",
      "urlToImage": "https://dims.apnews.com/dims4/default/fde99a0/2147483647/strip/true/crop/3648x2052+0+342/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F87%2Fee0b2fcc8db5da92a04131d269f4%2F2537af01a5434c869868aae0b75238eb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}