{
  "articles": [
    {
      "author": null,
      "description": "The risk of life-threatening flooding is still high in central Texas with more rain on the way. The urgent search for the missing continues following a holiday weekend deluge that killed at least 82 people including children at summer camps. Officials say the death toll is sure to rise. Gov. Greg Abbott says more than 40 people are unaccounted for. Searchers now have found 68 bodies in Kerr County, where a wall of water came down the Guadalupe River. Sheriff Larry Leitha says the dead include 28 children. Abbott warned Sunday that additional rounds of heavy rains lasting into Tuesday could produce more flash flooding.",
      "publishedAt": "2025-07-07T04:06:20Z",
      "title": "More than 80 dead, dozens missing in Texas flooding as search continues",
      "url": "https://apnews.com/article/texas-flash-flood-severe-weather-camp-mystic-ef8e596833b145fef61451db92f32609",
      "urlToImage": "https://dims.apnews.com/dims4/default/738f522/2147483647/strip/true/crop/3600x2025+0+98/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2Fea%2Fd31d346a5c32b59bb3a8b71af6a5%2F6e234350183a4cee91a68653a78d0693"
    },
    {
      "author": null,
      "description": "Former federal officials and outside experts have warned for months that President Donald Trump’s staffing cuts to the National Weather Service could endanger lives. After torrential rains and flash flooding struck Friday in the Texas Hill Country, the weather service came under fire from local officials who criticized what they described as inadequate forecasts. Democrats wasted little time linking staff reductions to the disaster, which is being blamed for the deaths of at least 80 people. Former federal officials and experts have said Trump’s indiscriminate job reductions at NWS and other weather-related agencies will result in brain drain that threatens the government’s ability to issue timely and accurate forecasts. Trump said job cuts did not hamper weather forecasts.",
      "publishedAt": "2025-07-07T17:25:28Z",
      "title": "Debate erupts over role Trump cuts played in response to deadly Texas floods",
      "url": "https://apnews.com/article/weather-texas-floods-trump-doge-cuts-noaa-nws-commerce-hurricane-4740019969a6b7a1b566e98dcb85562b",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd955a2/2147483647/strip/true/crop/4817x2710+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fea%2Ff4b1a81a57f21001e7f17baf623c%2Fece7dd9cbff549b5877f64ca8251212f"
    },
    {
      "author": null,
      "description": "Flash floods in Texas have killed nearly 70 people, many of them children. An unknown number of people are missing. Heavy rains fell quickly in the predawn hours Friday in the Texas Hill Country, causing the Guadalupe River to rise 26 feet in just 45 minutes. Among the missing are 27 girls from Camp Mystic, a Christian summer camp. Officials are resisting estimating the total number of missing. The July Fourth holiday weekend likely brought an influx of visitors to the area outside San Antonio, making it difficult to track all the people who may have been in the area.",
      "publishedAt": "2025-07-06T16:25:30Z",
      "title": "What to know about the Texas flash floods and the rising death toll",
      "url": "https://apnews.com/article/flash-flood-texas-camp-mystic-aec9181a07d3ce8ff85197922e108b13",
      "urlToImage": "https://dims.apnews.com/dims4/default/154f53b/2147483647/strip/true/crop/3600x2025+0+80/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F78%2Fd1cad5f70533b8ed2593e866e61c%2F71337bc08bf34e5ebd8267d8fc6fb9a3"
    },
    {
      "author": null,
      "description": "Israel’s military launched airstrikes early Monday targeting ports and facilities held by Yemen’s Houthi rebels, with the rebels responding with missile fire targeting Israel. The attacks came after a suspected Houthi attack targeting a ship in the Red Sea that caught fire and took on water, later forcing its crew to abandon the vessel. The Israeli military said it struck Houthi-held ports at Hodeida, Ras Isa and Salif. The Houthis then responded with an apparent missile attack on Israel. The Israeli military said it attempted to intercept the missile, but it appeared to make impact, though there were no immediate reports of injuries from the attack.",
      "publishedAt": "2025-07-07T01:30:05Z",
      "title": "Israeli airstrikes hit Yemen's Houthi rebels",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-15edf75586540201f63b7c33348fb737",
      "urlToImage": "https://dims.apnews.com/dims4/default/02e17b8/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F88%2F9ebd2b838e8c0c7f4b12e0c0aae4%2F91f88bfc3ab74d939977bae744355640"
    },
    {
      "author": null,
      "description": "Authorities say Russia’s transport minister was found dead from a gunshot wound in an apparent suicide. The statement about the death of Roman Starovoit, 53, came hours after a Kremlin announcement that he had been dismissed by President Vladimir Putin. The Kremlin did not give a reason for his firing, and details of when he died were unclear, along with whether it was related to an alleged embezzlement case that surfaced in some Russian media. Russia’s Investigative Committee his body was found in his car with a gunshot wound in Odintsovo, a western Moscow neighborhood where members of Russia’s elite live. A gun was found next to his body.",
      "publishedAt": "2025-07-07T14:33:24Z",
      "title": "Russia's transportation minister found dead in what officials say was an apparent suicide",
      "url": "https://apnews.com/article/russia-starovoyt-minister-suicide-kursk-59babee35c7c1bae79c5becd51f52066",
      "urlToImage": "https://dims.apnews.com/dims4/default/7232130/2147483647/strip/true/crop/2679x1507+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F3b%2Ff99faf9cec3796451d13d6a58ae0%2F8922903c63d94f7fb9fa19e7ea7ea675"
    },
    {
      "author": null,
      "description": "The Justice Department will not release more files related to the wealthy financier Jeffrey Epstein's sex trafficking investigation despite promises from Attorney General Pam Bondi that had raised the expectations of conservative influencers and conspiracy theorists. A Justice Department memo released Monday says there is no evidence Epstein maintained a “client list.\" It represents a public walk-back of a theory that the Trump administration itself had helped promote, with Bondi suggesting in a Fox News interview earlier this year that such a document was “sitting on my desk” in preparation for release. Bondi for weeks had suggested that more evidence was going to be revealed, saying in one interview: “It’s a new administration and everything is going to come out to the public.\"",
      "publishedAt": "2025-07-07T17:31:25Z",
      "title": "Justice Department walks back theory Bondi promoted about Epstein client list",
      "url": "https://apnews.com/article/jeffrey-epstein-justice-department-pam-bondi-03fbcd024f631440f7ed62b3c6927db3",
      "urlToImage": "https://dims.apnews.com/dims4/default/623f1d3/2147483647/strip/true/crop/5076x2855+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F30%2Fdb31f06393be93deaa40f7467193%2F4b8e111561104bbd85cd54aa9f410507"
    },
    {
      "author": null,
      "description": "Officials in North Carolina say heavy rain and flooding from the remnants of Tropical Storm Chantal forced dozens of people to flee their homes. The Chapel Hill Fire Department and neighboring agencies completed more than 50 water rescues, many of them in areas where floodwaters entered or threatened to enter apartments. Chapel Hill officials said Monday that more than 60 people were displaced Sunday and Monday. In Orange County, the possibility of the failure of the Lake Michael Dam prompted officials to issue a voluntary evacuation for areas downstream. In Chatham County, Sheriff Mike Roberson warned residents that water may have subsided in some areas, but it was still dangerous to travel. He says officials were searching for some missing persons.",
      "publishedAt": "2025-07-07T13:26:31Z",
      "title": "Chantal's remnants bring flooding to North Carolina",
      "url": "https://apnews.com/article/tropical-depression-chantal-north-carolina-flooding-74946d15cd1f01a5fc697d1b46289617",
      "urlToImage": "https://dims.apnews.com/dims4/default/51d31d2/2147483647/strip/true/crop/1446x813+0+116/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F98%2F7312466dfa598fcf1f960d4130e6%2F488ab5d5707040139188c9d96a378c6c"
    },
    {
      "author": null,
      "description": "Wall Street is pointing to a lower open as the Trump administration steps up pressure on trading partners to quickly make deals before a Wednesday deadline. The U.S. will warn trading partners that higher tariffs could kick in Aug. 1. Futures for the S&P 500 fell 0.3% before the opening bell Monday, while futures for the Dow Jones Industrial Average slipped less than 0.1%. Nasdaq futures slid 0.5%. In equities trading, Tesla tumbled 6.5% as the feud between CEO Elon Musk and Trump reignited over the weekend. Musk, once a top donor and ally of Trump, announced that he was forming a third political party in protest over the Republicans’ spending bill that passed late last week.",
      "publishedAt": "2025-07-07T04:01:41Z",
      "title": "Wall Street points to losses as Trump’s tariff deadline looms",
      "url": "https://apnews.com/article/asia-markets-oil-us-tariffs-deadline-b1fecf1457f908c1845669fa5349b14b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f60a878/2147483647/strip/true/crop/4209x2368+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F85%2F84c62d855f95bf1ac5455e905ad0%2Fcaed0f2a26d84253adc3e930854610d3"
    },
    {
      "author": null,
      "description": "A new study shows that the health of U.S. children has deteriorated over the past 17 years, with kids today more likely to experience obesity, chronic diseases and other problems. The research was published Monday in the Journal of the American Medical Association. Health Secretary Robert F. Kennedy Jr. has brought children’s health to the forefront of the national policy conversation. His agency's report in May described kids as undernourished and overmedicated. But outside experts who reviewed the new study say the Trump administration’s decision to make cuts to federal health agencies, Medicaid and scientific research are not likely to reverse the trend.",
      "publishedAt": "2025-07-07T15:01:25Z",
      "title": "US children are growing increasingly unhealthy, new study says",
      "url": "https://apnews.com/article/children-health-maha-rfk-jr-jama-d920bb5421bfdc2c83d4356986e9ade7",
      "urlToImage": "https://dims.apnews.com/dims4/default/2722b8f/2147483647/strip/true/crop/3942x2217+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F4e%2Fea2bd3f4078c4282a45a883e54ef%2Fe2aebfb4cafc4eefbfcb785759368c5c"
    },
    {
      "author": null,
      "description": "Russia has launched over 100 drones targeting civilian areas in Ukraine. Ukrainian officials say at least 10 civilians were killed and 38 injured in the past 24 hours. Russia has intensified aerial strikes, deploying thousands of drones, missiles and bombs in recent weeks. Ukrainian President Volodymyr Zelenskyy announced new deals with European allies and a U.S. defense company to boost drone production. Meanwhile, Russia's Defense Ministry says it shot down 91 Ukrainian drones overnight. President Vladimir Putin also dismissed his transportation minister after widespread flight disruptions caused by Ukrainian drone threats over the weekend.",
      "publishedAt": "2025-07-07T10:40:04Z",
      "title": "Russia fires over 100 drones at Ukraine as Kremlin dismisses transport chief after travel chaos",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-attacks-c7a1bf1a28ecd2853c037f1864ef7edc",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8495b9/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fcb%2Ff4da34f1ccb1539c32495b98128f%2F0c537948f0a244ee9eafc646a504eb95"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}