{
  "articles": [
    {
      "author": "WILL WEISSERT, BILL BARROW and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden and his predecessor, Donald Trump, romped coast-to-coast on Super Tuesday, all but cementing a November rematch and increasing pressure on the former president’s last major rival, Nikki Haley, to leave the Republican race.",
      "publishedAt": "2024-03-05T05:06:26Z",
      "title": "Biden and Trump are dominating Super Tuesday races and moving closer to a November rematch",
      "url": "https://apnews.com/e36971a222a2b50d35cb0a2c603ce4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad0de13b216b4779b13256fc1311ce34/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Super Tuesday primaries are the largest voting day of the year in the United States aside from the November general election.Voters in 16 states and one territory are choosing presidential nominees.",
      "publishedAt": "2024-03-05T16:21:34Z",
      "title": "The Latest | 2 Democrats advance to runoff in Alabama’s redrawn 2nd District",
      "url": "https://apnews.com/45ccad900e41fe12cb68a9e0982c610e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2be6552929e5453e8fc53b1073e5f129/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "BEIJING (AP) — China's Premier Li Qiang promoted an image of confidence as he announced modest economic growth goals for the world's second largest economy, at one of the country's most important political gatherings.",
      "publishedAt": "2024-03-05T06:53:55Z",
      "title": "Economic plans, Taiwan and other things to know from the opening of China's legislature",
      "url": "https://apnews.com/76ee304ab3fcafb45c0af9a2968e8d5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c728b0e7834048f79b5f9216f52ee669/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers said Tuesday that the ex-president deserves a new trial and a fresh chance to tell a jury why he berated writer E.",
      "publishedAt": "2024-03-06T00:16:10Z",
      "title": "Trump lawyers want him back on witness stand in E. Jean Carroll case",
      "url": "https://apnews.com/46dce8f533d4c58a3aa624726c658a86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6f866c8e7674070bab3c43b435e1b5b/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A U.S. destroyer shot down drones and a missile launched by Yemen's Houthi rebels toward it in the Red Sea, officials said early Wednesday, as the Indian navy released images of it fighting a fire aboard a container ship earlier targeted by the Houthis.",
      "publishedAt": "2024-03-06T01:23:36Z",
      "title": "US destroyer shoots down missile and drones launched by Yemen's Houthi rebels",
      "url": "https://apnews.com/89c5440d9943216a787b39912bd969e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e5366c4e28b4193a4297c308887667f/3000.jpeg"
    },
    {
      "author": "EVENS SANON, JOSHUA GOODMAN and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s prime minister landed in Puerto Rico on Tuesday, answering a key question on the minds of all Haitians ever since armed gangs plunged the long-suffering Caribbean nation into near anarchy: Where in the world is he?",
      "publishedAt": "2024-03-05T17:51:44Z",
      "title": "Haitian PM arrives in Puerto Rico after long absence as he struggles to get home to quell violence",
      "url": "https://apnews.com/0116d2ebac1b14a587baa176818055cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa345191699c41a2a4a8c91c670bedda/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden was sweeping every Democratic contest on Super Tuesday — except for American Samoa.",
      "publishedAt": "2024-03-06T03:03:22Z",
      "title": "Who is Jason Palmer? A previously unknown Democrat beats Biden in American Samoa's Democratic caucus",
      "url": "https://apnews.com/c4bc109a16c7ee7b083f6216b44ba0c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/857a7aa7d63147478bb012c2905f06ef/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Independent Sen. Kyrsten Sinema of Arizona announced on Tuesday that she won’t run for a second term after her estrangement from the Democratic Party left her politically homeless and without a clear path to reelection.",
      "publishedAt": "2024-03-05T19:27:35Z",
      "title": "Independent Sen. Kyrsten Sinema of Arizona says she won’t seek reelection, avoiding a 3-way race",
      "url": "https://apnews.com/8043c3333e6d87da2404f58339f1e1e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db0ca1b4b6dd445db7e6a89e93e84d0f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "CAIRO (AP) — Three days of negotiations with Hamas over a cease-fire in Gaza and the release of Israeli hostages failed to achieve a breakthrough on Tuesday, Egyptian officials said, less than a week before the start of the Muslim holy month of Ramadan, the informal deadline for a deal.",
      "publishedAt": "2024-03-05T13:23:42Z",
      "title": "Gaza cease-fire talks fail to achieve a breakthrough with Ramadan just days away, Egypt says",
      "url": "https://apnews.com/a13c5fa6e23fedbda42e3028a96ca14e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9207bd440a44917b148191a5a948720/1920.jpeg"
    },
    {
      "author": "RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — Attorneys for Meta Platforms and several of its current and former leaders, including founder Mark Zuckerberg, are asking a Delaware judge to dismiss a shareholder lawsuit alleging the company has deliberately failed to protect users of its social media platforms from human trafficking and child sexual exploitation.",
      "publishedAt": "2024-03-05T23:14:10Z",
      "title": "Meta attorneys ask judge to dismiss shareholder suit alleging failure to address human trafficking",
      "url": "https://apnews.com/5e6ff26f20b5cac06ab3406e5b81ff1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17f56c40483d4d71844740fbf5a2ca50/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}