{
  "articles": [
    {
      "author": null,
      "description": "Two staff members of the Israeli embassy were shot and killed Wednesday evening while leaving an event at a Jewish museum in the nation’s capital, and the suspect and yelled “free, free Palestine” after he was arrested, police said. The two victims, a man and a woman, were leaving an event at the Capital Jewish Museum when the 30-year-old suspect approached a group of four people and opened fire, Metropolitan Police Chief Pamela Smith said. The suspect was observed pacing outside the museum before the shooting, walked into the museum after the shooting and was detained by event security, Smith said.",
      "publishedAt": "2025-05-22T03:39:04Z",
      "title": "Two staff members of Israeli embassy killed in shooting in Washington DC",
      "url": "https://apnews.com/article/israel-embassy-jewish-museum-shooting-10307b3b1a2a337e76730736b12ebbcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/702896e/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F1c%2F397aa52d82bd737fb422396e806c%2Fb880a32f53804a4d865aeb0120f97f9b"
    },
    {
      "author": "Lindsay Whitehurst, Michael Casey, Tim Sullivan, Rebecca Santana",
      "description": "A federal judge says the White House violated a court order on deportations to third countries with a flight linked to the chaotic nation of South Sudan. The Trump administration says it expelled eight immigrants convicted of violent crimes in the United States but refused to reveal where they would end up. Judge Brian E. Murphy in Boston said the eight migrants aboard the plane were not given a meaningful opportunity to object that the deportation could put them in danger. He ordered a new set of interviews with the migrants, either back in the U.S. or abroad. Before Wednesday's hearing, administration officials accused “activist judges” of advocating the release of dangerous criminals.",
      "publishedAt": "2025-05-21T13:09:44Z",
      "title": "Judge says US violated order on deportations to third countries",
      "url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-a09612dbd055c5d1d88902c415bdf3e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb1b0b6/2147483647/strip/true/crop/5608x3155+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F7d%2F8af24457b16d9785e7e208d842ad%2F5ef8b4863aad48bdada6dd5f80a8242c"
    },
    {
      "author": "Steve Karnowski, Alanna Durkin Richer",
      "description": "The Justice Department has moved to cancel settlements with Minneapolis and Louisville, Kentucky, that called for an overhaul of policing following the killings of George Floyd and Breonna Taylor. The department announced the steps Wednesday. Minneapolis in January approved a consent decree with the federal government in the final days of the Biden administration to overhaul its training and use-of-force policies under court supervision. The agreement required approval from a federal court. But the Trump administration told the court it doesn't intend to proceed. The administration also announced it's retracting the findings of Justice Department investigations into six other police departments that the Biden administration had accused of civil rights violations.",
      "publishedAt": "2025-05-21T14:35:49Z",
      "title": "Justice Department moves to cancel police reform settlements with Minneapolis, Louisville",
      "url": "https://apnews.com/article/justice-department-police-reform-george-floyd-9d7cf00be8477e3dcb2fe1a658d73667",
      "urlToImage": "https://dims.apnews.com/dims4/default/071b0a1/2147483647/strip/true/crop/5842x3286+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fed%2F147d71991fffe61e1414af4642a9%2Fd26b356ebce5442386cfd08115aee8a0"
    },
    {
      "author": "Tim Reynolds",
      "description": "The case for Shai Gilgeous-Alexander was simple. He’s the best player on an Oklahoma City Thunder team that had the best record this season and set a league mark for margin of victory. If that wasn’t enough, he also won the scoring title. That’s an MVP year. Gilgeous-Alexander was announced Wednesday as the NBA’s Most Valuable Player, his first time winning the award. It’s now seven straight years that a player born outside the U.S. won MVP, extending the longest such streak in league history.",
      "publishedAt": "2025-05-21T13:56:04Z",
      "title": "Gilgeous-Alexander voted as the NBA's MVP, continuing run of international players winning the award",
      "url": "https://apnews.com/article/nba-mvp-gilgeous-alexander-jokic-antetokounmpo-062dff888a889c6cd7228e0bbe94285e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bda03b/2147483647/strip/true/crop/4964x2792+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F4f%2Fbb57d829865226a2b3ab70aa61f2%2F11b80a7cf4304be39c0a5e85fd466132"
    },
    {
      "author": "Kim Tong-hyung, Hyung-Jin Kim",
      "description": "North Korea says a new 5,000-ton destroyer key to its naval advancement was damaged during its launching ceremony attended by leader Kim Jong Un. State media reported the ship slid off the ramp and became stuck after the flatcar failed to move alongside it, throwing off its balance and crushing parts of the ship’s bottom. The accident at Wednesday’s ceremony at the northeastern port of Chongjin was an embarrassing setback for Kim, who has emphasized naval advancement as key to his nuclear-armed military. The report said Kim blamed military officials, scientists and shipyard operators for the accident. The damaged vessel was likely in the same class as the country’s first destroyer unveiled in April.",
      "publishedAt": "2025-05-22T01:45:43Z",
      "title": "North Korea's second naval destroyer is damaged in a failed launch at a ceremony attended by Kim",
      "url": "https://apnews.com/article/north-korea-kim-jong-un-destroyer-damaged-nuclear-9f66685ad8f34d5bef027750a0678370",
      "urlToImage": "https://dims.apnews.com/dims4/default/df5ec5e/2147483647/strip/true/crop/4170x2346+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fdb%2F19825cfacc2085739e9a30614928%2Fc95178bca0a8474db916da92ea6380e4"
    },
    {
      "author": "Gerald Imray, Aamer Madhani",
      "description": "President Donald Trump has used a White House meeting to confront South African President Cyril Ramaphosa with baseless claims of the systematic killing of white farmers in that country. Trump said during Wednesday's meeting that people are fleeing South Africa for their own safety. At one point, Trump dimmed the lights in the Oval Office to play a video of a far-left politician playing an anti-apartheid song that included lyrics about killing farmers. Ramaphosa pushed back against Trump’s accusation, saying of the behavior alleged by the U.S. president, “We are completely opposed to that.”",
      "publishedAt": "2025-05-21T16:26:39Z",
      "title": "Trump confronts South African leader with baseless claims about white farmers",
      "url": "https://apnews.com/article/trump-ramaphosa-south-africa-9ce43dd5a9cd58e912653c99a8ab1944",
      "urlToImage": "https://dims.apnews.com/dims4/default/1713a76/2147483647/strip/true/crop/5616x3159+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F44%2F5b55ab77fb84989470d0ec854d4f%2F415ec591976a4a278fec97e589094877"
    },
    {
      "author": null,
      "description": "The Pentagon says Defense Secretary Pete Hegseth has accepted a gifted Boeing 747 from Qatar for President Donald Trump to use as Air Force One. Pentagon spokesman Sean Parnell said Wednesday that the department will “work to ensure proper security measures” on the aircraft to make it safe for use by the president. He said the plane was accepted “in accordance with all federal rules and regulations.”",
      "publishedAt": "2025-05-21T17:16:48Z",
      "title": "Defense Department accepts Boeing 747 from Qatar for Trump's use",
      "url": "https://apnews.com/article/trump-qatar-air-force-one-gift-plane-c4e1d73c3dbe18397c10e3d3d267bcd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bb810d/2147483647/strip/true/crop/4505x2534+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F88%2F6eb23c0a9719485ade637f02df3b%2F544e008651bd498b93cba817ea0280ef"
    },
    {
      "author": "Isabella O'malley, Patrick Whittle",
      "description": "An unusual May nor’easter is set to wallop New England and provide a soaking before the Memorial Day holiday weekend with weather more commonly associated with fall and winter. The heaviest of the wet weather is expected to arrive on Thursday. Nor’easters usually arrive in the end of fall and winter and bring high winds, rough seas and precipitation in the form of rain or snow. This week’s nor’easter could bring wind gusts over 40 mph and up to two inches of rain in some areas. Snow is even possible at high elevations.",
      "publishedAt": "2025-05-21T18:48:57Z",
      "title": "May nor'easter to rain, snow on New England before Memorial Day",
      "url": "https://apnews.com/article/noreaster-spring-storm-memorial-day-snow-rain-5aa22917a35160a31c941d560944f0b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/702439d/2147483647/strip/true/crop/6990x3932+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2Fb5%2F7d8a71ffdd4fda95ce1cfb6bf691%2F3b427f82fb644eefab0c588c9fc23e7f"
    },
    {
      "author": "Stan Choe",
      "description": "Wall Street is slumping under the weight of pressure from the bond market, where Treasury yields climbed on worries about the U.S. government’s spiraling debt and other concerns. The S&P 500 fell 1.5% Wednesday. The Dow Jones Industrial Average dropped 784 points, and the Nasdaq composite sank 1.3%. Stocks had been drifting only modestly lower earlier in the day, after Target and other retailers gave mixed forecasts for their upcoming profits. The market then turned sharply lower after the U.S. government released the results for its latest auction of 20-year bonds. That helped send Treasury yields jumping.",
      "publishedAt": "2025-05-21T03:28:05Z",
      "title": "Wall Street slumps under the weight of jumping Treasury yields and US debt worries",
      "url": "https://apnews.com/article/stocks-markets-oil-trump-tariffs-8f9b85dc446a9d795806d82467747691",
      "urlToImage": "https://dims.apnews.com/dims4/default/af8c059/2147483647/strip/true/crop/5888x3312+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F69%2F621244814f1d00d718aa31170459%2Fe3112a6a253e4c0e8fbfab92370ce98d"
    },
    {
      "author": "Devi Shastri, Laura Ungar",
      "description": "A person attended a Shakira concert at the MetLife Stadium in New Jersey while infectious with measles. Health officials are asking people who attended to monitor for symptoms. More than 1,000 measles cases have been confirmed across the U.S. this year, with major outbreaks in Texas, New Mexico, Kansas and eight other states. There are also many international outbreaks including in Mexico and Canada as childhood vaccination rates have declined since the pandemic.",
      "publishedAt": "2025-05-21T17:14:15Z",
      "title": "Measles exposure at Shakira concert in New Jersey",
      "url": "https://apnews.com/article/shakira-measles-new-jersey-texas-mmr-25022a0b7c69a23c27b0ccdbf818ee86",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0d1da1/2147483647/strip/true/crop/6883x3872+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F5e%2F0554865e7e8821cc645360386753%2Fed11a8527ce743b393a4a2d667e81d96"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}