{
  "articles": [
    {
      "author": "FADI TAWIL and JACK JEFFERY",
      "description": "BEIRUT (AP) — An Israeli airstrike on an apartment in central Beirut killed seven Hezbollah-affiliated civilian first responders. Israel has been pounding areas of the country where the militant group has a strong presence since late September, but has rarely struck in the heart of the capital.",
      "publishedAt": "2024-10-03T08:57:22Z",
      "title": "Rare Israeli strike in central Beirut kills 7 as troops battle Hezbollah in southern Lebanon",
      "url": "https://apnews.com/5fad98f56ebcc7e1751388b608c7c8dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e583b61c8f741f1b9b718fd341eae72/3000.jpeg"
    },
    {
      "author": "JEFF AMY, ERIK VERDUZCO and BRITTANY PETERSON",
      "description": "BLACK MOUNTAIN, N.C. (AP) — Sarah Vekasi is a potter who runs a store in Black Mountain, North Carolina, called Sarah Sunshine Pottery, named after her normally bubbly personality. But these days she’s struggling with the trauma of Hurricane Helene and uncertainty about the future of her business.",
      "publishedAt": "2024-10-03T04:16:47Z",
      "title": "Human connections bring hope in North Carolina after devastation of Helene",
      "url": "https://apnews.com/64fe5ca1b80f22fd2fd3b7c50b291d85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be96fe66d43d42839a1e76ca285263f6/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The devastation wrought by Hurricane Helene has brought climate change to the forefront of the presidential campaign after the issue lingered on the margins for months.",
      "publishedAt": "2024-10-03T04:03:38Z",
      "title": "Hurricane Helene brings climate change to forefront of the presidential campaign",
      "url": "https://apnews.com/e1023e209548db8ec587115505c9797f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa13ddecab9488ab9d52ca3245ef12f/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Liz Cheney, one of Donald Trump’s fiercest Republican antagonists, will join Democrat Kamala Harris at a campaign event in Wisconsin on Thursday aimed at reaching out to moderate voters and rattling the former president.",
      "publishedAt": "2024-10-03T09:02:03Z",
      "title": "Liz Cheney will campaign with Harris in Wisconsin while Trump holds a rally in Michigan",
      "url": "https://apnews.com/89396853e5521c3870a3c88e04cbfd99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be09976ba33d48e9b9026e3be68155e4/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and “resorted to crimes” in his failed bid to cling to power, according to a court filing unsealed Wednesday that offers new evidence from the landmark criminal case against the former president.",
      "publishedAt": "2024-10-02T19:53:53Z",
      "title": "Prosecutors lay out new evidence in Trump election case, accuse him of having 'resorted to crimes'",
      "url": "https://apnews.com/0b9969b480036bb1f7c61a73980d406c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aebce365f3764a0eb2a53dca322b8d78/3000.jpeg"
    },
    {
      "author": "AARON MORRISON and MATT BROWN",
      "description": "NEW YORK (AP) — It wasn’t a shock to many Black New Yorkers that Mayor Eric Adams has surrounded himself with African American civil rights leaders, clergy and grassroots activists since his indictment last week on federal bribery charges.",
      "publishedAt": "2024-10-03T05:10:36Z",
      "title": "How Black leaders in New York are grappling with Eric Adams and representation",
      "url": "https://apnews.com/57c751535b42cb1d59a5c68a7008d3ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/027dfa5bc9354b0fa71943cf9cefb632/1920.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "KAOHSIUNG, Taiwan (AP) — Typhoon Krathon made landfall Thursday in Taiwan's major port city of Kaohsiung, bringing torrential rains and fierce winds to the island's south. Trees were brought down by high winds and roads were flooded, prompting the closure of schools and businesses.",
      "publishedAt": "2024-10-03T00:57:36Z",
      "title": "Typhoon Krathon makes landfall in Taiwan, packing fierce winds and torrential rain",
      "url": "https://apnews.com/e4acaaf0fbf22779c1f0124ee2f2712b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b19030883842456da3e99ca174998571/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Three years after the 30-year-old South Korean woman received a barrage of online fake images that depicted her nude, she is still being treated for trauma. She struggles to talk with men.",
      "publishedAt": "2024-10-03T02:52:13Z",
      "title": "In South Korea, deepfake porn wrecks women's lives and deepens gender conflict",
      "url": "https://apnews.com/df98e1a6793a245ac14afe8ec2366101",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5ddf50c752b4e6bb6a160e70f7bb5ea/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON, HELEN WIEFFERING and MANUEL VALDES",
      "description": "LONG BEACH, Wash. (AP) — Russ Lewis has picked up some strange things along the coast of Long Beach Peninsula in Washington state over the years: Hot Wheels bicycle helmets with feather tufts, life-size plastic turkey decoys made for hunters, colorful squirt guns.",
      "publishedAt": "2024-10-03T04:03:46Z",
      "title": "Thousands of shipping containers have been lost at sea. What happens when they burst open?",
      "url": "https://apnews.com/68620037992758a714b010345e1937fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/256111151e83445ca99362fced589096/3000.jpeg"
    },
    {
      "author": "KEN RITTER and HANNAH SCHOENBAUM",
      "description": "LAS VEGAS (AP) — A historic building boom of big, bright Church of Jesus Christ of Latter-day Saints temples — beacons to the faithful with steeples pointing heavenward around the world — is meeting resistance in some parts of the U.S., including one place not really known for moderation.",
      "publishedAt": "2024-10-03T04:24:28Z",
      "title": "Mormon faith pushes ahead with global temple building boom despite cool reception in Las Vegas",
      "url": "https://apnews.com/d5b77e0f64b46845afc6515563a3ccb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5415a4c177f4b15922a1e494edf1c4c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}