{
  "articles": [
    {
      "author": "Meg Kinnard, Kevin S. Vineys",
      "description": "Civilian federal jobs are being cut by the thousands, as Elon Musk’s Department of Government Efficiency continues to shrink the government workforce at the behest of President Donald Trump. That’s brought a lot of churn and uncertainty in the nation’s capital, where 20% of the country’s more than 2 million civilian — or nonmilitary — federal workers are located. It’s also affecting workers and communities outside the Washington, D.C. area, where about 80% of that workforce is based. Those cuts mean that members of Congress are now facing potential angst among the out-of-work federal employees in their districts across the country. Some of the highest concentrations of federal workers are in places such as Oklahoma, Alaska, Alabama and New Mexico.",
      "publishedAt": "2025-02-27T20:48:14Z",
      "title": "Where are federal jobs affected by DOGE cuts? A look at congressional districts across the US",
      "url": "https://apnews.com/article/doge-federal-job-cuts-congressional-districts-data-5d79e2a7ef2160166b0bee59dfa4e9e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ad665e/2147483647/strip/true/crop/1442x811+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fa7%2F802522fd8fcf73aae6cc52b83786%2F5d3eb399a07e4c729980f7d43f05fa3d"
    },
    {
      "author": "Lolita C. Baldor",
      "description": "Five former secretaries of defense are calling on Congress to hold immediate hearings on President Donald Trump’s recent firings of the chairman of the Joint Chiefs of Staff and several other senior military leaders. That's according to a letter obtained by The Associated Press. The five men represent Republican and Democratic administrations over the past three decades. They said the dismissals raised troubling questions about the administration’s desire to politicize the military. Defense Secretary Pete Hegseth has defended the firing of Gen. CQ Brown Jr. as chairman of the Joint Chiefs, saying that other presidents made changes in military personnel and that Trump deserves to pick his own team.",
      "publishedAt": "2025-02-27T22:10:40Z",
      "title": "Former defense chiefs call for hearings on Trump's firing of Pentagon leaders",
      "url": "https://apnews.com/article/pentagon-defense-chiefs-firings-congress-6da5306a912d578f22bb2239f80502e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8560ff/2147483647/strip/true/crop/8115x4565+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fc5%2F0add6135c19ee91e271b4ba0d161%2Fbbe6a549f1ed46a4ae9ef00a36f4313a"
    },
    {
      "author": "Fatima Hussein",
      "description": "The Social Security Administration is preparing to lay off at least 7,000 people from its workforce of 60,000 — and the final reduction in force number could be as high as 50%, according to two people familiar with the agency’s plans who are not authorized to speak publicly. It’s unclear how the layoffs will directly impact benefits of the 72.5 million beneficiaries, including retirees and children who receive retirement and disability benefits. However, advocates and Democratic lawmakers warn that layoffs will reduce the agency’s ability to serve recipients in a timely manner. The layoffs are part of the Trump administration’s intensified efforts to shrink the size of the federal workforce through the Department of Government Efficiency, run by Trump advisor Elon Musk.",
      "publishedAt": "2025-02-27T21:16:00Z",
      "title": "Social Security Administration could cut halve its workforce amid DOGE cuts",
      "url": "https://apnews.com/article/social-security-layoffs-doge-musk-trump-93efbed33957af5ec8ac37744d0592de",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "Chris Megerian",
      "description": "President Donald Trump's administration says federal agencies should begin planning to eliminate employee positions. The process is known as a reduction in force. Agency leaders must submit their plans by March 13. Trump is setting the stage for what could become a dramatic realignment of the federal government. He's already downsized the workforce by laying off probationary employees. Now the administration is turning its attention to career officials with civil service protection. Trump foreshadowed this goal in an executive order that he signed with Elon Musk, the billionaire entrepreneur who's advising the Republican president on overhauling the government.",
      "publishedAt": "2025-02-26T16:31:00Z",
      "title": "Trump administration sets stage for large-scale federal worker layoffs in new memo",
      "url": "https://apnews.com/article/trump-elon-musk-federal-workers-layoffs-d295d4bb2cdd5023c27d9cb03754e81b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d981041/2147483647/strip/true/crop/7394x4159+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F41%2Fe107c105defd724c2bdc48419a33%2F57ed9e887bf24efb9d5367711da29934"
    },
    {
      "author": "Felicia Fonseca, Susan Montoya Bryan, Brian Melley",
      "description": "A search warrant shows that Oscar-winner Gene Hackman, his wife and one of their dogs had been dead for some time when a maintenance worker discovered their bodies at the couple's Santa Fe, New Mexico, home. The Santa Fe County Sheriff’s Office said Thursday that Hackman was found dead Wednesday in a mudroom and his wife, Betsy Arakawa, was found in a bathroom next to a space heater. There was an open prescription bottle and pills scattered on the counter top near Arakawa. Authorities say foul play isn’t suspected, but they haven’t disclosed how the couple died and say the investigation is ongoing.",
      "publishedAt": "2025-02-27T09:04:08Z",
      "title": "Oscar winner Gene Hackman and his wife found dead at home in New Mexico",
      "url": "https://apnews.com/article/gene-hackman-found-dead-f6c106e92987aeaaab7b35c1b956a5c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/6742808/2147483647/strip/true/crop/2000x1125+0+90/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Ff9%2F4d57b3a5285c6c955263d7a0fafb%2Fceb1304ba74c491a8249a4b1bad6a196"
    },
    {
      "author": "Freida Frisaro, Curt Anderson",
      "description": "A travel ban was lifted on influencer brothers Andrew and Tristan Tate. The dual U.S.-British citizens are charged with human trafficking in Romania, along with two Romanian women. The Tates, both avid supporters of U.S. President Donald Trump, left on a flight headed for the U.S. on Thursday. Thirty-eight-year-old Andrew Tate is a former kickboxer, as is his 36-year-old brother, Tristan. They have millions of followers on social media. They are accused in Romania of forming a criminal gang to sexually exploit women.",
      "publishedAt": "2025-02-27T13:00:29Z",
      "title": "What to know about the Tate brothers, social media influencers who face trafficking charges",
      "url": "https://apnews.com/article/romania-andrew-tristan-tate-travel-ban-lifted-3c8b56be5d99f9ed04045f4680e5f8c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e39aa9/2147483647/strip/true/crop/6230x3504+0+324/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2Fc5%2F3f15f6d808fc4e463c5ff92d5174%2F32ea8010dafc4f5ebe5ca97e3fd46b93"
    },
    {
      "author": "Tara Copp, Lolita C. Baldor",
      "description": "The military services have 30 days to figure out how they will seek out and identify transgender service members to remove them from the force. It's a daunting task that may end up relying on troops self-reporting or tattling on their colleagues. A memo sent to Defense Department leaders Thursday orders the services to set up procedures to identify troops diagnosed with or being treated for gender dysphoria by March 26. They will then have 30 days to begin removing those troops from service. Transgender troops make up tiny fraction of the 2.1 million troops serving. President Donald Trump and Defense Secretary Pete Hegseth argue that their medical condition doesn’t meet military standards.",
      "publishedAt": "2025-02-27T04:58:56Z",
      "title": "Transgender troops are being identified for removal under Pentagon orders",
      "url": "https://apnews.com/article/transgender-military-trump-ban-troops-deb9e388ff588d9d25fb0d8cc58e540f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3faf15/2147483647/strip/true/crop/5246x2951+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fa7%2Fbec5a5b099e6c571e1ae440da8fa%2F86901f68313141d0a1fef40c42ae389b"
    },
    {
      "author": "Jill Lawless, Aamer Madhani",
      "description": "President Donald Trump says he’s confident that Russian leader Vladimir Putin will “keep his word” if there's an agreement to end Moscow's invasion of Ukraine. Trump said Thursday that going through the “Russia hoax” ordeal gives him confidence he can trust Putin in talks about the war in Ukraine that the Kremlin launched three years ago. Early in Trump's first term as president, he was dogged by a special counsel-led investigation looking into the FBI’s probe of Russian interference in his 2016 campaign for the White House. Trump made the comments at the start of his meeting with British Prime Minister Keir Starmer.",
      "publishedAt": "2025-02-27T05:02:38Z",
      "title": "Trump says he's confident Putin will 'keep his word' if there's a deal to end the war in Ukraine",
      "url": "https://apnews.com/article/trump-starmer-ukraine-28ca602f1df21af5797ba949f36160f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb273e3/2147483647/strip/true/crop/6657x3745+0+347/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F77%2F031747768025300b5f7877f3d120%2F77e31c8ca8af4596b611493c0dce0aba"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa, Natalie Melzer",
      "description": "An Israeli official says the military will not withdraw from a strategic corridor in the Gaza Strip. The pullout was part of the ceasefire and Israel’s refusal could spark a crisis with Hamas and key mediator Egypt at a sensitive moment for the fragile truce. The official says Israeli forces needed to remain in the so-called Philadelphi corridor, on the Gaza side of the border with Egypt, to prevent weapons smuggling. The official spoke hours after Hamas released the remains of four hostages in exchange for over 600 Palestinian prisoners, the last planned exchange of the ceasefire’s first phase, which ends this weekend.",
      "publishedAt": "2025-02-27T07:02:11Z",
      "title": "Bodies of 4 Israeli hostages identified after Hamas returned them, group says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-02-27-2025-cfcdd8786afe4bc73ae79b3e0e4ccb3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2af2e38/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F41%2F7182936257d78b536e9d76e8486d%2F120ee35bda8e4b6f84370dd5fda25294"
    },
    {
      "author": "Tia Goldenberg",
      "description": "An investigation by Israel's military has determined that Hamas was able to carry out the deadliest attack in Israeli history on Oct. 7, 2023, because the much more powerful Israeli army misjudged the militant group’s intentions and underestimated its capabilities. The findings, released Thursday, could pressure Prime Minister Benjamin Netanyahu to launch a widely demanded broader inquiry to examine the political decision-making that preceded the attack, which triggered the war in Gaza. Many Israelis believe the failures of Oct. 7 extend beyond the military and blame Netanyahu for what they view as a failed strategy of deterrence and containment in the years leading up to the attack. The prime minister has not taken responsibility, saying he will answer tough questions only after the war.",
      "publishedAt": "2025-02-27T17:03:28Z",
      "title": "Israel's army admits failures on Oct. 7. Its probe of the attack could put pressure on Netanyahu",
      "url": "https://apnews.com/article/israel-hamas-military-inquiry-gaza-34988076bd5283686cb80678aff799ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/a925a9b/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F12%2F58eb1953e2fe7cdeee5dca4f8c2b%2Ffdba84a1acbe4a6e89c58d903ed33d4f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}