{
  "articles": [
    {
      "author": "JAMEY KEATEN",
      "description": "OBBÜRGEN, Switzerland (AP) — Eighty countries called Sunday for the “territorial integrity” of Ukraine to be the basis for any peace agreement to end Russia’s two-year war, though some key developing nations at a Swiss conference did not join in — and the way forward for diplomacy remains unclear.",
      "publishedAt": "2024-06-16T11:21:04Z",
      "title": "80 countries at Swiss conference agree Ukraine's territorial integrity must be basis of any peace",
      "url": "https://apnews.com/568cafee5fbe9c3b19b79b041583a5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54bdfbe611bb4c00932f5f3ae450fc15/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and LEE KEATH",
      "description": "JERUSALEM (AP) — Israel's military announced on Sunday that it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.",
      "publishedAt": "2024-06-16T04:01:50Z",
      "title": "Israel's army says it will pause daytime fighting along a route in southern Gaza to help flow of aid",
      "url": "https://apnews.com/8c111f2dcf783f8671e6dd6f19547b17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdbab80a96e641d689b818c0b242583f/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNADO",
      "description": "CHICAGO (AP) — Reeling from a string of defeats, anti-abortion groups and their Republican allies in state governments are using an array of strategies to counter proposed ballot initiatives intended to protect reproductive rights or prevent voters from having a say in the fall elections.",
      "publishedAt": "2024-06-16T11:27:13Z",
      "title": "The anti-abortion movement is making a big play to thwart citizen initiatives on reproductive rights",
      "url": "https://apnews.com/7ac73939250441ddd015d3be741cfff2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c42cc33700948f2a08af59b38a5afb6/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — With less than three weeks until U.K. election day, Prime Minister Rishi Sunak is running out of time to change an ominous tune for his Conservative Party.",
      "publishedAt": "2024-06-16T12:51:55Z",
      "title": "Britain's July 4 election is fast approaching. Rishi Sunak is running out of time to change the tune",
      "url": "https://apnews.com/85e9f127daf7df4644a25c0377a09851",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e50b0583d0bc402f852e50224c8d943b/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "MINA, Saudi Arabia (AP) — Masses of pilgrims on Sunday embarked on a symbolic stoning of the devil in Saudi Arabia under the soaring summer heat. The ritual marks the final days of the Hajj, or Islamic pilgrimage, and the start of the Eid al-Adha celebrations for Muslims around the world.",
      "publishedAt": "2024-06-16T04:07:04Z",
      "title": "Pilgrims commence the final rites of Hajj as Muslims celebrate Eid al-Adha",
      "url": "https://apnews.com/0278c6e1040eac5f0b834f762f41db27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7983cdbd96614e798fa87761ffee2b57/3000.jpeg"
    },
    {
      "author": null,
      "description": "ROCHESTER HILLS, Mich. (AP) — Authorities on Sunday identified the man who opened fire at a splash pad in suburban Detroit before taking his own life, but his motives remained unknown as investigators worked to determine if he left behind any hint of his plans.",
      "publishedAt": "2024-06-16T16:30:19Z",
      "title": "Police identify Michigan splash pad shooter but there's still no word on a motive",
      "url": "https://apnews.com/9d9fb4e6dc8f022976bc2bb8f6334d70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6bcaeb33c364c5988a163562ec36342/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump on Saturday night suggested President Joe Biden “should have to take a cognitive test,\" only to confuse who administered the test to him in the next sentence.",
      "publishedAt": "2024-06-16T00:35:03Z",
      "title": "Trump challenges Biden to a cognitive test but confuses the name of the doctor who tested him",
      "url": "https://apnews.com/0d45b6d89ae295b690f5ad12ca0bd38a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d8bcc571c5e477ab352c4b1581b1ae1/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "LOS ANGELES (AP) — Some of Hollywood's brightest stars headlined a fundraiser for President Joe Biden that took in a record $30 million-plus for a Democratic candidate, according to his campaign, in hopes of energizing would-be supporters for a White House contest they said may rank among the most consequential in U.S.",
      "publishedAt": "2024-06-15T04:02:37Z",
      "title": "Clooney and Roberts help Biden raise $30 million-plus at a star-studded Hollywood gala",
      "url": "https://apnews.com/40081471c93faa68de5c4aa30455303b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e51436efa08245069b387cd501383ffa/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — With Pride Month in full gear, U.S. shoppers can find the usual merchandise many stores stock for the June celebration of LGBTQ+ culture and rights.",
      "publishedAt": "2024-06-16T11:35:40Z",
      "title": "Stores are more subdued in observing Pride Month. Some LGBTQ+ people see a silver lining in that",
      "url": "https://apnews.com/0d0ade0c3ba9766884a9ed7ad92f31fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c528c9d467b249a1be02ed2fc407a85c/3000.jpeg"
    },
    {
      "author": "DEREK GATOPOULOS and ALEX BABENKO",
      "description": "KYIV, Ukraine (AP) — Several hundred LGBTQ Ukrainian servicemen and their supporters marched in central Kyiv Sunday to demand more rights and highlight their service to their country in its war with Russia.",
      "publishedAt": "2024-06-16T10:10:00Z",
      "title": "LGBTQ soldiers in Ukraine hope their service is changing attitudes as they rally for legal rights",
      "url": "https://apnews.com/703de9b80de9d9dd0094235705af7f63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3cc8a601ed54b8b804b63cebe798f08/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}