{
  "articles": [
    {
      "author": "KEN RITTER",
      "description": "LAS VEGAS (AP) — A former Las Vegas-area Democratic elected official was sentenced Wednesday to serve at least 28 years in Nevada state prison for killing an investigative journalist who wrote articles critical of his conduct in office two years ago and exposed an intimate relationship with a female coworker.",
      "publishedAt": "2024-10-16T05:08:29Z",
      "title": "Former Las Vegas-area Democratic official sentenced to 28 years for killing reporter in 2022",
      "url": "https://apnews.com/485cbcbc07ec75c22a61abc22bdf8b14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc601ba3b86040789790b2394fbba1d6/3000.jpeg"
    },
    {
      "author": "MARIA CHENG and ANGIE WANG",
      "description": "TORONTO (AP) — A homeless man refusing long-term care, a woman with severe obesity, an injured worker given meager government assistance, and grieving new widows. All of them requested to be killed under Canada’s euthanasia system, and each sparked private debate among doctors and nurses struggling with the ethics of one of the world’s most permissive laws on the practice, according to an Associated Press investigation.",
      "publishedAt": "2024-10-16T04:06:52Z",
      "title": "Private forums show Canadian doctors struggle with euthanizing vulnerable patients",
      "url": "https://apnews.com/dfe59b1786592e31d9eb3b826c5175d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4aa4624d8fb14cee86ddb459e3deff04/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB, MOHAMMAD ZAATARI and SAMY MAGDY",
      "description": "QANA, Lebanon (AP) — Israeli airstrikes pounded areas across Lebanon, killing at least 25 people, officials said Wednesday, including more than a dozen in a southern town where Israeli bombardments in previous conflicts are seared into local memory.",
      "publishedAt": "2024-10-16T06:10:50Z",
      "title": "Israeli strikes kill 25 in Lebanon, including in a town with a dark history of civilian deaths",
      "url": "https://apnews.com/f18b2e0f5e05eb11a3c2ee29c16ed867",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/606f2f5d15b54729828e306c7a0859a5/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Democratic presidential nominee Kamala Harris is scheduled to campaign Wednesday in pivotal Pennsylvania for the second time this week, this time with a coalition of Republicans who are backing her over their party's nominee, Donald Trump.",
      "publishedAt": "2024-10-16T13:07:09Z",
      "title": "Harris returns to battleground Pennsylvania, with Republicans, as Trump pursues Latinos' votes",
      "url": "https://apnews.com/8975f37859dc16de3a7e8a99c5d07760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5841987ead2d4f808786686bd306a91b/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — If he wins next month's election, Donald Trump would be the oldest person in U.S. history to be elected president. Yet the 78-year-old Republican nominee refuses to disclose new details about his physical or mental well-being, breaking decades of precedent.",
      "publishedAt": "2024-10-16T16:30:31Z",
      "title": "Trump would be the oldest person to become president. He's not sharing health details",
      "url": "https://apnews.com/7bb8212c1024748371e43b85e137bae5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b81f3470f924a8bb57e633bab470c9c/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A judge has blocked a new rule that requires Georgia Election Day ballots to be counted by hand after the close of voting. The ruling came a day after the same judge ruled that county election officials must certify election results by the deadline set in law.",
      "publishedAt": "2024-10-15T14:00:11Z",
      "title": "Georgia judge blocks ballot counting rule and says county officials must certify election results",
      "url": "https://apnews.com/03f6bc623d9f6aeeb3f9dc47823d03f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b8b38df5b74c358a875bd159af0fad/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy told lawmakers Wednesday that Ukraine’s Western partners are increasing pressure to negotiate with Russia, but he hinted such talks would be unfavorable to Kyiv as he unveiled what he called his “victory plan” for the war.",
      "publishedAt": "2024-10-16T04:03:35Z",
      "title": "Zelenskyy outlines his 'victory plan' to Ukraine's lawmakers, including a call to join NATO",
      "url": "https://apnews.com/f3525550f6986f590777193a7385c0c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a79e2e83f454393aec9261d5e53d6d3/3000.jpeg"
    },
    {
      "author": "MARGERY A. BECK",
      "description": "OMAHA, Neb. (AP) — Nebraska’s top election official had no authority to strip voting rights from people convicted of a felony, the state Supreme Court ruled Wednesday in a decision that could add hundreds of new voters to the rolls and potentially help tip the balance on Nov.",
      "publishedAt": "2024-10-16T05:09:46Z",
      "title": "People with felony records can now vote in Nebraska — and it could help tip the balance in November",
      "url": "https://apnews.com/dfe043a32fb667b4461bf2f2ac4217fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f74ae0719b424e6081ff8ade7b607955/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — More than 140 people, including children, were killed in Nigeria when an overturned gasoline tanker truck exploded in flames while they tried to scoop up fuel, emergency services said Wednesday.",
      "publishedAt": "2024-10-16T09:21:36Z",
      "title": "More than 140 people are killed and dozens injured when a gas tanker explodes in Nigeria",
      "url": "https://apnews.com/7af046fdb8016e79d14744666013fbf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11c586d09a1a49779a37768023230ce0/2000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — A celestial object discovered decades ago is actually twins orbiting each other, a new study confirms.Scientists have puzzled over the object known as Gliese 229B, the first known brown dwarf discovered 30 years ago.",
      "publishedAt": "2024-10-16T15:02:44Z",
      "title": "A brown dwarf discovered 30 years ago is actually twins circling each other",
      "url": "https://apnews.com/614b24f9c9fa2e8c9c2f17158a8e817d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d046b8f8c894ba9a3e85f1e0a61f229/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}