{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Iran’s foreign minister again has referenced his country’s planned retaliation over the assassination of Hamas leader Ismail Haniyeh in Tehran.Abbas Araghchi said late Sunday he made the remark in a conversation with Italian Foreign Minister Antonio Tajani by telephone.",
      "publishedAt": "2024-08-26T03:24:13Z",
      "title": "Israel-Hamas war latest: Iran's foreign minister vows 'definitive' retaliation against Israel",
      "url": "https://apnews.com/9b67ccdeefdc81ea149fc3f9b56ba552",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a031ffb3b3ba4125984ff0fc2dcdff39/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — In Jerusalem’s Old City, nearly all souvenir shops are closed. In Haifa’s flea market, forlorn merchants polish their wares on empty streets. Airlines are canceling flights, businesses are failing and luxury hotels are half empty.",
      "publishedAt": "2024-08-26T04:46:19Z",
      "title": "Israel's economy is struggling. Economists say ending the war would help",
      "url": "https://apnews.com/f647a0436bae20dca2129e02814068a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c812c3ef43643e18c487de6abf780ba/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The ferocious exchange of fire by Hezbollah and the Israeli military is raising fears of a regional war beyond the tense border.",
      "publishedAt": "2024-08-26T05:08:13Z",
      "title": "Its economy and infrastructure battered, can Lebanon afford a war with Israel?",
      "url": "https://apnews.com/d5433642fcfce79facf8a1369b14d0f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02b7b380aca549f88ace037fa1a52984/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUETTA, Pakistan (AP) — Gunmen fatally shot 23 passengers after identifying them and taking them from buses, vehicles and trucks in one of the deadliest attacks in restive southwestern Pakistan, police and officials said Monday.",
      "publishedAt": "2024-08-26T05:05:19Z",
      "title": "Gunmen kill 23 passengers taken from vehicles in an attack in southwest Pakistan",
      "url": "https://apnews.com/5ad252efec8fe9818ee869b23e49477a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33c554ad5b4745afb5a7c59408270353/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "In a speech Monday to National Guard soldiers in Michigan, former President Donald Trump is expected to promote his foreign policy record and tie Vice President Kamala Harris to one of the Biden administration's lowest points: the chaotic withdrawal from Afghanistan after 20 years of war.",
      "publishedAt": "2024-08-26T04:03:50Z",
      "title": "Trump is expected to tie Harris to chaotic Afghanistan War withdrawal in speech to National Guard",
      "url": "https://apnews.com/46eb2b0861939bf022747920c0ee0234",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a3ec09184d74baba49c46c58ff33c53/2876.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A British safety adviser working with a team of Reuters journalists was killed when a Russian missile struck a hotel in the Ukrainian city of Kramatorsk, the news agency confirmed.",
      "publishedAt": "2024-08-25T10:22:01Z",
      "title": "Member of British journalist team dies after Russian missile hits hotel in eastern Ukraine",
      "url": "https://apnews.com/f7726e08a3da2eb2ac49b65d0e7d2014",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f83dde66f494c4bbdc9ff1cbabeb677/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and DAVID McHUGH",
      "description": "SOLINGEN, Germany (AP) — A Syrian man on Sunday was ordered held on suspicion of murder and membership in a terrorist organization in connection with the Solingen knife attack that left three dead and eight wounded at a festival marking the city’s 650th anniversary.",
      "publishedAt": "2024-08-25T06:33:11Z",
      "title": "The suspect in the Germany attack was motivated by Islamic State group ideology, prosecutors say",
      "url": "https://apnews.com/1095235a9dadf6e1005e8adff52d05b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1a308cc86b44ae3958acae757b10f20/1920.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "Brandi Brown has yet to find a Black church near her Southern California home that feels right for her. So when she wants to talk about God, she relies on someone over a thousand miles (1,600 kilometers) away.",
      "publishedAt": "2024-08-26T04:09:58Z",
      "title": "How women of color with Christian and progressive values are keeping the faith — outside churches",
      "url": "https://apnews.com/875f4d5b1534912403b20aabccbc43c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23edfdccfb474786bcca53103ef6a127/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and JULIE WALKER",
      "description": "HONOLULU (AP) — Hurricane Hone passed just south of Hawaii on Sunday, dumping so much rain that the National Weather Service called off its red flag warnings that strong winds could lead to wildfires on the drier sides of the islands.",
      "publishedAt": "2024-08-25T13:38:15Z",
      "title": "Hurricane Hone sweeps past Hawaii, dumping enough rain to ease wildfire fears",
      "url": "https://apnews.com/15b6b817303b4abbf23aeb83b71e1f8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77b0a380c7de4401a26584f0c52d495b/2135.jpeg"
    },
    {
      "author": "AMANDA VOGT",
      "description": "SOUTH WILLIAMSPORT, Pa. (AP) — Lathan Norton was sick and didn’t play on Saturday at the Little League World Series. But on Sunday he scored the winning run in the championship. Lathan raced home from second base on an overthrow at first as Lake Mary, Florida, rallied to beat Taiwan 2-1 in eight innings and claim the title.",
      "publishedAt": "2024-08-25T22:39:43Z",
      "title": "Lake Mary, Florida, rallies to beat Taiwan 2-1 in 8 innings to win Little League World Series title",
      "url": "https://apnews.com/92f30a548f7c39cd8f8fd32eea919de1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11e35f8babf1478c8e75c1502436b464/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}