{
  "articles": [
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Generations of Maryland workers — longshoremen, seafarers, steelworkers and crabbers whose livelihoods depend on Baltimore’s port — watched in disbelief this week as an iconic symbol of their maritime culture crumbled into the Patapsco River.",
      "publishedAt": "2024-03-31T04:03:25Z",
      "title": "In Key Bridge collapse, Baltimore lost a piece of its cultural identity",
      "url": "https://apnews.com/91c3bfe8c235eff0157808691259a514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36ecae7ebc0f43178c70c7ea40bc32e7/3000.jpeg"
    },
    {
      "author": "SERKAN GURBUZ and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — Teams of engineers worked Saturday on the intricate process of cutting and lifting the first section of twisted steel from the collapsed Francis Scott Key Bridge, which crumpled into the Patapsco River this week after a massive cargo ship crashed into one of its supports.",
      "publishedAt": "2024-03-30T04:04:36Z",
      "title": "Crews carefully start removing first piece of twisted steel from collapsed Baltimore bridge",
      "url": "https://apnews.com/3edebfb3b7fb48fd81be81cf69ebfbf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b0c6214077848bfb4d03acc578c00e8/1920.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — A three-ship convoy left a port in Cyprus on Saturday with 400 tons of food and other supplies for Gaza as concerns about hunger in the territory soar.",
      "publishedAt": "2024-03-30T08:00:49Z",
      "title": "Ships with a second round of aid for Gaza have departed Cyprus as concerns about hunger soar",
      "url": "https://apnews.com/c0ab29bb92b859e22c927ae82637192b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daf84253306b4d25b40c5017e0ffb03b/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Rallying from a winter-long bout of respiratory problems, Pope Francis led some 30,000 people in Easter celebrations Sunday, making a strong appeal for a cease-fire in Gaza and a prisoner swap between Russia and Ukraine.",
      "publishedAt": "2024-03-31T08:40:45Z",
      "title": "Pope overcomes health concerns to preside over a blustery Easter Sunday Mass in St. Peter's Square",
      "url": "https://apnews.com/a89541850baa416f69060ae8e699abac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f06ddaa33d5043d3a0db076fca5936fd/2000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — King Charles III joined the queen and other members of the royal family for an Easter service at Windsor Castle on Sunday, his most significant public outing since he was diagnosed with cancer last month.",
      "publishedAt": "2024-03-31T09:16:42Z",
      "title": "King Charles attends Easter service, providing a glimpse of the monarch after cancer diagnosis",
      "url": "https://apnews.com/b8f580bd6bdbc5c146dab2b279adab54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67d683d3c5aa448e97970f73e1de0036/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is facing criticism from Donald Trump's campaign and religious conservatives for proclaiming March 31 — which corresponds with Easter Sunday this year — as “Transgender Day of Visibility.”",
      "publishedAt": "2024-03-30T23:14:46Z",
      "title": "The Trump camp assails Biden for declaring March 31, Easter Sunday, as Transgender Day of Visibility",
      "url": "https://apnews.com/2acc05052d01272ed21ab83f32d99a77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fb890bf5551487e9e8a0e2965aeb575/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A Russian cruise missile strike on infrastructure in Ukraine’s western Lviv region killed one man, officials said Sunday.The attack destroyed a building and sparked a fire, Gov.",
      "publishedAt": "2024-03-31T09:49:25Z",
      "title": "1 dead as Russia launches attacks on Ukraine's energy infrastructure",
      "url": "https://apnews.com/de446fa5182eb4b1480783b402b01d9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c68a6b878a479daa69bad6141268f2/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA and GERALD IMRAY",
      "description": "MANGWE, Zimbabwe (AP) — Delicately and with intense concentration, Zanyiwe Ncube poured her small share of precious golden cooking oil into a plastic bottle at a food aid distribution site deep in rural Zimbabwe.",
      "publishedAt": "2024-03-31T05:21:32Z",
      "title": "Extreme drought in southern Africa leaves millions hungry",
      "url": "https://apnews.com/2ef702abc386f7182dbc5f8f4192be3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/856593e24c084a95b7a7ee11eecd06c6/3000.jpeg"
    },
    {
      "author": "SHARON LURYE",
      "description": "NEW ORLEANS (AP) — Ava Kreutziger was in high school English class last year when she heard about the passage of legislation that could affect LGBTQ+ students like her. She excused herself from class to go cry in the bathroom, and found two of her classmates already there in tears.",
      "publishedAt": "2024-03-31T04:06:12Z",
      "title": "First they tried protests of anti-gay bills. Then students put on a play at Louisiana’s Capitol",
      "url": "https://apnews.com/a30468fff90127c379eba7b8eccdaa56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3e03b87412f408584401c567a69c98c/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Every time Clemson tried to cut down its deficit, Alabama fired up a 3-pointer. Over and over and in such quick succession that the Crimson Tide looked like a video game.Mark Sears made seven 3-pointers and Alabama recovered from its early long-distance woes with 16 3s to beat Clemson 89-82 on Saturday night, sending the Tide to the Final Four for the first time.",
      "publishedAt": "2024-03-31T03:21:39Z",
      "title": "Alabama rides tidal wave of 3-pointers to beat Clemson 89-82 and reach 1st Final Four ever",
      "url": "https://apnews.com/fcaae242b363bb15fa8eb317b471a0c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ec2e933010c43bc93cb04795828e027/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}