{
  "articles": [
    {
      "author": "Rob Gillies",
      "description": "Canadians are set to decide whether to extend the Liberal Party’s decade in power or instead hand control to the Conservatives. They’ll pick either Prime Minister Mark Carney or opposition leader Pierre Poilievre to lead the way forward, but Monday's election is also a referendum of sorts on a non-Canadian: Donald Trump. Until the American president won a second term and began threatening Canada’s economy and sovereignty, even suggesting the country should become the 51st state, the Liberals looked headed for defeat. But Trump’s truculence has infuriated many Canadians and led to a tightening of the race. Whichever candidate becomes prime minister will face big challenges, including a trade war and resetting of Canada's relationship with the United States.",
      "publishedAt": "2025-04-28T04:19:36Z",
      "title": "Canadians are set to vote in an election dominated by Trump's trade war and bluster",
      "url": "https://apnews.com/article/canada-election-trump-carney-poilievre-861f5b00794355b231ee3f218568949b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d78b11/2147483647/strip/true/crop/6385x3592+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F00%2F485e78f2fab8ccbabe93a7fc54f5%2F8c154e3f704e4f94aefd20066808e277"
    },
    {
      "author": "Michelle L. Price, Chris Megerian",
      "description": "The White House is opening a weeklong celebration of President Donald Trump's first 100 days in office. Officials kicked off the promotional campaign on Monday with a focus on his immigration crackdown. Tom Homan, Trump's top border adviser, said “we're going to keep doing it, full speed ahead.” Trump is holding a rally in Michigan on Tuesday and delivering a commencement address at the University of Alabama on Thursday. Although immigration remains the Republican president's strongest issue in public opinion surveys, he's faced declining support overall. There are concerns that he's focused on the wrong issues, according to polling from AP-NORC.",
      "publishedAt": "2025-04-28T18:24:38Z",
      "title": "White House focuses on immigration as it marks first 100 days for Trump",
      "url": "https://apnews.com/article/donald-trump-100-days-border-interviews-5d6f98289bbd6a24e7ad193c9a513ee0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0cf7b19/2147483647/strip/true/crop/2494x1403+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F64%2F0b5c6973b018c8840843bf328551%2F5cb61fc4eb934cacbcb2fd688036d5c7"
    },
    {
      "author": "Jim Morris, Claire Rush, Rob Gillies",
      "description": "Murder charges have been filed against a suspect in a weekend car ramming attack that killed 11 people at a Filipino heritage festival in Vancouver. Hundreds attended vigils Sunday across the city for the victims and the Canadian prime minister visited the site on the eve of a federal election. Prosecutors have charged a 30-year-old man with eight counts of second degree murder and say more charges are possible. Investigators have ruled out terrorism and say he has a history of mental health issues. Those killed were between the ages of 5 and 65. Dozens were injured when a man driving an SUV struck people attending the Lapu Lapu Day festival on Saturday.",
      "publishedAt": "2025-04-28T04:07:41Z",
      "title": "Vancouver ramming attack suspect charged with murder as hundreds attend vigils for victims",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-4bf1d6ba8963af0ee4f17257674cda39",
      "urlToImage": "https://dims.apnews.com/dims4/default/e806f22/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fec%2F4d97e3efd17541432f517e07bc81%2F3d8a7608088b4f3898e677a5201259bc"
    },
    {
      "author": null,
      "description": "A suspect has been charged with multiple counts of murder and police are continuing their investigation after 11 people were killed when an SUV plowed through a crowd at a Filipino heritage festival in Vancouver over the weekend. Witnesses described narrowly jumping out of the way of the speeding vehicle as bodies flew through the air. Dozens of people were injured. Officials say the suspect is a 30-year-old Vancouver resident who had a history of mental health issues. Here's what you need to know about the attack.",
      "publishedAt": "2025-04-28T21:58:03Z",
      "title": "What to know about the car ramming attack at a Vancouver street festival",
      "url": "https://apnews.com/article/vancouver-canada-festival-deaths-what-to-know-67355e98cec3b16b86f1c153745708f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d7ace0/2147483647/strip/true/crop/8453x4755+0+440/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fde%2F0b0506ccbe42e442ee0fb6040d08%2Fe82a8588301347aa8dd3657bf81bfbb3"
    },
    {
      "author": null,
      "description": "Police say four people were killed when a car smashed through a building in Chatham, Illinois. Chatham Police Department's deputy chief says officers responded at about 3:20 p.m. to calls about a vehicle driving into a building during an after-school program. The vehicle hit three people outside the building, continued through the building and hit another person before exiting the other side. The driver, who was uninjured, was the sole occupant of the vehicle, and was taken to a hospital for evaluation. Chatham is a small town of about 15,000 people just outside Springfield, Illinois.",
      "publishedAt": "2025-04-28T23:55:31Z",
      "title": "Four people were killed when vehicle smashed through Illinois building, police say",
      "url": "https://apnews.com/article/chatham-illinois-after-school-car-crash-8e248afe17df21933e7760019561a076",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Marcia Dunn",
      "description": "Amazon's first internet satellites are on their way to orbit. United Launch Alliance's Atlas rocket blasted off Monday from Florida. It's carrying 27 of Amazon's Project Kuiper satellites. It's the latest entry in the mega constellation market currently dominated by SpaceX's Starlinks. Amazon launched two test satellites in 2023. These upgraded new ones are coated with mirror film to scatter reflecting sunlight in an attempt to accommodate astronomers. Stargazers oppose these fast-growing satellite constellations, saying it spoils their observations. Amazon aims to put more than 3,200 of these satellites into orbit to provide fast, affordable broadband service around the globe.",
      "publishedAt": "2025-04-28T23:02:41Z",
      "title": "Amazon launches its first internet satellites to compete against SpaceX's Starlinks",
      "url": "https://apnews.com/article/amazon-ula-project-kuiper-spacex-starlinks-1a1c53a6a44f3f9bd9426bb1f56405c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d45a75/2147483647/strip/true/crop/2234x1257+0+116/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F17%2Fdb8f4320a019a99d1c59e008bddd%2F154ac9f3486c4a0b8c78766f6101692a"
    },
    {
      "author": "David Rising, Valerie Komor",
      "description": "They’d watched overnight as the bombardments grew closer, and observed through binoculars as the final U.S. Marines piled into a helicopter from the roof of the embassy to be whisked away. So when they heard the telltale squeak of the rubber sandals worn by North Vietnamese and Viet Cong troops from the stairway outside The Associated Press office, the reporters who had stayed behind were not surprised, and braced themselves for possible detention or arrest. But the journalists just kept reporting, and the improbable meeting became part of their iconic reporting on the fall of Saigon, 50 years ago.",
      "publishedAt": "2025-04-29T01:04:09Z",
      "title": "As communist troops streamed into Saigon, a few remaining reporters kept photos and stories flowing",
      "url": "https://apnews.com/article/vietnam-war-anniversary-saigon-final-day-1996f738e1e4f8186897df54cb918491",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf8ff48/2147483647/strip/true/crop/2922x1644+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F67%2F61b2fe9f70d9fc672cfc5c2f0a32%2Ff5b0cf0ec9ef4485876aa66fc09e4117"
    },
    {
      "author": "Illia Novikov",
      "description": "The Kremlin has declared a 72-hour ceasefire in Ukraine next week as Russia marks Victory Day in World War II. Russian President Vladimir Putin has ordered the truce will run from the start of May 8 and last through the end of May 10 to mark Moscow’s defeat of Nazi Germany in 1945. Kyiv insisted on a longer and immediate truce. The move comes as U.S. President Donald Trump scaled up efforts to broker a peace deal in Ukraine. Until now, Putin had refused to accept a complete unconditional ceasefire, linking it to a halt in Western arms supplies to Ukraine and Kyiv’s mobilization effort.",
      "publishedAt": "2025-04-28T09:53:35Z",
      "title": "Russia declares a 72-hour ceasefire in Ukraine for next week to mark Victory Day in World War II",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-trump-844dc8747a63ef6921f0b1f0e3348ccd",
      "urlToImage": "https://dims.apnews.com/dims4/default/33920e1/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F13%2F2ecfaeea393986a29a68344ebb1e%2F1249dd5e1d18441b9fc19cdc815222ae"
    },
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "A conclave to elect a successor to Pope Francis will begin on Wednesday, May 7, the Vatican announced Monday. The date of the conclave was chief on the agenda of cardinals holding informal meetings to hash out church business following the April 21 death of Pope Francis. They held off on announcing the opening of the conclave until after his funeral on Saturday. The Vatican said more than 180 participated in the fifth informal meeting in Rome on Monday. A smaller group of 135, known as the College of Cardinals, is eligible to elect a new pope.",
      "publishedAt": "2025-04-28T09:43:23Z",
      "title": "Conclave to elect a new pope will start on May 7",
      "url": "https://apnews.com/article/vatican-pope-conclave-electors-17091445fa0670cb1bd741b3af31365e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c98c697/2147483647/strip/true/crop/5111x2875+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fcb%2F0e7e005e516bdf4634cf256e102a%2F5d90e88556a24ccca1848927418be00c"
    },
    {
      "author": "Natalie Melzer",
      "description": "The head of Israel’s internal security service says he will resign in June over the failure of his agency to warn of Hamas’ Oct. 7, 2023, attacks. It defuses an escalating battle with Prime Minister Benjamin Netanyahu. Shin Bet chief Ronen Bar said Monday he will formally step down June 15. Netanyahu moved to fire Bar last month over what he said was a crisis of confidence surrounding Hamas’ attacks. But it sparked an uproar because the agency is investigating ties between the Israeli leader’s office and Qatar — a key mediator between Hamas and Israel over the war in Gaza.",
      "publishedAt": "2025-04-28T18:24:04Z",
      "title": "Israel's domestic security chief says he will step down in June, defusing battle with Netanyahu",
      "url": "https://apnews.com/article/israel-shin-bet-security-ed3356cd209c32fd52769bd6b516a446",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9b4e1c/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F56%2F647de62b181a9347e0fffd257eb9%2F9a1590b5caa94c43ab05d98fe9184264"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}