{
  "articles": [
    {
      "author": "JULIA FRANKEL and NASSER NASSER",
      "description": "AL-FARAA REFUGEE CAMP, West Bank (AP) — Israel launched a large-scale military operation in the occupied West Bank on Wednesday, where its forces killed at least nine Palestinians and sealed off the volatile city of Jenin, according to Palestinian officials.",
      "publishedAt": "2024-08-28T06:03:07Z",
      "title": "Israel launches a large-scale military operation in the occupied West Bank, killing 9 Palestinians",
      "url": "https://apnews.com/41d98ed3cda2ba4a783913b06fbdc7d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90a2d799a59243efa018898127f12657/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "The latest flurry of Gaza cease-fire talks — the back-and-forth over now-familiar sticking points and appeals from around the world — obscures a grim truth about the monthslong efforts to end the Israel-Hamas war and free scores of hostages.",
      "publishedAt": "2024-08-28T04:05:52Z",
      "title": "Two sworn enemies hold the key to ending the war in Gaza. Does either man want a deal?",
      "url": "https://apnews.com/c00b30d31ac8d25592ce63c2398097a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9203c48a20f84a39b3ad37d17d563cef/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith filed a new indictment Tuesday against Donald Trump over his efforts to undo the 2020 presidential election that keeps the same criminal charges but narrows the allegations against him following a Supreme Court opinion that conferred broad immunity on former presidents.",
      "publishedAt": "2024-08-27T20:24:21Z",
      "title": "Feds file new indictment in Trump Jan. 6 case, keeping charges intact but narrowing allegations",
      "url": "https://apnews.com/186c874404912578e44d5781c8267e2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3aaf3aa525d249afa9df2802924727be/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — As Vice President Kamala Harris begins her fall campaign for the White House, she can look to history and hope for better luck than others in her position who have tried the same.",
      "publishedAt": "2024-08-28T04:04:18Z",
      "title": "Kamala Harris' election would defy history. Just 1 sitting VP has been elected president since 1836",
      "url": "https://apnews.com/defc726ac5a8db8ef0ba9a756fd8eec5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d443b214a11746beb474a9fdf6774195/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Ukraine's daring ground offensive has taken the fight to Russia, but not nearly as much as its leaders would like because, they say, the United States won’t let them.",
      "publishedAt": "2024-08-28T04:01:17Z",
      "title": "Ukraine's Russia offensive is risky. To get a boost, it wants less US caution on weapons",
      "url": "https://apnews.com/7e59c745b4bff79802454f0b660b0d0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8090a73dda944949bfc10112b0be7945/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — A Russian missile slammed into Ukrainian President Volodymyr Zelenskyy’s home city on Wednesday, local authorities said, just as Kryvyi Rih was observing an official day of mourning for an attack the previous day that killed four civilians at a hotel.",
      "publishedAt": "2024-08-28T10:00:36Z",
      "title": "A Russian missile strikes the Ukrainian president's home city as it mourns deaths in earlier attack",
      "url": "https://apnews.com/00f695dbd2bf21e149c908e6f5f21cbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/585a42ef1b3a4613adf5bc7ef4138219/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — French prosecutors are expected to charge or release the CEO of the popular messaging app Telegram, Pavel Durov, after his police custody order expires on Wednesday.",
      "publishedAt": "2024-08-28T09:29:38Z",
      "title": "French prosecutors set to charge or release Telegram CEO Pavel Durov as his custody order expires",
      "url": "https://apnews.com/6e213d227458f330ed16e7fe221a696c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecafb659b7f84f0fabd30e82e921dab1/1894.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — Nvidia has led the artificial intelligence boom to become one of the stock market’s biggest companies, as tech giants continue to spend heavily on the company's chips and data centers needed to train and operate their AI systems.",
      "publishedAt": "2024-08-28T04:01:56Z",
      "title": "All eyes are on Nvidia as it prepares to report its earnings. Here's what to expect",
      "url": "https://apnews.com/464d35670b6e91a698751ec7ee157532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0922d68c7e834993aa48728b1f60e96c/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI, DAVID RISING and NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — When the Vatican acknowledged in 2022 that the Nobel Peace Prize-winning, East Timorese independence hero Bishop Carlos Ximenes Belo had sexually abused young boys, it appeared that the global clergy sexual abuse scandal that has compromised the Catholic Church’s credibility around the world had finally arrived in Asia’s newest country.",
      "publishedAt": "2024-08-28T04:30:39Z",
      "title": "Church sex abuse scandals in East Timor met by silence, but Pope Francis’ visit brings new attention",
      "url": "https://apnews.com/403444937a155db9dafc947607183aee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50caab7ab96a403e9025cc49ec45bd55/3000.jpeg"
    },
    {
      "author": "JEROME PUGMIRE",
      "description": "PARIS (AP) — Just weeks after hosting the Olympics, the summer of sports in Paris begins its final chapter Wednesday with the opening ceremony of the Paralympic Games.",
      "publishedAt": "2024-08-28T09:15:27Z",
      "title": "Paris to inaugurate Paralympic Games with 'never seen before' opening ceremony in city's heart",
      "url": "https://apnews.com/8edcc0df006bf081074331943d5b947d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e658389ae8cf45c2a3139904e1eb56a4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}