{
  "articles": [
    {
      "author": "SAM MEDNICK, JOSEF FEDERMAN and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Hamas said Monday it accepted an Egyptian-Qatari cease-fire proposal, but Israel said the deal did not meet its core demands and it was pushing ahead with an assault on the southern Gaza city of Rafah.",
      "publishedAt": "2024-05-06T05:29:00Z",
      "title": "Hamas accepts Gaza cease-fire; Israel says it will continue talks but presses on with Rafah attacks",
      "url": "https://apnews.com/8659eae6e0a7362504f0aa4aa4be53e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fad33c20b6a4aad91dbfcd90b889227/3000.jpeg"
    },
    {
      "author": "KAREN MATTHEWS and STEVE LeBLANC",
      "description": "NEW YORK (AP) — A Monday deadline for pro-Palestinian protesters to leave an encampment at Massachusetts Institute of Technology cleared many demonstrators only to have the site retaken while protesters at the Rhode Island School of Design began occupying a building in the ongoing protest movement connected to the Israel-Hamas war.",
      "publishedAt": "2024-05-07T04:09:26Z",
      "title": "Pro-Palestinian protesters retake MIT encampment, occupy building at Rhode Island School of Design",
      "url": "https://apnews.com/9bb8051253c45947509feb32ced78f8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd55e209af1f4f8d800696e17031aeec/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — In April, Bernie Sanders repeatedly stood shoulder to shoulder with President Joe Biden, promoting their joint accomplishments on health care and climate at formal White House events while eviscerating Donald Trump in a widely viewed campaign TikTok video.",
      "publishedAt": "2024-05-07T04:06:24Z",
      "title": "Bernie Sanders says Gaza may be Joe Biden's Vietnam. But he's ready to battle for Biden over Trump",
      "url": "https://apnews.com/ea2720446481f1e77cd7b79b28ca4abe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ac6b7d593fa42be9be3f28f4542dc82/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump returns to his hush money trial Tuesday facing a threat of jail time for additional gag order violations as prosecutors gear up to summon big-name witnesses in the final weeks of the case.",
      "publishedAt": "2024-05-07T04:02:20Z",
      "title": "Trump faces jail threat over gag order as prosecutors zero in on transactions at heart of the case",
      "url": "https://apnews.com/d853768fff5fafbdee55623579889140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e521f5588134c9cbbccb63f1c6a329e/3000.jpeg"
    },
    {
      "author": "SIBI ARASU and KRUTIKA PATHI",
      "description": "CHENNAI, India (AP) — Prime Minister Narendra Modi has wielded near-total control over Indian politics since coming to power 10 years ago, with one exception: He has failed to win over the country’s wealthier southern region.",
      "publishedAt": "2024-05-07T04:05:45Z",
      "title": "Why voters in southern India are more resistant to Modi's Hindu-centric politics",
      "url": "https://apnews.com/cb283460d1066a0e874da7334ffd880e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10d8d325e1714be3af79605493897c0e/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Vladimir Putin begins his fifth term as Russian president in an opulent Kremlin inauguration Tuesday, after destroying his political opponents, launching a devastating war in Ukraine and consolidating all power in his hands.",
      "publishedAt": "2024-05-07T04:10:59Z",
      "title": "Putin is starting his 5th term as president, more in control of Russia than ever",
      "url": "https://apnews.com/355bd36a2e833800187af848dc24a7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/580004644feb4b0ebf562c6a7a72f240/3000.jpeg"
    },
    {
      "author": "JOVANA GEC and DUSAN STOJANOVIC",
      "description": "BELGRADE, Serbia (AP) — Chinese leader Xi Jinping's visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.",
      "publishedAt": "2024-05-07T04:28:22Z",
      "title": "China's Xi begins Serbia visit on the 25th anniversary of NATO's bombing of the Chinese Embassy",
      "url": "https://apnews.com/5b13db499f39721faf9c82b9f88f4dfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3f3a97a6c694595b5b0cd67a1f9388d/2644.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN, SEAN MURPHY and JIM SALTER",
      "description": "OKLAHOMA CITY (AP) — A tornado destroyed homes and toppled trees and power lines when it roared through a small Oklahoma town, one of several twisters that erupted in the central United States amid a series of powerful storms that forecasters warned could stretch into the early hours of Tuesday.",
      "publishedAt": "2024-05-07T04:34:39Z",
      "title": "Tornado causes extensive damage to small Oklahoma town as powerful storms hit central US",
      "url": "https://apnews.com/b8def43f7b0402d12911573ea5b4233b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a0dd0489fc44d7196eda1341ccd7bdb/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — The Federal Aviation Administration said Monday it has opened an investigation into Boeing after the beleaguered company reported that workers at a South Carolina plant falsified inspection records on certain 787 planes.",
      "publishedAt": "2024-05-06T23:36:05Z",
      "title": "The FAA investigates after Boeing says workers in South Carolina falsified 787 inspection records",
      "url": "https://apnews.com/4b6ac28d8ab0d7687112e2cbb7bf6e00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14658c731f3c49188a0af9d73df85da7/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — The Met Gala and its fashionista A-listers on Monday included Jennifer Lopez, Zendaya and a parade of others in a swirl of flora and fauna looks on a green-tinged carpet lined by live foliage.",
      "publishedAt": "2024-05-06T04:10:21Z",
      "title": "The Met Gala was in full bloom with Zendaya, Jennifer Lopez, Mindy Kaling among the standout stars",
      "url": "https://apnews.com/c157cb3c547e4784ee802d8f828548e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eab275970c14b3998ad619daa2bee96/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}