{
  "articles": [
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden’s decision to go back on his word and issue a categorical pardon for his son, Hunter, just weeks before his scheduled sentencing on gun and tax convictions was a surprise that wasn't all that surprising.",
      "publishedAt": "2024-12-02T14:17:13Z",
      "title": "Biden's broken promise on pardoning his son Hunter is raising new questions about his legacy",
      "url": "https://apnews.com/d5c8e7fbead7218c9b1e03a290945267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/418a2e5783b2409bb6cccb34dfdf16c1/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Already reeling from their November defeats, Democrats now are grappling with President Joe Biden’s pardoning of his son for federal crimes, with some calling the move misguided and unwise after the party spent years slamming Donald Trump as a threat to democracy who disregarded the law.",
      "publishedAt": "2024-12-02T16:55:29Z",
      "title": "Some Democrats are frustrated over Joe Biden reversing course and pardoning his son Hunter",
      "url": "https://apnews.com/267044df999f1944c05e0ed6c95957cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88ed9c48f94347cdb1371ed1d92349c5/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — President-elect Donald Trump is demanding the immediate release of Israeli hostages still being held in Gaza, saying that if they are not freed before he is sworn into office for a second term there will be “HELL TO PAY.\"",
      "publishedAt": "2024-12-02T19:25:42Z",
      "title": "Trump demands immediate release of Oct. 7 hostages, says otherwise there will be 'HELL TO PAY'",
      "url": "https://apnews.com/1aa9af22c070ab8ee0d8baf97bb05df8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e0e569c9bd4adab91f022e56758035/3000.jpeg"
    },
    {
      "author": "NATALIE MELTZER and SALLY ABOU ALJOUD",
      "description": "JERUSALEM (AP) — Israel unleashed its largest wave of airstrikes across Lebanon since agreeing to a ceasefire with Hezbollah last week, killing at least 11 people on Monday after the Lebanese militant group fired a volley of projectiles as a warning over what it said were Israeli truce violations.",
      "publishedAt": "2024-12-02T15:38:19Z",
      "title": "Israeli strikes kill 11 in Lebanon after fire exchanges with Hezbollah that test ceasefire’s limits",
      "url": "https://apnews.com/3f334fcb469ac465c7ae2df6922c2c17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3461fe51c4dd4610a2e7ae57efc9fdac/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Syria’s long civil war has reclaimed global attention after insurgents seized most of its largest city and dozens of nearby towns and villages.",
      "publishedAt": "2024-12-02T21:27:59Z",
      "title": "Key players in Syria's long-running civil war, reignited by a shock rebel offensive",
      "url": "https://apnews.com/65b2c2c864736327da1b7662a716768f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38f918b1dd914843a3ab93ada75040e7/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN and JAIMIE DING",
      "description": "LOS ANGELES (AP) — A Hawaii woman who vanished after landing in Los Angeles three weeks ago disappeared voluntarily as she sought to “step away from modern connectivity” and was last seen crossing into Mexico with her luggage, police said at a news conference where they urged her to contact her distraught family.",
      "publishedAt": "2024-12-03T02:04:17Z",
      "title": "Police say a Hawaii woman disappeared voluntarily and traveled to Mexico",
      "url": "https://apnews.com/237f5a7131079d4666aa5b0e77dd783e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2edb684a9bed449e91d4c39909c5b5d5/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "A woman who admitted to drinking and who was driving well over twice the speed limit when she smashed into a golf cart, killing a bride who had just got married at a South Carolina beach, was sentenced Monday to 25 years in prison.",
      "publishedAt": "2024-12-02T21:32:36Z",
      "title": "Woman driving drunk who killed bride still in her wedding dress sentenced to 25 years in prison",
      "url": "https://apnews.com/ed54e8a69fcc18d40718c5d60dfb914b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64b4406059a54a5c8f9460f87166d87e/1920.jpeg"
    },
    {
      "author": "RANDALL CHASE",
      "description": "DOVER, Del. (AP) — A Delaware judge has reaffirmed her ruling that Tesla must revoke Elon Musk’s multibillion-dollar pay packageChancellor Kathaleen St. Jude McCormick on Monday denied a request by attorneys for Musk and Tesla’s corporate directors to vacate her ruling earlier this year requiring the company to rescind the unprecedented pay package.",
      "publishedAt": "2024-12-02T22:40:17Z",
      "title": "Delaware judge reaffirms ruling that invalidated massive Tesla pay package for Elon Musk",
      "url": "https://apnews.com/86c5811b738e3a9df2b6e4adbcd055bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1e9f5628f2e48e299b51c99ce7dae09/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "When towns along the Great Lakes get buried in drifts of blowing snow, like several have over the past few days, weather experts start talking about the “lake effect.\"",
      "publishedAt": "2024-12-02T23:20:26Z",
      "title": "What is 'lake-effect snow'? Warm air from large bodies of water is the key ingredient",
      "url": "https://apnews.com/4585da95b681455af10d2fe7df7c678a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c064bc928931474a98025bf1c82dcc4f/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO and WYATTE GRANTHAM-PHILIPS",
      "description": "Consumers in the United States are scouring the internet for online deals as they look to take advantage of the post-Thanksgiving shopping marathon with Cyber Monday.",
      "publishedAt": "2024-12-02T10:27:41Z",
      "title": "Cyber Monday shoppers expected to set a record on the year's biggest day for online shopping",
      "url": "https://apnews.com/59d13c2e184cc10b17c3f0bdd7573323",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5b602c269fa439c9b64e12ac8c33548/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}