{
  "articles": [
    {
      "author": "SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — The U.S. Embassy in Kyiv said it would stay closed Wednesday after receiving a warning of a potentially significant Russian air attack on the Ukrainian capital.The precautionary step came after Russian officials promised a response to President Joe Biden’s decision to let Ukraine strike targets on Russian soil with U.S.-made missiles — a move that angered the Kremlin.",
      "publishedAt": "2024-11-20T08:27:34Z",
      "title": "US Embassy in Kyiv shuts due to Russian air attack threat after Biden policy shift",
      "url": "https://apnews.com/37982f529a53f8da6e551b4116879549",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5979593761d5496fabab9f28aceb8ede/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — There's a common trait that President-elect Donald Trump is clearly prizing as he selects those to serve in his new administration: experience on television. Trump loves that \"central casting\" look, as he likes to call it.",
      "publishedAt": "2024-11-20T05:02:38Z",
      "title": "Trump's casting call as he builds out his administration: TV experience preferred",
      "url": "https://apnews.com/1b9bc74e807f6a6b4b3b86028d967dbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07303ec99e7c4022b871af281c8bd385/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "WASHINGTON (AP) — Throughout his campaign, President-elect Donald Trump heaped scorn on the federal Department of Education, describing it as being infiltrated by “ radicals, zealots and Marxists.”",
      "publishedAt": "2024-11-20T05:08:10Z",
      "title": "Trump has called for dismantling the Education Department. Here's what that would mean",
      "url": "https://apnews.com/a49af0778fa7c50163619d1764f93c91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22e21bca7b9d4779998ecc9cfdc21201/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN and LISA BAUMANN",
      "description": "SEATTLE (AP) — A major storm swept across the northwest U.S. Tuesday evening, battering the region with strong winds and rain and causing widespread power outages and downed trees that killed at least one person.",
      "publishedAt": "2024-11-20T07:01:30Z",
      "title": "'Bomb cyclone' knocks out power to over 600,000 and downs trees across northwest US, killing 1",
      "url": "https://apnews.com/aadbd4863dd989189d31c1c2187b5025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acc424e59bb4426d8e36723355eb2650/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB, WAFAA SHURAFA and FATMA KHALED",
      "description": "BEIRUT (AP) — A United States envoy said an agreement to end the Israel-Hezbollah war is “within our grasp” after talks in Lebanon on Tuesday. However, there was no such optimism in the Gaza Strip, where the looting of nearly 100 aid trucks by armed men worsened an already severe food crisis.",
      "publishedAt": "2024-11-19T09:34:36Z",
      "title": "US envoy says Israel-Hezbollah truce is 'within our grasp' as Gaza food crisis worsens after looting",
      "url": "https://apnews.com/a76670f9373598edd964139280eba60c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d71d79a71ada4b1e98b078a285a1bac1/1920.jpeg"
    },
    {
      "author": "PETER PRENGAMAN",
      "description": "BAKU, Azerbaijan (AP) — Maxim Timchenko, CEO of DTEK, the largest private energy company in Ukraine, pulls out a piece of paper with bar charts showing how much new electricity his company has brought online this year in the country versus how much Russian bombs have destroyed.",
      "publishedAt": "2024-11-20T06:18:29Z",
      "title": "Ukraine has seen success in building clean energy, which is harder for Russia to destroy",
      "url": "https://apnews.com/1f226213742cc057f9f65208167e6f38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2d949fdc01246b182809b3526bc816a/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "COLUMBIA, S.C. (AP) — Susan Smith, the South Carolina mother convicted of killing her two sons by rolling her car into a lake in 1994 with the boys strapped in their seats inside, will ask a parole board for her freedom on Wednesday.",
      "publishedAt": "2024-11-20T05:02:59Z",
      "title": "Susan Smith to ask parole board for her freedom after serving 30 years for drowning her children",
      "url": "https://apnews.com/3c7c12e0cd0a23eee0e42a599b689597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f72728b974149308aa2f3971e40cf6f/2496.jpeg"
    },
    {
      "author": "ANDREW DeMILLO",
      "description": "Wednesday is Transgender Day of Remembrance, which focuses on trans people who have lost their lives because of violence. Here is what to know.What is Transgender Day of Remembrance?",
      "publishedAt": "2024-11-20T05:10:25Z",
      "title": "What to know about Transgender Day of Remembrance and violence against trans people",
      "url": "https://apnews.com/8160deb98febe780aa94577fd59a6758",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ba33f20cd504972babd380f17298538/2000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Three generations of TJ Rickard’s family lost their homes in the deadly Maui wildfire more than a year ago, and he and his extended family still have not rebuilt.",
      "publishedAt": "2024-11-20T05:06:30Z",
      "title": "Maui Invitational returns to a Lahaina still grappling with raw emotions left by deadly wildfire",
      "url": "https://apnews.com/0aa9dfe7a416e7eaf6bb40d266a2d0ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4023dba6bea14843be60bf960f9acf81/2000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "TORUN, Poland (AP) — The mother of late cinematographer Halyna Hutchins is boycotting the world premiere of “Rust” at a film festival in Poland on Wednesday, saying she views it as an attempt by Alec Baldwin to “unjustly profit” from her daughter’s death.",
      "publishedAt": "2024-11-20T07:49:51Z",
      "title": "Mother of cinematographer killed on set of Alec Baldwin film 'Rust' boycotts its world premiere",
      "url": "https://apnews.com/7479e578096359df46251c262e4f9d3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81bc665a1eea4e5fa4437760010da6b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}