{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — A longtime Mar-a-Lago staffer who spent years fetching luxury cars for wealthy club members is the latest person to be ensnared in former President Donald Trump 's ballooning legal troubles.",
      "publishedAt": "2023-08-01T04:01:39Z",
      "title": "Mar-a-Lago property manager is the latest in a line of Trump staffers ensnared in his legal turmoil",
      "url": "https://apnews.com/ef34c1f1c1c24cafbadea4aa7c5c11e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/238e088482644137bea3783d5e0eb39c/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — A skyscraper in central Moscow was struck in a drone attack for the second time in around 48 hours, damaging the building’s facade and further underscoring the Russian capital’s vulnerability.",
      "publishedAt": "2023-08-01T07:36:01Z",
      "title": "Russia accuses Ukraine of a drone attack on Moscow that hit a building already struck just days ago",
      "url": "https://apnews.com/0773a8607c3e3c25a47124f4ef4d7b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb7f00d44c4d4849b74ef525afb41036/3000.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "AUCKLAND, New Zealand (AP) — A goal post saved the United States from elimination at the Women's World Cup. Ana Capeta nearly scored for Portugal in stoppage time but her shot hit the left post and the United States escaped with a uninspiring 0-0 draw Tuesday night that got them through — just barely — to the knockout round.",
      "publishedAt": "2023-08-01T09:01:58Z",
      "title": "Shaky Americans avoid upset to reach Women's World Cup knockout round after 0-0 draw with Portugal",
      "url": "https://apnews.com/9ab96954dd053ec7b91fc9aa45868cd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24a359dad2cc4f9398915d999b02ab03/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "Spend enough time with ChatGPT and other artificial intelligence chatbots and it doesn't take long for them to spout falsehoods.",
      "publishedAt": "2023-08-01T08:56:29Z",
      "title": "Chatbots sometimes make things up. Not everyone thinks AI's hallucination problem is fixable",
      "url": "https://apnews.com/ac4672c5b06e6f91050aa46ee731bcf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/782391250f5244beb50da79c07cda4df/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Days of unusually heavy rains around China's capital, Beijing, have flooded houses, torn apart roads and left at least 20 people dead and 27 missing, state media reported Tuesday.The flooding prompted authorities to close train stations and evacuate people in vulnerable areas to school gyms.",
      "publishedAt": "2023-08-01T04:35:07Z",
      "title": "At least 20 dead and 27 missing in floods surrounding China's capital Beijing, thousands evacuated",
      "url": "https://apnews.com/283180dc23fe5379381318617716db31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9420f71cafe5481593f4291f85989e73/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — France prepared to evacuate French and other European nationals from Niger on Tuesday, telling them to carry no more than a small bag, after a military coup there won backing from three other West African nations ruled by mutinous soldiers.",
      "publishedAt": "2023-08-01T05:01:21Z",
      "title": "Niger crisis deepens as France plans evacuation and coup leaders get support from neighboring juntas",
      "url": "https://apnews.com/0b951ec77a89033c84e6f0972cc21b5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9673996643ea4278b5258b5c621c4a93/3000.jpeg"
    },
    {
      "author": "EVENS SANON and MICHAEL CASEY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The fate of an American nurse and her daughter kidnapped in Haiti last week remains unknown Tuesday as the U.S. State Department refused to say whether the abductors made demands.",
      "publishedAt": "2023-08-01T04:21:00Z",
      "title": "The fate of the American nurse and her daughter kidnapped by armed men in Haiti remains uncertain",
      "url": "https://apnews.com/88df4a0a616599747b7e1728669b1f47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b60aff0476c649aeb1b87519e4050d09/1920.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "With pageantry that included balloons, a banner and an outdoor signing ceremony, Texas A&amp;M University celebrated a diverse new chapter in its history with its June hiring of Kathleen McElroy.",
      "publishedAt": "2023-08-01T05:09:44Z",
      "title": "Does Texas A&M’s botched hire spell doom for classroom diversity? Some say yes",
      "url": "https://apnews.com/5ba0f54b0aadb7030c745c43fb560995",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2c9d568ec3949d0aea894fff87134e6/2000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — Jan Pappas and Ronald Yasuda hired a contractor to fasten the roof of their 1960s-era home to their walls with metal plates and nails so high winds of a potential hurricane wouldn't blow it away.",
      "publishedAt": "2023-08-01T04:09:51Z",
      "title": "Hawaii could see a big hurricane season, but most homes aren't ready",
      "url": "https://apnews.com/6b774a3788bd18096a8e26cfcc72b86f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/851f739ef7cb412387a80ab0912f9d0e/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Its balmy beaches have been vacation spots for Russian czars and Soviet general secretaries. It has hosted history-shaking meetings of world leaders and boasts a strategic naval base.",
      "publishedAt": "2023-08-01T05:06:36Z",
      "title": "The Crimean Peninsula is both a playground and a battleground, coveted by Ukraine and Russia",
      "url": "https://apnews.com/dff3484da824e11afc92c83ecf19f71b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46ac0fb373064701aefb70a8b01e7b3d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}