{
  "articles": [
    {
      "author": "JULIA FRANKEL, PAUL HAVEN and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israel's defense minister said Thursday it will take months to destroy Hamas, predicting a drawn-out war even as his country and its top ally, the United States, face increasing international isolation and alarm over the devastation from the campaign in Gaza.",
      "publishedAt": "2023-12-14T08:19:51Z",
      "title": "Israeli defense minister says war on Hamas will last months as US envoy discusses timetable",
      "url": "https://apnews.com/a9d904ed51ea5cfa98966c8f203cbc45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bec3f2d638cf4780a2bd3d421d491519/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military has rounded up hundreds of Palestinians across the northern Gaza Strip, separating families and forcing men to strip to their underwear before trucking some to a detention camp on the beach, where they spent hours, in some cases days, subjected to hunger and cold, according to human rights activists, distraught relatives and released detainees themselves.",
      "publishedAt": "2023-12-14T18:14:48Z",
      "title": "Hungry, thirsty and humiliated: Israel's mass arrest campaign sows fear in northern Gaza",
      "url": "https://apnews.com/0ecbc338e4024add059b87b38022086d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/465198a973014859b6afee8ace2c01ff/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump's 2020 election interference case in Washington once appeared likely to be the first of the former president's criminal trials to begin, with the judge having scheduled a March 4 start date.",
      "publishedAt": "2023-12-14T16:30:59Z",
      "title": "Trump's first criminal trial is scheduled to begin in March but legal appeals threaten that date",
      "url": "https://apnews.com/83981412e8dc844e58390155aadc5cc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ebb0d04064e43649fe9fe273f8b6d50/1920.jpeg"
    },
    {
      "author": "HARRIET MORRIS",
      "description": "MOSCOW (AP) — Emboldened by battlefield gains and flagging Western support for Ukraine, a relaxed and confident President Vladimir Putin said Thursday there would be no peace until Russia achieves its goals, which he says remain unchanged after nearly two years of fighting.",
      "publishedAt": "2023-12-14T07:13:37Z",
      "title": "An emboldened, confident Putin says there will be no peace in Ukraine until Russia's goals are met",
      "url": "https://apnews.com/ef4e88fda50e6ad75b8a1979b95d9fcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27f29b93d7074a67978967169e633dc1/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House passed a defense policy bill Thursday that authorizes the biggest pay raise for troops in more than two decades, overcoming objections from some conservatives concerned the measure did not do enough to restrict the Pentagon's diversity initiatives, abortion travel policy and gender-affirming health care for transgender service members.",
      "publishedAt": "2023-12-14T18:21:11Z",
      "title": "Big pay raise for troops in defense bill sent to Biden. Conservatives stymied on cultural issues",
      "url": "https://apnews.com/7e91060fff447f2a79b602e312f1c2cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89abdf499e6a40d684e994feb8a522bf/3000.jpeg"
    },
    {
      "author": "RAF CASERT and SAMUEL PETREQUIN",
      "description": "BRUSSELS (AP) — The European Union decided Thursday to open accession negotiations with Ukraine, a momentous moment and stunning reversal for a country at war that had struggled to find the backing for its membership aspirations and long faced obstinate opposition from Hungarian Prime Minister Viktor Orban.",
      "publishedAt": "2023-12-14T08:00:37Z",
      "title": "Against the odds, European Union agrees to open membership negotiations with Ukraine",
      "url": "https://apnews.com/6a3a5828483121f19193f76b373ca692",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e38357f945d7438c9257a202eaf10988/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Jurors will begin deliberating on Thursday to decide how much Rudy Giuliani must pay two former Georgia election workers for spreading lies about them that led to a barrage of racist threats and upended their lives.",
      "publishedAt": "2023-12-14T17:17:13Z",
      "title": "Jurors will begin deciding how much Giuliani must pay for lies in a Georgia election workers' case",
      "url": "https://apnews.com/069f1b5ce3c743ef8c0891dde0b660b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc74fe339b994fc7b286ae0d9a6883d1/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A New York appeals court has again upheld a gag order that bars Donald Trump from commenting about court personnel in his civil fraud trial, ruling Thursday that the former president’s lawyers used the wrong legal mechanism to fight the restriction.",
      "publishedAt": "2023-12-14T17:05:26Z",
      "title": "Appeals court again upholds gag order barring Donald Trump from commenting about judge’s staff",
      "url": "https://apnews.com/911addba1400627c13830c0207e6d2f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6340655470054c9d8c6ecad191762d79/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "Gautam Dongre’s two children in India and Pascazia Mazeze’s son in Tanzania live with an inherited blood disorder that turns blood cells into instruments of pain.Now that new gene therapies promise a cure for their sickle cell disease, Dongre says he's \"praying the treatment should come to us.”",
      "publishedAt": "2023-12-14T15:53:00Z",
      "title": "Promising new gene therapies for sickle cell are out of reach in countries where they're needed most",
      "url": "https://apnews.com/0a76d10be53462d57e9d3cc07d15fc02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75997e2163240f5a93a0650fa04fdf0/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — The Los Angeles Dodgers are ready to welcome Shohei Ohtani to Hollywood.The biggest superstar in baseball will be formally introduced by the team at a news conference Thursday.",
      "publishedAt": "2023-12-14T14:41:08Z",
      "title": "The Dodgers are ready to welcome Shohei Ohtani to Hollywood",
      "url": "https://apnews.com/6cc91eb10170fcda38b4db7da0bee4fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7b2bdcfd5b34b0da7d84dce59adbcd4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}