{
  "articles": [
    {
      "author": "BASSEM MROUE, KAREEM CHEHAYEB and TIA GOLDENBERG",
      "description": "TYRE, Lebanon (AP) — A ceasefire between Israel and the Lebanese militant group Hezbollah that began Wednesday appeared to be holding, as residents in cars heaped with belongings streamed back toward southern Lebanon despite warnings from Israeli and Lebanese troops that they stay away from certain areas.",
      "publishedAt": "2024-11-27T07:44:05Z",
      "title": "Israel-Hezbollah ceasefire appears to hold as Lebanese stream south to their homes",
      "url": "https://apnews.com/f2c5ad31f5519f8dd368504e6634cd2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c98e3afa788c4dfe8dcd6d79cb22c5a4/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — For many across the Middle East, the Israel-Hezbollah ceasefire came as a relief: the first major sign of progress in the region since war began more than a year ago.",
      "publishedAt": "2024-11-27T14:20:29Z",
      "title": "The Israel-Hezbollah ceasefire quiets one front but Gaza sees no end to war",
      "url": "https://apnews.com/1a091e620e72c0fe341ff9e866237c08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3c8be1b42804ec18b4f1f49adeb561c/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — In a Monday evening announcement, President-elect Donald Trump railed against Mexico and Canada, accusing them of allowing thousands of people to enter the U.S.Hitting a familiar theme from the campaign trail and his first term in office, Trump portrayed the country's borders as insecure and immigrants as contributing to crime and the fentanyl crisis.",
      "publishedAt": "2024-11-26T22:20:11Z",
      "title": "Trump vows tariffs over immigration. What the numbers say about border crossings, drugs and crime",
      "url": "https://apnews.com/1528ef9c04f786478184a279ad26abb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2696e379122d4b2a890ac639d3180ac6/1920.jpeg"
    },
    {
      "author": "GIOVANNA DELL'ORTO",
      "description": "DANIA BEACH, Florida (AP) — As immigration remains a hotly contested priority for the Trump administration after playing a decisive role in the deeply polarized election, the Border Patrol agents tasked with enforcing many of its laws are wrestling with growing challenges on and off the job.",
      "publishedAt": "2024-11-27T13:01:21Z",
      "title": "Border Patrol trains more chaplains as the job and polarizing immigration debate rattle agents",
      "url": "https://apnews.com/4c30a12046422d46666fed7ace413415",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0597b27d569240b5bfa9b3bad7b00d14/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, AAMER MADHANI and MATTHEW LEE",
      "description": "WASHINGTON (AP) — Three American citizens imprisoned for years by China have been released and are returning to the United States, the White House said Wednesday, announcing a diplomatic agreement with Beijing in the final months of the Biden administration.",
      "publishedAt": "2024-11-27T14:07:12Z",
      "title": "3 Americans held for years in China have been released, the White House says",
      "url": "https://apnews.com/365258f044ec5a650aaeccf33d817d64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2845c59db1214c21a1e1a10ab5fe9b91/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Consumer price increases accelerated last month, the latest sign that inflation's steady decline over the past two years has stalled in recent months. According to the Federal Reserve's preferred inflation gauge, consumer prices rose 2.3% in October from a year earlier, the Commerce Department said Wednesday.",
      "publishedAt": "2024-11-27T15:11:55Z",
      "title": "US consumer price increases accelerated last month with inflation pressures resilient",
      "url": "https://apnews.com/3f7af74b5e5f814593999f3786dae949",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/809f537900e54f509eab3179b4681b09/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and GEOFF MULVIHILL",
      "description": "COLUMBUS, Ohio (AP) — Transgender students from kindergarten through college at Ohio public and private schools will be banned from using multiperson bathrooms that fit their gender identities under a measure that Republican Gov.",
      "publishedAt": "2024-11-27T14:54:03Z",
      "title": "Ohio governor signs bill limiting bathroom use by transgender students",
      "url": "https://apnews.com/3fe7c4d9178c17c97a64103d79668df0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78d532cd188840778cd4b73b2cb82af3/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Using fossilized feces and vomit samples from Poland, scientists have reconstructed how dinosaurs came to dominate the Earth millions of years ago.",
      "publishedAt": "2024-11-27T16:03:31Z",
      "title": "Fossilized dinosaur feces and vomit help scientists reconstruct the creatures' rise",
      "url": "https://apnews.com/af3f94e214caab3de055e8312627132a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f38bdaa6378a41a1a70f2d041f21ec7d/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — For half a century, New York City residents have taken out their trash by flinging plastic bags stuffed with stinking garbage straight onto the sidewalk.When the bags inevitably leak or break open, they spill litter into the street, providing smorgasbords for rats.",
      "publishedAt": "2024-11-27T05:04:43Z",
      "title": "New York City generates 44 million pounds of garbage a day. The city has a plan to contain the mess",
      "url": "https://apnews.com/694694360479c6c31a75d55b4c784755",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/523de7e9ee9e40109d050fd9685be4fb/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — The biggest November snowstorm to hit South Korea’s capital in more than a half century blanketed the capital on Wednesday, grounding hundreds of flights, disrupting commuter traffic and leaving at least two dead.",
      "publishedAt": "2024-11-27T05:38:55Z",
      "title": "Biggest November snowstorm in half century hits Seoul and grounds flights",
      "url": "https://apnews.com/235283f04bc17a171e94b476e82ffd8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c3528cd4264daea4872818b63c5019/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}