{
  "articles": [
    {
      "author": "Associated Press",
      "description": "Former President Joe Biden's office says he has been diagnosed with prostate cancer. Biden was seen last week by doctors after urinary symptoms and a prostate nodule was found. He was diagnosed with prostate cancer on Friday, with the cancer cells having spread to the bone. His office said Sunday this represents a more aggressive form of the disease, but the cancer appears to be hormone-sensitive, which allows for effective management. Biden and his family are reviewing treatment options with his physicians.",
      "publishedAt": "2025-05-18T20:13:09Z",
      "title": "Biden has been diagnosed with prostate cancer",
      "url": "https://apnews.com/article/biden-cancer-prostate-be18c98abe341cd91277e1d3b75d5cd5",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ef1f41/2147483647/strip/true/crop/4828x2716+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F10%2Fb1239df1b48274b584129c03d869%2F5c1ed08747fe4151b02fe7c14ad07f7b"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu has acknowledged that his decision to resume aid to Gaza came from pressure from allies. In a video statement posted to social media, Netanyahu said on Monday that Israel’s allies had voiced concern about “images of hunger” and said they told the country that “with that, we will not be able to support you.” Netanyahu said the aid that would be let in would be “minimal,” without specifying precisely when it would resume. Israel on Sunday said it would resume aid deliveries into the war-battered territory after a complete halt on imports since early March.",
      "publishedAt": "2025-05-19T08:27:01Z",
      "title": "Netanyahu acknowledges pressure from allies to resume Gaza aid",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-05-19-2025-da619d393510e0dde9650adbd39cbf0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e14c831/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fc4%2Fd4e40bf6e70610e4055ca4ccacb4%2F6915a89551fa46caa34c99883d439425"
    },
    {
      "author": "Nicole Winfield, Jacquelyn Martin",
      "description": "Pope Leo XIV and U.S. Vice President JD Vance are meeting ahead of a flurry of U.S.-led diplomatic efforts to make progress on a ceasefire in Ukraine. Vance’s motorcade was seen entering Vatican City just after 7:30 a.m. Monday. Vance is a Catholic convert who had led the U.S. delegation to the formal Mass opening the pontificate of the first American pope. The Vatican has been largely sidelined during the first three years of Russia’s war and is offering to host any peace talks while continuing humanitarian efforts to facilitate prisoner swaps and reunite Ukrainian children taken by Russia.",
      "publishedAt": "2025-05-19T06:45:40Z",
      "title": "Pope Leo XIV and JD Vance meet ahead of US-led diplomatic flurry to reach ceasefire in Ukraine",
      "url": "https://apnews.com/article/pope-vance-leo-vatican-ukraine-russia-trump-c1572b31e231e4eee61baaaad5c1445f",
      "urlToImage": "https://dims.apnews.com/dims4/default/599ee58/2147483647/strip/true/crop/7558x4251+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fde%2Feb16637a2532832110f4eed63a9c%2Ff0b047ac3e6a4791a8bc98a977383708"
    },
    {
      "author": "Sarah El Deeb",
      "description": "Humanitarian workers in Gaza have overflowed with anger, frustration and horror as Israel’s blockade pushed the territory into famine. The Associated Press spoke with more than a dozen aid workers. Some have years of experience in international emergencies. They say Gaza’s catastrophe is among the worst they have ever seen. They say it's more painful because it’s man-made. Israel late Sunday said it would allow a “basic” amount of food, saying it didn't want a hunger crisis to jeopardize its new military offensive. Aid workers also are worried by Israel's moves to impose a new aid system in Gaza. They say it won't work and allows Israel to use aid as a weapon.",
      "publishedAt": "2025-05-19T05:43:44Z",
      "title": "Aid workers feel helpless as Israel's blockade pushes Gaza towards famine",
      "url": "https://apnews.com/article/gaza-israel-palestinians-war-aid-blockade-12e18ac4b6d9fbdd1f058c7fcec4c97c",
      "urlToImage": "https://dims.apnews.com/dims4/default/fedbce1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fb8%2F9f0e8a8b4c501e57b047a5ae1793%2F215e1d6d22744c9bba9d2de2f3eee198"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump is hoping separate phone calls with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelenskyy will make progress toward a ceasefire in the war in Ukraine. Trump expressed his hopes for a “productive day” Monday — and a ceasefire — in a social media post over the weekend. His effort will also include calls to NATO leaders. Trump has struggled to end a war that began with Russia’s invasion in 2022. That makes these conversations a serious test of his reputation as a dealmaker after having claimed he'd quickly settle the conflict once he was back in the White House, or even before he took office.",
      "publishedAt": "2025-05-19T04:01:42Z",
      "title": "Trump hopes for ceasefire progress in calls with Putin and Zelenskyy",
      "url": "https://apnews.com/article/trump-putin-zelenskyy-russia-ukraine-war-ceasefire-3ec4144fecac5d77c8bb33cc4d7018ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/03cc8c5/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Ff2%2F552e60b4fad1a60f7b08d5232f62%2F8da03f70b5d7436fb54b1f0c251cc099"
    },
    {
      "author": "The Associated Press",
      "description": "The Russian authorities on Monday outlawed Amnesty International as an “undesirable organization,” a label that under a 2015 law makes involvement with such organizations a criminal offense. The decision by the Russian Prosecutor General’s office, announced on Monday in an online statement, is the latest in the unrelenting crackdown on Kremlin critics, journalists and activists that intensified to unprecedented levels after Moscow invaded Ukraine in February 2022. The designation means the international human rights group must stop any work in Russia and it subjects those who cooperate with it or support it to prosecution.",
      "publishedAt": "2025-05-19T10:24:08Z",
      "title": "Russia outlaws Amnesty International in latest crackdown on dissent and activists",
      "url": "https://apnews.com/article/russia-amnesty-international-3e6c3d50042b2b27cdd5f20eebafe70c",
      "urlToImage": "https://dims.apnews.com/dims4/default/357923c/2147483647/strip/true/crop/3829x2154+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F4a%2Fd2860d48ab1bec2203c90f035557%2F99276c08ef6f477c895a4dba540499e6"
    },
    {
      "author": "Peter Smith",
      "description": "President Donald Trump's establishment of a White House Faith Office, a Task Force to Eradicate Anti-Christian Bias and a Religious Liberty Commission has raised cheers from his base of conservative Christian supporters. But others, including some Christians, are alarmed by Trump's actions. They say Trump isn’t protecting “religion” in general but granting a privileged status to politically conservative expressions of Christianity. The three entities created under Trump overlap in their marching orders, and in some cases their membership. The White House says it will defend people of any faith. The groups are led by evangelist Paula White-Cain, Texas Lt. Gov. Dan Patrick and Attorney General Pam Bondi.",
      "publishedAt": "2025-05-19T10:56:37Z",
      "title": "Critics say Trump's religion agenda will most benefit conservative Christians",
      "url": "https://apnews.com/article/trump-faith-agenda-evangelicals-conservative-christians-88a9ce8ac81a46fafb7e337366be8e9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba46e71/2147483647/strip/true/crop/5509x3099+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fba%2Fc1ccb608b908fce13fafcf649689%2Fa36c785f7f30417e86d97ecbf6bf6658"
    },
    {
      "author": "Kevin Freking, Lisa Mascaro",
      "description": "Republicans are looking to get their massive tax cut and border security package back on track. The House Budget Committee will hold a rare Sunday night committee meeting after that same panel voted against advancing the measure two days earlier. Speaker Mike Johnson is looking to reverse that setback, get the bill out of the committee and bring it to a vote in the full House before the end of the week. Deficit hawks joined with Democratic lawmakers on the budget panel in voting against reporting the measure to the full House. Five Republicans voted no, one on procedural grounds, the other four voicing concerns about the bill’s impact on federal budget deficits.",
      "publishedAt": "2025-05-18T18:23:43Z",
      "title": "Republicans look to get Trump's bill back on track with rare Sunday session",
      "url": "https://apnews.com/article/republicans-tax-cuts-house-trump-johnson-border-f03b7e9cc3015ef9a0ece37b76bc5f66",
      "urlToImage": "https://dims.apnews.com/dims4/default/7203264/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F8e%2F475cf6e86656faf089cb87250ff3%2F7d9f218510ba44b19f9e37a67a539690"
    },
    {
      "author": "Pan Pylas, Jill Lawless",
      "description": "The U.K. and the European Union are meeting in London to discuss closer ties in their first official summit since Brexit. The meeting on Monday between U.K. Prime Minister Keir Starmer and top EU officials is intended to pave the way to a new agreement between the two sides. There is hope a deal could improve the U.K. economy that has been hit by a drop in EU trade caused by increased costs and red tape after leaving the bloc in early 2020. Starmer has sought to reset EU relations after the U.K.’s Brexit vote in 2016.",
      "publishedAt": "2025-05-19T04:16:42Z",
      "title": "UK looks to reset EU relations 5 years after Brexit",
      "url": "https://apnews.com/article/uk-eu-summit-brexit-trade-3181228316c3d0cd736ecbf93a1eff43",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc7fc66/2147483647/strip/true/crop/5213x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F41%2F6effed9e7f10f695e605f5f80bbd%2F7be7d0e1be744b06a61e977cbb881137"
    },
    {
      "author": "Bruce Shipkowski, Christopher Weber",
      "description": "New Jersey Transit’s train engineers have reached a tentative deal to end their three-day strike that had halted service for some 100,000 daily riders, including routes to Newark airport and across the Hudson River to New York City. The transit system and the union confirmed a deal was reached Sunday and that trains would resume their regular schedules Tuesday at 12:01 a.m. A wage increase for engineers was the main sticking point in the state’s first transit strike in over 40 years. New Jersey Gov. Phil Murphy called the deal “a very good outcome” at a news conference Sunday. He urged people to work from home Monday while the system gears up to resume regular service.",
      "publishedAt": "2025-05-18T23:01:55Z",
      "title": "New Jersey Transit train engineers reach tentative deal to end strike that halted NYC routes",
      "url": "https://apnews.com/article/new-jersey-transit-strike-train-engineers-ce62c978e268893bd15357daea5c5d47",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca6ce4a/2147483647/strip/true/crop/3409x1918+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F8e%2F032eeae45c17ffea41487dd0f24c%2F551c9be7c47140bc9e9b9248091053e4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}