{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The White House is claiming victory in a showdown with Colombia over accepting flights of deported migrants from the U.S. on Sunday, hours after President Donald Trump threatened steep tariffs on imports and other sanctions on the longtime U.S. partner.",
      "publishedAt": "2025-01-27T07:49:00Z",
      "title": "Live updates: White House claims victory in a showdown with Colombia over taking deported migrants",
      "url": "https://apnews.com/live/trump-presidency-day-8-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/60b2d83/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F77%2F5fa44d084b49b5ab15400be48444%2Fcolombiaminsite.jpg"
    },
    {
      "author": "JIM MORRIS",
      "description": "Chrystia Freeland, the former finance minister who is running to replace Justin Trudeau as Canada's prime minister, says her country needs to release a “retaliation list” of goods the country would target if U.S. President Donald Trump makes good on his threat to slap 25% tariffs on Canadian goods. A list of products worth $200 billion Canadian dollars would send a message to U.S. exporters about the harm tariffs would cause them, Freeland said Monday in a statement. “Our counterpunch must be dollar-for-dollar — and it must be precisely and painfully targeted: Florida orange growers, Wisconsin dairy farmers, Michigan dishwasher manufacturers, and much more.”",
      "publishedAt": "2025-01-27T21:46:04Z",
      "title": "Canada's PM hopeful lays out plan to fight Trump's tariff threats 'where it hurts'",
      "url": "https://apnews.com/article/canada-us-tariffs-chrystia-freeland-d06de336a9ba641779f95cf0614ead20",
      "urlToImage": "https://dims.apnews.com/dims4/default/339b969/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F94%2F36d93f1103346cc1f46e18cf8e77%2F659bced1e9e749aba69f2cc293a57a7e"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "President Donald Trump is on a mission to celebrate American greatness. He jumpstarted the effort hours after taking office, ordering the name of North America’s tallest peak to be changed from Denali back to Mount McKinley in honor of the nation's 25th president, William McKinley. In the same executive order, he has called on the U.S. Interior Department to work with Alaska Natives and others to adopt names for other landmarks that would honor their history and culture. Some of this work will involve the U.S. Board on Geographic Names. The little known panel of federal experts has been around for nearly 135 years.",
      "publishedAt": "2025-01-27T05:02:39Z",
      "title": "Trump's celebration of American greatness puts a spotlight on a little-known panel of experts",
      "url": "https://apnews.com/article/trump-landmarks-denali-board-on-geographic-names-fa89ca138751cc709a7b18ddef639136",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5f43da/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fa0%2F775674e3c70dbaa4585bfdafd00f%2F09b1cc781c7c4105ac6b41c17d1b441d"
    },
    {
      "author": "MIKE STOBBE",
      "description": "U.S. public health officials have been told to stop working with the World Health Organization, effective immediately. The surprise decision is focused on the U.S. Centers for Disease Control and Prevention. A CDC official sent a memo to senior leaders at the agency on Sunday night telling them that all agency staff who work with the WHO must immediately stop their collaborations and “await further guidance.” The Associated Press viewed the memo. Experts say the sudden stoppage is a surprise and will set back work on investigating and trying to stop outbreaks of Marburg virus and mpox in Africa.",
      "publishedAt": "2025-01-27T20:19:49Z",
      "title": "CDC ordered to stop working with WHO immediately",
      "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/9dad1fe/2147483647/strip/true/crop/5675x3192+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F24%2Ff56808076479c3aa06a201c8a111%2F18b3a9dc49d8448a9133e0f0b7b170fb"
    },
    {
      "author": "OSAMA SALEH, ABDEL-KAREEM HANA, SAMY MAGDY",
      "description": "Crowds of Palestinians fill Gaza’s main coastal road as they stream north. With their belongings on their backs, they smile, hug and sing, overjoyed at the prospect of returning home after more than a year of war. Ahead of the returning Palestinians lies an uncertain fate. Many of their homes were destroyed as more than 15 months of Israeli bombardment and ground offensive against Hamas have leveled large parts of Gaza City and the surrounding north.",
      "publishedAt": "2025-01-27T15:10:26Z",
      "title": "Northern Gaza is shattered. The spirit of returning Palestinians is not",
      "url": "https://apnews.com/article/israel-palestinians-gaza-war-returning-home-3845051eda5c3f481f5ed8783efc4cbf",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f5db64/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F9a%2Fc0c6665252d16ac989e6a3957fae%2F0deda84af24e4093af92008bb0bc4bee"
    },
    {
      "author": "VANESSA GERA",
      "description": "The 80th anniversary of the liberation of Auschwitz by Soviet troops is being observed at the site of the former death camp. Monday's ceremony is widely being treated as the last major observance that any notable number of survivors will be able to attend. Nazi German forces murdered some 1.1 million people at the site in southern Poland, which was under German occupation during World War II. Most of the victims were Jews killed on an industrial scale in gas chambers, but the Germans also murdered many Poles, Roma, Soviet prisoners of war, gay people and others who were targeted for elimination in the Nazi racial ideology.",
      "publishedAt": "2025-01-27T08:13:30Z",
      "title": "Auschwitz memorial holds observances on the 80th anniversary of the death camp's liberation",
      "url": "https://apnews.com/article/auschwitz-birkenau-80th-anniversary-bd9004cf75e6799394e6f74d14b4a742",
      "urlToImage": "https://dims.apnews.com/dims4/default/29e8ef6/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fca%2Fbc28fbe496392a4f6efe278a6f70%2F6322823a78d44863ad054fc7155026f2"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JOSEPH KRAUSS",
      "description": "Israel is allowing Palestinians to return to the heavily destroyed north of the Gaza Strip for the first time since the early weeks of the 15-month war with Hamas, in accordance with a fragile ceasefire. Thousands of Palestinians headed north Monday after waiting for days to cross. Associated Press reporters saw people crossing the so-called Netzarim corridor shortly after 7 a.m. The opening was delayed over a dispute between Hamas and Israel, which said the militant group had changed the order of the hostages it released in exchange for scores of Palestinian prisoners.",
      "publishedAt": "2025-01-27T05:17:24Z",
      "title": "Israel allows Palestinians to return to northern Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-27-2025-48a7eb98d6900cdf24b32ea93b5bc584",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bdabcc/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2Fa8%2F14b1f8312da084bb77558eb9ce26%2Fd5b82bd14a594a9394636c146d2b81ad"
    },
    {
      "author": "MANUEL RUEDA, ADRIANA GOMEZ LICON",
      "description": "Visa appointments at the U.S. Embassy in Colombia have been canceled following a dispute between President Donald Trump and his Colombian counterpart Gustavo Petro over deportation flights that nearly turned into a costly trade war between both countries. On Monday morning, hundreds of Colombians showed up outside the U.S. Embassy in Bogota, and were handed letters by local staff that said their appointments — which can take up to two years to obtain — had been canceled “due to the Colombian government’s refusal to accept repatriation flights of Colombian nationals.”",
      "publishedAt": "2025-01-27T16:44:20Z",
      "title": "Hundreds of US visa appointments canceled in Colombia following spat with Trump over deportations",
      "url": "https://apnews.com/article/colombia-visas-deportation-flights-trump-tariffs-d98900b9626bc481daebe0561d8889e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f32863/2147483647/strip/true/crop/5690x3201+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2Fa7%2F0b5f36a72b42ea03a108e31e0f14%2F002f59d9c12845d5ba34c4e7c6dce076"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "The Trump Justice Department says it has fired more than a dozen employees who worked on criminal investigations into President Donald Trump. The abrupt action targeting career prosecutors who worked on special counsel Jack Smith’s team is the latest sign of upheaval inside the Justice Department. It reflects the administration’s determination to purge the government of workers it perceives as disloyal to the president. The move, which follows the reassignment of multiple senior career officials across divisions, was made even though rank-and-file prosecutors by tradition remain in their positions across presidential administrations and are not punished because of their involvement in sensitive investigations.",
      "publishedAt": "2025-01-27T21:53:32Z",
      "title": "Justice Department fires employees involved in Trump prosecutions",
      "url": "https://apnews.com/article/justice-department-special-counsel-trump-046ce32dbad712e72e500c32ecc20f2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b07d255/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F93%2Fd6ffbd1c1cf17c9848a2dcc5265b%2F7e997a51476f4203be3dbd1895cf63fb"
    },
    {
      "author": "TARA COPP, LOLITA C. BALDOR, ZEKE MILLER",
      "description": "A flurry of new executive orders from President Donald Trump are expected at the Pentagon as Defense Secretary Pete Hegseth began his first day on the job. The orders are expected on Monday to reinstate troops booted for refusing COVID-19 vaccines, assess transgender forces and further outlining new rollbacks in diversity programs. Meanwhile, the Air Force says it has restored the use of training material referring to the storied Tuskegee Airmen after a temporary delay to edit its courses. Agencies have been taking a broad approach at removing any content that seemed to run afoul of Trump’s ban on diversity, equity and inclusion initiatives.",
      "publishedAt": "2025-01-27T15:08:49Z",
      "title": "New Trump orders on transgender troops, COVID and more expected on Hegseth's first day",
      "url": "https://apnews.com/article/hegseth-tuskegee-airmen-dei-pentagon-480d932c8bcb4c6056abe78e34010982",
      "urlToImage": "https://dims.apnews.com/dims4/default/11eba85/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fc3%2Fde5078e2789034dc72094982b243%2F12d45a6e7eb24e418686cc51265878da"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}