{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — The White House says it is preparing additional “major sanctions” on Russia in response to opposition leader Alexei Navalny's death in an Arctic penal colony.National Security Council spokesman John Kirby said Tuesday that the new package would be unveiled this Friday.",
      "publishedAt": "2024-02-20T16:29:36Z",
      "title": "White House promises 'major sanctions' on Russia in response to Alexei Navalny's death",
      "url": "https://apnews.com/dc1a51954673398a0410f8a6320f39e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28e4ac9979f3434ea2efd7f1eef7fb22/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United States vetoed an Arab-backed U.N. resolution Tuesday demanding an immediate humanitarian cease-fire in the Israel-Hamas war in the embattled Gaza Strip.",
      "publishedAt": "2024-02-20T05:07:53Z",
      "title": "The US vetoes an Arab-backed UN resolution demanding an immediate humanitarian cease-fire in Gaza",
      "url": "https://apnews.com/350c86ef261bf1a00a2515cf22764de5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98945382d11147d68d1d4a98e3ab8cee/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel ordered new evacuations from parts of Gaza City on Tuesday, as a study led by the U.N. children's agency found that one in six children are acutely malnourished in the isolated and largely devastated north of the territory, where the city is located.",
      "publishedAt": "2024-02-20T07:35:18Z",
      "title": "Israel orders new evacuations in northern Gaza, where UN says 1 in 6 children are malnourished",
      "url": "https://apnews.com/26d2afd9b81868c74ff2e4393692f91f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48cdd2204aa34b48bc8f98032e1896b5/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS and DASHA LITVINOVA",
      "description": "The mother of Russian opposition leader Alexei Navalny appealed Tuesday to President Vladimir Putin to intervene and turn her son's body over to her so she can bury him with dignity.",
      "publishedAt": "2024-02-20T11:26:38Z",
      "title": "Navalny's mother appeals to Putin to release her son's body so she can bury him with dignity",
      "url": "https://apnews.com/567e37bdcf6f9b8aadb1947e27d84af4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67d13d4c862f42eaa794aa5e4d2681d0/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE and JOSH BOAK",
      "description": "MESQUITE, Texas (AP) — At a bustling construction site outside of Dallas, there are hopes that Congress can finally pass nearly $95 billion in foreign aid including funding for Ukraine — because factory jobs in the United States depend on that money.",
      "publishedAt": "2024-02-20T15:01:55Z",
      "title": "Biden wants people to know most of the money he's seeking for Ukraine would be spent in the US",
      "url": "https://apnews.com/62cbb83a184fd14b1573e25a73475767",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3def222b755b44b294533aae862cf017/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "KIAWAH ISLAND, S.C. (AP) — There are no wins on the horizon for Nikki Haley.Those close to the former United Nations ambassador, the last major Republican candidate standing in Donald Trump's path to the GOP's 2024 presidential nomination, are privately bracing for a blowout loss in her home state's primary election in South Carolina on Saturday.",
      "publishedAt": "2024-02-20T15:30:30Z",
      "title": "Nikki Haley hasn't yet won a GOP contest. But she's vowing to keep fighting Donald Trump",
      "url": "https://apnews.com/b1582a35c3617eee49b36288523a1ea6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e94c02595e78488d89935536cbbe0a96/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Despite a month of U.S.-led airstrikes, Yemen's Iran-backed Houthi rebels remain capable of launching significant attacks — just this week, they seriously damaged a ship in a crucial strait and apparently downed an American drone worth tens of millions of dollars.",
      "publishedAt": "2024-02-20T09:28:03Z",
      "title": "Ship attacks and downing US drones. Yemen's Houthis still put up a fight despite US-led airstrikes",
      "url": "https://apnews.com/6ac2a1bf5032ed0531258816907cfe2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b65126848aff4230aa20c78db2c3151f/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Julian Assange's lawyers opened a final U.K. legal challenge Tuesday to stop the WikiLeaks founder from being sent to the United States to face spying charges, arguing that American authorities are seeking to punish him for exposing serious criminal acts by the U.S.",
      "publishedAt": "2024-02-20T05:18:16Z",
      "title": "WikiLeaks founder Assange faces his last legal roll of the dice in Britain to avoid US extradition",
      "url": "https://apnews.com/48e6786241f35064833e40060a90279a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a9862a31524ce682d0fe60cc9f4572/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "COLUMBIA, S.C. (AP) — The first federal trial over a hate crime based on gender identity is set to begin Tuesday in South Carolina, where a man faces charges that he killed a Black transgender woman and then fled to New York.",
      "publishedAt": "2024-02-20T05:07:10Z",
      "title": "First federal gender-based hate crime trial starts in South Carolina over trans woman's killing",
      "url": "https://apnews.com/c7d2970b6c2658c1e711fa15e5777ab4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89b11042ed024945951b34d1b2e782fd/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — Capital One Financial said it will buy Discover Financial Services for $35 billion, in a deal that would bring together two of the nation's credit card companies as well as potentially shake up the payments industry, which is largely dominated by Visa and Mastercard.",
      "publishedAt": "2024-02-20T01:50:26Z",
      "title": "Capital One to buy Discover for $35 billion in deal that combines major US credit card companies",
      "url": "https://apnews.com/3444782717e668b896883f09bda27baa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b44460fe6e694ff4aea5f2b042c33528/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}