{
  "articles": [
    {
      "author": "ZEKE MILLER, SEUNG MIN KIM and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden on Wednesday delivered a solemn call to voters to defend the country's democracy as he laid out in an Oval Office address his decision to drop his bid for reelection and throw his support behind Vice President Kamala Harris.",
      "publishedAt": "2024-07-24T22:35:53Z",
      "title": "Biden delivers solemn call to defend democracy as he lays out his reasons for quitting race",
      "url": "https://apnews.com/6fc0be75e1b9c9b15f5c07f42324c81b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46f4c8940a034946b1de90b10da043b4/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu is set to make a long-awaited White House visit Thursday to meet with President Joe Biden and likely Democratic nominee Vice President Kamala Harris at an important moment for all three politicians.",
      "publishedAt": "2024-07-25T04:06:08Z",
      "title": "Netanyahu to meet with Harris and Biden at crucial moment for US and Israel",
      "url": "https://apnews.com/41c4e0685e88fd75e9aa8e0d0d859b07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f0b1b5c0504d71a4b5d4d85c7d0a5a/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Thousands of protesters against the war in Gaza converged on Washington on Wednesday to condemn Israeli Prime Minister Benjamin Netanyahu’s visit, chanting “Free, free Palestine” as they marched toward the Capitol before police deployed pepper spray on some in the crowd.",
      "publishedAt": "2024-07-24T04:08:10Z",
      "title": "Thousands fill Washington's streets to protest Israel's war in Gaza during Netanyahu visit",
      "url": "https://apnews.com/9a7885972989b2397b49e5b971ffe0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58aba8d56d8b45658d70f60180150d09/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "HOUSTON (AP) — Vice President Kamala Harris is slated to continue her days-old presidential push by speaking Thursday to the American Federation of Teachers, the first labor union to formally endorse her candidacy.",
      "publishedAt": "2024-07-25T04:19:17Z",
      "title": "Harris plans to continue to build presidential momentum in speech to teachers union",
      "url": "https://apnews.com/6d3aab384f62d9cc5bfa702539f614c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43e27ce43ffd486489f0baf024eceef2/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and ADRIANA GOMEZ LICON",
      "description": "CHARLOTTE, N.C. (AP) — Donald Trump unleashed a barrage of attack lines Wednesday against his likely new opponent, Vice President Kamala Harris, whom he called his “new victim to defeat” and accused of deceiving the public about President Joe Biden 's ability to run for a second term.",
      "publishedAt": "2024-07-24T04:28:16Z",
      "title": "Trump turns his full focus on Harris at first rally since Biden's exit from 2024 race",
      "url": "https://apnews.com/7c7e6e405fecc8927a63763c76f2db1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48447599f81b4e74bf4342241172c03e/3000.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — Taiwan has seen flooding in low-lying areas, along with landslides and damage to homes and shops after Typhoon Gaemi made landfall on the island.The storm swept up the western Pacific, leaving 22 people dead in the Philippines from flooding and landslides, and three in Taiwan, with more than 220 reported injured.",
      "publishedAt": "2024-07-25T04:26:50Z",
      "title": "Taiwan sees flooding and landslides from Typhoon Gaemi, which caused 22 deaths in the Philippines",
      "url": "https://apnews.com/5edd13684628eed4f596b5e1167edda4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85c842780a7a4dd9984e194055372d92/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "MIAMI (AP) — In a WhatsApp chat that quickly devolved into depravity, a group of U.S. Drug Enforcement Administration agents boasted about their “world debauchery tour” of “boozing and whoring” on the government’s dime.",
      "publishedAt": "2024-07-25T04:54:04Z",
      "title": "Secret DEA files show agents joked about rape in WhatsApp chat. Then one of them was accused of it.",
      "url": "https://apnews.com/649db430c4953a083a7af33ec34b9781",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1648d06468c94b56a44eb49199f4e830/1330.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "CASTLE ROCK, Colo. (AP) — Behind a church surrounded by rolling prairie on the outskirts of this Colorado town sits a donated RV that Joe Ridenour called home for a year after he lost his job during the pandemic.",
      "publishedAt": "2024-07-25T04:26:02Z",
      "title": "Church sues Colorado town to be able to shelter homeless in trailers, work 'mandated by God'",
      "url": "https://apnews.com/c6d100c15717d9e05782f3577261dadb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abae126ac2554a0b844a6c1b14059008/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "When Jennifer Wexton rises Thursday to speak on the House floor, something she has done countless times before, the congresswoman will be using a voice she thought was gone forever.After a rare neurological disorder robbed her of her ability to speak clearly, Wexton has been given her voice back with the help of a powerful artificial intelligence program, allowing the Virginia Democrat to make a clone of her speaking voice using old recordings of speeches and appearances she made as a congresswoman.",
      "publishedAt": "2024-07-25T04:15:00Z",
      "title": "A neurological disorder stole her voice. Jennifer Wexton takes it back on the House floor.",
      "url": "https://apnews.com/6569e27b4095db2b58c36b61e833d0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b77b1141625e4f08bc265e07692db3c0/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAINT-ETIENNE, France (AP) — The Olympic men's soccer tournament got off to a violent and chaotic start Wednesday with Morocco's shocking 2-1 win against two-time gold medalist Argentina.",
      "publishedAt": "2024-07-24T16:41:47Z",
      "title": "Olympic soccer gets off to violent and chaotic start as Morocco fans rush the field vs Argentina",
      "url": "https://apnews.com/ed408ab5f6fa529ba63ad59aee082d75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bf0f402bcbc49bfafdde7ab309ef2ca/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}