{
  "articles": [
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — A dog’s plaintive wail. A courtroom couplet-turned-cultural catchphrase about gloves. A judge and attorneys who became media darlings and villains. A slightly bewildered houseguest elevated, briefly, into a slightly bewildered celebrity.",
      "publishedAt": "2024-04-11T19:56:14Z",
      "title": "The OJ Simpson saga was a unique American moment. 3 decades on, we're still wondering what it means",
      "url": "https://apnews.com/3610d214475cc680bdecaa14d74f4605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/217d83ae011349b2892e98b2ec48a6c9/1790.jpeg"
    },
    {
      "author": "KEN RITTER and LINDA DEUTSCH",
      "description": "LAS VEGAS (AP) — For a long time, O.J. Simpson was the man who had it all.He lived the American dream as a sports legend, movie actor, commercial pitchman and millionaire.",
      "publishedAt": "2024-04-11T20:50:16Z",
      "title": "Legendary athlete, actor and millionaire: O.J. Simpson's murder trial lost him the American dream",
      "url": "https://apnews.com/782a2c38373a695a9b12e4371ece9cf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f19a44dbf7304cbcb80c4e2007bbfe09/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — There’s a reason why President Joe Biden and former President Donald Trump are spending so much time attacking each other — people don't think either man has much to brag about when it comes to his own record.",
      "publishedAt": "2024-04-12T04:00:25Z",
      "title": "Many say Biden and Trump did more harm than good, but for different reasons, AP-NORC poll shows",
      "url": "https://apnews.com/21b95914866c2af3a1e7af8e302dbe27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1334b1459e6141deaca3e127cacc5190/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Of the 1.4 million adults who live in Manhattan, a dozen are soon to become the first Americans to sit in judgment of a former president charged with a crime.",
      "publishedAt": "2024-04-12T04:06:04Z",
      "title": "Manhattan court must find a dozen jurors to hear first-ever criminal case against a former president",
      "url": "https://apnews.com/b8fa0edfed572b06fb4dec05b3824a0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c45f26b52d545e4845d808f2923f0d5/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Under heavy U.S. pressure, Israel has promised to ramp up aid to Gaza dramatically, saying last week it would open another cargo crossing and surge more trucks than ever before into the besieged enclave.",
      "publishedAt": "2024-04-11T19:28:22Z",
      "title": "More aid is supposed to be entering the Gaza Strip. Why isn’t it helping?",
      "url": "https://apnews.com/30173642b5c298c829f1457db357071e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7230bb203f114f659566a49f525afe69/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — Osama Siblani was sipping his morning coffee at the office when his phone buzzed with a message from one of President Joe Biden's advisers. As publisher of the Arab American News in Dearborn, Michigan, Siblani serves as an occasional sounding board, and the White House wanted to know what he thought of Biden's recent call with Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-04-11T17:17:08Z",
      "title": "Muslim leaders are 'out of words' as they tire of the White House outreach on the war in Gaza",
      "url": "https://apnews.com/32cbf8d76872863a6c672bdce087be23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60edd32dba3444e2a2e60ee10c6ef4cd/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson is negotiating with the White House as he prepares for the treacherous task of advancing wartime funding for Ukraine and Israel through the House, a top House Republican said Thursday.",
      "publishedAt": "2024-04-12T00:10:16Z",
      "title": "House Speaker Mike Johnson negotiating with White House to advance Ukraine aid",
      "url": "https://apnews.com/e10ec89f51768f66786c293ebc562fe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e79a0953151452f9e7337c90c787a85/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — On a brisk day at a restaurant outside Chicago, Deb Robertson sat with her teenage grandson to talk about her death.She’ll probably miss his high school graduation. She declined the extended warranty on her car.",
      "publishedAt": "2024-04-12T04:08:23Z",
      "title": "'I'm dying, you're not': Those terminally ill ask more states to legalize physician-assisted death",
      "url": "https://apnews.com/b67affd86c1d1ce99379ed34bdb2946b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36e690ed134d4a13b9f4a29009334980/3000.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT",
      "description": "ALEXANDRIA, Va. (AP) — Twenty years ago this month, photos of abused prisoners and smiling U.S. soldiers guarding them at Iraq's Abu Ghraib prison were released, shocking the world. Now, three survivors of Abu Ghraib will finally get their day in U.S.",
      "publishedAt": "2024-04-12T04:23:48Z",
      "title": "20 years later, Abu Ghraib detainees get their day in US court",
      "url": "https://apnews.com/47bca65df10c62b672944692a139e012",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a0e053e576149f9bdc85910b87317fe/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — O.J. Simpson died Thursday without having paid the lion’s share of the $33.5 million judgment a California civil jury awarded to the families of his ex-wife Nicole Brown Simpson and her friend Ron Goldman.",
      "publishedAt": "2024-04-12T04:21:32Z",
      "title": "If O.J. Simpson's assets go to court, Goldman, Brown families could be first in line",
      "url": "https://apnews.com/6a6bfb5fec449adfe469d918b41ceda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa5e466705274948b2643b071d2f592f/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}