{
  "articles": [
    {
      "author": "MARI YAMAGUCHI, KIMBERLY ESMORES, ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "SAIPAN, Northern Mariana Islands (AP) — WikiLeaks founder Julian Assange pleaded guilty to obtaining and publishing U.S. military secrets Wednesday in a deal with Justice Department prosecutors that secures his liberty and concludes a drawn-out legal saga that raised divisive questions about press freedom and national security.",
      "publishedAt": "2024-06-25T05:33:34Z",
      "title": "WikiLeaks’ Assange pleads guilty to publishing US military secrets in deal that secures his freedom",
      "url": "https://apnews.com/00eb380879ff636cc9b916f82f82ed40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d74c2657b84447bea0b963f9f34e5b0a/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and MAYA ALLERUZZO",
      "description": "JENIN, West Bank (AP) — When Mujahid Abadi stepped outside to see if Israeli forces had entered his uncle's neighborhood, he was shot in the arm and the foot. That was only the start of his ordeal. Hours later, beaten and bloodied, he found himself strapped to the searing hood of an Israeli military jeep driving down a road.",
      "publishedAt": "2024-06-26T04:34:10Z",
      "title": "A Palestinian was shot, beaten and tied to an Israeli army jeep. The army says he posed no threat",
      "url": "https://apnews.com/8e8ed63bda65383e38e4dd52d239e319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1a3048d8d245a9af6dfd2fc2a6194e/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — What people remember from Joe Biden and Donald Trump’s first debate four years ago are likely the interruptions, the shouting and the “will you shut up, man?”",
      "publishedAt": "2024-06-26T04:03:56Z",
      "title": "Biden and Trump are set to debate. Here's what their past performances looked like",
      "url": "https://apnews.com/a3b65b133c7e7a7d29450a4ffa28d85f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e81dd8ec0427450596858f6ab38d4cb1/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Most U.S. adults plan to watch some element of Thursday's presidential debate and many think the event will be important for the campaigns of both President Joe Biden and former President Donald Trump, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-06-26T04:07:42Z",
      "title": "Most Americans plan to watch Biden-Trump debate, and many see high stakes, AP-NORC poll finds",
      "url": "https://apnews.com/cc9e16ef147507162e22c96ddb889ee8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dbd14078b604d6488f4f44871c8d3a0/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Seemingly every afternoon in Iran's capital, police vans rush to major Tehran squares and intersections to search for women with loose headscarves and those who dare not to wear them at all.",
      "publishedAt": "2024-06-26T04:59:54Z",
      "title": "As Iran's presidential vote looms, tensions boil over renewed headscarf crackdown",
      "url": "https://apnews.com/9dafd124a8d957119cd845cad3e81dea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8912ab741c8d43b78603c5393184500e/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "George Latimer, a pro-Israel centrist, defeated U.S. Rep. Jamaal Bowman on Tuesday in a Democratic primary in suburban New York that highlighted the party’s deep divisions over the war in Gaza.",
      "publishedAt": "2024-06-25T04:36:31Z",
      "title": "George Latimer, a pro-Israel centrist, defeats Rep. Jamaal Bowman in New York Democratic primary",
      "url": "https://apnews.com/f751616f7f69df439a6080dc6c23e385",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5ed5f401a0d449580f5c3d2ecb03b29/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — U.S. Rep. Lauren Boebert won Tuesday's Republican primary in a U.S. House race that she jumped into last year, surviving a scandal over a video of her at a Denver theater and accusations of carpetbagging after fleeing what could have been a tough reelection bid in her current district.",
      "publishedAt": "2024-06-25T04:13:30Z",
      "title": "Rep. Lauren Boebert wins GOP primary after switching Colorado districts; Hurd, Crank also notch wins",
      "url": "https://apnews.com/5f14372b55c0da9e1f872ba590af56d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/535764ee9d2245c7a09f7205bceaceb4/1920.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "TALLINN, Estonia (AP) — Fifteen months after Wall Street Journal reporter Evan Gershkovich was arrested in the Russian city of Yekaterinburg on espionage charges, he returns there for his trial starting Wednesday behind closed doors.",
      "publishedAt": "2024-06-26T04:41:22Z",
      "title": "US journalist's closed trial for espionage set to begin in Russia, with a conviction all but certain",
      "url": "https://apnews.com/75c2cdca103c5cd4902255dcdb372315",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13d9543d1b0749c781cdc8541beefaa2/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT, DAVE COLLINS and MARGERY A. BECK",
      "description": "DES MOINES, Iowa (AP) — Kathy Roberts has almost nothing left. The South Dakota resident escaped flooding Sunday night with her cat and the clothes on her back, KTIV-TV reported.",
      "publishedAt": "2024-06-26T04:34:23Z",
      "title": "Midwest flooding devastation comes into focus as flood warnings are extended in other areas",
      "url": "https://apnews.com/4b9fbfe8918e7a7e3c18178cb92b11a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f054687adc044d268d247792c1963a71/1920.jpeg"
    },
    {
      "author": "WAYNE PARRY",
      "description": "FREEHOLD, N.J. (AP) — Fighting brain cancer, little Giada Demma was lying in her pediatric hospital bed, her tiny body virtually swimming in a drab green hospital gown.Her cousin Giuliana Demma remembers looking at the 1-year-old and thinking how sad the scene was: a small child awash in an ugly gown several sizes too big for her.",
      "publishedAt": "2024-06-26T04:10:44Z",
      "title": "Baby cousin with cancer inspires girls to sew hospital gowns for sick kids across U.S. and Africa",
      "url": "https://apnews.com/81827b14aab133b45cdbeee17e71a1bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/638e5dc2d5614fb8bb6368a78dce0b5c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}