{
  "articles": [
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "NUSEIRAT, Gaza Strip (AP) — Rockets streaked through the morning sky in Gaza on Oct. 7 as Amal Al-Taweel hurried to the hospital in the nearby Nuseirat refugee camp, already in labor. After a difficult birth, she and her husband, Mustafa, finally got to hold Ali, the child they spent three years trying to have.",
      "publishedAt": "2024-04-07T04:08:30Z",
      "title": "These Palestinian mothers in Gaza gave birth Oct. 7. Their babies have known only war",
      "url": "https://apnews.com/8350dcdd42f717530a1a1f5ad40e2ee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e69513662d594c3ca520155cf8b1a413/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and SAM METZ",
      "description": "CAIRO (AP) — Israel's military said Saturday it had recovered the body of a 47-year-old farmer who was held hostage in Gaza, while negotiators prepared for another round of talks Sunday on brokering a cease-fire and securing the release of the remaining hostages, six months into the war.",
      "publishedAt": "2024-04-06T14:16:24Z",
      "title": "Israel finds the body of a hostage killed in Gaza, while talks will resume on a cease-fire",
      "url": "https://apnews.com/f4c7467a06c11d3073da159136c81c61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65e61f2ca9c84bec9c3ccfd8fa91624b/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "BEIJING (AP) — U.S. Treasury Secretary Janet Yellen met Sunday in Beijing with Chinese Premier Li Qiang and sent a message of mutual cooperation despite the nations’ differences.",
      "publishedAt": "2024-04-07T03:34:57Z",
      "title": "Yellen says US-China relationship on 'more stable footing' but more can be done to improve ties",
      "url": "https://apnews.com/cbeef6b23ffb6c6cf6cb11dab25ed08b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1eb662f0717f477eae548a7eb8710733/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Diplomatic relations between Mexico and Ecuador dramatically imploded after Ecuadorian police burst into Mexico's embassy in Quito and arrested Jorge Glas, Ecuador's former vice president.",
      "publishedAt": "2024-04-06T20:21:47Z",
      "title": "Ecuadorian police broke into Mexico's embassy, sparking outrage. Why is this such a big deal?",
      "url": "https://apnews.com/c888b82d614f91ef9a7bd8faa09afe91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c08e0086786d43599f94dd3ad32f114d/3000.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — The Powerball lottery drawing scheduled for Saturday night has been delayed to complete procedures required before the numbers are announced, the game's organizers said.The drawing for the game, including an estimated $1.3 billion jackpot, was delayed to enable one of the organizers to complete required procedures before the scheduled numbers reveal at 10:59 p.m.",
      "publishedAt": "2024-04-07T03:35:00Z",
      "title": "Powerball lottery drawing delayed",
      "url": "https://apnews.com/ef6c513ad9fc94dd3d07cd9db2e8e22f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e3ae6c869324385a5b4484aef37597b/3000.jpeg"
    },
    {
      "author": "JOHN MARSHALL",
      "description": "GLENDALE, Ariz. (AP) — The final result showed UConn winning its 11th straight NCAA Tournament game by at least 13 points.The reality: The Huskies were tested unlike any other time during their run toward a possible second straight national title.",
      "publishedAt": "2024-04-07T03:05:58Z",
      "title": "Led by Castle and Clingan, defending champ UConn returns to NCAA title game, beating Alabama 86-72",
      "url": "https://apnews.com/ba0005af56f8c3be7fba62ec782a89e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a5774ec8b9c4784a242fe3dd2c1ed41/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISFAHAN, Iran (AP) — A top military commander Saturday renewed Iran's promise to retaliate after an airstrike earlier this week widely blamed on Israel destroyed Iran’s consulate in Syria, killing 12 people, including two elite Iranian generals.",
      "publishedAt": "2024-04-06T18:09:44Z",
      "title": "Iranian commander renews vow to avenge Syria strike attributed to Israel that killed 2 generals",
      "url": "https://apnews.com/335f64884d57f72f4c5fb2a90f953c2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9db9cba38b1a4d38ad0ba72ac4f3e76f/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and AMY BETH HANSON",
      "description": "LIBBY, Mont. (AP) — Paul Resch remembers playing baseball as a kid on a field constructed from asbestos-tainted vermiculite, mere yards from railroad tracks where trains kicked up clouds of dust as they hauled the contaminated material from a mountaintop mine through the northwestern Montana town of Libby.",
      "publishedAt": "2024-04-07T04:30:28Z",
      "title": "Victims of Montana asbestos pollution that killed hundreds take Warren Buffet's railroad to court",
      "url": "https://apnews.com/e9b7587c0cc78fb93afca24436639eb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d7873dd126d4edd8d4fcf43049977d4/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "WAXAHACHIE, Texas (AP) — The last time a total solar eclipse passed through this Texas town, horses and buggies filled the streets and cotton fetched 9 cents a pound.",
      "publishedAt": "2024-04-06T19:28:46Z",
      "title": "Small town businesses embrace total solar eclipse crowd, come rain or shine on Monday",
      "url": "https://apnews.com/8f9bf6abe01315a287032917266654bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bafa1e3b550a415f8692ed16360332f1/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — Find a globe in your local library or classroom and try this: Close the eyes, spin it and drop a finger randomly on its curved, glossy surface. You’re likely to pinpoint a spot in the water, which covers 71% of the planet.",
      "publishedAt": "2024-04-07T05:03:50Z",
      "title": "Even in the age of Google Earth, people still buy globes. Here's why they remain so alluring",
      "url": "https://apnews.com/4932f2f3ebdc9d6c26efd70112015c29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68fad4f2f90241b7a4441c6dc8dccdfe/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}