{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER, JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump became the first former American president to be convicted of felony crimes Thursday as a New York jury found him guilty of all 34 charges in a scheme to illegally influence the 2016 election through a hush money payment to a porn actor who said the two had sex.",
      "publishedAt": "2024-05-30T04:03:01Z",
      "title": "Guilty: Trump becomes first former U.S. president convicted of felony crimes",
      "url": "https://apnews.com/85558c6d08efb434d05b694364470aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a27ab00f86d5416baafd6dcd86c71374/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JILL COLVIN, MICHELLE L. PRICE and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump’s conviction on 34 felony counts marks the end of the former president's historic hush money trial but the fight over the case is far from over.",
      "publishedAt": "2024-05-30T22:35:31Z",
      "title": "Here's what you should know about Donald Trump's conviction in his hush money trial",
      "url": "https://apnews.com/a70941a7cd367f7b2aa3218ea91ad922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7727e2928b3457680aaad09d13dab60/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Donald Trump may be convicted of a felony and reside in Florida, a state notorious for restricting the voting rights of people with felony convictions.",
      "publishedAt": "2024-05-30T22:09:23Z",
      "title": "Trump could still vote for himself after New York conviction if he's not in prison on Election Day",
      "url": "https://apnews.com/b95e7b4c9158d999e8bc89b00fbda911",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd2958717ed343d682b26c205c55156a/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Former President Donald Trump on Thursday was found guilty on all 34 felony counts in his criminal hush money trial.",
      "publishedAt": "2024-05-30T09:58:16Z",
      "title": "The Latest | Jury finds Trump guilty on all charges in hush money trial",
      "url": "https://apnews.com/7dfc763f996cc5e9ddde47eca6e7fd37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbd2048971714f368eb0cb47aebd2fe3/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Chief Justice John Roberts on Thursday declined an invitation to meet with Democratic senators to talk about Supreme Court ethics and the controversy over flags that flew outside homes owned by Justice Samuel Alito.",
      "publishedAt": "2024-05-30T18:11:16Z",
      "title": "Roberts rejects Senate Democrats' request to discuss Supreme Court ethics and Alito flag controversy",
      "url": "https://apnews.com/dc879158dd42050a9a52c850abfb90b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56af25f12c1c43b5b4c8204bfe3ebe01/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 13 Houthi targets in several locations in Yemen on Thursday in response to a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, three U.S.",
      "publishedAt": "2024-05-30T21:33:16Z",
      "title": "US and Britain strike Houthi rebel targets in Yemen after surge in shipping attacks",
      "url": "https://apnews.com/9f13a9739a139abfecb6fdc499280a89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9d46cb6d944ba8947006c21f473b6c/2000.jpeg"
    },
    {
      "author": "MATTHEW LEE, AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden has given Ukraine the go-ahead to use American weaponry to strike inside Russia for the limited purpose of defending Kharkiv, according to three U.S.",
      "publishedAt": "2024-05-30T12:01:20Z",
      "title": "Biden partially lifts ban on Ukraine using US arms in strikes on Russian territory, US officials say",
      "url": "https://apnews.com/441c9624d95f8193e99cf08effced44f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/128db619f6ab4bfea66415fa3243a489/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — The White House is finalizing plans for a U.S.-Mexico border clampdown that would shut off asylum requests and automatically deny entrance to migrants once the number of people encountered by American border officials exceeded a new daily threshold, with President Joe Biden expected to sign an executive order as early as Tuesday, according to four people familiar with the matter.",
      "publishedAt": "2024-05-30T18:36:41Z",
      "title": "Biden is said to be finalizing plans for migrant limits as part of a US-Mexico border clampdown",
      "url": "https://apnews.com/aa622c524237fcac29fad24a497192ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8e3d8b247994adbb2fb49693c387383/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Slovenia’s government endorsed a motion Thursday to recognize a Palestinian state and asked the parliament to do the same. It comes just two days after Spain, Norway and Ireland recognized a Palestinian state, a move that was condemned by Israel.",
      "publishedAt": "2024-05-30T06:41:44Z",
      "title": "The Latest | Slovenia moves to recognize a Palestinian state as Israel fights in Rafah",
      "url": "https://apnews.com/db1561901fcab2ab0835c981a885d661",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d884ae1083544069ba82ae1b0b08686/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — An Idaho man was convicted Thursday of killing his wife and his new girlfriend's two youngest kids in a strange triple murder case that included claims of apocalyptic prophesies, zombie children and illicit affairs.",
      "publishedAt": "2024-05-30T20:15:25Z",
      "title": "Doomsday plot: Idaho jury convicts Chad Daybell of killing wife and girlfriend's 2 children",
      "url": "https://apnews.com/4146cf7574e76a619955c63c27e20cb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63685a901db24444adea9c6b37140bc1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}