{
  "articles": [
    {
      "author": "Aaron Morrison, Sophia Tareen",
      "description": "The Rev. Jesse Jackson kept up his more than half-century-long fight for civil and human rights through his final years despite challenges over his health, the coronavirus pandemic, racial injustice and political divisions. Whether appearing at the funerals of Black people killed by police or participating in COVID-19 vaccination drives to address hesitancy in communities of color, Jackson built on a life in public advocacy that included running for president, international diplomacy and influencing the lexicon of racial identity in America. Jackson, a protégé of the Rev. Martin Luther King Jr., died on Tuesday. He was 84.",
      "publishedAt": "2026-02-17T16:02:39Z",
      "title": "Jesse Jackson kept the Civil Rights Movement alive long after King",
      "url": "https://apnews.com/article/jesse-jackson-dead-8ed88b7da0b911ed842f3c219cee77e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4513057/2147483647/strip/true/crop/3032x2020+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F83%2F93c5babbaace0ffcfe2e2d74cc72%2F4b2f1d1a34a64a48b6e7db123671e95b"
    },
    {
      "author": "Kimberlee Kruesi",
      "description": "A gunman who opened fire at a Rhode Island youth hockey game, killing two adults and injuring three others, was stopped after a fellow spectator intervened. Pawtucket Police Chief Tina Goncalves said Monday that the shooter died from an apparent self-inflicted gunshot. Goncalves says investigators think the shooting at the Dennis M. Lynch Arena in Pawtucket on Monday afternoon was targeted and may have involved a family dispute. Video online shows players and fans scrambling for cover and rushing to exits. Gov. Dan McKee says the state is grieving again after another recent mass shooting.",
      "publishedAt": "2026-02-17T14:31:54Z",
      "title": "Shooting at a Rhode Island hockey rink leaves 3 dead, including shooter",
      "url": "https://apnews.com/article/pawtucket-hockey-rink-shooting-rhode-island-4e9c9df9c3a2b0a524f0e9bdd0908d45",
      "urlToImage": "https://dims.apnews.com/dims4/default/078458e/2147483647/strip/true/crop/4200x2799+0+563/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F42%2Fc6f3ca08f998d9519a8fb59e0cfb%2Fa22aab3b09934c1392772e0ffa4a9a79"
    },
    {
      "author": "Ed White",
      "description": "Investigators in the Nancy Guthrie disappearance say DNA from gloves did not match any entries in a national database. CODIS is a valuable storehouse of DNA taken from crime suspects or people with convictions. Any hits could identify possible suspects in the Guthrie saga, which reached a 17th day Tuesday. The 84-year-old mother of NBC “Today” co-anchor Savannah Guthrie was reported missing from her Tucson-area home on Feb. 1 after spending the previous night with family. Investigators are also working with experts to try to locate Nancy Guthrie by somehow detecting her heart pacemaker.",
      "publishedAt": "2026-02-17T20:32:53Z",
      "title": "No breakthrough reported with glove DNA in Nancy Guthrie disappearance",
      "url": "https://apnews.com/article/nancy-guthrie-missing-savannah-guthrie-aadbb20a613491c10373f55ba33d1831",
      "urlToImage": "https://dims.apnews.com/dims4/default/377f983/2147483647/strip/true/crop/6131x4085+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F81%2Fd5e6f574aeda7c6d693d02b30c4b%2F8e5e142f0aeb4a3cbc1ed002fef19783"
    },
    {
      "author": "Gary Fields",
      "description": "U.S. Capitol Police in Washington, D.C., have arrested an 18-year-old man after he ran toward the west side of the Capitol Building armed with a shotgun. Capital Police Chief Michael Sullivan said the unidentified man parked a Mercedes SUV near the Capitol on Tuesday, got out and ran “several hundred yards” toward the building before officers intercepted him and ordered him to the ground. Sullivan says the gunman was wearing a tactical vest and gloves and had a Kevlar helmet and gas mask in the vehicle. The shotgun was loaded and the man had additional rounds on him, the chief says. Congress is not in session.",
      "publishedAt": "2026-02-17T20:24:03Z",
      "title": "Police arrest man who ran toward the US Capitol with a shotgun",
      "url": "https://apnews.com/article/capitol-arrest-shotgun-congress-e4c2233b957ca6ab4ae780006cd75081",
      "urlToImage": "https://dims.apnews.com/dims4/default/59b9b30/2147483647/strip/true/crop/5391x3592+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F0e%2F18acea9fc0bb2b096d7ea94e62b5%2F9114733373714c2c82dfa7575a488440"
    },
    {
      "author": "Steve Karnowski",
      "description": "Democrats’ top priority as the 2026 session of the Minnesota Legislature gets underway is reining in the power of federal law enforcement to conduct immigration crackdowns. For Republican lawmakers, who have largely supported the Trump administration’s methods in the state, their priority is curbing the massive fraud that has plagued taxpayer funded programs. President Donald Trump has cited such fraud as justification for sending thousands of federal immigration officers into the state. While the immigration enforcement surge is winding down, the aftermath will reverberate at the state Capitol.",
      "publishedAt": "2026-02-17T18:36:09Z",
      "title": "Democrats in Minnesota Legislature aim to curb federal law enforcement",
      "url": "https://apnews.com/article/minnesota-legislature-immigration-fraud-b4b11fa932852ea0cdf902e028a66b02",
      "urlToImage": "https://dims.apnews.com/dims4/default/a41dc92/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F26%2Fe7a3615f97c5403edae4666b64c4%2Fe761c325296a418e95dcfcec83eafe62"
    },
    {
      "author": "Jamey Keaten, Stephanie Liechtenstein",
      "description": "The U.S. and Iran are expected to hold a second round of talks in Geneva about Iran’s nuclear program as tensions rise in the region. The session, planned for Tuesday, comes after a first round of indirect talks held in Oman earlier in the month. They are being held as the U.S. ramps up its military presence in the region amid threats by President Donald Trump to use force to push a deal. Iran also began major Revolutionary Guard naval drills near key oil shipping routes. Still, both sides are signaling they are willing to reach a deal, which Iran says must include easing U.S.-led sanctions.",
      "publishedAt": "2026-02-17T05:00:30Z",
      "title": "US and Iran to hold a second round of nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-iaea-dbed41b78ce2ddabc8a04349e72abeba",
      "urlToImage": "https://dims.apnews.com/dims4/default/73c0551/2147483647/strip/true/crop/3200x2132+0+85/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F9a%2F6f1c6cd261a46c891761bca3a91d%2F8710b09f9aa5488eab6317f99f7511da"
    },
    {
      "author": null,
      "description": "A federal judge has ruled that Immigration and Customs Enforcement cannot re-detain Kilmar Abrego Garcia because a 90-day detention period has expired and the government has no viable plan for deporting him. The Salvadoran national’s case has become a focal point in the immigration debate after he was mistakenly deported to his home country last year. Since his return, he has been fighting a second deportation to a series of African countries proposed by Department of Homeland Security officials. Abrego Garcia has an American wife and child and has lived in Maryland for years, but he immigrated to the U.S. illegally as a teenager.",
      "publishedAt": "2026-02-17T17:45:19Z",
      "title": "Federal judge rules Kilmar Abrego Garcia can’t be re-detained by immigration authorities",
      "url": "https://apnews.com/article/abrego-garcia-immigration-ice-ec79dc6e073493ec8a8284fa32c7a2fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/3b8c790/2147483647/strip/true/crop/4129x2751+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Ff9%2Fef3fa39ca54f44b4c2cb45b58abb%2F7527f862048040c5b451ab5edbfc6781"
    },
    {
      "author": "Meg Kinnard",
      "description": "Stephen Colbert’s comments that network executives pulled his interview with Democratic Texas Senate candidate James Talarico over fears it would violate regulatory guidance from the Trump administration has prompted a conversation about how media outlets treat political coverage. The concern about the interview, which the late-night host referenced in his show and later posted in full online, stems from a requirement that broadcast stations give equal time to political candidates when they appear on-air. Although there are multiple exemptions to the provision, the Trump administration through the Federal Communications Commission has been moving to clamp down specifically on programs like Colbert’s, which the agency has suggested may be “motivated by partisan purposes.”",
      "publishedAt": "2026-02-17T21:04:02Z",
      "title": "What to know about the 'equal time' rule and Colbert's Talarico interview",
      "url": "https://apnews.com/article/stephen-colbert-james-talarico-equal-time-6cd29992ae2170ab6d10c3ddca92ec98",
      "urlToImage": "https://dims.apnews.com/dims4/default/13c4f88/2147483647/strip/true/crop/2176x1450+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fa2%2F6d6e109e778d12c539a90ad87148%2F38e3c63eb1b14af9b7e842307a4fb93a"
    },
    {
      "author": "Franklin Briceño, Manuel Rueda",
      "description": "Peru’s Congress has voted to remove interim President José Jerí from office as he faces corruption allegations. The move triggers a fresh wave of political instability just weeks before the nation’s April presidential election. Jerí is under a preliminary investigation into corruption and influence peddling, stemming from a series of undisclosed meetings with two Chinese executives. With 75 votes in favor, 24 against and 3 abstentions, Peru’s legislature voted to remove Jerí from the position he had assumed on Oct. 10.",
      "publishedAt": "2026-02-17T16:00:23Z",
      "title": "Peru's Congress sacks José Jeri, the nation's seventh president in a decade",
      "url": "https://apnews.com/article/peru-jeri-president-congress-vote-8974236f989f7d9cbd8e54de7d3ef81e",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa7fbf2/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F88%2Fb6a06e4b4f4454d90d109b8dce1c%2F6b11b33303f5471787fc5928ad46e2a0"
    },
    {
      "author": "The Associated Press",
      "description": "The Italian men's speedskating team pulled off a stunner in team pursuit, surging past the United States to gold at the Milan Cortina Olympics. The group of Davide Ghiotto, Andrea Giovannini, and Michele Malfatti pulled away over the final laps and win by 4.5 seconds. The Canadian women's team defended their Olympic gold in the same event. Elsewhere at the Games, organizers scrubbed the women’s snowboard slopestyle final after heavy snow hit the facility in Livigno. France rallied past favored Norway to win gold in the men's biathlon relay. Norway’s Jens Luraas Oftebro takes another Nordic combined title, this time on the large hill.",
      "publishedAt": "2026-02-17T16:53:17Z",
      "title": "Italy pulls off a stunner in Olympic men's speedskating team pursuit, earns first gold since 2006",
      "url": "https://apnews.com/article/milan-cortina-winter-olympics-6a816ba2d0f1636c899bb7876c509d0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c1dcaf/2147483647/strip/true/crop/5475x3648+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2Fc8%2F9619d266d4e22458db99c3c85c4a%2Fcb520f5ef65449ceb7113660fc14b30e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}