{
  "articles": [
    {
      "author": null,
      "description": "Follow along for live updates on the indictment of former President Donald Trump over his efforts to overturn the results of his 2020 presidential election loss in Georgia.",
      "publishedAt": "2023-08-15T03:13:57Z",
      "title": "Trump calls Georgia case against him 'election interference.' Follow live updates",
      "url": "https://apnews.com/9a1539dcdb29fade4a835d136f6d34e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe0f10a901374162b3f7ef7d9d7f7f4a/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ERIC TUCKER",
      "description": "ATLANTA (AP) — Donald Trump and 18 allies were indicted in Georgia on Monday with scheming to overturn his 2020 election loss in the state, with prosecutors turning to a statute normally associated with mobsters to accuse the former president, lawyers and other top aides in a sweeping criminal conspiracy aimed at keeping him in power.",
      "publishedAt": "2023-08-14T16:23:05Z",
      "title": "Trump, 18 allies indicted in Georgia over 2020 election meddling, the 4th criminal case against him",
      "url": "https://apnews.com/d39562cedfc60d64948708de1b011ed3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59269cc3593348c48bc5db5ecf2edf5a/1920.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO, MATT SEDENSKY and CLAIRE RUSH",
      "description": "LAHAINA, Hawaii (AP) — The smoke was starting to blot out the sun. Winds were howling, and heat bore down as flames licked the trees on the horizon.",
      "publishedAt": "2023-08-14T18:41:26Z",
      "title": "They were alone in a fight to survive. Maui residents had moments to make life-or-death choices",
      "url": "https://apnews.com/8a8bf7e4257c1cedaa161e4002b3e7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/334dc031e945423bbe6deb62f704959f/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — The number of deaths caused by the Maui wildfires stood at 99 Monday, a figure that is likely to increase as search crews comb neighborhoods where flames moved as fast as a mile a minute.",
      "publishedAt": "2023-08-14T10:39:41Z",
      "title": "Number of dead from Maui wildfires reaches 99, as governor warns there could be scores more",
      "url": "https://apnews.com/02ac109a255ef4d9c962c468b5a74360",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/917de0cf440f435d8f08e27d6ca9aa45/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — The unprecedented violence shaking Ecuador claimed the life of another political leader Monday, bringing the number of politics-related slayings within the last four weeks to three, including that of a presidential candidate.",
      "publishedAt": "2023-08-15T04:22:06Z",
      "title": "Political leader in Ecuador is killed less than a week after presidential candidate's assassination",
      "url": "https://apnews.com/14a5fd781e52d31855f3fc4e9711ff84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/297ef12ea7794c58810c5e7f08e22840/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s president called for deeper security cooperation with the U.S. and Japan to address North Korean nuclear threats, saying Tuesday that his upcoming summit with the U.S.",
      "publishedAt": "2023-08-15T04:01:12Z",
      "title": "South Korea's Yoon calls for strong security cooperation with US, Japan ahead of Camp David summit",
      "url": "https://apnews.com/2838b6d97df1e600674ac1e2ab69bd31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e12ec104ab7f4dcc93624a7f0654320a/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and AMY BETH HANSON",
      "description": "HELENA, Mont. (AP) — Young environmental activists scored what experts described as a ground-breaking legal victory Monday when a Montana judge said state agencies were violating their constitutional right to a clean and healthful environment by allowing fossil fuel development.",
      "publishedAt": "2023-08-14T17:24:06Z",
      "title": "Young environmental activists prevail in first-of-its-kind climate change trial in Montana",
      "url": "https://apnews.com/c7fdc1d8759f55f60346b31c73397db0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b486524e5c9467eb418576694980471/2464.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "BRANDON, Miss. (AP) — Six white former Mississippi law officers pleaded guilty on Monday to state charges for torturing two Black men in a racist assault.",
      "publishedAt": "2023-08-14T04:20:05Z",
      "title": "Six former Mississippi officers plead guilty to state charges for torturing two Black men",
      "url": "https://apnews.com/a04261f338812a0aaf43b4b7efa8c944",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53f333bd6b264befa3c8f8747a4c7e89/1920.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "SALT LAKE CITY (AP) — The Utah man accused of making violent threats against President Joe Biden before a trip to Salt Lake City last week pointed a handgun at FBI agents attempting to arrest him, the agency said on Monday.",
      "publishedAt": "2023-08-14T22:28:45Z",
      "title": "Utah man accused of threatening president pointed gun at agents, FBI says",
      "url": "https://apnews.com/4041e4375894c9b942648920cbb83d65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb1a1d208ffc4948967c392c505e4863/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A strong tropical storm lashed central and western Japan with heavy rain and high winds Tuesday, causing flooding and power blackouts and paralyzing air and ground transportation while many people were traveling for a Buddhist holiday week.",
      "publishedAt": "2023-08-15T00:53:50Z",
      "title": "A strong tropical storm is lashing parts of Japan and disrupting holiday travel",
      "url": "https://apnews.com/44e746440df4ca30d30ec3a6cad9dfcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0eba4c3346e4fecb2d65919ef324ab4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}