{
  "articles": [
    {
      "author": "HYUNG-JIN KIM, KIM TONG-HYUNG, TARA COPP and LOLITA C. BALDOR",
      "description": "SEOUL, South Korea (AP) — North Korea was silent about the highly unusual entry of an American soldier across the Koreas' heavily fortified border although it test-fired short-range missiles Wednesday in its latest weapons display.",
      "publishedAt": "2023-07-19T02:44:15Z",
      "title": "North Korea silent about its apparent detention of the US soldier who bolted across the border",
      "url": "https://apnews.com/e16bea3ea33dfedbea61d1f65317be94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50b4f409dc19458cb7e5039b70fb44f4/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A target letter sent to Donald Trump suggests that a sprawling Justice Department investigation into efforts to overturn the 2020 election is zeroing in on him after more than a year of interviews with top aides to the former president and state officials from across the country.",
      "publishedAt": "2023-07-19T04:01:49Z",
      "title": "Trump's target letter suggests the sprawling US probe into the 2020 election is zeroing in on him",
      "url": "https://apnews.com/ab1ad197e9abcb3eb9095237b98bee7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/496b6104372e4300b7a7fcfbe71744b2/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Michigan’s attorney general filed felony charges Tuesday against 16 Republicans who acted as fake electors for then-President Donald Trump in 2020, accusing them of submitting false certificates that confirmed they were legitimate electors despite Joe Biden’s victory in the state.",
      "publishedAt": "2023-07-18T20:35:36Z",
      "title": "Michigan charges 16 fake electors for Donald Trump with election law and forgery felonies",
      "url": "https://apnews.com/df7803fca3862be713d9d6d29fb77e81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce1f7e8d2b8141c4bfd536a3213262d8/2663.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and ANITA SNOW",
      "description": "PHOENIX (AP) — A dangerous 19th straight day of scorching heat in Phoenix set a record for U.S. cities Tuesday, confined many residents to air-conditioned safety and turned the usually vibrant metropolis into a ghost town.",
      "publishedAt": "2023-07-18T00:55:58Z",
      "title": "Phoenix scorches at 110 for 19th straight day, breaking big US city records in global heat wave",
      "url": "https://apnews.com/48e8d06cd7c103f6bfcc4c883efd6543",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/042f1d1781ab4699b5e708c488597c71/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI, ZEKE MILLER and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israel’s figurehead president speaks to Congress in an appearance Wednesday aimed at demonstrating what he calls the “unbreakable bond” between Israel and the United States, despite U.S.",
      "publishedAt": "2023-07-19T04:09:39Z",
      "title": "Israeli president's speech to Congress highlights 'unbreakable bond' despite US unease",
      "url": "https://apnews.com/1a18bd832b44b49ead7dc6a038f1a93c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52791984511b4c358aa939162c13deaa/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MANZANILLO, Mexico (AP) — Lost at sea for months on a disabled catamaran, with no way to cook and no source of fresh water but the rain, Australian Timothy Shaddock said he expected to die.There was a lot to like about the experience, he said.",
      "publishedAt": "2023-07-19T05:28:56Z",
      "title": "Adrift for months, Australian and his dog lived on raw fish until Mexican fishermen rescued them",
      "url": "https://apnews.com/cd1c9f9ab24e46bec984e50e2fea53e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bbf3aecbb8141809bdf0dc780ca8d4c/3000.jpeg"
    },
    {
      "author": "LARRY LAGE",
      "description": "Northwestern has been added to a long list of American universities to face a scandal in athletics and may eventually join the trend of making large payouts following allegations of sexual abuse.",
      "publishedAt": "2023-07-19T04:27:49Z",
      "title": "Northwestern hazing scandal puts school in company with schools such as Penn State",
      "url": "https://apnews.com/fcb2762701e3af096ac929c0d4120a9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e12fbaffc91c42fd9e06635f30f3daa3/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "LOS ALAMOS, N.M. (AP) — The movie about a man who changed the course of the world’s history by shepherding the development of the first atomic bomb is expected to be a blockbuster, dramatic and full of suspense.",
      "publishedAt": "2023-07-19T05:12:34Z",
      "title": "'Oppenheimer' stirs up conflicted history for Los Alamos and New Mexico downwinders",
      "url": "https://apnews.com/85d2b6f57395520a924dd44c492e4c56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a45ce040c8b4f10af4e38d456dd3f81/3000.jpeg"
    },
    {
      "author": "ZEN SOO",
      "description": "HONG KONG (AP) — Chinese livestreamers have set their sights on TikTok shoppers in the U.S. and Europe, hawking everything from bags and apparel to crystals with their eyes on a potentially lucrative market, despite uncertainties over the platform's future in the U.S.",
      "publishedAt": "2023-07-19T04:25:35Z",
      "title": "Chinese livestreamers set their sights on TikTok sales to shoppers in the US and Europe",
      "url": "https://apnews.com/f1ac4a09ac27e0a43d5f304197357fe7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69456679090242a9aa1f900e49f9b538/3000.jpeg"
    },
    {
      "author": null,
      "description": "ST. LOUIS (AP) — The Mega Millions jackpot has risen to an estimated $720 million after no winning ticket was sold — again. It’s now one of two national lotteries with enormous jackpots but equally enormous odds against winning them.",
      "publishedAt": "2023-07-19T05:10:56Z",
      "title": "No winner in Tuesday’s Mega Millions drawing. Jackpot reaches $720 million",
      "url": "https://apnews.com/aaf8f0a57b2799184046f26e256cb28b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/503a02b746a24a978b058d9d861e4b97/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}