{
  "articles": [
    {
      "author": "JALAL BWAITEL",
      "description": "BETHLEHEM, West Bank (AP) — Bethlehem marked another somber Christmas Eve on Tuesday in the traditional birthplace of Jesus under the shadow of war in Gaza.",
      "publishedAt": "2024-12-24T10:33:35Z",
      "title": "Bethlehem marks a second subdued Christmas during the war in Gaza",
      "url": "https://apnews.com/5b92d528fb97c59992c957f56028aadd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee18df363e7c490b9d51b0d0619ed0f1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "TEL AVIV, Israel (AP) — The Palestinian city of Bethlehem is preparing for a somber Christmas Eve under the shadow of war in Gaza, with most festivities cancelled and crowds of tourists absent Tuesday in the Israeli-occupied West Bank.",
      "publishedAt": "2024-12-24T08:34:21Z",
      "title": "Middle East latest: Bethlehem marks a somber Christmas Eve amid war in Gaza",
      "url": "https://apnews.com/0bdae4e84f41628e1f234acb02367dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa31ec11af9a4628b8272061b46cf4eb/1920.jpeg"
    },
    {
      "author": "MATT OTT",
      "description": "WASHINGTON (AP) — American Airlines briefly grounded flights nationwide Tuesday due to a technical problem just as the Christmas travel season kicked into overdrive and winter weather threatened more potential problems for those planning to fly or drive.",
      "publishedAt": "2024-12-24T13:00:36Z",
      "title": "Heavy travel day off to a rough start after American Airlines briefly grounds all flights",
      "url": "https://apnews.com/c666afa120054b032014c6005677aa7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2f8bbb353cc435993de4b8390177166/3000.jpeg"
    },
    {
      "author": "MARTHA MENDOZA and STEFANIE DAZIO",
      "description": "SANTA CRUZ, Calif. (AP) — A major storm pounded California’s central coast on Monday, bringing flooding and high surf that was blamed for fatally trapping a man beneath debris on a beach and later partially collapsing a pier, tossing three people into the Pacific Ocean.",
      "publishedAt": "2024-12-23T22:20:35Z",
      "title": "Major storm pounds California's central coast, blamed for man's death and partially collapsing pier",
      "url": "https://apnews.com/39b4acb32a8baab53289d4cd990f9311",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde84eeef59c496a879044e527a4d72e/1920.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "Caitlin Clark raised the profile of women's basketball to unprecedented levels in both the college ranks and the WNBA, and Tuesday she was named the AP Female Athlete of the Year for her impact on and off the court.",
      "publishedAt": "2024-12-24T14:01:49Z",
      "title": "Caitlin Clark honored as AP Female Athlete of the Year following her impact on women's sports",
      "url": "https://apnews.com/7e5aa066120ee2b1f85b6ab1098b7a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b7323e758db41d0a0f21428db467476/3000.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS",
      "description": "KURUKKAL MADAM, Sri Lanka (AP) — Pulled from the mud as an infant after the devastating Indian Ocean tsunami in 2004, and reunited with his parents following an emotional court battle, the boy once known as “Baby 81” is now a 20-year-old dreaming of higher education.",
      "publishedAt": "2024-12-24T04:22:45Z",
      "title": "20 years after the Indian Ocean tsunami, a boy found in the mud embraces being known as 'Baby 81'",
      "url": "https://apnews.com/fe6edec6968f1b90382c1288bb5f86a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4001fc099c1445ccaad5cd986e8b2fe5/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISTANBUL (AP) — An explosion at an ammunition factory in northwest Turkey left 11 dead and five injured Tuesday morning.The blast occurred in Balikesir province, according to the state-run Anadolu Agency.",
      "publishedAt": "2024-12-24T07:51:22Z",
      "title": "A blast at a Turkish ammunition factory kills 11 people",
      "url": "https://apnews.com/e02c91844a167a3aa63681ed96793206",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e936c51b23964460b8ab861e45af498c/1920.jpeg"
    },
    {
      "author": "ANGELA CHARLTON",
      "description": "PARIS (AP) — France’s president and prime minister managed to form a new government just in time for the holidays.",
      "publishedAt": "2024-12-24T12:20:46Z",
      "title": "France has a new government, again. Politics and crushing debt complicate next steps",
      "url": "https://apnews.com/96bb8e0e1740bdaf49d98cece0fac28a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f334d31db5e44ec28824ae5fd8a731db/2970.jpeg"
    },
    {
      "author": "LISA MASCARO and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The House Ethics Committee's long-awaited report on Matt Gaetz documents a trove of salacious allegations, including sex with an underage girl, that tanked the Florida Republican's bid to lead the Justice Department.",
      "publishedAt": "2024-12-23T20:25:08Z",
      "title": "Inside the Gaetz ethics report, a trove of new details alleging payments for sex and drug use",
      "url": "https://apnews.com/7e0500a0d526299c525df77341b4db28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d331d7fc20f84c479ba9465549f66ef8/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Shyam Benegal, a renowned Indian filmmaker known for pioneering a cinema movement that tackled social issues in the 1970s, has died after chronic kidney disease. He was 90.His contribution to cinema was recognized as a director, editor and screenwriter.",
      "publishedAt": "2024-12-24T06:55:07Z",
      "title": "Legendary Indian filmmaker Shyam Benegal dies at age 90",
      "url": "https://apnews.com/944d5a1866f126364ef0fd5b22c4c149",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50ee5d3ffa1a4a93a43a88a21c1074fc/2896.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}