{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, JOSH BOAK and ZEKE MILLER",
      "description": "WEST ALLIS, Wisconsin (AP) — A roaring crowd of battleground state voters greeted Vice President Kamala Harris on Tuesday as she opened her public case against Republican former President Donald Trump by declaring November's election will be \"a choice between freedom and chaos.”",
      "publishedAt": "2024-07-23T09:02:08Z",
      "title": "Harris tells roaring Wisconsin crowd November election is 'a choice between freedom and chaos'",
      "url": "https://apnews.com/012c6474b8b23960d2cf616e92989a4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52a393bdfb0045e89abe4d07fa19819e/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is zeroing in on four potential candidates as she races to choose a running mate for her fledgling campaign, fast-tracking a process that usually takes months but must be finalized in only a few weeks.",
      "publishedAt": "2024-07-23T18:19:38Z",
      "title": "Kamala Harris faces a major test as she looks for a running mate for her White House run",
      "url": "https://apnews.com/7c968f2f7ed9471223bd00d909383902",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a0123924db4839b6a05a26f7b00dd6/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, CLAUDIA LAUER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Two local law enforcement officers stationed in the complex of buildings where a gunman opened fire at former President Donald Trump left to go search for the man before the shooting, the head of Pennsylvania State Police said Tuesday, raising questions about whether a key post was left unattended as the shooter climbed onto a roof.",
      "publishedAt": "2024-07-23T21:41:26Z",
      "title": "Officers left post to go look for Trump rally gunman before shooting, state police boss says",
      "url": "https://apnews.com/2f887d537c34a798019c6f430dcdbfb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fbdc1cd09684457ada89c305973eee6/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The director of the Secret Service resigned Tuesday in the aftermath of the assassination attempt on former President Donald Trump that unleashed an outcry about how the agency failed in its core mission to protect current and former presidents.",
      "publishedAt": "2024-07-23T14:35:05Z",
      "title": "Secret Service director steps down after assassination attempt against ex-President Trump at rally",
      "url": "https://apnews.com/8b1b13cece2ff25590c81093032dceb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df38b28938f4f368cd3a21d06b4bc46/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and MATT OTT",
      "description": "U.S. regulators are investigating why Delta Air Lines failed to recover as quickly as other airlines from a global technology breakdown and whether Delta's treatment of passengers stranded by canceled and delayed flights violated federal rules.",
      "publishedAt": "2024-07-23T14:19:22Z",
      "title": "US is investigating Delta's flight cancellations and faltering response to global tech outage",
      "url": "https://apnews.com/7361e641fe2c656d7fba06e4a0424c6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77a346000d0748368b469f1cda96b64f/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — State election directors from across the country voiced serious concerns to a top U.S. Postal Service official Tuesday that the system won't be able to handle an expected crush of mail-in ballots in the November election.",
      "publishedAt": "2024-07-23T23:58:20Z",
      "title": "State election directors fear the Postal Service can't handle expected crush of mail-in ballots",
      "url": "https://apnews.com/a8ee9b88418e1f6b2835e91827d721bf",
      "urlToImage": ""
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Protesters against the Gaza war staged a sit-in at a congressional office building Tuesday ahead of Israeli Prime Minister Benjamin Netanyahu's address to Congress, with Capitol Police making multiple arrests.",
      "publishedAt": "2024-07-23T20:50:24Z",
      "title": "Demonstrators stage mass protest against Netanyahu visit and US military aid to Israel",
      "url": "https://apnews.com/ea95b56f33258d749d0dae7f50b875fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58aba8d56d8b45658d70f60180150d09/1920.jpeg"
    },
    {
      "author": "MIKE CATALINI and MARY CLARE JALONICK",
      "description": "TRENTON, N.J. (AP) — U.S. Sen. Bob Menendez will resign Aug. 20 following his conviction for taking bribes for corrupt acts including acting as an agent of the Egyptian government, he wrote in a letter to New Jersey's governor obtained by The Associated Press.",
      "publishedAt": "2024-07-23T18:26:39Z",
      "title": "US Sen. Bob Menendez of New Jersey is resigning from office following his corruption conviction",
      "url": "https://apnews.com/a4fa9bc8fe623c9bac97c10c91fb9f07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76562c0ec6aa44c6a68bd981d3f0fbd7/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — An Iowa judge has ruled the state's strict abortion law will take effect Monday, preventing most abortions after about six weeks of pregnancy, before many women know they are pregnant.",
      "publishedAt": "2024-07-23T15:41:43Z",
      "title": "Iowa law banning most abortions after six weeks of pregnancy to take effect Monday",
      "url": "https://apnews.com/b512e24eeea4e7a40cdabece4d9d3b01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d577c05fb0445c6a4433f02f5202b1b/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH and EDDIE PELLS",
      "description": "Lydia Jacoby was a breakout star in the pool for the United States at the last Summer Games, earning a gold medal in the 100-meter breaststroke and a relay silver.",
      "publishedAt": "2024-07-23T10:00:24Z",
      "title": "Biles, Osaka and Phelps spoke up about mental health. Has anything changed for the Paris Olympics?",
      "url": "https://apnews.com/891c2dc08b59a3ccb0b15ffeca239089",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/058e6a7631554a4abcd78e331c2423c6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}