{
  "articles": [
    {
      "author": "EMMA BURROWS and AAMER MADHANI",
      "description": "WASHINGTON (AP) — A preliminary U.S. intelligence assessment concluded that the plane crash presumed to have killed Russian mercenary leader Yevgeny Prigozhin was intentionally caused by an explosion as Russian President Vladimir Putin on Thursday eulogized the man who staged the biggest challenge to his 23-year rule.",
      "publishedAt": "2023-08-24T07:33:57Z",
      "title": "US intelligence says an intentional explosion brought down Wagner chief Prigozhin’s plane",
      "url": "https://apnews.com/382515214f691e47daa2e3635d64e612",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4e802c7f5dc4b7cb14df152b7732f5b/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "FAIRFAX, Va. (AP) — In a secluded stairwell at CIA headquarters last year, officer trainee Ashkan Bayatpour came up behind a colleague, wrapped a scarf around her neck and plainly spoke as he tried to kiss her on the mouth.",
      "publishedAt": "2023-08-24T15:16:12Z",
      "title": "CIA stairwell attack among flood of sexual misconduct complaints at spy agency",
      "url": "https://apnews.com/8ca2f3a4b41c9d6f3da34364aea42dad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e467478b70bf412a9fa79e0bba142d8b/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, KATE BRUMBACK and JILL COLVIN",
      "description": "ATLANTA (AP) — Donald Trump was set to turn himself in Thursday to authorities in Georgia on charges that he illegally schemed to overturn the 2020 election in that state, a county jail booking expected to yield a historic first: a mug shot of a former American president.",
      "publishedAt": "2023-08-24T04:42:08Z",
      "title": "Trump is set to surrender at a Georgia jail on charges he sought to overturn his 2020 election loss",
      "url": "https://apnews.com/7f4e9860859fbb71221b6a5163aaa42f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dce437a267d14d1c8824e962c8d3fdac/3000.jpeg"
    },
    {
      "author": "SUDHIN THANAWALA and KATE BRUMBACK",
      "description": "ATLANTA (AP) — Hours before former President Donald Trump was expected to turn himself in at the Fulton County Jail on charges related to his efforts to remain in power after his 2020 election loss, dozens of his supporters had already gathered Thursday morning outside the facility.",
      "publishedAt": "2023-08-24T16:30:47Z",
      "title": "Scores of Trump fans gather outside Georgia jail to show support ahead of his expected surrender",
      "url": "https://apnews.com/c30e4836e3d9f2c9751cc38a6975c2bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cac9adc38c04357a671609392848535/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and NICHOLAS RICCARDI",
      "description": "Former President Donald Trump and Florida Gov. Ron DeSantis have dominated the Republican presidential nomination fight for much of the year. Neither dominated the debate stage Wednesday night.Trump, of course, decided to skip the GOP’s opening presidential primary debate given his overwhelming lead in the polls.",
      "publishedAt": "2023-08-24T02:08:08Z",
      "title": "Vivek Ramaswamy takes center stage, plus other key moments from the first Republican debate",
      "url": "https://apnews.com/f38e0aa189ad85f347f97b1b6bea4c53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c77420d660f04081844efced968fa422/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — The eight Republican presidential candidates on the debate stage were asked to raise their hands if they believed human behavior is causing climate change.",
      "publishedAt": "2023-08-24T16:53:19Z",
      "title": "Presidential debate shows how GOP candidates are struggling to address concerns about climate change",
      "url": "https://apnews.com/6d8ff0b9fd9a57cf0659a6f973a107ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3d52486a66e47b89c9a959f22f787e9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Dominican Republic was starting to get back on its feet Thursday after Tropical Storm Franklin raked the island nation, with heavy flooding that killed at least two people.",
      "publishedAt": "2023-08-24T18:02:02Z",
      "title": "Dominican's recovery, penguin peril and GOP denial: What to know about extreme weather now",
      "url": "https://apnews.com/ca9d54195391ee5a2f9306b36cbcd96a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad239a9f332a4608bc260fd58bc9777d/3000.jpeg"
    },
    {
      "author": "EUGENE GARCIA, AMY TAXIN and JOHN ANTCZAK",
      "description": "TRABUCO CANYON, Calif. (AP) — The cover band at the historic Southern California biker bar had just launched into their next song when the gunman walked in and opened fire. Some froze, others ran as the bullets flew inside busy Cook's Corner, which was holding its weekly spaghetti night on Wednesday.",
      "publishedAt": "2023-08-24T03:57:17Z",
      "title": "3 dead, 6 wounded after a retired police officer opens fire at a Southern California biker bar",
      "url": "https://apnews.com/be474bdb916250261808d34cc20f67b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d3661fd721443ee835779e6cff7e089/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH and STEPHEN WHYNO",
      "description": "WASHINGTON (AP) — Washington Nationals pitcher Stephen Strasburg has decided to retire, ending a career that began as a No. 1 draft pick, included 2019 World Series MVP honors and was derailed by injuries, according to a person with knowledge of the situation.",
      "publishedAt": "2023-08-24T19:13:58Z",
      "title": "World Series MVP Stephen Strasburg has decided to retire, AP source says",
      "url": "https://apnews.com/c5bc77f369819b602218a795be8414ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/474effea216a47e09c90aca13cc80bf6/3000.jpeg"
    },
    {
      "author": "KRYSTA FAURIA and ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Fran Drescher believes that the walkouts that have shut down Hollywood are about something much bigger than the actors union she leads, or the writers striking alongside them, or the entertainment industry.",
      "publishedAt": "2023-08-24T18:26:46Z",
      "title": "Fran Drescher says actors strike she's leading is an 'inflection point' that goes beyond Hollywood",
      "url": "https://apnews.com/ec62ce74813caa12ec11f72a0b48bc17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8911533abba546b887a6a484e76485da/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}