{
  "articles": [
    {
      "author": null,
      "description": "Israel’s air force carried out dozens of airstrikes early Monday on southern Lebanon, state media and the Israeli military said.Separately, Israeli airstrikes on the Gaza Strip killed eight Palestinians, including five children, on Monday morning, according to Palestinian medical officials.",
      "publishedAt": "2024-09-23T05:00:08Z",
      "title": "Israel-Hamas war latest: Israel's air force launches dozens of airstrikes on southern Lebanon",
      "url": "https://apnews.com/f98720a8ba13ea1239c0b8a24522aeb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22c3bb53a1a54ec6b27ca2d40036d35c/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — For almost a week, ophthalmologist Elias Jaradeh has worked around the clock, trying to keep up with the flood of patients whose eyes were injured when pagers and walkie-talkies exploded en masse across Lebanon.",
      "publishedAt": "2024-09-23T04:05:59Z",
      "title": "Lebanese doctor races to save the eyes of those hurt by exploding tech devices",
      "url": "https://apnews.com/1ef861481aa43c86bfede3781734a85a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3d4d269d0e348d090f435c1888ac4aa/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — One presidential candidate is talking up gun ownership and promising tough border security measures. The other vows to cap credit card interest rates and force insurance companies to cover in vitro fertilization.",
      "publishedAt": "2024-09-23T04:02:43Z",
      "title": "Harris owns a gun? Trump wants to cap credit card rates? Party lines blur in campaign's last stretch",
      "url": "https://apnews.com/87cd75cfa0d82b0e2b026c69278ff912",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f8e20944e9941aaa1c85b9bc4a90d2d/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders announced an agreement Sunday on a short-term spending bill that will fund federal agencies for about three months, averting a possible partial government shutdown when the new budget year begins Oct.",
      "publishedAt": "2024-09-22T21:12:35Z",
      "title": "Spending deal averts a possible federal shutdown and funds the government into December",
      "url": "https://apnews.com/d51de0cd895db687a6f5b35fc0dab13e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae6c212d82304e67bace5f33d2b0de9e/2479.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "BIRMINGHAM, Ala. (AP) — Authorities have reported no immediate arrests after a weekend mass shooting killed four people and left 17 others injured in what police described as a targeted “hit” by multiple shooters who opened fire outside a popular Alabama nightspot.",
      "publishedAt": "2024-09-23T04:03:59Z",
      "title": "Search underway for suspects in Alabama mass shooting that killed 4 and injured 17",
      "url": "https://apnews.com/ca21a844e8363ddc8b38c89964194953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09d2068f414c49bea79a56a88c8f815f/2664.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM and TARA COPP",
      "description": "SCRANTON, Pa. (AP) — Under tight security, Ukrainian President Volodymyr Zelenskyy on Sunday visited a Pennsylvania ammunition factory to thank the workers who are producing one of the most critically needed munitions for his country's fight to fend off Russian ground forces.",
      "publishedAt": "2024-09-22T20:24:26Z",
      "title": "Ukraine's Zelenskyy visits Pennsylvania ammunition plant to thank workers and ask for more",
      "url": "https://apnews.com/c0e1fe5ebfa11ecfe92e842860e6440c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6032480d1494a86bd1716502933b6f2/1920.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — As world leaders meeting in the United Nations this week discuss the future of efforts to rein in the gangs strangling Haiti, Haitians are expressing hopelessness that an international response can turn the tide of violence.",
      "publishedAt": "2024-09-22T22:18:29Z",
      "title": "As UN meets, Haitians express hopelessness at finding an international solution to gang crisis",
      "url": "https://apnews.com/a4f5e12483887b84637ac5e0f62cd8b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/133bbb555e4c4dc08c0f67a808656b25/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — At only 6 years old, Esai Reed has endured three emergency evacuations from orphanages across Haiti as gangs pillage and plunder their way through once peaceful communities.",
      "publishedAt": "2024-09-23T05:04:12Z",
      "title": "Families from Tennessee to California seek humanitarian parole for adopted children in Haiti",
      "url": "https://apnews.com/ddfac1a89699b90c6027ea9cc8275236",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1103104e79c84a0b8892e8eb8502e879/3000.jpeg"
    },
    {
      "author": null,
      "description": "SACRAMENTO, Calif. (AP) — “Paper or plastic” will no longer be a choice at grocery store checkout lines in California under a new law signed Sunday by Gov. Gavin Newsom that bans all plastic shopping bags.",
      "publishedAt": "2024-09-22T20:13:11Z",
      "title": "California governor signs law banning all plastic shopping bags at grocery stores",
      "url": "https://apnews.com/406dedf02b416ad2bb302f498c3bce58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d8d093a98e144ffbda54440cb8690ee/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — France has sent a group of special anti-riot police that's been banned for 65 years to the French Caribbean island of Martinique, where protesters have gathered despite the government barring demonstrations in parts of the island.",
      "publishedAt": "2024-09-22T16:59:50Z",
      "title": "Long-forbidden French anti-riot force sent to Martinique as thousands defy bans on protests",
      "url": "https://apnews.com/46fbdb23a02ebeb3e76cc1d632c53929",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2247b0e3ec7542af8d6db3ef70e6161f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}