{
  "articles": [
    {
      "author": "Zeke Miller, Josh Boak, Rob Gillies",
      "description": "President Donald Trump says 25% tariffs on imports from Mexico and Canada will start Tuesday, sparking renewed fears of a North American trade war. He announced the coming tariffs at the White House on Monday. He says the tariffs are to force the two U.S. neighbors to step up their fight against fentanyl trafficking into the U.S. Trump provided a one-month delay in February as both countries promised concessions. But Trump said Monday that there was “no room left for Mexico or for Canada” to avoid the steep new tariffs. U.S. stock markets moved sharply lower after Trump’s comments. Trump said he would also add on another 10% tariff on goods from China, on top of the initial 10% he put in place last month.",
      "publishedAt": "2025-03-03T20:10:32Z",
      "title": "Trump says 25% tariffs on Mexican and Canadian imports will start Tuesday, with 'no room' for delay",
      "url": "https://apnews.com/article/trump-tariffs-mexico-canada-b19e004dddb579c373b247037e04424b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2de9ba8/2147483647/strip/true/crop/6967x3919+0+363/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fec%2F09d0b45270936209a512734bf7e3%2Fcfbaba9369854f78a2bfd7a4cc3f85d4"
    },
    {
      "author": "The Associated Press",
      "description": "Chip giant Taiwan Semiconductor Manufacturing Co. plans to invest $100 billion in the United States, President Donald Trump announced Monday as he appeared with the company’s head at the White House.",
      "publishedAt": "2025-03-03T07:36:00Z",
      "title": "Live updates: Trump and TSMC CEO announce $100B chip manufacturing expansion in US",
      "url": "https://apnews.com/live/donald-trump-news-updates-3-3-2025#00000195-5de1-d9ec-a795-ddf52b410000",
      "urlToImage": "https://dims.apnews.com/dims4/default/e172006/2147483647/strip/true/crop/5153x2899+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F1b%2F47dcc3fe3e09f7a25e3e79b4c8eb%2Fc58bce8c1b374b81ad7bf0a7bbcdc356"
    },
    {
      "author": "Alan Suderman",
      "description": "Cryptocurrency prices jumped after President Donald Trump’s surprise announcement he wants the U.S. government to purchase and hold a variety of digital assets in a strategic reserve fund, an announcement that highlights Trump’s growing attempts to use volatile cryptocurrency prices as a barometer of his public support. Trump said on social media Sunday that his administration is working toward creating a “Crypto Strategic Reserve” that will include lesser-known cryptocurrencies XRP, solana, and cardano. He later followed up with another post saying his planned reserve would also include bitcoin and ether, the two most popular cryptocurrencies.",
      "publishedAt": "2025-03-03T16:34:16Z",
      "title": "Trump sends crypto prices soaring after announcement of strategic government reserve",
      "url": "https://apnews.com/article/trump-crypto-bitcoin-digital-assets-reserve-2f4246434a657f248cd85296f14382f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/562d722/2147483647/strip/true/crop/4559x2564+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F85%2Fe9b135450e27bc5fd818cfce3945%2Fb3ffa50ae75e4b14a8d12fee64758bc4"
    },
    {
      "author": "Didi Tang, Michelle L. Price",
      "description": "Chip giant Taiwan Semiconductor Manufacturing Co. plans to invest an additional $100 billion in the United States, President Donald Trump announced Monday as he appeared with the company’s head at the White House. TSMC, the world’s biggest semiconductor manufacturer, produces chips for companies including Apple, Intel and Nvidia. The company had already announced plans to invest more than $65 billion in the U.S., including three plants in Arizona after the Biden administration offered billions in subsidies. Its first factory in Arizona has started mass production of its 4-nanometer chips. Trump and TSMC’s chief executive officer C. C. Wei said the $100 billion is on top of the $65 billion that was already announced.",
      "publishedAt": "2025-03-03T17:16:46Z",
      "title": "Trump to make investment announcement as he meets with TSMC CEO",
      "url": "https://apnews.com/article/trump-tsmc-chip-manufacturing-tariffs-42980704ffca62e823182422ee4b7b83",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a8b0cc/2147483647/strip/true/crop/8258x4645+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2Fc4%2Fea58a962d0de6a62ada300ad6199%2F4741da9a501a4b77ad8bb7200ce40c9d"
    },
    {
      "author": "Sylvia Hui",
      "description": "Britain’s King Charles III has welcomed Canadian Prime Minister Justin Trudeau as the monarch faces criticism in Canada over being silent about President Donald Trump’s repeated suggestions that the U.S. annex its northern neighbor. While royal officials did not provide details about the private talks Monday at the monarch’s royal residence, the king and Trudeau were expected to discuss Trump’s comments about making Canada the 51st state. Charles is the head of state in Canada, a member of the British Commonwealth of former colonies. Britain’s monarchs must remain politically neutral, but the Canada issue shows how delicate that balancing act can be.",
      "publishedAt": "2025-03-03T14:50:40Z",
      "title": "King Charles III welcomes Canada's Trudeau for talks overshadowed by Trump's annexation comments",
      "url": "https://apnews.com/article/king-charles-trudeau-canada-trump-a475587880917f210c8aa40d252e790d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e1ac49/2147483647/strip/true/crop/4855x2731+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F5d%2F39c43a484f6f1f97e15c06e183c8%2F323f00dcaf3846e8ad7e15f3ad3f99ce"
    },
    {
      "author": "Chris Megerian",
      "description": "Federal employees face a midnight deadline to comply with Elon Musk’s second demand for reports on their recent accomplishments. The request has become a flashpoint within the government workforce. Musk and President Donald Trump have suggested that employees who don’t comply could get fired. They’ve also described the requirement — a list of five things that each person did last week — as an unobjectionable way to increase accountability within a sprawling bureaucracy. But for many workers, it’s been a source of anxiety and confusion as the new administration tightens its grip on the federal government. Judging by instructions that have circulated in recent days, they’ll face a standing request for lists of accomplishments every Monday.",
      "publishedAt": "2025-03-03T19:27:40Z",
      "title": "Federal workers face second Musk deadline to explain their work last week",
      "url": "https://apnews.com/article/elon-musk-doge-emails-a3e7e9ab82f45bb15ef22bddab01f25e",
      "urlToImage": "https://dims.apnews.com/dims4/default/057b6cd/2147483647/strip/true/crop/5167x2906+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F15%2Fb3861ed8f5348549a1dd3ba62bf1%2Fc92bbd40198a41a0bd690c265f294b1f"
    },
    {
      "author": "Sophia Tareen",
      "description": "An Illinois man pleaded guilty Monday to killing seven people and injuring dozens more when he opened fire on a 2022 Independence Day parade in a Chicago suburb, a stunning development moments before opening statements in his trial on murder and attempted murder charges. Appearing in a Lake County circuit courtroom, Robert E. Crimo III, withdrew his earlier not-guilty plea in the Highland Park shooting. The judge said with the plea change, there would be no trial or further motions on the case. Sentencing will come April 23, but Crimo is certain to spend life behind bars. He was charged with 21 counts of first-degree murder, and the maximum sentence for each count is natural life in prison.",
      "publishedAt": "2025-03-03T05:06:07Z",
      "title": "Man pleads guilty to murder and attempted murder in shooting at suburban Chicago July 4 parade",
      "url": "https://apnews.com/article/highland-park-july-fourth-shooting-trial-f0c8cb10dc26c9c741be6a519b409a9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7bf175/2147483647/strip/true/crop/7960x4478+0+414/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2F35%2F7533a29d402ab684c43d3242e5c6%2Ffcdbcf6bd4914c6692ca0dde59ea2da8"
    },
    {
      "author": "Paul Wiseman, Christopher Rugaber",
      "description": "When Donald Trump started the biggest trade war since the 1930s in his first term, his impulsive combination of threats and import taxes on U.S. trading partners created chaos, generated drama -- and drew criticism from mainstream economists who favor free trade. But it didn’t do much damage to the U.S. economy. Or much good. The trade war sequel that Trump has said he’s planned for his second term could likely be costlier. Trump seems to have grander ambitions and is operating in a far more treacherous economic environment, one in which his tariffs risk rekindling inflation.",
      "publishedAt": "2025-03-03T18:13:31Z",
      "title": "Trump’s tariff tactics carry higher economic risks than during his first term",
      "url": "https://apnews.com/article/trump-tariff-mexico-canada-inflation-1123ada61916502324ca830347ed8d14",
      "urlToImage": "https://dims.apnews.com/dims4/default/939bc37/2147483647/strip/true/crop/5773x3247+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F48%2F7bb0906befc0bd8bcaeea4399183%2F6fe503578d3c40e7bfd8dfc83c2d9eb7"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump has slammed Ukrainian President Volodymyr Zelenskyy for suggesting that the end of Russia’s war against Ukraine likely “is still very, very far away.\" Trump in a post on his social media platform Monday said the comment was \"the worst statement that could have been made by Zelenskyy, and America will not put up with it for much longer!” Zelenskyy late Sunday said it would take time to come to an agreement to end the war, which he believed would go on for some time. At the same time, he tried offering a positive take on the U.S.-Ukraine relationship in the aftermath of his contentious White House meeting with the Republican president and Vice President JD Vance.",
      "publishedAt": "2025-03-03T17:17:13Z",
      "title": "Trump slams Zelenskyy for saying the end of the Russia war ‘is still very, very far away’",
      "url": "https://apnews.com/article/trump-zelenskyy-russia-ukraine-a15a459c9a3a393d040478ebbe250a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e60696/2147483647/strip/true/crop/5406x3041+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F11%2Fbd228bd69da23a0d1c8d54177126%2Fa042713247604b1d960387634a3a2abf"
    },
    {
      "author": "Samya Kullab",
      "description": "Ukraine’s president has few options after last week’s astonishing Oval Office row with U.S. President Donald Trump, who berated the wartime leader. Now Ukraine’s future could depend on whether Volodymyr Zelenskyy can repair his relationship with the White House. The heated conversation that played out live on television looms over all American support for Ukraine and could shape the country’s war against the Russian invasion. The scene will almost certainly stick with Zelenskyy for the rest of his presidency, if not his life. American officials have said that they want an apology from Zelenskyy. He has maintained his cool in public appearances since the episode and leaned into European support.",
      "publishedAt": "2025-03-03T20:01:39Z",
      "title": "Without US help, Zelenskyy has few options except to repair his relationship with the White House",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-meeting-30be085063f4f6f3df242553402234f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e69b517/2147483647/strip/true/crop/3000x1688+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F8c%2F7e65d1240d29388e8372d6f5fa67%2F07755a3d2a3f425c842ffb2e5adafd88"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}