{
  "articles": [
    {
      "author": null,
      "description": "The search is continuing for more than 160 people believed to be missing in Texas days after a destructive wall of water killed over 100 people. But questions remain about the extent of a catastrophe that stretched far past the borders of a single summer camp. Texas Gov. Greg Abbott says many of those who are not accounted for were staying in the state’s Hill Country but did not register at a camp or hotel. Abbott says search crews will not stop working until everyone is located. He says the 161 missing are believed to be in Kerr County. That's where most of the victims have been recovered.",
      "publishedAt": "2025-07-09T05:50:22Z",
      "title": "Search continues for more than 160 missing after deadly Texas flash floods",
      "url": "https://apnews.com/article/texas-floods-missing-deaths-16b0dfef4509cfef5a92a0c0598dc562",
      "urlToImage": "https://dims.apnews.com/dims4/default/938d0af/2147483647/strip/true/crop/8212x4619+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2Fa6%2F16b7ddabcb08bef60ae81ddd60f0%2Fec29cd39225c4d60993963ad9dac2810"
    },
    {
      "author": null,
      "description": "Texas inspectors approved Camp Mystic’s emergency plan just two days before devastating floods killed over 27 people, mostly children, at the Texas summer camp. Records released Tuesday show the camp met state regulations for disaster procedures, but details of the plan remain unclear. On July 4, torrential rain caused the Guadalupe River to rise rapidly, overwhelming the camp. Survivors clung to trees as cabins and tents were swept away. Despite warnings and nearby camps evacuating, Camp Mystic did not relocate its 557 campers and 100 staff. Questions remain about the camp’s preparedness and response during the disaster.",
      "publishedAt": "2025-07-08T23:50:51Z",
      "title": "Texas inspectors approved Camp Mystic’s disaster plan 2 days before deadly flood, records show",
      "url": "https://apnews.com/article/camp-mystic-floods-state-inspection-ef17d51dc7868fa9cc5c3076c31ed98a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a5200f/2147483647/strip/true/crop/8231x4630+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F55%2F4005d539e9b05d1eccfeddbe7c96%2F78581767e77d454fbcb729d43cffd7e4"
    },
    {
      "author": null,
      "description": "Officials say a union representing thousands of city workers in Philadelphia and the city have reached a deal to end a more than weeklong strike that halted residential curbside trash pickup and affected other services. Word of the tentative agreement came early Wednesday, on what would have been the ninth day of the strike. Nearly 10,000 blue-collar employees from District Council 33 of the American Federation of State, County and Municipal Employees had walked off the job July 1, seeking better pay and benefits after failing to agree with the city on a new contract. District Council 33 is the largest of four major unions representing city workers. Its membership includes 911 dispatchers, trash collectors, water department workers and many others.",
      "publishedAt": "2025-07-09T09:50:21Z",
      "title": "Philadelphia workers and city reach deal to end strike",
      "url": "https://apnews.com/article/philadelphia-labor-strike-ends-trash-pool-services-4f0687603189776d89b241f59e6e66f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/34d0022/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F90%2F640464fc0fb758702069e7a095a8%2F9a3a5917fe3d4cf582b7c9cf5cf1bd62"
    },
    {
      "author": null,
      "description": "President Donald Trump’s decision to send more defensive weapons to Ukraine came after he privately expressed frustration with Pentagon officials for announcing a pause last week in the delivery of some critical weapons to Ukraine. It was a move that Trump felt wasn’t properly coordinated with the White House. That's according to three people familiar with the matter who requested anonymity to discuss the private deliberations. The Pentagon announced that it would hold back delivering to Ukraine some weapons because of what U.S. officials said were concerns that stockpiles were in short supply. Trump later effectively reversed the move. One of the people described Trump as being caught “flat footed” by the announcement.",
      "publishedAt": "2025-07-08T18:51:22Z",
      "title": "Trump caught off guard by Pentagon move to pause Ukraine weapons deliveries",
      "url": "https://apnews.com/article/trump-ukraine-weapons-pentagon-15694071ddb6f7040273e9ef090e84c4",
      "urlToImage": "https://dims.apnews.com/dims4/default/e996eca/2147483647/strip/true/crop/5297x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F90%2F410b1709e7520f1420901364abaa%2F6f2161743bcc4b8bac8c393c836c81bd"
    },
    {
      "author": null,
      "description": "Ukraine's air force says that Russia has fired a record 728 Shahed and decoy drones at Ukraine overnight as well as 13 missiles. It was the latest escalation amid mounting Russian aerial attacks in the more than three-year war. Ukrainian President Volodymyr Zelenskyy said Wednesday that the city of Lutsk in Ukraine’s northwest that borders Poland and Belarus was the hardest hit. Ten other regions were also struck. Lutsk is home to airfields used by the Ukrainian army. Cargo planes and fighter jets routinely fly over the city. An air force statement said that Ukraine’s air defenses shot down 296 drones and seven missiles while 415 more drones were lost from radars or jammed.",
      "publishedAt": "2025-07-09T07:11:09Z",
      "title": "Russia launches record drone attack on Ukraine",
      "url": "https://apnews.com/article/russia-record-drone-attack-ukraine-war-fe3d23673b9b5696bb5097def9ed0775",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d9f5f8/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F0a%2Fd5f871b3bcad0cc64f9e4888004b%2F47f16d779dc349b29a8a962d69325909"
    },
    {
      "author": null,
      "description": "As talks for a ceasefire in the Gaza Strip resume, Palestinians in the battered enclave say they are desperate for deal to end the war between Israel and Hamas. At least 40 Palestinians were killed overnight, according to Nasser Hospital in the southern city of Khan Younis. The strikes come as Israeli Prime Minister Benjamin Netanyahu is in Washington meeting U.S. President Donald Trump. Israel and Hamas are considering a new U.S.-backed ceasefire proposal that would pause the war, free Israeli hostages and send much-needed aid into Gaza.",
      "publishedAt": "2025-07-09T09:11:28Z",
      "title": "40 Palestinians killed in Gaza as Netanyahu and Trump meet over a ceasefire",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-09-2025-b70b2de81552e38b98be7e54cf2efd9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9524ee/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F28%2Fb21fe677271443d4a08c02fd9e0d%2Faaa4713aa45a483ea29607167ccc8f19"
    },
    {
      "author": null,
      "description": "Hundreds of thousands of workers in India went on strike, opposing Prime Minister Narendra Modi's privatization plans and economic reforms. Organized by 10 major trade unions and farmer groups, Wednesday's strike disrupted coal mining, banking, insurance, and public services, according to workers’ unions. Protestors blocked railways and highways, with rallies reported in cities like Kolkata and Mumbai. Shops, schools, and roads were shut in some states, including Kerala and Odisha. Workers demand higher wages, job security, and a halt to privatization. Modi's government has pushed reforms to attract foreign investment, but unions argue these suppress workers' rights and call for the laws to be scrapped.",
      "publishedAt": "2025-07-09T09:47:02Z",
      "title": "Indian workers go on a daylong nationwide strike against Modi's economic reforms",
      "url": "https://apnews.com/article/india-trade-union-strike-bharat-bandh-modi-22ca35310efee7a4eebb238782fdcb0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4090e4/2147483647/strip/true/crop/7548x4246+0+393/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fd8%2F2cb3090a20c0b55fd144e2fa99b9%2F3e445c0b5e3a48559c1e80058678c685"
    },
    {
      "author": null,
      "description": "Rescuers are searching for survivors after Yemen's Houthi rebels attacked a Liberian-flagged cargo ship, Eternity C, in the Red Sea. Authorities report at least three mariners were killed and two injured. The attack on the Greek-owned Eternity C occurred Monday night as it traveled toward the Suez Canal. The ship sustained significant damage, lost propulsion, and is now drifting. Five crew members have been rescued so far. This follows another Houthi attack on a vessel Sunday, marking their first assaults on shipping in the region since 2024. The U.S. and EU have condemned the attacks, citing threats to maritime security.",
      "publishedAt": "2025-07-09T08:43:07Z",
      "title": "Rescuers search for survivors after Houthi attack on cargo ship in the Red Sea",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-eternity-c-0ada222883158dd248b0d844543736c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bb0c1c/2147483647/strip/true/crop/4901x2757+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2F2b%2F461e01d0628ea74b93294793390c%2F63ed867b6adb413399d7636f7220b476"
    },
    {
      "author": null,
      "description": "The last time President Donald Trump rolled out tariffs this high, financial markets quaked, consumer confidence crashed and his popularity plunged. Only three months later, he’s betting this time is different. In his new round of tariffs being announced this week, Trump is essentially tethering the entire world economy to his instinctual belief that import taxes will deliver factory jobs and stronger growth in the U.S., rather than the inflation and slowdown predicted by many economists. There are three possible outcomes. Trump could prove most economic experts wrong and the tariffs could deliver growth as promised. Or he could retreat again on tariffs before their Aug. 1 start. Or he could damage the economy.",
      "publishedAt": "2025-07-08T20:07:47Z",
      "title": "Trump bets on a different reaction to new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-economy-trade-tax-404840988e58dbfd491afe00f2e605f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64f996/2147483647/strip/true/crop/3571x2009+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F95%2Fc494ddcdf648fa26b6f20973f54e%2Fe67f12e507384f2dbc954919f0c2d7b1"
    },
    {
      "author": null,
      "description": "Two people have died in Guatemala after falling rocks crushed their vehicle during a series of earthquakes. Authorities reported over 37 tremors on Tuesday, with magnitudes ranging from 3.0 to 5.6. The quakes have caused landslides, evacuations, and minor property damage. The strongest tremors were centered in Sacatepéquez, with aftershocks in the Escuintla and Guatemala departments. Guatemalan President Bernardo Arévalo confirmed five people were buried by landslides, with two already rescued. The National Coordinator for Disaster Reduction issued an orange alert. The US Geological Survey recorded multiple quakes, including a 5.7 magnitude tremor near San Vicente Pacaya in Escuintla.",
      "publishedAt": "2025-07-09T09:31:04Z",
      "title": "Dozens of earthquakes and aftershocks cause two deaths in Guatemala",
      "url": "https://apnews.com/article/guatemala-earthquakes-landslide-aftershocks-4bf5473b028d57660b7dabcefefcf0bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/003e99d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Ffd%2Fd646cf09897c7883fec298891f0e%2F8ee2aa64bffa4bdfae1d987b49385ebd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}