{
  "articles": [
    {
      "author": "TERRY SPENCER and HAVEN DALEY",
      "description": "FORT MYERS BEACH, Fla. (AP) — Florida's Gulf Coast braced Tuesday for the impact of Hurricane Milton's winds and expected massive storm surge, which could bring destruction to areas already reeling from Helene's devastation 12 days ago and still recovering from Ian's wrath two years ago.",
      "publishedAt": "2024-10-08T04:08:46Z",
      "title": "Tampa Bay hasn’t been hit directly by a major hurricane since 1921. Milton may be the one",
      "url": "https://apnews.com/7678939c52fdf00da748937d22df1fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1af9325cff8e47aa98596a1ad9ac886a/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Not even two weeks after Hurricane Helene swamped the Florida coastline, Milton has strengthened rapidly into a major hurricane on a path toward the state.",
      "publishedAt": "2024-10-07T22:26:06Z",
      "title": "What to know about Hurricane Milton as it moves toward Florida's Gulf Coast",
      "url": "https://apnews.com/d40b1e47fd78844bf1ed528bab5099f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5db12c55e1a45a3abfd59f6084e7b07/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris on Monday called former President Donald Trump “incredibly irresponsible” for spreading falsehoods about the federal response to Hurricane Helene 's destruction, offering especially sharp words as a new storm bears down on Florida with just weeks until Election Day.",
      "publishedAt": "2024-10-07T23:42:58Z",
      "title": "Harris calls Trump 'incredibly irresponsible' for spreading misinformation about Helene response",
      "url": "https://apnews.com/552e413dfb6c1b3e37eca0d2114668ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99bf1ca386eb4001bb4e89e902ba5547/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Hezbollah’s acting leader said Tuesday that even more Israelis will be displaced as the militant group extends its rocket fire deeper into Israel, in a defiant televised statement marking the anniversary of fighting that escalated into war last month.",
      "publishedAt": "2024-10-08T09:15:08Z",
      "title": "Hezbollah leader says more Israelis will be displaced as the militants extend their rocket fire",
      "url": "https://apnews.com/0bc0a8970c066c048ee1875bcdc8df79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f7dbe8510214e8595ff01e9bd0a0c3a/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israeli military strikes are targeting Iran's armed allies across a nearly 2,000-mile stretch of the Middle East and threatening Iran itself.",
      "publishedAt": "2024-10-08T04:05:55Z",
      "title": "Israel's strikes are shifting the power balance in the Middle East, with US support",
      "url": "https://apnews.com/36d7c0bbc35964ed6ac9d21de17c632a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/924d2e2dcff442038e3232fe15cee0a0/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "NEW YORK (AP) — When Vice President Kamala Harris sat down for an interview with podcaster Alex Cooper, the conversation didn’t start by parsing policy positions.",
      "publishedAt": "2024-10-08T04:10:54Z",
      "title": "Harris is still introducing herself as she sets out on a media tour with voting already underway",
      "url": "https://apnews.com/5a2af60ba0b1099e19cca151955c9855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fde532c75b3748cfa685be1285d6a235/3000.jpeg"
    },
    {
      "author": "MATT BROWN and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Black registered voters have an overwhelmingly positive view of Vice President Kamala Harris, but they’re less sure that she would change the country for the better, according to a recent poll from the  AP-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-08T04:01:48Z",
      "title": "What polling shows about Black voters' views of Harris and Trump",
      "url": "https://apnews.com/78e344ddea4886dd23582f4a51eb0da6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cb9ddfdcc2f4b2ba59e2bb8c1bad677/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and MIKE CORDER",
      "description": "STOCKHOLM (AP) — John Hopfield and Geoffrey Hinton — who is known as the Godfather of artificial intelligence — were awarded the Nobel Prize in physics Tuesday for discoveries and inventions that formed the building blocks of machine learning and artificial intelligence.",
      "publishedAt": "2024-10-08T07:50:55Z",
      "title": "Nobel Prize in physics awarded to 2 scientists for discoveries that enabled machine learning",
      "url": "https://apnews.com/fc0567de3f2ca45f81a7359a017cd542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea29d9c9b3bc4f1d87044c13aed57718/3000.jpeg"
    },
    {
      "author": null,
      "description": "SRINAGAR, India (AP) — Votes were being counted Tuesday in the recent election for a largely powerless local government in Indian-controlled Kashmir, the first since Indian Prime Minister Narendra Modi’s government stripped the disputed region of its special status five years ago.",
      "publishedAt": "2024-10-08T03:18:55Z",
      "title": "Votes are being counted in the election for a truncated government in Indian-controlled Kashmir",
      "url": "https://apnews.com/5590ef6cd2810cb16308f6efcdea23f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a569756f41364d6ca370158aaa19e473/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY and MICHAEL PHILLIS",
      "description": "WASHINGTON (AP) — A decade after the Flint, Michigan, water crisis raised alarms about the continuing dangers of lead in tap water, President Joe Biden is setting a 10-year deadline for cities across the nation to replace their lead pipes, finalizing an aggressive approach aimed at ensuring that drinking water is safe for all Americans.",
      "publishedAt": "2024-10-08T09:23:32Z",
      "title": "Biden sets a 10-year deadline for US cities to replace lead pipes and make drinking water safer",
      "url": "https://apnews.com/4aae63134894762cbe904ee460e62708",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d739346cabad46eda8a3f64dc7774098/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}