{
  "articles": [
    {
      "author": "Aamer Madhani, Jill Lawless",
      "description": "Vice President JD Vance has struck a nerve with allies after offering skeptical comments about a potential international security force for post-war Ukraine proposed by key allies Britain and France. The Republican said in a Fox News Channel interview aired Monday the pact that would give the U.S. access to Ukraine’s critical minerals “is a way better security guarantee than 20,000 troops from some random country that hasn’t fought a war in 30 or 40 years.” The comments have irked some lawmakers and government officials in the U.K. and France, who view them as a slight that discounts both countries' partnership with the U.S. military in conflict zones over the last 25 years.",
      "publishedAt": "2025-03-04T14:45:02Z",
      "title": "Vance irks US allies with skeptical comments about Ukraine peacekeeping",
      "url": "https://apnews.com/article/trump-vance-zelenskyy-ukraine-russia-war-c095188d261f33f8ec1034ab76d517d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bfc4b3/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F65%2F885e4def131e8bf53ac81cb19bfa%2F1ba8231d9dd24da3b45f385656be561f"
    },
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "Ukrainian President Volodymyr Zelenskyy says last week's Oval Office blowup with U.S. counterpart Donald Trump was “regrettable,” and he adds, “It is time to make things right.” His remarks came hours after the White House announced a pause on military aid to Ukraine. In a social media post on X, Zelenskyy said Friday's White House meeting “did not go the way it was supposed to be.” He added that ”it is time to make things right. We would like future cooperation and communication to be constructive.” He said Ukraine is ready to sign a deal on its rare-earth minerals and security with Washington.",
      "publishedAt": "2025-03-04T07:33:52Z",
      "title": "Zelenskyy calls Oval Office spat with Trump 'regrettable,' says he's ready to work for Ukraine peace",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-military-aid-2ce8b167f0ba948b2b606381192de71d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1917823/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F6c%2Fb44ce0e7af93bc36143665d5ec19%2Fce43959b1cb44e7cab1302dbd1b9b830"
    },
    {
      "author": "Jill Lawless",
      "description": "The U.S. has been Ukraine’s biggest military backer since Russia’s full-scale invasion began three years ago. The suspension of that aid by the Trump administration doesn’t mean Ukraine’s defenses will quickly collapse. But it's a major blow that threatens to remove some of the most formidable weapons in Ukraine’s battlefield arsenal. And it ratchets up pressure on Kyiv to accept a peace agreement. The U.S. provides about 20% of Ukraine’s military supplies, including the most lethal and important equipment, like longer-range missiles and Patriot air defense systems. Malcolm Chalmers of the RUSI think tank says much will depend on whether the U.S. cuts off technical assistance as well as weapons and ammunition.",
      "publishedAt": "2025-03-04T14:46:53Z",
      "title": "Trump's halt on military aid will hurt Ukraine's defenses. But it may not be fatal",
      "url": "https://apnews.com/article/us-military-aid-halt-ukraine-explainer-123551e5d86b49fdaa977eae685d32a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/1917823/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F6c%2Fb44ce0e7af93bc36143665d5ec19%2Fce43959b1cb44e7cab1302dbd1b9b830"
    },
    {
      "author": "John Leicester",
      "description": "France’s prime minister has decried the U.S. pause on military aid for Ukraine as “unbearable.” François Bayrou mounted his second sharp criticism of the administration of U.S. President Donald Trump in as many days. Bayrou said Tuesday that suspending aid was tantamount to abandoning Ukrainians and allowing for a possible victory by Russia. He said that it's \"obviously unbearable.” Bayrou argued that the suspension could impact not only munitions supplies and other military assistance but also Ukrainian morale. Bayrou said that the “Ukrainians feel terribly abandoned and terribly alone.\" France's defense minister separately posted video of what he described as “dangerous behavior” by a Russian Su-35 fighter jet that he said buzzed a French drone over the eastern Mediterranean.",
      "publishedAt": "2025-03-04T17:57:01Z",
      "title": "French prime minister again lashes out at US over Ukraine, says pause in aid is 'unbearable'",
      "url": "https://apnews.com/article/france-ukraine-bayrou-macron-trump-military-drones-aef148aa847dd36722cbf0c99c901022",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd31809/2147483647/strip/true/crop/8089x4550+0+492/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fb1%2F75e7f2df9d69cefe0a514bed2b1d%2F557398dd4be248948b1c011865c46a75"
    },
    {
      "author": "Josh Boak, Paul Wiseman, Rob Gillies",
      "description": "President Donald Trump’s long-threatened tariffs against Canada and Mexico have gone into effect, kicking off a trade war with America's neighbors. Starting just past midnight Tuesday, imports from Canada and Mexico are now taxed at 25%, with Canadian energy products subject to 10% import duties. In addition, the 10% tariff that Trump placed on Chinese imports in February was doubled to 20%. China retaliated Tuesday with additional tariffs of up to 15% on a wide array of U.S. farm exports, among other measures. Canada also has announced tariffs on American goods. Trump's moves have raised inflation fears, even as he has promised the American public that taxes on imports are the easiest path to national prosperity.",
      "publishedAt": "2025-03-04T05:03:54Z",
      "title": "Trump tariffs on Canada and Mexico take effect",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-643086a6dc7ff716d876b3c83e3255b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbd1fcd/2147483647/strip/true/crop/3000x1688+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fa8%2Fbdde94a2bac327067aab245c44c2%2F00c2c6a26d3b4061ba25590f48e727bb"
    },
    {
      "author": "Samy Magdy, Mohammad Jahjouh",
      "description": "Arab leaders have endorsed Egypt's postwar plan for the Gaza Strip that would allow its roughly 2 million Palestinians to remain in the territory. The $53 billion plan’s endorsement by Arab leaders at a summit in Cairo amounted to a widespread rejection of Trump’s proposal. The summit conclusions were welcomed by Hamas, rejected by Israel and met with a lukewarm response by the Trump administration. Egyptian President Abdel Fattah el-Sissi expressed his appreciation for the consensus among Arab countries in supporting the plan, which he said allows the Palestinian People to remain on their land.",
      "publishedAt": "2025-03-04T10:00:59Z",
      "title": "Arab leaders endorse Egypt's plan to rebuild Gaza as an alternative to Trump's proposal",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-04-2025-35f1959c28ad3c57a209f5464f2b5411",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d7cea4/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F58%2F9da07c446f9c4fb566bdf50bb0f6%2Fa27527d5d2e044fd91e18a1f2f049d64"
    },
    {
      "author": null,
      "description": "China says it will increase its defense budget 7.2% this year. It was announced Wednesday at the National People’s Congress, the annual meeting of China’s legislature. The increase is the same percentage as last year. China’s military spending remains the second largest behind the U.S. Tensions with the U.S., Taiwan, Japan and neighbors who share claims to the crucial South China Sea are seen as furthering growth in increasingly high-tech military technologies from stealth fighters to aircraft carriers and nuclear weapons.",
      "publishedAt": "2025-03-05T02:51:17Z",
      "title": "China will increase its defense budget 7.2% this year",
      "url": "https://apnews.com/article/china-defense-budget-taiwan-4ac7cbdc7d5b889732cd55916ff7eb36",
      "urlToImage": "https://dims.apnews.com/dims4/default/636545b/2147483647/strip/true/crop/7626x4290+0+397/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fe8%2F2308b79547cc528470fbf23658b3%2F2c20a6b8ac274553b2c8659910456ad3"
    },
    {
      "author": "Zeke Miller",
      "description": "The White House says guests at President Donald Trump’s address to Congress will include the widow of a slain New York police officer, a Pennsylvania teacher who was detained in Russia and the family of a man killed at Trump’s assassination attempt in Pennsylvania. Trump on Tuesday will give an accounting of his turbulent first weeks in office as a divided nation struggles to keep pace. Some Americans fear for the country’s future after the Republican president’s aggressive early moves, while others cheer him on. Democrats are highlighting the impact of Trump’s actions by inviting as guests fired federal workers and people who’d be harmed by cuts to Medicaid and other programs.",
      "publishedAt": "2025-03-04T05:11:24Z",
      "title": "Trump will stand before Congress and offer divided nation an accounting of his turbulent first weeks",
      "url": "https://apnews.com/article/trump-speech-congress-immigration-tariffs-guests-93f6107ede260854f90c65c4bde60de8",
      "urlToImage": "https://dims.apnews.com/dims4/default/b426a2c/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F95%2F045aec4086a891ea58abaa2a5668%2Fcf7b6a837c814f78acc74f0125803628"
    },
    {
      "author": "Chris Megerian, Aamer Madhani",
      "description": "A president’s address to Congress — even without the formal gloss of a State of the Union address — is typically a time for a call to national unity and predictable claims about the country being strong. But that wasn’t President Donald Trump’s plan. His speech on Tuesday night was relentlessly partisan, boasting about his election victory and criticizing Democrats for failing to recognize his accomplishments. The hard edge reflected Trump’s bulldozer approach to his second term, brushing aside opposition and demanding loyalty throughout the federal government.",
      "publishedAt": "2025-03-05T04:36:02Z",
      "title": "Key takeaways from Trump's speech to Congress",
      "url": "https://apnews.com/article/trump-address-congress-takeaways-partisan-divide-b25327f1c728190102c2a7ade61cb498",
      "urlToImage": "https://dims.apnews.com/dims4/default/4804a05/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Fca%2Fd22c29f7fa7ab0f40535775fda43%2Fb9e8dd1112ff459481c19e90a15a3e90"
    },
    {
      "author": "Jeff Martin, Jack Brook",
      "description": "Powerful storms have killed two people in Mississippi, torn the roofs off an apartment building and a nursing home in Oklahoma and threatened communities across the nation. Tuesday's large system brought blinding dust storms to the Southwest, blizzards with whiteout conditions to the Midwest and raised fears of wildfires. In New Orleans, high winds forced some changes to Mardi Gras. The city shortened the celebration’s two biggest parades to wrap them up before high winds moved in. The storms are among the first big tests for meteorologists at the National Weather Service after hundreds of forecasters were fired under President Donald Trump.",
      "publishedAt": "2025-03-04T05:12:27Z",
      "title": "Powerful US storms kill 2, bring threats from critical fire weather to blizzard conditions",
      "url": "https://apnews.com/article/tornadoes-storms-mardi-gras-rescheduled-579b9ec79b2c5f08e977e018a73aab81",
      "urlToImage": "https://dims.apnews.com/dims4/default/09ccb19/2147483647/strip/true/crop/7711x4337+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Fc7%2F60d3216c215c060e275f989e01aa%2Fb2eeca95fc8644d2805ad15834eebe43"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}