{
  "articles": [
    {
      "author": null,
      "description": "U.S. President Donald Trump is meeting with Russian President Vladimir Putin in Alaska at a U.S. military base for a crucial summit. This Friday’s meeting could influence the war in Ukraine and European security. Trump aims to showcase his skills as a dealmaker. For Putin, it's a chance to negotiate terms that favor Russia. The summit excludes Ukrainian President Volodymyr Zelenskyy, which could undermine Ukraine's interests. Trump has expressed hopes for a broader peace deal, but success is uncertain. The meeting's outcome could have significant implications for international relations and U.S. diplomacy.",
      "publishedAt": "2025-08-15T04:10:34Z",
      "title": "Trump and Putin to meet in Alaska for high-stakes summit",
      "url": "https://apnews.com/article/trump-putin-summit-alaska-russia-ukraine-a7b167f17a3e06fbce2f583c93f8bae1",
      "urlToImage": "https://dims.apnews.com/dims4/default/9487f1b/2147483647/strip/true/crop/1945x1094+0+101/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F2a%2F345bf8327df19d8b6ac7aeac691a%2F20b7e141691f4a82ad291ffad074080d"
    },
    {
      "author": null,
      "description": "Days before the leaders of Russia and the U.S. hold a summit meeting in Alaska, Moscow’s forces breached Ukrainian lines in a series of infiltrations this week in the country’s industrial heartland of Donetsk. The advances amount to only a limited success for Russia, since Moscow still needs to consolidate its gains before achieving a true breakthrough. Still, some observers say it’s a potentially dangerous moment. Analyst Mykola Bieleskov says Russian President Vladimir Putin will likely try to persuade U.S. President Donald Trump to pressure Kyiv by arguing the 3 1/2-year-old war is going badly for Kyiv.",
      "publishedAt": "2025-08-15T05:02:31Z",
      "title": "Ukrainian defenses face a challenge as Russian troops make gains ahead of the Putin-Trump summit",
      "url": "https://apnews.com/article/russia-ukraine-war-front-summit-putin-trump-5a6060386d8c195d5b14a6b820bcc4ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca6c91c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fdb%2Fb00b3291f089e967cdd297b76e22%2F21fa3b40e5954a729b03efac87ec2fbb"
    },
    {
      "author": null,
      "description": "Washington is seeking an emergency restraining order against President Donald Trump’s takeover of its police department. District of Columbia Attorney General Brian Schwalb filed a lawsuit Friday, after Trump Attorney General Pam Bondi named an emergency police commissioner with all the powers of the police chief. Schwalb says Trump is going beyond his legal power over the nation's capital. Schwalb wants a judge to find control of Washington police remains in district hands. The Justice Department and the White House haven't commented. The Republican president federalized the police department this week after declaring an emergency over crime in the city. Washington has historically struggled with crime but has driven violent crime rates down recently.",
      "publishedAt": "2025-08-15T12:53:38Z",
      "title": "Washington sues over Trump's federal takeover of DC police",
      "url": "https://apnews.com/article/washington-dc-trump-federal-police-takeover-lawsuit-eacd387053520c9e3640c2f91924deeb",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed700ce/2147483647/strip/true/crop/1462x822+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F99%2Ff4bf41b966b9cd90274348503b70%2F1e8359f14576455784c538982b3a286b"
    },
    {
      "author": null,
      "description": "People in Gaza are struggling to secure enough water for drinking and sanitation, with experts warning that far less than the minimum needed to sustain life is reaching the territory. The more than 2 million people in the besieged enclave faced shortages even before the war. They relied on Israeli electricity to power desalination and wastewater treatment plants. Now, displaced families reuse water for dishes and bathing. People crowd around hoses from water trucks to carry supplies home in the sweltering heat. Water and sanitation touch almost every part of the humanitarian crisis in the territory. Shortages have helped fuel the rampant spread of disease.",
      "publishedAt": "2025-08-15T12:16:37Z",
      "title": "Gaza families drink and wash with murky water, driving disease in the heat",
      "url": "https://apnews.com/article/gaza-water-shortage-displaced-sanitation-desalination-muwasi-77596e9bbc1516013993dec1230a5131",
      "urlToImage": "https://dims.apnews.com/dims4/default/d23b9ac/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F9a%2Fe3d2e7e8a9e6ee33cd070ed3bf39%2F8b1c917ce5424c7688dec3fc650ffebb"
    },
    {
      "author": null,
      "description": "A political standoff in Texas over new U.S. House maps aimed at adding five Republican seats is poised to enter a new phase. Meanwhile, heavily Democratic California plans for a November election intended to erase all but a sprinkle of the state’s GOP House districts in the fight over control of Congress. The jockeying in the nation’s two most populous states underscores the stakes for both parties in the narrowly divided House that could determine the fate of President Donald Trump’s agenda in the second half of his term. California Democratic Gov. Gavin Newsom wants other Democratic-led states to get involved.",
      "publishedAt": "2025-08-15T04:09:44Z",
      "title": "Texas and California showdown over US House maps may shift political landscape",
      "url": "https://apnews.com/article/texas-california-redistricting-battle-f0ac783b6a5fd6ecaab0ca419125b72a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1f2c8d/2147483647/strip/true/crop/2961x1666+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F10%2F4888f26535c1277b35705ca86e75%2F77a35e1fd28b414586d5819020e3b19d"
    },
    {
      "author": null,
      "description": "Erin has strengthened into a hurricane as it approaches Puerto Rico and the Virgin Islands, bringing heavy rains that could cause flooding and landslides. The National Hurricane Center in Miami reports the storm is several hundred miles east of the northern Leeward Islands, with maximum sustained winds of 70 mph. Tropical storm watches are in effect for parts of the Leeward Islands. Experts say Erin is expected to turn east of the U.S. next week. Erin is the first hurricane of the Atlantic storm season.",
      "publishedAt": "2025-08-15T09:45:08Z",
      "title": "Hurricane Erin nears the northeast Caribbean with heavy rains expected",
      "url": "https://apnews.com/article/tropical-storm-erin-caribbean-puerto-rico-de5204a61ede5102fec0d3c9ac35f3bf",
      "urlToImage": "https://dims.apnews.com/dims4/default/65f0834/2147483647/strip/true/crop/7097x3992+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F7d%2F3353c2ce2571ae1b8c37dfded782%2F7854a022da4e49ddb51ae427c9bc2520"
    },
    {
      "author": null,
      "description": "Authorities are searching for missing people in a remote village in India-controlled Kashmir after flash floods caused by torrential rains. Teams of disaster management officials, police and soldiers helped by local villagers scoured the devastated Himalayan village of Chositi on Friday. Rescuers were searching for at least 80 missing people. Flooding that began a day earlier has killed at least 60 people. The floods on Thursday were triggered by a cloudburst in the Himalayan village. Sudden and intense downpours over small areas known as cloudbursts are increasingly common in India’s Himalayan regions. They are prone to flash floods and landslides.",
      "publishedAt": "2025-08-15T07:48:37Z",
      "title": "Rescuers search for missing flash flood victims in remote Kashmir village",
      "url": "https://apnews.com/article/kashmir-india-cloudburst-flash-floods-rain-rescue-92bd23be264cc145d6cf6c23250bf501",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe6b8d3/2147483647/strip/true/crop/5236x2945+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Faa%2Fa391f42469d5db0a2055bc8f80c1%2Fa9b65177f8be40498b0f70d8a004748a"
    },
    {
      "author": null,
      "description": "Small-scale solar panels about the size of a door are poised to be plugged into more U.S. homes and apartments as homeowners and renters who want to harness the sun’s energy look for cheaper alternatives to rooftop installations. Known as plug-in or balcony solar, the systems that are already popular in Europe could become more attractive to U.S. buyers now that residential rooftop solar credits are being scrapped under the GOP tax bill. Even before the bill passed, manufacturers reported seeing increased demand amid other positive signs such as Utah recently passing a law to streamline regulations for homeowners to buy and install them.",
      "publishedAt": "2025-08-15T13:01:22Z",
      "title": "Small plug-in solar panel systems gain traction in US",
      "url": "https://apnews.com/article/balcony-plug-solar-climate-energy-renewable-trump-c162abf520da0fa155dc971270b8684a",
      "urlToImage": "https://dims.apnews.com/dims4/default/6cca6f2/2147483647/strip/true/crop/4694x2640+0+245/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc4%2F8c8c277fcf0fd55e3f9063662e6b%2F8dd23d133b544ab38d8fb0f7c1e7ff8c"
    },
    {
      "author": null,
      "description": "U.S. stocks are hanging around their records as Wall Street heads toward the finish of another winning week. The S&P 500 was virtually unchanged Friday, a day after nudging to its latest all-time high. The Dow Jones Industrial Average added 141 points, and the Nasdaq composite slipped 0.1%. UnitedHealth Group's stock jumped after Warren Buffett’s Berkshire Hathaway said it bought nearly 5 million shares of the insurer in the spring, while Applied Materials slumped on worries about its business in China. Treasury yields were relatively steady following several mixed reports on the U.S. economy.",
      "publishedAt": "2025-08-15T05:13:10Z",
      "title": "Stocks hang around their records on Wall Street",
      "url": "https://apnews.com/article/stocks-markets-china-trump-rates-ca76a4dfaab0120de80969609866d59a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d18b21d/2147483647/strip/true/crop/4971x2796+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F6b%2F14c830efbdb28f03511a7b304297%2F36ec8d359bb647cfaf4ae81441fcbebe"
    },
    {
      "author": null,
      "description": "The NCAA has fined Michigan football tens of millions of dollars and suspended coach Sherrone Moore for three games in a sign-stealing scandal. Moore, already serving a self-imposed two-game suspension, also will miss the first game of the 2026-27 season. He also received a two-year show-cause order but can continue coaching. Connor Stalions received an eight-year show-cause order, while former coach Jim Harbaugh faces a 10-year show-cause order starting in 2028. The NCAA’s investigation began in 2023, revealing Michigan’s in-person scouting and sign-stealing activities. The NCAA prohibits using electronic equipment to record another team’s signals.",
      "publishedAt": "2025-08-15T14:39:53Z",
      "title": "Michigan football fined tens of millions of dollars",
      "url": "https://apnews.com/article/ncaa-michigan-sign-stealing-b1bf55b0b93dad083bd97fe2c26faddb",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd9fda6/2147483647/strip/true/crop/5383x3028+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F88%2Fa162d8c07713a798eefe47104af3%2Ff86b3ea2372c46b69ef4d6f5eb4bf4ac"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}