{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — The jury in former President Donald Trump’s hush money trial is to resume deliberations Thursday after asking to rehear potentially crucial testimony about the alleged scheme at the heart of the history-making case.",
      "publishedAt": "2024-05-30T04:03:01Z",
      "title": "Jurors in Trump's hush money trial zero in on testimony of key witnesses as deliberations resume",
      "url": "https://apnews.com/85558c6d08efb434d05b694364470aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d21ecc40af0b4be0aeae5a72ad6da882/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military said Thursday that two soldiers were killed in a car-ramming attack in the occupied West Bank. Violence in the West Bank has surged throughout the war in Gaza as Israel raids Palestinian towns in the territory to crack down on militancy, with incursions resulting in the deaths of more than 500 Palestinians.",
      "publishedAt": "2024-05-30T06:41:44Z",
      "title": "The Latest | 2 soldiers are killed in a West Bank car-ramming attack, Israeli military says",
      "url": "https://apnews.com/db1561901fcab2ab0835c981a885d661",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e715423dfb49268d02d45f232e9b10/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — A string of security, logistical and weather problems has battered the plan to deliver desperately needed humanitarian aid to Gaza through a U.S.",
      "publishedAt": "2024-05-29T22:54:10Z",
      "title": "The US-built pier in Gaza broke apart. Here's how we got here and what might be next",
      "url": "https://apnews.com/77d0cf1c1bd420042dc4cb6f4ad76ccb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e27820b86b045098703d718f486a8ed/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG and ZEN SOO",
      "description": "HONG KONG (AP) — Fourteen pro-democracy activists were convicted in Hong Kong’s biggest national security case on Thursday by a court that said their plan to effect change through an unofficial primary election would have undermined the government’s authority and created a constitutional crisis.",
      "publishedAt": "2024-05-30T02:00:42Z",
      "title": "14 pro-democracy activists convicted, 2 acquitted in Hong Kong's biggest national security case",
      "url": "https://apnews.com/5b8e7ac1100342db642040985bc417b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b95defaa8abb470d89816dc187182268/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — Very early counts in South Africa's national election put the long-ruling African National Congress at just over 42% of the vote, raising the possibility that it might lose its majority for the first time since it swept to power under Nelson Mandela at the end of apartheid in 1994.",
      "publishedAt": "2024-05-30T10:41:42Z",
      "title": "Early results in South Africa's election put ruling ANC below 50% and short of a majority",
      "url": "https://apnews.com/25a03780bec29503ab3d9f6e9f96dc4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9cdeada2190429b98b18978729a9a1a/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON and MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico goes into Sunday’s election deeply divided: friends and relatives no longer talk politics for fear of worsening unbridgeable divides, while drug cartels have split the country into a patchwork quilt of warring fiefdoms.",
      "publishedAt": "2024-05-30T04:41:20Z",
      "title": "A violent, polarized Mexico goes to the polls to choose between 2 women presidential candidates",
      "url": "https://apnews.com/4d5f620f0f8f9b7ef6efa8b3083561a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a4c009be27e441e998dfb737350914c/1920.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Lab-grown meat is not currently available in any U.S. grocery stores or restaurants. If some lawmakers have their way, it never will be.",
      "publishedAt": "2024-05-30T11:32:41Z",
      "title": "Lab-grown meat isn't on store shelves yet, but some states have already banned it",
      "url": "https://apnews.com/8dee6ce8e1282efe953ca4115db4b2c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e58777ed406f4b92a2b21906023dbb4f/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Traumatized survivors of the massive landslide estimated to have buried hundreds in Papua New Guinea have been slow to move to safer ground as the South Pacific island nation's authorities prepare to use heavy machinery to clear debris and risk triggering another landslide, officials said Thursday.",
      "publishedAt": "2024-05-30T07:12:46Z",
      "title": "Papua New Guinea landslide survivors slow to move to safer ground after hundreds buried",
      "url": "https://apnews.com/7a25acb4fba78af6d95702e24d91e2e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf12addaf6bd40348c71358aac2a1c29/2855.jpeg"
    },
    {
      "author": "KAREN MATTHEWS",
      "description": "NEW YORK (AP) — A nurse was fired by a New York City hospital after she referred to Israel's war in Gaza as a “genocide” during a speech accepting an award.Labor and delivery nurse Hesen Jabr, who is Palestinian American, was being honored by NYU Langone Health for her compassion in caring for mothers who had lost babies when she drew a link between her work and the suffering of mothers in Gaza.",
      "publishedAt": "2024-05-29T17:45:27Z",
      "title": "A nurse honored for compassion is fired after referring to Gaza 'genocide' in speech",
      "url": "https://apnews.com/55c694d6a0c64b1612262310dc208124",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e23781e8aab5434d812a551f54dc8333/3000.jpeg"
    },
    {
      "author": null,
      "description": "HELEN, Ga. (AP) — A profile of Andrew “Andy” Negra Jr., of Helen, Georgia, one of a dwindling number of veterans took part in the Allies’ European war effort that led to the defeat of Nazi Germany.",
      "publishedAt": "2024-05-30T04:12:54Z",
      "title": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world'",
      "url": "https://apnews.com/2b62661bdd15804c03ab7dbbbb7fc92d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3d46c7ac4ec444fb438349682d6fb70/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}