{
  "articles": [
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has rolled out his plan to increase U.S. tariffs to match the tax rates that other countries charge on imports. The Republican is possibly triggering a broader economic confrontation with allies and rivals alike as he hopes to eliminate any trade imbalances. Trump said Thursday: “TODAY IS THE BIG ONE: RECIPROCAL TARIFFS!!!” The prospect of a dramatic hike on tariffs could send shockwaves through the world economy, possibly depressing growth while also causing inflation to intensify. Most economists say the tariffs would effectively be a tax increase on U.S. consumers. Trump says he's decided “for purposes of fairness\" he'll charge reciprocal tariffs.",
      "publishedAt": "2025-02-13T12:52:00Z",
      "title": "Trump signs a plan for reciprocal tariffs on US trading partners",
      "url": "https://apnews.com/article/trump-tariffs-reciprocal-imports-tax-trade-economy-54c0a26687dc96157d96229068894720",
      "urlToImage": "https://dims.apnews.com/dims4/default/95c5e57/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4c%2F2523bce79acc6a79e7755e0bf587%2F3cf12cc080014e7fb806f9ef2a81c8a4"
    },
    {
      "author": "CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "The Trump administration is intensifying its sweeping efforts to shrink the size of the federal workforce by ordering agencies to lay off all probationary employees who had not yet gained civil service protection. Hundreds of thousands of workers could be affected. In addition, workers at some agencies have been warned that large workplace cuts are coming. The Office of Personnel Management told agencies on Thursday to lay off all probationary employees. It’s expected to be the first step in sweeping layoffs throughout the federal government. President Donald Trump signed an executive order this week that told agencies to plan for “large-scale reductions in force.”",
      "publishedAt": "2025-02-13T22:36:42Z",
      "title": "Trump administration lays off probationary government workers, warns others of large cuts to come",
      "url": "https://apnews.com/article/trump-federal-workers-layoffs-doge-406752da1614755b8fabe9c94e0c71a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/5205db3/2147483647/strip/true/crop/5559x3127+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F88%2Ff106308153125612f8df1ca9b351%2F83d9d34e3d3e4888a619f0c5a15adf65"
    },
    {
      "author": "LINDSAY WHITEHURST, ELLEN KNICKMEYER",
      "description": "A federal judge has ordered the Trump administration to temporarily lift a three-week funding freeze that has shut down U.S. aid and development programs abroad. Judge Amir Ali issued the order Thursday in a lawsuit brought by companies that receive U.S. funding for programs abroad. In his order, Ali noted that the Trump administration argued it had to shut down funding for the thousands of U.S. Agency for International Development aid programs abroad to conduct a thorough review of each program and whether it should be eliminated. The ruling was the first to temporarily roll back a Trump administration funding freeze on foreign assistance that has forced USAID and State Department contractors around the world to stop providing humanitarian aid and lay off staff.",
      "publishedAt": "2025-02-13T14:08:16Z",
      "title": "Judge orders Trump administration to temporarily allow USAID funds",
      "url": "https://apnews.com/article/usaid-trump-musk-shutdown-doge-foreign-aid-9e5e2f1bceac5d9730dd161b59307488",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb80598/2147483647/strip/true/crop/4788x2693+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F04%2F2f2336329934e6a1b86830591205%2F7f9b3da86dab46a3b01c2e8dc778494b"
    },
    {
      "author": "LARRY NEUMEISTER, ALANNA DURKIN RICHER, ERIC TUCKER",
      "description": "Manhattan’s top federal prosecutor, Danielle Sassoon, and five high-ranking Justice Department officials have resigned after she refused an order to drop corruption charges against New York City Mayor Eric Adams. It's a stunning escalation in a dayslong standoff over the Trump administration prioritizing political aims over criminal culpability. Sassoon is a Republican who was interim U.S. attorney for the Southern District of New York. She accused the department of acceding to a “quid pro quo” — namely, dropping the case to ensure Adams’ help with Trump’s immigration agenda. And she said she was “confident” the Democratic mayor committed the crimes spelled out in his indictment, and even more.",
      "publishedAt": "2025-02-13T19:26:48Z",
      "title": "Manhattan US attorney resigns after refusing to drop case against Mayor Adams",
      "url": "https://apnews.com/article/new-york-city-us-attorney-0395055315864924a3a5cc9a808f76fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc3edd0/2147483647/strip/true/crop/4173x2347+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F38%2Fa796397fe3b1fb28d74b77242bff%2F9164466f88664264bfc35c081775c266"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "Indian Prime Minister Narendra Modi and the United States President Donald Trump have spoken about easing tariffs and resolving trade concerns between the two countries, while also shoring up defense ties. The two leaders held a meeting at the White House on Thursday. Even though Trump warned that India won’t be spared from higher tariffs, the meeting signaled New Delhi and Washington could offer concessions to strengthen economic ties at a time when Trump has been imposing strong tariffs on other trade partners. Trump said the U.S. will increase its military sales to India and eventually provide F-35 stealth fighter jets. Meanwhile, Modi offered to double bilateral trade with Washington to $500 billion by 2030.",
      "publishedAt": "2025-02-14T07:15:12Z",
      "title": "Takeaways from Modi, Trump meeting: Cooperation on trade and defense — plus some mutual praise",
      "url": "https://apnews.com/article/india-us-modi-trump-16ee5c65b972f5ae16acb413313d36b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3ffa77/2147483647/strip/true/crop/5450x3066+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F24%2F9535c500829e4bd877d4f86fd5e6%2F28dc3e148705425a94bbf0b002d2c327"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The White House had blocked an Associated Press journalist from a news conference with two major world leaders. It upped the stakes in a disagreement between the news agency and the Trump administration over AP’s style decision to stick with the name “Gulf of Mexico” for a body of water that the president rechristened the “Gulf of America.” An AP reporter was prevented from entering a news conference with Donald Trump and Indian Prime Minister Narendra Modi. It effectively shut out thousands of global news outlets from the remarks and information that came out of the event. Julie Pace, the AP’s senior vice president and executive editor, called it a “deeply troubling escalation” and “a plain violation of the First Amendment” to the U.S. Constitution.",
      "publishedAt": "2025-02-14T02:09:54Z",
      "title": "AP White House reporter blocked from Trump and Modi news conference",
      "url": "https://apnews.com/article/ap-white-house-gulf-name-dispute-media-864f2fbb5cfaeede009d7cea5788515b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2e7768/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fe5%2F89deacec8b68c642375ea1267c50%2Fbc08e9417d714e38a0f9add88ecaa148"
    },
    {
      "author": "ABDEL-KAREEM HANA",
      "description": "JABALIYA, Gaza Strip (AP) — The Nassar family managed to assemble a semblance of their home’s old living room.",
      "publishedAt": "2025-02-14T05:05:11Z",
      "title": "Palestinians return to homes and lives turned inside out by Gaza’s destruction",
      "url": "https://apnews.com/article/gaza-inside-out-homes-palestinians-photos-8128306cca7169c24377df1a62ab9166",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e2d6d6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fcd%2F95428489df0b0d9a9c6710bd1a03%2F8f31f0b1d81d420aa37fca927e4b29c9"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "Indian Prime Minister Narendra Modi and SpaceX CEO Elon Musk met during Modi's visit to the U.S., where he spoke with Trump about trade and tariff concerns. Modi said he and Musk discussed various issues including space, mobility, technology and innovation, but made no direct reference to the billionaire's Starlink satellite internet services. Musk has long wanted Starlink to make an entry into the Indian market. Its launch, however, has been delayed due to regulatory challenges, security concerns and opposition from domestic telecom giants.",
      "publishedAt": "2025-02-14T09:14:01Z",
      "title": "Elon Musk met with Modi during the Indian prime minister's US visit. What does he want from India?",
      "url": "https://apnews.com/article/india-us-modi-musk-187301d9afe2c6d0edb0542466c2a589",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcb19b5/2147483647/strip/true/crop/2200x1238+0+114/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fc4%2F4ff8593c635c219bcba0812e93e3%2Fcd64895d01b44c58a0c9156fcaaeb7d0"
    },
    {
      "author": "LINLEY SANDERS, LEANNE ITALIE, EUNICE ESOMONUE, HUMERA LODHI, ANNIE NG",
      "description": "Some U.S. adults consider Valentine's Day outdated, according to a new AP-NORC poll — but many more say they love the romance and fun of quality time with partners, friends and extended family.",
      "publishedAt": "2025-02-13T22:11:31.055Z",
      "title": "Many Americans think Valentine's Day is romantic and fun — not outdated or stressful: AP-NORC poll",
      "url": "https://apnews.com/article/valentines-day-poll-survey-ed8022bbc4726c02800e410ea88e5a8a",
      "urlToImage": "https://assets.apnews.com/8c/8b/402b05d54fb5be8d6c5b7549eaa1/social-share-image-1.jpg"
    },
    {
      "author": "CHRISTOPHER WEBER, PATRICK WHITTLE",
      "description": "Heavy rain is falling across Southern California, creating deluges of water and mud on roads at the bottom of hillsides left barren by recent wildfires. One swift debris flow in Malibu swept a Los Angeles Fire Department vehicle off the Pacific Coast Highway and into the ocean. Evacuations have been ordered in some Los Angeles neighborhoods due to Thursday's weather. The West Coast storms are just the latest in a week of bad weather across the U.S. Snow and ice caused major pileups on highways in Oregon and Washington, injuring at least 10 people.",
      "publishedAt": "2025-02-13T06:54:55Z",
      "title": "Injuries reported in more than 100-vehicle pileup near Portland in whiteout conditions",
      "url": "https://apnews.com/article/california-rain-flooding-oregon-ice-snow-d00f3bf4f37d073d16dabef98197597e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e643d34/2147483647/strip/true/crop/5139x2891+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fc2%2Fcd857c2680e042d24df8ed7a2886%2F38fff5760b184e1dab8f7e0448a247ce"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}