{
  "articles": [
    {
      "author": "REBECCA SANTANA and ELLIOT SPAGAT",
      "description": "WASHINGTON (AP) — The Biden administration said Wednesday that it was granting temporary legal status to hundreds of thousands of Venezuelans who are already in the country — quickly making them eligible to work — as it grapples with growing numbers of people fleeing the South American country and elsewhere to arrive at the U.S.",
      "publishedAt": "2023-09-21T00:23:37Z",
      "title": "Under pressure over border, Biden administration to protect hundreds of thousands of Venezuelans",
      "url": "https://apnews.com/b914be14aaeef14eb01bd10ee23067f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033a90e3a26f45c5a240204346b40eca/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "UNITED NATIONS (AP) — Work together. Go it alone. The apocalypse is at hand. But the future can be bright. The squabbles never cease, yet here are human beings from all across the world — hashing out conflicts with words and processes, convening under one roof, trying to write the next chapter of a common dream.",
      "publishedAt": "2023-09-20T22:42:30Z",
      "title": "Behind all the speechmaking at the UN lies a basic, unspoken question: Is the world governable?",
      "url": "https://apnews.com/08c1edb481c05dbb0a454ae5a3cbbb3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e6da452a9924acba5e7bcf40e251d27/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — Texas Attorney General Ken Paxton attacked his Republican rivals and displayed an openness to challenging U.S. Sen. John Cornyn in 2026 while speaking out Wednesday for the first time since his acquittal on corruption charges at his impeachment trial.",
      "publishedAt": "2023-09-21T03:45:46Z",
      "title": "Texas AG Ken Paxton attacks rivals, doesn't rule out US Senate run in first remarks since acquittal",
      "url": "https://apnews.com/7e6443015fd5f8fc2be6148edb52fda9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9f4c97099042d9835aadf775e3548d/2800.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "MAQUOKETA, Iowa (AP) — Donald Trump began a fall press Wednesday to lock in thousands of Republican caucusgoers in early-voting Iowa, where the former president faces sky-high expectations in his campaign for a White House comeback.",
      "publishedAt": "2023-09-20T19:17:00Z",
      "title": "Trump launches his fall push in Iowa to lock in his lead before the first Republican caucuses",
      "url": "https://apnews.com/075dad8a101cf106495974c846b1922c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d2dd4d83d1a4bcbb8bbcd0ddf07ff36/1920.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "BRIGHTON, Colo. (AP) — Two Denver-area police officers who put Elijah McClain in a neck hold ignored his pleas of “I can’t breathe” before the Black man was injected by paramedics with a powerful sedative and died, prosecutors said Wednesday, as a trial began over the 2019 confrontation that became a rallying cry for protests and spurred police reform.",
      "publishedAt": "2023-09-20T06:03:59Z",
      "title": "Officers who put Elijah McClain in neck hold ignored pleas of 'I can't breathe,' prosecutors say",
      "url": "https://apnews.com/9f976b1e4b9ae52bf824ae5b68ba6fb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccd3d9ae1e074bfc8f63efff2c8234a5/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The debate over whether a Black high school student in Texas should be serving in-school suspension for wearing twisted dreadlocks to class intensified this week as the student’s family and his school district both took legal action.",
      "publishedAt": "2023-09-20T23:21:47Z",
      "title": "Debate over a Black student's suspension over his hairstyle in Texas ramps up with probe and lawsuit",
      "url": "https://apnews.com/6312d39fe23de0b20dca60b9b3c72d8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f42d562d1d4e421f80a2ba1fa9b3f4d0/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "General Motors and Stellantis announced fresh layoffs Wednesday that they blamed on damage from the United Auto Workers strike, and the labor standoff grew more tense just two days before the union was expected to call for new walkouts.",
      "publishedAt": "2023-09-20T18:13:32Z",
      "title": "Jeep maker Stellantis makes a new contract offer as auto workers prepare to expand their strike",
      "url": "https://apnews.com/dce8eb39a1e36f2cc54a5c1e4210e1f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb209b158cb0473292913b0e59ac19f7/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Saudi Crown Prince Mohammed bin Salman said in a rare interview with Fox News on Wednesday that negotiations over Israel means the prospects of normalized relations between both countries “get closer\" every day, but that treatment of Palestinians remains a “very important” issue to be resolved.",
      "publishedAt": "2023-09-20T21:12:49Z",
      "title": "Saudi crown prince says in rare interview 'every day we get closer' to normalization with Israel",
      "url": "https://apnews.com/a65f1e4c39ee2d83667aa433f59b59c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7716135a93f844edb6479fdd7d9475e2/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and TARA COPP",
      "description": "WASHINGTON (AP) — The Senate on Wednesday confirmed Gen. CQ Brown as the next chairman of the Joint Chiefs of Staff, putting him in place to succeed Gen.",
      "publishedAt": "2023-09-20T20:47:45Z",
      "title": "Senate confirms chairman of joint chiefs as GOP senator still blocking hundreds of military nominees",
      "url": "https://apnews.com/d9e1471916db9652501128370455746c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f922b4270dc46bc9a249c0efe5375c3/2237.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is creating the first-ever federal office of gun violence prevention, according to two people familiar with the plans. The office will coordinate efforts across the federal government and will offer help and guidance to states struggling with increasing gun violence, while taking the lead on implementation of the bipartisan gun legislation signed into law last year.",
      "publishedAt": "2023-09-20T19:40:43Z",
      "title": "White House to announce first-ever federal office of gun violence prevention, AP sources say",
      "url": "https://apnews.com/d5c710e2051b220457ce95ac1c8ac1fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61354a3a364d49fabe9da43a8c7df346/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}