{
  "articles": [
    {
      "author": null,
      "description": "BULLS BAY, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina. It’s expected to bring heavy rain up the East Coast.",
      "publishedAt": "2024-08-08T05:55:29Z",
      "title": "Tropical Storm Debby has made a second landfall in South Carolina. It’s expected to bring heavy rain up the East Coast",
      "url": "https://apnews.com/7af76864f6c5a55c0438f06d6add71f6",
      "urlToImage": ""
    },
    {
      "author": "ALI SWENSON and LINLEY SANDERS",
      "description": "NEW YORK (AP) — Roughly 3 in 4 American adults believe the upcoming presidential election is vital to the future of U.S. democracy, although which candidate they think poses the greater threat depends on their political leanings, according to a new poll.",
      "publishedAt": "2024-08-08T04:01:21Z",
      "title": "Majority of Americans say democracy is on the ballot this fall but differ on threat, AP poll finds",
      "url": "https://apnews.com/9802e104ad29ff69e9e323ad46244ae3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d48edfc723a64442ab1e5b372da8933d/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Gov. Tim Walz and his fellow Democrats have enacted big changes in the two years that they've had full control of the Minnesota Legislature, from expansions of abortion and LGBTQ+ rights to tax credits and other initiatives aimed at making life easier for families.",
      "publishedAt": "2024-08-08T04:07:14Z",
      "title": "The Walz record: Abortion rights, free lunches for schoolkids, and disputes over a riot response",
      "url": "https://apnews.com/1d03387a8941cc1952e03fcf09fc1390",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a6dc16fdd1147dd9c6c5f0a4f2ba949/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI and DAN MERICA",
      "description": "MINNEAPOLIS (AP) — While former President Donald Trump and running mate JD Vance have been hammering Minnesota Gov. Tim Walz over his response to the violence that erupted after George Floyd’s murder, Trump told the governor at the time that he fully agreed with how Walz handled it.",
      "publishedAt": "2024-08-08T01:44:23Z",
      "title": "Trump praised Minnesota Gov. Walz in 2020 for response to unrest over Floyd's murder, audio shows",
      "url": "https://apnews.com/3b349ec2a8611f242333b76512a82d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3990b50035d41f1a91206b1ada02f0b/3000.jpeg"
    },
    {
      "author": null,
      "description": "VIENNA (AP) — Organizers of three Taylor Swift concerts in Vienna this week called them off on Wednesday after officials announced arrests over an apparent plot to launch an attack on an event in the Vienna area such as the concerts.",
      "publishedAt": "2024-08-07T17:32:23Z",
      "title": "Organizers cancel Taylor Swift concerts in Vienna over fears of an attack",
      "url": "https://apnews.com/7ece0b264f6e4152b8214c9fba8c425b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92497493a7b74284b25b0264aea3fa36/1920.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "Earth’s string of 13 straight months with a new average heat record came to an end this past July as the natural El Nino climate pattern ebbed, the European climate agency Copernicus announced Wednesday.",
      "publishedAt": "2024-08-08T02:02:14Z",
      "title": "July ends 13-month streak of global heat records as El Nino ebbs, but experts warn against relief",
      "url": "https://apnews.com/8dde22d29ae273544ab5c2c24071d00b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18482990f684499496039edb743d1c80/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS and JOHN MINCHILLO",
      "description": "HUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.",
      "publishedAt": "2024-08-08T04:10:28Z",
      "title": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast",
      "url": "https://apnews.com/d90428b0417df35fa1cae8b24793f5c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1e5a227500249338530e0829cab1689/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Yahya Sinwar's appointment as the top leader of Hamas formalizes a role he assumed in the early hours of Oct.",
      "publishedAt": "2024-08-07T13:47:16Z",
      "title": "Hamas has a new leader. How will that affect the war in Gaza and cease-fire efforts?",
      "url": "https://apnews.com/25d870421bb2ccd7ebc659a40d32429f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62c0bfd29d93409db97a9301c690435a/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s next leader Muhammad Yunus was heading home from an overseas trip to take office later Thursday after imploring people to stay calm and be ready to rebuild the country after an uprising that ended the 16-year, increasingly autocratic rule of former Prime Minister Sheikh Hasina.",
      "publishedAt": "2024-08-08T04:58:43Z",
      "title": "Muhammad Yunus is heading to Bangladesh to take office as its interim leader Thursday",
      "url": "https://apnews.com/8e72489d3f05ab50f1ea4564e5ad23aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/268ccb26207d413198d72ef2fa0471d9/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The last time anyone heard from Edni López was Sunday. The 33-year-old political science professor and award-winning poet was preparing to board a flight to Argentina to visit a friend when she texted from the airport that something was wrong with her passport.",
      "publishedAt": "2024-08-08T04:24:32Z",
      "title": "An aid worker's airport disappearance stirs fear of repression following disputed Venezuela election",
      "url": "https://apnews.com/f59c93361b9b17e83c3af97ce0c7f275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bd37d6776dd427494ced0eb37e8e3c7/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}