{
  "articles": [
    {
      "author": "ALI SWENSON and GARY FIELDS",
      "description": "CHARLOTTESVILLE, Va. (AP) — Few elections in the nation’s history have provided such a divide as this year's, with the two major candidates and so many of their supporters saying the outcome will determine the fate of the country and whether it can hold to its democratic moorings.",
      "publishedAt": "2024-10-31T04:10:17Z",
      "title": "US voters hear a stark message in the presidential race: The country's fate is on the line",
      "url": "https://apnews.com/17a9fcaf68ab8c1b7d12552d973937d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b301df87e444eab938809fd616cfb/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER, CHARLOTTE KRAMON, GARY D. ROBERTSON and LISA MASCARO",
      "description": "CROSS PLAINS, Wis. (AP) — At this stage of the election, the arguments have been made, the airwaves flooded with ads, the inboxes and doorsteps stuffed with flyers.",
      "publishedAt": "2024-10-31T04:20:03Z",
      "title": "A knock at the door, a chat with a neighbor, a text: Campaigns make final swing-state push",
      "url": "https://apnews.com/6fcc6812a966f98157c3d7ce530bd41e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eca41d08b56f41238aa580f78b73b445/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — You gotta hand it to Freddie Freeman, Shohei Ohtani and the Los Angeles Dodgers.The Yankees certainly did.When New York let LA back into World Series Game 5, the star-studded Dodgers did what they’ve done all year -- kept on going and finished.",
      "publishedAt": "2024-10-31T03:58:18Z",
      "title": "Dodgers win World Series in 5 games, overcome 5-run deficit with help of errors to beat Yankees 7-6",
      "url": "https://apnews.com/bd8e555b9bb5a321fff527e78e0ba637",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81d0ada04ba64bc8be9599fd061f323d/1897.jpeg"
    },
    {
      "author": "BASSEM MROUE, JULIA FRANKEL and SAMY MAGDY",
      "description": "BEIRUT (AP) — The United States and other mediators are ramping up efforts to halt the wars in Lebanon and the Gaza Strip, circulating new proposals to wind down the regional conflict during the Biden administration’s final months.",
      "publishedAt": "2024-10-30T14:01:57Z",
      "title": "A new push to wind down the Middle East wars faces familiar challenges",
      "url": "https://apnews.com/4fdcf546eb73faf26717b76b4bb3a919",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a691ddc3c241cf91c03040e35ceccf/3000.jpeg"
    },
    {
      "author": "ABED AL KAREEM HANA and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A Palestinian ambulance worker made a horrific discovery when the bloody sheet was lifted: The corpse on the stretcher was his own mother, killed by an Israeli airstrike Wednesday in central Gaza.",
      "publishedAt": "2024-10-30T21:34:02Z",
      "title": "A Gaza medic realizes he's carrying his own mother's body, killed by an Israeli airstrike",
      "url": "https://apnews.com/89c8e9bde2d3f772549fa6c0e9f77a46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8aa488f9c2fd40458ebc6e406a4a8035/1920.jpeg"
    },
    {
      "author": "LORI HINNANT",
      "description": "ZAPORIZHZHIA, Ukraine (AP) — To be a parent in the Ukrainian front-line city of Zaporizhzhia means weighing your child’s life against the Russian weapons within striking distance.Most rain death in an instant: the drones, the ballistic missiles, the glide bombs, the artillery shells.",
      "publishedAt": "2024-10-31T04:18:24Z",
      "title": "Ukrainian front-line school system goes underground to protect against bombs and radiation",
      "url": "https://apnews.com/246975f9ac147ff4e8e6e60961f6f5e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ce864bc107491ab9a9b48db9c5d994/3000.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin said Wednesday that North Korean troops wearing Russian uniforms and carrying Russian equipment are moving toward Ukraine, in what he called a dangerous and destabilizing development.",
      "publishedAt": "2024-10-30T17:31:24Z",
      "title": "North Korean troops in Russian uniforms are heading toward Ukraine, US says",
      "url": "https://apnews.com/faeabb0b2c2ea162bbc6c4691df4d6c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81877127a8524a70b609f7ad9b85d6d8/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM, KIM TONG-HYUNG and MARI YAMAGUCHI",
      "description": "SEOUL, South Korea (AP) — North Korea launched a new intercontinental ballistic missile Thursday in its first test in almost a year of a weapon designed to threaten the U.S. mainland and occurring days ahead of the U.S.",
      "publishedAt": "2024-10-30T22:29:19Z",
      "title": "North Korea launches a new intercontinental ballistic missile designed to threaten US",
      "url": "https://apnews.com/377c07eac46ad41bda0d4445df6f51d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eb6d64f41814d8e8bfd1478655bc9e7/3000.jpeg"
    },
    {
      "author": "DEEPA BHARATH",
      "description": "Diwali is the most important festival of the year in India — and for Hindus in particular.",
      "publishedAt": "2024-10-31T03:02:35Z",
      "title": "What is Diwali, the Festival of Lights? How is it celebrated in India and the diaspora?",
      "url": "https://apnews.com/a3a728c371f4d3b46dffcbf06f83773e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/489bbf08686b41bf85809378d011d747/1920.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Federal officials on Wednesday reported more cases of E. coli poisoning among people who ate at McDonald’s, as government investigators seeking the outbreak’s source identified an “onion grower of interest” in Washington state.",
      "publishedAt": "2024-10-30T22:00:52Z",
      "title": "McDonald's E. coli case count rises as federal officials inspect an onion grower",
      "url": "https://apnews.com/a38666eaf2c38dccc99c00d72879928c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9711b0b655423c83a5176b71fe7c83/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}