{
  "articles": [
    {
      "author": null,
      "description": "European Union leaders are appealing to U.S. President Donald Trump to defend their security interests at a key summit with his Russian counterpart Vladimir Putin over the war in Ukraine. The Europeans are desperate to exert some influence over a meeting that they have been sidelined from. It's unclear whether whether even Ukraine will take part. Trump says he wants to see on Friday whether Putin is serious about ending the war. But he has disappointed U.S. allies by saying that Ukraine will have to give up some Russian-held territory. In a statement early Tuesday, the EU leaders welcomed his efforts to end the war, but insisted that “the path to peace in Ukraine cannot be decided without Ukraine.”",
      "publishedAt": "2025-08-12T05:00:02Z",
      "title": "EU leaders appeal to Trump to defend Europe's security interests at his war summit with Putin",
      "url": "https://apnews.com/article/europe-trump-putin-summit-ukraine-territory-ba56ddbd24d1b7e8e0aca7754d0f180a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b1f5de/2147483647/strip/true/crop/3725x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F66%2Fc4a5e93388823b426030f9d3cdcc%2F2eb12f4eac6d47e5b9ac00538428fb50"
    },
    {
      "author": null,
      "description": "Washington, D.C., Mayor Muriel Bowser has responded to President Donald Trump's plan to take over the Metropolitan Police Department and call in the National Guard. Bowser emphasized that crime has been dropping and Trump's state of emergency doesn't match the numbers. She acknowledged that the city has little choice but to comply. Bowser linked the takeover to the larger issue of D.C. statehood, stating that limited autonomy makes the city vulnerable. Trump's decision fits a pattern of using emergency declarations to rule by executive order. Bowser maintains that violent crime has decreased, a claim supported by Trump's former U.S. attorney nominee.",
      "publishedAt": "2025-08-12T04:02:21Z",
      "title": "Washington, D.C., grapples with notion of Trump federal intervention",
      "url": "https://apnews.com/article/washington-dc-takeover-trump-mayor-crime-48b8c936a19531cacf6bfb75e2f32231",
      "urlToImage": "https://dims.apnews.com/dims4/default/417b2b1/2147483647/strip/true/crop/5061x2847+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F39%2F4c600552f7f6b04ebfe148c13a86%2F9997c994e7ef427b9c88953d4de9358d"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu is hinting that ceasefire efforts are now focused on a comprehensive deal that would release the remaining hostages in Gaza all at once. Arab officials told The Associated Press last week that mediators Egypt and Qatar are preparing a new framework for a deal that would include the release of all hostages in one go in return for a lasting ceasefire and the withdrawal of Israeli forces. The long-running indirect talks appeared to break down last month. But Egyptian state-run media reports that a Hamas delegation arrived in Cairo for talks on Tuesday.",
      "publishedAt": "2025-08-12T17:15:02Z",
      "title": "Netanyahu hints that Gaza ceasefire talks now focus on the release of all hostages at once",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-08-12-2025-1735f5b4ee74d3d531498c1ee8a5f56c",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bae07c/2147483647/strip/true/crop/7112x4001+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Fc0%2F0955ce490def09b34d5b378e9141%2F5cbae11d12094e71aa401fa2ae861e83"
    },
    {
      "author": null,
      "description": "The Georgia Bureau of Investigation says the man who fired more than 180 shots at the headquarters of the U.S. Centers for Disease Control and Prevention died of a self-inflicted gunshot wound after killing a police officer. GBI Director Chris Hosey also said that documents found in a search of the suspect’s home “expressed the shooter’s discontent with the COVID-19 vaccinations.” Hosey said 30-year-old Patrick Joseph White also recently verbalized thoughts of suicide, which led to law enforcement being contacted several weeks before the shooting. He said White fatally shot DeKalb County Police Officer David Rose during the attack.",
      "publishedAt": "2025-08-12T14:27:04Z",
      "title": "CDC shooter died from a self-inflicted gunshot wound, Georgia investigators say",
      "url": "https://apnews.com/article/cdc-shooting-georgia-gunman-slain-officer-085d0d46cf2095193f9a65807876ebd5",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "President Donald Trump has selected E.J. Antoni, chief economist at the conservative Heritage Foundation, to be the next commissioner at the Labor Department’s Bureau of Labor Statistics. Antoni’s nomination has been met with a cascade of criticism from other economists, from across the political spectrum. His selection threatens to bring a new level of politicization to what for decades has been a nonpartisan agency widely accepted as a producer of reliable measures of the nation’s economic health. While many former Labor Department officials say it it unlikely Antoni will be able to distort or alter the data, particularly in the short run, he could change the currently dry-as-dust way it is presented.",
      "publishedAt": "2025-08-12T21:52:38Z",
      "title": "Trump's nominee to oversee jobs, inflation data faces shower of criticism",
      "url": "https://apnews.com/article/trump-jobs-inflation-antoni-52aa395adc2072aa3494b88d01623f51",
      "urlToImage": "https://dims.apnews.com/dims4/default/a19f8f8/2147483647/strip/true/crop/3790x2132+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F6a%2F202683d1a6e30fc313f92e585f7c%2F7288a69aa12841fabee460085dd17e5e"
    },
    {
      "author": null,
      "description": "Texas Republican leaders say they're prepared to end their stalemated legislative special session and immediately begin another standoff with Democrats in the GOP’s efforts to redraw congressional maps as directed by President Donald Trump. Texas House Speaker Dustin Burrows confirmed the plans Tuesday during a brief session that marked another failure to meet the required attendance standards. Dozens of Democrats have left the state and left the GOP majority unable to move forward with its gerrymandering attempt. Burrows said lawmakers will not reconvene again until Friday. If Democrats are still absent, Republican Gov. Greg Abbott said he will end the current session and will call another.",
      "publishedAt": "2025-08-12T16:45:08Z",
      "title": "Trump will get another session from Texas to redraw congressional maps",
      "url": "https://apnews.com/article/trump-redistricting-gerrymandering-texas-democrats-cc0ae7f8e41528fd25a3cb11d86008f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c4e094/2147483647/strip/true/crop/3000x1688+0+211/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fed%2F1b0e203a942f3d3aa404f8533e53%2Fa7a8eb55acb240fb9e3778e27161ab8c"
    },
    {
      "author": null,
      "description": "Officials are still working to determine the cause of an explosion that rocked a steel plant outside Pittsburgh, leaving two dead and 10 injured. The blast occurred Monday at the Clairton plant in the Mon Valley. Emergency services say a fire started late morning, and a rescue effort continued into the night. The plant is still partially operational. Allegheny Health Network treated seven patients, discharging five. The rumbling from the explosion, and several smaller blasts that followed, was felt through the community about 15 miles southeast of Pittsburgh. U.S. Steel, now part of Nippon Steel, has promised a full investigation.",
      "publishedAt": "2025-08-12T04:16:10Z",
      "title": "Officials investigate what caused Pennsylvania steel plant explosion",
      "url": "https://apnews.com/article/pennsylvania-steel-plant-explosion-c0f27dce378e1f6654682c5479620196",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc7a22/2147483647/strip/true/crop/7974x4485+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F35%2Fc707d413a64158f99433dc75f23f%2F5c6b65a5eabf44d6bfb62fb79595e1d9"
    },
    {
      "author": null,
      "description": "Records show the accused 32-year-old gunman who opened fire in a Target parking lot in Texas, killing two adults and a child, has a history of arrests for domestic violence and assault. Austin police identified the suspect as Ethan Nieneker, who investigators say fired on shoppers and then stole two cars during a getaway that ended with his arrest on the other side of the city. He was being held Tuesday on capital murder charges. Authorities have not offered a possible motive for Monday’s shooting. Austin Police Chief Lisa Davis said the suspect had “a mental health history” but did not elaborate.",
      "publishedAt": "2025-08-12T17:40:15Z",
      "title": "Suspect in shooting at Texas Target store had many run-ins with police",
      "url": "https://apnews.com/article/austin-texas-target-stshooting-f657a80f997ee7d2c78ebf61f0c58008",
      "urlToImage": "https://dims.apnews.com/dims4/default/d87ea3f/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F9a%2F6bd75350160f8e54c7381a2009fe%2F5f1b6b9af99e41e3aaa5909f5ee401b0"
    },
    {
      "author": null,
      "description": "A huge basin of rainwater and snowmelt dammed by Alaska’s Mendenhall Glacier has started to release, sending a potentially record surge of flooding toward parts of Juneau in what has become an annual concern for residents. Officials in recent days have been warning people in the flood zone to be ready to evacuate. On Tuesday morning they confirmed water had started escaping the ice dam and flowing downstream, with flooding expected late Tuesday into Wednesday. In past years the flooding has swept away houses and swamped hundreds of homes. The Mendenhall Glacier is a thinning, retreating glacier that acts as a dam for Suicide Basin, which fills each spring and summer with rainwater and snowmelt.",
      "publishedAt": "2025-08-12T18:37:13Z",
      "title": "Residents urged to evacuate as Alaska’s Mendenhall Glacier releases floodwater",
      "url": "https://apnews.com/article/alaska-glacial-flooding-dam-0454d452237bbd81d5d32ce5fe25471f",
      "urlToImage": "https://dims.apnews.com/dims4/default/df099f2/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fb1%2F580083856339b5393e7f85b3e9ad%2F57bba6537d2c4bd08b0bd6417c1db574"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth has expressed pride in being part of the Communion of Reformed Evangelical Churches, a conservative Christian network. Hegseth recently shared a CNN video about the church, showing its pastors arguing women should not have the right to vote. Hegseth is among President Donald Trump’s most controversial Cabinet picks and attends a CREC church in Tennessee. The church network has connections to Christian nationalism and practices complementarianism, emphasizing traditional gender roles. Network co-founder Pastor Doug Wilson leads the flagship Christ Church in Moscow, Idaho, and is known for his hard-line theology and patriarchal views. A Pentagon spokesman says Hegseth appreciates many of Wilson’s writings and teachings.",
      "publishedAt": "2025-08-12T11:13:51Z",
      "title": "Pentagon's Hegseth part of archconservative church network CREC",
      "url": "https://apnews.com/article/pete-hegseth-crec-church-christian-nationalism-wilson-e71c3ea072fa959b5bee09a4d2093f1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f6772d0/2147483647/strip/true/crop/3939x2216+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F7f%2F77545ea973c1758e2a57371c53b7%2Fd83602155d144db298add9c608047add"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}