{
  "articles": [
    {
      "author": null,
      "description": "DUBLIN, Calif. (AP) — FBI agents conducting search at federal women's prison in California that's plagued by allegations of rampant sex abuse.",
      "publishedAt": "2024-03-11T16:45:31Z",
      "title": "FBI agents conducting search at federal women's prison in California that's plagued by allegations of rampant sex abuse",
      "url": "https://apnews.com/68cb14c98737870d2cd16754f5ff9de6",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Palestinians began fasting for the Muslim holy month of Ramadan on Monday with cease-fire talks at a standstill, hunger worsening across the Gaza Strip and no end in sight to the 5-month-old war between Israel and Hamas.",
      "publishedAt": "2024-03-11T08:20:29Z",
      "title": "Ramadan in Gaza begins with hunger worsening and no end to war in sight",
      "url": "https://apnews.com/c6835d50f91dff0443e0f7fdf5e3229f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a6a1d0465f348f48458537e353e2452/1920.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — In Republican-led states across the U.S., conservative legislators are refusing to reevaluate abortion bans — even as doctors and patients insist the laws’ exceptions are dangerously unclear, resulting in denied treatment to some pregnant women in need.",
      "publishedAt": "2024-03-11T04:11:07Z",
      "title": "Asked to clear up abortion bans, GOP leaders blame doctors and misinformation for the confusion",
      "url": "https://apnews.com/7cefca4a248076268c789ea05b367f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6431212ef4a6439a932eebb74d1a0f59/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday released a budget proposal aimed at getting voters' attention: It would offer tax breaks for families, lower health care costs, smaller deficits and higher taxes on the wealthy and corporations.",
      "publishedAt": "2024-03-11T09:03:18Z",
      "title": "Biden's budget proposal for a second term offers tax breaks for families and lower health care costs",
      "url": "https://apnews.com/9ac66a99e741dab656c15116408060a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/424d8a7e45ed4d90b8a55ebfa03078ac/2678.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Kate, Princess of Wales, apologized Monday for “confusion” caused by her editing of a family photo released by the palace — an image of Kate and her children that was intended to calm concern and speculation about the British royal's health, but had the opposite effect.",
      "publishedAt": "2024-03-11T10:54:27Z",
      "title": "Kate, Princess of Wales, apologizes for editing family photo that fueled rumors about her health",
      "url": "https://apnews.com/482fda64281b4a63ccf30364d96b2622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d87a007b40c43e3ad12673582169d21/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Nearly three-quarters of U.S. teens say they feel happy or peaceful when they don't have their phones with them, according to a new report from the Pew Research Center. In a survey published Monday, Pew also found that despite the positive associations with going phone-free, most teens have not limited their phone or social media use.",
      "publishedAt": "2024-03-11T16:03:56Z",
      "title": "Most teens report feeling happy or peaceful when they go without smartphones, Pew survey finds",
      "url": "https://apnews.com/cdf3f26dafec50ccf918787dcf608a59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25d06305c787415197abb4f55a9246b5/2935.jpeg"
    },
    {
      "author": null,
      "description": "KINGSTON, Jamaica (AP) — U.S. Secretary of State Antony Blinken is scheduled to meet Monday with Caribbean leaders in Jamaica as part of an urgent push to solve Haiti’s spiraling crisis, while pressure grows on Prime Minister Ariel Henry to resign or agree to a transitional council.",
      "publishedAt": "2024-03-11T13:12:24Z",
      "title": "Blinken will attend an urgent meeting with Caribbean leaders as Haiti's violent crisis grows",
      "url": "https://apnews.com/ff6b76b6ba9a9d7b8f95fbf95a1d462c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ae273374194d3e9edbb3250da62009/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "PONTIAC, Mich. (AP) — The parents of a Michigan school shooter declined to take their son home hours before the attack, leaving instead with a list of mental health providers after being presented with his violent drawing and disturbing messages, a counselor testified Monday.",
      "publishedAt": "2024-03-11T16:04:33Z",
      "title": "Counselor recalls morning of Michigan school attack when parents declined to take shooter home",
      "url": "https://apnews.com/4156bb0b1fc0596e03f872a4f9972af0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fce5ee147cf44b79ba3673a6eb18843/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "For much of Lee Allen Jr.'s childhood, baseball seemed quite far from him. Major League Baseball's Royals played in his hometown Kansas City, Missouri, but Allen — who is Black and lived in the inner city — didn't come across many baseball opportunities until late in his high school years.",
      "publishedAt": "2024-03-11T10:00:37Z",
      "title": "Number of Black major leaguers remains historically low, but improvement may be on the way",
      "url": "https://apnews.com/4ee0465ea22693230841a3e5fe489860",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0601a0de6d1474bb7191492e410363c/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Officials saw the crescent moon Sunday night in Saudi Arabia, home to the holiest sites in Islam, marking the start of the holy fasting month of Ramadan for many of the world's 1.8 billion Muslims.",
      "publishedAt": "2024-03-10T15:22:16Z",
      "title": "Muslims spot Ramadan crescent moon in Saudi Arabia, meaning month of fasting starts Monday for many",
      "url": "https://apnews.com/5fd52c4a981e3d61bd86432ae734aeb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d917e1452cb453981a19afb0a5565f9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}