{
  "articles": [
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden’s decision to go back on his word and issue a categorical pardon for his son, Hunter, just weeks before his scheduled sentencing on gun and tax convictions was a surprise that wasn't all that surprising.",
      "publishedAt": "2024-12-02T14:17:13Z",
      "title": "Biden's broken promise on pardoning his son Hunter is raising new questions about his legacy",
      "url": "https://apnews.com/d5c8e7fbead7218c9b1e03a290945267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d5ba8a0a09487abb59752d8f2fd932/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Already reeling from their November defeats, Democrats now are grappling with President Joe Biden’s pardoning of his son for federal crimes, with some calling the move misguided and unwise after the party spent years slamming Donald Trump as a threat to democracy who disregarded the law.",
      "publishedAt": "2024-12-02T16:55:29Z",
      "title": "Some Democrats are frustrated over Joe Biden reversing course and pardoning his son Hunter",
      "url": "https://apnews.com/267044df999f1944c05e0ed6c95957cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d6714837ecf406abcaa8d2abb32cfb3/3000.jpeg"
    },
    {
      "author": "NATALIE MELTZER and SALLY ABOU ALJOUD",
      "description": "JERUSALEM (AP) — Hezbollah fired into a disputed border zone held by Israel on Monday after multiple Israeli strikes inside Lebanon since a ceasefire took hold last week. The militant group said the volley, its first during the truce, was a warning shot in response to what it called repeated Israeli violations.",
      "publishedAt": "2024-12-02T15:38:19Z",
      "title": "Hezbollah fires into Israel-held area after multiple Israeli strikes in Lebanon since truce began",
      "url": "https://apnews.com/3f334fcb469ac465c7ae2df6922c2c17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5c5877945043ec82f37f2e6048e512/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Syria’s long civil war has reclaimed global attention after insurgents seized most of its largest city and dozens of nearby towns and villages.",
      "publishedAt": "2024-12-02T21:27:59Z",
      "title": "Key players in Syria's long-running civil war, reignited by a shock rebel offensive",
      "url": "https://apnews.com/65b2c2c864736327da1b7662a716768f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38f918b1dd914843a3ab93ada75040e7/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE",
      "description": "DOVER, Del. (AP) — A Delaware judge has reaffirmed her ruling that Tesla must revoke Elon Musk’s multibillion-dollar pay packageChancellor Kathaleen St. Jude McCormick on Monday denied a request by attorneys for Musk and Tesla’s corporate directors to vacate her ruling earlier this year requiring the company to rescind the unprecedented pay package.",
      "publishedAt": "2024-12-02T22:40:17Z",
      "title": "Delaware judge reaffirms ruling that invalidated massive Tesla pay package for Elon Musk",
      "url": "https://apnews.com/86c5811b738e3a9df2b6e4adbcd055bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1e9f5628f2e48e299b51c99ce7dae09/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "A woman who admitted to drinking and who was driving well over twice the speed limit when she smashed into a golf cart, killing a bride who had just got married at a South Carolina beach, was sentenced Monday to 25 years in prison.",
      "publishedAt": "2024-12-02T21:32:36Z",
      "title": "Woman driving drunk who killed bride still in her wedding dress sentenced to 25 years in prison",
      "url": "https://apnews.com/ed54e8a69fcc18d40718c5d60dfb914b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29ddf11da1cd458aa3782305c9d9de9e/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "A Florida woman was sentenced Monday to life in prison for zipping her boyfriend into a suitcase and leaving him to die of suffocation amid a history of domestic and alcohol abuse.Circuit Judge Michael Kraynick imposed the sentence in Orlando on Sarah Boone, 47, for the 2020 killing of 42-year-old Jorge Torres.",
      "publishedAt": "2024-12-02T21:11:32Z",
      "title": "Florida woman sentenced to life for zipping boyfriend into suitcase, suffocating him",
      "url": "https://apnews.com/1726ff4b82217ab9a7af745a24855528",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56621c0c02fb40f8a09d73bcaac45f57/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "Snow continued to fall Monday around parts of the Great Lakes region, where storm-weary residents who have plowed and shoveled for days faced the prospect of even greater accumulations.Lake-effect snow fell on parts of western New York, Pennsylvania and Ohio that were already blanketed with a foot (0.3 meters) or more over the past four days.",
      "publishedAt": "2024-12-02T09:46:17Z",
      "title": "Already buried under snow, Great Lakes region expected to see more stormy weather this week",
      "url": "https://apnews.com/2fb107ee1892db8cb9b38f7b30f123a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b0916b259e14553a5bee0f3e8482f4f/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO and WYATTE GRANTHAM-PHILIPS",
      "description": "Consumers in the United States are scouring the internet for online deals as they look to take advantage of the post-Thanksgiving shopping marathon with Cyber Monday.",
      "publishedAt": "2024-12-02T10:27:41Z",
      "title": "Cyber Monday shoppers expected to set a record on the year's biggest day for online shopping",
      "url": "https://apnews.com/59d13c2e184cc10b17c3f0bdd7573323",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5b602c269fa439c9b64e12ac8c33548/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "In nearly 100 countries and all 50 U.S. states, visual journalists with The Associated Press are eyewitnesses to the world’s news, and have won 36 of AP's 59 Pulitzer Prizes since the award was established in 1917.",
      "publishedAt": "2024-12-02T16:30:14Z",
      "title": "PHOTOS OF THE YEAR: Through photographers' lenses, an epic catalog of humanity in 2024 emerges",
      "url": "https://apnews.com/6e994410e4c7fba7d788cefe58ffb442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a3e4e6fddbd43e39862a7074e7cc5fc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}