{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The fragile cease-fire between Israel and Hamas was back on track Sunday as the militants freed 17 more hostages, including 14 Israelis and the first American, in a third set of releases under a four-day truce that the U.S.",
      "publishedAt": "2023-11-26T07:30:14Z",
      "title": "Hamas releases third group of hostages as part of truce and says it will seek to extend the deal",
      "url": "https://apnews.com/556b251fadc25a234a499e957edd218d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af79a97536404f8fbdcd2a4689b129d1/1920.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and TIA GOLDENBERG",
      "description": "JENIN REFUGEE CAMP, West Bank (AP) — Israeli forces operating in the occupied West Bank killed at least eight Palestinians, including at least one militant, in a 24-hour period, Palestinian health officials said Sunday, as a fragile pause in fighting between Israel and Hamas in the Gaza Strip entered its third day.",
      "publishedAt": "2023-11-26T07:53:57Z",
      "title": "Israeli forces kill at least 8 Palestinians in surging West Bank violence, health officials say",
      "url": "https://apnews.com/3deed25c4c14a5e3048778cbc79523c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d406ff4b26174d24a51c853e2273835f/3000.jpeg"
    },
    {
      "author": "ERIKA KINETZ",
      "description": "In audio intercepts from the front lines in Ukraine, Russian soldiers speak in shorthand of 200s to mean dead, 300s to mean wounded. The urge to flee has become common enough that they also talk of 500s — people who refuse to fight.",
      "publishedAt": "2023-11-26T05:47:42Z",
      "title": "Dead, wounded or AWOL: The voices of desperate Russian soldiers trying to get out of the Ukraine war",
      "url": "https://apnews.com/d2418788051731a32689feb821cd29ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f48793f42794a7897c3ff5be7632563/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — In spring 1955, Rosalynn Carter was doing what she had sworn to avoid when she married an ambitious Naval officer: keeping house and raising children in the same tiny town where they grew up.",
      "publishedAt": "2023-11-26T13:07:55Z",
      "title": "Rosalynn and Jimmy Carter were not only a global power couple but also best friends and life mates",
      "url": "https://apnews.com/0b3b3b6c4dcb462265253c8e98f70228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22cb4b8e109b4485b9e87e631eba54ce/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "No. 3 Washington, No. 4 Florida State and No. 5 Oregon all moved up a spot in The Associated Press college football poll Sunday, giving the Pac-12 two top-five teams for the first time since the final ranking of the 2016 season.",
      "publishedAt": "2023-11-26T19:02:56Z",
      "title": "AP Top 25: No. 3 Washington, No. 5 Oregon move up, give Pac-12 2 in top 5 for 1st time since 2016",
      "url": "https://apnews.com/5ee06d0cc556005d3838e873f5702a6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9beb92b4386d4d7795a6112986b91954/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — In a city known for its excesses, whether reaching toward the sky with the world's tallest building or hard partying at its beach resorts and bars, Dubai has pulled off another record-breaking feat in the rolling dunes of its desert outskirts.",
      "publishedAt": "2023-11-26T05:05:27Z",
      "title": "Skyscraper-studded Dubai has flourished during regional crises. Could it benefit from hosting COP28?",
      "url": "https://apnews.com/113f2b2c75431d2ab0d3d54be1681239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a48108703c346b7a0c4d42faf791c96/3000.jpeg"
    },
    {
      "author": "KATHY McCORMACK",
      "description": "Three young men of Palestinian descent who were in Burlington for a Thanksgiving holiday gathering were shot and injured — one seriously — near the University of Vermont, police said Sunday. Authorities said the attack may have been a hate crime.",
      "publishedAt": "2023-11-26T18:55:41Z",
      "title": "3 men of Palestinian descent attending holiday gathering shot, injured near University of Vermont",
      "url": "https://apnews.com/ab836d1941e4237b3649353eaceb4092",
      "urlToImage": ""
    },
    {
      "author": "MEG KINNARD and BILL BARROW",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump used college football rivalry weekend to bask among his supporters in a state and region that are key to his presidential fortunes, while trying to upstage his Republican opponent Nikki Haley on her home turf at the Clemson-South Carolina football game.",
      "publishedAt": "2023-11-25T05:03:54Z",
      "title": "Donald Trump draws cheers, some boos in Haley's backyard at Clemson-South Carolina football game",
      "url": "https://apnews.com/62ca25d5ad44bb8f1fb352805b3bcd2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6d4fc6622734642b8dcee1ba2757c9b/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Meeting for the first time in about four years, the top diplomats from South Korea, Japan and China agreed Sunday to revive cooperation among the Asian neighbors and resume their leaders’ trilateral summit — but without a specific timing.",
      "publishedAt": "2023-11-26T07:07:52Z",
      "title": "South Korea, Japan and China agree to resume trilateral leaders' summit, but without specific date",
      "url": "https://apnews.com/5914cd54c2c3ce247d6872dd32a41dae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31700338da9945058d5e7fc5acfecb0a/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK AND TRISHA AHMED",
      "description": "MINNEAPOLIS (AP) — An attorney for Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, said Saturday that Chauvin's family has been kept in the dark by federal prison officials after he was stabbed in prison.",
      "publishedAt": "2023-11-25T19:18:57Z",
      "title": "Derek Chauvin's family has received no updates after prison stabbing, attorney says",
      "url": "https://apnews.com/23c704a8cd441d270b7b542e835b69fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}