{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — About 200,000 Palestinians have streamed out of northern Gaza toward worsening conditions in the south in recent days, a U.N. agency said Tuesday, as Israeli troops battled militants around hospitals where patients, newborns and medics are stranded with no electricity and dwindling supplies.",
      "publishedAt": "2023-11-14T07:55:45Z",
      "title": "As fighting empties north Gaza, humanitarian crisis worsens in south",
      "url": "https://apnews.com/42d3e99d81672d166e720e7520796c41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b930d603771747f8a2a37e65953a5a94/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Gaza’s Shifa Hospital has become the focus of a dayslong stalemate in Israel’s war against the Hamas militant group.Shifa is Gaza’s largest and best-equipped hospital. Israel, without providing visual evidence, claims the facility also is used by Hamas for military purposes.",
      "publishedAt": "2023-11-13T22:00:39Z",
      "title": "Is Hamas hiding in Gaza's main hospital? Israel's claim is now a focal point in a dayslong stalemate",
      "url": "https://apnews.com/ce8fda9821a011a6cb6e4a3df5c90916",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a5fdd4fc05a41ed8a1d5821ca2fcc1f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and COLLEEN LONG",
      "description": "SAN FRANCISCO (AP) — President Joe Biden is looking to use this week's summit of Asia-Pacific leaders to show world leaders the United States has the gumption, attention span and money to focus on the region even as it grapples with a multitude of foreign and domestic policy crises.",
      "publishedAt": "2023-11-14T05:09:31Z",
      "title": "Biden wants to show he's focused on Asia-Pacific, while dealing with Russia-Ukraine and Mideast wars",
      "url": "https://apnews.com/3da195342650591f6bb436c864e19328",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3661d0b37c1441d821b6b379c4f2e47/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "Despite ongoing advocacy and legislation to combat anti-Asian racism that arose after the pandemic, about a third of Asian Americans and Pacific Islanders say they have experienced an act of abuse based on their race or ethnicity in the last year, including being on the receiving end of verbal harassment, slurs, physical threats or cyberbullying.",
      "publishedAt": "2023-11-14T05:03:19Z",
      "title": "1 in 3 US Asians and Pacific Islanders faced racial abuse this year, AP-NORC/AAPI Data poll shows",
      "url": "https://apnews.com/e5e8c8928dd286b48098a94c5e5f184f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/073369a0c7f6403583c2d0b040fa5ef1/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — Earlier this year, the doctor who leads the World Health Organization’s efforts to prevent sexual abuse travelled to Congo to address the biggest known sex scandal in the U.N. health agency’s history, the abuse of well over 100 local women by staffers and others during a deadly Ebola outbreak.",
      "publishedAt": "2023-11-14T06:14:14Z",
      "title": "Internal documents show the World Health Organization paid sexual abuse victims in Congo $250 each",
      "url": "https://apnews.com/f0720f9c241102a220a8d5b4a7fe52cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d14aab63f74044d8ae64bf25e4d5dde8/2000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and TAMMY WEBBER",
      "description": "Revved-up climate change now permeates Americans’ daily lives with harm that is “already far-reaching and worsening across every region of the United States,\" a massive new government report says.",
      "publishedAt": "2023-11-14T10:05:37Z",
      "title": "Worsening warming is hurting people in all regions, US climate assessment shows",
      "url": "https://apnews.com/a419265bb733adcb7c62b4111028aa0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3e83e9e525842d38c1fdc4728dc0835/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Thousands marched in Mexico's capital Monday night demanding justice for Jesús Ociel Baena, an influential LGBTQ+ figure who was found dead at home in the central city of Aguascalientes after receiving death threats.",
      "publishedAt": "2023-11-14T05:05:46Z",
      "title": "Thousands in Mexico demand justice for LGBTQ+ figure found dead after death threats",
      "url": "https://apnews.com/148d5bcf5cec7952fa5b86d5b64882ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41788072a4274253967acebf8cd2d97f/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The last time Congress tried to fund the government to prevent a federal shutdown, it cost House Speaker Kevin McCarthy his job.",
      "publishedAt": "2023-11-14T05:05:47Z",
      "title": "The last government shutdown deadline ousted the House speaker. This week's showdown could be easier",
      "url": "https://apnews.com/9cb26b703804a9e82e776e44caedcaa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee34c6177b1e43819bb6a4e37ff1f922/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ and KENYA HUNTER",
      "description": "WASHINGTON (AP) — Up to 30 million of the poorest Americans could be purged from the Medicaid program, many the result of error-ridden state reviews that poverty experts say the Biden administration is not doing enough to stop.",
      "publishedAt": "2023-11-14T05:24:01Z",
      "title": "Biden administration slow to act as millions are booted off Medicaid, advocates say",
      "url": "https://apnews.com/fe7c10276e86ab909060dd6fbea60328",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9e8075fff4649f6a21019b9a333e3b3/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation in the United States likely remained high last month, a trend that if sustained could raise concerns at the Federal Reserve, which is considering whether to raise interest rates again.",
      "publishedAt": "2023-11-14T05:01:27Z",
      "title": "Inflation likely eased last month thanks to cheaper gas but underlying price pressures may stay high",
      "url": "https://apnews.com/1f83d45fc6e30c6864d1b02913ec60c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29f8767978c94ceaa03a900d1939f227/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}