{
  "articles": [
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House on Wednesday authorized the impeachment inquiry into President Joe Biden, with every Republican rallying behind the politically charged process despite lingering concerns among some in the party that the investigation has yet to produce evidence of misconduct by the president.",
      "publishedAt": "2023-12-13T05:11:58Z",
      "title": "House approves impeachment inquiry into President Biden as Republicans rally behind investigation",
      "url": "https://apnews.com/94884b322da40ca9315ac5f4e73a3e86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd4f182e3f44fc1bb7548d90068b6ea/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump’s election interference case in Washington will be put on hold while the former president further pursues his claims that he is immune from prosecution, a judge ruled Wednesday.",
      "publishedAt": "2023-12-13T14:13:06Z",
      "title": "Judge pauses Trump’s 2020 election interference case while he appeals his immunity claim",
      "url": "https://apnews.com/20726ba42ac87cd2f3a3ffc6a2145490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbcaaedb478f4fc6a21e136f3c14127b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and MELANIE LIDMAN",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinian militants carried out one of the deadliest single attacks on Israeli soldiers since the Gaza invasion began, killing at least nine in an urban ambush, the military said Wednesday, a sign of the stiff resistance Hamas still poses despite more than two months of devastating bombardment.",
      "publishedAt": "2023-12-13T08:50:51Z",
      "title": "9 Israeli soldiers killed in Gaza City ambush in sign that Hamas resistance is still strong",
      "url": "https://apnews.com/10a0370b7b320d73def6b6a2a137f16a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/283f5b3437d942a09c17238834b94862/1920.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — A powerful rally across Wall Street sent the Dow Jones Industrial Average to a record on Wednesday after the Federal Reserve indicated that the cuts to interest rates investors crave so much may be coming next year.",
      "publishedAt": "2023-12-13T07:50:52Z",
      "title": "Stock market today: Dow hits a record as Wall Street rallies after the Fed signals rate cuts in 2024",
      "url": "https://apnews.com/00104572343cfc006f7036c4fbbf4b71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76fe9912137c4461b72e006b7f0bb3d6/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Hunter Biden on Wednesday defied a congressional subpoena to appear privately for a deposition before Republican investigators who have been digging into his business dealings.",
      "publishedAt": "2023-12-13T14:59:12Z",
      "title": "Hunter Biden defies a GOP congressional subpoena. 'He just got into more trouble,' Rep. Comer says",
      "url": "https://apnews.com/0226bb1041d7b5c10bc8c33e5d98b5e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ac2772658844b9d986f058421ad5c0f/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court agreed on Wednesday to take up a dispute over a medication used in the most common method of abortion in the United States, its first abortion case since it overturned Roe v.",
      "publishedAt": "2023-12-13T14:34:20Z",
      "title": "The Supreme Court will rule on limits on a commonly used abortion medication",
      "url": "https://apnews.com/f763b93ef632e1767fd696caec686c21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21c0f71a49514f1eb9ce20700a74c98d/3000.jpeg"
    },
    {
      "author": "JANIE McCAULEY",
      "description": "SAN FRANCISCO (AP) — Golden State Warriors forward Draymond Green was suspended indefinitely by the NBA on Wednesday, less than 24 hours after he hit Phoenix Suns center Jusuf Nurkic in the face and received a Flagrant 2 foul and ejection.",
      "publishedAt": "2023-12-14T01:16:47Z",
      "title": "Warriors star Draymond Green suspended indefinitely by NBA",
      "url": "https://apnews.com/39183c7c852b3492651c5b320349d019",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0d56398b9154ce8ae6fe38d53057c72/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "DETROIT (AP) — A stranger accused of breaking into the home of a Detroit synagogue leader was charged with her murder Wednesday, nearly two months after her body was found outdoors with multiple stab wounds, authorities said.",
      "publishedAt": "2023-12-13T22:03:49Z",
      "title": "Stranger charged with break-in and murder in slaying of Detroit synagogue leader",
      "url": "https://apnews.com/2c2ea92baf88e19ea59463d139bec043",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/208511629ad0445f9faf7ebfe43f58ea/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and CHEYANNE MUMPHREY",
      "description": "HOUSTON (AP) — A Texas high school Black student who has been disciplined and kept away from his classroom for months for refusing to change his hairstyle is not likely to be back with his regular classmates anytime soon.",
      "publishedAt": "2023-12-14T00:56:06Z",
      "title": "Texas high school Black student suspended over hair likely won't return to his class anytime soon",
      "url": "https://apnews.com/9fdf5384db15b925a6d601d746da3367",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3db33ed7eb0f421081e85edcee24c84f/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Tesla is recalling nearly all vehicles sold in the U.S., more than 2 million, to update software and fix a defective system that’s supposed to ensure drivers are paying attention when using Autopilot.",
      "publishedAt": "2023-12-13T10:30:04Z",
      "title": "Tesla recalls nearly all vehicles sold in US to fix system that monitors drivers using Autopilot",
      "url": "https://apnews.com/8060508627a34e6af889feca46eb3002",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8808e684e974d6481fac7ffd9fb0142/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}