{
  "articles": [
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG, ZEKE MILLER",
      "description": "President Donald Trump’s Middle East envoy Steve Witkoff says that a three to five year timeline for reconstruction of Gaza, as set out in a temporary truce agreement, is not viable. The U.S. administration reiterated its call on Tuesday for Arab nations to relocate displaced Palestinians in the war-torn territory. Witkoff said “it is unfair to explain to Palestinians that they might be back in five years.” He added that such a timeline is “preposterous.” The administration renewed its call on Arab nations to relocate displaced Palestinians as Trump is set to meet with Israeli Prime Minister Benjamin Netanyahu. Egypt and Jordan, as well other Arab nations, have rejected calls by Trump to relocate the territory’s 2.3 million Palestinians during post-war rebuilding.",
      "publishedAt": "2025-02-04T05:02:26Z",
      "title": "Trump envoy calls Gaza rebuilding timeline in Israel-Hamas truce 'preposterous'",
      "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3",
      "urlToImage": "https://dims.apnews.com/dims4/default/10c0012/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F73%2F261701097e5bf920278eb42123cf%2F82252b5244164906b2302c8f396c5940"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump's tariffs against China have gone into effect. Robert F. Kennedy's cabinet confirmation advances. Benjamin Netanyahu is in Washington, D.C.",
      "publishedAt": "2025-02-04T09:11:00Z",
      "title": "Live updates: Netanyahu and Trump prepare to meet in Washington and hold joint press conference",
      "url": "https://apnews.com/live/trump-presidency-updates-day-16",
      "urlToImage": "https://dims.apnews.com/dims4/default/eea4799/2147483647/strip/true/crop/4759x2677+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F%5B-%2F50%2F%2C%20-33%2C%20-49%2C%20-84%2C%20-79%2C%20107%2C%20115%2C%20108%2C%2060%2C%2099%2C%20-122%2C%20-67%2C%2092%2C%20-95%2C%2015%2C%20-121%2C%2033%2C%20101%2C%20-117%2C%20-98%2C%20-98%2C%20-117%2C%20111%2C%2073%2C%20-11%2C%20-61%2C%20-83%2C%2095%5D%2F0b17e746d3a34de3948705b450451f3d"
    },
    {
      "author": "DAVID KLEPPER, FARNOUSH AMIRI",
      "description": "Tulsi Gabbard, President Donald Trump's pick to be director of national intelligence, has moved a step closer to Senate confirmation. The Senate Intelligence Committee voted behind closed doors Tuesday to advance Gabbard's nomination to the full Senate for a vote. Gabbard is a former Democratic congresswoman and one of Trump's more divisive nominees, given past comments sympathetic to Russia, her meeting with Syria’s now-deposed leader and her past support for government leaker Edward Snowden. Given thin Republican margins in the Senate, she will need almost all GOP senators to vote yes in order to win confirmation.",
      "publishedAt": "2025-02-04T19:38:47Z",
      "title": "Tulsi Gabbard, Trump's pick to oversee US spy agencies, clears Senate committee",
      "url": "https://apnews.com/article/gabbard-trump-syria-intelligence-musk-russia-c59241818e71e701cce73161969a0a22",
      "urlToImage": "https://dims.apnews.com/dims4/default/47e5fc0/2147483647/strip/true/crop/7441x4186+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F37%2F758f3a9dde28883c7d3a2870ddc4%2Fbcc41f93d07c461a9c703542e15498e4"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "FBI agents who participated in investigations related to President Donald Trump have sued over Justice Department efforts to develop a list of employees involved in those inquiries that agents fear could be a precursor to discipline or termination. The class-action complaint was filed Tuesday in federal court in Washington. The complaint seeks an immediate halt to the Justice Development’s plans to compile a list of investigators who participated in probes of the Jan. 6, 2021 riot at the U.S. Capitol as well as Trump’s hoarding of classified documents at his Mar-a-Lago estate.",
      "publishedAt": "2025-02-04T18:05:56Z",
      "title": "FBI agents sue over effort to ID employees involved in Trump-related probes",
      "url": "https://apnews.com/article/donald-trump-fbi-justice-department-8460829a0874f91a95bc4a9d22e36fce",
      "urlToImage": "https://dims.apnews.com/dims4/default/75f0bb3/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F7b%2Ff17837024f314d7f87e3d9f43214%2F7512c874e72e4e7683c9e1f56ab01033"
    },
    {
      "author": "MICHELLE L. PRICE, AAMER MADHANI, ZEKE MILLER",
      "description": "President Donald Trump says he’s given his advisers instructions to obliterate Iran if it assassinates him. Trump adds that \"there won’t be anything left” if Iran kills him. He made the remarks in an exchange with reporters Tuesday while signing an executive order calling for the U.S. government to impose maximum pressure on Tehran. The Justice Department announced in federal charges in November that an Iranian plot to kill Trump before the presidential election had been thwarted. The department alleged Iranian officials had instructed Farhad Shakeri, 51, in September to focus on surveilling and ultimately assassinating Trump. Shakeri is still believed to be at large in Iran.",
      "publishedAt": "2025-02-04T20:21:32Z",
      "title": "Trump says he's given advisers instructions for Iran to be 'obliterated' if it assassinates him",
      "url": "https://apnews.com/article/trump-iran-assassination-88c9b1a0754165125d59d378bf4af477",
      "urlToImage": "https://dims.apnews.com/dims4/default/68c4242/2147483647/strip/true/crop/3658x2058+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F53%2F36a0bf0e4e03d624ce6c4eb946e4%2F97fb492e00534bd084a905d98321f9d1"
    },
    {
      "author": "SERKAN GURBUZ, MARYCLAIRE DALE",
      "description": "The remains of all 67 victims of midair collision near Reagan National Airport have been recovered. Officials said Tuesday that the chief medical examiner is still trying to positively identify one set of remains, officials said in a news release. The news came as crews continued to work to removed debris from the Potomac River, where the aircraft crashed last Wednesday night after colliding as the American Airlines flight was about to land at nearby Ronald Reagan National Airport. Sixty passengers and four crew were on the American Airlines flight, including figure skaters returning from the 2025 U.S. Figure Skating Championships in Wichita.",
      "publishedAt": "2025-02-04T15:28:03Z",
      "title": "Remains of all 67 victims of the deadly plane and chopper collision near DC have been recovered",
      "url": "https://apnews.com/article/washington-plane-crash-helicopter-recovery-7f492db9e867af2e184d621f56cbc4f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/067420c/2147483647/strip/true/crop/2869x1614+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F41%2F966b5f9b3188c48f10c918743e34%2F793752df6fd24a0dadb846f5c5be4284"
    },
    {
      "author": "MATTHEW LEE",
      "description": "Secretary of State Marco Rubio says “there are obviously legalities involved” in Salvadoran President Nayib Bukele’s offer to accept and jail violent American criminals. Rubio called it “a very generous offer” and said that it would allow the U.S. to outsource the cost of some of the most dangerous criminals in the United States. But he noted that “we have a Constitution” and the Trump administration “will have to make a decision.” Rubio spoke at a news conference in San Jose with Costa Rican President Rodrigo Chaves. He discussed immigration with Chaves — a Trump administration priority — as America’s top diplomat also faces major upheaval at the U.S. Agency for International Development that has left many at the aid agency fearful for their jobs.",
      "publishedAt": "2025-02-04T16:06:21Z",
      "title": "Rubio says El Salvador's offer to jail violent American criminals faces 'legalities'",
      "url": "https://apnews.com/article/rubio-trump-deportations-usaid-f7a62a10b9a5d81582d05a33ff2281a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/742135a/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F62%2Fd452ae3213af91059acc1c76b3ff%2F7180dde413ae4552b4e5b7ef1739bd2a"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "When Donald Trump started the biggest trade war since the 1930s in his first term, his impulsive combination of threats and import taxes on U.S. trading partners created chaos, generated drama -- and drew criticism from mainstream economists who favor free trade. But it didn’t do much damage to the U.S. economy. Or much good. The trade war sequel that Trump has said he’s planned for his second term could likely be costlier. Trump seems to have grander ambitions and is operating in a far more treacherous economic environment, one in which his tariffs risk rekindling inflation.",
      "publishedAt": "2025-02-04T21:06:11Z",
      "title": "Trump’s tariff tactics carry higher economic risks than during his first term",
      "url": "https://apnews.com/article/trump-tariffs-trade-inflation-mexico-china-canada-5e0cad1ba2d9ec086ddf8999b0807dff",
      "urlToImage": "https://dims.apnews.com/dims4/default/939bc37/2147483647/strip/true/crop/5773x3247+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F48%2F7bb0906befc0bd8bcaeea4399183%2F6fe503578d3c40e7bfd8dfc83c2d9eb7"
    },
    {
      "author": "AMANDA SEITZ, STEPHEN GROVES",
      "description": "Robert F. Kennedy Jr. is set to find out if he has cleared the first hurdle to become the nation's top health official when the Senate Finance Committee votes on his nomination. The vote on the controversial environmental lawyer turned public health critic is Tuesday morning. Democrats are still raising concerns about Kennedy’s potential to profit off anti-vaccine advocacy and lawsuits. But Republicans appear to be rallying behind President Donald Trump’s health secretary nominee. On Monday, a Republican once viewed as a vulnerable “no” vote, North Carolina Sen. Thom Tillis, announced he would back Kennedy. Kennedy needs support from all but three Republicans if Democrats uniformly oppose him.",
      "publishedAt": "2025-02-04T11:23:24Z",
      "title": "RFK Jr. faces key first vote to be health secretary Tuesday",
      "url": "https://apnews.com/article/trump-cabinet-kennedy-rfk-health-secretary-vote-842455e48b1f9b79fb2312937dff29f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb2d534/2147483647/strip/true/crop/6447x3626+0+336/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F46%2Ff5db7aa5af731efb2da317d0e5f3%2Fbc11833dafd348feb3dfed6cec449d4a"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "Elon Musk is rapidly consolidating control over large swaths of the federal government with President Donald Trump’s blessing. The world's wealthiest man has sidelined career officials, gained access to sensitive databases and even shut down the U.S. Agency for International Development. All of this is happening without congressional approval. Musk is working for Trump as a \"special government employee,\" which means he's not subject to the same ethics and disclosure rules that are typical of government workers. Democrats fear Musk is wielding power within the federal government without accountability and potentially against the law. Trump says Musk “is doing a good job.”",
      "publishedAt": "2025-02-03T17:36:30Z",
      "title": "Elon Musk tightens grip on federal government as Democrats raise alarms",
      "url": "https://apnews.com/article/elon-musk-donald-trump-doge-21153a742fbad86284369bb173ec343c",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f65793/2147483647/strip/true/crop/4679x2632+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F5f%2Fb6dcd8ccc23b7ca80aee2467b1e3%2F6051ddae2b1745fd99ce3198c28df781"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}