{
  "articles": [
    {
      "author": "PAUL J. WEBER and VALERIE GONZALEZ",
      "description": "AUSTIN, Texas (AP) — Employees of the largest housing provider for unaccompanied migrant children in the U.S. repeatedly sexually abused and harassed children in their care for at least eight years, the Justice Department said Thursday, alleging a shocking litany of offenses that took place as the company amassed billions of dollars in government contracts.",
      "publishedAt": "2024-07-18T18:47:15Z",
      "title": "Largest housing provider for migrant children engaged in pervasive sexual abuse, US says",
      "url": "https://apnews.com/0bfd45735aa6d41a4233abe6059f0e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f54fc405b79b445cae229c3f9bd548fb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Businesses and governments worldwide experienced hours-long disruptions Friday as a widespread technology outage affected services across industries.",
      "publishedAt": "2024-07-19T09:57:15Z",
      "title": "Internet outage latest | Airlines, businesses, border crossings hit by global tech disruption",
      "url": "https://apnews.com/f9002b97124a718a392997987d34c51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/654037e17f864796a06d5183db3a7f1e/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Much of the world faced online disarray Friday as a widespread technology outage affected companies and services across industries — grounding flights, knocking banks and hospital systems offline and media outlets off air.",
      "publishedAt": "2024-07-19T15:03:03Z",
      "title": "A massive tech outage is causing worldwide disruptions. Here's what we know",
      "url": "https://apnews.com/94b4fc5ac6eed46ddcd565a5f1e4b916",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/749bbbca251241519b2659524282a0cc/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER, LISA MASCARO, MICHAEL BALSAMO and AAMER MADHANI",
      "description": "WASHINGTON (AP) — A rapidly growing chorus of Democratic lawmakers called Friday for President Joe Biden to drop his reelection bid, even as the president insisted he’s ready to return to the campaign trail next week to counter what he called a “dark vision” laid out by Republican Donald Trump.",
      "publishedAt": "2024-07-19T05:43:43Z",
      "title": "Biden pushes party unity as he resists calls to step aside, says he'll return to campaign next week",
      "url": "https://apnews.com/329071c25dfaaae583b5f06184586267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c880b739b9d48b69c81cfebc5a2c3ed/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, MARYCLAIRE DALE, GARY FIELDS and MICHAEL KUNZELMAN",
      "description": "CABOT, Pa. (AP) — The keen of bagpipes, a three-volley gun salute and a bugle sounding taps pierced the air of a small Pennsylvania town on Friday as hundreds gathered to honor an ex-fire chief who was shot and killed at a rally for former President Donald Trump.",
      "publishedAt": "2024-07-19T04:18:28Z",
      "title": "Firefighter killed at Trump rally honored with bagpipes, gun salute and a bugle sounding taps",
      "url": "https://apnews.com/2c4930b7749cab1c53fc006a58450ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb06523d3956446688e4c08e55a8bedf/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and JIM SALTER",
      "description": "CHILLICOTHE, Mo. (AP) — A woman whose murder conviction was overturned after she served 43 years of a life sentence was released Friday, despite attempts in the last month by Missouri’s attorney general to keep her behind bars.",
      "publishedAt": "2024-07-19T16:58:33Z",
      "title": "Missouri woman who served 43 years in prison is free after her murder conviction was overturned",
      "url": "https://apnews.com/56831edcb2aa99b0430c0dbf0408dc5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c866baa7227429fb80083b6e3892923/3000.jpeg"
    },
    {
      "author": "KEVIN McGILL",
      "description": "BATON ROUGE, La. (AP) — Louisiana won't take official steps to implement a law requiring the Ten Commandments be placed in all of the state's public school classrooms until at least November as a lawsuit makes its way through the courts, according to an agreement approved by a federal judge Friday.",
      "publishedAt": "2024-07-19T18:43:23Z",
      "title": "Ten Commandments won't go in some Louisiana classrooms until at least November as lawsuit plays out",
      "url": "https://apnews.com/053e240631a8fe37e99b7543413dbaee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98b0796fcdaf448784abcdcce4ba01b1/3000.jpeg"
    },
    {
      "author": "GARY B. GRAVES",
      "description": "LOUISVILLE, Ky. (AP) — Churchill Downs has rescinded its extended suspension of Bob Baffert, allowing the Hall of Fame trainer to resume racing his horses at the historic track and partner facilities after more than three years of banishment for a failed drug test of ultimately disqualified 2021 Kentucky Derby winner Medina Spirit.",
      "publishedAt": "2024-07-19T21:25:13Z",
      "title": "Churchill Downs lifts suspension of trainer Bob Baffert following Medina Spirit's failed drug test",
      "url": "https://apnews.com/8eb89136f6598b377b971048d9ff8178",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed40a3ca62864a1dacbc7320f5958b3c/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAM METZ",
      "description": "TEL AVIV, Israel (AP) — An Iranian-made drone sent by Yemen’s Houthi rebels struck Tel Aviv on Friday, leaving one person dead and at least 10 wounded in the group’s first lethal strike into Israel.",
      "publishedAt": "2024-07-19T03:59:40Z",
      "title": "Drone strike by Yemen's Houthi rebels kills 1 person and wounds at least 10 in Tel Aviv",
      "url": "https://apnews.com/daa70aa0f6a3248a00997a281c3731ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80fdbe20442a47c892042ce727a9a486/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and ERIC TUCKER",
      "description": "TALLINN, Estonia (AP) — Arrests of Americans in Russia have become increasingly common with relations sinking to Cold War lows.",
      "publishedAt": "2024-06-25T04:11:51Z",
      "title": "Who are some of the Americans behind bars in Russia, and what are the prospects for their release?",
      "url": "https://apnews.com/9d8260f09233d2385856b85d26d3954b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc3fd457a77b4ecc894e66bf45b2e2da/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}