{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "Top Trump administration officials are openly questioning the judiciary’s authority to serve as a check on executive power as the new president’s sweeping agenda faces growing pushback from the courts. Over the last 24 hours, officials ranging from billionaire Elon Musk to Vice President JD Vance, have criticized a federal judge’s decision early Saturday that blocks Musk’s Department of Government Efficiency from accessing Treasury Department records that contain sensitive personal data such as Social Security and bank account numbers for millions of Americans. They have also attacked the legitimacy of judicial oversight, a fundamental pillar of a Democratic system based on a separation of powers.",
      "publishedAt": "2025-02-09T19:59:01Z",
      "title": "Vance and Musk question the authority of the courts as Trump faces pushback",
      "url": "https://apnews.com/article/trump-judiciary-musk-separation-of-powers-balance-checks-069c169ea1ddf6eea76f502d544c4c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/37d59a6/2147483647/strip/true/crop/7159x4027+0+373/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2F25%2Fa2a9943b8165ec42a85ccde6e0c4%2F008abfa6dea640c5b9e24ef670891226"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "Elon Musk has promised transparency as President Donald Trump's leader in making the federal government more efficient. But it hasn't worked out that way so far. Musk is used to doing things his own way as the world's richest person, and he's been avoiding public scrutiny of his work on Trump's behalf. Staff members for his so-called Department of Government Efficiency have been showing up at various federal agencies to gain access to databases and systems without public explanation of their goals. The approach has disturbed Democrats and independent watchdogs. It’s a big challenge to the concepts of consensus and transparency that are foundational in a democratic system.",
      "publishedAt": "2025-02-09T13:40:45Z",
      "title": "Elon Musk dodges DOGE scrutiny while expanding his power in Washington",
      "url": "https://apnews.com/article/elon-musk-donald-trump-doge-secrecy-68a66370cbc67c457e0a1c6edb08c5ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/81c23cf/2147483647/strip/true/crop/4776x2687+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F01%2Fac89cc420ac62d41eda0ea29ae0d%2F27a06bc4303643b69b084790ca279051"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down the agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal. Russell Vought is the newly installed director of the Office of Management and Budget. Vought directed the CFPB in a Saturday night email to stop work on proposed rules, to suspend the effective dates on any rules that were finalized but not yet effective, and to stop investigative work and not begin any new investigations. The agency has been a target of conservatives since President Barack Obama created it following the 2007-2008 financial crisis.",
      "publishedAt": "2025-02-09T16:08:36Z",
      "title": "Trump official orders consumer protection agency to stop work",
      "url": "https://apnews.com/article/trump-consumer-protection-cease-1b93c60a773b6b5ee629e769ae6850e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b953726/2147483647/strip/true/crop/5588x3143+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F3b%2F060b1f79df14ceca38d7abf2f9ef%2F150b19a0430743adb1da70f86374ff16"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "Republican skepticism in the Senate of President Donald Trump’s Cabinet nominees has been worn down. And that's put his unconventional choices for some of the most powerful positions in the federal government on the verge of confirmation. Floor votes are expected this week on Robert F. Kennedy Jr., who's in line to be the nation’s health secretary, and Tulsi Gabbard, the choice for director of national intelligence. One by one, Republicans have acquiesced to Trump’s picks, even those whose personal history, lack of experience and unorthodox views would have once made them hardly imaginable for a Cabinet.",
      "publishedAt": "2025-02-09T12:47:57Z",
      "title": "How Republican skeptics got to 'yes' on RFK Jr. and Gabbard",
      "url": "https://apnews.com/article/trump-cabinet-rfk-gabbard-vance-senate-republicans-e76b6af616715508e48084de04eecdbe",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c3cd73/2147483647/strip/true/crop/5108x2873+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F0e%2F4f879be126a4bc29d9807b73db75%2F98581235b0b940f59421cd434f9a4b93"
    },
    {
      "author": "BILL BARROW",
      "description": "Donald Trump’s second administration has advanced an avalanche of policy action and political pronouncements that have jolted Washington and, in some cases, the world. The agenda is taken largely from his “Agenda 47” campaign proposals, the Heritage Foundation’s Project 2025 and other hard-right influencers with juice in Trump’s White House. But between Trump and his allies, there is still a to-do list. It includes goals like shuttering the Department of Education, remaking U.S. higher education, loosening federal labor law and pursuing sweeping tax and trade legislation on Capitol Hill. Trump allies also want to restrict medication abortions. And the president still hasn't delivered on his promise to end wars in Ukraine and Israel.",
      "publishedAt": "2025-02-08T05:04:48Z",
      "title": "What has Donald Trump not done yet?",
      "url": "https://apnews.com/article/trump-executive-orders-agenda-goals-whats-next-49c6487c19dee2e09e8f04c7bef83a01",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea280c5/2147483647/strip/true/crop/7178x4038+0+376/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F61%2Fd2eb806deac120535f1454ff32b9%2F0e865239321649579cb6ca784772ed0f"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "Ecuadorians have voted in a presidential election that was shaping up to be a repeat of the 2023 race, when they chose a young, conservative millionaire over the leftist protégée of the country’s most influential president this century. President Daniel Noboa and Luisa González were the clear front-runners in Sunday's election among the pool of 16 candidates. All have promised to reduce the widespread crime that pushed people's lives into an unnerving new normal four years ago. The spike in violence is tied to the trafficking of cocaine from neighboring Colombia and Peru. After polls closed, the National Electoral Council reported that more than 83% of eligible voters cast ballots.",
      "publishedAt": "2025-02-09T07:07:04Z",
      "title": "Ecuador votes for president, with the conservative incumbent and a leftist lawyer in the lead",
      "url": "https://apnews.com/article/ecuador-presidential-election-gonzalez-noboa-correa-crime-3740664e53520a4586a1a8aa96c77d99",
      "urlToImage": "https://dims.apnews.com/dims4/default/49ceb52/2147483647/strip/true/crop/7142x4017+0+669/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F3b%2F30139055e70b8ebf5bbec05fd082%2F9d5198e701ce4ab6a9c6d61369b7de2a"
    },
    {
      "author": "TIA GOLDENBERG, MOHAMMAD JAHJOUH",
      "description": "Israeli officials say Israeli forces have withdrawn from a key Gaza corridor, part of Israel’s commitments under a tenuous ceasefire deal with Hamas. The deal is moving ahead but faces a major test over whether the sides can negotiate its planned extension. Israel agreed as part of the truce to remove its forces from the 4-mile Netzarim corridor, a strip of land that bisects northern Gaza from the south. While the development Sunday signals the agreement is moving ahead, the sides appear to have made little progress on negotiating the deal’s second phase, which is meant to extend the truce and lead to the release of more Israeli hostages held by Hamas.",
      "publishedAt": "2025-02-09T08:29:32Z",
      "title": "Israeli forces withdrawing from Netzarim corridor in Gaza, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-09-2025-9c36734cd5175fbb86e6d1dabe3cfc07",
      "urlToImage": "https://dims.apnews.com/dims4/default/79b8ad0/2147483647/strip/true/crop/2579x1451+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fcc%2F074ae0eda455b553e02506d11ff3%2F542d99c95fbc40f2be2318a2e065f071"
    },
    {
      "author": "MEAD GRUVER",
      "description": "U.S. efforts to put carbon dioxide from power plants and industrial facilities underground where they won't contribute to global warming could see less federal support under President Donald Trump although demand for the technology remains high. While vowing to “drill, baby, drill” for fossil fuels, Trump has ordered the U.S. to withdraw from the landmark international Paris climate accord. Meanwhile, some Republicans in Congress look to repeal all or part of the Inflation Reduction Act, which boosted a tax credit for carbon capture and storage. An order this week by Energy Secretary Chris Wright says research will prioritize “affordable, reliable and secure energy” and makes no mention of carbon capture.",
      "publishedAt": "2025-02-09T14:30:08Z",
      "title": "Efforts to put carbon dioxide underground face less support in Trump's second term",
      "url": "https://apnews.com/article/carbon-dioxide-capture-trump-tax-credit-a7290db5557a6f539eb5ba67a677aca0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ad7d33/2147483647/strip/true/crop/7993x4496+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F09%2F6f92423c56749155b6ac250dfd33%2F9db6cde17fb34d0abac252511430bac8"
    },
    {
      "author": "SAMY MAGDY",
      "description": "The United Nations humanitarian chief says famine has been mostly averted in Gaza as a surge of aid enters the territory during a fragile ceasefire, but he warns the threat could return quickly if the truce collapses. Tom Fletcher spoke to The Associated Press on Sunday after a visit to Gaza, which has seen hundreds of trucks arrive with humanitarian aid each day since the ceasefire began on Jan. 19. However, concerns are growing over whether the ceasefire can be extended, and talks are meant to begin on its more difficult second phase. The six-week first phase is halfway through.",
      "publishedAt": "2025-02-09T14:17:02Z",
      "title": "UN humanitarian chief says Gaza ceasefire has averted famine but any truce collapse brings danger",
      "url": "https://apnews.com/article/gaza-israel-palestinians-united-nations-famine-humanitarian-aid-1775e18b87b911a09443553b1571ba38",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd6884c/2147483647/strip/true/crop/7689x4325+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F4d%2Fe49383d6a0f2d6b98ba8ada1e7e5%2Fade6fb9587614625bc172b0cc5c297ca"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "Donald Trump is set to make history as the first president to attend the Super Bowl while in office. After flying from Florida to New Orleans, he's expected to meet participants in Sunday's honorary coin toss, including relatives of victims of a New Year’s Day terrorist attack in the city’s historic French Quarter, as well as members of the police department and emergency personnel. As for the Chiefs-Eagles matchup, Trump thinks Kansas City will win, with quarterback Patrick Mahomes the difference-maker. Trump says in a pregame interview with Fox News Channel's Brett Baier that “I guess you have to say that when a quarterback wins as much as he’s won, I have to go with Kansas City.”",
      "publishedAt": "2025-02-09T13:00:44Z",
      "title": "Trump at the Super Bowl, latest chapter in a complicated legacy with football",
      "url": "https://apnews.com/article/trump-nfl-super-bowl-first-president-766c628f4ea3faf38d100e4f33f2ac8c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4726ea/2147483647/strip/true/crop/3925x2208+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F0c%2F8a945ea2dc15b34f1db307c49a28%2Fa05f173872ae4b5e846f00354038f628"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}