{
  "articles": [
    {
      "author": "Konstantin Toropin, Jon Gambrell",
      "description": "The world’s largest aircraft carrier, the USS Gerald R. Ford, has been ordered to sail from the Caribbean Sea to the Middle East. That's according to a person familiar with the matter who spoke Thursday on condition of anonymity. It comes as U.S. President Donald Trump considers whether to take possible military action against Iran. The move, first reported by The New York Times, will put two carriers and their accompanying warships in the region as Trump increases pressure on Iran to make a deal over its nuclear program.",
      "publishedAt": "2026-02-13T04:44:52Z",
      "title": "Second US aircraft carrier is going to the Middle East, AP source says",
      "url": "https://apnews.com/article/trump-iran-aircraft-carrier-military-8db3fab10476949acda8b973be416204",
      "urlToImage": "https://dims.apnews.com/dims4/default/09e5af1/2147483647/strip/true/crop/4724x3148+2+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F1d%2F114777173880f03ca451fcd761a3%2Fd295d48c402440db8abee8c9da00efe3"
    },
    {
      "author": null,
      "description": "Dubai has named a new chairman for DP World, one of the world’s largest logistics companies, replacing a chairman named in the Jeffrey Epstein files. The announcement by the government’s Dubai Media Office did not specifically name Sultan Ahmed bin Sulayem. However, it said that Essa Kazim was named DP World’s chairman and Yuvraj Narayan was named group CEO. Those were positions held by Sulayem. DP World has long been a pillar of the economy of the Middle Eastern city. Newly released emails showed a yearslong friendship between Sulayem, and Epstein. Some emails referenced porn, sexual massages and escorts.",
      "publishedAt": "2026-02-13T12:08:12Z",
      "title": "Logistics giant DP World replaces chairman named in Jeffrey Epstein documents",
      "url": "https://apnews.com/article/dubai-mideast-jeffrey-epstein-chairman-replaced-82cf3efbffe5ed2c1ea89dde06c86490",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "The Associated Press",
      "description": "The fallout from the Jeffrey Epstein saga is rippling through Europe. Politicians, diplomats, officials and royals have seen reputations tarnished, investigations launched and jobs lost. It comes after a trove of more than 3 million pages of Epstein-related documents revealed their ties to the U.S. financier and convicted sex offender who died behind bars in 2019. Some experts note that the reckoning in Europe’s parliamentary democracies has been swifter and more severe for now than in the United States where Epstein built his empire and hobnobbed with many American elites.",
      "publishedAt": "2026-02-11T14:56:44Z",
      "title": "New revelations from Epstein files take a toll across Europe",
      "url": "https://apnews.com/article/epstein-files-europe-mandelson-andrew-jagland-juul-f83e424195d6af111ecec1cb9fda0ac9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e68d3c8/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F1a%2F03eada37b49ac59df2e4215114b3%2Fd91d7c36a5d743e895513a65c8f7ee01"
    },
    {
      "author": "Meg Kinnard",
      "description": "Another shutdown for parts of the federal government is expected this weekend. Funding for the Department of Homeland Security is set to expire Saturday as lawmakers debate new restrictions on President Donald Trump’s immigration enforcement agenda. The White House has been negotiating with the Democrats, but the two sides failed to reach a deal by the deadline. Unlike the record 43-day shutdown last fall, the closures will be narrowly confined, as only agencies that are part of Homeland Security will be affected. Still some federal workers could begin to miss paychecks and services like airport screening could be affected if the shutdown drags on for weeks.",
      "publishedAt": "2026-02-13T14:01:20Z",
      "title": "What to know about Homeland Security shutdown starting this weekend",
      "url": "https://apnews.com/article/homeland-security-shutdown-ice-funding-7bf62bc50ca0a6a6013a714bee2ffdb4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1799fcd/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F95%2F510d851cc0f531e401e92dd7eea0%2F6d2f920c710d42bb9fb45900c6bb125f"
    },
    {
      "author": "Marcia Dunn",
      "description": "The replacements for the astronauts involved in NASA's first medical evacuation are on their way to the International Space Station. SpaceX launched the fresh crew on Friday from Florida. The four astronauts — representing the U.S., France and Russia — should reach the orbiting lab on Saturday. They will fill the vacancies left by their evacuated colleagues. NASA had to put spacewalks on hold and defer other duties after an unidentified astronaut experienced a serious medical issue in January. The entire crew returned to Earth more than a month early, leaving three astronauts in orbit.",
      "publishedAt": "2026-02-13T10:16:36Z",
      "title": "New astronauts launch to space after medical evacuation",
      "url": "https://apnews.com/article/nasa-spacex-crew-12-space-station-fca7ba935ff24be606015d3c0c611512",
      "urlToImage": "https://dims.apnews.com/dims4/default/02ed421/2147483647/strip/true/crop/4106x2736+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F03%2Ffb4e929598272bc351c389a1026d%2F7a88bf5a0fa945faa82f89de62982d89"
    },
    {
      "author": "Michael Biesecker, Jack Brook",
      "description": "Federal prosecutors in Minneapolis have moved to drop felony assault charges against two Venezuelan men, including one shot in the leg by a immigration officer, after new evidence emerged undercutting the government’s version of events. The U.S. Attorney’s Office for the District of Minnesota said in a filing Thursday that newly discovered evidence in the case against Alfredo Alejandro Aljorna and Julio Cesar Sosa-Celis is materially inconsistent with the allegations against them. The government’s motion asked the judge for dismissal with prejudice, meaning the charges cannot be resubmitted. The pending dismissal comes after a string of high-profile shootings involving federal immigration agents have seen claims made by federal officers called into question.",
      "publishedAt": "2026-02-13T05:35:47Z",
      "title": "Prosecutors move to dismiss case against men accused of assaulting ICE officer in Minnesota",
      "url": "https://apnews.com/article/immigration-prosecutors-assault-shooting-minneapolis-charges-d713836a06471af9f38ee6ee8976a20c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3f9c86/2147483647/strip/true/crop/8261x5505+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Ff1%2F62e0fda7abda84475e301fc5a317%2Fd22523d053694d60b87218827e882500"
    },
    {
      "author": "Steve Peoples, Linley Sanders",
      "description": "A new AP-NORC poll finds that Trump's recent push to seize control of Greenland is divisive even within his own party. The survey finds that about 7 in 10 U.S. adults disapprove of how Trump is handling the issue of Greenland, a semiautonomous territory of NATO ally Denmark. That’s higher than the share who dislike how he’s handling foreign policy generally, suggesting that Trump’s Greenland approach has created a particular weak spot for the administration. Even Republicans aren’t thrilled. About half don’t like his attempt to turn the icebound landmass into American territory, something that Trump has insisted is critical for national security in the Arctic.",
      "publishedAt": "2026-02-13T12:03:29Z",
      "title": "Many Republicans disapprove of Trump on Greenland, new poll finds",
      "url": "https://apnews.com/article/poll-trump-greenland-denmark-foreign-policy-europe-nato-f3922181bc50223f31a561aafaf4cf3f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ce9e5c/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F2b%2F905de2f2028e676ebe7ae9d8cb04%2Ff4f0dce33fb843708c709a7351b98673"
    },
    {
      "author": "Ed White",
      "description": "More than 4,000 calls came into an Arizona sheriff's department within 24 hours after the release of videos of a masked person on Nancy Guthrie’s porch. Many will be worthless. Others could have merit. Experts say one thing’s certain: The tips can’t be ignored. Images of a mysterious person have been the most significant clues shared with the public during Guthrie’s disappearance in the Tucson area. She is the mother of NBC “Today” co-anchor Savannah Guthrie. Roberto Villaseñor, a former Tucson police chief, says processing tips is a tremendous amount of work. The FBI says it has collected more than 13,000 tips since Feb. 1., and the sheriff's office says it's received at least 18,000.",
      "publishedAt": "2026-02-13T05:08:08Z",
      "title": "Investigators deluged with tips after public sees videos from Nancy Guthrie's porch",
      "url": "https://apnews.com/article/nancy-guthrie-kidnapping-tips-arizona-9a34c55e06f0ffd891ea4368f2b3a038",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb699eb/2147483647/strip/true/crop/3500x2332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F02%2F345c2662ada454054e67cbba7cbb%2Fd5aa0c1bdc3f49aa9f131636a617c791"
    },
    {
      "author": "Christopher Rugaber",
      "description": "A key measure of inflation fell to nearly a five-year low last month as apartment rental price growth slowed and gas prices fell, offering some relief to Americans still grappling with the sharp increase in costs of the past five years. Friday’s report suggests inflation could be cooling, but it comes after the cost of food, gas, and apartment rents have soared since the pandemic, with consumer prices about 25% higher than they were five years ago. The increase in such a broad range of costs has become a high-profile political issue under the rubric of “affordability.”",
      "publishedAt": "2026-02-13T05:01:36Z",
      "title": "Inflation measure falls to nearly five-year low as gas prices fall and housing costs cool",
      "url": "https://apnews.com/article/inflation-trump-economy-prices-d489cfa4b48e32232f136830333d1db0",
      "urlToImage": "https://dims.apnews.com/dims4/default/ead5334/2147483647/strip/true/crop/5300x3532+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Ff8%2F304c49b715159b3c9aa7b2c9ec7e%2F27ce0876d3ca4aa18d4928bca8826a71"
    },
    {
      "author": "Tim Reynolds",
      "description": "Ukrainian skeleton racer Vladyslav Heraskevych has lost his bid to overturn an Olympic disqualification tied to a planned helmet tribute. The Court of Arbitration for Sport rejected his appeal Friday. The court sides with the International Olympic Committee and the sport’s governing body. They say his helmet design breaks Olympic rules. Heraskevych wants to wear a helmet showing the faces of more than 20 Ukrainian coaches and athletes who have been killed since Russia invaded Ukraine four years ago. Heraskevych says he already knows there is no path to race.",
      "publishedAt": "2026-02-13T09:55:14Z",
      "title": "CAS denies appeal of Ukrainian skeleton athlete Vladyslav Heraskevych",
      "url": "https://apnews.com/article/ukraine-helmet-olympics-ioc-e30925eeee2bb557ab22e2671070e856",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ec74f0/2147483647/strip/true/crop/4032x2687+0+169/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F32%2F19d116e536740c7c20aacaf925b6%2F61853843570044d0a55c7c69ebf86b38"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}