{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "RAFAH, Gaza Strip (AP) — Israeli strikes across Gaza killed at least 18 people overnight and into Sunday, according to medics and witnesses, as the United States said it would veto another draft U.N.",
      "publishedAt": "2024-02-18T08:19:52Z",
      "title": "Israel strikes across Gaza as US says it will block another cease-fire resolution at UN",
      "url": "https://apnews.com/380f901e8c2f52d537d0aa9f9bf0a6bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5a98cc57c1c446cbe66fc3672756fb5/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and JULIA FRANKEL",
      "description": "THE HAGUE, Netherlands (AP) — The United Nations' highest court opens historic hearings Monday into the legality of Israel's 57-year occupation of lands sought for a Palestinian state, plunging the 15 international judges back into the heart of the decades-long Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-18T05:07:41Z",
      "title": "Top UN court to hold hearings on legality of the Israeli occupation of Palestinian-claimed lands",
      "url": "https://apnews.com/8e194a5d96bc6a2264a0bb3de8576210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32db803a35dc495eab7ca900eb84d369/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Over 400 people were detained in Russia while paying tribute to opposition leader Alexei Navalny, who died at a remote Arctic penal colony, a prominent rights group reported.",
      "publishedAt": "2024-02-18T09:30:59Z",
      "title": "Over 400 detained in Russia as country mourns the death of Alexei Navalny, Putin's fiercest foe",
      "url": "https://apnews.com/d0121f49840ee1cd6fbf94f6d7249e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70d0b1b9c58548599aeef03cf027417a/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and JILL COLVIN",
      "description": "WATERFORD TOWNSHIP, Mich. (AP) — Former President Donald Trump railed against the judge who slapped him with a $355 million fine in his New York civil fraud trial and went after the long list of prosecutors with cases against him as he campaigned in Michigan Saturday night while facing penalties that, with interest, could exceed half-a-billion dollars.",
      "publishedAt": "2024-02-18T02:18:21Z",
      "title": "Trump rails against New York fraud ruling as he faces fines that could exceed half-a-billion dollars",
      "url": "https://apnews.com/f264eac7cbba97c4e83919642d42bc97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5cd5a1988234f14ac97add8342c54f4/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Since Jimmy Carter entered hospice care at his home in south Georgia one year ago, the former U.S.",
      "publishedAt": "2024-02-18T05:08:37Z",
      "title": "A year after Jimmy Carter's entered hospice care, advocates hope his endurance drives awareness",
      "url": "https://apnews.com/c93498575e806f1a1d83714cf8e5c0b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc1bd05406684f55ba738b5d61213dce/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia said its forces took complete control Saturday of a city in eastern Ukraine that was the focus of intense combat for months, a development that Moscow could use to boost morale as the second anniversary of its full-scale invasion of Ukraine approaches with the war largely at a stalemate.",
      "publishedAt": "2024-02-16T11:21:37Z",
      "title": "Russia takes control of a city in eastern Ukraine after Ukrainian troops withdraw",
      "url": "https://apnews.com/c31eb7439d1983532a3f940061efe6e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b59d65701f8441da9efb78233ebd332/3000.jpeg"
    },
    {
      "author": "MATT BROWN and JOCELYN NOVECK",
      "description": "Fulton County District Attorney Fani Willis is used to prosecuting high-profile, challenging cases. But as she parried questions about her own personal conduct from the witness stand against the legal teams for defendants her office has accused of election interference, many Black women recognized a dispiriting scene.",
      "publishedAt": "2024-02-17T05:14:29Z",
      "title": "Fani Willis' testimony evokes long-standing frustrations for Black women leaders",
      "url": "https://apnews.com/7ac852848693c0180cbbfc2af358bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e359af32b66e47c19c30b7a19f7caa61/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Thailand’s former Prime Minister Thaksin Shinawatra, the Southeast Asian nation’s most controversial politician for more than two decades, was released on parole early Sunday from a Bangkok hospital where he spent six months serving time for corruption-related offenses.",
      "publishedAt": "2024-02-17T23:23:15Z",
      "title": "Thai ex-Prime Minister Thaksin gets free on parole, but can he restore his old political luster?",
      "url": "https://apnews.com/5a70a3401fcb17a7fe8dd2f5378c3e61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d1e550a39e490c8037130ff85cfc1d/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "BANGKOK (AP) — China is stepping up patrols in the waters off the coast of Taiwan’s Kinmen archipelago, days after two of its fishermen drowned while being chased by the Taiwanese coast guard, which accused the boat of trespassing.",
      "publishedAt": "2024-02-18T07:13:45Z",
      "title": "China's coast guard to ramp up patrols near Taiwan's Kinmen archipelago after two fishermen die",
      "url": "https://apnews.com/c054f13464310ad4d13872a410f73e9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c12da3f9d65442aca89c965e939cc904/3000.jpeg"
    },
    {
      "author": "AKIRA OLIVIA KUMAMOTO",
      "description": "LOS ANGELES (AP) — Samantha Sumiko Pinedo and her grandparents file into a dimly lit enclosure at the Japanese American National Museum and approach a massive book splayed open to reveal columns of names.",
      "publishedAt": "2024-02-18T05:11:38Z",
      "title": "Solemn monument to Japanese American WWII detainees lists more than 125,000 names",
      "url": "https://apnews.com/0f38e8491baa0b0533d75fdbcc625661",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb486cf723a2494e97985f36c0baf9a9/2225.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}