{
  "articles": [
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump hosted a rally featuring crude and racist insults at New York’s Madison Square Garden Sunday, turning what his campaign had dubbed as the event where he would deliver his closing message into an illustration of what turns off his critics.",
      "publishedAt": "2024-10-27T04:02:46Z",
      "title": "Trump's Madison Square Garden event features crude and racist insults",
      "url": "https://apnews.com/fcfe75be7f8281fde7bffa3adb3bba5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90442bea31574317964c9f74b71439ad/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MARYCLAIRE DALE and CHRIS MEGERIAN",
      "description": "PHILADELPHIA (AP) — Kamala Harris said Sunday that “no one can sit on the sidelines” in this year's presidential election, capping a day of campaigning across the largest city in the crucial battleground state of Pennsylvania.",
      "publishedAt": "2024-10-27T09:28:21Z",
      "title": "Harris rallies Philadelphia voters at church, barbershop, bookstore, restaurant and basketball court",
      "url": "https://apnews.com/640ea532f6de541a5e03509bfe1471ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f00bdf07945428b88922b29427973e7/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The social platform X has suspended a new account on behalf of Iran’s Supreme Leader Ayatollah Ali Khamenei that posted messages in Hebrew.The account was suspended early Monday with a brief note appended to it saying: “X suspends accounts which violate the X Rules.” It wasn’t immediately clear what the violation was.",
      "publishedAt": "2024-10-28T02:55:06Z",
      "title": "Middle East latest: Social platform X suspends new account on behalf of Iran's supreme leader",
      "url": "https://apnews.com/6e9675722f26251037569ee8ae655088",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43e156f20e794f7c95bfb9a3702e9dd2/2500.jpeg"
    },
    {
      "author": "ALBERT AJI",
      "description": "QUSAIR, Syria (AP) — A stream of refugees fleeing Lebanon to Syria crossed a narrow makeshift bridge on foot Sunday in the Qusair area of Syria’s Homs province after the official border crossing was put out of commission by an Israeli strike two days earlier.",
      "publishedAt": "2024-10-27T18:28:48Z",
      "title": "Destruction of Lebanon-Syria border crossings in Israeli airstrikes creates difficulties",
      "url": "https://apnews.com/051cf8de4bf5bb5a9448e562ec06fb19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84fa0181cef548fcaef9d6422cbbf391/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — Three well-armed militias launched a surprise joint offensive in northeastern Myanmar a year ago, breaking a strategic stalemate with the regime's military with rapid gains of huge swaths of territory and inspiring others to attack around the country.",
      "publishedAt": "2024-10-28T03:33:56Z",
      "title": "A year of attacks by Myanmar's resistance has pushed the military regime close to the brink",
      "url": "https://apnews.com/60c0edaed37153fde75b1b838670c441",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0fb1d79dc874706ba91f6475816def1/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — McDonald’s announced Sunday that Quarter Pounders will again be on its menu at hundreds of its restaurants after testing ruled out beef patties as the source of the outbreak of E.",
      "publishedAt": "2024-10-27T22:34:22Z",
      "title": "McDonald’s Quarter Pounder back on the menu after testing rules out beef patties as E. coli source",
      "url": "https://apnews.com/fe0b86b40857b09dc01c001eacea3b67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50917ab551b6428592857c412690f556/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "TBILISI, Georgia (AP) — Georgia’s president said Sunday she did not recognize the results of this weekend’s parliamentary vote, which election officials say was won by the ruling party, adding that the country fell victim to a “Russian special operation” aimed at moving it off a path toward Europe.",
      "publishedAt": "2024-10-27T09:01:03Z",
      "title": "Georgian president won't recognize parliamentary election result and calls for a protest",
      "url": "https://apnews.com/8f040cb30e1d9c9e778383cbcbb7b2c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55561c48ca5f49ef9f1fbf9a54e72999/2270.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian forces thwarted an attempt at another cross-border incursion by Ukraine into southwestern Russia, a local official reported Sunday, months after Kyiv staged a bold assault on its nuclear-armed enemy that Moscow is still struggling to halt.",
      "publishedAt": "2024-10-27T17:41:47Z",
      "title": "Russian forces thwart attempted cross-border assault from Ukraine, official says",
      "url": "https://apnews.com/5e37bb46493fa704f942e21c9203334c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19ad66ad15504d739460930afc64f21b/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese Prime Minister Shigeru Ishiba’ s ruling coalition lost a majority in the 465-seat lower house in a key parliamentary election Sunday, a punishment by voters' outrage over the governing party’s extensive financial scandals.",
      "publishedAt": "2024-10-27T00:12:09Z",
      "title": "Japan's ruling coalition loses a majority in the lower house, creating political uncertainty",
      "url": "https://apnews.com/5c6509c7b83963ffe40588c50998967c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8c249a8580d469bb5983d7d376aedba/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Fighters from the notorious paramilitary Rapid Support Forces ran riot in east-central Sudan in a multi-day attack that killed more than 120 people in one town, a doctors group and the United Nations said.",
      "publishedAt": "2024-10-27T13:03:52Z",
      "title": "More than 120 killed in paramilitary rampage in east-central Sudan, UN and a doctors group say",
      "url": "https://apnews.com/6693a4a8c10baa49e8bc70506bc170d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64dbd04caff24eedaf89e909e47711a6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}