{
  "articles": [
    {
      "author": "MELANIE LINDMAN, WAFAA SHURAFA, and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Tens of thousands of Israelis thronged central Jerusalem on Sunday in the largest anti-government protest since the country went to war in October.",
      "publishedAt": "2024-03-31T11:31:42Z",
      "title": "Israelis stage largest protest since war began to increase pressure on Netanyahu",
      "url": "https://apnews.com/2dfbc154409ae6160b4e594b1b346e13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba2f0033b40846b1969bc62a192f80d2/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis rallied from a winter-long bout of respiratory problems to lead some 60,000 people in Easter celebrations Sunday, making a strong appeal for a cease-fire in Gaza and a prisoner swap between Russia and Ukraine.",
      "publishedAt": "2024-03-31T08:40:45Z",
      "title": "Pope overcomes health concerns to preside over Easter Mass and appeal for peace in Gaza and Ukraine",
      "url": "https://apnews.com/a89541850baa416f69060ae8e699abac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f06ddaa33d5043d3a0db076fca5936fd/2000.jpeg"
    },
    {
      "author": "MIKE PESOLI and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — As divers assisted crews with the complicated and meticulous operation of removing the steel and concrete from the fallen Francis Scott Key Bridge in Baltimore, some near the site took time on Easter Sunday to reflect on the six workers presumed to have plunged to their deaths.",
      "publishedAt": "2024-03-31T17:00:51Z",
      "title": "Crews at Baltimore bridge collapse continue meticulous work of removing twisted steel and concrete",
      "url": "https://apnews.com/e656b7f2efcc7770de9c2d922faa7b20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69677de0298041dba5d99b0044de9347/1920.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — The theft of sensitive information belonging to millions of AT&amp;T's current and former customers has been recently discovered online, the telecommunications giant said this weekend.",
      "publishedAt": "2024-03-31T21:32:53Z",
      "title": "AT&T says a data breach leaked millions of customers' information online. Were you affected?",
      "url": "https://apnews.com/f0dda2b1d266a6068ffc607afd94b779",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/650120b63e2e4165a29d078cdc4871a2/3000.jpeg"
    },
    {
      "author": "SUZAN FRASER and CINAR KIPER",
      "description": "ANKARA, Turkey (AP) — Turkey's main opposition party retained its control over key cities and made huge gains elsewhere in Sunday's local elections, in a major upset to President Recep Tayyip Erdogan, who had set his sights on retaking control of those urban areas.",
      "publishedAt": "2024-03-31T04:06:09Z",
      "title": "In setback to Turkey's Erdogan, opposition makes huge gains in local election",
      "url": "https://apnews.com/8adc4df56cdbce24f78900e1d142ff21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4773d807a04c4d4b9808fc71ad5635aa/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japan said Sunday its experts have held talks with their Chinese counterparts to try to assuage Beijing’s concerns over the discharge of treated radioactive wastewater from the wrecked Fukushima Daiichi nuclear power plant into the sea.",
      "publishedAt": "2024-03-31T10:44:29Z",
      "title": "Japan confirms experts met in China to ease concerns over discharge of treated radioactive water",
      "url": "https://apnews.com/10907cf4618cfc499eae164897a88724",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/967f9bee85064845923d1083018eed0e/2751.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A Russian cruise missile strike on infrastructure in Ukraine’s western Lviv region killed one man, while another died in an attack in the northeast, officials said Sunday.The attack in Lviv destroyed a building and sparked a fire, Gov.",
      "publishedAt": "2024-03-31T09:49:25Z",
      "title": "2 dead as Russia launches attacks on Ukraine's energy infrastructure",
      "url": "https://apnews.com/de446fa5182eb4b1480783b402b01d9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c68a6b878a479daa69bad6141268f2/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Armed gunmen attacked a group of people in Ecuador ’s coastal city of Guayaquil killing nine and injuring 10 others, police said Sunday, the latest in a string of violent incidents in the South American country.",
      "publishedAt": "2024-03-31T17:42:15Z",
      "title": "Gunmen in Ecuador kill 9, injure 10 others in attack in coastal city of Guayaquil as violence surges",
      "url": "https://apnews.com/82895468cbeafd6246a59840a35741cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/959dadd55e154201b1f4c7ced91749b5/3000.jpeg"
    },
    {
      "author": "PAT EATON-ROBB",
      "description": "ALBANY, N.Y. (AP) — The Los Angeles Times has edited a column it published last week about the LSU women's basketball team ahead of its game against UCLA following criticism from Tigers coach Kim Mulkey, who blasted it as sexist and hurtful.",
      "publishedAt": "2024-03-30T21:56:21Z",
      "title": "Newspaper edits its column about LSU-UCLA game after Tigers coach Kim Mulkey blasted it as sexist",
      "url": "https://apnews.com/4fe14920805aea78c968017469e8d372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc2559d4e51464ea89af8deb8f40e47/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "ALBANY, N.Y. (AP) — Caitlin Clark and Angel Reese have been catalysts for the rapid rise of women's college basketball because of their play on the court that has drawn millions of new fans to the sport and their success off of it.",
      "publishedAt": "2024-03-31T16:11:00Z",
      "title": "Caitlin Clark and Angel Reese are a major part of the rise of women's college basketball",
      "url": "https://apnews.com/3bcea7b33acc3c96f269cb19805426da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4ccefa7a96c48bbbc8452c1cfdb3559/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}