{
  "articles": [
    {
      "author": "TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — U.S. President Joe Biden called Prime Minister Benjamin Netanyahu’s handling of the war in Gaza a mistake and called for his government to flood the beleaguered territory with aid, ramping up pressure on Israel to reach a cease-fire and widening a rift between the two staunch allies.",
      "publishedAt": "2024-04-10T07:24:52Z",
      "title": "Biden says Netanyahu's approach to the war is a mistake, deepening a rift between the two allies",
      "url": "https://apnews.com/fad770cbe77a7ae7d1de8568dbabd460",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15aadd34abe94c32988b3854726222a1/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israel's foreign minister threatened Wednesday that his country's forces would strike Iran directly if the Islamic Republic launched an attack from its territory against Israel, as tensions between the rival powers flare following the killings of Iranian generals in a blast at the Iranian consulate in Syria.",
      "publishedAt": "2024-04-10T06:22:28Z",
      "title": "Israel threatens to strike Iran directly if Iran launches attack from its territory",
      "url": "https://apnews.com/b2e8625500409405c9dc88731063fa71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/639ffef7d6f74a469eb10537bddf00bc/2200.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD and MORGAN LEE",
      "description": "PHOENIX (AP) — The Arizona Supreme Court has delivered a landmark decision in giving the go-ahead to enforce a long-dormant law that bans nearly all abortions, drastically altering the legal landscape within the state around terminating pregnancies.",
      "publishedAt": "2024-04-10T02:45:32Z",
      "title": "What to know about the Arizona Supreme Court ruling that reinstates an 1864 near-total abortion ban",
      "url": "https://apnews.com/797a4bbbc738497fe2284d6870c5be24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6177fe5640e94ee49a180de541b5b798/1920.jpeg"
    },
    {
      "author": "JAMES ELLINGWORTH",
      "description": "Track and field is set to become the first sport to introduce prize money at the Olympics, with World Athletics saying Wednesday it would pay $50,000 to gold medalists in Paris.The move is a symbolic break with the amateur past of the Olympics in one of the games' most-watched events.",
      "publishedAt": "2024-04-10T08:50:00Z",
      "title": "Track and field becomes first sport to pay prize money at Olympics. Paris gold medalists get $50,000",
      "url": "https://apnews.com/867d25da6c5a25abbaef5b5859f4e780",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2233930bd9624b2fba1252c4ed8ff4ec/2660.jpeg"
    },
    {
      "author": "NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — Muslims around the world celebrated the Eid al-Fitr holiday Wednesday, marking the end of the Islamic holy month with family reunions, new clothes and sweet treats. But the celebrations were overshadowed by the worsening humanitarian crisis in the Gaza Strip and Israel’s expected offensive in the city of Rafah despite efforts from its Western allies to halt the fighting after six months of war.",
      "publishedAt": "2024-04-10T03:59:23Z",
      "title": "Muslims worldwide celebrate Eid al-Fitr, but the festivities are marred by the war in Gaza",
      "url": "https://apnews.com/868fcffe89540389339ae67f64d070cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c920ef0bc239433386bf26fff0d0d241/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden is set to host Japanese Prime Minister Fumio Kishida on Wednesday for talks on the delicate security situation in the Pacific and a glitzy state dinner, honoring a leader who has proven to be one of Biden's strongest allies in the face of a string of international crises.",
      "publishedAt": "2024-04-10T09:09:33Z",
      "title": "Biden to honor PM Kishida, reflect on Japan's growing clout on international stage",
      "url": "https://apnews.com/759416877deecdae289aea681963a194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0d960a56799487cbdd510be28c66e82/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s liberal opposition parties were expected to win a landslide victory in Wednesday’s parliamentary election, initial exit polls suggested, a result that if confirmed would make conservative President Yoon Suk Yeol a lame duck for his remaining three years in office.",
      "publishedAt": "2024-04-09T14:04:59Z",
      "title": "Exit polls suggest a big win by South Korea’s liberal opposition parties in parliamentary election",
      "url": "https://apnews.com/c362a024e6eff3d4a410927be00b4d0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d546470c203e41cf845d15a5abfba6a5/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — An eagerly awaited report Wednesday on consumer prices will show whether inflation is still easing, a trend the Federal Reserve will weigh in deciding when and by how much — or even whether — to cut interest rates this year.",
      "publishedAt": "2024-04-10T04:01:22Z",
      "title": "Key question before US reveals latest consumer prices: Is inflation cooling enough for the Fed?",
      "url": "https://apnews.com/f02b969d1b44a7ccb0385be03f766de0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb9e5df7a23a46098630e19f53a25096/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS",
      "description": "The Biden administration on Wednesday finalized strict limits on certain so-called “forever chemicals” in drinking water that will require utilities to reduce them to the lowest level they can be reliably measured.",
      "publishedAt": "2024-04-10T09:05:18Z",
      "title": "Biden administration imposes first-ever national drinking water limits on toxic PFAS",
      "url": "https://apnews.com/1c8804288413a73bb7b99fc866c8fa51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df7f192a912e4d469976d3b286936c51/3000.jpeg"
    },
    {
      "author": "COLLEEN BARRY",
      "description": "FLORENCE, Italy (AP) — Amanda Knox was back on trial for slander Wednesday for wrongly accusing a Congolese man of murdering her roommate while the young women were exchange students in Italy.",
      "publishedAt": "2024-04-10T07:17:17Z",
      "title": "Italy opens new slander trial against Amanda Knox. She was exonerated 9 years ago in friend's murder",
      "url": "https://apnews.com/bf365f08a59698ffcfd31f208c1a7d9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b04c8374a8d49058c507d1867e16321/2051.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}