{
  "articles": [
    {
      "author": "Colleen Slevin, Eric Tucker",
      "description": "Authorities say a man who wounded 12 people in an attack on a group holding their weekly demonstration for the release of Israeli hostages in Gaza had planned to kill them all but appeared to have second thoughts. They say Mohamed Sabry Soliman had 18 Molotov cocktails but threw just two during Sunday’s attack in which he yelled “Free Palestine. The two incendiary devices he did throw into the group of about 20 people were enough to wound more than half of them, and authorities say he expressed no regrets about the attack. Federal and state prosecutors have filed separate criminal cases against Soliman, charging him with a hate crime and attempted murder, respectively.",
      "publishedAt": "2025-06-03T05:03:34Z",
      "title": "Boulder attacker planned to kill demonstrators but got scared, police say",
      "url": "https://apnews.com/article/molotov-cocktails-boulder-attack-injured-f2af62386989f6b79a5e1844a2c9dce5",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b23bd/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F40%2Fb4aa5fe3bf11f5ae8518bbec1ff7%2F523bb0e61f474bcab0871746f0b0c143"
    },
    {
      "author": "Illia Novikov",
      "description": "Ukraine President Volodymyr Zelenskyy described a Russian attack on Sumy city center as “brutal.” “That’s all you need to know about Russia’s ‘desire’ to end this war,” Zelenskyy wrote in a post on Telegram. The attack on Tuesday came a day after direct peace talks made no progress on ending the 3-year war. Sumy authorities said at least three people were killed when a barrage of rockets struck apartment buildings and a medical facility. The war has killed more than 12,000 Ukrainian civilians, according to the United Nations, as well as tens of thousands of soldiers on both sides.",
      "publishedAt": "2025-06-03T10:09:37Z",
      "title": "Zelenskyy condemns 'brutal' Russian rocket attack after 3 killed in Ukrainian city",
      "url": "https://apnews.com/article/russia-ukraine-sumy-attack-zelenskyy-a6a513e388768e1d5179498302945bd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3b67b5/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F13%2Fb388154d2f84e234aeb2228a80f3%2Fa57e3bbc50b34c3ead49c4c57bf51efc"
    },
    {
      "author": "Mohammad Jahjouh, Samy Magdy",
      "description": "Palestinian health officials and witnesses say Israeli forces fired on people as they headed toward an aid distribution site Tuesday, killing at least 27, in the third such incident in three days. The army said it fired “near a few individual suspects” who left the designated route, approached its forces and ignored warning shots. The near-daily shootings have come after an Israeli and U.S.-backed foundation established aid distribution points inside Israeli military zones, a system it says is designed to circumvent Hamas. The United Nations has rejected the new system, saying it doesn’t address Gaza’s mounting hunger crisis and allows Israel to use aid as a weapon. The Israeli military said it was looking into reports of casualties on Tuesday.",
      "publishedAt": "2025-06-03T05:15:25Z",
      "title": "Gaza officials say Israeli forces killed 27 heading to aid site. Israel says it fired near suspects",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-03-2025-24ce3d395c7058362e650f2330a6476f",
      "urlToImage": "https://dims.apnews.com/dims4/default/002d4b4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F0d%2F28bb1c8d93e97cd8c5f4db07f75e%2F5da0ac1f57204ac9ba1c2df2b06dc25f"
    },
    {
      "author": "Lisa Mascaro, Mary Clare Jalonick",
      "description": "President Donald Trump wants his “big, beautiful” bill of tax breaks and spending cuts on his desk to be singed into law by Independence Day. And he’s pushing the slow-rolling Senate to make it happen sooner rather than later. Trump met with Senate Majority Leader John Thune at the White House early this week and has been dialing senators for one-on-one chats, using both the carrot and stick to encourage them to act. But it’s still a long road ahead for the 1,000-page-plus package. Senators want to make changes to protect Medicaid and to make sure some tax breaks become permanent.",
      "publishedAt": "2025-06-03T16:36:32Z",
      "title": "Trump pushes a deadline for tax bill as Republican senators dig in",
      "url": "https://apnews.com/article/trump-big-bill-senate-gop-debt-a0679756c6af762ac0291be6cb647145",
      "urlToImage": "https://dims.apnews.com/dims4/default/760167a/2147483647/strip/true/crop/3210x1806+0+167/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Ff5%2Fee6bb81684e5dea1d0ba969f6e21%2Fcd46d7ec775045609716d60bf810445b"
    },
    {
      "author": "Mike Catalini",
      "description": "Newark Mayor Ras Baraka has sued New Jersey’s top federal prosecutor over his arrest outside a federal immigration detention facility on a trespassing charge, saying the Trump-appointed attorney had pursued the case out of political spite. Baraka was denied entry to Delaney Hall and arrested on May 9. He was trying to join three Democratic members of Congress who went to conduct oversight. His trespassing charge was later dropped. Baraka is a candidate in a crowded field for the Democratic nomination for governor in the June 10 primary election. The lawsuit against interim U.S. Attorney for New Jersey Alina Habba was filed Tuesday, the day early in-person voting began.",
      "publishedAt": "2025-06-03T15:21:16Z",
      "title": "Newark mayor sues prosecutor after arrest at immigration detention site",
      "url": "https://apnews.com/article/newark-mayor-ras-baraka-lawsuit-arrest-immigration-0d17f4adb136b9fefc02ea8b498124ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ecb052/2147483647/strip/true/crop/5066x2850+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Ffa%2F8d4bcf8585020e7a9df55dfee9d2%2Fe9772a3c49bc41fbad73c33fdf5bb073"
    },
    {
      "author": "Hyung-Jin Kim, Kim Tong-hyung",
      "description": "Millions of South Koreans are voting for a new president in a snap election triggered by the ouster of Yoon Suk Yeol, a conservative who faces a criminal trial over his short-lived imposition of martial law in December. Pre-election surveys suggest liberal Lee Jae-myung appears headed for an easy win in Tuesday’s election, riding on deep public frustration over the conservatives in the wake of Yoon’s martial law debacle. Conservative candidate Kim Moon Soo has struggled to restore public confidence. The winning candidate will be immediately sworn in as president Wednesday for a full, single five-year term.",
      "publishedAt": "2025-06-02T21:06:57Z",
      "title": "South Koreans vote for new president in wake of Yoon's ouster over martial law",
      "url": "https://apnews.com/article/south-korea-election-da088cf36a61641e23795688df01ee01",
      "urlToImage": "https://dims.apnews.com/dims4/default/76f35dc/2147483647/strip/true/crop/7635x4295+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F82%2Fc476c0e4304ebd399d5a35a7114b%2Fa3567d0a111e4554b2d565c2948fb367"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A former Los Angeles hotel security guard says Sean “Diddy” Combs told him that he feared the public release of a 2016 hotel video recording of the hip-hop mogul kicking and dragging R&B singer Casandra “Cassie” Ventura would ruin him. The security specialist testified Tuesday at Combs’ sex trafficking and racketeering trial. Eddy Garcia told a federal court jury that Combs made the comment repeatedly in March 2016 soon after the attack at the Intercontinental Hotel as he tried to buy what he hoped was the only copy of the video. The 55-year-old Combs has pleaded not guilty.",
      "publishedAt": "2025-06-03T16:31:23Z",
      "title": "Sean 'Diddy' Combs feared footage of him beating his girlfriend would ruin his career, witness says",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-mia-1804b36ab827e503d6c704db8b82415d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b23893a/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F21%2F0648a7fb5a77565263e0bf56bdf4%2F42829eefa2b842cf8e34d7f8cf1de00c"
    },
    {
      "author": "JoNel Aleccia",
      "description": "Health Secretary Robert F. Kennedy Jr. has called for a comprehensive review of nutrients and other ingredients, such as heavy metals, in infant formula. It's the first such review since 1998. Called “Operation Stork Speed,” it could revamp the vital food source for millions of American babies. Three-quarters of U.S. infants consume formula in the first six months of life. About 40% receive it as their only source of nutrition. Experts say current formula products remain safe and nutritious, but they welcome a new look at scientific data regarding whether required ingredients should be changed.",
      "publishedAt": "2025-06-03T13:13:37Z",
      "title": "Kennedy has ordered a review of baby formula. Here's what you should know",
      "url": "https://apnews.com/article/infant-formula-fda-review-4df7d47ed0d8bb2a16df119e16c5f96d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0a7861/2147483647/strip/true/crop/5598x3149+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2Ffe%2F6ad10d4e62c74dda9d32eb6b83f1%2F61651a5a76584eae9e5d380b357330be"
    },
    {
      "author": "Matt Ott",
      "description": "Facebook parent company Meta is partnering with Constellation Energy to expand the output of an Illinois nuclear plant to help meet surging demand for artificial intelligence and other computing needs. The 20-year deal announced Tuesday is the latest in a series of recent tech-nuclear partnerships that also help technology companies achieve their clean energy goals. Financial details of the agreement were not given. The companies say the investment will expand Clinton’s clean energy output by 30 megawatts, preserve 1,100 local jobs and bring in $13.5 million in annual tax revenue.",
      "publishedAt": "2025-06-03T14:45:34Z",
      "title": "Meta becomes the latest big tech company turning to nuclear power for its AI needs",
      "url": "https://apnews.com/article/meta-facebook-constellation-energy-nuclear-ai-a2d5f60ee0ca9f44c183c58d1c05337c",
      "urlToImage": "https://dims.apnews.com/dims4/default/5137f08/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F32%2F4e8737ccd1113a1b4640dc086cc7%2F98277219af4f4d83a5240f40f6a9e594"
    },
    {
      "author": "Dee-Ann Durbin",
      "description": "McDonald’s says it's bringing back a menu item it discontinued nearly a decade ago. The Chicago burger giant confirmed on Tuesday that Snack Wraps will return to its U.S. menu on July 10. McDonald’s introduced Snack Wraps in 2006 but pulled them in the U.S. a decade later because they were too complicated for its kitchens to prepare. But fans have clamored for a comeback for years. The U.S. president of McDonald says some customers kept ordering the Snack Wrap at drive-thrus. In the meantime, rivals like Burger King introduced their own chicken wraps. McDonald's expects Snack Wraps to boost its U.S. sales, which have been sluggish as consumers react to economic conditions.",
      "publishedAt": "2025-06-03T13:35:38Z",
      "title": "McDonald's is bringing back its discontinued Snack Wrap",
      "url": "https://apnews.com/article/mcdonalds-snack-wraps-chicken-867a4474367860aee7fcd3918c31ab5b",
      "urlToImage": "https://dims.apnews.com/dims4/default/90d2589/2147483647/strip/true/crop/7921x4456+0+413/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F12%2F67d6e10889dea7cffbb36685322a%2F76a966e2bc124d86ab0b3ceb75002459"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}