{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and JOSEPH KRAUSS",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Medics in Gaza warned Sunday that thousands could die as hospitals packed with wounded people run desperately low on fuel and basic supplies. Palestinians in the besieged coastal enclave struggled to find food, water and safety ahead of an expected Israeli ground offensive in the war sparked by Hamas' deadly attack.",
      "publishedAt": "2023-10-15T04:52:54Z",
      "title": "Packed Gaza hospitals warn that thousands could die as supplies run low and ground offensive looms",
      "url": "https://apnews.com/6cf0ff04e513ecec12cf9152656ac1b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c66e8d591264f94b188c5c8c6cc9219/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hundreds of thousands of Gaza residents sought to heed Israel’s order to evacuate roughly the northern half of the territory, while others huddled at hospitals in the north on Sunday.",
      "publishedAt": "2023-10-15T04:55:44Z",
      "title": "Live updates | Day 9 of the latest Israel-Hamas war",
      "url": "https://apnews.com/80e5c8682f60b729ac87fa21eeacb675",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6564f860cac409abf2a1265330e81e3/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — As Israel pounds the Gaza Strip with airstrikes, Laila Abu Samhadaneh, 65, is anxious about water. The besieged Gaza Strip's 2.3 million people don't have access to clean, running water after Israel cut off water and electricity to the enclave as it intensifies its air attacks in response to a bloody Hamas attack last week.",
      "publishedAt": "2023-10-14T21:02:04Z",
      "title": "Lack of water worsens misery in besieged Gaza as Israeli airstrikes continue",
      "url": "https://apnews.com/4cc305b209437eec7235e975cf4c47d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7918d7b90bd145e4bf8f5be85b9a141f/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Women, children and older adults hiding in safe rooms gunned down mercilessly. Homes set ablaze with terrified residents still inside them. Children, some bound, forced into a room and slaughtered.",
      "publishedAt": "2023-10-15T04:06:25Z",
      "title": "In Hamas' horrific killings, Israeli trauma over the Holocaust resurfaces",
      "url": "https://apnews.com/7a05336b15666e6306845cffa617b699",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5560d65caf4a44c5b09855531900b796/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER, CHRISSIE THOMPSON and MICHAEL MELIA",
      "description": "America’s colleges aspire to be places where ideas meet and common ground emerges. As the death toll rises in the Israel-Hamas war, they have become seats of anguish.",
      "publishedAt": "2023-10-15T04:35:11Z",
      "title": "The Israel-Hamas war has roiled US campuses. Students on each side say colleges aren't doing enough",
      "url": "https://apnews.com/543aff623d5f54ad6529fe598ae48271",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/187227408f80454192c1e73cf95a2376/1920.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Attorney General Jeff Landry, a Republican backed by former President Donald Trump, has won the Louisiana governor’s race, holding off a crowded field of candidates.The win is a major victory for the GOP as they reclaim the governor’s mansion for the first time in eight years.",
      "publishedAt": "2023-10-14T04:16:12Z",
      "title": "Republican Jeff Landry wins the Louisiana governor's race, reclaims office for GOP",
      "url": "https://apnews.com/ed79c5a80af6e59593985c9be4ce5dc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/187cb60d121b41b583e7827fb9c8b06f/2000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Children take their places at folding tables on a church patio several miles from where their school burned down. Plastic tubs hold brand new textbooks quickly shipped from a publisher.",
      "publishedAt": "2023-10-15T04:28:30Z",
      "title": "Schools near a Maui wildfire burn zone are reopening. Parents wrestle with whether to send kids back",
      "url": "https://apnews.com/eb727f3d5e7345d098777708071716bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f6df1c30b3443395b69a37450fb965/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Six people have been killed in Russian attacks on Ukraine in the past 24 hours, local officials reported Sunday.Two people were killed and three more injured in the Kherson area after more than 100 shells bombarded the region over the weekend, local governor Oleksandr Prokudin wrote on social media.",
      "publishedAt": "2023-10-15T10:59:58Z",
      "title": "6 killed in Russian attacks on Ukraine as Kyiv continues drone counterstrikes",
      "url": "https://apnews.com/b5a1d29456f9c2057724ad9ee54c830b",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — A powerful 6.3 magnitude earthquake struck western Afghanistan on Sunday, just over a week after strong quakes and aftershocks killed thousands of people and flattened entire villages in the same region.",
      "publishedAt": "2023-10-15T04:38:45Z",
      "title": "Powerful earthquake shakes west Afghanistan a week after devastating quakes hit same region",
      "url": "https://apnews.com/8f6055342900e320ec5a5e4ea898399a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4eb335aa4dc4801a7987d43ed8c5e7c/3000.jpeg"
    },
    {
      "author": "MONIKA SCISLOWSKA and VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Poland is holding a high-stakes election on Sunday that has energized many voters, with the ruling conservative nationalist party pitted against opposition groups that accuse it of eroding the foundations of the democratic system.",
      "publishedAt": "2023-10-15T05:24:43Z",
      "title": "Poles vote in a high-stakes election that will determine whether right-wing party stays in power",
      "url": "https://apnews.com/720f7b81838c33ccb2865fb3bc6e0414",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80c0b6a8b05846e3856a7c44bf21b0ef/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}