{
  "articles": [
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel on Sunday hailed its air defenses in the face of an unprecedented attack by Iran, saying the systems thwarted 99% of the more than 300 drones and missiles launched toward its territory.",
      "publishedAt": "2024-04-14T06:33:30Z",
      "title": "Israel hails 'success' in blocking Iran's unprecedented attack. Biden now seeks diplomatic response",
      "url": "https://apnews.com/f27cda966ac274982d968cbcc033eff0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86a9b3c9566a4ebfae303be05166e815/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Iran’s unprecedented attack on Israel early Sunday marked a change in approach for Tehran, which had relied on proxies across the Middle East since the start of the Israel-Hamas war in October.",
      "publishedAt": "2024-04-14T15:18:44Z",
      "title": "The shadow war between Iran and Israel has been exposed. What happens next?",
      "url": "https://apnews.com/f3c5ba6491d9c01a84456a2ef3faeb6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86a9b3c9566a4ebfae303be05166e815/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The unprecedented attack by Iran on Israel early Sunday ratcheted up regional tensions, confirming long-held fears about the Israel-Hamas war spiraling into a broader conflagration.",
      "publishedAt": "2024-04-14T09:56:16Z",
      "title": "Iran's attack on Israel raises fears of a wider war, but all sides have also scored gains",
      "url": "https://apnews.com/8ffb1a81e6769bb1d27c849e6108da36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9393a67f6d394d258c028e067098939a/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — President Joe Biden lauded American forces who helped Israel down “nearly all” of the drones and missiles fired by Iran and vowed to coordinate a global response to Tehran's unprecedented attack.",
      "publishedAt": "2024-04-13T17:52:29Z",
      "title": "US helps Israel shoot down 'nearly all' Iran-launched attack drones as Biden pledges support",
      "url": "https://apnews.com/c57e89a9cbe178b20b53bac404a86728",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b23eb47b2247476fa2f2bc62962d2dd5/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Donald Trump's history-making criminal trial is set to start Monday with a simple but extraordinary procedural step that is vital to American democracy.",
      "publishedAt": "2024-04-14T03:58:26Z",
      "title": "A jury of his peers: A look at how jury selection will work in Donald Trump's first criminal trial",
      "url": "https://apnews.com/56d540406cd174ab143fe12469e9adef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c45f26b52d545e4845d808f2923f0d5/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson said Sunday he will try to advance wartime aid for Israel this week as he attempts the difficult task of winning House approval for a national security package that also includes funding for Ukraine and allies in Asia.",
      "publishedAt": "2024-04-14T16:44:51Z",
      "title": "House Speaker Mike Johnson says he will push for aid to Israel and Ukraine this week",
      "url": "https://apnews.com/912a7419b00749fbc2f472df93f67bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3ab269c7d924e5e9b706548733e2846/3000.jpeg"
    },
    {
      "author": "GIOVANNA DELL'ORTO",
      "description": "HUEHUETENANGO, Guatemala (AP) — As more than 100 men carrying an elaborate float of Jesus halted before him, Cardinal Álvaro Ramazzini lost no time in calling for social justice — the hallmark of the Catholic bishop’s decades-long frontline ministry.",
      "publishedAt": "2024-04-14T12:02:28Z",
      "title": "Unfazed by danger and power, Guatemalan cardinal keeps up fight for migrants and the poor",
      "url": "https://apnews.com/5419db7e447b9e6415642e3370d29190",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed4fb11beae5461db3fe2af2ef5a2102/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — On a clear night a year ago, a dozen heavily armed fighters broke into Omaima Farouq’s house in an upscale neighborhood in the Sudanese capital of Khartoum. At gunpoint, they whipped and slapped the woman, and terrorized her children.",
      "publishedAt": "2024-04-14T05:04:35Z",
      "title": "World paid little attention to Sudan's war for a year. Now aid groups warn of mass death from hunger",
      "url": "https://apnews.com/57b3226207b9c9121a6b3137f6a0ad04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/662fa55009de4edfa2870269d6e7b99a/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — More civilians died across Ukraine Sunday as analysts warned that delays in U.S. military assistance would see Kyiv struggle to fight off Russian offensives.One man was Sunday killed after a Russian drone hit the truck he was driving in the Sumy region, the local prosecutor’s office said.",
      "publishedAt": "2024-04-14T12:08:50Z",
      "title": "More civilians die in Ukraine as a think tank warns delays in US aid will hamper Kyiv's forces",
      "url": "https://apnews.com/50d5f9d6b26734b8736f23c8dcec337e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b550fa6a32e64341a8e8aa40e1857235/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — Scottie Scheffler was in the lead and seemingly in control of his game Saturday in the Masters until realizing there was no such thing at Augusta National.He posed over another beautiful shot at the flag on the 10th hole and was stunned to see it take a hard hop over the green and roll down into the bushes.",
      "publishedAt": "2024-04-13T14:35:01Z",
      "title": "Scottie Scheffler leads Masters by 1 shot on a wild day of movement",
      "url": "https://apnews.com/dbafb7b5d205767df5239fc3383a7a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eea0b36cff2c43e5aaf9f5edf925931f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}