{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The tent camps stretch for more than 16 kilometers (10 miles) along Gaza’s coast, filling the beach and sprawling into empty lots, fields and town streets.",
      "publishedAt": "2024-05-28T04:03:04Z",
      "title": "'We have nothing.' As Israel attacks Rafah, Palestinians are living in tents and scavenging for food",
      "url": "https://apnews.com/2de77ea9095d2c680f57f77ad395917c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/beaf0aeed1774afe84e8c285d26c5d7a/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The tent camps stretch for more than 16 kilometers (10 miles) along Gaza’s coast, filling the beach and sprawling into empty lots, fields and town streets.",
      "publishedAt": "2024-05-28T04:03:04Z",
      "title": "'We have nothing.' As Israel attacks Rafah, Palestinians are living in tents and scavenging for food",
      "url": "https://apnews.com/2de77ea9095d2c680f57f77ad395917c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/beaf0aeed1774afe84e8c285d26c5d7a/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN, TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Prime Minister Benjamin Netanyahu said Monday that a “tragic mistake” was made in an Israeli strike in the southern Gaza city of Rafah that set fire to a camp housing displaced Palestinians and, according to local officials, killed at least 45 people.",
      "publishedAt": "2024-05-27T13:21:19Z",
      "title": "Netanyahu says deadly Israeli strike in Rafah was the result of a 'tragic mistake'",
      "url": "https://apnews.com/7b743a848ef8bfbe69a9659a4a5dd047",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ad1f8562a794fdab121d14f646a7ebe/1920.jpeg"
    },
    {
      "author": "BRUCE SCHREINER and JULIO CORTEZ",
      "description": "A series of powerful storms swept over the central and southern U.S. over the Memorial Day holiday weekend, killing at least 22 people and leaving a wide trail of destroyed homes, businesses and power outages.",
      "publishedAt": "2024-05-27T04:09:10Z",
      "title": "At least 22 dead in Memorial Day weekend storms that devastated several US states",
      "url": "https://apnews.com/91b0ff5c06f9bdc8b8ca68f36afbafa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/132ede06e6dd4b17aeb08fd73b6ad91d/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Prosecutors and defense lawyers in Donald Trump's hush money trial are set to deliver closing arguments to the jury Tuesday, each side looking to score final points with the panel before it starts deliberating the fate of the first former American president to be charged with felony crimes.",
      "publishedAt": "2024-05-28T04:01:40Z",
      "title": "In Trump's hush money trial, prosecutors and defense lawyers are poised to make final pitch to jury",
      "url": "https://apnews.com/e262d1fe4a9ca624f2f983ca1000eb55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224129f3612d4d6e9e363ec801508238/2000.jpeg"
    },
    {
      "author": "AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — During the presidential election four years ago, the Equal Ground Education Fund hired over 100 people to go door-to-door and attend festivals, college homecomings and other events to help register voters across Florida.",
      "publishedAt": "2024-05-28T04:10:51Z",
      "title": "Voter outreach groups targeted by new laws in several GOP-led states are struggling to do their work",
      "url": "https://apnews.com/70e034dd46baf474998259a2b737c096",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eae67578d2534b90850b82d611320db3/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Mexicans will vote Sunday in historic elections weighing gender, democracy and populism, as they chart the country's path forward in voting shadowed by cartel violence. With two women leading the contest, Mexico will likely elect its first female president – a major step in a country long marked by its “macho” culture.",
      "publishedAt": "2024-05-28T05:01:51Z",
      "title": "What to know about Mexico's historic elections that will likely put a woman in power",
      "url": "https://apnews.com/59fc84d8e757675ea9c5110f700e09bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2da3dc19fb3845db82388971f429ee03/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Authorities fear a second landslide and a disease outbreak are looming at the scene of Papua New Guinea’s mass-casualty disaster because of water streams and bodies trapped beneath the tons of debris that swept over a village, a United Nations official said Tuesday.",
      "publishedAt": "2024-05-28T04:01:04Z",
      "title": "Fears rise a second landslide and disease outbreak loom at site of Papua New Guinea disaster",
      "url": "https://apnews.com/79e867795f8293aab3f35da58b0d1d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49a99704f088450a836d5993dbea252a/1920.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Priscilla Orr, 75, was living in her old white Kia in a supermarket parking lot last summer after telling her family she lost her money and home to a romance scam.But the car broke down, and the air conditioner stopped working, leaving her vulnerable to the dangerous desert heat.",
      "publishedAt": "2024-05-28T04:05:46Z",
      "title": "Last year's deadly heat wave in metro Phoenix didn't discriminate",
      "url": "https://apnews.com/dcb8c01e3566d1737acbd60b462e5ddf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fde05989eb6947bab1efaf4b23132517/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — Aquaman might not mind if the oceans rise, but moviegoers might.That's one of the takeaways from a new study conducted by researchers who set out to determine if today's Hollywood blockbusters are reflective of the current climate crisis.",
      "publishedAt": "2024-05-28T04:17:39Z",
      "title": "Hollywood movies rarely reflect climate change crisis. These researchers want to change that",
      "url": "https://apnews.com/f7f58a6e24901651757b616dc4099c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9136f0cd35b4c7ebcee37dfb5068b4c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}