{
  "articles": [
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Israel and Hamas appeared open to extending a cease-fire in Gaza that has halted their deadliest and most destructive war but is set to expire after Monday, with a fourth exchange of militant-held hostages for Palestinians imprisoned by Israel planned for later in the day.",
      "publishedAt": "2023-11-27T07:58:51Z",
      "title": "Israel and Hamas look open to extending truce on its final day, with one more hostage swap planned",
      "url": "https://apnews.com/852065d35c4643f4c874fb5993313b13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5206d2bf71b409d8dd59b4a786f5e1b/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Plastic chairs as beds. Meals of bread and rice. Hours spent waiting for the bathroom. As former hostages return to Israel after seven weeks of Hamas captivity, information about the conditions of their confinement has emerged.",
      "publishedAt": "2023-11-26T23:08:11Z",
      "title": "Irregular meals, benches as beds. As freed hostages return to Israel, details of captivity emerge",
      "url": "https://apnews.com/612542191742082f330d55433c012a05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47d0c209ee864910b940975c35a881df/1600.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Armed assailants seized and later let go of a tanker linked to Israel off the coast of Yemen on Sunday before being apprehended by the United States Navy, officials said.",
      "publishedAt": "2023-11-26T12:52:33Z",
      "title": "US Navy seizes attackers who held Israel-linked tanker. Missiles from rebel-controlled Yemen follow",
      "url": "https://apnews.com/526842504dc9f6bb7ca6e1d5104f77a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/212264d8a0a1439dbea32a85868b62b1/3000.jpeg"
    },
    {
      "author": "KATHY McCORMACK",
      "description": "Police have arrested a suspect in the shooting of three young men of Palestinian descent who were attending a Thanksgiving holiday gathering near the University of Vermont campus Saturday evening.",
      "publishedAt": "2023-11-26T18:55:41Z",
      "title": "Police arrest suspect in the shooting of 3 men of Palestinian descent near the University of Vermont",
      "url": "https://apnews.com/ab836d1941e4237b3649353eaceb4092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c585f68ffaaf4039953281422c020d09/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "WASHINGTON (AP) — Campaigning in Iowa this year, Donald Trump said he was prevented during his presidency from using the military to quell violence in primarily Democratic cities and states.",
      "publishedAt": "2023-11-27T05:03:52Z",
      "title": "Trump hints at expanded role for the military within the US. A legacy law gives him few guardrails",
      "url": "https://apnews.com/03858b6291e4721991b5a18c2dfb3c36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0c8bb32cc8c45a7975757bc0aa4a37c/3000.jpeg"
    },
    {
      "author": "DANA BELTAJI",
      "description": "Amidst record-high temperatures, deluges, droughts and wildfires, leaders are convening for another round of United Nations climate talks later this month that seek to curb the centuries-long trend of humans spewing ever more greenhouse gases into the atmosphere.",
      "publishedAt": "2023-11-27T05:02:23Z",
      "title": "How did humans get to the brink of crashing climate? A long push for progress and energy to fuel it",
      "url": "https://apnews.com/ea6c2d0061a39c68a1c574375d1004dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ab47286ef5b446fa790f5c035db8074/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and COURTNEY BONNELL",
      "description": "KYIV, Ukraine (AP) — Grain thunders into rail cars and trucks zip around a storage facility in central Ukraine, a place that growing numbers of companies turned to as they struggled to export their food to people facing hunger around the world.",
      "publishedAt": "2023-11-27T05:05:43Z",
      "title": "Ukraine is shipping more grain through the Black Sea despite threat from Russia",
      "url": "https://apnews.com/b8af33375ff82edac62e4207671b5f74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56b1f20cad614166b3433108135b8cea/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "AMERICUS, Ga. (AP) — Rosalynn Carter will make her final journey to the Jimmy Carter Presidential Center on Monday as her family begins three days of memorials for the former first lady and global humanitarian who died Nov.",
      "publishedAt": "2023-11-27T05:03:29Z",
      "title": "Rosalynn Carter tributes will highlight her reach as first lady, humanitarian and small-town Baptist",
      "url": "https://apnews.com/2e798e487dc7e727a18f104d02248ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6c8d727c80a40bfb1ba5bf4340ee185/2466.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — Facebook parent Meta Platforms deliberately engineered its social platforms to hook kids and knew — but never disclosed — it had received millions of complaints about underage users on Instagram but only disabled a fraction of those accounts, according to a newly unsealed legal complaint described in reports from The Wall Street Journal and The New York Times.",
      "publishedAt": "2023-11-27T03:27:07Z",
      "title": "Court document claims Meta knowingly designed its platforms to hook kids, reports say",
      "url": "https://apnews.com/04c8797da2c7ff2021931536d324faea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de8b461f19c457da58e1f6e2c9039fb/3000.jpeg"
    },
    {
      "author": "DAKE KANG",
      "description": "SHENZHEN, China (AP) — In one painting, a child sits, mouth wide open, as a worker in white medical garb extends a long cotton swab toward her tonsils. In another, a masked officer and medical workers stand guard in front of an apartment cordoned off with ropes and seals reading “CLOSED,” as residents look on with frustration and despair.",
      "publishedAt": "2023-11-27T01:13:05Z",
      "title": "Artist Zeng Fanzhi depicts 'zero-COVID' after a lifetime of service to the Chinese state",
      "url": "https://apnews.com/06613c932427765f81bcede588b44616",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a70d60ec404145b0b8539ac1caf1d9b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}