{
  "articles": [
    {
      "author": null,
      "description": "Thousands of protesters took to the street in Los Angeles on Sunday in response to President Donald Trump's extraordinary deployment of the National Guard against Gov. Gavin Newsom's wishes. The demonstrations centered on a cluster of federal buildings including a detention center where immigrants arrested on Friday were taken. As the protests swelled on Sunday, demonstrators blocked a freeway entrance, set self-driving cars on fire and threw objects including concrete and electric scooters at law enforcement officers and vehicles. Los Angeles Police Chief Jim McDonnell says some of the protesters engaging in the most aggressive behavior are agitators looking to cause trouble.",
      "publishedAt": "2025-06-09T04:25:10Z",
      "title": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops",
      "url": "https://apnews.com/article/los-angeles-protests-national-guard-trump-14c9dda32663d7d2c45f2b1c5a1d219c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3af0f0d/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fca%2F0e3b7a85ec3116cc0548a446acee%2Fb0ec65081ab14f35b8ab14d75cba5f5f"
    },
    {
      "author": null,
      "description": "Israeli forces have stopped a Gaza-bound aid boat and detained Greta Thunberg and other activists on board, enforcing a longstanding blockade of the Palestinian territory that has been tightened during the war with Hamas. The Freedom Flotilla Coalition, which had organized the voyage to deliver humanitarian aid to the Gaza Strip and protest Israel’s blockade and wartime conduct, said the activists had been “kidnapped by Israeli forces.” Israel said the passengers would return to their home countries and the aid would be delivered to Gaza through established channels.",
      "publishedAt": "2025-06-09T01:20:54Z",
      "title": "Israeli forces detain Greta Thunberg after halting Freedom Flotilla aid boat",
      "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be",
      "urlToImage": "https://dims.apnews.com/dims4/default/be50b33/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Fc7%2Fcd0bf01bc66a2cbb83e57fecc5d8%2Fa38136d8c5344e9badbd78e93dda8702"
    },
    {
      "author": null,
      "description": "Russia launched 479 drones at Ukraine in the war’s biggest overnight drone bombardment, the Ukrainian air force said. As well as the drones, 20 missiles of various types were fired at different parts of Ukraine, the air force said Monday. The attacks usually start late in the evening and end in the morning, because drones are harder to spot in the dark. Russia has targeted civilian areas of Ukraine with Shahed drones since the start of the war. The attacks have killed more that 12,000 Ukrainian civilians, according to the United Nations. A recent escalation in aerial attacks has coincided with a renewed Russian battlefield push on eastern and northeastern parts of the roughly 1,000-kilometer (620-mile) front line.",
      "publishedAt": "2025-06-09T08:22:36Z",
      "title": "Ukraine says Russia launched 479 drones",
      "url": "https://apnews.com/article/ukraine-russia-drones-attack-air-force-a1b092efaaad6886659a9230109a48db",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "President Donald Trump has banned travel to the U.S. by citizens from 12 countries and restricted access for people from seven others. He cited national security concerns in resurrecting and expanding a hallmark policy of his first term that will mostly affect people from Africa and the Middle East. The ban took effect Monday and does not have an end date. International aid groups and refugee resettlement organizations roundly condemned the ban. Early in Trump’s first term, he issued an executive order banning travel to the U.S. by citizens of seven predominantly Muslim countries. The order was retooled amid legal challenges until a version was upheld by the Supreme Court in 2018.",
      "publishedAt": "2025-06-05T12:10:01Z",
      "title": "What to know about Trump's new travel ban",
      "url": "https://apnews.com/article/trump-travel-ban-exceptions-immigrants-visa-4d5a4d07a4430dd1e1cf24511370bc0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/39d9a78/2147483647/strip/true/crop/5752x3236+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fe6%2F02631d43b1162d9338d7a427a667%2F5ab499d1753a43989c913d6aba7b44e4"
    },
    {
      "author": null,
      "description": "The FBI under the leadership of Director Kash Patel has made fighting violent crime and illegal immigration top priorities. That effort brings the bureau into alignment with the vision of President Donald Trump, who has made a crackdown on illegal immigration, cartels and transnational gangs a cornerstone of his administration. The FBI said in a statement that its dedication to investigating terrorism had not changed but acknowledged that it “continuously analyzes the threat landscape” and makes adjustments as necessary. Yet some are concerned the heightened focus on violent crime and immigration risks diverting attention from some of the complicated criminal and national security threats for which the bureau has long borne primary responsibility for investigating.",
      "publishedAt": "2025-06-09T04:00:53Z",
      "title": "FBI shifts focus to violent crime and illegal immigration",
      "url": "https://apnews.com/article/fbi-patel-shifting-priorities-violent-crime-c0924b31e1d1a8ca4c2e3b53184bafa2",
      "urlToImage": "https://dims.apnews.com/dims4/default/940da56/2147483647/strip/true/crop/2610x1468+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F41%2F40fa222a26888504af09cfe84f7c%2Fcbd10a57ba9140c687a61f43c643eba9"
    },
    {
      "author": null,
      "description": "China has reported its exports rose 4.8% in May from a year earlier, lower than expected as shipments to the United States fell nearly 10%. Imports declined 3.4% year-on-year, leaving a trade surplus of $103.2 billion. Chinese customs data released Monday show China's exports to the U.S. in May totaled $28.8 billion, while imports fell 7.4% year-on-year to $10.8 billion. China's global exports jumped 8.1% in April. They slowed even after U.S. President Donald Trump struck a deal with Beijing to delay implementation of stiff tariff hikes to allow time for talks. The next round of U.S.-China talks was due to take place later Monday in London.",
      "publishedAt": "2025-06-09T03:39:21Z",
      "title": "China's exports climb 4.8% in May as shipments to the US fall nearly 10%",
      "url": "https://apnews.com/article/china-trade-exports-trump-tariffs-a6f55570462e4ffce106698ef23ac7be",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e17425/2147483647/strip/true/crop/7146x4020+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F95%2F4d87b81028b4940e771caa582c53%2F20e4f76db0e9426e9f404129a87519b4"
    },
    {
      "author": null,
      "description": "The third U.N. Ocean Conference has opened as pressure mounts for nations to turn decades of promises into real protection for the sea. French President Emmanuel Macron, delivering the keynote address in the host city of Nice on Monday, urged countries to move “from words to deeds” in safeguarding the oceans. He warned that “the fight for the ocean is at the heart of the years-long battles we’ve been waging — for biodiversity, for climate, for our environment and for our health.” Atop this year’s agenda is ratification of the High Seas Treaty, which would for the first time allow nations to establish marine protected areas in international waters, which cover nearly two-thirds of the ocean and are largely ungoverned.",
      "publishedAt": "2025-06-09T03:06:31Z",
      "title": "Acting to protect the oceans is the focus of a UN conference",
      "url": "https://apnews.com/article/un-oceans-conference-france-high-seas-treaty-9d46d372dc1f2d44bedbe41c84598bc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/0154f7a/2147483647/strip/true/crop/5123x2882+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fae%2F440b413ee49956ae043d0ba4c676%2Fa5a6d763ed00485a98861259fb3123c9"
    },
    {
      "author": null,
      "description": "After stumbling out of the starting gate in Big Tech’s pivotal race to create artificial intelligence, Apple will try to regain its footing Monday with its annual showcase for the next generation of software powering the iPhone and other popular products. The presummer rite is expected be more subdued than the feverish anticipation that surrounded the event in 2023 when Apple unveiled a mixed-reality headset and last year when the company hyped AI features that didn't pan out as envisioned. Now Apple is facing nagging questions about its ability to innovate and ability to navigate a gauntlet of other challenges as it heads into this year's World Wide Developers Conference.",
      "publishedAt": "2025-06-09T04:01:06Z",
      "title": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump's trade war",
      "url": "https://apnews.com/article/apple-conference-iphone-artificial-intelligence-ba918c2091e0d49a8b3f164e4f980b6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d5b419d/2147483647/strip/true/crop/6769x3808+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fff%2F81ecc765fde16ba08cad2bf9de14%2Fb88223b8094c40b1bf7271fdbb40386c"
    },
    {
      "author": null,
      "description": "The BET Awards is bringing major star power — including Kendrick Lamar, Mariah Carey, and Jamie Foxx — to celebrate its 25th anniversary on Monday. Lamar leads the pack with 10 nominations, including album of the year for his critically acclaimed project “GNX.” His ubiquitous diss track “Not Like Us,” emanating from the Drake feud, received nominations for video of the year and viewer’s choice award. The awards will air live on June 9 from the Peacock Theater in Los Angeles at 8 p.m. EDT.",
      "publishedAt": "2025-06-09T04:08:24Z",
      "title": "BET Awards 2025: Major star power planned for 25th anniversary",
      "url": "https://apnews.com/article/bet-awards-2025-show-updates-ff47b060dede64a01541959f14f949b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/843ac9a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F2e%2F50c7c3b3e087356a540c57719c8a%2F31151505ebdb4697a4ccbe6c8b6bcfc2"
    },
    {
      "author": null,
      "description": "The Stanley Cup Final shifts to Sunrise for Game 3 on Monday night between the Florida Panthers and Edmonton Oilers. The last time the Oilers were here, they experienced a gut-wrenching Game 7 defeat in the final a little under a year ago. They were back in the same visiting locker room for practice Sunday that they were in last June 24, listening to the Panthers celebrate with the Stanley Cup. This series is tied at a game apiece after the teams split in Edmonton.",
      "publishedAt": "2025-06-09T10:00:08Z",
      "title": "Panthers and Oilers Stanley Cup Final shifts to South Florida",
      "url": "https://apnews.com/article/stanley-cup-panthers-oilers-1192cb4dd21931aa4a26985cf7322d82",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d9d88d/2147483647/strip/true/crop/6500x3656+0+330/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Fb8%2F0c131bf51cc5c6039283d723af31%2F627d983f68e1425b81e4d1dce5773a17"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}