{
  "articles": [
    {
      "author": "STEPHEN GROVES",
      "description": "The House is heading towards a final vote on a bill to require the detainment of unauthorized migrants accused of theft and violent crimes. It marks the first legislation that President Donald Trump can sign as Congress, with some bipartisan support, swiftly moved in line with his plans to crackdown on illegal immigration. The Laken Riley Act is named after a Georgia nursing student who was murdered last year by a Venezuelan man. Its passage would show just how sharply the political debate over immigration has shifted to the right following Trump’s election victory.",
      "publishedAt": "2025-01-22T21:32:34Z",
      "title": "House prepares to pass immigrant detention bill that would be Trump's first law to sign",
      "url": "https://apnews.com/article/congress-immigration-crackdown-laken-riley-act-trump-a3e52af60b6b952f487e4ae03ebfacde",
      "urlToImage": "https://dims.apnews.com/dims4/default/0cf2462/2147483647/strip/true/crop/5840x3285+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F14%2Ffbb8e73fe18ad65c6111d1db3629%2F161f7cff89db4d04b1c2b2accf131c91"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump has his first piece of immigration legislation to sign: the Laken Riley Act, which requires unauthorized immigrants accused of theft and violent crimes to be detained.",
      "publishedAt": "2025-01-23T07:35:00Z",
      "title": "Live updates: House passes the Laken Riley Act, sending the bill to Trump's desk",
      "url": "https://apnews.com/live/trump-presidency-day-4-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b7237/2147483647/strip/true/crop/1024x576+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F94%2F4a5dfd3643eb8eb956f4cf43dc97%2Fap25022004628818.jpg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "U.S. President Trump is to speak to an international audience for the first time after returning into the White House with a speech and Q&A by video conference to the World Economic Forum’s annual event in Davos on Thursday. The fourth day of the annual gathering also features Argentine President Javier Milei and Muhammad Yunus, the interim leader of Bangladesh. Business and tech whizzes will get their turns too, and EU chief Ursula von der Leyen will talk about energy transition.",
      "publishedAt": "2025-01-23T08:55:09Z",
      "title": "Trump heads back to Davos, this time virtually, for elite World Economic Forum gathering",
      "url": "https://apnews.com/article/trump-yunus-davos-wef-2025-milei-b517cb91e145beff47810ed7256ef459",
      "urlToImage": "https://dims.apnews.com/dims4/default/3756b10/2147483647/strip/true/crop/6000x3375+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2Fb7%2Ff75a6c4ad26b4f866433ff1679e2%2F7241e46d5c5b4c80be622b7a9abc52ad"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump began his second administration with a blitz of policy actions to reorient U.S. government priorities. He has covered issues from trade, immigration and U.S. foreign aid to demographic diversity, civil rights and the hiring of federal workers. Some have an immediate policy impact. Others are more symbolic. Some already are being challenged by federal lawsuits. In total, the Republican president’s sweeping actions reflect many of his campaign promises and determination to concentrate executive branch power in the West Wing, while moving the country sharply rightward.",
      "publishedAt": "2025-01-22T18:05:42Z",
      "title": "Everything Trump did in the first executive orders of his presidency",
      "url": "https://apnews.com/article/what-has-trump-done-trump-executive-orders-f061fbe7f08c08d81509a6af20ef8fc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e93f226/2147483647/strip/true/crop/4479x2519+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F70%2F5f7e23f4ef8e66616922e00aa2c7%2F1891260582d84f2598be01c9cd832936"
    },
    {
      "author": "MICHELLE L. PRICE, ZEKE MILLER",
      "description": "President Donald Trump’s sweeping orders to end the government’s diversity, equity and inclusion effort mark a sea change for the country. They unwind decades-long priorities for the nation’s largest employer — the federal government — and broader efforts to push the private sector to ensure its workforce is diverse and inclusive too. Trump has shown with his wide-reaching moves that he’s willing to use all the levers of the government to bring about a profound cultural shift across the U.S. from promoting diversity to an exclusive focus on merit. Hours after taking the oath of office, the president signed an executive order ending diversity, equity and inclusion programs within the federal government, which he and conservatives have long condemned as discriminatory.",
      "publishedAt": "2025-01-22T22:05:23Z",
      "title": "Trump's orders to end DEI programs reflect his push for a profound cultural shift",
      "url": "https://apnews.com/article/trump-executive-orders-dei-7ef0bf4ce1d465f6b61f3fcfde544593",
      "urlToImage": "https://dims.apnews.com/dims4/default/22060c6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F9a%2F894c20b8f23d7bbd5d5576644509%2F7d3cf862377942699c41ae00d2132681"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "The Right Rev. Mariann Edgar Budde, bishop of the Diocese of Washington, says she will continue to pray for President Donald Trump, hours after he lashed out at her over a sermon. She told The Associated Press that he was not her enemy, and she believes they can disagree respectfully. Budde made a direct appeal to Trump during a post-Inauguration prayer service he attended on Tuesday, asking him to show mercy to members of the LGBTQ+ community and migrants who are in the country illegally. Trump called Budde a “Radical Left hard line Trump hater” on his Truth Social site on Wednesday",
      "publishedAt": "2025-01-23T00:36:53Z",
      "title": "Episcopal bishop says she'll continue to pray for Trump, who lashed out at her over viral sermon",
      "url": "https://apnews.com/article/trump-episcopal-bishop-budde-sermon-d393ab9df6278d884ba09fb8e679f563",
      "urlToImage": "https://dims.apnews.com/dims4/default/e079142/2147483647/strip/true/crop/3724x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fe1%2F5c0f2217f95912fc8f1b621a74fe%2F7132b645bbd9458da731330e240204d0"
    },
    {
      "author": "LAURIE KELLMAN, Hillel Italie",
      "description": "Mapmakers and teachers are re-thinking what to call the gulf of water between Mexico, the United States and Cuba after President Donald Trump ordered it renamed from the Gulf of Mexico to the Gulf of America. There's no agreed-upon scheme to name boundaries and features shared by countries. And map lines are inherently political. Beyond the gulf-adjacent US states that were considering putting the Trumpian Gulf of America on official documents, it wasn't clear Wednesday who else might follow Trump's lead. Mexican President Claudia Sheinbaum had joked that Mexico would now rename North America, “Mexican America.” On Wednesday, she said her country and “the entire world\" would ignore Trump's order.",
      "publishedAt": "2025-01-23T06:38:37Z",
      "title": "Trump's order to rename the Gulf of Mexico hands mapmakers and teachers a challenge",
      "url": "https://apnews.com/article/trump-gulf-mexico-america-map-teachers-96e31cfa30f0619cde8f4076aec19f1c",
      "urlToImage": "https://dims.apnews.com/dims4/default/de2aaf0/2147483647/strip/true/crop/5535x3113+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F44%2Fce0d8eac7378bb1b0c0f669c81ed%2F75c87464b66c4521ba45ff3cf20b00d6"
    },
    {
      "author": "MIKE CATALINI",
      "description": "A federal judge is set to hear the first arguments in a multi-state lawsuit seeking to block President Donald Trump’s executive order ending the constitutional guarantee of birthright citizenship regardless of the parents' immigration status. U.S. District Judge John C. Coughenour scheduled a hearing Thursday to consider the request from Arizona, Illinois, Oregon and Washington. The lawsuit filed in Seattle is one of at least five brought by a total of 22 states and a number of immigrant rights groups across the country.",
      "publishedAt": "2025-01-23T05:06:51Z",
      "title": "A bid to block Trump's cancellation of birthright citizenship is in federal court",
      "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c",
      "urlToImage": "https://dims.apnews.com/dims4/default/959bdb0/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2Fbb%2Fb3cdd69d538b479f719f6a448a0e%2F7d3bfb7c093148b0be7a5ce7384409d9"
    },
    {
      "author": "ZEKE MILLER, JOSH BOAK, JAMEY KEATON",
      "description": "President Donald Trump promised global elites lower taxes if they bring manufacturing to the U.S. and threatened to impose tariffs if they don’t. The president made the remarks Thursday in an address to the World Economic Forum. Trump spoke by video from the White House to the annual summit in Davos, Switzerland, on his third full day in office. He ran through his flurry of executive actions since his swearing-in and claimed that he had a “massive mandate” from the American people to bring change. He laid out a carrot-and-stick approach for private investment in the U.S.",
      "publishedAt": "2025-01-23T16:40:09Z",
      "title": "Trump tells Davos elite to invest in US or face tariffs",
      "url": "https://apnews.com/article/trump-davos-tariffs-taxes-world-economic-forum-85aa42fb7751bedc1643c5a0e465a053",
      "urlToImage": "https://dims.apnews.com/dims4/default/830d42f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F83%2F9eeb03f5a099a117f0743780ee57%2F5f2ae90b5a1d4f90ab219609d18a7c4c"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Saudi Arabia’s crown prince says the kingdom wants to invest $600 billion in the United States over the next four years, comments that came after President Donald Trump mused about returning to the kingdom as his first foreign trip. The comments from Crown Prince Mohammed bin Salman, reported early Thursday by the state-run Saudi Press Agency, came in a phone call with Trump. On Monday after his inauguration, Trump talked about possibly heading to the kingdom again as his first foreign trip, like he did in 2017.",
      "publishedAt": "2025-01-23T05:07:16Z",
      "title": "Saudi Arabia floats $600 billlion investment in US",
      "url": "https://apnews.com/article/saudi-arabia-us-investment-trump-6730a89f93b44ed8d705638f95700cbb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e10201c/2147483647/strip/true/crop/5297x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F3d%2F91ea2dae6d7aad16839597a65526%2Fdbe2103276414ea09b12be5b58173be2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}