{
  "articles": [
    {
      "author": "Kevin Freking",
      "description": "Speaker Mike Johnson’s ability to carry out President Donald Trump's “play call” for funding the government is being put to the test. The House is holding a procedural vote Tuesday on a bill that would end the partial government shutdown. Johnson will need near-unanimous support from his Republican conference to proceed. The legislation funds most of the federal government through Sept. 30 and the Department of Homeland Security for two weeks as lawmakers negotiate potential changes for the agency that enforces the nation’s immigration laws, often referred to as ICE. Trump urged lawmakers to back the bill in a social media post.",
      "publishedAt": "2026-02-03T05:12:18Z",
      "title": "GOP leaders labor for support ahead of key test vote on ending shutdown",
      "url": "https://apnews.com/article/government-shutdown-ice-funding-471e55ba4c3247051739ee1b50b2857a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0762e30/2147483647/strip/true/crop/5328x3550+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fea%2Fc3e194ba4b9704510345ac5dd390%2Febb4e2568cef4b5f9bf132ffd6282021"
    },
    {
      "author": null,
      "description": "U.S. Central Command says a U.S. Navy fighter jet shot down an Iranian drone that was approaching the aircraft carrier USS Abraham Lincoln in the Arabian Sea. In an emailed statement Tuesday, U.S. Central Command says the drone “aggressively approached” the aircraft carrier with “unclear intent” and it “continued to fly toward the ship despite de-escalatory measures taken by U.S. forces operating in international waters.” The U.S. military says the shootdown also occurred within hours of another incident in which Iranian forces harassed a U.S.-flagged and U.S.-crewed merchant vessel that was sailing in the Strait of Hormuz.",
      "publishedAt": "2026-02-03T17:45:24Z",
      "title": "US military says it shot down Iranian drone",
      "url": "https://apnews.com/article/us-iran-drone-shot-down-military-634f406a5bb416b7a1a8bec8cc72b4b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/072efe5/2147483647/strip/true/crop/4879x3251+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fcf%2F02e9e41a9c1be97b8a06ccc96ea7%2F6310313575204abc9c201340230aba6b"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A federal judge who presided over the sex trafficking case against Jeffrey Epstein says a Wednesday conference to address harm done to the financier's victims by a massive release of records isn't needed after a deal was struck to protect their identities. Judge Richard M. Berman cancelled the hearing late Tuesday after he was notified by Florida attorney Brittany Henderson that “extensive and constructive discussions” with the Justice Department had resulted in an agreement to protect victims' identities. On Sunday, Henderson and attorney Brad Edwards had sought judicial intervention, saying nearly 100 victims had been harmed by sloppy redactions to a massive release of Epstein documents that began Friday.",
      "publishedAt": "2026-02-03T23:48:42Z",
      "title": "Deal reached to protect identities of Epstein victims",
      "url": "https://apnews.com/article/jeffrey-epstein-victims-court-hearing-883e1bf23b913d43337dc6dacb46393c",
      "urlToImage": "https://dims.apnews.com/dims4/default/da8efce/2147483647/strip/true/crop/5712x3806+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2Fba%2Faf8d7b0a68c0bf7fe6f4204e05c9%2Fae453f9e0e094060823a767faa57e072"
    },
    {
      "author": "Jacques Billeaud, Sejal Govindarao",
      "description": "“Today” show host Savannah Guthrie is asking for prayers to help bring her mother home. Authorities in Arizona believe 84-year-old Nancy Guthrie was kidnapped, abducted or otherwise taken against her will. In a social media post, Savannah Guthrie said \"raise your prayers with us and believe with us that she will be lifted by them in this very moment.” For a second day Tuesday, “Today” opened with the disappearance and Savannah Guthrie wasn't at the anchor’s desk. The Pima County sheriff says it’s imperative Nancy Guthrie is found soon because she could die without her medication. She was last seen Saturday night at her home in the Tucson area.",
      "publishedAt": "2026-02-03T13:20:15Z",
      "title": "'Today' host Savannah Guthrie seeks prayers for missing mom in Arizona",
      "url": "https://apnews.com/article/savannah-guthrie-mother-missing-arizona-tucson-74d845b070fefe2d94cb92d655308e91",
      "urlToImage": "https://dims.apnews.com/dims4/default/039ef24/2147483647/strip/true/crop/3485x2322+8+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F89%2F33973dc649dbe34e480442b6c920%2F2dfae915dd9c47bab6b313653ef01709"
    },
    {
      "author": "Ryan Murphy, Sarah Raza, Steve Karnowski",
      "description": "Immigration officers with guns drawn arrested some activists who were trailing their vehicles Tuesday in Minneapolis. It's a sign tensions have not eased since the departure of a high-profile commander. At least one person wearing an anti-ICE message was handcuffed while face-down on the ground. An Associated Press photographer witnessed the arrests. There was no immediate response from the Department of Homeland Security. A federal judge ordered officers not to arrest motorists who are following but not obstructing their operations, but an appeals court set the order aside. Meanwhile, a man charged with squirting apple cider vinegar on Democratic Rep. Ilhan Omar will remain in jail.",
      "publishedAt": "2026-02-03T18:16:33Z",
      "title": "Activists in Minneapolis are arrested while trailing immigration agents",
      "url": "https://apnews.com/article/minneapolis-immigration-crackdown-arrests-29ab636ca0f7db5389418463ca8b67c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a93bf60/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F7a%2F42d4ad32d670d6ec4fea6998ad99%2F993633c2806d4e02a1c58fb949934710"
    },
    {
      "author": "Michelle Chapman",
      "description": "Disney is naming parks chief Josh D’Amaro as its next CEO, succeeding Bob Iger. D’Amaro has served as Disney Experiences Chairman, spearheading efforts for the company’s theme parks, cruises and resorts. The decision on the next chief executive at Disney comes almost four years after the company’s choice to replace Iger went badly, forcing Iger back into the job. Only two years after stepping down as CEO, Iger returned to Disney in 2022 after a period of clashes, missteps and a weakening financial performance under his hand-picked successor, Bob Chapek.",
      "publishedAt": "2026-02-03T13:53:54Z",
      "title": "Disney's Josh D'Amaro to succeed Bob Iger as CEO",
      "url": "https://apnews.com/article/disney-ceo-iger-damaro-f1b32ea8c49226f0fbb266c1e6761285",
      "urlToImage": "https://dims.apnews.com/dims4/default/99469a5/2147483647/strip/true/crop/1257x838+0+53/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fdb%2F412d4946b38dbc0c630c1c657ad7%2Fde3b18d4cc684162b23dd055ede28942"
    },
    {
      "author": "Matthew Brown, Hannah Schoenbaum",
      "description": "Defense attorneys for the man accused of killing Charlie Kirk are trying to block Utah prosecutors from introducing graphic videos of the shooting. They also want a judge to oust cameras from the courtroom to shield prospective jurors from bias. Prosecutors, attorneys for news organizations, and Kirk's widow urged state District Judge Tony Graf to keep the proceedings open to the public. But legal experts say the defense team’s worries are real. They say media coverage in high-profile cases can have a “biasing effect” on potential jurors. Prosecutors plan to seek the death penalty for defendant Tyler Robinson, who is charged with aggravated murder in the Sept. 10 shooting of Kirk.",
      "publishedAt": "2026-02-03T05:02:18Z",
      "title": "Video of Kirk shooting raises worries about biased jurors",
      "url": "https://apnews.com/article/charlie-kirk-biased-jurors-robinson-video-40d48c3427590c45c8b5e67517a117ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/02b3298/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F69%2F18bc82af600af3c847d864c9b4ae%2Fd9b91dc2727f41878e3c242c9465e2f9"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal judge says he knows of no U.S. Supreme Court precedent to justify the Pentagon’s censuring of a sitting U.S. senator who joined a videotaped plea for troops to resist unlawful orders from the Trump administration. Sen. Mark Kelly had a front-row seat in a courtroom on Tuesday as his attorneys urged U.S. District Judge Richard Leon to block the Pentagon from punishing the Arizona Democrat, a retired U.S. Navy pilot. Leon didn’t immediately rule from the bench on Kelly’s claims that Pentagon officials violated his First Amendment free speech rights. But the judge appeared to be skeptical of a government attorney's defense of Kelly’s Jan. 5 censure from Defense Secretary Pete Hegseth.",
      "publishedAt": "2026-02-03T23:02:34Z",
      "title": "Judge seems dubious of Pentagon's legal basis for censuring Mark Kelly",
      "url": "https://apnews.com/article/pentagon-kelly-hegseth-illegal-orders-lawsuit-57e0ff8794f09c27029695226ca0572d",
      "urlToImage": "https://dims.apnews.com/dims4/default/8583134/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F4c%2F8934cad8cc03dabe9e63ff1ddc04%2F90b5c6cdf3794330b1dd0ead729989dd"
    },
    {
      "author": "Jaimie Ding, Julie Watson",
      "description": "A California appeals court's decision to overturn the sex abuse conviction of former University of California, Los Angeles, gynecologist James Heaps has left his victims devastated and legal experts puzzled by the type of judicial error that transpired. The panel's ruling Monday hinged on a note sent by the foreperson to the judge expressing concern that one of the jurors did not have sufficient English to carry out his duties that was never shared with the defense. Some legal experts say this kind of error is unheard of. Lawyers representing Heaps' victims say their clients are devastated by the ruling.",
      "publishedAt": "2026-02-03T22:31:57Z",
      "title": "Legal experts say judge's mistake behind overturning of sex abuse conviction stands out",
      "url": "https://apnews.com/article/james-heap-ucla-gynecologist-sexual-abuse-8c3ad424cba4b8f3697a12273a72adc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/1eae4c2/2147483647/strip/true/crop/6000x3998+0+99/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Fc8%2Fc5f2f243a98c06439e606f8e1622%2Fd5d276c9032a461fa091d29477090a6b"
    },
    {
      "author": "Jennifer Peltz",
      "description": "The Westminster Kennel Club is getting ready to crown its top dog. After two days, 2,500 dogs and more than 200 breeds, it will come down to seven canines vying Tuesday night for U.S. show dogs’ most coveted prize. Four finalists already have been chosen. There's an Afghan hound named Zaida, a Lhasa apso called JJ, a Maltese named Cookie, and an old English sheepdog dubbed Graham. Three more rivals will be selected Tuesday night before they all face off at Madison Square Garden for the best in show prize.",
      "publishedAt": "2026-02-03T22:26:01Z",
      "title": "7 dogs competing for Westminster's show big prize",
      "url": "https://apnews.com/article/westminster-dog-show-best-show-finals-6ec7cec14b26143d2e527338c2e54f0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4fcf99/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F46%2Fdd7b5005f42848ec4f24b0e9c139%2F2e6d7ec0bf0142e39dc67712c808bca8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}