{
  "articles": [
    {
      "author": "Ellen Knickmeyer",
      "description": "The Trump administration says it's eliminating 2,000 posts at the U.S. Agency for International Development and placing all but a fraction of others worldwide on leave. The notices were sent to USAID workers and viewed Sunday by The Associated Press. It comes after a federal judge allowed the administration to move forward with pulling thousands of USAID staffers off the job in the United States and around the world. U.S. District Judge Carl Nichols rejected pleas to keep his temporary stay on the government’s plan in a lawsuit from employees.",
      "publishedAt": "2025-02-23T21:25:43Z",
      "title": "Trump administration firing 2,000 USAID workers",
      "url": "https://apnews.com/article/usaid-trump-musk-foreign-aid-firings-a3af8ce6ef17878b718c8e2ed3bf98e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/69c3297/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F47%2Fadf4bdb0392b40316130ee79a96f%2F1030eae021cf44c9b0bd1e8ce7dc7a9c"
    },
    {
      "author": "Steve Peoples, Eric Tucker, Amanda Seitz",
      "description": "Key federal agencies such as the FBI, State Department and Pentagon have instructed their employees not to comply with Elon Musk’s latest demand that they explain what they accomplished last week or risk losing their job. The pushback from appointees of President Donald Trump marked a new level of chaos and confusion within the beleaguered federal workforce. Administration officials scrambled throughout the weekend to interpret Musk’s unusual mandate. It apparently has Trump’s backing despite some lawmakers arguing it is illegal. Unions want the administration to rescind the request and apologize to workers, and are threatening to sue.",
      "publishedAt": "2025-02-23T17:33:34Z",
      "title": "Key federal agencies refuse to comply with Musk's latest demand",
      "url": "https://apnews.com/article/musk-federal-workers-trump-demand-firings-06553df358086db05917d3c50f3699d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c284ae/2147483647/strip/true/crop/5753x3236+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fe4%2Ff80cd927aa56100fedbf68e43628%2Fe8fd554cf6db4553aeafba710f01766f"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "When Bill Clinton came to Washington as president, his Democratic administration used corporate know-how and the new internet to streamline the federal bureaucracy as part of the “Reinventing Government” push. Millions of employees were offered buyouts and there were spending cuts to balance the budget. The effort led by Vice President Al Gore ended up eliminating about 400,000 federal positions and saved an estimated $146 billion. It might sound like the controversial cost-cutting push today led by billionaire Elon Musk under the auspices of Republican President Donald Trump. But the Clinton-era initiative was authorized by legislation, took several years to identify inefficiencies and involved federal workers in re-envisioning their jobs.",
      "publishedAt": "2025-02-23T12:24:36Z",
      "title": "Inside previous cost-cutting and government 'reinvention' efforts",
      "url": "https://apnews.com/article/trump-musk-doge-clinton-reinventing-government-gore-a95795eb75cacc03734ef0065c1b0a6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0f2e95/2147483647/strip/true/crop/2997x1686+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F80%2F847180b4f1e94ef3e5b27f56c2b8%2Fda375ba8a72e4d37b5e94adb4831148f"
    },
    {
      "author": "Will Weissert",
      "description": "President Donald Trump’s week included rewriting U.S. policy toward Russia and firing the country's senior military officer. Trump sat for a chummy interview with Elon Musk and sought greater authority over independent regulatory agencies. The Republican president acknowledged that “inflation is back” but said he “had nothing to do” with prices remaining high. That excuse can only work for so long, unless the economic outlook changes. Consumer sentiment suggests that isn’t happening. As the one-month mark of his second term came and went, Trump also offered increasingly fanciful pushes, including instructing officials to check Fort Knox to ensure the gold is still there and saying Musk could send humans to Mars.",
      "publishedAt": "2025-02-23T12:45:08Z",
      "title": "Russia, gold, DOGE and more: Week 5 at the Trump White House",
      "url": "https://apnews.com/article/trump-russia-musk-inflation-fort-knox-ukraine-f4e3b738f8b2cb869fec5bf9718ef1f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/11cfe09/2147483647/strip/true/crop/3458x1945+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F99%2Fb1b9c6c41060776501a81e1872b6%2F95f12b44028b43b29d7eb4a90f153515"
    },
    {
      "author": "Adriana Gomez Licon",
      "description": "At an annual gathering of conservatives, the emerging influence of billionaire Elon Musk on President Donald Trump was on display. The world’s wealthiest man, who leads Tesla and Space X, was the unexpected guest of honor at the Conservative Political Action Conference. His appearance announced hours before he took the stage wielding a chainsaw. The prop, and his comments, left little subtlety about his role or his influence. His presence was felt throughout the three-day confab with thousands of his black MAGA hats being passed and put on by conservatives gathered and with speakers frequently bringing up his cost-cutting efforts.",
      "publishedAt": "2025-02-23T18:40:12Z",
      "title": "At CPAC, Elon Musk's 'Dark MAGA' takeover is embraced",
      "url": "https://apnews.com/article/trump-musk-cpac-doge-maga-bannon-96ad2a6989c1d210c3ea83ccc11069cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/328ff87/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Fc5%2Fb6e34a5d0d9fccb6cdff89fe9ef5%2F99747c6718454660af4a7010576c4178"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican says Pope Francis is still receiving high flows of supplemental oxygen after doctors earlier said that the 88-year-old pope, who had part of one lung removed as a young man, was in critical condition. On Saturday morning, he suffered a prolonged asthmatic respiratory crisis while being treated for pneumonia and a complex lung infection. He also had blood transfusions to treat a low platelet count. He had a peaceful night and rested. The Vatican said he was still receiving supplemental oxygen on Sunday and more clinical tests were being conducted.",
      "publishedAt": "2025-02-23T07:31:02Z",
      "title": "Pope Francis had a peaceful night after respiratory crisis",
      "url": "https://apnews.com/article/vatican-pope-pneumonia-06324d49846f26a24acec1da5fc74ab2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a827904/2147483647/strip/true/crop/8312x4676+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fee%2F94fedb41baf5c26ececef7f8f8fc%2F8ae7d0df503f4c1680da102ab0f1d2a4"
    },
    {
      "author": "Tia Goldenberg, Majdi Mohammed",
      "description": "Israeli tanks have moved into the occupied West Bank for the first time since 2002, shortly after the defense minister said troops will remain “for the coming year” in parts of the Palestinian territory. Associated Press journalists saw a handful of tanks move Sunday into Jenin, long a bastion of armed struggle against Israel. Israel is deepening its crackdown on the Palestinian territory and has said it is determined to stamp out militancy amid a rise in attacks. Israel launched the broad offensive in the West Bank on Jan. 21 — two days after the current ceasefire in Gaza took hold.",
      "publishedAt": "2025-02-23T09:21:59Z",
      "title": "Israel expands into West Bank and says troops to remain for a year",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-23-2025-1c2dc86afd2e05888d5d588f462e898b",
      "urlToImage": "https://dims.apnews.com/dims4/default/71dc539/2147483647/strip/true/crop/5363x3017+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F96%2F5ae87cce7489a7e4639afafa8f19%2F415a1f18aaa84a9dbd1ba9549a9e8ae4"
    },
    {
      "author": "Justin Spike, Illia Novikov",
      "description": "Ukraine’s President Volodymyr Zelenskyy says a contentious U.S. proposal that would have seen $500 billion worth of profits from Ukrainian rare minerals given to the United States as compensation for its wartime assistance to Kyiv has been taken off the table. It was a sign the two sides may be drawing closer to a deal on U.S. access to Ukrainian minerals. Zelenskyy told a forum in Kyiv on Sunday that he was open to brokering a deal that would let the U.S. profit from his country’s minerals, but that the $500 billion sum initially proposed had been removed from the discussions. U.S. officials have expressed confidence that a deal could be reached this week.",
      "publishedAt": "2025-02-23T13:48:56Z",
      "title": "Zelenskyy says he’d be ready to give up presidency for peace",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-anniversary-putin-trump-c8f73a98d071055be52a1b22b0785ecc",
      "urlToImage": "https://dims.apnews.com/dims4/default/48edd02/2147483647/strip/true/crop/6576x3699+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Ffa%2F74ec12a1b8af9e573c45ca6f97ae%2F52a0ed82df8f4de68d21210711e23191"
    },
    {
      "author": "Geir Moulson",
      "description": "German opposition leader Friedrich Merz’s conservatives have won a lackluster victory in a national election Sunday, projections show. Alternative for Germany nearly doubled its support, the strongest showing for a far-right party since World War II. Merz said he was aware of the dimension of the task he faces and said that “it will not be easy.” Chancellor Olaf Scholz conceded defeat for his center-left Social Democrats. The election was dominated by worries about the years-long stagnation of Europe’s biggest economy, pressure to curb migration and growing uncertainty over Europe’s alliance with the United States.",
      "publishedAt": "2025-02-23T05:00:26Z",
      "title": "Germany elections: Merz claims victory for his conservatives",
      "url": "https://apnews.com/article/germany-election-merz-scholz-far-right-afd-ebf16ed38e0beaff7fed9a6d29b32a24",
      "urlToImage": "https://dims.apnews.com/dims4/default/202312a/2147483647/strip/true/crop/4793x2696+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F9e%2F920561de8a7d9564aacf8ad73436%2F4d07139566214c8380c389570a9795bf"
    },
    {
      "author": null,
      "description": "Workers at a Pennsylvania hospital who were injured during a shooting that left the gunman and a police officer dead are reported in “medically stable” condition. UPMC Memorial Hospital in York says they're making progress in their recovery. Investigators were still piecing together what happened a day after a man armed with a pistol and carrying zip ties entered the intensive care unit and took staff members hostage before he was killed by police in a shootout. A doctor, a nurse and a custodian, as well as two other police officers, were shot and wounded in the attack. A fourth hospital staffer was injured in a fall.",
      "publishedAt": "2025-02-23T17:03:44Z",
      "title": "York, Pa. hospital where gunman took hostages remains closed",
      "url": "https://apnews.com/article/york-pennsylvania-hospital-shooting-gunman-dead-301ac4681893f8377d1edf52d816a001",
      "urlToImage": "https://dims.apnews.com/dims4/default/d653b4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fb0%2F595795c668c25f9cbf4a6be1c502%2F721719711caa4cc09b0ce5e788999641"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}