{
  "articles": [
    {
      "author": null,
      "description": "U.S. President Donald Trump says the U.S. has signed an agreement with China on trade and expects to soon have a deal with India. Commerce Secretary Howard Lutnick told Bloomberg TV that the deal was signed earlier this week, but he gave no details. He said Trump is “the dealmaker” and wanted to “close these deals himself.” China has not announced any agreements, but it has said it was speeding up approvals of exports of rare earths, materials used in high-tech products such as electric vehicles. The deal mentioned by Trump followed meetings in London where officials said they had set a framework for resolving trade disputes.",
      "publishedAt": "2025-06-27T06:04:51Z",
      "title": "Trump says US has signed a deal with China on trade, without giving details",
      "url": "https://apnews.com/article/china-trade-earths-tariffs-trump-463ae8d6ccba15b56c7d4d31d3fc42a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/3343bf3/2147483647/strip/true/crop/3943x2218+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F6f%2Fb6f769108f2aab05f77edb1e49cb%2Fecf14e435f3d4343b20a557e7e101371"
    },
    {
      "author": null,
      "description": "The Supreme Court is meeting Friday to decide the final six cases of its term, including President Donald Trump’s bid to enforce his executive order denying birthright citizenship to U.S.-born children of parents who are in the country illegally. The justices take the bench at 10 a.m. for their last public session until the start of their new term on Oct. 6. The birthright citizenship order has been blocked nationwide by three lower courts. The Trump administration made an emergency appeal to the Supreme Court to narrow the court orders that have prevented the citizenship changes from taking effect anywhere in the U.S.",
      "publishedAt": "2025-06-27T04:01:51Z",
      "title": "Supreme Court meets Friday to decide birthright citizenship and other cases",
      "url": "https://apnews.com/article/supreme-court-trump-birthright-citizenship-2f8e856024885aa58d323c05cfeeeea6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8d3db8e/2147483647/strip/true/crop/4779x2688+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2Fd1%2F0af4196451f37b5b11d3254b2cac%2F02cc1e71f0624503bd5fe40c25d74ea1"
    },
    {
      "author": null,
      "description": "Iran's top diplomat says new nuclear talks with the U.S. are unlikely soon, citing complications from recent American military strikes. Foreign Minister Abbas Araghchi left open the possibility that his country would again enter talks on its nuclear program during an interview on Iranian state television broadcast late Thursday. But he suggested it would not be anytime soon. On Sunday, the U.S. bombed three key Iranian nuclear facilities. Araghchi acknowledged that “the level of damage is high.\" Iran retaliated Monday by firing missiles at a U.S. base in Qatar, though no casualties were reported.",
      "publishedAt": "2025-06-27T09:09:05Z",
      "title": "Iran's top diplomat says nuclear talks with the US complicated by strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-27-2025-e30d8ae4e3c6d13e4cfb562c35dd744b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4a9119/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2Fed%2F52fd7537c58e8503bfa62c51d777%2F45ee2cf35a2647498d757c325a46800d"
    },
    {
      "author": null,
      "description": "President Donald Trump's unconventional approach to clemency has spread hope among federal prisoners and formerly incarcerated people around the United States, prompting a wave of petitions carefully crafted to capture his attention. Like other presidents, Trump has drawn criticism for granting pardons and commutations to political allies. But legal scholars say the Republican president also has cast aside the traditional criteria and a clemency process historically overseen by nonpolitical Justice Department personnel. Trump has pardoned and commuted the sentences of more than 1,600 people since January. Administration officials say Trump decides on clemency requests after they’re vetted by the White House Counsel’s Office, the White House pardon czar and the Justice Department.",
      "publishedAt": "2025-06-27T11:04:44Z",
      "title": "Pardon applications are being carefully crafted with Trump in mind",
      "url": "https://apnews.com/article/trump-pardons-clemency-felons-campaign-donors-c13bb01491b3d5956ff48572983302fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/de050d9/2147483647/strip/true/crop/3031x1705+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F50%2Fb86a81f0dda7039b0ac74dfeaf1d%2F55f021f7977845e5b07075b159a9bf64"
    },
    {
      "author": null,
      "description": "A mother and her two young kids are fighting for their release from a Texas immigration detention center. The lawsuit filed Tuesday is challenging the Trump administration’s policy on immigrant arrests at courthouses. It's believed to be the first lawsuit involving children. It argues that the family’s arrests after entering the U.S. legally using a Biden-era online appointment app violate the family’s Fourth and Fifth Amendment rights. The mother, her 6-year-old son and her 9-year-old daughter have been held for a month after fleeing Honduras. The Department of Homeland Security did not immediately respond to an email requesting comment.",
      "publishedAt": "2025-06-27T02:46:53Z",
      "title": "Mother and kids fight for release from immigration detention after courthouse arrests",
      "url": "https://apnews.com/article/texas-immigration-lawsuit-children-detention-dee230ec5a6c31e1ac498d9fafd89e5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b2e36b/2147483647/strip/true/crop/5887x3311+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Ff3%2Fffd04fd093d6c22887ef7428c4e7%2F1a82b705d0134620a1d918ea4947e706"
    },
    {
      "author": null,
      "description": "Former Minnesota House Speaker Melissa Hortman will lie in state at the Minnesota Capitol rotunda. Hortman, her husband, and their dog were killed in a June 14 attack. The public can pay respects from noon to 5 p.m. Friday. A private funeral is set for Saturday. The suspect, Vance Boelter, who is charged with murder and attempted murder, is due in federal court Friday. Prosecutors allege he targeted multiple Democrats in what they call a political assassination. Boelter could face the federal death penalty. His wife has expressed shock and sympathy for the victims, calling the violence a betrayal of their beliefs.",
      "publishedAt": "2025-06-27T04:06:00Z",
      "title": "Minnesota lawmaker Melissa Hortman to lie in state, suspect in court",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-funeral-court-date-1558dffabc9bbf087a4e45f9cf868b09",
      "urlToImage": "https://dims.apnews.com/dims4/default/eca69f7/2147483647/strip/true/crop/5863x3298+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F20%2F635d0f6c8e0ca979d33975d69609%2Fbff4ff95d8e04cf88c2d48acd5023118"
    },
    {
      "author": null,
      "description": "Federal prosecutors have told a judge in Maryland the government plans to initiate deportation proceedings against Kilmar Abrego Garcia and to deport him to a country that is not his native El Salvador upon his release from a Tennessee jail. But the prosecutors Thursday also said that they would comply with all court orders and that their plans are not imminent. Attorneys for Abrego Garcia earlier asked the federal judge to order his return to Maryland when he is released from jail in Tennessee, an arrangement that would prevent likely attempts by immigration officials to quickly deport Abrego Garcia.",
      "publishedAt": "2025-06-26T17:36:06Z",
      "title": "Abrego Garcia's lawyers ask for him to go to Maryland to prevent deportation",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-maryland-tennessee-charges-deportation-c96844906793b35a80f9bbb4afa07e94",
      "urlToImage": "https://dims.apnews.com/dims4/default/1aa78ce/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F79%2F8fa7b9d7e8cd7f9955b65943098b%2F6eec930538d44fc78ef6fcfd51b346b2"
    },
    {
      "author": null,
      "description": "Flash floods triggered by pre-monsoon rains swept away dozens of tourists in northwest Pakistan on Friday, killing at least eight people. The nationwide death toll from rain-related incidents rose to 18 over the past 24 hours, officials said. Nearly 100 rescuers are searching for missing tourists along the Swat River in Khyber Pakhtunkhwa province. Rescuers have saved 58 people and recovered eight bodies so far. Heavy rains have caused widespread damage, with more rain expected this week.",
      "publishedAt": "2025-06-27T10:42:21Z",
      "title": "Flash floods in Pakistan kill 8 and 58 are rescued after deluge swept away dozens",
      "url": "https://apnews.com/article/pakistan-heavy-rains-flooding-swat-river-tourists-b74792eaf0088f70c21e9ef388f91705",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e78013/2147483647/strip/true/crop/2546x1432+0+133/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F9b%2Fc3a9a83d79e5d88d842183a35e81%2F116fcb9c2fee4c49a03c89e64d531103"
    },
    {
      "author": null,
      "description": "Global shares are mostly higher as the week winds down with the Israel-Iran ceasefire still in place and news that China and the U.S. have made progress on a trade deal. Officials gave no details about the deal that President Donald Trump said was signed earlier in the week. On Thursday, the S&P 500 ended just 0.05% below its all-time closing high set in February. The Dow Jones Industrial Average rallied 0.9%, and the Nasdaq gained 1%. Upbeat reports on the U.S. economy, including jobless claims and orders for long-lasting manufactured goods, also supported investor sentiment.",
      "publishedAt": "2025-06-27T04:12:21Z",
      "title": "Global shares are mostly higher after US stocks rise to the brink of a record",
      "url": "https://apnews.com/article/stocks-markets-china-tariffs-rates-53ddd3e8d11be4d09419418b4f141382",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1f395e/2147483647/strip/true/crop/3462x1947+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fb3%2F8e6a764391e5c2060c8399337387%2F35a2272fca56413d92bcd4c6c4a79a46"
    },
    {
      "author": null,
      "description": "The sky itself is no limit for billionaire Jeff Bezos and fiancée Lauren Sánchez. They have traveled into space, and expectations are just about as high for their wedding in Venice. The team of the world’s fourth-richest man has kept details under wraps. Still, whispers point to events spread across the lagoon city, adding complexity and cost. On Thursday, dozens of private jets touched down at Venice’s airport as yachts pulled into the city’s famed waterways. Aboard were athletes, celebrities, influencers and business leaders, converging to revel in extravagance that is as much a testament to the couple’s love as to their extraordinary wealth. The nuptials have also become a lightning rod for protests.",
      "publishedAt": "2025-06-27T04:05:23Z",
      "title": "Jeff Bezos' wedding brings celebrities and glitterati to Venice",
      "url": "https://apnews.com/article/venice-bezos-sanchez-wedding-amazon-cd8a6472407ce2f4c1d9e111db9beab9",
      "urlToImage": "https://dims.apnews.com/dims4/default/29e9e1b/2147483647/strip/true/crop/2934x1650+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F40%2F0a04d31cf305d2cbcef4c0ce6dc0%2Fcb10d01ac42740f4924caf45fa6d3b44"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}