{
  "articles": [
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and DAVID RISING",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli strikes hit near several hospitals in Gaza City early Friday as the military pushed deeper into dense urban neighborhoods in its battle with Hamas militants, prompting increasing numbers of civilians to flee toward the south of the besieged territory.",
      "publishedAt": "2023-11-10T08:42:59Z",
      "title": "Israeli strikes hit near several hospitals as the military pushes deeper into Gaza City",
      "url": "https://apnews.com/98025565691cc44304074b3e25d11ae5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/340e3f9028fb46079d82cf927353d313/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — Fistfights break out in bread lines. Residents wait hours for a gallon of brackish water that makes them sick. Scabies, diarrhea and respiratory infections rip through overcrowded shelters.",
      "publishedAt": "2023-11-09T17:18:45Z",
      "title": "Fights in bread lines, despair in shelters: War threatens to unravel Gaza's close-knit society",
      "url": "https://apnews.com/f225bf0723bb5b3ae1961ba6cdef1917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b243a9f66318463ea4c7f7f5d7a08d0f/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Joe Manchin's decision not to seek reelection virtually ensures that the Democratic Party will lose his Senate seat next year in deep-red West Virginia, making the party's steep path to retaining its razor-thin Senate majority even more difficult.",
      "publishedAt": "2023-11-10T05:31:20Z",
      "title": "Manchin decision hurts Democrats' Senate hopes and sparks new speculation about a presidential bid",
      "url": "https://apnews.com/976a0e13de57c5a1f00934adda4cb444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b46a0ae5e2b4b9ea5ee5459527e8945/1920.jpeg"
    },
    {
      "author": "RICHARD LARDNER",
      "description": "YANKEETOWN, Fla. (AP) — A freshwater spring bubbles amid the mangroves, cabbage palms and red cedars on Sweetheart Island, a two-acre uninhabited patch of paradise about a mile off the coast of this little Gulf Coast town.",
      "publishedAt": "2023-11-10T05:40:30Z",
      "title": "The Great Grift: COVID-19 fraudster used stolen relief aid to purchase a private island in Florida",
      "url": "https://apnews.com/a005ecfc3226f4ea501eb952c8ec1a8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a76666b01b114b999592ad51acd1dae7/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI, MARK VANCLEAVE and MELISSA PEREZ WINDER",
      "description": "ST. PETER, Minn. (AP) — Earl Meyer remembers in vivid detail when his platoon came under heavy fire during the Korean War -- he still has shrapnel embedded in his thigh.But over 70 years later, the 96-year-old is still waiting for the U.S.",
      "publishedAt": "2023-11-10T05:16:09Z",
      "title": "96-year-old Korean War veteran still attempting to get Purple Heart medal after 7 decades",
      "url": "https://apnews.com/db2a9388a7df82daf87435e325ba5b75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22d4116afc9f4166ba761a228eb31407/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Internet access across the war-torn nation of Yemen collapsed Friday and stayed down for hours, with officials later blaming unannounced “maintenance work” for an outage that followed attacks by the country's Houthi rebels on both Israel and the U.S.",
      "publishedAt": "2023-11-10T03:53:46Z",
      "title": "Internet collapses in war-torn Yemen over 'maintenance' after Houthi attacks targeting Israel, US",
      "url": "https://apnews.com/4255eccf371e558b7912ddcd94d706d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90e236a783b54c428c8c5f51daccd392/3000.jpeg"
    },
    {
      "author": "ELAINE GANLEY",
      "description": "PARIS (AP) — French far-right leader Marine Le Pen has set off a cacophony of criticism over her plans to attend a weekend march to protest rising antisemitism in France, with critics saying that her once-pariah party has failed to shake off its antisemitic heritage despite growing political legitimacy.",
      "publishedAt": "2023-11-10T05:21:24Z",
      "title": "French far-right leader Marine Le Pen raises a storm over her plan to march against antisemitism",
      "url": "https://apnews.com/1be755267b978c056de65f88a33c3302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a602b892b8a242289e3950d0253d900b/3000.jpeg"
    },
    {
      "author": "KEVIN McGILL, STEPHEN SMITH and COLLIN BINKLEY",
      "description": "NEW ORLEANS (AP) — As a Jewish student, Eden Roth always has felt safe and welcome at Tulane University, where more than 40% of the students are Jewish. That has been tested by the aftermath of last month's Hamas incursion into Israel.",
      "publishedAt": "2023-11-10T05:05:39Z",
      "title": "Clashes over Israel-Hamas war shatter students' sense of safety on US college campuses",
      "url": "https://apnews.com/29dca6e670639b73f5bfe7bfcf6befee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87bbb615666245b4a7a672f6ffc3658b/3000.jpeg"
    },
    {
      "author": "RIO YAMAT",
      "description": "LAS VEGAS (AP) — Over seven months of tense negotiations, mandatory daily room cleanings underscored the big issues that Las Vegas union hotel workers were fighting to address in their first contracts since the pandemic: job security, better working conditions and safety while on the job.",
      "publishedAt": "2023-11-10T05:03:27Z",
      "title": "Wynn joins Caesars and MGM in reaching tentative deal to avoid a strike by Las Vegas hotel workers",
      "url": "https://apnews.com/bd86587ba4b6faca68a8187bf6bd6daa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d7f0b5dd43945cfbf95700e5a6a92e3/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and NATACHA PISARENKO",
      "description": "BUENOS AIRES, Argentina (AP) — As thousands of Taylor Swift fans eagerly lined up Thursday for the superstar’s first-ever concert in Argentina, they saw themselves surrounded by posters urging them to not vote in favor of right-wing populist Javier Milei in next week’s presidential election.",
      "publishedAt": "2023-11-09T22:24:45Z",
      "title": "Taylor Swift's Argentina concert takes political turn as presidential election nears",
      "url": "https://apnews.com/2548bc419bcb6ae61a2ff258c3df468a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4c46f2f95eb4a6eab863e74faf17623/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}