{
  "articles": [
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — New Hampshire’s secretary of state on Wednesday scheduled the state’s presidential primaries for Jan. 23, 2024, extending its century-old streak of going first despite national Democrats’ efforts to overhaul the nominating calendar.",
      "publishedAt": "2023-11-15T19:12:53Z",
      "title": "New Hampshire defies national Democrats’ calendar revamp with Jan. 23, 2024, presidential primaries",
      "url": "https://apnews.com/552decd9c90f1e434d4141ad44bc1322",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50ce69fe819b4bc182ca7fba51ebdc19/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli troops on Wednesday stormed into Gaza’s largest hospital, searching for traces of Hamas inside and beneath the facility, where newborns and hundreds of other patients have suffered for days without electricity and other basic necessities as fighting raged outside.",
      "publishedAt": "2023-11-15T06:27:20Z",
      "title": "Israel searches for Hamas in raid of key Gaza hospital packed with patients and stranded families",
      "url": "https://apnews.com/b85e828db648f5f911278fa217e827e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f3da39b7b8d4e8baeb9f25962685aac/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, COLLEEN LONG and DIDI TANG",
      "description": "SAN FRANCISCO (AP) — Presidents Joe Biden and Xi Jinping head into their big meeting at a country estate on Wednesday hoping to stabilize U.S.-China relations after a period of tumult, but the U.S.",
      "publishedAt": "2023-11-15T08:09:25Z",
      "title": "Biden and Xi are meeting in San Francisco, seeking better US-China relations despite tough issues",
      "url": "https://apnews.com/58d11e7e3902955302182c2bc41430e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c5dfbd8ae1445b8a8cad8b07f3d307/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Voting on a tentative contract agreement between General Motors and the United Auto Workers union that ended a six-week strike against the company appears too close to call after the latest tallies at several GM factories were announced Wednesday.",
      "publishedAt": "2023-11-15T14:35:02Z",
      "title": "Vote on tentative contract with General Motors too close to call as more tallies are reported",
      "url": "https://apnews.com/6e2610aacf617a345a254179bf124a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c30a84bc7cc4d8dad02a34e8b4362d9/1990.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — The British government said Wednesday it will still try to send some migrants on a one-way trip to Rwanda, despite the U.K.",
      "publishedAt": "2023-11-15T06:09:01Z",
      "title": "UK top court says a plan to send migrants to Rwanda is illegal. The government still wants to do it",
      "url": "https://apnews.com/6e9e99a33dc47d16cf128a226a84acac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83383a5ee4bf45a387c0e2f4883681d8/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — Hazardous, forced work conditions sometimes akin to slavery have been detected on nearly 500 industrial fishing vessels around the world, but identifying those responsible for abuses at sea is hampered by a lack of transparency and regulatory oversight, a new report concluded.",
      "publishedAt": "2023-11-15T05:06:13Z",
      "title": "China leads list of labor abusers, sometimes akin to slavery, detected on fishing vessels worldwide",
      "url": "https://apnews.com/337cb7e790bdb3aec43f4781605ba7bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39d9c9783ab74266a876a63bcb15c31c/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and RODRIGO ABD",
      "description": "BUENOS AIRES, Argentina (AP) — Batman and the Joker, a man decked out in a full-body lion costume, and another whose head and arms have been replaced by chainsaws. This isn’t Carnival or Comic-Con, but rather the outlandish campaign rally for Argentine presidential candidate Javier Milei.",
      "publishedAt": "2023-11-15T05:10:17Z",
      "title": "Populist Javier Milei is rallying for the Argentine presidency with chainsaws and Comic-Con costumes",
      "url": "https://apnews.com/ea4b2b181ab98a60a9dc96572c27005b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/799b614396a64a58939f8ed558e540fc/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "Ahead of the highly anticipated meeting on Wednesday between U.S. President Joe Biden and Chinese leader Xi Jinping, Chinese state media have taken a new tone toward the U.S.",
      "publishedAt": "2023-11-15T10:44:23Z",
      "title": "China's state media take a new tone toward the US ahead of meeting between their leaders",
      "url": "https://apnews.com/7e2d60858bba60fd981a11dc523b7ed2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe959133cae944aa8685305766e072ff/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "HANOI, Vietnam (AP) — To meet the goal of limiting global warming to 1.5 degrees Celsius (2.7 degrees Fahrenheit), nine major Asian economies must increase the share of electricity they get from renewable energy from the current 6% to at least 50% by 2030, according to a report by a German thinktank released Wednesday.",
      "publishedAt": "2023-11-15T06:04:07Z",
      "title": "Asian economies must ramp up wind and solar power to keep global warming under 1.5C, report says",
      "url": "https://apnews.com/31f17bd2e3927da4aae882432eedbbc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b805c9fa5d5e4481be320a59ca084c1e/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House voted overwhelmingly Tuesday to prevent a government shutdown after new Republican Speaker Mike Johnson was forced to reach across the aisle to Democrats when hard-right conservatives revolted against his plan.",
      "publishedAt": "2023-11-14T05:05:47Z",
      "title": "House votes to prevent a government shutdown as GOP Speaker Johnson relies on Democrats for help",
      "url": "https://apnews.com/9cb26b703804a9e82e776e44caedcaa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee34c6177b1e43819bb6a4e37ff1f922/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}