{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "A senior cardinal has urged the cardinals voting in a conclave to elect a pope who prizes unity in diversity, and puts personal interests aside.Cardinal Giovanni Battista Re, the dean of the College of Cardinals, outlined the marching orders for the 133 men who will enter the Sistine Chapel later Wednesday to begin voting to elect a new pope. In his sermon at the final pre-conclave Mass, Re reminded the cardinals that a conclave represented the highest human and church responsibility, and that they must set aside “every personal consideration.” He said the new pope must foster communion and unity within the church.",
      "publishedAt": "2025-05-07T04:42:47Z",
      "title": "Cardinals are set to begin the conclave to elect a new pope",
      "url": "https://apnews.com/article/conclave-pope-francis-cardinals-50c798caa826bbb7c913791175536add",
      "urlToImage": "https://dims.apnews.com/dims4/default/12e3e11/2147483647/strip/true/crop/7087x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F92%2F850e99b481b65469a71e03afdb04%2F78056896e2954d5498b0b107e163ede1"
    },
    {
      "author": "Wafaa Shurafa, Tia Goldenberg",
      "description": "Hospital officials say Israeli strikes across Gaza killed at least 48 people, including women and children. Officials from the Al-Aqsa Hospital said on Wednesday that the strikes included one attack on a school sheltering hundreds of displaced Palestinians, which killed 27 people, including nine women and three children. It was the fifth time since the war began that the school has been struck. Strikes on targets in multiple other areas killed at least 21. The Israeli military had no immediate comment Wednesday on the strikes. Israel blames Hamas for the death toll because it operates from civilian infrastructure, including schools.",
      "publishedAt": "2025-05-07T08:01:56Z",
      "title": "Israeli strikes across Gaza kill more than 40 people as Israel prepares to ramp up its offensive",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-05-2025-e6c7f8b3b57f24518e1e66a66fee7713",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0e6cc5/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2Fb1%2Fc8ba3495b05a41d713095439d6ed%2F229df0a2a743497da8d764f5ed2e365e"
    },
    {
      "author": null,
      "description": "Pakistani security officials say that India fired missiles across the border into Pakistani-controlled territory in at least three locations early Wednesday, killing at a child and wounding two other people. India said it was striking infrastructure used by militants. The strikes came amid soaring tensions between the nuclear-armed neighbors over last month’s militant attack on tourists in the Indian-controlled portion of Kashmir. India has blamed Pakistan for backing the militant attack, which Islamabad has denied. The missiles early Wednesday struck locations in Pakistan-administered Kashmir and in the country’s eastern Punjab province, according to three Pakistani security officials.",
      "publishedAt": "2025-05-06T20:33:25Z",
      "title": "India fires missiles across the frontier with Pakistan, killing at least 1 child, officials say",
      "url": "https://apnews.com/article/pakistan-india-missiles-border-tensions-21a2859557179f2b32d6b8d5628ac853",
      "urlToImage": "https://dims.apnews.com/dims4/default/75c779d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fb0%2F13d9a6f090e23b10dad7070e71f7%2F4fe77d8fa06646669129fb401707744f"
    },
    {
      "author": "Christopher Rugaber",
      "description": "The Federal Reserve could keep its key rate unchanged for several more months as it seeks to evaluate the impact of President Donald Trump’s widespread tariffs on hiring and inflation, some economists say, even as the White House pushes for a rate cut. The Fed is nearly certain to keep its rate unchanged when it concludes its latest policy meeting Wednesday. Chair Jerome Powell has signaled that the Fed wants to see how the duties impact consumer prices and the economy. A big issue is how tariffs will impact inflation. Nearly all economists expect the import taxes will lift prices, but it’s not clear by how much or for how long.",
      "publishedAt": "2025-05-07T04:01:06Z",
      "title": "Federal Reserve faces tough balancing act between fighting inflation and spurring economic growth",
      "url": "https://apnews.com/article/federal-reserve-powell-rate-inflation-tariff-7b96cf47c986602db51ce87055ca5f24",
      "urlToImage": "https://dims.apnews.com/dims4/default/85e4716/2147483647/strip/true/crop/3628x2041+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F96%2Fb9a387e9058a12bd996f364b7e95%2F67697a9f9f974fb1b8a5a37078ec76de"
    },
    {
      "author": "Josh Boak",
      "description": "The more President Donald Trump talks about his efforts to reach deals with America’s trading partners, the more confusing the tariff picture gets. His team seems good with that, saying Trump is using “strategic uncertainty” to his advantage. Trump says the U.S. doesn’t have to sign any deals, but he also says the U.S. could sign 25 of them right now. He says he's looking for fair deals on all sides, but also that he doesn’t care about other countries’ markets. He says his team can sit down to negotiate the terms of a deal, and that he might just impose a set of tariffs on his own.",
      "publishedAt": "2025-05-07T17:01:00Z",
      "title": "Trump is big on making trade deals, but his definition keeps changing",
      "url": "https://apnews.com/article/trump-tariffs-deals-china-trade-02986c700a2d46c8b1ba85afe77d139f",
      "urlToImage": "https://dims.apnews.com/dims4/default/57b576d/2147483647/strip/true/crop/4661x2622+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F62%2F8cb32242b4be901a2358d682d682%2F42bf1d5f72754ba79342a9ccbdf33e3b"
    },
    {
      "author": "Michelle L. Price",
      "description": "Vice President JD Vance says Russia was “asking for too much” in its initial peace offer as the United States looks to bring about an end to the war in Ukraine. The vice president spoked Wednesday at a Washington meeting hosted by the Munich Security Conference, and didn't elaborate on the Moscow's terms. But Vance said he wasn't pessimistic about the possibility of a peace deal. By contrast, President Donald Trump has expressed skepticism that Russian President Vladimir Putin wants to end the war. Vance said the U.S. would like the Russian and Ukrainian leaders to sit down directly to negotiate a long-term settlement.",
      "publishedAt": "2025-05-07T17:45:13Z",
      "title": "Vance says Russia was 'asking for too much' in initial Ukraine peace offer",
      "url": "https://apnews.com/article/vance-russia-ukraine-war-iran-nuclear-talks-3a39623f10befa0d8daed3b7f58936fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/13f16fc/2147483647/strip/true/crop/2310x1299+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F93%2F2b1e289d207c93291dc3c87e2608%2F114902d8463747f2b60a345f9144ff96"
    },
    {
      "author": "Matthew Daly, Matthew Brown",
      "description": "House Republicans have added a provision to their sweeping tax cut package that would authorize the sale of thousands of acres of public lands in Nevada and Utah. The proposal prompted outrage from Democrats and environmental groups who called the plan a betrayal that could lead to increased drilling, mining and logging in the West. The plan would sell thousands of acres of public lands in the two states, and calls for some of the parcels to be considered for affordable housing projects. It's now part of Trump’s big bill of tax breaks and spending cuts that is moving through Congress.",
      "publishedAt": "2025-05-07T16:14:26Z",
      "title": "House Republicans push to sell thousands of acres of land in Utah, Nevada",
      "url": "https://apnews.com/article/public-lands-sale-nevada-utah-housing-republicans-98184c59528a92eca51ca6ab89e751cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc764ca/2147483647/strip/true/crop/4726x2658+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F4a%2F6264be822cabd005cf42f093b1a9%2F4f3d43fd15494c82a9edf72415bc3503"
    },
    {
      "author": "Josh Funk",
      "description": "The Federal Aviation Administration says it will upgrade the technology used to get radar data to air traffic controllers directing planes to the troubled Newark, New Jersey, airport and improve staffing to alleviate the problems there. At the same time, the agency is working on a broader multibillion-dollar plan that will be announced Thursday for long-overdue upgrades to the nation's air traffic control system. A January midair collision between a passenger jet and army helicopter over Washington, D.C. ,that killed 67 people, followed by a string of other crashes and mishaps, raised alarms about aviation safety and prompted officials to reexamine the system.",
      "publishedAt": "2025-05-07T16:02:23Z",
      "title": "FAA fixing problems at Newark airport while planning overhaul of US air traffic control system",
      "url": "https://apnews.com/article/aviation-safety-crash-newark-air-traffic-control-8c529cd72fab0bcb42ba286682553d6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b77463/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F79%2F1bb56263f0660fc2f53f9392caf5%2F87a6a71b29d7494c8ac44829ec655904"
    },
    {
      "author": "Olga R. Rodriguez",
      "description": "REAL ID requirements for those flying within the United States have begun after more than 20 years of delays. Starting Wednesday, travelers taking a domestic flight and using a state-issued ID to get through security must have one that meets federal REAL ID requirements. Many airports reported security checkpoint wait times of a few minutes on their websites Wednesday morning, although some had longer waits. Homeland Security Secretary Kristi Noem assured people Tuesday they will be able to fly after clearing additional identity checks. The Transportation Security Administration warned people who don’t have identification that complies with REAL ID requirements to show up early and be prepared for advanced screening to avoid causing delays.",
      "publishedAt": "2025-05-07T04:03:18Z",
      "title": "REAL ID requirements to fly in US take effect",
      "url": "https://apnews.com/article/real-id-travelers-tsa-when-deadline-f0923fe95923e9675d556ee7e08df326",
      "urlToImage": "https://dims.apnews.com/dims4/default/a828218/2147483647/strip/true/crop/4766x2681+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F5d%2F3f51368f5eba5d3fc14a1b11edf0%2Fd99671fe0fb4485682a6b664e215e06a"
    },
    {
      "author": "Dave Campbell",
      "description": "The Golden State Warriors are planning to play without Stephen Curry for at least the next three games of their second-round series against Minnesota. An MRI on Wednesday confirmed a mild strain of the star guard’s left hamstring. The Warriors said Curry would be sidelined at least a week after the injury Tuesday night forced him out early in second quarter of Game 1, which they won win 99-88. He had 13 points in 13 minutes to help Golden State take home-court advantage away from the Timberwolves. Game 2 is in Minneapolis on Thursday, before the series moves west to San Francisco for Games 3 and 4. The earliest return for Curry appears to be Game 5 on May 14.",
      "publishedAt": "2025-05-07T17:50:09Z",
      "title": "Warriors sideline Curry for at least a week with hamstring strain, putting rest of series in flux",
      "url": "https://apnews.com/article/nba-playoffs-warriors-curry-injury-7ff9bd8b9e6b0f4215577e5c540c52aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe2e668/2147483647/strip/true/crop/5575x3136+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F12%2F209647c3eea0f612e020b7b940e1%2F32e12dfd6327421484c12cf057852798"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}