{
  "articles": [
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Justice Department announced criminal charges Tuesday against Hamas leader Yahya Sinwar and other senior militants in connection with the Oct.",
      "publishedAt": "2024-09-03T21:00:24Z",
      "title": "US charges Hamas leader, other militants in connection with Oct. 7 massacre in Israel",
      "url": "https://apnews.com/87674285aa9b066392953db1310312ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62c0bfd29d93409db97a9301c690435a/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A federal judge on Tuesday swiftly rejected Donald Trump’s request to intervene in his New York hush money criminal case, spurning the former president’s attempt at an end-run around the state court where he was convicted and is set to be sentenced in two weeks.",
      "publishedAt": "2024-09-03T16:46:33Z",
      "title": "Federal judge rejects Donald Trump's request to intervene in wake of hush money conviction",
      "url": "https://apnews.com/a905207c7db9fc48d022d68ac6cc12e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36474db466ce442b8b572bfc130ed9a6/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis urged Indonesia to live up to its promise of “harmony in diversity” and fight religious intolerance on Wednesday, as he set a rigorous pace for an 11-day, four-nation trip through tropical Southeast Asia and Oceania that will test his stamina and health.",
      "publishedAt": "2024-09-04T04:53:19Z",
      "title": "In Asia, pope urges Indonesia to live up to promise of 'harmony in diversity,' fight extremism",
      "url": "https://apnews.com/90b9bbc4f12f7e13a2d8951d6b4ebc67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11cdeee78e8947e6bcb9cb588e3e26a4/1920.jpeg"
    },
    {
      "author": "LORI HINNANT and ILLIA NOVIKOV",
      "description": "POLTAVA, Ukraine (AP) — Two ballistic missiles blasted a military academy and nearby hospital Tuesday in Ukraine, killing more than 50 people and wounding more than 200 others, Ukrainian officials said, in one of the deadliest Russian strikes since the war began.",
      "publishedAt": "2024-09-03T11:39:17Z",
      "title": "Russian missiles blast Ukrainian military academy and hospital, killing more than 50, officials say",
      "url": "https://apnews.com/a53f1a4500ef52e4bf8217ee0e8bca84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2a1886069fb4b8da12dea8daf643492/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Donald Trump is betting that Americans crave trillions of dollars in tax cuts — and that growth will be so fantastic that it's not worth worrying about budget deficits.",
      "publishedAt": "2024-09-04T04:02:15Z",
      "title": "Raise taxes on the rich or cut them? Harris, Trump differ on how to boost the US economy",
      "url": "https://apnews.com/3ce44f07834bf211152029cde1319275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd44d4144c7c49e387e053bd608ad282/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is using a New Hampshire campaign stop on Wednesday to propose an expansion of tax incentives for small businesses — presenting a pro-entrepreneur plan that may soften her previous calls for wealthy Americans and large corporations to pay higher taxes.",
      "publishedAt": "2024-09-04T04:06:00Z",
      "title": "Harris is visiting New Hampshire, away from bigger swing states, to tout her small business tax plan",
      "url": "https://apnews.com/6dce74635a82647c44f8d6446ebffd17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1870b95954e6485f8f696b730be30296/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "MEXICO CITY (AP) — A global human rights watchdog on Wednesday implicated Venezuelan security forces and pro-government armed groups in killings that occurred during the protests that followed the country’s disputed July presidential election.",
      "publishedAt": "2024-09-04T04:21:57Z",
      "title": "Human rights group implicates Venezuelan security forces in killings during post-election protests",
      "url": "https://apnews.com/e260b55621002531ce0ba2e86fdedbd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13e235317db74441863991a61579a13d/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Seven years after a fire in a London high-rise building killed 72 people, an exhaustive public inquiry is set to report on the lapses and mistakes that turned a small fire in an apartment kitchen into the deadliest blaze on British soil since World War II.",
      "publishedAt": "2024-09-04T05:05:45Z",
      "title": "Survivors hope for answers as an inquiry delivers its report on London's deadly Grenfell Tower fire",
      "url": "https://apnews.com/361f5e836218a1feee0bd66cb5d0ef92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f075a11db62c4d78aed3fef00199bba5/3000.jpeg"
    },
    {
      "author": "ZIMO ZHONG",
      "description": "HONG KONG (AP) — Asian stocks tumbled Wednesday after Wall Street had its worst day since early August, with the heavyweight Nvidia falling 9.5%, leading to a global decline in chip-related stocks.",
      "publishedAt": "2024-09-04T05:06:14Z",
      "title": "Asian stocks decline, following Wall Street's drop on worries about the economy",
      "url": "https://apnews.com/3c351ab22c11531bb69ff06352f5e7db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85b9772573b14ccaa47eeeb538837659/3000.jpeg"
    },
    {
      "author": "BRIAN MAHONEY",
      "description": "NEW YORK (AP) — Emma Navarro's first Grand Slam semifinal will come at the U.S. Open against Aryna Sabalenka, someone trying to win her second major trophy of the year and third overall.Navarro, an American who is seeded 13th, used a stunning turnaround to grab the last six games of her quarterfinal against Paula Badosa for a 6-2, 7-5 victory at Flushing Meadows on Tuesday, following up her upset of defending champion Coco Gauff.",
      "publishedAt": "2024-09-03T17:44:24Z",
      "title": "US Open: Navarro's first Grand Slam semifinal will be against Sabalenka. Fritz and Tiafoe win, too",
      "url": "https://apnews.com/5e8eefc66c3c47326c0af52decc27955",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff8d26ad686846a494acae77c5b4c59d/2982.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}