{
  "articles": [
    {
      "author": "DAVID KOENIG, MANUEL VALDES and LINDSEY WASSON",
      "description": "SEATTLE (AP) — Aircraft assembly workers walked off the job early Friday at Boeing factories near Seattle and elsewhere after union members voted overwhelmingly to go on strike and reject a tentative contract that would have increased wages by 25% over four years.",
      "publishedAt": "2024-09-13T07:59:55Z",
      "title": "Boeing factory workers go on strike after rejecting contract offer",
      "url": "https://apnews.com/9f61a7d48675d1c3517233d40d4ec2b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f49f7b94ac314e4c8eb3ed28f90fbe35/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and JILL LAWLESS",
      "description": "Russia on Friday accused six British diplomats of spying and said it decided to expel them, while the U.K. said the “completely baseless” move came weeks ago and was linked to its action in May to revoke the credentials of an attaché at the Russian Embassy and limit Moscow’s diplomatic activities in London,",
      "publishedAt": "2024-09-13T06:49:11Z",
      "title": "Russia expels 6 British diplomats it accuses of spying, but the UK calls it 'completely baseless'",
      "url": "https://apnews.com/7845e3554c753388e8c952733589fb7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf9dac46a8b440ed935f0faa46d45c16/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Ukraine’s push to ease restrictions on the use of weapons from the U.S.",
      "publishedAt": "2024-09-13T04:03:12Z",
      "title": "US and British leaders are to meet as Ukraine pushes to ease weapons restrictions",
      "url": "https://apnews.com/8fec11abca0245d92a03291ab2d6b3fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7c5391d67a54b43b262146a7c645dbe/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and COLLEEN LONG",
      "description": "LOS ANGELES (AP) — Former President Donald Trump will campaign Friday in Western states as his opponent, Vice President Kamala Harris keeps her focus on one of the biggest battleground prizes in the East, Pennsylvania.",
      "publishedAt": "2024-09-13T04:06:06Z",
      "title": "Trump campaigns in Western states as Harris focuses on critical Pennsylvania",
      "url": "https://apnews.com/4d01558e10a3cbf9bd8b921971e03de2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39db3d88f80142f6a464acc46ff306ba/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER and LINLEY SANDERS",
      "description": "NEW YORK (AP) — When her husband turns on the television to hear news about the upcoming presidential election, that's often a signal for Lori Johnson Malveaux to leave the room.",
      "publishedAt": "2024-09-13T04:00:32Z",
      "title": "Too much? Many Americans feel the need to limit their political news, AP-NORC/USAFacts poll finds",
      "url": "https://apnews.com/77f2bf012502b9aea1d9d38173ace4ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e1bd6f25fc74802b3671d2554c747e1/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — In a significant show of defiance against the United States, North Korea on Friday provided the outside world with a rare view into a secretive facility built to enrich uranium for nuclear bombs as leader Kim Jong Un called for a rapid expansion of his nuclear weapons program.",
      "publishedAt": "2024-09-13T09:09:03Z",
      "title": "What to know about North Korea's unveiling of its uranium enrichment facility",
      "url": "https://apnews.com/665d19ad8f195f7e9d99d24cdcb0220a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1f3a9691424562b582464521db5ac3/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — Pope Francis has wrapped up his longest and most challenging trip ever, which took the 87-year-old pontiff more than 32,000 kilometers (20,000 miles) by air to four countries in the Asia-Pacific from Sept.",
      "publishedAt": "2024-09-13T05:32:52Z",
      "title": "AP PHOTOS: See the best moments from Pope Francis' Asia-Pacific trip — his longest ever",
      "url": "https://apnews.com/7509ab7a625fc63d951c05ce5b67a133",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a562756d973446d783a5ac5ec47e6c35/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and EMILY WANG FUJIYAMA",
      "description": "BEIJING (AP) — Starting next year, China will raise its retirement age for workers, which is now among the youngest in the world's major economies, in an effort to address its shrinking population and aging work force.",
      "publishedAt": "2024-09-13T06:52:54Z",
      "title": "China is raising its retirement age, now among the youngest in the world's major economies",
      "url": "https://apnews.com/642a34c97b1935fbaea8add81eda88b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9f34b8a062e4175a56d1ca58c61809a/3000.jpeg"
    },
    {
      "author": "JACK BROOK and SARA CLINE",
      "description": "DULAC, La. (AP) — Shortly after Hurricane Francine's storm surge flooded a cemetery in the Louisiana bayou town of Dulac, Lori-Ann Bergeron arrived to check on three generations of family graves.",
      "publishedAt": "2024-09-13T04:16:56Z",
      "title": "Gulf Coast residents still reeling from Hurricane Ida clean up mess left by Francine",
      "url": "https://apnews.com/6a14c9947a393e497ca63b15d0518cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec83da8ea7944b7b89c2a4898105cdfc/1920.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Solar storms may bring faint but visible auroras to the Northern Hemisphere starting late Thursday and extending into early Friday morning.",
      "publishedAt": "2024-09-12T16:48:50Z",
      "title": "Solar storms may cause faint auroras overnight in parts of Northern Hemisphere",
      "url": "https://apnews.com/7979db50fb734fee6ed343426d72469f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22cb998f157c4ee8887757943d391eff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}