{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Forced leaves have begun in Washington and worldwide for most employees of the U.S. Agency for International Development. Under a Trump administration plan, the agency is to be left with fewer than 300 workers out of many thousands. The leaves at USAID started Friday. Federal workers associations have turned to the courts to try to roll back orders dismantling most of the agency and U.S.- funded aid programs around the world. It's not clear whether the reduction to 300 would be permanent or temporary, potentially allowing more workers to return after what Trump administration says is a review of the aid and development programs it wants to resume.",
      "publishedAt": "2025-02-07T13:55:18Z",
      "title": "Forced leaves start for thousands at USAID under a Trump plan to gut the foreign aid agency",
      "url": "https://apnews.com/article/usaid-foreign-aid-trump-rubio-48f8460804d33bdaa18d7765c4b24f9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/75a7e4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F06%2F50d0ce2890d770e8b85e9bdc4574%2F786b30dbc5b847ecadb76eeabd1c5461"
    },
    {
      "author": "CHRIS MEGERIAN, COLLIN BINKLEY, BYRON TAU",
      "description": "A federal judge has blocked President Donald Trump’s plan to push out federal employees by offering them financial incentives. The decision Thursday comes hours before the midnight deadline for workers to apply for the program. U.S. District Judge George O’Toole Jr. in Boston sided with several labor unions that had requested a temporary restraining order against the plan orchestrated by Trump adviser Elon Musk. The Republican president is trying to downsize and reshape the federal workforce. The judge didn't express an opinion on the legality of the program. He scheduled a hearing for Monday and directed administration officials to extend the deadline to apply for the program until after the hearing.",
      "publishedAt": "2025-02-06T05:02:40Z",
      "title": "Federal workers debate legitimacy of buyout offer as deadline nears",
      "url": "https://apnews.com/article/buyout-offer-deadline-trump-federal-workers-ce854b19c41b90cd657f75cf09511e96",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad5835d/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F41%2Fcd50c4d3a03a9665ef5c4d941aa3%2Fae847ce1a1704b84b1dfd0696bf28f68"
    },
    {
      "author": "DAVID BAUDER",
      "description": "Federal government payments for subscriptions to media outlets have become the latest target of President Donald Trump's spending hawks. A day after his press secretary cited some $8 million in spending for Politico subscriptions, Trump dubbed it a “scandal” and online sleuths started looking for evidence of payments to other organizations like the New York Times and Associated Press. Said one Trump aide online: “The U.S. government must stop paying for media subscriptions.” But it's actually a long-running tradition, depended upon by governments around the world to help them keep up with what is going on. And, the AP noted, has been a staple of Democratic and Republican administrations.",
      "publishedAt": "2025-02-07T00:50:57Z",
      "title": "Trump promotes misleading claims about federal government’s media subscriptions",
      "url": "https://apnews.com/article/trump-media-payments-subscriptions-spending-365a0899a84fba1567e85bb83da1e06b",
      "urlToImage": "https://dims.apnews.com/dims4/default/831fe2b/2147483647/strip/true/crop/3473x1954+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd9%2Fffababbc173cc979f959f2c2c837%2F0a3d4fa13a1f492e94c07d82ad800b3a"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Democratic attorneys general in several states are vowing to file a lawsuit to stop Elon Musk’s Department of Government Efficiency from accessing federal payment systems containing Americans’ sensitive personal information. Thirteen attorneys general, including New York’s Letitia James, said in a statement issued Thursday that they were taking action in defense of the Constitution, people's right to privacy and essential funding that individuals and communities are counting on. Government officials and labor unions have been among those raising concerns about DOGE’s involvement with the payment system for the federal government. They say it could lead to security risks or missed payments for programs such as Social Security and Medicare.",
      "publishedAt": "2025-02-06T21:48:09Z",
      "title": "13 states to sue over DOGE access to government payment systems containing personal data",
      "url": "https://apnews.com/article/elon-musk-trump-doge-states-47912249bf4b79477cbe211565c9743c",
      "urlToImage": "https://dims.apnews.com/dims4/default/792a1ee/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F4b%2F2a922679318da2b2fe1757712380%2F43fb2bae60ee400097258000820369c5"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Iowa Sen. Joni Ernst has hailed Elon Musk and the Trump administration’s Department of Government Efficiency. So has Iowa Gov. Kim Reynolds. Their constituents are following the cost-cutting effort closely. Unlike their top elected officials, several of them are expressing concerns. Some question the delivery of government services or whether Musk has the necessary authority. Others back Musk, saying his action is needed given the risk of doing nothing to sharply curb federal spending.",
      "publishedAt": "2025-02-07T05:02:52Z",
      "title": "Here's what Iowans had to say about Musk and DOGE",
      "url": "https://apnews.com/article/trump-doge-iowa-elon-musk-joni-ernst-29c2756648bc889a33dbc0a0fd9cc05d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fd1388/2147483647/strip/true/crop/5319x2992+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fa9%2F0e8f612af5e1b6620c5fda851c1d%2F07456cc00d5149d79c443ba5e47dfa40"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate has confirmed Russell Vought, President Donald Trump’s nominee for White House budget director. He is planning to use one of the most powerful positions in federal government to zealously expand the president’s power. The Thursday night vote was planned after Democrats had exhausted their only remaining tool to stonewall a nomination — holding the Senate floor throughout the previous night and day with a series of speeches where they warned Vought was Trump’s “most dangerous nominee.” Vought’s return to the White House Office of Management and Budget, which he also helmed during Trump’s first term, would put him in a role that holds key power in implementing the president’s goals.",
      "publishedAt": "2025-02-06T21:08:59Z",
      "title": "Senate confirms Project 2025 architect Russell Vought as White House budget director",
      "url": "https://apnews.com/article/trump-russell-vought-confirmation-budget-project-2025-7d1c476694176876256e95cecbd49231",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c8d733/2147483647/strip/true/crop/5096x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F80%2Ff4643d0064b101fc3949c3e258c9%2F636f8317a9234298a897a64f9900d89a"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "The Associated Press has obtained audio of what military officials say is a broadcast from a Russian spy ship that suffered a fire and drifted uncontrolled off Syria's coast last month. The NATO-nation military officials spoke to the AP on condition of anonymity to discuss the fire and radio transmission that Russian authorities haven’t publicly reported. The officials said a NATO-nation ship recorded the radio exchanges involving the Russian eavesdropping vessel Kildin. The audio provides an unusual peek inside Russia’s fleet of spy ships that NATO nations are watching closely. A retired French vice admiral said the blaze highlights logistical difficulties for Russia of maintaining naval forces in the Mediterranean.",
      "publishedAt": "2025-02-07T03:08:22Z",
      "title": "Listen to audio from a Russian spy ship that officials say caught fire",
      "url": "https://apnews.com/article/russia-nato-spy-ship-audio-mediterranean-syria-2e6c4d6fa184d7333a3001344f2ea58c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e045cae/2147483647/strip/true/crop/2000x1125+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F5d%2F6b51f25bb925702ad5bb721df00e%2Ff0dd049708ff4438b4531eb5577a55f7"
    },
    {
      "author": "MATT O'BRIEN, BERNARD CONDON",
      "description": "When Elon Musk bought Twitter in 2022, he laid off thousands of employees, stopped paying rent and auctioned off coffee makers and office chairs in hopes of a big turnaround. Now the world’s richest man has brought the same slash-and-burn strategy to the federal government. Some people who experienced Musk’s takeover at Twitter have a warning: Expect chaos, cuts driven by ideology as much as by cost concerns, intimidation and plenty of lawsuits. Since assuming leadership of the Department of Government Efficiency, Musk has consolidated control over large swaths of the government, sidelined career officials, gained access to sensitive databases and invited a constitutional clash over the limits of presidential authority.",
      "publishedAt": "2025-02-07T15:47:42Z",
      "title": "The slash-and-burn tactics Musk brings to Washington often backfired at Twitter",
      "url": "https://apnews.com/article/elon-musk-twitter-takeover-x-doge-government-efficiency-e78ac431e7bbf2ae8513594078f1408b",
      "urlToImage": "https://dims.apnews.com/dims4/default/435a9b7/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F57%2F23bd03832f6008ed4a976fdb0328%2Fc12e78bcaf4b413ba6ac1612b9a13982"
    },
    {
      "author": "JOSH DUBOW",
      "description": "For the past 11 seasons, being named the AP first-team All-Pro quarterback was a prelude to winning the NFL’s MVP award. There was some logic to that with quarterbacks providing the most value to a team and the same panel picking the All-Pro team and all of the awards. There was a rare flip this year with Buffalo’s Josh Allen narrowly edging Baltimore’s Lamar Jackson in the MVP voting after finishing second in All-Pro voting revealed last month.",
      "publishedAt": "2025-02-07T04:02:55Z",
      "title": "How Josh Allen beat out Lamar Jackson for AP NFL MVP",
      "url": "https://apnews.com/article/nfl-mvp-explainer-e2e7a4163765f177e81d36c4f3da8aac",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1381ba/2147483647/strip/true/crop/3924x2207+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fe5%2F2c70f5854d78325c216d7c4ee6a0%2F26bac4fcd93d430a8c29b6294e965ca3"
    },
    {
      "author": "MOLLY QUELL, RAF CASERT",
      "description": "The International Criminal Court has called on its member states to stand up against sanctions imposed by U.S. President Donald Trump. The court said on Friday that the move was an attempt to “harm its independent and impartial judicial work.” The White House issued the executive order on Thursday in response to what it called “illegitimate and baseless actions targeting America and our close ally Israel.” It was referring to the arrest warrant that the ICC issued last year for Israeli Prime Minister Benjamin Netanyahu over alleged war crimes in Gaza. The Hague-based court said it “condemns” the move.",
      "publishedAt": "2025-02-07T09:35:01Z",
      "title": "ICC condemns sanctions by Trump, pledges to continue its work",
      "url": "https://apnews.com/article/icc-sanctions-trump-israel-gaza-17422a0d6dc57ac211be35abb3f9fb41",
      "urlToImage": "https://dims.apnews.com/dims4/default/91cf95f/2147483647/strip/true/crop/6496x3654+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F1b%2Fc5dbedcfcdb02d788f2f6861e21d%2Fe3b6bbb6264a451ba8805875324d7043"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}