{
  "articles": [
    {
      "author": "Yuri Kageyama",
      "description": "Shouting “banzai!” or “live long,” thousands of people gathered in a Tokyo park on Thursday and marched through the streets to the banging of traditional drums, as Japan kicked off celebrations to mark May Day. The holiday, also known as International Workers’ Day or Labor Day, marks the struggles and achievements of workers and the labor movement around the world. Thousands of people are expected to attend rallies and marches across the U.S., including in Chicago, Los Angeles, New York and Philadelphia. Junko Kuramochi, a member of a mothers’ group who joined the march in Japan’s capital, said: “For our children to be able to live with hope, the rights of workers must be recognized.\"",
      "publishedAt": "2025-05-01T05:48:25Z",
      "title": "From Tokyo to Los Angeles, workers observe May Day with marches and demonstrations",
      "url": "https://apnews.com/article/may-day-workers-labor-unions-rallies-marches-trump-46de8196d7f01d7458c3d77ccd5e0e54",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b3d59f/2147483647/strip/true/crop/6550x3684+0+341/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Fcf%2F886f747e06354e6583476720dc56%2F466482b70e64441baf9813fd2f97388f"
    },
    {
      "author": "Samya Kullab",
      "description": "After months of tense negotiations, the U.S. and Ukraine have signed a deal that is expected to give Washington access to the country’s critical minerals and other natural resources. Kyiv hopes the agreement will secure long-term support for its defense against Russia. According to Ukrainian officials, the version of the deal signed Wednesday is far more beneficial to Ukraine than previous versions. They said other versions reduced Kyiv to a junior partner and gave Washington unprecedented rights to the country’s resources. The agreement must still be ratified by the Ukrainian parliament. It would establish a reconstruction fund for Ukraine that Ukrainian officials hope will be a vehicle to ensure future American military assistance.",
      "publishedAt": "2025-05-01T09:55:37Z",
      "title": "Ukraine and the US have finally signed a minerals deal. What does it include?",
      "url": "https://apnews.com/article/ukraine-us-rare-earth-minerals-deal-8566241ea0e121a30437d845357055d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/95ed5f8/2147483647/strip/true/crop/4744x2669+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Fc0%2F0b25e9a61fb4c7fe000adf984af3%2Fa9dbf12401c2451387449554589b78d0"
    },
    {
      "author": "Michael R. Blood",
      "description": "Former Vice President Kamala Harris is heading to San Francisco, where she's expected to use a high-profile speech to deliver a sharp-edged critique of President Donald Trump's administration. Wednesday night's speech is being billed as Harris' most extensive public remarks since leaving office in January, after her defeat in the presidential election. Harris is expected to criticize the Republican president's economic policies and discuss America's place in global leadership. The speech comes when Harris has not ruled out a run for California governor or another try at the White House. Harris will be speaking to Emerge America, which recruits Democratic women to run for office.",
      "publishedAt": "2025-04-30T11:17:45Z",
      "title": "Harris speech about Trump: How to watch and what to expect",
      "url": "https://apnews.com/article/kamala-harris-speech-california-trump-democrats-governor-7f3fe64bfb93fcd39a5d06c39b2935f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f223253/2147483647/strip/true/crop/7530x4236+0+393/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F09%2Fa8c6db0e054cb3b672431ff91fbd%2Fba99a441501247b487e4a839a4243f54"
    },
    {
      "author": "Lolita Baldor",
      "description": "U.S. defense officials say the number of sexual assaults reported across the military fell by nearly 4% last year and there was a significant drop in the Army. It’s the second year in a row with a decrease. That reverses a troubling trend that’s plagued the Defense Department for more than a decade. The officials say that while the decline is a good sign, the numbers of reported assaults are still too high and the military needs to do more to get victims to report the often undisclosed crime. The officials spoke on condition of anonymity because the report hasn’t been publicly released.",
      "publishedAt": "2025-05-01T04:04:14Z",
      "title": "Sex assault reports in the US military fell last year, AP learns",
      "url": "https://apnews.com/article/military-sexual-assault-reports-harassment-7afab0cb897287768ac1199139ba793f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea76c6a/2147483647/strip/true/crop/5025x2827+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F02%2F10b21570bc30cb4e3e5b3674c33b%2F4400b5605ce74e84930e9c14dd5f5d88"
    },
    {
      "author": "Mary Clare Jalonick",
      "description": "Senate Democrats plan to force a vote in the coming weeks on a resolution to require more transparency from President Donald Trump’s administration about deportations to El Salvador. Virginia Sen. Tim Kaine expects to introduce the resolution Thursday. The resolution follows two previous votes on Democratic resolutions challenging Trump’s tariffs. It's part of a strategy by Democrats to force votes on reversing parts of the Republican president’s agenda. The resolution would force the Trump administration to report to Congress about what steps it's taking to comply with courts that have determined the U.S. government wrongfully deported immigrants like Kilmar Abrego Garcia to El Salvador. Most Republicans have enthusiastically embraced Trump’s border policies.",
      "publishedAt": "2025-05-01T10:37:35Z",
      "title": "Democrats will force vote on transparency for El Salvador deportations",
      "url": "https://apnews.com/article/senate-democrats-resolution-kaine-el-salvador-trump-098da9de5f104cd088525585d6286d5c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2394e4/2147483647/strip/true/crop/5974x3360+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2Fcf%2Fa2d62fe2a36e128689f87e25e20f%2F65bbb71c96aa484fa0f4faba5c6700e5"
    },
    {
      "author": "Michelle L. Price",
      "description": "Elon Musk is defending the work of the Department of Government Efficiency as he prepares to scale back from his government role and spend more time at his businesses. But in an interview Wednesday with reporters at the White House, he gave hazy answers about the work he’d been doing and DOGE’s future and seemed taken aback by the intense backlash he’d encountered. Musk estimates he’s cut $160 billion so far and acknowledged it would be hard to get anywhere close to his original stated goal of $1 trillion. He said, \"It’s sort of, how much pain is the Cabinet and the Congress willing to take?”",
      "publishedAt": "2025-05-01T09:30:41Z",
      "title": "Elon Musk defends his work as he prepares to wind down at DOGE",
      "url": "https://apnews.com/article/elon-musk-doge-donald-trump-962778979dd35ea79d6092df9cb2cb56",
      "urlToImage": "https://dims.apnews.com/dims4/default/14f97c6/2147483647/strip/true/crop/1902x1070+0+99/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2Fc5%2Ffd72b04df5acda8eb35735d4a488%2F0c4abd69e4c34bacad1452f9a5ef1049"
    },
    {
      "author": "Hyung-Jin Kim",
      "description": "South Korea’s acting leader, Prime Minister Han Duck-soo, says he is resigning amid reports he will run in next month’s presidential election. Han said in a televised briefing he determined he would quit to take “a bigger responsibility” for the country. South Korean media reported Han will officially launch his presidential campaign Friday. Han was appointed prime minister, the country’s No. 2 post, by then-President Yoon Suk Yeol, who was removed from office, triggering the by-election. Han has been emerging as a potential conservative standard bearer against liberal front-runner Lee Jae-myung.",
      "publishedAt": "2025-05-01T07:20:52Z",
      "title": "South Korea's acting leader Han resigns amid reports he will run for president",
      "url": "https://apnews.com/article/south-korea-presidential-election-han-ducksoo-94a9814f6eec74d5b7dd9565cfa41f7e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df55234/2147483647/strip/true/crop/3417x1922+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F15%2Fd94baada76c73622212f1a3b205f%2Fc14809901b954ffb9c8806de86c5f049"
    },
    {
      "author": "Colleen Barry",
      "description": "The conclave that begins next Wednesday to elect a successor for Pope Francis is the first in 46 ½ years for which the Vatican hasn't ordered a new cassock for the new head of the Catholic Church. That isn’t stopping Ranieri Mancinelli, who opened his ecclesiastical tailoring shop near the Vatican in the 1960s, from making three simple white cassocks just in case. Gammarelli, another family-run ecclesiastical tailor near the Pantheon in Rome's historic center, has a paper trail showing it has received cassock orders for every conclave since the beginning of the 20th century — and probably far earlier.",
      "publishedAt": "2025-05-01T04:09:16Z",
      "title": "These papal tailors aren't expecting a traditional order for new cassocks to outfit the next pope",
      "url": "https://apnews.com/article/pope-conclave-tailors-cassock-41f8a6d6946c5794cc0d46d3f37e50cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8363cd/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2Faa%2Fa27afe3a975825b8439379b1f3b3%2F3d39733559e54cb6b3caeb142b8a9d8f"
    },
    {
      "author": "Dee-Ann Durbin",
      "description": "McDonald’s store traffic fell unexpectedly in the first quarter as economic uncertainty weighed on diners. The burger giant said Thursday that it's same-store sales, or sales at locations open at least a year, fell 1% globally in the January-March period. Wall Street had been expecting an increase of nearly 2%. The trouble was particularly acute in the U.S., where same-store sales were down 3.6%. That was their worst performance since 2020. McDonald's has responded by expanding its U.S. value menu. It’s also offering its $5 Meal Deal through this summer. That deal was introduced last June and extended several times.",
      "publishedAt": "2025-05-01T11:13:01Z",
      "title": "McDonald's store traffic falls unexpectedly as diners grow uneasy about economy",
      "url": "https://apnews.com/article/mcdonalds-first-quarter-results-dbfdc5ab9be9a36ea5a20026280e8cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/a53cbba/2147483647/strip/true/crop/5878x3306+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2Fad%2F4c1f15a77645239912d415ff8149%2F381d7028942d40bcb2f4b60f92a44d01"
    },
    {
      "author": "Cathy Bussewitz",
      "description": "It's easy to accumulate clutter at work. That's true in home offices and traditional workspaces alike. And those jumbles of misplaced belongings can drain our mental resources and distract us from work. Clutter can also impact our mood. As households and workplaces embark on spring cleaning, it’s possible to reduce clutter and find more mental peace. First, regularly set aside time for decluttering, even if it's just 15 minutes. Set a timer. Sort items in the same category together first so you can see where there are extras. With piles of papers, think about whether you really need to hold on to each item. Reduce and get rid of duplicates. Do the same with digital files.",
      "publishedAt": "2025-05-01T11:46:21Z",
      "title": "How to clear out clutter in your workspace",
      "url": "https://apnews.com/article/spring-cleaning-workplace-wellness-office-declutter-stress-08511dd01a3766751598b0b0e32192fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c78861/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2Fe4%2Fa1b56f373a4d1f128a3688d46235%2F9bc064f53f2e4090ab8bd7172171a07b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}