{
  "articles": [
    {
      "author": "MOHAMED JAHJOUH, JACK JEFFERY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — It’s not just Israeli bombs that have killed children in war-ravaged Gaza — now some are dying of hunger. Officials have been warning for months that Israel’s siege and offensive were pushing the Palestinian territory into famine.",
      "publishedAt": "2024-03-08T05:04:53Z",
      "title": "It's not just Israeli bombs that have killed children in Gaza. Now some are dying of hunger too",
      "url": "https://apnews.com/2f938b1a82d7822c7da67cc162da1a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80daf8fa9f0d4f5894044b05ff955dad/3000.jpeg"
    },
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "LARNACA, Cyprus (AP) — A ship bearing humanitarian aid was making preparations to leave Cyprus and head for Gaza, the European Commission president said Friday as international donors launched a sea corridor to supply the besieged territory that is facing widespread hunger after five months of war.",
      "publishedAt": "2024-03-08T08:01:57Z",
      "title": "A ship with Gaza aid is preparing to inaugurate a sea route from Cyprus to the war-ravaged strip",
      "url": "https://apnews.com/196b1e1bdef8ce28449799759c797d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7614b35c394040cf9ae2be527abf826d/2000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "HOUSTON (AP) — The Republican National Committee voted Friday to install Donald Trump’s handpicked leadership team, completing his takeover of the national party as the former president closes in on a third straight presidential nomination.",
      "publishedAt": "2024-03-08T05:12:28Z",
      "title": "RNC votes to install Donald Trump's handpicked chair as former president tightens control of party",
      "url": "https://apnews.com/53402f8e8ac845db3cf4ab82c882ea74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9ea710e5e7647eeaeca0113e0416508/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Donald Trump has secured a $91.6 million bond sufficient to cover the money he owes to writer E. Jean Carroll in a defamation lawsuit while he appeals the jury's verdict, the former president’s lawyer told a court on Friday.",
      "publishedAt": "2024-03-08T16:25:29Z",
      "title": "Trump attorneys post $92 million bond to support jury award to E. Jean Carroll in defamation suit",
      "url": "https://apnews.com/298114f9b8c402643ec4747671fc75de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a67912b59f94202aa1f2a029e0fff28/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Dozens of foreigners, including many from the United States and Canada, are stranded in Haiti, desperately trying to leave the violence-torn country where anti-government gangs are battling police and have already shut down both of the country's international airports.",
      "publishedAt": "2024-03-08T20:19:35Z",
      "title": "Foreigners trapped in violence-torn Haiti wait desperately for a way out",
      "url": "https://apnews.com/a9501bd22ae3269ad011d8c116531646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5193ac6437d44ac0b08839d1a55b0d3b/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Former Honduran President Juan Orlando Hernandez was convicted Friday in New York of charges that he conspired with drug traffickers and used his military and national police force to enable tons of cocaine to make it unhindered into the United States.",
      "publishedAt": "2024-03-08T18:37:45Z",
      "title": "Former president of Honduras convicted in US of aiding drug traffickers",
      "url": "https://apnews.com/7c43423f12ff71859c370be2fc6ac5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd1fbaae0eb24eebbb1f1778fc6b2ec3/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The first “NYPD: Most Wanted” video was meant to be intimidating.Over a pounding soundtrack, the montage cuts among stock images and body-camera footage of actual police raids.",
      "publishedAt": "2024-03-08T16:15:47Z",
      "title": "The NYPD is using social media to target critics. That brings its own set of worries",
      "url": "https://apnews.com/1f80e5d3a1b8cac029dbb217c05cb8a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/056209b411174854ae4c7058dbceac8c/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden 's growing frustration with Israeli Prime Minister Benjamin Netanyahu continues to mount, with the Democrat captured on a hot mic saying that he and the Israeli leader will need to have a “come to Jesus meeting.”",
      "publishedAt": "2024-03-08T16:45:31Z",
      "title": "Biden in a hot mic moment shows his growing frustration with Netanyahu over Gaza humanitarian crisis",
      "url": "https://apnews.com/885b97a75d15d15ae7f7a47d0125c918",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a590dd23aafd483596b5db5acfec54b8/1920.jpeg"
    },
    {
      "author": "MATT O'BRIEN and HALELUYA HADERO",
      "description": "OpenAI is reinstating CEO Sam Altman to its board of directors and said it has “full confidence” in his leadership after the conclusion of an outside investigation into the company's turmoil.The ChatGPT maker tapped the law firm WilmerHale to look into what led the company to abruptly fire Altman in November, only to rehire him days later.",
      "publishedAt": "2024-03-08T22:48:40Z",
      "title": "OpenAI has 'full confidence' in CEO Sam Altman after investigation, reinstates him to board",
      "url": "https://apnews.com/2f3303dff2280478947e9bfb04863537",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/201a1d222f0d4381b878408780de6cab/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIMA, Peru (AP) — Police in Peru announced the arrest Friday of an Iranian citizen who was purportedly a member of Iran's Quds Force and allegedly planned to kill an Israeli citizen in the South American country.",
      "publishedAt": "2024-03-08T23:34:58Z",
      "title": "Peru arrests an Iranian man accused of planning an attack on an Israeli citizen",
      "url": "https://apnews.com/ca7884d44bb5e64ee57c18b95f1ec1dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6423340fb13c4bdbaf3cac541cfeb1f7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}