{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — The jury in Donald Trump’s hush money trial is to resume deliberations Thursday after asking to rehear potentially crucial testimony about the alleged hush money scheme at the heart of the history-making case.",
      "publishedAt": "2024-05-30T04:03:01Z",
      "title": "Jurors in Trump's hush money trial zero in on testimony of key witnesses as deliberations resume",
      "url": "https://apnews.com/85558c6d08efb434d05b694364470aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/234765e3617f4920ba63d0502a264bdf/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel’s military said Wednesday it seized control of a strategic corridor along Gaza’s border with Egypt to cut off smuggling tunnels as it tries to destroy the militant Hamas group in a war now in its eighth month.",
      "publishedAt": "2024-05-29T14:47:37Z",
      "title": "Israel says it's taken control of key area of Gaza's border with Egypt awash in smuggling tunnels",
      "url": "https://apnews.com/7952f779552f41ef6fb44c3b662f5c48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60a3088ad22746d4ab1dfc0bf46d8460/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — A string of security, logistical and weather problems has battered the plan to deliver desperately needed humanitarian aid to Gaza through a U.S.",
      "publishedAt": "2024-05-29T22:54:10Z",
      "title": "The US-built pier in Gaza broke apart. Here's how we got here and what might be next",
      "url": "https://apnews.com/77d0cf1c1bd420042dc4cb6f4ad76ccb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/837f1b8883f7486dbde26ca61fca9a51/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG and ZEN SOO",
      "description": "HONG KONG (AP) — A Hong Kong court Thursday convicted 14 pro-democracy activists in the city’s biggest national security case under a law imposed by Beijing that has all but wiped out public dissent.",
      "publishedAt": "2024-05-30T02:00:42Z",
      "title": "Hong Kong court convicts 14 pro-democracy activists in the city's biggest national security case",
      "url": "https://apnews.com/5b8e7ac1100342db642040985bc417b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b95defaa8abb470d89816dc187182268/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — In declining to step aside from two high-profile Supreme Court cases, Justice Samuel Alito on Wednesday provided a rare window on the opaque process by which justices decide to step aside from cases.",
      "publishedAt": "2024-05-29T21:19:22Z",
      "title": "To recuse or refuse? A look at Supreme Court justices’ decisions on whether to step aside in cases",
      "url": "https://apnews.com/f4ef46683365c92e8a3ff9df7894b586",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e4333352ce34cdf9b855c41e764f49c/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON and MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico goes into Sunday’s election deeply divided: friends and relatives no longer talk politics for fear of worsening unbridgeable divides, while drug cartels have split the country into a patchwork quilt of warring fiefdoms.",
      "publishedAt": "2024-05-30T04:41:20Z",
      "title": "A violent, polarized Mexico goes to the polls to choose between 2 women presidential candidates",
      "url": "https://apnews.com/4d5f620f0f8f9b7ef6efa8b3083561a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bf83bdb4c204f62a158049c82bb55d1/2374.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran opened a five-day registration period Thursday for hopefuls wanting to run in the June 28 presidential election to replace the late Ebrahim Raisi, who was killed in a helicopter crash earlier this month with seven others.",
      "publishedAt": "2024-05-30T04:45:58Z",
      "title": "Iran opens registration period for the presidential election after a helicopter crash killed Raisi",
      "url": "https://apnews.com/38421a7f0db72a0e3086a8c1b1db6f9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e32e6a1df214d498ef2184b6c4c7c1a/3000.jpeg"
    },
    {
      "author": "KAREN MATTHEWS",
      "description": "NEW YORK (AP) — A nurse was fired by a New York City hospital after she referred to Israel's war in Gaza as a “genocide” during a speech accepting an award.Labor and delivery nurse Hesen Jabr, who is Palestinian American, was being honored by NYU Langone Health for her compassion in caring for mothers who had lost babies when she drew a link between her work and the suffering of mothers in Gaza.",
      "publishedAt": "2024-05-29T17:45:27Z",
      "title": "A nurse honored for compassion is fired after referring to Gaza 'genocide' in speech",
      "url": "https://apnews.com/55c694d6a0c64b1612262310dc208124",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e23781e8aab5434d812a551f54dc8333/3000.jpeg"
    },
    {
      "author": null,
      "description": "HELEN, Ga. (AP) — A profile of Andrew “Andy” Negra Jr., of Helen, Georgia, one of a dwindling number of veterans took part in the Allies’ European war effort that led to the defeat of Nazi Germany.",
      "publishedAt": "2024-05-30T04:12:54Z",
      "title": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world.'",
      "url": "https://apnews.com/2b62661bdd15804c03ab7dbbbb7fc92d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbe8690e4549494da40c88565cb09108/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — The incarceration of 120,000 Japanese Americans, including children, labeled enemies during World War II is an historical experience that has traumatized, and galvanized, the Japanese American community over the decades.",
      "publishedAt": "2024-05-30T04:40:36Z",
      "title": "'Star Trek' actor George Takei is determined to keep telling his Japanese American story",
      "url": "https://apnews.com/07c2b803a951b766962ac029ce59da14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa539a5b0dcb46058b37e710b82bec50/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}