{
  "articles": [
    {
      "author": null,
      "description": "Emergency crews have suspended their search for victims of catastrophic flooding in central Texas amid new warnings that additional rain will again cause waterways to surge. Ingram Fire Department officials ordered search crews to immediately evacuate the Guadalupe River corridor in Kerr County until further notice, warning the potential for a flash flood is high. Search-and-rescue teams have been searching for missing victims of the July 4 weekend flooding that killed at least 129 people and left more than 170 missing. As heavy rain fell Sunday, National Weather Service forecasters warned that the Guadalupe River could rise to nearly 15 feet by the afternoon, about five feet above flood stage.",
      "publishedAt": "2025-07-13T14:27:16Z",
      "title": "Search for Texas flood victims paused as heavy rains bring new threat of high waters",
      "url": "https://apnews.com/article/texas-flooding-guadalupe-river-search-4c561ad81ee11c8a1fd586cac460c2fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/06defe2/2147483647/strip/true/crop/7992x4496+0+416/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fec%2F3e627b47205750ac753d1f8b86b2%2F75018fcf7ab14bbfa6161e6e48e41118"
    },
    {
      "author": null,
      "description": "A year after the assassination attempt against President Donald Trump during a Butler, Pennsylvania campaign rally, and the results from various investigations into the shooting are still coming. The Senate Committee on Homeland Security & Governmental Affairs in a report released Sunday said the Secret Service denied “multiple requests for additional staff, assets, and resources to protect President Trump” during the campaign. Another report by the Government Accountability Office criticized the Secret Service’s practices for sharing threat information, saying they had “siloed information sharing practices.” One rallygoer was killed and two others wounded when a gunman opened fire from a nearby roof. A bullet grazed Trump's ear.",
      "publishedAt": "2025-07-13T11:05:56Z",
      "title": "After Trump assassination attempt, questions remain for Secret Service",
      "url": "https://apnews.com/article/trump-butler-assassination-attempt-anniversary-crooks-d18804b0e1382003bbb91449638c721c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d4ab58/2147483647/strip/true/crop/5613x3157+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F93%2F6335f22e13f52f2f0537fc5a3df4%2Ff6f41b3f6d4e4d3ebfdc161ca0766cad"
    },
    {
      "author": null,
      "description": "NATO Secretary General Mark Rutte is set to meet President Donald Trump this week on the heels of the U.S. leader announcing plans to sell NATO allies weaponry that it can then pass on to Ukraine. NATO said Rutte will be in Washington on Monday and Tuesday and would meet with Trump, Secretary of State Marco Rubio, and Defense Secretary Pete Hegseth as well as Congress. The visit also comes as Trump last week teased that he would make a “major statement” on Russia on Monday and as Ukraine is struggling to repel massive and complex air assaults launched by Russian forces.",
      "publishedAt": "2025-07-13T14:04:24Z",
      "title": "Trump to meet NATO leader Rutte after Ukraine weapons sales",
      "url": "https://apnews.com/article/trump-rutte-nato-putin-ukraine-524abe34764e4bb5838bbc90fc992520",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f3bd8a/2147483647/strip/true/crop/4339x2441+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F99%2F1da809154681f70606c1709908e8%2F88efd82867e543d0bfca2fb7f0e00322"
    },
    {
      "author": null,
      "description": "Two women were killed in a shooting at a Kentucky church in an incident that began after a state trooper was shot and wounded, authorities said. The suspect was also killed Sunday. In a news conference, Lexington Police Chief Lawrence Weathers says it began after the trooper pulled over a vehicle near the airport. After shooting the trooper, the suspect carjacked a vehicle and fled to the church where they began shooting at people there. The suspect was later killed by Lexington police.",
      "publishedAt": "2025-07-13T18:48:21Z",
      "title": "Multiple people hurt in Kentucky church shooting; suspect killed, police say",
      "url": "https://apnews.com/article/kentucky-church-shooting-suspect-dead-c31e1c1c050ba96416fbd2082e4866d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Nursing homes around the U.S. say they're feeling the effects of President Donald Trump's immigration crackdown. As Trump has rescinded work authorizations for various groups of immigrants with Temporary Protected Status, long-term care employees have been pulled from their jobs. Meantime, facilities around the country say they're seeing a narrowing of the pipeline of potential candidates. Some homes who had tapped refugees from Afghanistan, Ukraine and elsewhere are lamenting the pause of refugee arrivals. Others who sought out nurses in Nigeria and the Philippines say visa waits are dragging on so long that candidates are choosing other countries.",
      "publishedAt": "2025-07-13T13:00:07Z",
      "title": "Nursing homes face staffing crunch as Trump's immigration policies disrupt workforce",
      "url": "https://apnews.com/article/immigration-nursing-homes-trump-elderly-6aa6a1d1e409859fb7e5c244ddbb0c8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ce62ae/2147483647/strip/true/crop/3159x1777+0+168/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F7f%2F0c757f8c5e0346148d801037d661%2Fa5ae1ec86d4e4ae189b0a86c23f37989"
    },
    {
      "author": null,
      "description": "Debate over President Donald Trump’s sweeping budget-and-policy package is over on Capitol Hill. Now the argument goes national. The new law already is shaping the 2026 midterm battle for control of the House of Representatives in dozens of competitive districts coast to coast. The outcome will set the tone for Trump’s final two years in the Oval Office. Democrats need a net gain of three House seats to break the GOP’s chokehold on Washington and reestablish a power center to counter Trump. Both parties have launched an effort to define the complex bill for voters across the competitive districts.",
      "publishedAt": "2025-07-13T12:15:51Z",
      "title": "Trump's big bill launches the battle for House control as midterms loom",
      "url": "https://apnews.com/article/trump-big-bill-midterm-election-republican-23652b22f1d760f5e3254ad4c3b642e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/2dc8c2f/2147483647/strip/true/crop/2300x1294+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F94%2F45aa404f971f90cb720bc4cf9a92%2F917a64ca9bb84855b995fa3f11ef5076"
    },
    {
      "author": null,
      "description": "Witnesses and health workers say at least 31 Palestinians have been shot dead in Gaza while seeking food aid. Separately, hospitals say Israeli airstrikes killed at least 28 Palestinians overnight and into Saturday. The Red Cross said its field hospital saw its largest influx of dead in more than a year of operation after the shootings. Israel's military says it fired warning shots toward people it said were behaving suspiciously. The 21-month war has left much of Gaza’s population of over 2 million reliant on outside aid while food security experts warn of famine. There is no sign of a breakthrough in ceasefire talks.",
      "publishedAt": "2025-07-12T10:15:44Z",
      "title": "59 people in Gaza are killed by Israeli airstrikes or shot dead while seeking aid",
      "url": "https://apnews.com/article/israel-gaza-hamas-war-news-07-12-2025-c4c28f93ab77584f7909b5cd63aeb22e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c3f996/2147483647/strip/true/crop/8092x4552+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F7a%2Fec22918a557a3f1b4dc5e8b479cd%2F132189d7ddc2421cb7148edb8d21cfc4"
    },
    {
      "author": null,
      "description": "Former Nigerian President Muhammadu Buhari, who led the country twice as a military head of state and a democratic president, has died aged 82. He died Sunday in London, where he had been receiving medical treatment. He first took power in Africa’s most populous nation in 1983, after a military coup, running an authoritarian regime until fellow soldiers ousted him less than 20 months later. When he was elected in 2015 on his fourth attempt, he became the first opposition candidate to win a presidential election there. His stays in power were marked by the challenges of deadly extremism, widespread corruption and economic troubles.",
      "publishedAt": "2025-07-13T16:35:24Z",
      "title": "Nigeria's ex-president Buhari, twice leader of Africa's most populous nation, dies at 82",
      "url": "https://apnews.com/article/nigeria-muhammadu-buhari-obituary-president-military-democracy-6c4b65b79917eea26f8140d7e9b25677",
      "urlToImage": "https://dims.apnews.com/dims4/default/27b1b2a/2147483647/strip/true/crop/4145x2332+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2Fbb%2F4eb02adbde90845a490d31005c44%2F606f7dfeed8b47aa92021cd2b36c8696"
    },
    {
      "author": null,
      "description": "In a bid to kickoff a new era for DC Studios, James Gunn’s “Superman” opened with $122 million in U.S. and Canada ticket sales over the weekend. DC and Warner Bros. had a lot riding on “Superman.” The superheroes of DC have recently found mostly kryptonite in theaters. Films like “Joker: Folie à Deux,” “The Flash” and “Shazam! Fury of the Gods” all flopped. But “Superman\" is intended as a new start. It’s the first release fully steered by Gunn and Peter Safran since they were handed the keys to DC’s superhero cinematic universe. The roughly on-target opening was the third largest of 2025. Ticket sales were relatively soft for “Superman” overseas. In 78 international markets, it grossed $95 million.",
      "publishedAt": "2025-07-13T16:31:57Z",
      "title": "‘Superman’ and DC Studios fly to a $122 million opening",
      "url": "https://apnews.com/article/superman-box-office-dc-james-gunn-e66bcc163a8aebf01a25a8b2e7dc08f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8ba03b/2147483647/strip/true/crop/3571x2009+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F9f%2F50d71f104c34a24154dff009e9ca%2Fdf31b2fa423749d086b2269370c46196"
    },
    {
      "author": null,
      "description": "Jannik Sinner has defeated two-time defending champion Carlos Alcaraz 4-6, 6-4, 6-4, 6-4 to win his first Wimbledon championship and reverse the result of their epic French Open final five weeks ago. The victory Sunday by the No. 1-ranked Sinner gave him his fourth Grand Slam title overall. It also allowed the 23-year-old Italian to put an end to several streaks for No. 2 Alcaraz. The 22-year-old Spaniard had won the past five head-to-head matches. And Alcaraz entered the day on a career-best 24-match unbeaten run. He also had won 20 matches in a row at the All England Club. The last man to beat Alcaraz at Wimbledon was Sinner in 2022.",
      "publishedAt": "2025-07-13T07:00:08Z",
      "title": "Jannik Sinner beats Carlos Alcaraz to win Wimbledon",
      "url": "https://apnews.com/article/wimbledon-final-alcaraz-sinner-3366c0283890986775bd9dbe89567d2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/081c9d2/2147483647/strip/true/crop/4485x2523+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F1e%2Fef3d334cb747b28074161ff8df7c%2F3317dfb14ab24f559ddf855796d234af"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}