{
  "articles": [
    {
      "author": "ISABEL DEBRE",
      "description": "BEITUNIA, West Bank (AP) — Over three dozen Palestinian prisoners returned home to a hero's welcome in the occupied West Bank on Friday following their release from Israeli prisons as part of a cease-fire deal between Israel and Hamas.",
      "publishedAt": "2023-11-24T21:43:28Z",
      "title": "Palestinian families rejoice over release of minors and women in wartime prisoner swap",
      "url": "https://apnews.com/92545883b1fef86fb9b34549b7deca58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf4917c5943545759925bd776c5f769e/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, JOSEF FEDERMAN and JACK JEFFERY",
      "description": "RAFAH, Gaza Strip (AP) — Hamas on Friday released 24 hostages it held captive in Gaza for weeks, and Israel freed 39 Palestinians from prison in the first stage of a swap under a four-day cease-fire that offered a small glimmer of relief to both sides.",
      "publishedAt": "2023-11-24T05:02:34Z",
      "title": "On Day One of Gaza cease-fire, Hamas and Israel carry out first swap of hostages and prisoners",
      "url": "https://apnews.com/172256dd593189f7b37f7c62f4739c6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecea10c927c04b5eacc5653e50a5786b/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona, a person familiar with the matter told The Associated Press.",
      "publishedAt": "2023-11-25T01:54:52Z",
      "title": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says",
      "url": "https://apnews.com/f24cde6aa28877d034530c2dc40ef7ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO and ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — Shoppers venturing out to malls and stores on Black Friday found perks from champagne to virtual reality experiences and old-fashioned doorbusters, as retailers tried to entice customers who are resisting splurges and impulse buying this year.",
      "publishedAt": "2023-11-24T05:02:14Z",
      "title": "Retailers offer bigger Black Friday discounts to lure hesitant shoppers hunting for the best deals",
      "url": "https://apnews.com/fe9ab8137c76aa0df2e5b0a7cc3ecda4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9cedaf6e78d4b44850206d1f2502137/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — Gaza has always been a small, crowded space with hardly any exits. Now the world for Palestinians there has shrunk to the size of whatever refuge they can find: a jammed shelter, a car, the walls of a shared apartment, or floors and benches in hospital corridors.",
      "publishedAt": "2023-11-24T13:01:59Z",
      "title": "Gaza shrinks for Palestinians seeking refuge. 4 stories offer a glimpse into a diminished world",
      "url": "https://apnews.com/702f447ff7e52b03476555ec2513008b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb2f69eabc0b48c584abf4c64376f7b5/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Ofri Bibas Levy has been haunted by nightmares since Oct. 7, when her brother, sister-in-law and their two young children were snatched by Hamas militants from their homes and dragged into the Gaza Strip.",
      "publishedAt": "2023-11-24T13:32:53Z",
      "title": "Families of hostages not slated for release from Gaza during current truce face enduring nightmare",
      "url": "https://apnews.com/6395a6113301e677bcac713f8db914b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a33aa231f599416d8d1475e7aab2fab4/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and MARIA SHERMAN",
      "description": "NASHVILLE, Tenn. (AP) — Daryl Hall has sued his longtime music partner John Oates, arguing that his plan to sell off his share of a joint venture would violate the terms of a business agreement the Hall &amp; Oates duo had forged.",
      "publishedAt": "2023-11-24T20:22:19Z",
      "title": "Daryl Hall is suing John Oates over plan to sell stake in joint venture. A judge has paused the sale",
      "url": "https://apnews.com/42fb0a9ec7252414d4d1b2a592b021d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84fb4234fe7741eaa49a48260c95c273/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "More than 1.3 million chickens are being slaughtered on an Ohio egg farm as the bird flu continues to take a toll on the industry.",
      "publishedAt": "2023-11-24T17:55:54Z",
      "title": "Bird flu still taking toll on industry as 1.35 million chickens are being killed on an Ohio egg farm",
      "url": "https://apnews.com/d873383dd0927f8ebbdd850a6eebb9a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ab4eab8f7a84a8b9cff6d2dfc9b0544/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Distraught by a romantic breakup, 16-year-old Kenny Batson vented his hurt by stomping out the windshields of cars on a for-sale lot. He landed in juvenile detention, but that was only the beginning of his trouble.",
      "publishedAt": "2023-11-24T05:02:09Z",
      "title": "Missouri governor granting pardons at pace not seen since WWII era",
      "url": "https://apnews.com/dc788c33d850956460a567554b1a8104",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a64beff7a83e421dbdf7891290130d70/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "When Daniel Skousen scrubs at the ash and soot covering his Maui home, he worries about the smell.",
      "publishedAt": "2023-11-24T05:04:47Z",
      "title": "Maui residents wonder if their burned town can be made safe. The answer? No one knows",
      "url": "https://apnews.com/20caacae75766e700d10c6fa3da9de1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97f2a52330c346b480410da3af546157/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}