{
  "articles": [
    {
      "author": null,
      "description": "The leaders of four European countries have arrived in Kyiv as calls intensify for Russia to agree to a monthlong cease-fire in the war. The leaders of France, Germany, Poland and the United Kingdom arrived together Saturday at the train station in Kyiv, where they are expected to meet Ukrainian President Volodymyr Zelenskyy. The visit marked the first time the leaders of the four countries have travelled together to Ukraine. Friedrich Merz is making a first visit to Ukraine as Germany’s new Chancellor. Along with President Donald Trump, the European leaders are pushing for Russia to agree to a 30-day ceasefire to allow for peace talks on ending the conflict.",
      "publishedAt": "2025-05-10T06:55:52Z",
      "title": "European leaders arrive in Kyiv amid push for 30-day ceasefire",
      "url": "https://apnews.com/article/russia-ukraine-war-fbd6aa9ddb147fa1b789c30dcf44dab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/d76327f/2147483647/strip/true/crop/3692x2077+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fa2%2F170fcd5dd54fb8e9e533fa9452de%2F5fca82ef6f8d42f9986fbcc4d88b839c"
    },
    {
      "author": "Illia Novikov",
      "description": "Two months ago, Ukrainian President Volodymyr Zelenskyy announced that Ukraine was ready to accept a U.S. proposal for a 30-day cease-fire, provided Russia did the same. The Russian leader balked, saying a temporary break in hostilities would only benefit Ukraine and its Western allies. Since then, Russia has continued its military campaign, maintaining attacks along the roughly 1,000-mile front line and targeting civilian infrastructure. In some cases, it has stepped up its attacks on residential areas with no obvious military targets. An Associated Press tally based on reports from Ukrainian authorities found at least 117 civilians have been killed and more than 1,000 wounded in Russian aerial attacks since March 11.",
      "publishedAt": "2025-05-10T08:38:34Z",
      "title": "Long-range Russian attacks continue to kill Ukrainians amid ceasefire deadlock",
      "url": "https://apnews.com/article/russia-ukraine-war-attacks-casualties-b9861d69b36a07d4108313df667e45dd",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c982bf/2147483647/strip/true/crop/2500x1406+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F69%2F57ff8ce21dad0525df0f51f0fc8f%2F15e94b3c3d1d41cea565278ef767b615"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistan’s army spokesman says India has fired missiles at three air bases inside the country, but most of the missiles have been intercepted. Lt. Gen. Ahmad Sharif said the assets of the Pakistan Air Force are safe. He made this announcement during his televised address, saying some of the Indian missiles have also hit India’s eastern Punjab.",
      "publishedAt": "2025-05-09T23:03:19Z",
      "title": "Pakistan's army spokesman says India has fired missiles at 3 Pakistani air bases",
      "url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2a69bd/2147483647/strip/true/crop/7203x4052+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F5b%2Ff167ac4b2dd36820616fff87a055%2Ff2f652c417164790a65310dc0aed29c6"
    },
    {
      "author": "Paul Wiseman, Didi Tang, Jamey Keaten",
      "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the global economy. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng. Prospects for a major breakthrough appear dim. But there is hope that the two countries will scale back the massive taxes – tariffs – they’ve slapped on each other’s goods, a move that would relieve world financial markets and companies on both sides of the Pacific Ocean that depend on U.S.-China trade.",
      "publishedAt": "2025-05-10T04:15:16Z",
      "title": "US and Chinese officials meet in Geneva to discuss tariffs as the world looks for signs of hope",
      "url": "https://apnews.com/article/china-trump-trade-tariffs-bessent-economy-71a6e410a0e5771c70ac853563a8b75d",
      "urlToImage": "https://dims.apnews.com/dims4/default/18e45de/2147483647/strip/true/crop/7440x4185+0+388/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd3%2F6d65f5826aba92fe309c8898314f%2F39f00ddbfa87492488a621511b32c1d3"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has laid out the vision of his papacy, identifying artificial intelligence as one of the most critical matters facing humanity. In his first formal audience Saturday, Leo made clear he will follow in the modernizing reforms of Pope Francis to make the Catholic Church inclusive, attentive to the faithful and a church that looks out for the “least and rejected.” Citing Francis repeatedly, he told the cardinals who elected him that he was fully committed to the reforms of the Second Vatican Council, the 1960s meetings that modernized the church. He said artificial intelligence poses challenges to defending human dignity, justice and labor.",
      "publishedAt": "2025-05-10T11:41:31Z",
      "title": "Pope Leo XIV lays out his vision of papacy, identifies AI as a main challenge for humanity",
      "url": "https://apnews.com/article/pope-leo-vision-papacy-artificial-intelligence-36d29e37a11620b594b9b7c0574cc358",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jack Brook, Deepa Bharath",
      "description": "The election of Pope Leo XIV, who is the first U.S. pope and has Creole roots, is raising more awareness about the complexity of the Creole identity. The pope has not openly spoken about his racial identity, but historical records highlight a story of migration common to African American families leaving the racism of the Jim Crow South. Black and Creole Catholics in the U.S. say that a pope who holds these multiple identities is just what the Catholic Church needs to unify the global church and elevate the profile of Black Catholics, whose history and contributions, they say, have been overlooked.",
      "publishedAt": "2025-05-10T04:03:37Z",
      "title": "Pope Leo XIV has Creole roots in New Orleans, historian says",
      "url": "https://apnews.com/article/pope-leo-creole-roots-new-orleans-black-b5794961d9582941413fe3154b30cc87",
      "urlToImage": "https://dims.apnews.com/dims4/default/008bfdc/2147483647/strip/true/crop/1418x798+0+74/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2Fc2%2F26ae7c6e26e434796e4436bc17c8%2Fe5c6e4c84c6c4b00bf08595dbe7e51d8"
    },
    {
      "author": "Geoff Mulvihill, Linley Sanders",
      "description": "A new AP-NORC poll finds that most U.S. adults agree with President Donald Trump that whether a person is a man or woman is determined by their sex at birth. About half of Americans approve of how Trump has handled transgender issues, according to the survey — a relative high point for a president whose overall job approval is about 4 in 10. The poll also finds nuance in answers. Most oppose using federal insurance programs to pay for gender-affirming care for transgender young people, but more support allowing transgender military service members than oppose it. Democrats especially are divided in their views on transgender-related policies.",
      "publishedAt": "2025-05-10T11:33:29Z",
      "title": "Trump has broad support for some transgender policies, poll finds",
      "url": "https://apnews.com/article/transgender-poll-care-bathrooms-military-trump-b5c9521d3d486e87c8631a99a455df2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/537b1b2/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F58%2F378ed7c9592a9c46642420eb6c41%2F0a0bf819ff474f90af8827fa9724c0bb"
    },
    {
      "author": "Luis Andres Henao",
      "description": "A group of Quakers are marching more than 300 miles from New York City to Washington, D.C. to demonstrate against the Trump administration’s crackdown on immigrants. The march extends a long tradition of Quaker activism to end wars and slavery and support women’s voting rights in line with the faith’s core belief. It's called the “Inner Light” – a direct link to God guiding them to fight for justice and peace. Five Quaker congregations filed a lawsuit earlier this year challenging a Trump administration move giving immigration agents more leeway to make arrests at houses of worship.",
      "publishedAt": "2025-05-10T11:34:48Z",
      "title": "Quakers march against Trump’s crackdown on immigrants carrying on their long faith tradition",
      "url": "https://apnews.com/article/quakers-protest-march-trump-immigration-crackdown-af1ae4a3a608e59f97c96c8b7cf660a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/8abf347/2147483647/strip/true/crop/6291x3539+0+328/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fbd%2Fdba06caaded573ac656f33b0eda7%2F86da3a7371b24f988aa3cab5f52962be"
    },
    {
      "author": "Marcia Dunn",
      "description": "A Soviet-era spacecraft has plunged to Earth, more than a half-century after its failed launch to Venus. The half-ton spacecraft fell out of orbit on Saturday. The European Union Space Surveillance and Tracking confirmed its uncontrolled entry. It was not immediately known where it came down or how much, if any, of the Kosmos 482 spacecraft survived the fiery descent through the atmosphere. Experts said ahead of time that some if not all of it might come crashing down, given it was built to withstand a landing on Venus. The chances of anyone being clobbered by the spacecraft debris were exceedingly low.",
      "publishedAt": "2025-05-10T10:52:50Z",
      "title": "Soviet-era spacecraft plunges to Earth after 53 years stuck in orbit",
      "url": "https://apnews.com/article/soviet-venus-spacecraft-kosmos-482-93871c98ca9c09a67219e238ed3e2eaa",
      "urlToImage": "https://dims.apnews.com/dims4/default/533ca8e/2147483647/strip/true/crop/927x521+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F51%2Fd4f8545e2d77e2d0e44b0fdadc98%2Ffcf205560e7c464cae17edf1341708ae"
    },
    {
      "author": "Mike Schneider",
      "description": "Southern accents are disappearing in some parts of the U.S. South due to the migration of people into the region from other parts of the United States and around the world. A series of research papers released late last year chronicles the diminishment of the Southern accent among Black residents of the Atlanta area, white working-class people in the New Orleans area and people who grew up in Raleigh, North Carolina. More than 5.8 million people have moved to the South in the 2020s. That's four times the combined amount of the three other regions. But one study author notes the Southern accent is unlikely to disappear completely.",
      "publishedAt": "2025-05-10T04:07:44Z",
      "title": "People moving into the South change the famous US dialect",
      "url": "https://apnews.com/article/migration-southern-accent-georgia-louisiana-north-carolina-1f8bfc59f869ccccaed6a87cdaa83ee8",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbdf801/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F1f%2F7c0dfe806e7682a0e0ff422d5664%2F3b34fb9223ea4d138c137fdbfad57dff"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}