{
  "articles": [
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The United Nations' top court ordered Israel on Friday to immediately halt its military offensive in the southern Gaza city of Rafah, but stopped short of ordering a cease-fire for the enclave.",
      "publishedAt": "2024-05-24T07:46:21Z",
      "title": "Top UN court orders Israel to halt military offensive in Rafah, though Israel is unlikely to comply",
      "url": "https://apnews.com/01d093d21a1eadaa31af5708cf1cbf38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7128b65cd1794bce8a9744fc31b142e3/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, LEE KEATH and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Egypt said Friday it has agreed to send U.N. humanitarian aid trucks through Israel’s main crossing into Gaza, but it remained unclear if they will be able to enter the territory as fighting raged in the southern city of Rafah amid Israel’s escalating offensive there.",
      "publishedAt": "2024-05-24T07:58:40Z",
      "title": "Egypt agrees to send aid trucks through Israeli crossing to Gaza but impact is unclear",
      "url": "https://apnews.com/16eb31044551df186a934dc66e3948aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f12b38ae40674d15afbda2be7e76d535/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump isn’t known for letting slights pass.Yet for weeks, the famously combative presumptive Republican nominee has sat silently — to the point of sometimes seeming asleep — in a sterile Manhattan courtroom amid a barrage of accusations and insults.",
      "publishedAt": "2024-05-24T04:07:17Z",
      "title": "Trump swaps bluster for silence, and possibly sleep, in his hush money trial",
      "url": "https://apnews.com/25ebe6e0d4c3a0aac938ef55ffd681a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224129f3612d4d6e9e363ec801508238/2000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — As he tries to secure his legacy, President Joe Biden has unleashed a flurry of election year rules on the environment and other topics, including a landmark regulation that would force coal-fired power plants to capture smokestack emissions or shut down.",
      "publishedAt": "2024-05-24T04:04:24Z",
      "title": "As the election nears, Biden pushes a slew of rules on the environment and other priorities",
      "url": "https://apnews.com/fec31a2f2198b776c5f24d2d9f66684b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99175255d60d440e9c6d89d5c565d852/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER and LINDSAY WHITEHURST",
      "description": "WILMINGTON, Del. (AP) — The judge overseeing Hunter Biden ’s federal firearms charges trial agreed Friday to block prosecutors from telling jurors about some other unflattering episodes from his personal life, but left the door open to allowing them in if the president’s son testifies.",
      "publishedAt": "2024-05-24T04:03:21Z",
      "title": "Hunter Biden's impending gun trial could last up to 2 weeks amid sharp disagreements over evidence",
      "url": "https://apnews.com/61ae47f6c9296f02d1462d82b1a47897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c07ae00547094aadbd5b59707c35df37/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin will undergo a medical procedure at Walter Reed National Military Medical Center Friday evening and will transfer power temporarily to his deputy, Pentagon press secretary Maj.",
      "publishedAt": "2024-05-24T19:38:05Z",
      "title": "Defense Secretary Lloyd Austin to undergo procedure at Walter Reed, will transfer power to deputy",
      "url": "https://apnews.com/a663c731fba31574e402382cf944f5e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37b7d12f156f4138a2dc7255ea4f93c8/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A U.S. missionary couple and a Haitian man who worked with them were shot and killed by gang members in Haiti’s capital after they were attacked while leaving a youth group activity held at a local church, a family member said Friday.",
      "publishedAt": "2024-05-24T16:25:55Z",
      "title": "Young missionary couple from US among 3 killed by gunmen in Haiti's capital, family says",
      "url": "https://apnews.com/a65a4515e0d8610d9acd006d24821efd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de1e7e0ed39942b9ad403268b9157f4f/1920.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — More than 100 people are believed to have been killed in a landslide Friday that buried a village in a remote, mountainous part of Papua New Guinea, and an emergency response is underway, officials in the South Pacific island nation said.",
      "publishedAt": "2024-05-24T04:08:19Z",
      "title": "Over 100 feared dead in landslide in remote part of Papua New Guinea, with rescue efforts underway",
      "url": "https://apnews.com/86fcf41e600122fd54ddcfb56bcab403",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6668c2dfe83146db8d171bba439d3de5/3000.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — Several tornadoes were reported in Iowa and Illinois as storms downed power lines and trees on Friday, just days after a deadly twister devastated one small town.",
      "publishedAt": "2024-05-24T05:00:25Z",
      "title": "More severe weather moves through Midwest as Iowa residents clean up tornado damage",
      "url": "https://apnews.com/3d67033f4275a0db321c9c39673931c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4e9b25f4818448e909bbf2ffbdb9f11/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Caleb Carr, the scarred and gifted son of founding Beat Lucien Carr who endured a traumatizing childhood and became a bestselling novelist, accomplished military historian and late-life memoirist of his devoted cat, Masha, has died at 68.",
      "publishedAt": "2024-05-24T18:45:00Z",
      "title": "Caleb Carr, military historian and author of bestselling novel 'The Alienist,' dies at 68",
      "url": "https://apnews.com/0bedbb491d1fb3ecfd879d86a8341a32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b7a85e29174160b4e0440bf935b698/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}