{
  "articles": [
    {
      "author": "MATTHEW LEE, AAMER MADHANI, JILL COLVIN",
      "description": "Job-seekers hoping to join the new Trump administration are facing a series of intense loyalty tests. And White House screening teams are fanning out to government agencies and carefully going through applicants’ politics and social media posts. President Donald Trump believed the biggest mistake he made during his first term was hiring what he considered to be the wrong kinds of people. Now, aides are working to ensure the government is filled only with loyalists. Negative social media posts have been enough to derail applications. Job-seekers have been told they'll have to prove their “enthusiasm” to implement Trump’s agenda and they've been asked when their moment of “MAGA revelation” occurred.",
      "publishedAt": "2025-01-25T17:43:44Z",
      "title": "Inside the Trump White House's intense screening of job-seekers",
      "url": "https://apnews.com/article/trump-loyalty-white-house-maga-vetting-jobs-768fa5cbcf175652655c86203222f47c",
      "urlToImage": "https://dims.apnews.com/dims4/default/183dc33/2147483647/strip/true/crop/5687x3199+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F83%2Feb4f50ae38360ce2f1ff3562c807%2F61c9a351627548f391f650d6fbdfb0fd"
    },
    {
      "author": "ZEKE MILLER, ERIC TUCKER, WILL WEISSERT",
      "description": "President Donald Trump has confirmed that inspectors general in various agencies have been fired. About 17 of the independent inspectors were let go. The action removes oversight in many parts of his new administration, and some members of Congress are suggesting the dismissals violate federal oversight laws. The dismissals began Friday night and were effective immediately. That's according to two people familiar with the actions who spoke on condition of anonymity to provide details that haven't been made public. Congress was not given the legally required 30-day notices about the removals. Trump told reporters aboard Air Force One that he will replace the fired inspectors with “good people.\"",
      "publishedAt": "2025-01-25T16:32:45Z",
      "title": "Trump fires more than a dozen independent inspectors general",
      "url": "https://apnews.com/article/trump-inspectors-general-fired-congress-unlawful-4e8bc57e132c3f9a7f1c2a3754359993",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a82e2d/2147483647/strip/true/crop/3260x1834+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F3a%2F45156d9923f0a909da3442cb6f56%2F0d0db091ad5549a9b5e51b660f63643b"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump plans to use a stop in Las Vegas to offer details on how he can begin excluding tips from federal taxes. He's betting that a city built on gambling and the hospitality industry will relish taking home larger slices of gratuities. Trump is vowing to make good on a campaign promise and he'll give a speech Saturday at the Circa Resort & Casino. That word comes from the Culinary Union, which represents about 60,000 hospitality workers across Nevada. The union supports eliminating taxes on tips, but says Trump’s proposals don’t go far enough.",
      "publishedAt": "2025-01-25T14:21:38Z",
      "title": "Trump's stop in Las Vegas will focus on how he wants to eliminate taxes on tips",
      "url": "https://apnews.com/article/trump-las-vegas-taxes-tips-hospitality-workers-92da0193df89d1773b8f7dcc84ea7e3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2df9607/2147483647/strip/true/crop/4760x2678+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F81%2Ff9571c4743b88084debd5b83f66e%2Ff3e3ba40930e4a5b81a74163032bd2a7"
    },
    {
      "author": "TARA COPP",
      "description": "The U.S. Air Force has removed training courses for service members that included historical videos of its storied Black Tuskegee Airmen and Women Airforce Service Pilots, or WASPs — female World War II pilots. The step was to comply with the Trump administration’s DEI ban. The videos were shown to new enlisted troops as part of the diversity courses they took in basic training. The problem may not be with the videos themselves, but that they were used in DEI coursework. The lack of clearer guidance has led the Air Force and other agencies to take a broad approach to content they are removing from training.",
      "publishedAt": "2025-01-25T19:57:40Z",
      "title": "DEI ban: Air Force removes course videos of Tuskegee Airmen, female pilots",
      "url": "https://apnews.com/article/air-force-dei-tuskegee-women-wwii-pilots-ecdeac68dc7696535d093c7690ab73bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/de28efe/2147483647/strip/true/crop/4256x2394+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2Fd8%2Fc950ff2e091889fa3c29cc2e31a4%2F80370711b8e9490b86a597783e7f8f16"
    },
    {
      "author": "THOMAS BEAUMONT, MEG KINNARD",
      "description": "Allies of President Donald Trump have been quick to threaten primary challengers for Republican senators who don’t back Trump's Cabinet picks and legislative priorities. Five senators in particular have drawn early attention. They are Joni Ernst of Iowa, Thom Tillis of North Carolina, Bill Cassidy of Louisiana, John Cornyn of Texas, and Lindsey Graham of South Carolina. But all bring their own strengths and a history of winning in their states.",
      "publishedAt": "2025-01-25T14:58:13Z",
      "title": "How key Republican senators are responding to Trump allies' primary threats",
      "url": "https://apnews.com/article/ernst-tillis-cassidy-cornyn-graham-musk-9a70ea4d8f1f75d5f3f62689da430b50",
      "urlToImage": "https://dims.apnews.com/dims4/default/108e255/2147483647/strip/true/crop/5417x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F35%2Fd232875bf7a7bcc6f5be2e3bf221%2F900f5e3b24954503805b589c0aa47a26"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate has confirmed Kristi Noem as homeland security secretary, putting the South Dakota governor in charge of a sprawling agency that is essential to national security and President Donald Trump’s plans to clamp down on illegal immigration. Republicans kept the Senate working Saturday to install the latest member of Trump’s national security team. Defense Secretary Pete Hegseth was confirmed Friday night, joining Secretary of State Marco Rubio and CIA Director John Ratcliffe. Noem was sworn in by Supreme Court Justice Clarence Thomas at his home.",
      "publishedAt": "2025-01-25T05:07:11Z",
      "title": "Senate confirms Kristi Noem as homeland security secretary",
      "url": "https://apnews.com/article/kristi-noem-border-trump-44925ad8670cd4ad57427513915bb140",
      "urlToImage": "https://dims.apnews.com/dims4/default/194c1b3/2147483647/strip/true/crop/5921x3331+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fa6%2F182a753a42455a13bb68a15a1a07%2F7069a409e2db44c29709d97eb45919d6"
    },
    {
      "author": "ELLIOT SPAGAT, GREGORY BULL, EUGENE GARCIA",
      "description": "President Donald Trump has declared a national emergency on the border with Mexico, saying “America’s sovereignty is under attack.” Active-duty military arrived Thursday in San Diego and El Paso, Texas. It comes at a moment of relative calm after unprecedented turmoil. Arrests for illegal border crossings plummeted more than 80% to about 47,000 in December. That was down from an all-time high of 250,000 the same period a year earlier. Arrests fell by about half when Mexican authorities increased enforcement within their own borders a year ago. And they plummeted by about half again when former President Joe Biden introduced severe asylum restrictions.",
      "publishedAt": "2025-01-25T05:05:32Z",
      "title": "On a San Diego ride-along with Border Patrol, this is what AP saw",
      "url": "https://apnews.com/article/border-patrol-emergency-asylum-trump-3479a25c4989a437c8c934b84dcf2705",
      "urlToImage": "https://dims.apnews.com/dims4/default/a25374c/2147483647/strip/true/crop/5452x3067+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F1b%2Fe1f671d6f8b245f2bdda84189a8c%2F059f312870564f3594b50d65f99d95e7"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "North Korea says it tested a cruise missile system, its third known weapons display this year, and vowed “the toughest” response to what it called the escalation of U.S.-South Korean military drills that target the North. The moves suggested North Korea will likely maintain its confrontational stance against the U.S. for now, even though President Donald Trump said he intends to reach out to North Korea. The official Korean Central News Agency said that leader Kim Jong Un observed the test of sea-to-surface strategic cruise guided weapons on Saturday. North Korea's Foreign Ministry separately vowed “the toughest counteraction” over recent U.S.-South Korean military drills.",
      "publishedAt": "2025-01-26T01:29:20Z",
      "title": "North Korea says it tested cruise missile system and vows 'toughest' response to US",
      "url": "https://apnews.com/article/north-korea-missile-trump-kim-3b2178272613b8e623c5dcdb6834ae6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/27fbdba/2147483647/strip/true/crop/5808x3267+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F84%2F032d595518231871d4bc1f1d1bbe%2F241013348f404ed8a5ea769187824e83"
    },
    {
      "author": null,
      "description": "The U.S. and Canadian Coast Guards are continuing efforts to break up ice and free a freighter that has been trapped in a frozen Lake Erie for days, officials said. The Manitoulin, a 663-foot Canadian vessel with 17 people on board, got stuck in the ice on Lake Erie on Wednesday after it dropped off a load of wheat in Buffalo, New York, and was heading back to Canada, the U.S. Coast Guard said. The ship wasn’t damaged, and its crew is safe. A U.S. Coast Guard icebreaking ship has been working since Thursday to help the Manitoulin, and on Saturday officials said a second ship arrived to help free the freighter.",
      "publishedAt": "2025-01-25T19:25:22Z",
      "title": "Freighter remains stuck in the ice on a frozen Lake Erie",
      "url": "https://apnews.com/article/lake-frozen-ship-ice-stuck-28ab1fd3872daa37612a9a09f20dff93",
      "urlToImage": "https://dims.apnews.com/dims4/default/c43d34f/2147483647/strip/true/crop/2000x1125+0+105/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Fac%2Fa1debd3738dd11f6c2bf5b9106cc%2F148be5215b8e4c91ad273548864bcdbf"
    },
    {
      "author": "ZEKE MILLER, WILL WEISSERT",
      "description": "President Donald Trump says he’d like to see Arab nations increase the number of Palestinian refugees they are accepting from the Gaza Strip — potentially moving out enough of the population to “clean out” the area to create a virtual clean slate. He told reporters aboard Air Force One on Saturday that he'd discussed his vision on a call with King Abdullah II of Jordan and would speak Sunday with Egypt's president. Trump also said he’s ended his predecessor’s hold on sending 2,000-pound bombs to Israel. That lifts a pressure point meant to reduce civilian casualties during Israel's war with Hamas in Gaza that is now halted by a tenuous ceasefire.",
      "publishedAt": "2025-01-26T00:59:48Z",
      "title": "Trump wants Jordan, Egypt to accept more Palestinian refugees, floats plan to 'just clean out' Gaza",
      "url": "https://apnews.com/article/trump-biden-israel-bomb-gaza-hamas-war-023b36984c6116c128b5e47f117bba2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d566c03/2147483647/strip/true/crop/2336x1314+0+122/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F72%2Fad4536f39f5c690997435d9cd038%2Fa8f189a0753e43048107651fcc849c7d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}