{
  "articles": [
    {
      "author": "SEUNG MIN KIM, COLLEEN LONG and ELLIOT SPAGAT",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday unveiled plans to enact immediate significant restrictions on migrants seeking asylum at the U.S.-Mexico border as the White House tries to neutralize immigration as a political liability ahead of the November elections.",
      "publishedAt": "2024-06-04T16:01:28Z",
      "title": "Biden rolls out migration order that aims to shut down asylum requests, after months of anticipation",
      "url": "https://apnews.com/dec5f83b468b5795479bf1f5e49799d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cfdeff5ccf94ea7bde88fb808842608/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA, SHEIKH SAALIQ and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India’s Prime Minister Narendra Modi, who claimed victory for his alliance in an election seen as a referendum on his decade in power, is a popular but polarizing leader who has presided over a fast-growing economy while advancing Hindu nationalism.",
      "publishedAt": "2024-06-04T16:35:11Z",
      "title": "India's popular but polarizing leader Narendra Modi is extending his decade in power. Who is he?",
      "url": "https://apnews.com/c3a4102d70c5c72e98b26874e1733279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/435427e771b842d38bac7e0e88167583/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE, CLAUDIA LAUER COLLEEN LONG and MICHAEL KUNZELMAN",
      "description": "WILMINGTON, Del. (AP) — Federal prosecutors on Tuesday painted President Joe Biden’s son Hunter as deceptive and driven by addiction, a man whose dark habits ensnared loved ones and who knew what he was doing when he lied on federal forms to purchase a gun in 2018.",
      "publishedAt": "2024-06-04T04:10:54Z",
      "title": "Prosecutors play audio of Hunter Biden reading his memoir to set scene at his federal gun trial",
      "url": "https://apnews.com/477c0ca9d07afc1a52bd90ef6d2167cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5546eaa7493f4ad49dda4e612123fc4e/1920.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Wisconsin Attorney General Josh Kaul filed felony forgery charges Tuesday against two attorneys and an aide who helped submit paperwork falsely saying that former President Donald Trump had won the battleground state in 2020.",
      "publishedAt": "2024-06-04T14:42:43Z",
      "title": "Wisconsin attorney general files felony charges against attorneys, aide who worked for Trump in 2020",
      "url": "https://apnews.com/77d00919fc8d8e07438076610090a9b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68212f68f71148fc9a6540c1a0d0f8bd/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Attorney General Merrick Garland rebuked Republicans for what he described as unprecedented attacks on the Justice Department Tuesday, telling lawmakers who have sought to hold him in contempt that he will “not be intimidated.”",
      "publishedAt": "2024-06-04T14:02:48Z",
      "title": "Garland slams attacks on the Justice Department, telling lawmakers: 'I will not be intimidated'",
      "url": "https://apnews.com/02ed2ff53f75e3ed9bc955f9f15d87bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aec65d9ee33b400db8ea94b7282bc229/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A spokesman for Gaza’s civil defense said Tuesday that first responders have recovered the bodies of 360 people, mostly women and children, killed in the northern refugee camp of Jabaliya during a recent three-week Israeli offensive there.",
      "publishedAt": "2024-06-04T08:20:50Z",
      "title": "The Latest | Palestinians recover 360 bodies in north Gaza killed in Israeli offensive",
      "url": "https://apnews.com/e7d4ee5898fe223e224a9e0fc059a452",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/478409adaeb845d784dbd19fad49d69f/1920.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico’s newly elected president, the first woman to win the job, faces a long list of challenges, including persistent cartel violence, a deeply divided country, cash-straitened social programs and the long shadow of her mentor, outgoing President Andrés Manuel López Obrador.",
      "publishedAt": "2024-06-04T04:08:06Z",
      "title": "Mexico’s next president faces 3 pressing challenges: money, dialogue and the US election",
      "url": "https://apnews.com/8516bc1d399096367827c511132fedb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfca3d3ae6b44002900f9953ce83df98/1920.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BEERSEL, Belgium (AP) — The far-right Flemish Interest party had set up the demonstration in the picture-pretty rolling fields south of Brussels, ahead of the four-day European Union election starting Thursday.",
      "publishedAt": "2024-06-04T04:09:12Z",
      "title": "Tractors rumble in streets again ahead of EU polls. Farming is a big issue and the far right pounces",
      "url": "https://apnews.com/08e805b47b8a1f8ba9117cc17ba7b428",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79ccb167b5034a1cb23fb5e7d76e971d/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Many Americans still aren’t sold on going electric for their next car purchase. High prices and a lack of easy-to-find charging stations are major sticking points, a new poll shows.",
      "publishedAt": "2024-06-04T04:03:05Z",
      "title": "Many Americans are still shying away from EVs despite Biden's push, an AP-NORC/EPIC poll finds",
      "url": "https://apnews.com/e0ba37aa081c0d3f1d824b07364d0bdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dd15610f6e9437d88fa2dc18e716cd8/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET and DANICA KIRKA",
      "description": "COLLEVILLE-SUR-MER, France (AP) — World War II veterans from the United States, Britain and Canada are in Normandy this week to mark 80 years since the D-Day landings that helped lead to Hitler’s defeat.",
      "publishedAt": "2024-06-04T08:20:24Z",
      "title": "Centenarian veterans are sharing their memories of D-Day, 80 years later",
      "url": "https://apnews.com/796b6ca453660a32e7925c1191205b81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58e792a387b14621b4fb9009c5f86700/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}