{
  "articles": [
    {
      "author": null,
      "description": "The Pentagon’s top leaders have doubled down on how destructive the U.S. attacks had been on Iran's nuclear facilities. And they described in detail the study and planning behind the bombing mission. In a rare Pentagon press briefing, Defense Secretary Pete Hegseth and Joint Chiefs Chairman Gen. Dan Caine tried to shift the debate from whether the nuclear targets were “obliterated,” as President Donald Trump has said, and focus on what they portrayed as the heroism and extensive research and preparation that went into carrying them out. Hegseth said once more than an early assessment from the Defense Intelligence Agency was preliminary.",
      "publishedAt": "2025-06-26T13:42:25Z",
      "title": "Pentagon leaders double down on the destruction from US attacks on Iran",
      "url": "https://apnews.com/article/iran-us-strikes-nuclear-trump-hegseth-caine-78499bef6b34ebb970b5c9d074021044",
      "urlToImage": "https://dims.apnews.com/dims4/default/50a935e/2147483647/strip/true/crop/5392x3033+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F46%2F00365cd36e09a2fb508515d94599%2F14aa82b4d8ba42059876572c00990f26"
    },
    {
      "author": null,
      "description": "Iran’s Supreme Leader Ali Khamenei claimed victory over Israel on Thursday in his first public statement since a ceasefire was declared in the war between the two countries. Khamenei hasn't been seen in public since taking shelter in a secret location after the outbreak of the war June 13 when Israel attacked Iranian nuclear facilities and targeted top military commanders and scientists. In his first comment posted on X he offered his “congratulations on the victory” over Israel.",
      "publishedAt": "2025-06-26T10:25:35Z",
      "title": "Iran’s Supreme Leader makes first public statement since ceasefire declared in Israel-Iran war",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-26-2025-d09bf2282deea3b2edd63f29c867c058",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Top Trump administration officials came to Capitol Hill to brief lawmakers about President Donald Trump’s decision to bomb three Iranian nuclear sites. CIA Director John Ratcliffe, Secretary of State Marco Rubio, Defense Secretary Pete Hegseth and Joint Chiefs of Staff Chairman Dan Kaine are expected to give the classified briefing to senators on Thursday. It comes as questions swirl in Congress about the effectiveness of the attack and what’s ahead for America’s military involvement in the Middle East. Also, senators are weighing their support for a resolution affirming that Trump should seek authorization from Congress before launching more military action against Iran.",
      "publishedAt": "2025-06-26T04:04:05Z",
      "title": "Trump officials brief Congress on the Iran strikes",
      "url": "https://apnews.com/article/senate-intelligence-briefing-iran-bombs-trump-gabbard-bccfbfe5c52b39eacdf02a0a8323847f",
      "urlToImage": "https://dims.apnews.com/dims4/default/869504f/2147483647/strip/true/crop/5392x3033+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F17%2F58b9b5e88ca0e6e221807d07db05%2Fab1aead2b29b4fc2bedf2d23999af984"
    },
    {
      "author": null,
      "description": "Federal prosecutors have told a judge in Maryland the government plans to initiate deportation proceedings against Kilmar Abrego Garcia and to deport him to a country that is not his native El Salvador upon his release from a Tennessee jail. But the prosecutors Thursday also said that they would comply with all court orders and that their plans are not imminent. Attorneys for Abrego Garcia earlier asked the federal judge to order his return to Maryland when he is released from jail in Tennessee, an arrangement that would prevent likely attempts by immigration officials to quickly deport Abrego Garcia.",
      "publishedAt": "2025-06-26T17:36:06Z",
      "title": "Abrego Garcia's lawyers ask for him to go to Maryland to prevent deportation",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-maryland-tennessee-charges-deportation-c96844906793b35a80f9bbb4afa07e94",
      "urlToImage": "https://dims.apnews.com/dims4/default/1aa78ce/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F79%2F8fa7b9d7e8cd7f9955b65943098b%2F6eec930538d44fc78ef6fcfd51b346b2"
    },
    {
      "author": null,
      "description": "The Supreme Court is letting South Carolina block Medicaid funding for Planned Parenthood. For abortion opponents, it's a victory for the idea that states with more restrictive abortion laws shouldn't have to support groups that provide services policymakers disagree with. Abortion rights supporters frame the ruling as a blow to health care access. The ruling comes as the U.S. Senate is considering a national ban on federal funds for Planned Parenthood. Federal policy already blocks paying for most abortions. The restrictions in question would bar public funding for other services offered by Planned Parenthood.",
      "publishedAt": "2025-06-26T19:45:52Z",
      "title": "Supreme Court lets states block Medicaid funding for Planned Parenthood",
      "url": "https://apnews.com/article/abortion-planned-parenthood-medicaid-80c56455e6313385c57d82fe522779b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/c528887/2147483647/strip/true/crop/6576x3699+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Fc8%2F0c39878340a1b387b5a39aae09df%2Fc4e85d30a58d40719eac37e09ae050eb"
    },
    {
      "author": null,
      "description": "U.S. Health Secretary Robert F. Kennedy Jr.’s new vaccine advisory committee endorsed fall flu vaccination Thursday for just about every American but with a twist: The group says people should only be given shots free of an ingredient antivaccine groups have falsely tied to autism. The seven-member panel, which includes vaccine skeptics, replaced the previous 17-member group earlier this month. Public health officials are worried that ideological decisions could make vaccines less accessible and more expensive for millions of Americans.",
      "publishedAt": "2025-06-26T12:09:29Z",
      "title": "Kennedy's vaccine committee endorses preservative-free fall flu shots",
      "url": "https://apnews.com/article/cdc-acip-flu-vaccine-thimerosal-c5696bbc19f345323153d5336cb5e798",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa7b2da/2147483647/strip/true/crop/3457x1945+0+222/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fe1%2F215bacb3e7fb12c818be95502ed3%2F32534925e3624f47b1183a55cba1571c"
    },
    {
      "author": null,
      "description": "The Senate parliamentarian has advised a key Medicaid provider tax overhaul that's central to President Donald Trump's big tax cut and spending bill does not adhere to procedural rules. It’s a blow to Republicans rushing to finish the package this week. The guidance from the parliamentarian is rarely ignored and forces GOP leaders to consider options. Republicans could try to revise it or strip it from the package. Otherwise, the provision could be challenged during floor votes. Democrats are unified against the Republican president's bill. And even GOP senators warn the tax change would hurt rural hospitals. Some Republicans call for challenging or even firing the parliamentarian, the nonpartisan chief arbiter of Senate rules.",
      "publishedAt": "2025-06-26T14:01:08Z",
      "title": "Key Medicaid provision in Trump's big bill found to violate Senate rules",
      "url": "https://apnews.com/article/trump-big-bill-hospital-provider-tax-f6f4343bbc9c9a279bd7861c2e5c1b7b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7c53cb5/2147483647/strip/true/crop/3362x1891+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4c%2F48804194d30d7134b1dcd5299dfc%2Fa260d48997914330b21a8b8ada8704b7"
    },
    {
      "author": null,
      "description": "A prosecutor has begun two days of closing arguments at Sean “Diddy” Combs' sex trafficking trial by telling a jury that the music mogul used “power, violence and fear” to rule a criminal enterprise for two decades. The closing on Thursday was delivered by Assistant U.S. Attorney Christy Slavik in Manhattan federal court. The defense will get its turn Friday. Afterward, another prosecutor will deliver a rebuttal closing argument before Judge Arun Subramanian instructs the jury on the law so it can begin deliberations. Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges. The trial is in its seventh week.",
      "publishedAt": "2025-06-26T14:39:59Z",
      "title": "Prosecutor casts Sean 'Diddy' Combs as a criminal who abused others through power, violence and fear",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-831c43678c42e4c84e13e42e9cd210ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "Bill Moyers, the former White House press secretary who became one of television’s most honored journalists, has died at 91. His career ranged from President Lyndon Johnson’s press secretary to newspaper publisher and senior news analyst at CBS News. But it was for public television that Moyers produced some of TV’s most intelligent and provocative programs. During hundreds of hours on PBS, he proved at home with subjects ranging from government corruption to modern dance, from drug addiction to media consolidation, from religion to environmental abuse. He called himself a “citizen journalist.”",
      "publishedAt": "2025-06-26T20:08:06Z",
      "title": "Bill Moyers dies at 91",
      "url": "https://apnews.com/article/bill-moyers-dead-eed7ecae0e20c2db4b82500996916dfe",
      "urlToImage": "https://dims.apnews.com/dims4/default/153e3f8/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F6a%2F31c04062e85f065065e38f8a8343%2F004d09dbadfa4d39b90560692cc33f05"
    },
    {
      "author": null,
      "description": "Wander Franco, the suspended Tampa Bay Rays shortstop, has been found guilty in a sexual abuse case involving a minor. On Thursday, a Dominican Republic court sentenced him to a two-year suspended sentence. Franco was accused of having a relationship with a 14-year-old girl and transferring money to her mother for consent. Prosecutors sought a five-year prison term for Franco and a 10-year sentence for the girl’s mother, who will serve her full term. Major League Baseball acknowledged the verdict and stated it would conclude its investigation later. Franco’s career remains on hold amid ongoing legal issues.",
      "publishedAt": "2025-06-26T21:25:28Z",
      "title": "Tampa Bay Rays’ shortstop Wander Franco found guilty in sex abuse case",
      "url": "https://apnews.com/article/wander-franco-dominican-republic-tampa-bay-rays-f1ffcb27549164cc39c3d4aa4f889161",
      "urlToImage": "https://dims.apnews.com/dims4/default/4755b89/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F3e%2F94f1ab99da384e3ce740b1cb3838%2Ffa9104b3e0b84b10a82228d035b89437"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}