{
  "articles": [
    {
      "author": "ABBY SEWELL and ALBERT AJI",
      "description": "JDEIDET YABOUS, Syria (AP) — Families fleeing the escalating conflict in Lebanon poured into Syria in growing numbers on Wednesday, waiting for hours in heavy traffic to reach the relative safety of another war-torn country.",
      "publishedAt": "2024-09-25T17:25:58Z",
      "title": "Thousands are pouring into Syria, fleeing worsening conflict in Lebanon",
      "url": "https://apnews.com/8a1fbde03c81fb3672e27d479f5b5a34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67a9e22c74164d378c6013ccaac7c4bd/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military is preparing for a possible ground operation in Lebanon, the Israeli army chief said Wednesday as Hezbollah launched dozens of rockets into Israel, including a longer-range projectile that set off air raid sirens in Tel Aviv and across central Israel.",
      "publishedAt": "2024-09-25T05:58:57Z",
      "title": "Israel-Hamas war latest: Israel threatens ground operation after long-range Hezbollah missile attack",
      "url": "https://apnews.com/1b76480b8f91d8fd536d7f639f95433b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfaf842d7f0d429babb0754c3fd4871c/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, MATTHEW LEE and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — France’s foreign minister said Wednesday that his country and the United States are working on a proposal for a 21-day cease-fire “to allow for negotiations” in the escalating conflict between Israel and Hezbollah that has killed more than 600 people in Lebanon in recent days.",
      "publishedAt": "2024-09-25T16:04:26Z",
      "title": "France and the US are working on a plan for a 21-day cease-fire between Israel and Hezbollah",
      "url": "https://apnews.com/ff2ec626f5d8883014f577b9a0cfaf1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f587e1b479ea47788deba433d0f2f162/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congress on Wednesday passed a temporary measure that keeps government agencies funded into December, avoiding a shutdown for now while punting final spending decisions until after the Nov.",
      "publishedAt": "2024-09-25T04:21:16Z",
      "title": "Congress passes temporary bill to avoid shutdown as lawmakers punt spending decisions to December",
      "url": "https://apnews.com/7917f589502c40d4815f1b9583d3fa23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7695ce0773f4cf4a07431f597cf2a63/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and STEPHEN SMITH",
      "description": "TALLAHASSEE, Fla. (AP) — An enormous Hurricane Helene swamped parts of Mexico on Wednesday as it churned on a path forecasters said would take it to Florida as a major storm with a surge that could swallow entire homes, a chilling warning that sent residents scrambling for higher ground, closed schools, and led to states of emergency throughout the Southeast.",
      "publishedAt": "2024-09-25T04:45:17Z",
      "title": "A huge Hurricane Helene is expected to hit Florida as a major storm and strike far inland",
      "url": "https://apnews.com/a953d0a51d219226f7d76178af2d3f4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17c648d0bd18408383d2deb8c3d2c871/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — The acting director of the Secret Service was incensed at what had happened that July evening. “What I saw made me ashamed,” Ronald Rowe Jr. said. “I cannot defend why that roof was not better secured.”",
      "publishedAt": "2024-09-25T12:16:40Z",
      "title": "A tale of crushing security lapses and missed chances to stop the man who shot Trump",
      "url": "https://apnews.com/1a6d957a9607b350c362b0a4e2a3e1b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ca3186190464c7b916eed89f5cede8f/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, STEVE PEOPLES and JOSH BOAK",
      "description": "PITTSBURGH (AP) — Vice President Kamala Harris on Wednesday pledged to build an economy that is both pro-business and helps the middle class as she pushed back against Republican nominee Donald Trump ’s claims that she’s advancing “communist” ideas.",
      "publishedAt": "2024-09-25T09:06:10Z",
      "title": "Harris is making a 'capitalist' pitch to boost the economy as Trump pushes deeper into populism",
      "url": "https://apnews.com/bda4bfe7cb02c1c5c2f6232bf05ad670",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3aac55cc6ce4236a842cc280078d97b/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, COLLEEN LONG and MICHAEL BALSAMO",
      "description": "PITTSBURGH (AP) — A U.S. Secret Service agent has been accused of groping and sexually harassing a member of Vice President Kamala Harris' official staff during a trip last week, according to three people familiar with the matter.",
      "publishedAt": "2024-09-25T20:15:42Z",
      "title": "The Secret Service is investigating a report that an agent groped a Harris staff member",
      "url": "https://apnews.com/963cd8142157c838e622a66d2c13f902",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7314acc6d4a84656af225090c267106b/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A Black high school student in Texas who was punished for nearly all of his junior year over his hairstyle has left his school district rather than spend another year of in-school suspension, according to his attorney.",
      "publishedAt": "2024-09-25T23:20:24Z",
      "title": "A Black student punished for his hairstyle wants to return to the Texas school he left",
      "url": "https://apnews.com/109872aeae0a299f3b96997308edda15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d9c94bf48b245509f36be7bd2aae795/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "VENICE, Italy (AP) — “ Joker ” is a hard act to follow. Todd Phillips’ dark, Scorsese-inspired character study about the Batman villain made over a billion dollars at the box office, won Joaquin Phoenix his first Oscar, dominated the cultural discourse for months and created a new movie landmark.",
      "publishedAt": "2024-09-25T13:22:02Z",
      "title": "C’mon get happy, Joker is back (this time with Lady Gaga)",
      "url": "https://apnews.com/e66d45aea04ef20a728e5a979eab17cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d4c98f6899b4c8693813343e8fe753b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}