{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israeli officials appeared increasingly concerned that the International Criminal Court may issue arrest warrants against the country’s leaders, as international pressure mounts over the war in Gaza.",
      "publishedAt": "2024-04-29T09:10:57Z",
      "title": "Israeli officials concerned about possible ICC arrest warrants as pressure mounts over war in Gaza",
      "url": "https://apnews.com/d9b215f4aa1a745cdada48112d0fe4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/533e6a052c754247bef070113a6b483d/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER, CAROLYN THOMPSON and MARGERY BECK",
      "description": "LOS ANGELES (AP) — Protests are roiling college campuses across the U.S. as upcoming graduation ceremonies are threatened by disruptive demonstrators, with students and others sparring over the war in Gaza and its mounting death toll.",
      "publishedAt": "2024-04-29T04:57:22Z",
      "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over the war in Gaza",
      "url": "https://apnews.com/19ed919ff6ff9573a8add4ec67e26181",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bcb323897a14437893b2a4f380489de/1920.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — College students taking up space and making demands for change. University administrators facing pressure to get things back under control. Police brought in to make arrests. At other schools: students taking note, and sometimes taking action.",
      "publishedAt": "2024-04-29T04:05:21Z",
      "title": "How Columbia University's complex history with the student protest movement echoes into today",
      "url": "https://apnews.com/505f9da3aef5ce7a9f7d6eb962dacb5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ce050936b594e83881ae7cdca0ab04c/2913.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "RIYADH, Saudi Arabia (AP) — U.S. Secretary of State Antony Blinken said Monday that Israel must still do more to increase the flow of humanitarian aid into the besieged Gaza Strip and that he would use his current Middle East trip — his seventh to the region since the Israel-Hamas war started in October — to press that case with Israeli leaders.",
      "publishedAt": "2024-04-29T04:02:50Z",
      "title": "Blinken says Israel must still do more to boost humanitarian aid to Gaza",
      "url": "https://apnews.com/c0425791dc59e745021d3dd726dc8f09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b19f3a3f83b46d1820d73a2ec542653/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "SULPHUR, Okla. (AP) — Small towns in Oklahoma began a long cleanup Monday after tornadoes flattened homes and buildings and killed four people, including an infant, widening a destructive outbreak of severe weather across the middle of the U.S.",
      "publishedAt": "2024-04-29T05:02:50Z",
      "title": "Oklahoma towns hard hit by tornadoes begin long cleanup after 4 killed in weekend storms",
      "url": "https://apnews.com/5fa3a64e552ab91e8d76dabe21f70fd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef4b5e6696bf47d69a869102f5b7a441/1920.jpeg"
    },
    {
      "author": null,
      "description": "NAIROBI, Kenya (AP) — A dam collapsed in western Kenya early Monday, killing at least 40 people after a wall of water swept through houses and cut off a major road, police said. The Old Kijabe Dam, located in the Mai Mahiu area of the Great Rift Valley region that is prone to flash floods, collapsed and water spilled downstream, carrying with it mud, rocks and uprooted trees, police official Stephen Kirui told The Associated Press.",
      "publishedAt": "2024-04-29T09:10:33Z",
      "title": "At least 40 people die in western Kenya after a dam collapses following heavy rains",
      "url": "https://apnews.com/6976f1aae4a8cd31a2f4ebae4f0c7f32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13e6fa7e3ebf48819a2f6e0c96d9b0b8/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is out to win votes by scoring some laughs at the expense of Donald Trump, unleashing mockery with the goal of getting under the former president's thin skin and reminding the country of his blunders.",
      "publishedAt": "2024-04-28T14:03:19Z",
      "title": "Have you heard the one about Trump? Biden tries humor on the campaign trail",
      "url": "https://apnews.com/936815b539a3e541a03db16ba0807c6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0881bf3a342d4698893c2dd1fbd2d7e0/3000.jpeg"
    },
    {
      "author": "CIARÁN GILES and JOSEPH WILSON",
      "description": "MADRID (AP) — Spanish Prime Minister Pedro Sánchez on Monday ended days of speculation about his future by saying he will continue in office “with even more strength.\"",
      "publishedAt": "2024-04-29T04:10:36Z",
      "title": "Spain's Prime Minister Sánchez says he'll continue in office after days of reflection",
      "url": "https://apnews.com/f69907e614c0558b9709d09c5d75967c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c363db71a50046208a510e48123562aa/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "PITTSBURGH (AP) — On a three-lane test track along the Monongahela River, an 18-wheel tractor-trailer rounded a curve. No one was on board. A quarter-mile ahead, the truck's sensors spotted a trash can blocking one lane and a tire in another.",
      "publishedAt": "2024-04-29T10:01:24Z",
      "title": "Tractor-trailers with no one aboard? The future is near for self-driving trucks on US roads",
      "url": "https://apnews.com/083409631158f54d806d75309c4764e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b534c0f31cee4e639c5f31e829971b81/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "VERSAILLES, France (AP) — The historic Versailles Palace Gardens will soon host the Paris Olympics equestrian sports. Meanwhile, the select number of riders of the National Equestrian Academy handling the palace's famed royal stables continue to care for their beloved horses: Almost every day at dawn, they enjoy the quietness and splendor of grass lawns and woods of the park of the Versailles Palace, before thousands of visitors from across the world spread in.",
      "publishedAt": "2024-04-29T07:05:37Z",
      "title": "Horses show off in Versailles, keeping alive royal tradition on soon-to-be Olympic equestrian venue",
      "url": "https://apnews.com/fb4549eedeac3926366de0e8503ad18b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9ca2d2ad5a0413db0213acd100f4bd2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}