{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A helicopter carrying Iranian President Ebrahim Raisi, the country's foreign minister and other officials apparently crashed in the mountainous northwest reaches of Iran on Sunday, sparking a massive rescue operation in a fog-shrouded forest as the public was urged to pray.",
      "publishedAt": "2024-05-19T12:42:37Z",
      "title": "Helicopter carrying Iran's hard-line president apparently crashes in foggy, mountainous region",
      "url": "https://apnews.com/b483ba75e4339cfb0fe00c7349d023b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfc0ca835fc34848905ae40828130f4e/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — The apparent crash of a helicopter carrying Iranian President Ebrahim Raisi, the country's foreign minister and other officials is likely to reverberate across the Middle East.That's because Iran has spent decades supporting armed groups in Lebanon, Syria, Iraq, Yemen and the Palestinian territories that allow it to project power and potentially deter attacks from the United States or Israel, the sworn enemies of its 1979 Islamic Revolution.",
      "publishedAt": "2024-05-19T20:36:54Z",
      "title": "Helicopter crash could reverberate across the Middle East, where Iran's influence runs wide and deep",
      "url": "https://apnews.com/f5145ec19b169417d3b40a50ca9ff5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/650d4a6a4d8a4a11a7aa2edb038c887d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel's leaders aired divisions over who should govern Gaza after the war, now in its eighth month.",
      "publishedAt": "2024-05-19T09:18:40Z",
      "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel's leaders are increasingly divided",
      "url": "https://apnews.com/d6ea9776d293130d52d308abd284556e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5753e7f946ea4d4789b40b2a1d995754/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Testimony in the hush money trial of Donald Trump is set to conclude in the coming days, putting the landmark case on track for jury deliberations that will determine whether it ends in a mistrial, an acquittal — or the first-ever felony conviction of a former American president.",
      "publishedAt": "2024-05-19T11:34:40Z",
      "title": "What we've learned so far in the Trump hush money trial and what to watch for as it wraps up",
      "url": "https://apnews.com/2723054e49944eecb6c86008ec4adabd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca52622da86d4dc086d68e31e3834223/2159.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "LOUISVILLE, Ky. (AP) — Xander Schauffele cashed in at just the right time Sunday, swirling in a 6-foot birdie putt on the final hole to win the PGA Championship for his first major with the lowest score in major championship history.",
      "publishedAt": "2024-05-19T23:10:26Z",
      "title": "Xander Schauffele wins first major at PGA Championship in a thriller at Valhalla",
      "url": "https://apnews.com/5ceccfd6fbdc500dc53e914d74c99bb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eafc697097a441ca88050d66e43fa88/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN and JOCELYN GECKER",
      "description": "BERKELEY, Calif. (AP) — Charles Darwin's theory of evolution. Stephen Hawking on the Big Bang. Millions of students for civil rights and against the Vietnam War.They were provocative in their times, products of an ideal that holds universities as sacrosanct spaces for debate, innovation — and even revolution.",
      "publishedAt": "2024-05-19T13:02:06Z",
      "title": "The Israel-Hamas war is testing whether campuses are sacrosanct places for speech and protest",
      "url": "https://apnews.com/9cdda079a5649d080f5438c350a209f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d06b50f92676438da7f562dbafd13b68/3000.jpeg"
    },
    {
      "author": "MARTÍN ADAMES ALCÁNTARA",
      "description": "SANTO DOMINGO, Dominican Republic (AP) — Voters in the Dominican Republic cast ballots Sunday in general elections likely to reinforce the government's crackdown on its shared border with Haiti and the hundreds of thousands of people fleeing the violence-stricken nation.",
      "publishedAt": "2024-05-19T04:01:17Z",
      "title": "Dominicans await results of general elections with eyes on crisis in neighboring Haiti",
      "url": "https://apnews.com/59d10ff3d422842c5f3988b34a39588a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fe3a54e6f1e4889b8a3154705a9a3c2/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MATT BROWN and BILL BARROW",
      "description": "ATLANTA (AP) — President Joe Biden on Sunday offered his most direct recognition of U.S. students' anguish over the Israel-Hamas war, telling graduates of historically Black Morehouse College that he heard their voices of protest and that scenes from the conflict in Gaza break his heart, too.",
      "publishedAt": "2024-05-19T03:25:39Z",
      "title": "Biden tells Morehouse graduates that scenes in Gaza from the Israel-Hamas war break his heart, too",
      "url": "https://apnews.com/e42d08d7431bf9218afa90177efa3f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8cc2ea93acb42d0ae4373b7a15c14f2/3000.jpeg"
    },
    {
      "author": null,
      "description": "VAN HORN, Texas (AP) — Ed Dwight, America’s first Black astronaut candidate, finally rocketed into space 60 years later, flying with Jeff Bezos’ rocket company on Sunday.",
      "publishedAt": "2024-05-19T14:54:18Z",
      "title": "Ed Dwight, America's first Black astronaut candidate, finally goes to space 60 years later",
      "url": "https://apnews.com/9fb11af587996ba6833f2b19e9aee68f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc56197ef9f4457fb9c80e491fd96943/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Sean “Diddy” Combs admitted that he beat his ex-girlfriend Cassie in a hotel hallway in 2016 after CNN released video of the attack, saying in a video apology he was “truly sorry” and his actions were “inexcusable.”",
      "publishedAt": "2024-05-19T15:38:23Z",
      "title": "Diddy admits beating ex-girlfriend Cassie, says he's sorry, calls his actions 'inexcusable'",
      "url": "https://apnews.com/4e6a81d3e9ab40fa229edef2fb8ad357",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3388329f2a554b41bd1177d733573d78/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}