{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump's border czar says the number of immigration enforcement officers in Minnesota will be seriously reduced after state and local officials agreed to cooperate by turning over arrested immigrants. Homan says about 700 federal agents will be immediately withdrawn from the immigration operation around Minnesota. Roughly 3,000 federal officers are currently deployed in the state.",
      "publishedAt": "2026-02-04T14:18:05Z",
      "title": "Homan says 700 immigration officers to immediately leave Minnesota",
      "url": "https://apnews.com/article/immigration-enforcement-drawdown-minnesota-homan-963adf341325d7f6eb5673e1c00d3c2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Danica Kirka",
      "description": "The former Prince Andrew has moved out of his long-time home on crown-owned land near Windsor Castle earlier than expected, after the latest release of documents from the U.S. investigation of Jeffrey Epstein revived questions about his friendship with the convicted sex offender. The 65-year-old brother of King Charles III, now known as Andrew Mountbatten-Windsor, left the Royal Lodge in Windsor on Monday and is now living on the king’s Sandringham estate in eastern England. That's according to a person familiar with the matter said. British media reported that Mountbatten-Windsor will live temporarily at Wood Farm Cottage while his permanent home on the estate undergoes repairs.",
      "publishedAt": "2026-02-04T10:59:11Z",
      "title": "Former Prince Andrew moves to King Charles III's private estate",
      "url": "https://apnews.com/article/epstein-andrew-royal-lodge-1443dd1cac502d230cf446a32c2a0c59",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c39254/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fb7%2F38b47ded02eef8f6e90aea8271fc%2Fae629d6677c4436292bcb09f5c982462"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump says and Chinese President Xi Jinping discussed the situation in Iran in a wide-ranging call that comes as the U.S. administration pushes Beijing and others to isolate Tehran. Trump said Wednesday the two leaders also discussed Taiwan and his plans to visit Beijing. Trump continues to weigh taking military action against Iran. Trump announced last month he'd impose a 25% tax on imports to the U.S. from countries that do business with Iran. Years of sanctions aimed at stopping Iran’s nuclear program have left the country isolated. But the World Trade Organization says Tehran still did nearly $125 billion in international trade in 2024, including $32 billion with China.",
      "publishedAt": "2026-02-04T15:53:06Z",
      "title": "Trump says he talked with China's Xi about Iran",
      "url": "https://apnews.com/article/us-china-trump-xi-iran-call-441425004d3d695df87f3f7c0b62492e",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ffc073/2147483647/strip/true/crop/5892x3926+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F09%2F0aebe8b272669475f53dc341aa99%2F20ce04c12ff5497caa0b8e63b6b5c977"
    },
    {
      "author": null,
      "description": "Israeli fire in Gaza killed at least 17 Palestinians, most of them women and children, hospital officials said Wednesday, while Israel said militant gunfire had injured an Israeli soldier. They were the latest Palestinian deaths since a ceasefire, which has been punctuated by deadly Israeli strikes, came into effect on Oct. 10, 2025. More than 530 Palestinians have been killed by Israeli fire since the deal took effect, according to Gaza’s health ministry.",
      "publishedAt": "2026-02-04T08:44:00Z",
      "title": "Israeli fire in Gaza kills 17, while militant gunfire wounds Israeli soldier",
      "url": "https://apnews.com/article/gaza-rafah-hamas-israel-war-2-4-2026-a3726ab659321430bf3ca73cae50936e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0195d90/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F3e%2Ff814afa3c96d44a117007901cae1%2F5eced90106c6485992642c81b06c93cc"
    },
    {
      "author": null,
      "description": "Talks between Iran and the United States will be held on Friday in Oman. That's according to Iranian media reports. The semiofficial ISNA and Tasnim news agencies, as well as the Student News Network, all reported on Wednesday that the talks would take place in Oman, though the sultanate did not immediately acknowledge it would host the talks. Oman hosted multiple rounds of earlier nuclear talks between Iran and the U.S. The U.S. has not acknowledge the talks would take place in Oman, though the White House said it anticipated the negotiations would take place even after the U.S. shot down an Iranian drone on Tuesday and Iran attempted to stop a U.S.-flagged ship.",
      "publishedAt": "2026-02-04T13:48:44Z",
      "title": "US-Iran talks to take place in Oman on Friday, reports say",
      "url": "https://apnews.com/article/iran-protests-crackdown-2556ffcb5731de2753ffa044a6e2175b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a822272/2147483647/strip/true/crop/1189x792+6+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fba%2F544ff9f192db89e62ede7064a4ef%2Fccf64f2394c2483196e80667818fb248"
    },
    {
      "author": "Kate Brumback",
      "description": "Fulton County has filed a motion in federal court to retrieve documents from the 2020 election. The FBI seized these documents last week from a warehouse near Atlanta. The motion filed Wednesday also requests the unsealing of a law enforcement agent's sworn statement. That statement was presented to the judge who approved the search warrant. The motion isn't being released because the case is under seal. The search took place on Jan. 28 at Fulton County’s main election facility. Fulton County votes overwhelmingly Democratic. It's been a target of Donald Trump and his allies since the Republican narrowly lost the state to Joe Biden in 2020.",
      "publishedAt": "2026-02-04T14:44:25Z",
      "title": "Georgia's Fulton County wants 2020 election documents seized by FBI back",
      "url": "https://apnews.com/article/fbi-georgia-elections-fulton-county-2020-ballots-532b6daf318c79c471cd7f145c9f2215",
      "urlToImage": "https://dims.apnews.com/dims4/default/ece67d4/2147483647/strip/true/crop/2904x1935+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F02%2F8c9ef6bdffed1405ed4530a3fe3d%2F5741f01209654a5db025b33a0b549f39"
    },
    {
      "author": "Mary Clare Jalonick, Joey Cappelletti",
      "description": "A bipartisan agreement on new restrictions for federal immigration operations in the next two weeks will be exceedingly difficult despite rare negotiations between Democrats and President Donald Trump. Congress is discussing potential new rules for Immigration and Customs Enforcement, U.S. Customs and Border Protection and other officers who are conducting immigration arrests after the deaths of two Minneapolis protesters in January. The negotiations come during some bipartisan sentiment that Congress should step in to de-escalate tensions that have rocked Minnesota and other states. But it’s unclear if the president or enough congressional Republicans will agree to any of the Democrats’ larger demands.",
      "publishedAt": "2026-02-04T12:06:54Z",
      "title": "What Democrats want in fight over ICE funding",
      "url": "https://apnews.com/article/congress-immigration-enforcement-democrats-homeland-security-trump-bcde78c38605732106fb77e46373dc9a",
      "urlToImage": "https://dims.apnews.com/dims4/default/44fd045/2147483647/strip/true/crop/3738x2491+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fa5%2Ff2405080530ebdbef161c5ebdb99%2F80b5d64475e74ffca8603e5f6311def9"
    },
    {
      "author": "Didi Tang, Josh Funk, Matthew Lee",
      "description": "The Trump administration wants to create a critical minerals trading bloc with its allies that will use tariffs to maintain price floors and defend against China’s tactic of flooding the market to undermine any potential competitors. Vice President JD Vance said Wednesday that the trade war over the past year exposed how dependent most countries are on the critical minerals that China has a stranglehold on. Critical minerals are needed for everything from jet engines to smartphones. China dominates the market for those ingredients crucial to high-tech products.",
      "publishedAt": "2026-02-04T05:06:28Z",
      "title": "Vance says US seeks to create a critical minerals trading bloc with allies",
      "url": "https://apnews.com/article/trump-china-rare-earths-critical-minerals-tariffs-aa82fd4c065c9b62300ff7834b660cfb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e75de29/2147483647/strip/true/crop/4792x3193+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F06%2F1758876431c2f692f97e58fe250f%2F3e006ec5ff254230a1d09964a7d2d012"
    },
    {
      "author": "David Bauder",
      "description": "The troubled Washington Post has begun implementing large-scale cutbacks, including eliminating its sports department and shrinking the number of journalists it stations overseas. The changes were announced in a Zoom meeting with staff on Wednesday by executive editor Matt Murray. That's according to a person who listened to the call but was not authorized to speak with the media and spoke on the condition of anonymity. Staff members in the newsroom were told they'd get emails with one of two subject lines, announcing the person’s role has or hasn’t been eliminated. A total number of layoffs wasn't announced in the call. A Post representative hasn't returned a call seeking comment.",
      "publishedAt": "2026-02-04T14:27:07Z",
      "title": "Washington Post implements large-scale cuts",
      "url": "https://apnews.com/article/washington-post-staff-reduction-layoffs-cuts-923f87d4bd319c8a64b278165d0a6e27",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2c3df2/2147483647/strip/true/crop/5865x3908+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F91%2F1eb749d5cee10499735318eadbb8%2F52607db458244a398d835e85e034ec9d"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are drifting in mixed trading, while gold’s price stabilized further and climbed back above $5,000 per ounce. The S&P 500 edged down by 0.1% Wednesday, coming off its fourth modest drop in the last five days. The Dow Jones Industrial Average added 281 points, and the Nasdaq composite fell 0.6%. Technology stocks weighed on the market for a second straight day. Advanced Micro Devices sank even though the chip company reported a stronger profit for the latest quarter than analysts expected. Gold and silver prices rose following their sudden washouts over the last week. Treasury yields held relatively steady.",
      "publishedAt": "2026-02-04T04:09:48Z",
      "title": "Wall Street drifts as gold rises back above $5,000",
      "url": "https://apnews.com/article/stocks-markets-gold-silver-oil-trump-696988a330fd224f3364709eaee6cf2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f73e6a5/2147483647/strip/true/crop/3941x2626+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fa8%2F5c37122be43e93b449f47300e0d8%2F184b1e9379df45fe9bcde1b30d64d321"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}