{
  "articles": [
    {
      "author": null,
      "description": "The Washington, D.C., police chief has ordered more cooperation between officers and federal immigration officials. This move is part of President Donald Trump's law enforcement takeover of the capital. Trump called the announcement “a very positive thing.” The changes allows local police to share information with immigration agencies and provide transportation for federal immigration employees. The increased federal presence in the city has been striking, with troops stationed at Union Station and other high-traffic areas. Meanwhile, volunteers helped homeless residents leave encampments, adding to the city's tense atmosphere.",
      "publishedAt": "2025-08-14T17:31:30Z",
      "title": "Washington police chief issues immigration order amid Trump crackdown",
      "url": "https://apnews.com/article/washington-trump-homeless-national-guard-police-a0d326fcd3731c564c2c566893385674",
      "urlToImage": "https://dims.apnews.com/dims4/default/eadaa28/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F8e%2F677c42b1f934c16c88698a4a2dc7%2F380018a200db43c197e25a02abdc2aa6"
    },
    {
      "author": null,
      "description": "California Gov. Gavin Newsom is calling for a special election on November 4 to introduce new U.S. House maps. The goal is to win more Democratic seats. This move responds to Republican efforts to gain five seats in Texas. On Thursday, Newsom released a campaign ad on social media as Democrats kicked off a press conference. State lawmakers need to declare the special election, and they plan to do so next week. Democrats have not yet released their draft maps, but they aim to pick up five more seats. The maps need voter approval because an independent commission currently draws them.",
      "publishedAt": "2025-08-14T18:47:02Z",
      "title": "California to move forward with redistricting effort",
      "url": "https://apnews.com/article/california-newsom-redistricting-texas-trump-5ccb3de37f6d3ec803ac24ad363018fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/297163d/2147483647/strip/true/crop/5558x3126+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F2d%2Fae69cdf184edf241801003305222%2Fd7abf338caae4e51bc2742e95af26ce3"
    },
    {
      "author": null,
      "description": "Russian President Vladimir Putin praised U.S. President Donald Trump’s efforts to end the war in Ukraine, more than three years after Moscow launched its invasion, as the two leaders prepared for a pivotal U.S.–Russia summit Friday in Alaska. Putin made the remarks Thursday following a meeting with top government officials on the summit. He said in a short video released by the Kremlin that the Trump administration was making “energetic and sincere efforts” to stop the war. Meanwhile, Ukrainian President Volodymyr Zelenskyy and other European leaders worked to ensure their interests are taken into account when Trump and Putin meet in Anchorage.",
      "publishedAt": "2025-08-14T08:17:22Z",
      "title": "Putin praises Trump's efforts to end Ukraine war",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-putin-838f844639657d51dd4b195d8c2f417c",
      "urlToImage": "https://dims.apnews.com/dims4/default/9487f1b/2147483647/strip/true/crop/1945x1094+0+101/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F2a%2F345bf8327df19d8b6ac7aeac691a%2F20b7e141691f4a82ad291ffad074080d"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu claims there is no hunger in Gaza, but malnourished children are regularly arriving at Nasser Hospital. The U.N. says starvation and malnutrition in Gaza are at the highest levels since the war began. The Gaza Health Ministry says 171 people have died of malnutrition-related causes since July 1, a quarter of them children. Aid has increased in recent weeks, but food remains scarce or unaffordable for many. While the influx of food might help much of Gaza’s population, experts say that is not necessarily the case for children who are already severely malnourished. They often require treatment first at a hospital, where vital micronutrients must be replenished before their bodies will be able to properly metabolize food.",
      "publishedAt": "2025-08-14T14:41:17Z",
      "title": "A Gaza hospital sees rising numbers of malnourished children",
      "url": "https://apnews.com/article/palestinians-gaza-children-starvation-israel-netanyahu-0549e843c24fe7f20f1e7ce085502450",
      "urlToImage": "https://dims.apnews.com/dims4/default/069e454/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2Fa7%2F5685024b54b54436e2ed4ad93a9e%2F80396af768774f758cace47bcc17f978"
    },
    {
      "author": null,
      "description": "A federal judge has struck down two Trump administration actions aimed at eliminating diversity, equity and inclusion programs at the nation’s schools and universities. In her ruling on Thursday, U.S. District Judge Stephanie Gallagher in Maryland stated that the Education Department violated the law when it threatened to cut federal funding from educational institutions that continued with DEI initiatives. The judge’s ruling followed a motion for summary judgment from the American Federation of Teachers and the American Sociological Association, which challenged the government’s actions in a February lawsuit.",
      "publishedAt": "2025-08-14T21:09:12Z",
      "title": "Judge rules against Trump administration's plan to end DEI efforts",
      "url": "https://apnews.com/article/trump-dei-schools-lawsuit-ruling-education-department-4c1dbb5f7b3997ba78c17b25a935fb3f",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ae06e9/2147483647/strip/true/crop/1159x652+5+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F79%2F4f35bc92c7f3cbdd246d51898080%2Fddff61020a3a4075866d2530761e8973"
    },
    {
      "author": null,
      "description": "Justice Department indictments have been unsealed against three leaders and two high-ranking enforcers of Mexico's United Cartels. It's the latest U.S. move against major Mexican drug operations. United Cartels is an umbrella organization made up of smaller cartels that have worked for different groups over time. The organization holds a fierce grip over the western state of Michoacan, Mexico. The U.S. government on Thursday said it's offering a reward of up to $10 million for information leading to the arrest of United Cartels’ top leader, Juan José Farías Álvarez, along with multimillion rewards for the four others. All five are believed to be in Mexico.",
      "publishedAt": "2025-08-14T14:56:45Z",
      "title": "US charges 5 cartels leaders and enforcers of a big Mexican drug operation",
      "url": "https://apnews.com/article/justice-department-drug-cartels-mexico-428cb8ad6180057e37baf6f34e36f68c",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e1cb38/2147483647/strip/true/crop/5842x3286+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F2b%2F05a2303594eabb112913885d90db%2Fc25e267731a24379a5406c75ce248b2a"
    },
    {
      "author": null,
      "description": "The Supreme Court has refused to block enforcement of a Mississippi law aimed at regulating the use of social media by children. The case deals with an issue of growing national concern. The justices on Thursday rejected an emergency appeal from a tech industry group challenging laws passed in Mississippi and other states that require social media users to verify their ages. NetChoice, which brought the lawsuit, argues the Mississippi law threatens privacy rights and unconstitutionally restricts the free expression of users of all ages.",
      "publishedAt": "2025-08-14T18:16:35Z",
      "title": "Justices allow enforcement of Mississippi social media age verification law",
      "url": "https://apnews.com/article/social-media-age-verification-supreme-court-mississippi-7d304cd759ecde9318de25df63dd52b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b8b438/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2F09%2Fbdcdf9eee35b73abf8488c616e78%2Fb09fba05714b473c9b2bc61324b0d769"
    },
    {
      "author": null,
      "description": "Florida Republican Gov. Ron DeSantis’ administration is preparing to open a second immigration detention facility at a state prison in north Florida, as a federal judge decides the fate of the state’s holding center for immigrants at an isolated airstrip in the Florida Everglades dubbed “Alligator Alcatraz.” DeSantis announced Thursday that the new facility is to be build at the Baker Correctional Institution, a state prison about 43 miles (69 kilometers) west of Jacksonville, and is expected to house 1,300 immigration detention beds, though that capacity could be expanded to 2,000, state officials said.",
      "publishedAt": "2025-08-14T14:03:30Z",
      "title": "DeSantis announces plans for second immigration detention facility in north Florida",
      "url": "https://apnews.com/article/florida-immigration-detention-center-desantis-dce8b6b8f634152a604eb06bfc2fb461",
      "urlToImage": "https://dims.apnews.com/dims4/default/32e442d/2147483647/strip/true/crop/5663x3185+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F0f%2F99ea9ae2323aef935c656f7a4dbd%2F409a87f8cb044d2cbc9ef38a5e029fbb"
    },
    {
      "author": null,
      "description": "Taylor Swift's talk with her boyfriend, Travis Kelce, and his brother Jason Kelce on the “New Heights” podcast is a milestone moment for the two decade-old media format. One expert even says it has the chance to become the most-consumed podcast episode ever. Swift's appearance previewing her upcoming album and talking about her relationship also cements a growing trend. Entertainers, sports figures and politicians prefer the long-form talk with a friendly face to prying questions from a journalist. Already, the interview or highlights have been seen hundreds of millions of times online.",
      "publishedAt": "2025-08-14T22:03:16Z",
      "title": "Taylor Swift on 'New Heights': A milestone moment for podcasts",
      "url": "https://apnews.com/article/new-heights-podcast-taylor-swift-kelce-e5b21dc74fdc8aebf04f383e5dc11b0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f2b5e79/2147483647/strip/true/crop/5131x2886+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F3a%2F7b6eb983d709aed9af01c2a52c15%2Fe8111f8ecaa546c185d643fd4df4d8ad"
    },
    {
      "author": null,
      "description": "Ohio State and Pittsburgh each placed three players on The Associated Press All-Time All-America football team and four other schools have two players each on the first team. The unveiling of the all-time team is part of the news organization’s celebration of the 100th anniversary of the AP All-America team. The Big Ten led all conferences with seven selections, two more than the Southeastern Conference. A panel of 12 AP sports writers who cover college football selected the all-time team. It cannot be considered definitive. There have been far more great players over the last century than spots available.",
      "publishedAt": "2025-08-14T16:05:06Z",
      "title": "Ohio State and Pittsburgh shine on AP All-Time All-America team",
      "url": "https://apnews.com/article/ap-college-football-allamerica-a7e5c1c4fde40a6c361f058878cf3354",
      "urlToImage": "https://dims.apnews.com/dims4/default/6de2186/2147483647/strip/true/crop/2185x1229+0+113/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F07%2F775b6dea12dfbe20d6a78ac7799d%2F7a14a8914d0e4544aa1715c3ae3c355e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}