{
  "articles": [
    {
      "author": null,
      "description": "A divided Supreme Court has ruled that individual judges lack the authority to grant nationwide injunctions, but the decision leaves unclear the fate of President Donald Trump’s restrictions on birthright citizenship. The outcome Friday was a victory for Trump, who has complained about individual judges throwing up obstacles to his agenda. But a conservative majority left open the possibility that the birthright citizenship changes could remain blocked nationwide. The Republican president’s order would deny citizenship to U.S.-born children of people who are in the country illegally.",
      "publishedAt": "2025-06-27T14:18:32Z",
      "title": "Supreme Court leaves fate of Trump birthright citizenship order unclear",
      "url": "https://apnews.com/article/supreme-court-trump-birthright-citizenship-immigration-9da9e11d83f2fd3cbf95e6a733651daf",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": null,
      "description": "The Supreme Court has ruled that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks. The justices Friday reversed lower-court rulings in favor of the Montgomery County school system in suburban Washington. The high court ruled that the schools likely could not require elementary school children to sit through lessons involving the books if parents expressed religious objections to the material. The decision was not a final ruling in the case, but the justices strongly suggested that the parents will win in the end. The court ruled that policies like the one at issue in the case are subjected to the strictest level of review, nearly always dooming them.",
      "publishedAt": "2025-06-27T14:53:33Z",
      "title": "Supreme Court says Maryland parents can pull kids from LGBTQ book lessons",
      "url": "https://apnews.com/article/supreme-court-lgbtq-books-religion-maryland-schools-c0b0fb4b96531636fcb98b08aabc3cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b9e9ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fb4%2F28aba2883a2a7268895fa56644b4%2Fee48c15dd5604f6281a7266388de25da"
    },
    {
      "author": null,
      "description": "The Supreme Court has upheld a Texas law aimed at blocking kids from seeing pornography online. The high court handed down the ruling Friday. More than a dozen states have passed similar age verification laws as smartphones and other devices make it easier to access online porn, including hardcore obscene material. An industry trade group challenged the Texas law after the adult-content site Pornhub shut down in several states. The group said the law puts an unfair burden on adults by requiring them to submit personal information that could be vulnerable to hacking or tracking. Texas says modern age checks are safe and important for protecting children.",
      "publishedAt": "2025-06-27T15:17:35Z",
      "title": "Supreme Court upholds Texas law aimed at blocking kids from seeing porn",
      "url": "https://apnews.com/article/supreme-court-porn-age-verification-texas-12a73197796fe8c4bef0d888259543cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/0286a76/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F6a%2F5e969b9a35314316fae4bc715651%2F52f3a60b8f2a440e84f318d4ed38ac3e"
    },
    {
      "author": null,
      "description": "Senate Republicans appear to have President Donald Trump’s big bill back on track after a flurry of last-minute revisions. But there's still a long way to go. Trump himself gave Congress some breathing room as senators race to meet his Fourth of July deadline, saying that date is “not the end all.” With their majority control of Congress, Republicans are trying to push the package past unified Democratic opposition. To do so, they are working through a punch list of still-unsettled issues, including Medicaid health care cuts. Republicans are relying on steep reductions in programs to help pay for $3.8 trillion in tax breaks.",
      "publishedAt": "2025-06-27T18:11:34Z",
      "title": "Senate GOP put Trump's bill back on track to meet July 4 deadline",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-tax-cuts-snap-medicaid-salt-2c195fe68e849beaa681e3f75c8ed5ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0e7353/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F59%2F52e49af34313631a8ae564a0c6a0%2F9606a411c1664453864dad779823302a"
    },
    {
      "author": null,
      "description": "California Gov. Gavin Newsom has sued Fox News over alleged defamation, saying the network knowingly aired false information about him over a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles. The lawsuit filed Friday alleges Fox News anchor Jesse Watters lied on air about Newsom and Trump speaking on the phone when there was no phone call. Newsom also argues Watters’ program deceptively edited a video to support that claim. Newsom is asking for $787 million in punitive damages. Fox News says the lawsuit is “frivolous.”",
      "publishedAt": "2025-06-27T17:57:34Z",
      "title": "Newsom files suit against Fox News over Trump call reporting",
      "url": "https://apnews.com/article/newsom-sues-fox-news-phone-call-0a4a13d597e5f58981512b7320717162",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bea4fe/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fbc%2F90825903223910eb103dd5994439%2Fe2fe775fe3444bb1a745a057ed9018a6"
    },
    {
      "author": null,
      "description": "President Donald Trump says he’s immediately suspending trade talks with Canada over its plans to continue with its tax on technology firms. Trump said Friday in a post on his social media network Canada had just informed the U.S. that it was sticking to its plan to impose the tax set to take effect Monday. Canada’s digital services tax requires Canadian and foreign businesses that engage with online users in Canada. The digital services tax will hit companies like Amazon, Google, Meta, Uber and Airbnb with a 3% levy on revenue from Canadian users. It will apply retroactively, leaving U.S. companies with a $2 billion US bill due at the end of the month.",
      "publishedAt": "2025-06-27T18:16:16Z",
      "title": "Trump says he’s terminating trade talks with Canada over tax on tech firms",
      "url": "https://apnews.com/article/trump-canada-trade-tariffs-43a08970daa1ae5dd888bd3198bac45f",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d97454/2147483647/strip/true/crop/5526x3108+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2Fb6%2Fd94a14a96b2d61c346f94fee1f41%2Fdc3ca4f899ca4356aab5c5bbc65ccbec"
    },
    {
      "author": null,
      "description": "Iran's top diplomat says new nuclear talks with the U.S. are unlikely soon, citing complications from recent American military strikes. Foreign Minister Abbas Araghchi left open the possibility that his country would again enter talks on its nuclear program during an interview on Iranian state television broadcast late Thursday. But he suggested it would not be anytime soon. On Sunday, the U.S. bombed three key Iranian nuclear facilities. Araghchi acknowledged that “the level of damage is high.\" Iran retaliated Monday by firing missiles at a U.S. base in Qatar, though no casualties were reported.",
      "publishedAt": "2025-06-27T09:09:05Z",
      "title": "Iran's top diplomat says nuclear talks with the US complicated by strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-27-2025-e30d8ae4e3c6d13e4cfb562c35dd744b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4a9119/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2Fed%2F52fd7537c58e8503bfa62c51d777%2F45ee2cf35a2647498d757c325a46800d"
    },
    {
      "author": null,
      "description": "A defense lawyer says in his closing argument that the government “badly exaggerated” its evidence against music mogul Sean “Diddy” Combs, turning the swinger lifestyle, drugs and threesomes into a racketeering conspiracy. The lawyer, Marc Agnifilo, was expected to spend several hours Friday trying to convince the New York jury to exonerate his 55-year-old client of charges including sex trafficking and racketeering conspiracy. A prosecutor on Thursday had labeled Combs as a serial sex trafficker who manipulated his girlfriends over a 20-year period to participate in sexual performances with male escorts that Combs filmed.",
      "publishedAt": "2025-06-27T14:28:37Z",
      "title": "Sean 'Diddy' Combs’ lawyer mocks sex trafficking case in closing, says charges 'badly exaggerated'",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-closings-4fcd417c10b276d0c4efca95c4e5d65d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3a62e9/2147483647/strip/true/crop/2396x1348+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F2c%2Fab7c01fca4b716c9e1dfebac6abd%2F937ad5043233412b9f312a2b5541d372"
    },
    {
      "author": null,
      "description": "A federal judge has sentenced a Colorado funeral home owner who stashed nearly 190 decomposing bodies to 20 years in prison on federal fraud charges. Jon Hallford stored the bodies in a room-temperature building between 2019 and 2023. Prosecutors say he cheated customers and defrauded the federal government out of nearly $900,000 in pandemic aid. He had faced a maximum of 20 years in prison at Friday’s sentencing. Hallford will be sentenced in August in a separate state case in which he pleaded guilty to 191 counts of corpse abuse.",
      "publishedAt": "2025-06-27T04:05:19Z",
      "title": "Funeral home owner who stashed nearly 190 decomposing bodies sentenced to 20 years on fraud charges",
      "url": "https://apnews.com/article/funeral-home-bodies-decomposing-colorado-13c264644be34afeee9fe420f5d5ae88",
      "urlToImage": "https://dims.apnews.com/dims4/default/144f135/2147483647/strip/true/crop/5172x2909+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F76%2F4911ba8ed922ceea86f1f2782564%2F27a85258039d4cc9a34372e3d7fa4b8e"
    },
    {
      "author": null,
      "description": "Global shares are mostly higher as the week winds down with the Israel-Iran ceasefire still in place and news that China and the U.S. have made progress on a trade deal. Officials gave no details about the deal that President Donald Trump said was signed earlier in the week. On Thursday, the S&P 500 ended just 0.05% below its all-time closing high set in February. The Dow Jones Industrial Average rallied 0.9%, and the Nasdaq gained 1%. Upbeat reports on the U.S. economy, including jobless claims and orders for long-lasting manufactured goods, also supported investor sentiment.",
      "publishedAt": "2025-06-27T04:12:21Z",
      "title": "Global shares are mostly higher after US stocks rise to the brink of a record",
      "url": "https://apnews.com/article/stocks-markets-china-tariffs-rates-53ddd3e8d11be4d09419418b4f141382",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1f395e/2147483647/strip/true/crop/3462x1947+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fb3%2F8e6a764391e5c2060c8399337387%2F35a2272fca56413d92bcd4c6c4a79a46"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}