{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — In an extraordinary turn, a judge Friday set President-elect Donald Trump's sentencing in his hush money criminal case for Jan. 10 — little over a week before he's due to return to the White House — but indicated he wouldn't be jailed.",
      "publishedAt": "2025-01-03T20:57:31Z",
      "title": "Judge sets Trump's sentencing in hush money case for Jan. 10, but signals no jail time",
      "url": "https://apnews.com/a7e02ac952e3cd35a8d5d2c3ec6219e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14711bc550b143bb82f4e1c515dc4ad0/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republican Mike Johnson narrowly won reelection Friday as House speaker on a first ballot, overcoming hard-right GOP holdouts in a tense standoff and buoyed by a nod of support from President-elect Donald Trump.",
      "publishedAt": "2025-01-03T12:03:14Z",
      "title": "Republican Mike Johnson reelected House speaker in dramatic floor vote",
      "url": "https://apnews.com/ccbe593940ef488019563e8e4b98061e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc96c50d847c48e7917dfadfa6d51c5a/1920.jpeg"
    },
    {
      "author": "RIO YAMAT, TARA COPP, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "LAS VEGAS (AP) — A highly decorated Army soldier who fatally shot himself in a Tesla Cybertruck just before it blew up outside the Trump hotel in Las Vegas left notes saying the New Year's Day explosion was a stunt to serve as a “wake up call” for the country’s ills, investigators said Friday.",
      "publishedAt": "2025-01-03T19:27:19Z",
      "title": "Soldier who blew up Tesla at Trump hotel left note saying blast was to be a 'wake up call' for US",
      "url": "https://apnews.com/6c85af85255753db497f2cd344fb2ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec7590e56a014c96b22168a6ce994aa5/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN, JACK BROOK, STEPHEN SMITH and SARA CLINE",
      "description": "NEW ORLEANS (AP) — The man who rammed a pickup truck into a crowd of New Year's revelers in New Orleans had suspected bomb-making materials at his home and reserved the vehicle used in the deadly attack more than six weeks earlier, law enforcement officials told The Associated Press on Friday.",
      "publishedAt": "2025-01-03T05:04:03Z",
      "title": "New Orleans attacker had suspected bomb materials at home, reserved truck weeks ago, officials say",
      "url": "https://apnews.com/88a300e2f36eaf2920ed634983d72f08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a19f8a435a947e0a998c611c1248d45/1920.jpeg"
    },
    {
      "author": "JASON DEAREN, MICHELLE R. SMITH and AARON KESSLER",
      "description": "While much remains unknown about the man who carried out an attack in New Orleans on New Year’s and another who died in an explosion in Las Vegas the same day, the violence highlights the increased role of people with military experience in ideologically driven attacks, especially those that seek mass casualties.",
      "publishedAt": "2025-01-03T18:57:46Z",
      "title": "New Orleans attack and Vegas explosion highlight extremist violence by active military and veterans",
      "url": "https://apnews.com/a7febd9698219e91d3132a1e4bce3eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed9135e906e142aaad8ed07c69226e8a/3000.jpeg"
    },
    {
      "author": "BY SETH BORENSTEIN",
      "description": "A strong snow and ice storm followed by brutally cold conditions will soon smack the eastern two-thirds of the United States as frigid air escapes the Arctic, plunging as far south as Florida, meteorologists forecast.",
      "publishedAt": "2025-01-03T16:24:39Z",
      "title": "A double dose of nasty winter is about to smack much of the US with snow, ice and biting cold",
      "url": "https://apnews.com/2360ffb749915100598f30f5ebcb6cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40bcf5388b754a1ab96a60947d46d2bd/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — New York Gov. Kathy Hochul wants to expand the state’s involuntary commitment laws to allow hospitals to compel more mentally ill people into treatment, following a series of violent crimes in the New York City subway system.",
      "publishedAt": "2025-01-03T19:57:09Z",
      "title": "New York governor to push for expanded mental health laws, citing violence on subway",
      "url": "https://apnews.com/78b5a6620f4ac6b2629d8867b3660e71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9fd6cf6779742709f3c6845438b4107/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, FATMA KHALED and SAM MEDNICK",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes killed at least 42 people in Gaza, including children, overnight and into Friday, hospital and emergency response workers said, as health workers and Israel's military traded claims over reported evacuation orders for two hospitals in the territory's largely isolated north.",
      "publishedAt": "2025-01-03T09:58:00Z",
      "title": "Israeli strikes kill at least 42 in Gaza as ceasefire talks set to resume in Qatar",
      "url": "https://apnews.com/1eb622d4d4dac17b9f10494107b9e136",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6768c41e77146d4a88e5e2a8a170c0d/1920.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "PLAINS, Ga. (AP) — It never got old.No matter how many times one crammed into the modest sanctuary at Maranatha Baptist Church, there was always some wisdom to be gleaned from the measured, Bible-inspired words of Jimmy Carter.",
      "publishedAt": "2025-01-04T04:39:36Z",
      "title": "Sunday school class with Jimmy Carter: What it was like",
      "url": "https://apnews.com/a1a692079be175cf2e882176fc343344",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85aa9c18577948729fe126e428f8c050/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Apple TV+ is hoping people will make a dent in the Strategic Popcorn Reserve by bingeing its streaming TV and movies for free this weekend in what experts are calling a canny promotion.",
      "publishedAt": "2025-01-03T17:28:18Z",
      "title": "Why Apple TV+ is offering a free weekend of binge-watching",
      "url": "https://apnews.com/c7c0453713aa4a7c314550ccf9281274",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc55217045594642b3e84e8a18a077cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}