{
  "articles": [
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Silicon Valley billionaires behind a secretive $800 million land-buying spree in Northern California have finally released some details about their plans for a new green city, but they still must win over skeptical voters and local leaders.",
      "publishedAt": "2023-09-01T17:25:08Z",
      "title": "Billionaires want to build a new city in rural California. They must convince voters first",
      "url": "https://apnews.com/35f91416dd7d84ecb03ed08199d87dd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/085fac030a5146f6945a94292ace804e/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — After months of struggling to find agreement on just about anything in a divided Congress, lawmakers are returning to Capitol Hill to try to avert a government shutdown, even as House Republicans consider whether to press forward with an impeachment inquiry into President Joe Biden.",
      "publishedAt": "2023-09-05T04:06:30Z",
      "title": "Congress returns to try to prevent a government shutdown while the GOP weighs an impeachment inquiry",
      "url": "https://apnews.com/048dee639bb0dcb6604f05ba2f0782a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb00497d121448d0b276138b164be411/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Republican Leader Mitch McConnell's health episodes show “no evidence” of a stroke or seizure disorder, the Capitol physician said Tuesday, but his statement still left questions about the apparent freeze-ups that have drawn concerns about the 81-year-old's situation.",
      "publishedAt": "2023-09-05T15:33:46Z",
      "title": "Sen. McConnell's health episodes show no evidence of stroke or seizure disorder, Capitol doctor says",
      "url": "https://apnews.com/162087fbf0d0c1dfa2c19beca1bd380f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b40e851a4f54471fb4400577528b88fd/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — The end of Labor Day weekend would typically mark the start of a furious sprint to the Iowa caucuses as candidates battle for their party's presidential nomination.",
      "publishedAt": "2023-09-05T04:04:04Z",
      "title": "A Trump-Biden rematch may be on the horizon in 2024, whether voters like it or not",
      "url": "https://apnews.com/c84d0905fd5d238e088618c5ed41c2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d594fba6506a4e6d9b93f817be34842a/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un may travel to Russia for a summit with President Vladimir Putin, a U.S.",
      "publishedAt": "2023-09-05T11:40:36Z",
      "title": "Kim Jong Un and Putin may meet. What do North Korea and Russia need from each other?",
      "url": "https://apnews.com/c44735b9903e6f30e7e8d673ef4c77f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24f036cecf9a4129938f09e4e7a1222d/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Former Proud Boys national chairman Enrique Tarrio will be sentenced on Tuesday for a plot to attack the U.S.",
      "publishedAt": "2023-09-05T10:42:07Z",
      "title": "Former Proud Boys leader Enrique Tarrio faces sentencing in the Jan. 6 Capitol attack",
      "url": "https://apnews.com/da60222b3e1e54902db2bbbb219dc3fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63ad61379403480cbb06f8fd86c077a5/2360.jpeg"
    },
    {
      "author": "JAKE BLEIBERG and PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — The impeachment trial of Texas Attorney General Ken Paxton began Tuesday and hurtled Republicans into a reckoning over whether to oust a prominent member of their party after years of alleged corruption or stand with one of former President Donald Trump's biggest defenders.",
      "publishedAt": "2023-09-05T04:18:32Z",
      "title": "Texas AG Ken Paxton pleads not guilty at impeachment trial then leaves as arguments get underway",
      "url": "https://apnews.com/07dd432612e7615ec6221b3411034083",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/291ee0cc403a4988ae29cd7adeab0bb7/1920.jpeg"
    },
    {
      "author": "R.J. RICO",
      "description": "ATLANTA (AP) — Sixty-one people have been indicted in Georgia on racketeering charges following a long-running state investigation into protests against a proposed police and firefighter training facility in the Atlanta area that critics call “Cop City.”",
      "publishedAt": "2023-09-05T17:51:21Z",
      "title": "61 indicted in Georgia on racketeering charges connected to 'Stop Cop City' movement",
      "url": "https://apnews.com/3177a63ac1bd31a1594bed6584e9f330",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b7bc7bd271949af86fadf165bd8ef1c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — A new book about Joe Biden portrays the president as someone whose middle-class upbringing helped foster a resentment of intellectual elitism that shaped his political career and sometimes caused strain with his onetime boss, Harvard-educated Barack Obama.",
      "publishedAt": "2023-09-05T18:32:29Z",
      "title": "New book details Biden-Obama frictions and says Harris sought roles 'away from the spotlight'",
      "url": "https://apnews.com/3f0ab52553f85d9fbd231c6ae1cba78f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20734fcfd7114565b92b0948805bfa1b/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Hollywood is at a standstill. Actors and screenwriters are months into a dual strike. Film sets are dark. But the movies are still coming — or, at least, most of them.",
      "publishedAt": "2023-09-05T13:51:27Z",
      "title": "Fall Movie Preview: Hollywood readies for a season with stars on the sidelines",
      "url": "https://apnews.com/2eb65767ba706514bc3a7cd4c5b84bf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dba596f63dee400da48c269fc464d9d2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}