{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and MELANIE LIDMAN",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Hamas began freeing Israeli hostages Thursday in exchange for more Palestinian prisoners to be released as part of a last-minute deal to extend their cease-fire in Gaza by another day.",
      "publishedAt": "2023-11-30T06:10:08Z",
      "title": "More Israeli hostages freed by Hamas as truce in Gaza lasts another day",
      "url": "https://apnews.com/ea1a8fad4e2f4a394e5427a7c5815d38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/433c7028ee5841a2b5e57f4e3fc17496/1920.jpeg"
    },
    {
      "author": "NANCY BENAC",
      "description": "WASHINGTON (AP) — All these years later, the scene still is almost too bizarre to imagine: a tearful president and his perplexed aide, neither very religious, kneeling in prayer on the floor of a White House bedroom in the waning hours of a shattered presidency.",
      "publishedAt": "2023-11-30T05:04:32Z",
      "title": "Henry Kissinger was a trusted confidant to President Nixon until the bitter, bizarre end",
      "url": "https://apnews.com/d760662fa0b911ed86333c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9835bac5ec674741bd7f3397bed9daad/1920.jpeg"
    },
    {
      "author": "FOSTER KLUG and GEIR MOULSON",
      "description": "TOKYO (AP) — Global leaders paid tribute to former U.S. Secretary of State Henry Kissinger on Thursday, but there was also sharp criticism of the man who remained an influential figure decades after his official service as one of the most powerful diplomats in American history.",
      "publishedAt": "2023-11-30T03:35:01Z",
      "title": "Global leaders pay tribute to Henry Kissinger, but his record also draws criticism",
      "url": "https://apnews.com/4e98e88ae257d21603924651c75a383d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a661416637b4436291ad6c03f71ea6d5/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and TARA COPP",
      "description": "TOKYO (AP) — Japan suspended flights by its Osprey aircraft Thursday, officials said, the day after a U.S. Air Force Osprey based in Japan crashed into the sea during a training mission.",
      "publishedAt": "2023-11-30T02:08:18Z",
      "title": "Japan suspends its Osprey flights after the fatal crash of a US Air Force aircraft",
      "url": "https://apnews.com/be23b708b16a3d3202a944424b7558c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5605b21753f34011ab4364dfb50bbe45/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A New York appeals court Thursday reinstated a gag order that barred Donald Trump from commenting about court personnel after he continually disparaged a law clerk in his New York civil fraud trial.",
      "publishedAt": "2023-11-30T16:06:33Z",
      "title": "Appeals court reinstates gag order that barred Trump from maligning court staff in NY fraud trial",
      "url": "https://apnews.com/15304270ea3f61284a414f938155ae62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e648123a7de74b1eab5ad0454e7406e9/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Russia’s Supreme Court effectively outlawed LGBTQ+ activism on Thursday, the most drastic step against advocates of gay, lesbian and transgender rights in the increasingly conservative country.",
      "publishedAt": "2023-11-30T12:21:35Z",
      "title": "Russia’s Supreme Court effectively outlaws LGBTQ+ activism in a landmark ruling",
      "url": "https://apnews.com/1b8f4cd8708d1c6cf3486c5f27fd7354",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a40f9383bea648359f257d8649286a27/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Pressure to phase out fossil fuels mounted Thursday on the oil company chief who took over fragile international climate negotiations that opened in Dubai amid concerns about what some say are contradictory dual roles.",
      "publishedAt": "2023-11-30T12:42:36Z",
      "title": "Pressure builds to eliminate fossil fuel use as oil executive, under fire, takes over climate talks",
      "url": "https://apnews.com/449f2c427ff24cdf78ce582fcbfbfbc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/083d8d8dc4874b0ab8530d31cd15610e/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and HOLLY RAMER",
      "description": "DES MOINES, Iowa (AP) — Florida Gov. Ron DeSantis and former United Nations Ambassador Nikki Haley are increasingly outsourcing central parts of their campaigns, drawing on the growing urgency of Donald Trump opponents to find a single alternative to the former president.",
      "publishedAt": "2023-11-30T05:14:35Z",
      "title": "Haley and DeSantis are relying more on outside campaign groups with time running out to stop Trump",
      "url": "https://apnews.com/f2128c30b26e064fa42ba9c6004df732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d76f49040fc54ba98b2eeff9c4903e48/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and ASHOK SHARMA",
      "description": "NEW YORK (AP) — An Indian government official directed a plot to assassinate a prominent Sikh separatist leader living in New York City, United States prosecutors said Wednesday as they announced charges against a man they said was part of the thwarted conspiracy.",
      "publishedAt": "2023-11-29T10:24:51Z",
      "title": "An Indian official plotted to assassinate a Sikh separatist leader in New York, US prosecutors say",
      "url": "https://apnews.com/69968608495e33e8ed88a86bff71b381",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98fb5d173d9a442894fe1567c018751d/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and DAVE BRYAN",
      "description": "LONDON (AP) — Shane MacGowan, the boozy, rabble-rousing singer and chief songwriter of The Pogues, who infused traditional Irish music with the energy and spirit of punk, died Thursday, his family said.",
      "publishedAt": "2023-11-30T12:18:01Z",
      "title": "Shane MacGowan, lead singer of The Pogues and a laureate of booze and beauty, dies at age 65",
      "url": "https://apnews.com/5b6f1f1becb575ceffca4ee01b3b12a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/184427cf5b7740caba2617e7e4d93d93/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}