{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops battled Palestinian militants in an urban refugee camp and outside a nearby hospital Tuesday as the army expanded operations across northern Gaza, where residents have been without electricity or reliable access to water, food or other basics for weeks.",
      "publishedAt": "2023-11-21T07:37:00Z",
      "title": "Israeli troops battle militants across north Gaza, which has been without power or water for weeks",
      "url": "https://apnews.com/39f5ae0bdb4e32f0e69115aa43446132",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/802532e04553451694390464c84f3dc4/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Three weeks ago, the Israeli military unveiled a detailed 3D model of Gaza’s Shifa Hospital – showing a series of underground installations that it said was part of an elaborate Hamas command and control center under the territory’s largest health-care center.",
      "publishedAt": "2023-11-20T20:02:17Z",
      "title": "Israel reveals signs of Hamas activity at Shifa, but a promised command center remains elusive",
      "url": "https://apnews.com/a017ba154c816c8d565393917dadd9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c52c1958133461a8626cc6f313d09b7/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — A divided federal appeals court on Monday ruled that private individuals and groups such as the NAACP do not have the ability to sue under a key section of the federal Voting Rights Act, a decision that contradicts decades of precedent and could further erode protections under the landmark 1965 law.",
      "publishedAt": "2023-11-20T21:45:23Z",
      "title": "Federal appeals court deals a blow to Voting Rights Act, ruling that private plaintiffs can't sue",
      "url": "https://apnews.com/00b9c4bb2174aa8077db296c3edf7c79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b69a8781b9224bc9b6c02e9c1e93b325/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Patrick Kennedy, son of Sen. Ted Kennedy and nephew of President John F. Kennedy, remembers being a young state legislator in Rhode Island some 30 years ago and hearing encouraging words from the opposition leader at the time.",
      "publishedAt": "2023-11-21T05:16:42Z",
      "title": "60 years after JFK's death, today's Kennedys choose other paths to public service",
      "url": "https://apnews.com/7a17f5baefe83fc1eddb1025e2e298d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2a87e7d7fed4870a1d6b18fe5094565/2000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — It happens every November, when the cold descends on Kyiv. The change in weather always makes Dmytro Riznychenko think back, and he is overwhelmed by his emotions.“This is where it truly began,\" Riznychenko said, walking through central Kyiv's Independence Square recently, reflecting on the uprising that unleashed a decade of momentous change for Ukraine, eventually leading to the current war with Russia.",
      "publishedAt": "2023-11-21T05:07:51Z",
      "title": "10 years later, a war-weary Ukraine reflects on events that began its collision course with Russia",
      "url": "https://apnews.com/2f73f31a5aec45bd7dbcddae8f72edac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf5eb7c4aa8d490f981fe10dd37d220c/3000.jpeg"
    },
    {
      "author": "UZMI ATHAR, Press Trust of India",
      "description": "NEW DELHI (AP) — Manju Devi suffered in pain for two months last year as she worked on a farm near Delhi, unable to break away from duties that sometimes had her standing for hours in the waist-deep water of a rice paddy, lifting heavy loads in intense heat and spraying pesticides and insecticides.",
      "publishedAt": "2023-11-21T02:02:19Z",
      "title": "Climate change hits women's health harder. Activists want leaders to address it at COP28",
      "url": "https://apnews.com/925aee87531d11837e920b5d47dd5d6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04b3a766041748c2aae084acad96b63f/2750.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — The sun was shining in June 1979 as Rosalynn Carter made her way through an enthusiastic crowd in Laconia, New Hampshire.“She shook my hand!” yelled one delighted participant.",
      "publishedAt": "2023-11-21T05:07:33Z",
      "title": "Rosalynn Carter's advocacy for mental health was rooted in compassion and perseverance",
      "url": "https://apnews.com/c17a5bc89c29f952b0d3f7f48c3b2412",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebae35acc31043e4b05c39cd27eb2db3/2208.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Despite inflation and memories of past holiday travel meltdowns, millions of people are expected to hit airports and highways in record numbers over the Thanksgiving break.The busiest days to fly will be Tuesday and Wednesday as well as the Sunday after Thanksgiving.",
      "publishedAt": "2023-11-21T05:26:29Z",
      "title": "Record crowds are expected to take to the air and roads for Thanksgiving",
      "url": "https://apnews.com/4dc8ec8af36e686c1bc116df5d736562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/740365365c6d4387a3037de838c67903/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and BEATRICE DUPUY",
      "description": "HONOLULU (AP) — A Navy plane flying in rainy weather overshot a runway Monday at a military base in Hawaii and splashed into Kaneohe Bay, but all nine aboard were uninjured, authorities said. The Coast Guard responded, but rescue operations were quickly called off, said Petty Officer Ryan Fisher, a Coast Guard spokesperson.",
      "publishedAt": "2023-11-21T01:01:46Z",
      "title": "Navy plane overshoots runway and ends up in ocean, but all 9 aboard escape unharmed",
      "url": "https://apnews.com/f24da12b2db265a90c475227a511ebe3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e066fbde1eb4f03995ac72f2f9a7130/2847.jpeg"
    },
    {
      "author": "MARTHA IRVINE and DAR YASIN",
      "description": "SAMTSE, Bhutan (AP) — Monsoon rains have finally passed and floods blocking the lone dirt road have retreated enough for a small truck to climb these Himalayan foothills to a gurgling spring. It spews water so fresh that people here call it nectar.",
      "publishedAt": "2023-11-21T05:05:47Z",
      "title": "Precious water: As more of the world thirsts, luxury water becoming fashionable among the elite",
      "url": "https://apnews.com/aaa020587961c992352c19116660cbbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6651cb37536d48d5801a58ec55b482fe/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}