{
  "articles": [
    {
      "author": "MARK J. TERRILL, JOHN ANTCZAK and JULIE WATSON",
      "description": "PALM DESERT, Calif. (AP) — Hilary, the first tropical storm to hit Southern California in 84 years, swept people into swollen rivers, toppled trees onto homes and flooded roadways as the massive system marched northward Monday, prompting flood watches and warnings in more than a half dozen states.",
      "publishedAt": "2023-08-21T05:33:24Z",
      "title": "Hilary drenched deserts and flooded roadways in California. Now it's threatening Oregon and Idaho",
      "url": "https://apnews.com/25c75cba2dc7aea316056effdf913817",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47f2dbed59da41ee9161ec8509521635/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and JILL COLVIN",
      "description": "Donald Trump's bond has been set at $200,000 in the Georgia case accusing the former president of illegally scheming to overturn his 2020 election loss, according to court papers filed Monday. The bond agreement, outlined in a document signed by Fulton County District Attorney Fani Willis and Trump's defense attorneys, also bars Trump from intimidating co-defendants, witnesses or victims in the case — including on social media.",
      "publishedAt": "2023-08-21T20:02:02Z",
      "title": "Donald Trump's bond is set at $200,000 in Georgia case over efforts to overturn 2020 election",
      "url": "https://apnews.com/79dbb26a14b5a4ccfc1472d6d3eacd2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b96471fed774be1917aa22bff9bf30e/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — A federal indictment and one in Georgia charging Donald Trump with lying about the 2020 election to overturn President Joe Biden’s win have done nothing to slow the geyser of election falsehoods flowing from the former president and his supporters.",
      "publishedAt": "2023-08-21T04:08:09Z",
      "title": "Trump and his allies double down on election lies after indictments for trying to undo 2020 results",
      "url": "https://apnews.com/4b2269d68dad3024bd5afa711478505a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26763b2b1eba44a3bde9cbc41cf95524/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Female soldiers face rampant sexism, harassment and other gender-related challenges in male dominated Army special operations units, according to a report Monday, eight years after the Pentagon opened all combat jobs to women.",
      "publishedAt": "2023-08-21T17:19:20Z",
      "title": "Female soldiers in Army special operations face rampant sexism and harassment, military report says",
      "url": "https://apnews.com/1c904cba739b8ba3720827bd9e77f5f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dc6f5adbc7c4c56877de92f90878c5e/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and DANICA KIRKA",
      "description": "LONDON (AP) — A former neonatal nurse convicted of murdering seven babies in her care and trying to kill six others at a hospital in northern England was sentenced Monday to life in prison with no chance of release by a judge who said she was cruel, cunning and callous, and acted with “malevolence bordering sadism.”",
      "publishedAt": "2023-08-21T09:54:12Z",
      "title": "British nurse Lucy Letby imprisoned for life in murders of 7 babies and attempted murders of 6",
      "url": "https://apnews.com/0165654a8afa9db74e97980323f5b0e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a844342f86fb424b88142c8274ae5ddc/3000.jpeg"
    },
    {
      "author": "TJ L’HEUREUX, ADRIENNE WASHINGTON, ALBERT SERNA JR., ANISA SHABIR and ISAAC STONE SIMONELLI, The Howard Center for Investigative Journalism and Arizona Center for Investigative Reporting",
      "description": "GRAND RAPIDS, Mich. (AP) — Against the background hum of the convention center, Dar Leaf settled into a club chair to explain the sacred mission of America’s sheriffs, his bright blue eyes and warm smile belying the intensity of the cause.",
      "publishedAt": "2023-08-21T16:56:11Z",
      "title": "A right-wing sheriffs group that challenges federal law is gaining acceptance around the country",
      "url": "https://apnews.com/5568cd0b6b27680a28de8a098ed14210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b83b90d1e0a45a2bde095701a25cc3f/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — House conservatives in a group known as the Freedom Caucus have unveiled a list of demands that they want included in a stopgap spending measure to keep the federal government running after the end of September.",
      "publishedAt": "2023-08-21T18:05:15Z",
      "title": "Group of House conservatives unveils demands to support spending bill and avoid shutdown",
      "url": "https://apnews.com/8d2d2296cb1680dc1bf945d726da178f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b846dee0435454d878c980f159e0d59/3000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "MARION, Kan. (AP) — The initial online search of a state website that led a central Kansas police chief to raid a local weekly newspaper was legal, a spokesperson for the agency that maintains the site said Monday, as the newspaper remains under investigation.",
      "publishedAt": "2023-08-21T17:14:24Z",
      "title": "The initial online search spurring a raid on a Kansas paper was legal, a state agency says",
      "url": "https://apnews.com/ce9a8b98f05e2c4faef14e7ad6948316",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b07b585ce0546039d25959405d57004/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Just five years ago, a price-conscious auto shopper in the United States could choose from among a dozen new small cars selling for under $20,000. Now, there’s just one: The Mitsubishi Mirage.",
      "publishedAt": "2023-08-21T09:00:31Z",
      "title": "Looking for a new car under $20,000? Good luck. Your choice has dwindled to just one vehicle",
      "url": "https://apnews.com/e33932cfa77a799329f278dfb120c30d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26d0fccb7c0d48d29f2097796725dc32/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "JOHANNESBURG (AP) — Vladimir Putin will be the odd one out when leaders from the BRICS economic bloc of Brazil, Russia, India, China and South Africa meet in Johannesburg this week.While all the others are set to attend the meetings in person, Putin will dial in on a video call.",
      "publishedAt": "2023-08-21T17:51:59Z",
      "title": "Putin was meant to be at a summit in South Africa this week. Why was he asked to stay away?",
      "url": "https://apnews.com/963108da4d389f8e1e7775c9e002b5f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27b8fd1c0a214f6f869f37476a342916/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}