{
  "articles": [
    {
      "author": "ALEXA ST. JOHN",
      "description": "DETROIT (AP) — The first-ever tornado emergency in Michigan was issued Tuesday, one of many called across the country in recent weeks as severe weather tears through states in the Plains and Midwest.",
      "publishedAt": "2024-05-08T16:35:27Z",
      "title": "What is a tornado emergency and how is it different from a warning or a watch?",
      "url": "https://apnews.com/35ffc2076cf09dd19ba38865f1c6df15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8a413ad1a2c439b9d07562920a9dac2/1920.jpeg"
    },
    {
      "author": "MENELAOS HADJICOSTIS and SAM MEDNICK",
      "description": "NICOSIA, Cyprus (AP) — A shipment of humanitarian aid has left a port in Cyprus and is on its way to the U.S-built pier in Gaza, the first delivery to the newly built ramp, Cyprus’ foreign minister said Thursday.",
      "publishedAt": "2024-05-09T10:53:43Z",
      "title": "First shipment of aid to the US-built floating pier in Gaza departs from Cyprus",
      "url": "https://apnews.com/c2f2545739b7c9499476e6b4cfa9b5df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1eaa2b3ea974a1fb214ec66d486ba65/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden said Wednesday that he would not supply offensive weapons that Israel could use to launch an all-out assault on Rafah — the last major Hamas stronghold in Gaza — over concern for the well-being of the more than 1 million civilians sheltering there.",
      "publishedAt": "2024-05-08T15:40:28Z",
      "title": "Biden says US won't supply weapons for Israel to attack Rafah, in warning to ally",
      "url": "https://apnews.com/eed365ebef0477ba74bf9848cacae4f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0c3c5fe4bb14477b16b393101bc65a7/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — Stormy Daniels will return to the witness stand Thursday in Donald Trump's hush money trial as the defense tries to undermine the credibility of the porn actor's salacious testimony about their alleged sexual encounter and the money she was paid to keep quiet.",
      "publishedAt": "2024-05-09T04:03:49Z",
      "title": "Defense attacks Stormy Daniels' credibility as she returns to the stand in Trump's hush money trial",
      "url": "https://apnews.com/d8be160e53c8050bf788d7772f483a64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbbb48db796247e9af7b1cfe268a664f/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Hardline Rep. Marjorie Taylor Greene tried and failed in a brazen push to oust House Speaker Mike Johnson, but the resounding rejection by Republicans and Democrats tired of the turmoil does not guarantee an end to the GOP chaos.",
      "publishedAt": "2024-05-09T04:08:52Z",
      "title": "House rejects Rep. Marjorie Taylor Greene's effort to oust Speaker Mike Johnson, but chaos lingers",
      "url": "https://apnews.com/11b3f1fa0c3b18a87d6ef797da739972",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/001d550145194fe884dda4e0c59d8f20/1920.jpeg"
    },
    {
      "author": "GEORGE WALKER IV, JOEY CAPPELLETTI and ED WHITE",
      "description": "COLUMBIA, Tenn. (AP) — Forecasters warned a wave of dangerous storms in the U.S. could wash over parts of the South early Thursday, a day after severe weather with damaging tornadoes and large hail killed at least three people in the region.",
      "publishedAt": "2024-05-09T05:25:16Z",
      "title": "Storms threaten the South as a week of deadly weather punches through the US",
      "url": "https://apnews.com/a7c0feb2b60b4c568ca53f412d8eb605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ef9d3971341403388902e914d3ac368/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The rate of guns stolen from cars in the U.S. has tripled over the last decade, making them the largest source of stolen guns in the country, an analysis of FBI data by the gun safety group Everytown found.",
      "publishedAt": "2024-05-09T10:22:05Z",
      "title": "Guns are being stolen from cars at triple the rate they were 10 years ago, a report finds",
      "url": "https://apnews.com/66316ff1933dad8df984803fca377775",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2398bdc13ac4753b60f893097034d7c/1277.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia on Thursday wrapped itself in patriotic pageantry for Victory Day, as President Vladimir Putin celebrated the defeat of Nazi Germany in World War II by hailing his forces fighting in Ukraine and blasting the West for fueling conflicts around the world.",
      "publishedAt": "2024-05-09T04:11:01Z",
      "title": "Russia celebrates victory in World War II as Putin accuses the West of fueling global conflicts",
      "url": "https://apnews.com/ba00d11cdc76ad243921329d7742600c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e089ef831b94db884eb6461153adb1b/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — Six months into an offensive against Myanmar ’s military government, opposition forces have made massive gains, but civilian casualties are rising sharply as regime troops increasingly turn toward scorched-earth tactics in the Southeast Asian country's bitter civil war.",
      "publishedAt": "2024-05-09T04:14:53Z",
      "title": "Civilian casualties rise in Myanmar's civil war as resistance forces tighten noose around military",
      "url": "https://apnews.com/a15d8cd60bcc10c1f2dd9b7a8e576bf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a10166247334adba9eb86ee8684c9d5/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican crosses a key milestone Thursday in the runup to its 2025 Jubilee with the promulgation of the official decree establishing the Holy Year. It's a once-every-quarter-century event that is expected to bring some 32 million pilgrims to Rome and has already brought months of headaches to Romans.",
      "publishedAt": "2024-05-09T04:10:50Z",
      "title": "Holy Year or holy mess, Vatican and Rome begin dash to 2025 Jubilee with papal bull, construction",
      "url": "https://apnews.com/20189e83df9dd8eb5312d5e96e076af2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53ad9acd9d7c466385320f81a7015266/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}