{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike killed 20 people in central Gaza, mostly women and children, and fighting raged across the north on Sunday as Israel's leaders aired divisions over who should govern Gaza after the war, now in its eighth month.",
      "publishedAt": "2024-05-19T09:18:40Z",
      "title": "An airstrike kills 20 in central Gaza and fighting rages as Israel's leaders air wartime divisions",
      "url": "https://apnews.com/d6ea9776d293130d52d308abd284556e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44da1fb7b1ed44e4939fcff082bdddb0/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and BILL BARROW",
      "description": "ATLANTA (AP) — President Joe Biden is delivering the commencement address at Morehouse College on Sunday, a key opportunity for an election-year appearance before a Black audience but one that also could directly expose him to the anger that some of these and other students across the country have been expressing over his staunch support for Israel in its war against Hamas militants in Gaza.",
      "publishedAt": "2024-05-19T03:25:39Z",
      "title": "Biden will deliver Morehouse commencement address during a time of tumult on US college campuses",
      "url": "https://apnews.com/e42d08d7431bf9218afa90177efa3f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86c15fc888c940de81f3f27ff5f5f190/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "DALLAS (AP) — Former President Donald Trump urged gun owners to vote in the 2024 election as he addressed thousands of members of the National Rifle Association, which officially endorsed him just before Trump took the stage at their annual meeting in Texas on Saturday.",
      "publishedAt": "2024-05-18T04:11:44Z",
      "title": "Trump receives NRA endorsement as he vows to protect gun rights",
      "url": "https://apnews.com/de03ae7672f2b1e213da6acbf25df378",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a2ca82fe2e14cb4b345ef88ff87ed13/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Dressed in black and white, the crowd of angry teenagers squeezed into a narrow street in Haiti’s capital.They stopped in front of a cemetery and hoisted a coffin onto their shoulders, tears rolling down some faces.",
      "publishedAt": "2024-05-19T04:01:51Z",
      "title": "As killings surge, Haitians struggle to bury loved ones and find closure in violent capital",
      "url": "https://apnews.com/3f616868b7bef8f7f40f036198e332a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a7488a3e6e3405aa14a8b7022234455/3000.jpeg"
    },
    {
      "author": "MARTÍN ADAMES ALCÁNTARA",
      "description": "SANTO DOMINGO, Dominican Republic (AP) — Voters in the Dominican Republic are casting ballots Sunday in general elections likely to reinforce the government's crackdown on its shared border with Haiti and the hundreds of thousands of people fleeing the violence-stricken nation.",
      "publishedAt": "2024-05-19T04:01:17Z",
      "title": "Dominicans vote in general elections with eyes on crisis in neighboring Haiti",
      "url": "https://apnews.com/59d10ff3d422842c5f3988b34a39588a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12f972c4a998421a8e6cf50c13c65cea/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — A county judge could rule as early as Monday on Ohio's law banning virtually all abortions, a decision that will take into consideration the decision by voters to enshrine reproductive rights in the state constitution.",
      "publishedAt": "2024-05-19T06:06:04Z",
      "title": "Ohio voters approved reproductive rights. Will the state's near-ban on abortion stand?",
      "url": "https://apnews.com/ff78c39a3919af7c41a2ce3fe4df9738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/929655413be24e18b7b99879a9488cfb/3000.jpeg"
    },
    {
      "author": "LEKAN OYEKANMI DAVID J. PHILLIP and KEN MILLER",
      "description": "HOUSTON (AP) — As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and scorching temperatures that could pose health risks.",
      "publishedAt": "2024-05-18T04:12:46Z",
      "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm",
      "url": "https://apnews.com/86643a6d7decd28e971774e03b52e51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbfd9fefab2c4251b79a7a6b8644c7eb/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russia said it shot down some 60 drones and several missiles over its territory while Ukraine in turn said it destroyed over 30 Russian drones. At least four people were reported killed in an attack on the outskirts of Kharkiv on Sunday as Russia pushed ahead with its renewed offensive in Ukraine's war-ravaged northeast.",
      "publishedAt": "2024-05-19T08:10:18Z",
      "title": "Ukraine and Russia exchange drone attacks while Russia continues its push in the east",
      "url": "https://apnews.com/c6d7c9bb699bd48d4634be6259244a0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48d40f111cc646aebc4d547c43b65a6d/1920.jpeg"
    },
    {
      "author": "CHRISTINA MALKIA and CHINEDU ASADU",
      "description": "KINSHASA, Congo (AP) — Congo's army says it has “foiled a coup” early Sunday morning and arrested the perpetrators, including several foreigners, following a shootout between armed men in military uniform and guards of a close ally of Congo's president that left three people dead in the capital, Kinshasa.",
      "publishedAt": "2024-05-19T08:07:13Z",
      "title": "Congolese army says it has foiled a coup. Self-exiled opposition leader threatens president",
      "url": "https://apnews.com/1a148e35f0cbbae14b2101413f788708",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "RIYADH, Saudi Arabia (AP) — Oleksandr Usyk has been shorter, lighter and older than all of his opponents since he moved up to the heavyweight division.Usyk's heart and skill are enormous, and he overcame a major size disadvantage against Tyson Fury to become the world's first undisputed heavyweight boxing champion in 24 years.",
      "publishedAt": "2024-05-18T23:50:41Z",
      "title": "Usyk beats Fury by split decision to become the first undisputed heavyweight champion in 24 years",
      "url": "https://apnews.com/3539d0cb1203895291c114bf642e95a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c687db8035b24f959e7e8aecac28f816/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}