{
  "articles": [
    {
      "author": "Sam Mednick",
      "description": "Israel has identified the remains of Eliyahu Margalit, a 76-year-old hostage handed over by Hamas. Margalit was abducted on October 7, 2023, during Hamas' attack on Israel. Israel’s Prime Minister’s office said Saturday his family has been notified. This marks the 10th returned hostage body since a ceasefire began over a week ago. Hamas has handed over an 11th body, but it wasn't a hostage. The ceasefire agreement includes the return of all hostages’ bodies, totaling 28. Meanwhile, aid into Gaza remains limited, with only 339 trucks offloaded since the ceasefire began, despite an agreement allowing 600 trucks daily. The humanitarian situation in Gaza remains dire.",
      "publishedAt": "2025-10-18T06:38:10Z",
      "title": "Israel identifies the remains of another hostage",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-18-2025-4d13aaceec91c360449dd5fa737b192b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1c82a4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F1d%2Fb10f04968b2ee66aacce923989e7%2Fa7aef0b7232e42aaaf3791541c41d02d"
    },
    {
      "author": "Konstantin Toropin",
      "description": "The two survivors of an American military strike on a suspected drug-carrying vessel in the Caribbean will be sent to Ecuador and Colombia, their home countries. That's according to a social medial post by President Donald Trump. The military rescued the pair after striking a submersible vessel Thursday, in what was at least the sixth such attack since early September. The repatriation avoids questions for the Trump administration about what the legal status of the two would have been in the U.S. justice system.",
      "publishedAt": "2025-10-18T18:42:07Z",
      "title": "Trump says US will repatriate survivors of strike on suspected drug vessel",
      "url": "https://apnews.com/article/pentagon-military-strikes-drugs-caribbean-ecuador-colombia-c1d4c025e1dfe21cc7ee67d7aa4e05bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/798bfd4/2147483647/strip/true/crop/5128x2885+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2Fbe%2F405a0a089601b6d198e3171c3d75%2Fa4e111a6c34d4ae0a8c27180dacbbff9"
    },
    {
      "author": "Lisa Mascaro, Safiyah Riddle, Kevin Freking",
      "description": "Protesting the direction of the country under President Donald Trump, people will gather Saturday in the nation’s capital and communities across the U.S. They're holding “No Kings” demonstrations, or what the president’s Republican Party is calling “Hate America” rallies. This is the third mass mobilization since Trump’s return to the White House and it's expected to be the largest. It comes against the backdrop of a government shutdown that not only has closed federal programs and services, but is testing the core balance of power as organizers warn of a slide toward American authoritarianism. Trump himself is away from Washington at his Mar-a-Lago home in Florida.",
      "publishedAt": "2025-10-18T04:07:29Z",
      "title": "'No Kings' protests against Trump being held nationwide",
      "url": "https://apnews.com/article/no-kings-rallies-demonstrations-trump-4baa5de2fab057a0e6ab726f5d7747fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e2c690/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F43%2Fa76d86eb93e9af1bac59d3e28d2a%2F69611828b2c74b688fd7a14a0a4c59f3"
    },
    {
      "author": "Kevin Freking",
      "description": "The federal government shutdown is approaching the second longest on record and there's no end in sight. Some lawmakers predict it could surpass the 35-day shutdown from President Donald Trump’s first term. The nation’s 1.3 million active-duty service members have gotten a temporary reprieve. But hundreds of thousands of federal civilian employees are being furloughed and facing financial stress. The travel economy is taking a big hit with tourist sites such as Smithsonian museums in the nation's capital closed. There have been air controller shortages in some cities and flight delays. The longer the shutdown lasts, the more it could be a drag on the economy.",
      "publishedAt": "2025-10-18T12:30:14Z",
      "title": "What the government shutdown means for workers and the economy",
      "url": "https://apnews.com/article/shutdown-trump-furloughs-firings-economy-federal-workers-efced4c32282087c8c53aeab535230a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8def0ae/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F9c%2Fc256e9d193b8485846ed77cc1f00%2F1af57ec6a1bb4856b090a6a9dac677de"
    },
    {
      "author": "Christopher Megerian",
      "description": "The U.S. State Department says it has “credible reports” that Hamas could violate the ceasefire with an attack on Palestinian civilians in Gaza. If the attack takes place, it “would constitute a direct and grave violation” of the agreement forged by President Donald Trump to end the two-year war between Israel and Hamas, according to government officials. No further details were disclosed about the potential attack. The State Department said that “should Hamas proceed with this attack, measures will be taken to protect the people of Gaza and preserve the integrity of the ceasefire.”",
      "publishedAt": "2025-10-18T22:14:31Z",
      "title": "US warns Hamas planning attack on Palestinian civilians in apparent violation of Gaza ceasefire",
      "url": "https://apnews.com/article/gaza-ceasefire-attack-mideast-wars-us-9b08f2f7a81ecfe5b430f18638d3fd86",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e0ee50/2147483647/strip/true/crop/5451x3066+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F83%2F76c84a2b1c4f21fcefbd5bc9e408%2Fe9d2b15e78224266a528166023cf9d3e"
    },
    {
      "author": "Paul Wiseman, Gisela Salomon",
      "description": "President Donald Trump’s sweeping crackdown on immigration is throwing foreigners out of work and shaking the American economy and job market. And it’s happening at a time when hiring is already deteriorating amid uncertainty over Trump’s erratic trade policies. Immigrants do jobs – cleaning houses, picking cotton, painting fences – that most native-born Americans won’t. They also bring the technical skills and entrepreneurial energy that have helped make the United States the world’s economic superpower. Trump is attacking immigration at both ends of spectrum, deporting low-wage laborers and discouraging skilled foreigners from bringing their talents to the United States.",
      "publishedAt": "2025-10-18T13:04:55Z",
      "title": "Trump's immigration crackdown weighs heavy on the US labor market",
      "url": "https://apnews.com/article/immigration-crackdown-american-economy-e00e12257737680ba55c35c3bc25768f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7fa344/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fd4%2F4459a88385ca8d5a751b47c1cba2%2Faed86174b1a740919c64f41ddd754b02"
    },
    {
      "author": "The Associated Press",
      "description": "Protesting the country's direction under President Donald Trump, thousands of people brought a street party vibe to the nation’s capital and communities across the U.S. for “ No Kings ” demonstrations, which the president’s Republican Party is calling “Hate America” rallies.",
      "publishedAt": "2025-10-18T17:19:56Z",
      "title": "Photos show ‘No Kings’ rallies against Trump across the US and in Europe",
      "url": "https://apnews.com/photo-gallery/photos-no-kings-marches-trump-protests-76f379bc4e7e2a921a15a8ad6d9d5f66",
      "urlToImage": "https://dims.apnews.com/dims4/default/643eff8/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F35%2Fa15f6fc81bb4fc596d1fad6ae327%2Fa91281ee836342e8a4e847881f6b9560"
    },
    {
      "author": "Jon Gambrell",
      "description": "The British military says a ship caught fire in the Gulf of Aden off Yemen after being struck by a projectile. Saturday's incident comes as Yemen’s Houthi rebels have been attacking ships through the Red Sea corridor. However, the rebels did not immediately claim the attack, though it can take them hours or even days to do so. The maritime security firm Ambrey described the ship as a tanker that was “en route from Sohar, Oman, to Djibouti.” It said radio traffic suggested the crew was preparing to abandon ship and a search-and-rescue effort was underway.",
      "publishedAt": "2025-10-18T11:42:10Z",
      "title": "British military says ship ablaze after being struck off the coast of Yemen in the Gulf of Aden",
      "url": "https://apnews.com/article/yemen-ship-gulf-of-aden-houthis-25543875a66516c99ec937952542972f",
      "urlToImage": "https://dims.apnews.com/dims4/default/708d3f7/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F7f%2Fdb0bc2bf09066e1a96e8d358b060%2Fbfbffc951a894697859af0b5ede78751"
    },
    {
      "author": "Mike Catalini, Adriana Gomez Licon",
      "description": "Jack Ciattarelli has been endorsed by Donald Trump in next month's New Jersey governor's election and is a strong supporter of the Republican president and his agenda. But the former business owner and state legislator is also diverging Trump on the key issue of immigration. Ciattarelli says he'd back a “pathway to recognition” for some people who are living in New Jersey illegally. Ciattarelli is hoping to make inroads with Latino voters. It's an important group of voters in the November election against Democrat Mikie Sherrill, a four-term congresswoman.",
      "publishedAt": "2025-10-18T13:51:38Z",
      "title": "GOP nominee for NJ governor puts some distance from Trump on immigration",
      "url": "https://apnews.com/article/new-jersey-governor-immigration-ciattarelli-trump-sherrill-4802fd86c36b7d9d0e804efd6368ed05",
      "urlToImage": "https://dims.apnews.com/dims4/default/571b4d9/2147483647/strip/true/crop/4529x2548+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F4b%2F6bf94fba70b23eb9c46f0ba7eb08%2Ffd1bae4d4c78478e8acf6d98fef3a4a3"
    },
    {
      "author": "Danica Kirka",
      "description": "Prince Andrew has been banished from the royal whirl after emails emerged this week showing that he had remained in contact with the convicted sex offender Jeffrey Epstein longer than he previously admitted. The House of Windsor has finally moved to insulate the monarchy from years of tawdry headlines about Andrew’s dodgy friends and suspicious business deals. Buckingham Palace on Friday released a statement from Andrew saying that he had agreed to give up use of his last remaining royal titles so that continued allegations about him “don’t distract from the work of His Majesty.”",
      "publishedAt": "2025-10-18T10:10:44Z",
      "title": "Prince Andrew gives up royal titles over Epstein scandal",
      "url": "https://apnews.com/article/prince-andrew-charles-epstein-chinese-spy-91c4bec9a5cf3de8fcb16f9c1fe52e60",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c10ed5/2147483647/strip/true/crop/4362x2454+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F98%2F0a656dbfde560f18415cad80fbc1%2Fb0a3680f9ace40a4862f2a2a508030d0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}