{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops battling Hamas militants encircled Gaza City on Thursday, the military said, as the Palestinian death toll rose above 9,000.",
      "publishedAt": "2023-11-02T07:17:05Z",
      "title": "Pressure rises on Israel to pause fighting and ease siege as battles intensify near Gaza City",
      "url": "https://apnews.com/6a398d4aeba979aef24960efc31eb772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e334679a5d254e9289abcb648a3ba8c1/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — More than 3,600 Palestinian children were killed in the first 25 days of the war between Israel and Hamas, according to Gaza's Hamas-run Health Ministry.",
      "publishedAt": "2023-11-01T21:13:20Z",
      "title": "‘A curse to be a parent in Gaza’: More than 3,600 Palestinian children killed in just 3 weeks of war",
      "url": "https://apnews.com/4a352398b32887e60a658e0270f0a021",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/315ca6cb89214439a772464cfef936bc/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The House approved a nearly $14.5 billion military aid package Thursday for Israel, a muscular U.S. response to the war with Hamas but also a partisan approach by new Speaker Mike Johnson that poses a direct challenge to Democrats and President Joe Biden.",
      "publishedAt": "2023-11-02T17:39:02Z",
      "title": "House approves nearly $14.5 billion in military aid for Israel. Biden vows to veto the GOP approach",
      "url": "https://apnews.com/b7bfe528b12ac5954cfd5c034f11320d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c23227fb51e40d5a88cb55b92383670/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — FTX founder Sam Bankman-Fried’s spectacular rise and fall in the cryptocurrency industry — a journey that included his testimony before Congress, a Super Bowl advertisement and dreams of a future run for president — hit rock bottom Thursday when a New York jury convicted him of fraud for stealing at least $10 billion from customer and investors.",
      "publishedAt": "2023-11-02T19:17:22Z",
      "title": "FTX founder Sam Bankman-Fried convicted of defrauding cryptocurrency customers",
      "url": "https://apnews.com/baa4c94f2c4237c860475ff92e6bcf42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3288d50261ea4b128dc7946e86eb5c93/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Eric Trump, one of two sons entrusted to run Donald Trump’s real estate empire, swore Thursday that he was never involved with financial statements that New York state lawyers say fraudulently puffed up the ex-president’s wealth and the worth of the family business.",
      "publishedAt": "2023-11-02T16:04:56Z",
      "title": "Eric Trump testifies he wasn’t aware of dad’s financial statements, but emails show some involvement",
      "url": "https://apnews.com/c2f546361ce3b5f0bdcf2360320c6060",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c443d76c5a934799b12e0fe898ca3ed7/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and NICHOLAS RICCARDI",
      "description": "ST. PAUL, Minn. (AP) — Minnesota Supreme Court justices appeared skeptical Thursday that states have the authority to block former President Donald Trump from the ballot, with some suggesting that Congress is best positioned to decide whether his role in the 2021 U.S.",
      "publishedAt": "2023-11-02T04:17:06Z",
      "title": "Minnesota justices appear skeptical that states should decide Trump's eligibility for the ballot",
      "url": "https://apnews.com/5cb50c1ee6432efe72fd643c31dec474",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/747cb4f8d52b40e5b119d1de75aaac56/1920.jpeg"
    },
    {
      "author": "DAVID SHARP and LINDSAY WHITEHURST",
      "description": "PORTLAND, Maine (AP) — Across the nation, much of the debate around gun rights and restrictions centers on mental health. Many advocates on both sides agree that getting people with serious mental health struggles into treatment, and preventing people who are dangerous from accessing guns, is key to preventing mass shootings.",
      "publishedAt": "2023-11-02T18:53:53Z",
      "title": "Maine mass shooting puts spotlight on a complex array of laws, and a series of missed chances",
      "url": "https://apnews.com/0e908f5df6a663b1f5f8f20503bab0b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fb961f1008e44828b0fcc7e27256039/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and TRAVIS LOLLER",
      "description": "MEMPHIS, Tenn. (AP) — A former Memphis police officer pleaded guilty Thursday in the fatal beating of Tyre Nichols in exchange for prosecutors recommending a 15-year sentence, becoming the first of five officers charged in the case to admit guilt.",
      "publishedAt": "2023-11-02T16:29:23Z",
      "title": "Former Memphis police officer pleads guilty to federal charges in Tyre Nichols’ death",
      "url": "https://apnews.com/54495720ccd302067cda9539678aa0eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c1f0ee1e0334969afa62ca100c3f292/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE and MATTHEW PERRONE",
      "description": "NEW YORK (AP) — Fewer high school students are vaping this year, the government reported Thursday.In a survey, 10% of high school students said they had used electronic cigarettes in the previous month, down from 14% last year.",
      "publishedAt": "2023-11-02T17:07:17Z",
      "title": "Vaping by high school students dropped this year, says US report",
      "url": "https://apnews.com/d1f44bd3d8df6960215a14454f5e2e6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5016f495ca594f2f8c04889ed04ffe7b/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — The final Beatles recording is here.Titled “Now and Then,” the almost impossible-to-believe track is four minutes and eight seconds of the first and only original Beatles recording of the 21st century.",
      "publishedAt": "2023-11-02T14:06:37Z",
      "title": "Listen to the last new Beatles song with John, Paul, George, Ringo and AI tech: 'Now and Then'",
      "url": "https://apnews.com/fbce70071b4624f0d90bd18347f20fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f950a708724e56a0ad320c630572d3/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}