{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — More than a million people have fled their homes in the besieged Gaza Strip in the past week as water supplies dwindle and hospitals warn they are on the verge of collapse, while the enclave’s population waits for an expected Israel invasion that seeks to eliminate Hamas’ leadership after its deadly attack.",
      "publishedAt": "2023-10-16T03:24:13Z",
      "title": "Palestinians scramble to find food, safety and water as Israeli ground invasion looms",
      "url": "https://apnews.com/781b3c63af4ae6e51c313a68f314e66d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6564f860cac409abf2a1265330e81e3/1920.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — A 71-year-old Illinois man accused of fatally stabbing a 6-year-old boy and seriously wounding a 32-year-old woman was charged with a hate crime Sunday. Police allege he singled out the victims because of their Islamic faith and as a response to the war between Israel and Hamas.",
      "publishedAt": "2023-10-15T20:33:01Z",
      "title": "Man killed Muslim boy and wounded woman in hate crime motivated by Israeli-Hamas war, police say",
      "url": "https://apnews.com/5135dea218326d6e639a996564d9369e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b191c991d5ac4566bf4e3d0fb3fc78f7/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GONZALO SOLANO",
      "description": "QUITO, Ecuador (AP) — Daniel Noboa, an inexperienced politician and an heir to a fortune built on the banana trade, won Ecuador’s presidential runoff election Sunday held amid unprecedented violence that even claimed the life of a candidate.",
      "publishedAt": "2023-10-15T04:06:33Z",
      "title": "Daniel Noboa, heir to banana fortune, wins Ecuador’s presidential runoff election",
      "url": "https://apnews.com/65a9d0e3b3e525fac39e02a7d2e0b89c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b8373fb9ead433daced8cce8b0da413/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Russian President Vladimir Putin is expected to meet this week with Chinese leaders in Beijing on a visit that underscores China’s economic and diplomatic support for Moscow during its war in Ukraine.",
      "publishedAt": "2023-10-16T01:56:43Z",
      "title": "Putin's visit to Beijing underscores China’s economic and diplomatic support for Russia",
      "url": "https://apnews.com/139930a92289b7d34ce840bdfe531259",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f31beb1759504bf8a2824df0dc561464/3000.jpeg"
    },
    {
      "author": "MONIKA SCISLOWSKA and VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Polish opposition leader Donald Tusk declared the beginning of a new era for his country after opposition parties appeared to have won enough votes in Sunday's parliamentary election to oust the governing nationalist conservative party.",
      "publishedAt": "2023-10-15T05:24:43Z",
      "title": "Polish opposition leader Tusk declares win after exit poll shows ruling conservatives lose majority",
      "url": "https://apnews.com/720f7b81838c33ccb2865fb3bc6e0414",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eff3a0b547324d438bcbe0b0d50f997e/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Children take their places at folding tables on a church patio several miles from where their school burned down. Plastic tubs hold brand new textbooks quickly shipped from a publisher.",
      "publishedAt": "2023-10-15T04:28:30Z",
      "title": "Schools near a Maui wildfire burn zone are reopening. Parents wrestle with whether to send kids back",
      "url": "https://apnews.com/eb727f3d5e7345d098777708071716bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f6df1c30b3443395b69a37450fb965/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "The medicine in the diabetes drug Mounjaro helped people with obesity or who are overweight lose at least a quarter of their body weight, or about 60 pounds on average, when combined with intensive diet and exercise, a new study shows.",
      "publishedAt": "2023-10-15T16:05:00Z",
      "title": "Drug used in diabetes treatment Mounjaro helped dieters shed 60 pounds, study finds",
      "url": "https://apnews.com/ac4151fdfcd6ac17f502d1a14af4fff5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9981d2ee43f4ea09844e53d99dda45d/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Another 6.3 magnitude earthquake struck part of western Afghanistan on Sunday after thousands of people died and entire villages were flattened by devastating quakes a week earlier.",
      "publishedAt": "2023-10-15T04:38:45Z",
      "title": "Another powerful earthquake shakes quake-devastated region in western Afghanistan",
      "url": "https://apnews.com/8f6055342900e320ec5a5e4ea898399a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4eb335aa4dc4801a7987d43ed8c5e7c/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Suzanne Somers, the effervescent blonde actor known for playing Chrissy Snow on the television show “Three’s Company” and who became an entrepreneur and New York Times best-selling author, has died.",
      "publishedAt": "2023-10-15T20:33:06Z",
      "title": "Suzanne Somers, of ‘Three’s Company,’ dies at 76",
      "url": "https://apnews.com/e05255caa8da653f2d388a3da6b607a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a955b24d141f46adaefd3be9e49721d1/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Washington moved up to No. 5 on Sunday in The Associated Press college football poll, the Huskies' best ranking in six years, after a thrilling victory against Oregon and unbeaten Air Force was ranked for the first time since 2019.",
      "publishedAt": "2023-10-15T18:06:45Z",
      "title": "AP Top 25: Washington into top 5 for 1st time in 6 years. Air Force ranked for 1st time since 2019",
      "url": "https://apnews.com/1d8fb56c9314dca48c4938310faf7b2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d31305485ef84b67b43142dae4b7c3b2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}