{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A jury of 12 people was seated Thursday in former President Donald Trump’s history-making hush money trial, propelling the proceedings closer to opening statements and the start of weeks of dramatic testimony.",
      "publishedAt": "2024-04-18T04:07:01Z",
      "title": "12 jurors have been picked for Donald Trump's hush money trial. Selection of alternates is ongoing",
      "url": "https://apnews.com/b514cb52bb31a82579cb827c40166173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7bd62fc883a40f2a4496783d57bf21b/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The judge in Donald Trump's hush money trial ordered the media on Thursday not to report on where potential jurors have worked and to be careful about revealing information about those who will sit in judgment of the former president.",
      "publishedAt": "2024-04-18T22:12:07Z",
      "title": "Judge in Trump case orders media not to report where potential jurors work",
      "url": "https://apnews.com/f858be6648fa2df7d2ab69efd30a524c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d02a7f82d8294b14b1772267858373e1/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — House congressional leaders were toiling Thursday on a delicate, bipartisan push toward weekend votes to approve a $95 billion package of foreign aid for Ukraine, Israel and Taiwan, as well as several other national security policies at a critical moment at home and abroad.",
      "publishedAt": "2024-04-18T18:49:38Z",
      "title": "House leaders toil to advance Ukraine and Israel aid. But threats to oust speaker grow",
      "url": "https://apnews.com/21cc09d310a33d1d8ca88eadea896a36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d9d65a143124a1e8b638fe5a71ee018/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN, SUSAN HAIGH, TRÂN NGUYỄN and BECKY BOHRER",
      "description": "DENVER (AP) — Artificial intelligence is helping decide which Americans get the job interview, the apartment, even medical care, but the first major proposals to reign in bias in AI decision making are facing headwinds from every direction.",
      "publishedAt": "2024-04-18T20:47:45Z",
      "title": "First major attempts to regulate AI face headwinds from all sides",
      "url": "https://apnews.com/58eab95d279648e759f9099ca4249f00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7d66dc2249943bca667eae7b205e0ce/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United States vetoed a widely backed U.N. resolution on Thursday that would have paved the way for full United Nations membership for Palestine, a goal the Palestinians have long sought.",
      "publishedAt": "2024-04-18T19:21:36Z",
      "title": "US vetoes widely supported UN resolution backing full UN membership for Palestine",
      "url": "https://apnews.com/8d8ad60d8576b5ab9e70d2f8bf7e2881",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a16fbb3ebb714688961b7441a56cb150/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — The U.S. and U.K. on Thursday imposed a new round of sanctions on Iran as concern grows that Tehran’s unprecedented attack on Israel could fuel a wider war in the Middle East.",
      "publishedAt": "2024-04-18T13:33:18Z",
      "title": "US and UK issue new sanctions on Iran in response to Tehran's weekend attack on Israel",
      "url": "https://apnews.com/f031a8bbcc54734a2eac152b36859ee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97e048b449e44964adbfcc8681d86a19/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and HALELUYA HADERO",
      "description": "WASHINGTON (AP) — Legislation that could ban TikTok in the U.S. if its China-based owner doesn’t sell its stake won a major boost late Wednesday when House Republican leaders included it in a package of bills that would send aid to Ukraine and Israel.",
      "publishedAt": "2024-04-18T17:28:36Z",
      "title": "Legislation that could force a TikTok ban revived as part of House foreign aid package",
      "url": "https://apnews.com/d88d4623d678ac8688bcd75008457899",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6cc337e10254710aaf9fcf82ea6975c/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — New York police removed a pro-Palestinian protest encampment at Columbia University on Thursday and arrested more than 100 demonstrators, including the daughter of a prominent Minnesota congresswoman.",
      "publishedAt": "2024-04-18T20:00:50Z",
      "title": "Police arrest dozens of pro-Palestinian protesters at Columbia, including congresswoman's daughter",
      "url": "https://apnews.com/cd80372939c7c08a40346e8b7d546da1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d025b40a25db413d8303865656009a29/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump lost a bid Thursday to pause a string of lawsuits accusing him of inciting the U.S. Capitol attack, while the former president fights his 2020 election interference criminal case in Washington.",
      "publishedAt": "2024-04-18T20:45:54Z",
      "title": "Trump loses bid to halt Jan. 6 lawsuits while he fights criminal charges in the 2020 election case",
      "url": "https://apnews.com/7f80a140e728247ea5ec8db9d4d46eb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04c340f708ed4b48831ac37e98f6f4b0/3000.jpeg"
    },
    {
      "author": "JOHN MARSHALL",
      "description": "TEMPE, Ariz. (AP) — The Arizona Coyotes are officially headed to Salt Lake City.The NHL Board of Governors voted unanimously Thursday to approve a $1.2 billion sale from Alex Meruelo to Utah Jazz owners Ryan and Ashley Smith, clearing the way for the franchise's move to Utah next season.",
      "publishedAt": "2024-04-18T19:51:30Z",
      "title": "Coyotes officially leaving Arizona for Salt Lake City following approval of sale to Utah Jazz owners",
      "url": "https://apnews.com/f847c9206632db191463128b01347857",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed1843a7819c43028c186ccfb2a3f505/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}