{
  "articles": [
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "DALLAS (AP) — Whether you saw the moon completely block the sun, were foiled by cloudy weather or weren't along the path of Monday's total solar eclipse, there are still more chances to catch a glimpse.",
      "publishedAt": "2024-04-09T05:05:20Z",
      "title": "Can't get enough of the total solar eclipse or got clouded out? Here are the next ones to watch for",
      "url": "https://apnews.com/c3bc0a68e1ad187729297296a5f582f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5e0a2eaa72843d8865010b83d0f538c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Stunned Palestinians found their home city unrecognizable Monday as they filtered in to salvage what they could from the vast destruction left by Israeli troops who withdrew from southern Gaza's Khan Younis a day earlier after months of fighting and bombardment.",
      "publishedAt": "2024-04-08T09:32:27Z",
      "title": "Palestinians returning to Khan Younis after Israeli withdrawal find an unrecognizable city",
      "url": "https://apnews.com/c8776b6a074cd182d0641214f5f352d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bbf078954944b80a0e4bcdac2c582f6/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith's team urged the Supreme Court on Monday night to reject former President Donald Trump's claim that he is immune from prosecution in a case charging him with scheming to overturn the results of the 2020 presidential election.",
      "publishedAt": "2024-04-09T00:25:16Z",
      "title": "Prosecutors urge Supreme Court to reject Trump's immunity claims in election subversion case",
      "url": "https://apnews.com/f8bd5c4e7fb2251587e4443d9ded7178",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfe69042dbb945569a884563f3edc979/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and COLLIN BINKLEY",
      "description": "MADISON, Wis. (AP) — President Joe Biden said Monday that more than 30 million borrowers would see “life-changing” relief from his new plan to ease their student loan debt burdens, a fresh attempt by the Democratic president to follow through on a campaign pledge that could buoy his standing with younger voters.",
      "publishedAt": "2024-04-08T04:08:04Z",
      "title": "Biden promotes 'life-changing' student loan relief in Wisconsin as he rallies younger voters",
      "url": "https://apnews.com/069d64e7e6fc4edd967adf6bc5f7e699",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca26809e262b41d582f75b3223ed94ad/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Japanese Prime Minister Fumio Kishida begins a much-anticipated visit to Washington on Tuesday aiming to spotlight shared concerns about provocative Chinese military action in the Pacific and at a rare moment of public difference between the two nations over a Japanese company's plan to buy an iconic U.S.",
      "publishedAt": "2024-04-09T04:05:08Z",
      "title": "Biden to meet Japan's PM Kishida amid shared concerns about China and differences on US Steel deal",
      "url": "https://apnews.com/f72d7162f0bd20c42e096c25e4b845c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5e136a7126b491795725d77f6a4e34b/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "GLENDALE, Ariz. (AP) — A basketball beatdown. A coaching clinic. A double-digit domination. Take one guess who finished off a romp through college basketball again. You bet, it’s UConn — a team built to win now, and often, and by a lot every time it takes the court.",
      "publishedAt": "2024-04-09T03:32:38Z",
      "title": "UConn concludes a dominant run to its 2nd straight NCAA title, beating Zach Edey and Purdue 75-60",
      "url": "https://apnews.com/525f5f96f6b007034a2cb928dc8a4dbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a02236df9b5746e7bd8fe3be349df3cf/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "STRASBOURG, France (AP) — Europe’s highest human rights court will rule Tuesday on a group of landmark climate change cases aimed at forcing countries to meet international obligations to reduce greenhouse gas emissions.",
      "publishedAt": "2024-04-09T04:37:53Z",
      "title": "Is action on climate change a human right? A European court will rule for the first time",
      "url": "https://apnews.com/3b540a965aff7e2b49f1451c7a328e77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba41f42830944edaa465912a37922d2d/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "SIEM REAP, Cambodia (AP) — A baby monkey struggles and squirms as it tries to escape the man holding it by the neck over a concrete cistern, repeatedly dousing it with water. In another video clip, a person plays with the genitals of a juvenile male macaque sitting on a limestone block from an ancient temple to get it excited for the camera.",
      "publishedAt": "2024-04-09T04:15:38Z",
      "title": "Cruelty for clicks: Cambodia is investigating YouTubers' abuse of monkeys at the Angkor UNESCO site",
      "url": "https://apnews.com/38233596360b5d51b47d17abfb6820f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8067a08565a0403f8a6b10330522cc4e/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A person with a ticket matching all six Powerball numbers in Saturday’s $1.3 billion jackpot came forward Monday to claim the prize, Oregon officials said.",
      "publishedAt": "2024-04-09T00:44:01Z",
      "title": "Person comes forward to claim $1.3 billion Powerball jackpot in Oregon",
      "url": "https://apnews.com/00883e00b4d510a51ade35cffa3f3336",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6091a108ba7947b6abf7f3ede7741c97/1920.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "DALLAS (AP) — Millions across North America witnessed the moon block out the sun during a total solar eclipse Monday.The eclipse’s path of totality stretched from Mazatlán, Mexico to Newfoundland, an area that crosses 15 U.S.",
      "publishedAt": "2024-04-08T19:09:04Z",
      "title": "AP PHOTOS: Total solar eclipse sweeps across North America",
      "url": "https://apnews.com/0a07725f59906849b00949e43177e6d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6155593cbee04ee084e7b68493575fad/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}