{
  "articles": [
    {
      "author": "JOHNSON LAI, JUSTIN SPIKE and BASSEM MROUE",
      "description": "TAIPEI, Taiwan (AP) — A company based in Hungary was responsible for manufacturing the pagers that exploded in an apparent Israeli operation targeting Hezbollah, another firm said Wednesday.",
      "publishedAt": "2024-09-18T06:12:52Z",
      "title": "Exploding pagers in attack on Hezbollah were made by a Hungarian company, another firm says",
      "url": "https://apnews.com/ce6af3c2e6de0a0dddfae48634278288",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20c75a480c0e4e7ca396583f6940474d/1920.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS, MICHAEL BIESECKER, SARAH EL DEEB and SARAH PARVINI",
      "description": "NEW YORK (AP) — In what appears to be a sophisticated, remote attack, pagers used by hundreds of members of Hezbollah exploded almost simultaneously in Lebanon and Syria Tuesday, killing at least 12 people — including two children — and wounding thousands more.",
      "publishedAt": "2024-09-17T19:11:49Z",
      "title": "What to know about the deadly pager explosions targeting Hezbollah",
      "url": "https://apnews.com/e9493409a0648b846fdcadffdb02d71e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d724b968754387b761e4d621a52547/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER, MICHAEL R. SISAK, JENNIFER PELTZ and ANDREW DALTON",
      "description": "NEW YORK (AP) — For 10 months, rumblings, lawsuits, law enforcement raids and mounting allegations of widespread sexual abuse had surrounded Sean \"Diddy Combs.",
      "publishedAt": "2024-09-18T04:04:57Z",
      "title": "Sean 'Diddy' Combs' indictment alleges he used power to build empire of sexual crime",
      "url": "https://apnews.com/b60db3252403f2bfbe24c54b34f0cfdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88ea78839914bf5a7cc2957349d3f34/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "Presidential candidates typically focus much of their travel on battleground states, but Donald Trump on Wednesday is taking his message to a somewhat unlikely place: suburban New York.",
      "publishedAt": "2024-09-18T11:09:21Z",
      "title": "Trump and Harris are taking a brief break from campaigning in battleground states",
      "url": "https://apnews.com/367611170a28f470afc537dcefe158ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba6e936e019a446cbac738cba54c59a6/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — A 22-year-old woman who became an abortion rights advocate after she was raped by her stepfather as a child tells her story in a new campaign ad for Democratic presidential nominee Kamala Harris.",
      "publishedAt": "2024-09-18T09:02:59Z",
      "title": "Now a Roe advocate, woman raped by stepfather as a child tells her story in Harris campaign ad",
      "url": "https://apnews.com/cdb874e7c3e7fe12fb1bfb95d06e907f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75bf4bb401bf491dbf35b8e98e47b441/3000.jpeg"
    },
    {
      "author": "AIJAZ HUSSAIN",
      "description": "SRINAGAR, India (AP) — A three-phased election for choosing a local government in Indian-controlled Kashmir opened early Wednesday in the first such vote since Prime Minister Narendra Modi’s government stripped the disputed region of its special status five years ago.",
      "publishedAt": "2024-09-18T02:07:46Z",
      "title": "Voting for local government opens in Indian-controlled Kashmir for first time after losing autonomy",
      "url": "https://apnews.com/197e0720c55fad094535e2a5d6907b59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/017efb939e9b47af9f01567b86ead1dd/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM and JULIE CARR SMYTH",
      "description": "SPRINGFIELD, Ohio (AP) — A small Ohio city has been inundated with hoax bomb threats since last week's presidential debate, when former President Donald Trump falsely accused members of Springfield's Haitian community of abducting and eating cats and dogs.",
      "publishedAt": "2024-09-17T22:42:17Z",
      "title": "What to know about the threats in Springfield, Ohio, after false claims about Haitian immigrants",
      "url": "https://apnews.com/7594bae869fb05dc6f106098409418cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75d9780aa0e4026bb717e910dccdd5a/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Global shares were mixed Wednesday as investors awaited an expected interest rate cut by the U.S.",
      "publishedAt": "2024-09-18T02:01:11Z",
      "title": "Stock market today: Global shares trade mixed ahead of Federal Reserve rate decision",
      "url": "https://apnews.com/7e41dab05ea85531991cd69a7d2524bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0636dc9ca4184fb2a820a1159e5a8e6a/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "MITCHELL, S.D. (AP) — The gold-leafed ceilings and crystal chandeliers of Donald Trump’s Mar-a-Lago resort are a long way from the small town of Murdo, South Dakota, where Sen.",
      "publishedAt": "2024-09-18T04:03:20Z",
      "title": "John Thune is striving to be the next Republican Senate leader, but can he rise in Trump's GOP?",
      "url": "https://apnews.com/c34ecb7479cee50c24aacf3fef83dcfc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/935afc84fd474c26904632f7b48a6cd8/1920.jpeg"
    },
    {
      "author": "JEFF TURNER",
      "description": "LOS ANGELES (AP) — Convicted con artist Anna Sorokin has hit the dancefloor on “Dancing With the Stars” with a featherweight — and very sparkly — ankle monitor.",
      "publishedAt": "2024-09-18T04:27:58Z",
      "title": "'Fake heiress' Anna Sorokin debuts on 'Dancing with the Stars' — with a sparkly ankle monitor",
      "url": "https://apnews.com/9bf38625548c95e8827eed5678380694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2401fc762ad4508b49ed72f3c617bec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}