{
  "articles": [
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Reeling from a string of defeats, anti-abortion groups and their Republican allies in state governments are using an array of strategies to counter proposed ballot initiatives intended to protect reproductive rights or prevent voters from having a say in the fall elections.",
      "publishedAt": "2024-06-16T11:27:13Z",
      "title": "The anti-abortion movement is making a big play to thwart citizen initiatives on reproductive rights",
      "url": "https://apnews.com/7ac73939250441ddd015d3be741cfff2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c42cc33700948f2a08af59b38a5afb6/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "OBBÜRGEN, Switzerland (AP) — Nearly 80 countries called Sunday for the “territorial integrity” of Ukraine to be the basis for any peace agreement to end Russia’s two-year war, though some key developing nations at a Swiss conference did not join in.",
      "publishedAt": "2024-06-16T11:21:04Z",
      "title": "78 countries at Swiss conference agree Ukraine's territorial integrity must be basis of any peace",
      "url": "https://apnews.com/568cafee5fbe9c3b19b79b041583a5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3eff720d9464b6498f8c2260e9921e9/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and LEE KEATH",
      "description": "JERUSALEM (AP) — Israel's military announced on Sunday that it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.",
      "publishedAt": "2024-06-16T04:01:50Z",
      "title": "Israel's army says it will pause daytime fighting along a route in southern Gaza to help flow of aid",
      "url": "https://apnews.com/8c111f2dcf783f8671e6dd6f19547b17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d9d9e93ea664ddf803cc8957fde7bbd/1920.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — The Broadway play “Stereophonic” and the musical “The Outsiders” have taken an early lead as the Tony Awards' pre-show kicked off Sunday before the main trophies were handed out.",
      "publishedAt": "2024-06-16T05:00:38Z",
      "title": "The 2024 Tony Awards kicks off with early wins for 'Stereophonic' and 'The Outsiders'",
      "url": "https://apnews.com/160b563f159adb750c0691e665161a9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50c5f8496b454ce981256a0186abb07f/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Extreme heat spread across Arizona, New Mexico and parts of Texas, Colorado and Kansas as severe weather swept across many parts of the U.S.",
      "publishedAt": "2024-06-16T21:48:52Z",
      "title": "Severe, chaotic weather around US with high temperatures in Southwest and Midwest, snow in Rockies",
      "url": "https://apnews.com/8b531511f17a8409914473e230d24301",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1d748d85a9743298c1f868b70ab7665/3000.jpeg"
    },
    {
      "author": "RYAN SUN",
      "description": "GORMAN, Calif. (AP) — Strong winds pushed flames through dry brush in mountains along Interstate 5 north of Los Angeles on Sunday, and officials warned residents in the wildfire's path to be prepared to leave if it explodes in size again.",
      "publishedAt": "2024-06-16T02:00:27Z",
      "title": "Strong winds, steep terrain hamper crews battling Los Angeles area's first major fire of the year",
      "url": "https://apnews.com/3d940b9dae55ca39175e9b2bc815869c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d90539d0ce2b4a389e6d1682086acf9f/1920.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — One of Donald Trump’s emissaries to Arab Americans is a Lebanese-born businessman who moved to Texas as a teenager, speaks Arabic, English and French, and recently joined the Trump family when his son married the former president’s younger daughter.",
      "publishedAt": "2024-06-16T12:06:46Z",
      "title": "Trump allies hope his daughter Tiffany's father-in-law can help flip Arab American votes in Michigan",
      "url": "https://apnews.com/57abe06681457106a2e6ab107407edc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cb9bf635b314cd5bd74a7ac30098a25/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "MINA, Saudi Arabia (AP) — Masses of pilgrims on Sunday embarked on a symbolic stoning of the devil in Saudi Arabia under the soaring summer heat. The ritual marks the final days of the Hajj, or Islamic pilgrimage, and the start of the Eid al-Adha celebrations for Muslims around the world.",
      "publishedAt": "2024-06-16T04:07:04Z",
      "title": "Pilgrims commence the final rites of Hajj as Muslims celebrate Eid al-Adha",
      "url": "https://apnews.com/0278c6e1040eac5f0b834f762f41db27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2279c152d8a74d04908a57ad381e2aca/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "LOS ANGELES (AP) — Some of Hollywood's brightest stars headlined a fundraiser for President Joe Biden that took in a record $30 million-plus for a Democratic candidate, according to his campaign, in hopes of energizing would-be supporters for a White House contest they said may rank among the most consequential in U.S.",
      "publishedAt": "2024-06-15T04:02:37Z",
      "title": "Clooney and Roberts help Biden raise $30 million-plus at a star-studded Hollywood gala",
      "url": "https://apnews.com/40081471c93faa68de5c4aa30455303b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e51436efa08245069b387cd501383ffa/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "PINEHURST, N.C. (AP) — Bryson DeChambeau won the U.S. Open on Sunday for the second time with the best shot of his life for another finish on the 18th hole at Pinehurst No.",
      "publishedAt": "2024-06-16T22:52:43Z",
      "title": "Bryson DeChambeau wins another U.S. Open with a clutch finish to deny Rory McIlroy",
      "url": "https://apnews.com/5f8a3ec8c68a1d341f0e119e364e28df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abf62910f85a455294a4164040736369/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}