{
  "articles": [
    {
      "author": "ADRIANA GOMEZ LICON and TARA COPP",
      "description": "WASHINGTON (AP) — An Arlington National Cemetery official was “abruptly pushed aside” in an altercation with former President Donald Trump’s staff during a wreath-laying ceremony to honor service members killed in the Afghanistan War withdrawal, but she declined to press charges, an Army spokesman said Thursday.",
      "publishedAt": "2024-08-29T14:58:47Z",
      "title": "Arlington National Cemetery worker was 'pushed aside' in Trump staff dispute but won't seek charges",
      "url": "https://apnews.com/18086b03bb1214bc9b6a23f2aaea1c98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b429fb659cdf4e6988b31998ac00d917/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "SAVANNAH, Ga. (AP) — Vice President Kamala Harris and her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-29T04:18:21Z",
      "title": "Harris and Walz will sit down for first major television interview of their presidential campaign",
      "url": "https://apnews.com/94eff1aa1247e471b48948d03faf0edf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97a39c63dc0d41a69dd4dbde2146f78c/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and THOMAS BEAUMONT",
      "description": "LANSING, Mich. (AP) — Donald Trump is scheduled to campaign Thursday in Michigan and Wisconsin as the former president ramps up battleground state travel heading into the traditional Labor Day turn toward the fall election.",
      "publishedAt": "2024-08-29T04:11:58Z",
      "title": "Trump is visiting swing districts in Michigan and Wisconsin as battleground campaigning ramps up",
      "url": "https://apnews.com/0583faabae5e36000baa18c7b2bea752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cce1679438e4f8d999538919190d469/2692.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — One of the handful of F-16 warplanes that Ukraine has received from its Western partners to help fight Russia’s invasion has crashed, Ukraine’s Army General Staff said Thursday.",
      "publishedAt": "2024-08-29T09:20:11Z",
      "title": "Ukraine says one of its Western-donated F-16 warplanes has crashed",
      "url": "https://apnews.com/74bd75cb94ff294df6fbec7e6dec732f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d9640b6bb1e4ee5b949e3438343c7f2/2800.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and MELANIE LIDMAN",
      "description": "TULKAREM, West Bank (AP) — The Israeli military said it killed five more West Bank militants, including a local commander, as it pressed ahead Thursday with what appeared to be the deadliest operation in the occupied territory since the start of the war in Gaza.",
      "publishedAt": "2024-08-29T05:56:13Z",
      "title": "Israel kills a top militant in its deadliest West Bank raids since the Gaza war began",
      "url": "https://apnews.com/ee53e1dbf7ece94151088308510e8679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3da02736c29f4fbdbc58aa8b9bb419fc/1920.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Iran has further increased its stockpile of uranium enriched to near weapons-grade levels in defiance of international demands, a confidential report by the United Nations’ nuclear watchdog said Thursday.",
      "publishedAt": "2024-08-29T15:32:33Z",
      "title": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, UN says",
      "url": "https://apnews.com/9c86e5788a8bb45eab1337d5f6c10121",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddd4764b696b4c7bb14d61b1b087f51a/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Yemen's Houthi rebels released footage on Thursday showing their fighters boarded and placed explosives on a Greek-flagged tanker, setting off blasts that put the Red Sea at risk of a major oil spill.",
      "publishedAt": "2024-08-29T16:38:50Z",
      "title": "Houthi video shows the Yemeni rebels planted bombs on tanker now threatening Red Sea oil spill",
      "url": "https://apnews.com/76c68f18a984d18905ce7c84e5cabe0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e35b9093ba44497aa93b7206f2d4f7b9/1280.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The FBI has failed to report some child sexual abuse allegations to local law enforcement or social service agencies despite changes prompted by its handling of the case against former USA Gymnastics team doctor Larry Nassar, according to a Justice Department watchdog report released Thursday.",
      "publishedAt": "2024-08-29T15:01:58Z",
      "title": "Justice Department watchdog finds flaws in FBI's reporting of sex crimes against children",
      "url": "https://apnews.com/e99e729147421fe166f92ca23eefc4e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6097aab21314e3684658d5f332679e6/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — The baby in Gaza who was recently paralyzed by polio was infected with a mutated strain of the virus that vaccinated people shed in their waste, according to scientists who say the case is the result of “an unqualified failure” of public health policy.",
      "publishedAt": "2024-08-29T14:54:02Z",
      "title": "A baby in Gaza has a strain of polio linked to mistakes in eradication campaign, experts say",
      "url": "https://apnews.com/aa79e32d45aa59f26274898c22885ba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfa00812ebd44cc9842ee50105b47fb7/1920.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "Patrick Mahomes and the Chiefs chasing history will be the hottest topic throughout the NFL season.",
      "publishedAt": "2024-08-29T17:02:47Z",
      "title": "The Chiefs' pursuit of a 3-peat is the hot topic among many storylines entering 2024 NFL season",
      "url": "https://apnews.com/5bd0805146d13be839159836b7841c71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46101766aa7348ab885138daef4bf686/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}