{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy dismissed the planned summit between U.S. President Donald Trump and Russian President Vladimir Putin, warning that any peace deal excluding Kyiv would lead to “dead solutions.” The meeting, scheduled for Friday in Alaska, is seen as a potential breakthrough after weeks of expressing frustration that more was not being done to quell the fighting. In a statement posted to Telegram, Zelenskyy said Ukraine’s territorial integrity, enshrined in the constitution, must be non-negotiable and emphasized that lasting peace must include Ukraine’s voice at the table.",
      "publishedAt": "2025-08-09T07:12:14Z",
      "title": "Zelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-summit-zelenskyy-a01a6dbae85b10cc710c48f1558c1401",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Emory University has alerted students and staff Friday to an active shooter on their Atlanta campus. The alert Friday told students to “RUN, HIDE, FIGHT” and avoid the area. Atlanta police said they were responding to reports of an active shooter. They did not immediately say whether anyone was injured in the shooting.",
      "publishedAt": "2025-08-08T21:45:42Z",
      "title": "Active shooter reported at Emory University in Atlanta, authorities say",
      "url": "https://apnews.com/article/emory-university-shooting-atlanta-407f755f2db20dbab7d04981614f1428",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "President Donald Trump's promised law enforcement surge in Washington, D.C., did not appear to happen as scheduled on its first night. The streets were bustling with revelers, but there was no visible increase in law enforcement. Trump had announced a security lockdown starting at midnight, following a weekend assault on a government official. He has threatened to take federal control of the city, citing safety concerns. Mayor Muriel Bowser has not publicly responded. Trump's plans could include deploying the National Guard, but further actions may face legal challenges. The situation remains fluid as the city awaits further developments.",
      "publishedAt": "2025-08-09T04:03:37Z",
      "title": "DC awaits federal action after Trump promise to fortify its streets",
      "url": "https://apnews.com/article/washington-district-takeover-trump-crime-d0ebfa76584753635327d792f6c0b8fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1553a6/2147483647/strip/true/crop/5609x3155+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8b%2Fd09d8fb9a99c71362e7df54e4a93%2F18896ead764745bdbb625ec75dbd4b31"
    },
    {
      "author": null,
      "description": "President Donald Trump will convene a peace summit at the White House with the leaders of Armenia and Azerbaijan. The meeting is meant to end decades of conflict and help reopen key transportation corridors across the South Caucasus that have been shut since the early 1990s. Trump says the two leaders will participate in a peace ceremony and sign economic agreements with the U.S. that will “fully unlock the potential of the South Caucasus Region.” The Republican president on Friday will first meet with Armenian Prime Minister Nikol Pashinyan and then will host Azerbaijan's President Ilham Aliyev. All three leaders will participate in a joint signing ceremony in the State Dining Room.",
      "publishedAt": "2025-08-08T13:36:46Z",
      "title": "Trump hosts Armenia and Azerbaijan for peace summit",
      "url": "https://apnews.com/article/donald-trump-white-house-armenia-azerbaijan-069379e9c4a058c96af38afbf4684829",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d675af/2147483647/strip/true/crop/5327x2996+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F20%2Fdbb3f6ef42fa11ce05897ea87ad8%2Ffc387d7797234005bd38aaf6b37a364c"
    },
    {
      "author": null,
      "description": "Oregon Sen. Ron Wyden is in his fifth decade in Congress and the veteran Democrat is showing no inclination to step aside. He says he plans to seek another term in 2028, when he'll be 79, even as pressure builds on aging Democratic officeholders to give way to a new generation. He's traveled to all 36 Oregon counties every year that he’s been in the Senate and intends to keep doing so. After a recent town hall in Wasco in conservative Sherman County, Wyden called questions about age “fair game for debate” but said he’s still up to the job.",
      "publishedAt": "2025-08-09T11:48:47Z",
      "title": "Wyden says he's up for the fight against Trump's policies",
      "url": "https://apnews.com/article/wyden-senate-oregon-trump-democrats-2bacdf8cf27c4f2531d02276e2733ae7",
      "urlToImage": "https://dims.apnews.com/dims4/default/117ea77/2147483647/strip/true/crop/5842x3286+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F58%2Fc5de4ce08d7d74a78cbf4f452c37%2Fc36860334648443881f96c2365f1efb9"
    },
    {
      "author": null,
      "description": "Israel says it plans to take over Gaza City in another escalation of its 22-month war with Hamas. The decision, made after a late-night meeting of top officials, drew Palestinian rejection, fueled mounting international calls to end the war and provoked worries in Israel over the fate of hostages still held by Hamas. Israel’s air and ground war has already killed tens of thousands of people in Gaza, displaced most of the population, destroyed vast areas and pushed the territory toward famine. Another major ground operation would almost certainly exacerbate the humanitarian catastrophe. Hamas in a statement rebuffed Netanyahu’s plans and vowed remain defiant.",
      "publishedAt": "2025-08-08T06:20:07Z",
      "title": "Israel announces plan to retake Gaza City in another escalation of the war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-08-2025-920f5b4bfd3fe07ded6acd28f5d77768",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c48ff2/2147483647/strip/true/crop/6124x3445+0+319/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F2d%2F110abd56da33a34463f6a7184624%2Fd9d69b9fb6c14d1588830dc4c37b33d4"
    },
    {
      "author": null,
      "description": "Nagasaki is marking the U.S. atomic attack on the southern city 80 years ago, with survivors determined to make their hometown the last place on earth hit by the bomb. Survivors in the Japanese city will commemorate the anniversary Saturday by passing on their stories and telling younger people it remains relevant to their future. Survivors increasingly worry the world is moving in the opposite direction. The atomic bomb dropped by the U.S. on Nagasaki on Aug. 9, 1945, killed some 70,000 people three days after the bombing of Hiroshima that killed 140,000. Japan surrendered on Aug. 15, 1945, ending World War II.",
      "publishedAt": "2025-08-09T01:38:34Z",
      "title": "Nagasaki marks 80th A-bombing anniversary as survivors ask youth to work for nuke ban",
      "url": "https://apnews.com/article/japan-nagasaki-atomic-bombing-anniversary-wwii-ceremony-409af035fc6ca4834f5102592e8d464b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7442332/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F34%2F0ea303a9664509398dd34a7b4f04%2Faa690733c3274cb4908bf1cb6ea96f0d"
    },
    {
      "author": null,
      "description": "Prices of acai smoothies and bowls look certain to go up in the U.S. as President Donald Trump imposed 50% tariffs on Brazilian exports in July and threatened the delicate balance of supply and demand that holds the industry. A single full crate of acai sells for around $50 at local markets in Brazil. That price is now expected to plummet. The U.S. is by far the largest acai importer of a total Brazilian output currently estimated at about 70,000 tons per year.",
      "publishedAt": "2025-08-09T04:02:39Z",
      "title": "Trump's 50% tariffs on Brazilian acai hit producers hard",
      "url": "https://apnews.com/article/brazil-acai-exports-us-tariffs-trump-deee782cfd5f73089b72e9677c2d8ce3",
      "urlToImage": "https://dims.apnews.com/dims4/default/366123b/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F5a%2F1ad25ce3fdbc4f04f3c3988e35e7%2Fa98d02c48a914b69a5e8f2b1be55e16f"
    },
    {
      "author": null,
      "description": "About 1,400 firefighters have been deployed in France's southern Aude region to prevent the country's largest wildfire in decades from reigniting. All residents have been allowed to return home. Aude prefect Christian Pouget said the fire has been contained since Thursday after burning some 62 square miles. All roads have been reopened, but there's a strict ban on accessing the forest. The blaze left one person dead and injured 25 others, including 19 firefighters. High temperatures are expected to complicate efforts. Southern Europe has seen multiple large fires this summer, with climate change worsening conditions.",
      "publishedAt": "2025-08-09T10:40:49Z",
      "title": "1,400 firefighters battle to contain France's largest wildfire in decades",
      "url": "https://apnews.com/article/fire-france-aude-climate-495ac9ea6a7e7b8bac11349af2b2b602",
      "urlToImage": "https://dims.apnews.com/dims4/default/5916ca8/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Ffb%2Fb0764b395d5fc98d61b756f133d3%2F9f188cde78f64feeaa773effceb2990f"
    },
    {
      "author": null,
      "description": "Max Scherzer and Clayton Kershaw went toe-to-toe for six innings in a vintage duel Friday night. The 41-year-old Scherzer, pitching for Toronto, made his 465th career start. Kershaw, 37, started his 443rd game — all for the Los Angeles Dodgers over 18 seasons. Once teammates in Los Angeles, both pitchers have won three Cy Young Awards and are likely headed to the Hall of Fame. Kershaw allowed one run and seven hits, striking out four. Scherzer gave up two runs and six hits, striking out five. A two-run homer by Mookie Betts gave the Dodgers a 2-1 lead. It was the fourth time Scherzer and Kershaw faced each other. Before the game, Dodgers manager Dave Roberts praised both pitchers for their competitiveness and unique styles.",
      "publishedAt": "2025-08-09T02:12:32Z",
      "title": "Max Scherzer vs. Clayton Kershaw: A 3,000-strikeout club showdown",
      "url": "https://apnews.com/article/max-scherzer-clayton-kershaw-d49bdeb80bc7ae709ec80f5eaa94d165",
      "urlToImage": "https://dims.apnews.com/dims4/default/b195f54/2147483647/strip/true/crop/4065x2287+0+212/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F93%2F41399f3603e12e847bd2f8c01773%2Ffea33bf336bb45d483894e5e1bb27332"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}