{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court agreed on Wednesday to take up a dispute over a medication used in the most common method of abortion in the United States, its first abortion case since it overturned Roe v.",
      "publishedAt": "2023-12-13T14:34:20Z",
      "title": "The Supreme Court will rule on limits on a commonly used abortion medication",
      "url": "https://apnews.com/f763b93ef632e1767fd696caec686c21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21c0f71a49514f1eb9ce20700a74c98d/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday said it will hear an appeal that could upend hundreds of charges stemming from the Capitol riot, including against former President Donald Trump.",
      "publishedAt": "2023-12-13T14:35:38Z",
      "title": "Supreme Court will hear a case that could undo Capitol riot charge against hundreds, including Trump",
      "url": "https://apnews.com/5cf0db4a71766f0b40ec199dd0d5a1ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7cc349cbc7a4e009614427dd0829111/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and MELANIE LIDMAN",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinian militants carried out one of the deadliest single attacks on Israeli soldiers since the Gaza invasion began, killing at least nine in an urban ambush, the military said Wednesday, a sign of the stiff resistance Hamas still poses despite more than two months of devastating bombardment.",
      "publishedAt": "2023-12-13T08:50:51Z",
      "title": "9 Israeli soldiers killed in Gaza City ambush in sign that Hamas resistance is still strong",
      "url": "https://apnews.com/10a0370b7b320d73def6b6a2a137f16a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/283f5b3437d942a09c17238834b94862/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and COLLEEN LONG",
      "description": "WASHINGTON (AP) — Top Biden administration officials were laboring on Wednesday to try to reach a last-minute deal for wartime aid for Ukraine by agreeing to Senate Republican demands to bolster U.S.-Mexico border policies to cut crossings.",
      "publishedAt": "2023-12-13T18:10:11Z",
      "title": "Biden considers new border and asylum restrictions as he tries to reach Senate deal for Ukraine aid",
      "url": "https://apnews.com/e1da808689aeef52308d19010a5e3cfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a4ea5f251c64961bb61396e37846ca8/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The Federal Reserve kept its key interest rate unchanged Wednesday for a third straight time, a sign that it is likely done raising rates after having imposed the fastest string of increases in four decades to fight painfully high inflation.",
      "publishedAt": "2023-12-13T05:01:31Z",
      "title": "Federal Reserve keeps key interest rate unchanged and foresees 3 rate cuts next year",
      "url": "https://apnews.com/d95b976ef2194cea8516f21c98f62ded",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a2ba627a3ac4fa3abebbcd73dfd1569/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The district attorney prosecuting Donald Trump over efforts to overturn the 2020 election in Georgia says she has a duty to file charges against anyone who violates the law and that it’s a “silly notion” that the former president’s case should be paused just because he is running for office.",
      "publishedAt": "2023-12-13T19:11:51Z",
      "title": "It's a 'silly notion' that Trump's Georgia case should pause for the election, Willis tells the AP",
      "url": "https://apnews.com/de77f102a0747f9c65ed874a1f0612c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15e21dd120c34b118f07d5991dec6b64/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House is pushing toward a vote Wednesday to formally authorize the impeachment inquiry into President Joe Biden as Republicans rally behind the charged process despite lingering concerns among some in the party that the investigation has yet to produce evidence of misconduct by the president.",
      "publishedAt": "2023-12-13T05:11:58Z",
      "title": "House preps for a key vote on Biden impeachment inquiry as Republicans unite behind investigation",
      "url": "https://apnews.com/94884b322da40ca9315ac5f4e73a3e86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8b5e5d56a0c4f35995e382982fdc700/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and COLLEEN LONG",
      "description": "WASHINGTON (AP) — Hunter Biden on Wednesday defied a congressional subpoena to appear privately for a deposition before Republican investigators who have been digging into his business dealings, insisting outside the U.S.",
      "publishedAt": "2023-12-13T14:59:12Z",
      "title": "Hunter Biden defies Republican subpoena in visit to the Capitol, risking contempt of Congress charge",
      "url": "https://apnews.com/0226bb1041d7b5c10bc8c33e5d98b5e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b1ea41d640545a882833fde9cfeba05/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "A large Swedish study has uncovered a paradox about people diagnosed with an excessive fear of serious illness: They tend to die earlier than people who aren’t hypervigilant about health concerns.Hypochondriasis, now called illness anxiety disorder, is a rare condition with symptoms that go beyond average health worries.",
      "publishedAt": "2023-12-13T16:17:26Z",
      "title": "In hypochondria paradox, Swedish study finds a higher death rate in those who fear serious illness",
      "url": "https://apnews.com/396a6e0ae2498906aeef5e03977a48e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3039d29312ca4e219d758f37217afac3/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Tesla is recalling nearly all vehicles sold in the U.S., more than 2 million, to update software and fix a defective system that’s supposed to ensure drivers are paying attention when using Autopilot.",
      "publishedAt": "2023-12-13T10:30:04Z",
      "title": "Tesla recalls nearly all vehicles sold in US to fix system that monitors drivers using Autopilot",
      "url": "https://apnews.com/8060508627a34e6af889feca46eb3002",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8c67ecc50024404a7bbb97e2bf106d6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}