{
  "articles": [
    {
      "author": "TIA GOLDENBERG, BASSEM MROUE and MELANIE LIDMAN",
      "description": "NEW YORK (AP) — Dimming hopes for a cease-fire, Prime Minister Benjamin Netanyahu said Thursday that Israel will continue striking Hezbollah “with full force” and will not stop until all of its goals are achieved.",
      "publishedAt": "2024-09-26T08:46:33Z",
      "title": "Netanyahu vows to use 'full force' against Hezbollah and dims hopes for a cease-fire",
      "url": "https://apnews.com/486f5aecac210273611124f9ade95fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5a51d386e52439cad744df8ba7cb4ad/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Hezbollah each have strong incentives to heed international calls for a cease-fire that could avert all-out war — but that doesn't mean they will.",
      "publishedAt": "2024-09-26T16:53:54Z",
      "title": "What obstacles stand in the way of an Israel-Hezbollah cease-fire?",
      "url": "https://apnews.com/71b59e0db03f0014ce06d4aa21bc2907",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cfdac1edb2f47b6b46d31cfb86b6d65/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams was indicted Thursday on charges that he took illegal campaign contributions and bribes from foreign nationals, including lavish overseas trips, in exchange for favors that included helping Turkish officials bypass a fire inspection for a new diplomatic tower in the city.",
      "publishedAt": "2024-09-26T12:08:59Z",
      "title": "Feds charge NYC mayor with selling his influence to foreign nationals. He says he won't quit",
      "url": "https://apnews.com/5aad135d1808cb9d049fccd74604e5d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b651ecc71cb8449e86eec6ad13f65184/1920.jpeg"
    },
    {
      "author": "KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "CRAWFORDVILLE, Fla. (AP) — Hurricane Helene could cause a “nightmare” scenario of catastrophic storm surge in northwestern Florida, officials warned Thursday as they urged residents to heed evacuation orders ahead of the Category 2 storm, which is expected to cause significant damage hundreds of miles inland across much of the southeastern U.S.",
      "publishedAt": "2024-09-26T05:05:15Z",
      "title": "Helene races toward Florida as forecasters warn of 'catastrophic' storm surge",
      "url": "https://apnews.com/42fb7cc90604b7f87179920f97627873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26bf1ad76a12450c8b4a731f7f5820d5/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy huddled with U.S. leaders on Thursday to shore up American support for his country's fight against Russia as the war faces a partisan reckoning in this year's presidential election.",
      "publishedAt": "2024-09-26T04:13:02Z",
      "title": "Zelenskyy visits Washington as election year divide grows over Ukraine war",
      "url": "https://apnews.com/229804fd42332c584dfbe05224634e44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/628da7878c12435685e24837394790ff/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI, REBECCA SANTANA and COLLEEN LONG",
      "description": "WASHINGTON (AP) — Members of a bipartisan House task force investigating the Trump assassination attempts emphasized during their first hearing Thursday that the Secret Service, not local authorities, was responsible for the failures in planning and communications that led to a gunman being able to open fire on former President Donald Trump in Pennsylvania.",
      "publishedAt": "2024-09-26T04:23:03Z",
      "title": "Hearing on Trump assassination attempts says Pennsylvania failure was by Secret Service",
      "url": "https://apnews.com/081e812f3569b2bdb9f3ffe322ea1619",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea79b9dd2ccf40aeb7b3d62243223947/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "FORT JACKSON, South Carolina (AP) — After several very difficult years and a swath of new programs and enticements, the Army, Air Force, Marine Corps and Space Force will all meet their recruiting goals by the end of this month and the Navy will come very close, the military services say.",
      "publishedAt": "2024-09-26T12:00:42Z",
      "title": "Military recruiting rebounds after several tough years, but challenges remain",
      "url": "https://apnews.com/1611ea378b32826cc4615dc3731f3f70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7ab17a623144775b18ff07c3df7ca72/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "McALESTER, Okla. (AP) — Oklahoma executed a man Thursday for his role in the 1992 fatal shooting of a convenience store owner after the governor again rejected a recommendation from the state’s parole board to spare a death row inmate's life.",
      "publishedAt": "2024-09-26T05:08:15Z",
      "title": "Oklahoma executes a man for a 1992 killing despite board recommending his life be spared",
      "url": "https://apnews.com/7b6822bb3ad19122a903f9e215797646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9da90357cca64a40a5deab8b97dd2001/2520.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — Billionaire Elon Musk’s social media site X has complied with Brazilian Supreme Court Justice Alexandre de Moraes’ orders and requested its service be reestablished in the country, a source said Thursday.",
      "publishedAt": "2024-09-26T17:13:25Z",
      "title": "X requests it be reinstated in Brazil after complying with judge's orders, source says",
      "url": "https://apnews.com/aff86ceac1076438e9e340712c09dc57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7912d70a433a4fb38c9666b7d75786da/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PITTSBURGH (AP) — Two years ago, it looked as if Major League Baseball was having an existential crisis. To many inside the game, it certainly felt like one as a sport built on its timelessness careened toward a future hellbent on speeding things up.",
      "publishedAt": "2024-09-26T05:48:42Z",
      "title": "Shorter games, more running, more action. Two years in, MLB's rule changes have provided a jolt",
      "url": "https://apnews.com/89bea3c28f6f500441050a31da6c003a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce981f9c58bb4f0c999b2bb755d74a21/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}