{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Trump White House official Peter Navarro was found guilty Thursday of contempt of Congress charges for refusing to cooperate with a congressional investigation into the Jan.",
      "publishedAt": "2023-09-07T15:49:43Z",
      "title": "Trump White House official Navarro convicted of contempt after defying House Jan. 6 subpoena",
      "url": "https://apnews.com/a4ad58e1f590e5884fd347c86c121a8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54b4628945714331a753ac0d678b3057/1920.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A judge sentenced “That ’70s Show” show star Danny Masterson to 30 years to life in prison Thursday for raping two women, giving them some relief after they spoke in court about the decades of damage he inflicted.",
      "publishedAt": "2023-09-07T04:29:10Z",
      "title": "‘That ’70s Show' actor Danny Masterson gets 30 years to life in prison for rapes of 2 women",
      "url": "https://apnews.com/fd7a10eda44d0e3ddde582d4c7053eb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a672ecfefa4c498da565b284d6490a38/1920.jpeg"
    },
    {
      "author": "BRIAN MAHONEY and HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Coco Gauff's U.S. Open semifinal victory over Karolina Muchova was delayed by 50 minutes because of a disruption by four environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
      "publishedAt": "2023-09-08T00:27:31Z",
      "title": "Climate protester glues feet to floor at US Open, interrupts Coco Gauff's semifinal win over Muchova",
      "url": "https://apnews.com/00a82f465076adea36b098aa6ca08a0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d1431e53f274c0bbea3d8941be80f31/3000.jpeg"
    },
    {
      "author": null,
      "description": "BAMAKO, Mali (AP) — Two attacks by al-Qaida linked insurgents in the restive north of Mali on Thursday killed 49 civilians and 15 government soldiers, the country's military junta said.A passenger boat near the city of Timbuktu on the Niger River and a Malian military position in Bamba further downstream in the Gao region were targeted, according to a statement from the military junta read on state television.",
      "publishedAt": "2023-09-07T23:00:49Z",
      "title": "Al-Qaida-linked insurgents in Mali kill 49 civilians and 15 soldiers in attacks, military says",
      "url": "https://apnews.com/5c9da064d244c8f48321277a501eb135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c50392722be4401ad9a8bc02e4830bc/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The founder of North Korea's ruling dynasty, an isolationist totalitarian leader named Kim Il Sung, was still building some of the country's first nuclear facilities when Syd Seiler arrived on the Korean Peninsula as a young U.S.",
      "publishedAt": "2023-09-08T04:22:04Z",
      "title": "America's retired North Korea intelligence officer offers a parting message on the nuclear threat",
      "url": "https://apnews.com/ffce53b0d3273c1f0a863b71f7531cdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f502b18484834692a22526fff06cbf10/3000.jpeg"
    },
    {
      "author": "YURAS KARMANAU and DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Russian authorities are holding local elections this weekend in occupied parts of Ukraine in an effort to tighten their grip on territories Moscow illegally annexed a year ago and still does not fully control.",
      "publishedAt": "2023-09-08T04:07:51Z",
      "title": "Russia holds elections in occupied Ukrainian regions in an effort to tighten its grip there",
      "url": "https://apnews.com/dcdce1c6fa131ddf331f70b352e62a81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1979919e97f44a1c8c46f1b4a994f01d/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "NEW DELHI (AP) — It’s never been easy for the leaders of the world’s largest economies to find common ground, but the global ramifications of Russia’s war on Ukraine mean even greater challenges for meaningful agreement at the Group of 20 meeting this year.",
      "publishedAt": "2023-09-08T04:10:47Z",
      "title": "India seeking greater voice for developing world at G20, but Ukraine war may overshadow talks",
      "url": "https://apnews.com/34a2f1663b6ce51739953a63e6196586",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0e35deb03e34a45afa43e08798a3e5c/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "CLEVELAND (AP) — Supreme Court Justice Brett Kavanaugh told a judicial conference on Thursday he hopes there will be “concrete steps soon” to address recent ethics concerns surrounding the court, but he stopped short of addressing calls for justices to institute an official code of conduct.",
      "publishedAt": "2023-09-07T18:45:46Z",
      "title": "Supreme Court Justice Kavanaugh predicts 'concrete steps soon' to address ethics concerns",
      "url": "https://apnews.com/76c1e5474093d17127707535ccdea852",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39d9ba67515c462d9c05a34b557da410/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Women's rights activists in Latin America have long looked to the United States as a model in their decades-long struggle to chip away at abortion restrictions in their highly religious countries.",
      "publishedAt": "2023-09-08T04:06:23Z",
      "title": "Latin America women's rights groups say their abortion win in Mexico may hold the key to US struggle",
      "url": "https://apnews.com/3c299b5711dd00f4c98d521f57f6c77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a159d340c7004b62b1432151d5ef4760/1920.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, ROBERT BUMSTED and ELLIOT SPAGAT",
      "description": "NEW YORK (AP) — Damien, age 5, was giddy with excitement as he left a Manhattan homeless shelter, sometimes running and skipping along the sidewalk accompanied by his wistful mother, a migrant from Ecuador.",
      "publishedAt": "2023-09-07T15:15:39Z",
      "title": "An influx of migrant children tests the preparedness of NYC schools",
      "url": "https://apnews.com/89ca1291432e940e4885befca105f2a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0635b3d7f747479a9368cf4890973dcc/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}