{
  "articles": [
    {
      "author": "Melanie Lidman",
      "description": "An Israeli probe into the killings of 15 Palestinian medics last month in Gaza by Israeli forces says it has found “professional failures” and a deputy commander will be fired. Israel at first claimed that the medics’ vehicles did not have emergency signals on when troops opened fire but later backtracked. Cellphone video recovered from one of the medics contradicted Israel’s initial account. The military investigation said Sunday that the deputy battalion commander, “due to poor night visibility,” assessed that the ambulances belonged to Hamas militants.",
      "publishedAt": "2025-04-20T13:23:29Z",
      "title": "Israeli probe into killings of Palestinian medics finds 'failures'",
      "url": "https://apnews.com/article/gaza-palestinians-israel-hamas-war-medics-killed-437b6ae1e9cf45b3099134524380f004",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f94562/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2Fea%2F1577b442e4cdc9a5410360d3064a%2F918c3792b58944c28d3b79ef76f98fac"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican is celebrating Easter without Pope Francis presiding. The 88-year-old pontiff continues his recovery from a near-fatal bout of double pneumonia. In his place, Cardinal Angelo Comastri, the retired archpriest of St. Peter’s Basilica, celebrated the open-air Mass before thousands of people in St. Peter’s Square. Francis has only appeared in public a handful of times since returning to the Vatican on March 23 after a 38-day hospital stay. He skipped the solemn services of Good Friday and Holy Saturday leading up to Easter. But he was expected to make an appearance on Sunday, according to the Mass booklet and liturgical plans released by the Vatican.",
      "publishedAt": "2025-04-20T09:03:38Z",
      "title": "Vatican's Easter Mass opens without Pope Francis",
      "url": "https://apnews.com/article/pope-vatican-easter-pneumonia-4b1182146a692479562b635a9723de2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c3bdcd/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F9e%2F4f0916a256f88f2c24dcc3b3dd89%2F5d91b226b67a42ad8249db8fb6cc5aa3"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy accused Russia of trying to create ‘impression of a ceasefire’, saying Russian forces continued attacks despite President Vladimir Putin’s unilateral declaration of an Easter ceasefire. Zelenskyy reported on Sunday 59 shelling incidents, five assaults, and multiple drone strikes. He reiterated Ukraine’s offer to extend the truce for 30 days but stressed his country would respond based on real battlefield conditions. Meanwhile, Russian-installed officials in occupied Kherson say Ukraine has also violated the truce. Putin offered no details on how the ceasefire would be monitored.",
      "publishedAt": "2025-04-20T06:56:19Z",
      "title": "Russia is trying to create 'impression of a ceasefire,' Zelenskyy says",
      "url": "https://apnews.com/article/russia-ukraine-easter-ceasefire-zelenskyy-putin-attacks-934e5c2a493be32b605ddb84d955b34b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eeb672/2147483647/strip/true/crop/11648x6552+0+1092/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fde%2F02c30476064785dd766f7bae63c7%2F6fe4ea41dbac4216b9bcc8b9744fd905"
    },
    {
      "author": null,
      "description": "Justice Samuel Alito has written a sharp dissent that castigates the seven-member majority for blocking the Trump administration from deporting any Venezuelans held in northern Texas under an 18th-century wartime law. The dissent was released Saturday night, hours after the court’s intervention against the Republican administration. Alito says the Supreme Court acted “literally in the middle of the night” and without sufficient explanation. Alito says there was “dubious factual support” for granting the request in an emergency appeal from the American Civil Liberties Union. That group contends that immigration authorities appeared to be moving to restart such removals under the Alien Enemies Act of 1798.",
      "publishedAt": "2025-04-20T13:54:39Z",
      "title": "Alito's dissent in deportation case says justices rushed to block Trump",
      "url": "https://apnews.com/article/alito-supreme-court-deport-trump-venezuelans-dissent-300f6ca71758f05d7518b69af58ad418",
      "urlToImage": "https://dims.apnews.com/dims4/default/71df77b/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F75%2F61918081c463af67b03bfceecfe2%2Fdff0098db1424fb79cd44576c275eb3b"
    },
    {
      "author": "Ryan J. Foley",
      "description": "The Kansas City, Missouri, metropolitan area has long been a regional hub for the federal government, and the pain from the Trump administration's cuts can be seen everywhere. Thousands of federal workers fear they'll lose their jobs. Some have been let go. Many are considering early retirement or buyouts. One researcher expects the region could lose as many as 6,000 good-paying federal jobs, which in turn would eliminate thousands more in other industries. Cuts to food aid programs have affected a farmers market and food pantry in a low-income neighborhood. And the city has paused plan to upgrade its public health laboratory after federal grants were abruptly canceled.",
      "publishedAt": "2025-04-20T12:31:10Z",
      "title": "DOGE's cuts tear through Kansas City, Missouri, a federal worker hub",
      "url": "https://apnews.com/article/doge-federal-cuts-job-musk-trump-kansas-city-06023cbc68c82fdaa021ced1069fd81c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8990602/2147483647/strip/true/crop/5165x2905+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F14%2F410b026a074825b7181e5ec9d2c8%2F22c0fdbf92dc45ecb0cffc25c43a8be9"
    },
    {
      "author": "Jamie Stengle",
      "description": "Nearly six years after a man fatally shot 23 people in a racist attack targeting Hispanic shoppers at a Walmart in Texas near the U.S.-Mexico border, the gunman's criminal case is set to come to a close. Patrick Crusius is expected to enter a guilty plea Monday in state district court to capital murder in the El Paso massacre, which is one of the deadliest mass shootings in U.S. history. Crusius is now 26 and is expected to receive a life sentence with no possibility of parole. He has already been sentenced to 90 consecutive life sentences by a federal judge.",
      "publishedAt": "2025-04-20T04:03:39Z",
      "title": "Man who fatally shot 23 at El Paso Walmart set to plead guilty to murder nearly 6 years on",
      "url": "https://apnews.com/article/el-paso-texas-walmart-shooting-plea-hearing-479ddea85462483cd23b6217925b11f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f096a9/2147483647/strip/true/crop/5198x2924+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F9f%2F649b9f7aa4169a890a23f6049585%2Fff413e1292314c20837f99c6987ee423"
    },
    {
      "author": "Dee-Ann Durbin",
      "description": "Raising a child in America has never been cheap. In the first year alone, it costs an average of $20,384, according to parenting website Baby Center. But President Donald Trump's new tariffs will make it many times more expensive. The Juvenile Products Manufacturers Association estimates that 90% of the core products used to care for babies are made in Asia. That includes strollers, bottles, diaper pails and car seats The association has asked the Trump administration to exempt baby products from import taxes. Trump gave car seats and high chairs an exemption during his first administration, but it's unclear if he will do that again.",
      "publishedAt": "2025-04-20T10:40:01Z",
      "title": "Tariffs are likely to make having a baby cost more",
      "url": "https://apnews.com/article/baby-products-tariffs-strollers-car-seats-96496556c8913f521021d0c165eca977",
      "urlToImage": "https://dims.apnews.com/dims4/default/c740730/2147483647/strip/true/crop/5784x3254+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fc4%2Fe4f8841758bdd92f092136e438b9%2Fb2839855718e4d7eb3545c5589f54145"
    },
    {
      "author": null,
      "description": "Police say a woman and a child in Oklahoma flooding as as parts of the region have been hit by severe storms. Police in Moore say two cars were stranded in flood waters Saturday evening and one was swept away under a bridge. Police say they were able to rescue others but two people were found dead, including a 12-year-old boy. Large swaths of Oklahoma remain under a National Weather Service flood watch through Sunday, along with parts of Texas, Missouri, Arkansas and southern Illinois.",
      "publishedAt": "2025-04-20T12:22:32Z",
      "title": "Police: 2 dead in Oklahoma flooding as region remains under severe weather watch",
      "url": "https://apnews.com/article/oklahoma-flooding-deaths-weather-40b64f26f878c37fb5eccb9ff118c35f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Gene Johnson",
      "description": "Marijuana culture’s high holiday known as 4/20 falls this year on Easter, as well as the last day of Passover. That means cannabis fans can celebrate in some unusual ways, including an Easter nug hunt in Los Angeles, kosher-style THC gummies in New York and a blaze and praise drag brunch in Portland, Oregon. Some 300 people are expected to partake in the Easter nug scavenger hunt this weekend, aided by a mobile app leading them through participating dispensaries, trivia challenges and so-called stoner activities. The origin of the term 4/20 dates to the 1970s and a group of bell-bottomed buddies at a high school north of San Francisco who called themselves the Waldos.",
      "publishedAt": "2025-04-20T04:42:07Z",
      "title": "Marijuana holiday 4/20 coincides with Easter and Passover this year. Here's what to know",
      "url": "https://apnews.com/article/marijuana-cannabis-holiday-420-easter-sunday-cb03d644627c9fdde04ca9e3a3a619f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f69c369/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F30%2F20461ba50ff12fad8e11b3dbe328%2F67034ecb5768403f973731ed776fac11"
    },
    {
      "author": null,
      "description": "Some of the fastest canines on four very short legs have raced for glory in Scotland’s annual Corgi Derby. The Musselburgh Racecourse Corgi Derby was first held in 2022 to mark Queen Elizabeth II’s 70 years on the throne. The late monarch was a devoted corgi fan who owned almost 30 of the breed over the decades. Four-year-old Juno beat a 16-strong field of dashing dogs dressed in bright sweaters over the 230-foot race on Saturday. The winner was were presented with a trophy and dog treats by tennis coach Judy Murray, mother of Scottish star Andy Murray.",
      "publishedAt": "2025-04-20T10:43:19Z",
      "title": "Queen Elizabeth II's favorite dogs race for glory in Britain's Corgi Derby",
      "url": "https://apnews.com/article/corgi-race-scotland-juno-c00a643b2e60b98f8fcf854e3745f4f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/f865cee/2147483647/strip/true/crop/2192x1233+0+102/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Fc5%2Fd6c68217e1cdee96a864c9daa3f3%2F365ec5888cb54efc9651ab0ada5eda49"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}