{
  "articles": [
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden welcomed NATO leaders to Washington on Tuesday by celebrating their unity against Russia's Ukraine aggression and underscoring America's ironclad commitment to the alliance under his watch — a message that seemed aimed at bucking up his own wobbly Democratic supporters as much as allies confronting the prospect of a return to the White House of NATO skeptic Donald Trump.",
      "publishedAt": "2024-07-09T04:06:08Z",
      "title": "Biden spotlights support for NATO as he looks to use summit to help reset stumbling campaign",
      "url": "https://apnews.com/a6521773d23bd79637590fdb6526b57c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/748368a17f7a4530bedf2e2910632fe0/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The mood on Capitol Hill turned grimly uncertain Tuesday as Democrats wrestled over President Joe Biden’s re-election and the extraordinary question before them — whether to stand behind his candidacy or push the president to bow out amid concerns over his ability to lead them to victory.",
      "publishedAt": "2024-07-09T17:40:44Z",
      "title": "Biden's support on Capitol Hill grimly uncertain. A seventh Democrat says he should drop out",
      "url": "https://apnews.com/a8926189431d70686f2f1abdc5540fa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f9c068ae6aa4fb09df4ce7e256aa15c/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and MICHELLE L. PRICE",
      "description": "MIAMI (AP) — After largely ceding the spotlight to the mounting turmoil surrounding President Joe Biden 's campaign in the wake of their debate, former President Donald Trump returns to the campaign trail Tuesday after days of laying low, golfing and letting Democratic infighting play out in public.",
      "publishedAt": "2024-07-09T04:12:44Z",
      "title": "Trump returns to campaigning as deadline to name running mate nears, Biden rejects calls to withdraw",
      "url": "https://apnews.com/6893fb5c5aac589ad83f151e49729bb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a27396a7a244c5892240598bedc8f15/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy has proven to be an adept navigator of international relations in defense of his war-ravaged country, publicly cajoling and sometimes loudly complaining to get the military assistance it needs to defend itself against Russia's invasion.",
      "publishedAt": "2024-07-09T18:06:37Z",
      "title": "Zelenskyy is adept at pushing for the aid Ukraine needs, but NATO membership is still elusive",
      "url": "https://apnews.com/7f6a042e323af10e0425239ea5a023c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2f34492f38a45ab8426115723474e1a/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An apparent Israeli airstrike on a school-turned-shelter in southern Gaza killed at least 25 Palestinians on Tuesday, as heavy bombardment in the north forced the closure of medical facilities in Gaza City and sent thousands fleeing in search of increasingly elusive refuge.",
      "publishedAt": "2024-07-09T13:17:41Z",
      "title": "Airstrike kills 25 in southern Gaza as Israeli assault on Gaza City shuts down medical facilities",
      "url": "https://apnews.com/5c8eb2a36e22fb0ea7666b73e5c0b54c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0826f6f00b430f97be168369d9b108/1920.jpeg"
    },
    {
      "author": "FRANKLIN BRICEÑO and AMY TAXIN",
      "description": "LIMA, Peru (AP) — Twenty two years ago, an avalanche buried American climber William Stampfl as he made his way up one of the highest peaks in the Andes mountains.His family knew there was little hope of finding him alive, or even of retrieving his corpse from the thick fields of snow and the freezing ice sheets that cover the 6,700-meter (22,000-foot) tall Huascaran peak.",
      "publishedAt": "2024-07-09T15:32:37Z",
      "title": "The body of an American climber buried by an avalanche 22 years ago in Peru is found in the ice",
      "url": "https://apnews.com/6110403becbcb4fc6b1ab26f01f54f7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f980e7ffd533457d8a2366d5475e8cd7/2400.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and MARK VANCLEAVE",
      "description": "HOUSTON (AP) — Many of the millions left without power after Hurricane Beryl crashed into Texas sweltered and grumbled Tuesday as the storm gutted access to air conditioning, food and water, and smothering heat and humidity draped over the nation's fourth-largest city.",
      "publishedAt": "2024-07-09T04:04:36Z",
      "title": "Frustrations mount in the Houston heat after Beryl moves on and leaves millions without power",
      "url": "https://apnews.com/8bfeeed79444eed0bf116d09f1ea7e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d45f88deea425dbb9391c111998744/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Manhattan prosecutors said Tuesday that they intend to bring new sexual assault charges against Harvey Weinstein as they anticipate a November retrial for the disgraced media mogul.",
      "publishedAt": "2024-07-09T14:33:50Z",
      "title": "NYC prosecutors intend to bring new sexual assault charges against Harvey Weinstein ahead of retrial",
      "url": "https://apnews.com/3d7151343d25ee65c3cb7849100e4fa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf1406e0d9a24edbb00b46c9b17c9907/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Sixteen jurors were seated Tuesday for Alec Baldwin’s involuntary manslaughter trial in New Mexico, where opening statements are set to start Wednesday.",
      "publishedAt": "2024-07-09T04:12:53Z",
      "title": "Jury is seated in Alec Baldwin's involuntary manslaughter trial in New Mexico",
      "url": "https://apnews.com/a6731e3226df0990f0469845df3ccde8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d1407592f942459568bf66f376f621/1920.jpeg"
    },
    {
      "author": "KIMBERLY CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — A company has installed computerized vending machines to sell ammunition in grocery stores in Alabama, Oklahoma and Texas, allowing patrons to pick up bullets along with a gallon of milk.",
      "publishedAt": "2024-07-09T22:05:17Z",
      "title": "Milk, eggs and now bullets for sale in handful of US grocery stores with ammo vending machines",
      "url": "https://apnews.com/ddb2e507213cda8ef46da0d8146253ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e72e73ac9f742d8bfcefd29dc628150/2160.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}