{
  "articles": [
    {
      "author": "DAVID RISING, JON GAMBRELL",
      "description": "President Donald Trump’s proposal that the United States “take over” the Gaza Strip and permanently resettle its Palestinian residents has been swiftly rejected and denounced by American allies and adversaries alike. Saudi Arabia weighed in quickly, noting the kingdom's long call for an independent Palestinian state was a “firm, steadfast and unwavering position.” Similarly, Australian Prime Minister Anthony Albanese told reporters that his country has long supported a two-state solution in the Middle East and that nothing has changed. the militant Hamas group, which sparked the war with its attack on Israel, called the proposal a “recipe for creating chaos\" in the region.",
      "publishedAt": "2025-02-05T05:55:42Z",
      "title": "Allies, adversaries reject Trump's suggestion for US 'take over' of Gaza Strip",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-netanyahu-db2c407baf803291a4acf6edfd708c48",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba11785/2147483647/strip/true/crop/8528x4797+0+445/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F97%2F3e0c005850b164e9f9cb7d0c303b%2F9f2bee9f910548aa9e1c16c1aee1dac9"
    },
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG, ZEKE MILLER",
      "description": "President Donald Trump has suggested that displaced Palestinians in Gaza be permanently resettled outside the war-torn territory and proposed the U.S. take “ownership” in redeveloping the area. Trump’s brazen proposal appears certain to roil the next stage of talks meant to extend the tenuous ceasefire between Israel and Hamas and secure the release of the remaining hostages held in Gaza. The president made the provocative comments as he held talks Tuesday with Israeli Prime Minister Benjamin Netanyahu at the White House. The two leaders also discussed the fragile ceasefire and hostage deal in the Israeli-Hamas conflict and shared concerns about Iran's nuclear program.",
      "publishedAt": "2025-02-04T05:02:26Z",
      "title": "Trump says he wants US to take ownership of Gaza Strip",
      "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3",
      "urlToImage": "https://dims.apnews.com/dims4/default/10836f6/2147483647/strip/true/crop/5717x3216+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Ffd%2F3b1378303097ef6a2e86c95b2847%2F87094f8ca3404b6eb2630f6ad6ce215d"
    },
    {
      "author": "WILL WEISSERT, MICHELLE L. PRICE, ZEKE MILLER",
      "description": "President Donald Trump offered a jaw-dropping performance during his joint news conference with Israeli Prime Minister Benjamin Netanyahu, suggesting that Palestinian refugees from the Gaza Strip could be permanently resettled elsewhere. He suggested on Tuesday that the U.S. could stage a long-term takeover of the vacated region, even leading redevelopment efforts to make it a seaside paradise in waiting. He also refused to rule out sending U.S. troops in to seal the deal and said he himself — ever the real estate developer — might pay a personal visit. The suggestions will be non-starters for Hamas, though. And they could jeopardize the continuation of a tenuous ceasefire in Gaza and the release of hostages the group is still holding.",
      "publishedAt": "2025-02-05T05:02:13Z",
      "title": "Trump talks Gaza takeover and other takeaways from his appearance with Netanyahu",
      "url": "https://apnews.com/article/trump-netanyahu-gaza-strip-israel-palestinians-a97ea5e16419ba33c815801a24b8909c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3be1423/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F7c%2Fca89cbbe1ba5ea4bc02866757ada%2Ff5b85b7a1fee4e1b90d90a77215bd083"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "Gaza has long been a powder keg, and it exploded after Hamas fighters stormed southern Israel on Oct. 7, 2023, and began killing and abducting people, sparking a crushing Israeli military operation there that’s only recently reached an uneasy ceasefire. President Donald Trump’s suggestion Tuesday that that displaced Palestinians in Gaza be permanently resettled outside the war-torn territory and the U.S. take “ownership” may spark new tension over the enclave against the Mediterranean Sea.",
      "publishedAt": "2025-02-05T04:50:39Z",
      "title": "The history of the Gaza Strip after Trump's remarks",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-history-6db716f4d924f0a14321e6e68cd50ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ccc32c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F5e%2F297fde535f6a0462697d3e008ad5%2F295690a11a2446f29f4f1acc5480df4f"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "President Donald Trump has announced that the United States will withdraw from the U.N.’s top human rights body and will not resume funding for the U.N. agency helping Palestinian refugees. The U.S. left the Geneva-based Human Rights Council last year. And it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the attacks in southern Israel on Oct. 7, 2023, which UNRWA denies. Trump’s announcement Tuesday came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism.",
      "publishedAt": "2025-02-05T00:34:28Z",
      "title": "Trump announces withdrawal from UN human rights body and halt to funding for Palestinian refugees",
      "url": "https://apnews.com/article/trump-un-human-rights-palestinian-refugees-israel-05e1d57bbb41df38771d1ab69adb21a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/16413f1/2147483647/strip/true/crop/4883x2747+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F95%2F62506e1570751c41acdc794a7461%2Fd11d670e495d4205b980380e6607343a"
    },
    {
      "author": "MICHELLE L. PRICE, AAMER MADHANI, ZEKE MILLER",
      "description": "President Donald Trump says he’s given his advisers instructions to obliterate Iran if it assassinates him. Trump adds that \"there won’t be anything left” if Iran kills him. He made the remarks in an exchange with reporters Tuesday while signing an executive order calling for the U.S. government to impose maximum pressure on Tehran. The Justice Department announced in federal charges in November that an Iranian plot to kill Trump before the presidential election had been thwarted. The department alleged Iranian officials had instructed Farhad Shakeri, 51, in September to focus on surveilling and ultimately assassinating Trump. Shakeri is still believed to be at large in Iran.",
      "publishedAt": "2025-02-04T20:21:32Z",
      "title": "Trump says he's given advisers instructions for Iran to be 'obliterated' if it assassinates him",
      "url": "https://apnews.com/article/trump-iran-assassination-88c9b1a0754165125d59d378bf4af477",
      "urlToImage": "https://dims.apnews.com/dims4/default/68c4242/2147483647/strip/true/crop/3658x2058+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F53%2F36a0bf0e4e03d624ce6c4eb946e4%2F97fb492e00534bd084a905d98321f9d1"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "A sweeping new U.S. tariff on products made in China is expected to increase the prices American consumers pay for a wide array of products. An additional 10% tariff on all Chinese goods is likely drive up prices for ultra-cheap apparel sold on online shopping platforms, toys and electronic devices such as computers and cellphones. The tariffs also may affect how much consumers pay for shoes and kitchen items like pots and pans, as well as the big-ticket items, such as appliances, furniture and auto parts. The tariffs on Chinese imports took effect after President Donald Trump agreed to pause his threatened tariffs against Mexico and Canada for 30 days.",
      "publishedAt": "2025-02-04T23:54:48Z",
      "title": "Trump tariffs on China take effect. Here's what may cost more in the US",
      "url": "https://apnews.com/article/china-tariffs-trump-shein-temu-023aaee8f043605e62a614eaa5134f62",
      "urlToImage": "https://dims.apnews.com/dims4/default/602480e/2147483647/strip/true/crop/3277x1843+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fbc%2Fa5ac2e65c44685ba32e2176026fa%2F6031654009fc46f6a2671c0fcce614d8"
    },
    {
      "author": "STEFANIE DAZIO, SERGEI GRITS",
      "description": "Sweden’s worst mass shooting has left at least 11 people dead, including the gunman, at an adult education center as officials warned that the death toll could rise. Police believe the perpetrator acted alone but haven't said if he was a student or what his motive may have been. Tuesday's violence occurred at a school on the outskirts of Orebro west of Stockholm. It offers primary and secondary educational classes for adults, Swedish-language classes for immigrants, vocational training and programs for people with intellectual disabilities. Gun violence at schools is very rare in Sweden.",
      "publishedAt": "2025-02-05T06:57:46Z",
      "title": "Sweden mass shooting leaves at least 11 dead at adult education center",
      "url": "https://apnews.com/article/sweden-shooting-adult-education-center-fa26e8064a0708ddc213c7cd9f50267c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2726627/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2Fef%2F4c9972aa0d8833ca969849e5bf9a%2Ff063f6966f0a4bb6921e55cd5b16e2d6"
    },
    {
      "author": "JUSTIN KABUMBA, JEAN-YVES KAMALE",
      "description": "Congo’s government has described the unilateral ceasefire declared by Rwanda-backed rebels in eastern Congo as “false communication,” while the United Nations on Tuesday noted reports of heavy fighting with Congolese forces in the region. The M23 rebels on Monday announced the ceasefire on humanitarian grounds after pleas for the safe passage of aid and hundreds of thousands of displaced people. But “all we are waiting for is the withdrawal of the M23,” Congo’s government spokesperson told journalists. The M23 last week seized control of Goma, a city of 2 million people at the heart of a region home to trillions of dollars in mineral wealth.",
      "publishedAt": "2025-02-04T20:27:29Z",
      "title": "Congo calls rebels' ceasefire 'false communication,' UN reports heavy fighting",
      "url": "https://apnews.com/article/congo-rebels-goma-m23-rwanda-ceasefire-24470048e1382a787131ce81d1ee7c5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/305df40/2147483647/strip/true/crop/6814x3833+0+355/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F89%2Fd07504c120e260eb5884af022d81%2Fe54c0666269f4ba08e96659002fc3bcf"
    },
    {
      "author": "ELLEN KNICKMEYER, MATTHEW LEE",
      "description": "President Donald Trump's administration says it's pulling almost all U.S. Agency for International Development workers off the job and out of the field worldwide. The order takes effect just before midnight Friday and gives direct hires of the agency overseas 30 days to return home unless they're deemed essential. The notice posted online Tuesday says contractors not determined to be essential also would be fired. The move had been rumored for several days and is the most extreme of several proposals considered for consolidating the agency into the State Department. Thousands of USAID employees already have been laid off and programs worldwide shut down after the Republican president imposed a sweeping freeze on foreign assistance.",
      "publishedAt": "2025-02-05T02:33:59Z",
      "title": "Trump administration puts USAID direct hires on leave worldwide",
      "url": "https://apnews.com/article/trump-usaid-layoffs-7e0a159d8a419c4c9388ab02e8259f23",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a6ec37/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F9d%2F34f9adb0c79bcedd527f30260849%2Fc9c1e4f1efdf4bc1936bc6e4811af535"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}