{
  "articles": [
    {
      "author": "MELANIE LIDMAN, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "TEL AVIV, Israel (AP) — The Israeli military is preparing for a possible ground operation in Lebanon, the Israeli army chief said Wednesday as Hezbollah hurled dozens of projectiles into Israel, including a missile aimed at Tel Aviv that was the militant group's deepest strike yet.",
      "publishedAt": "2024-09-25T06:28:45Z",
      "title": "Israeli army chief says military is preparing for a possible ground operation in Lebanon",
      "url": "https://apnews.com/62cb173728d341c845bff9859addc7a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a47f8f01b6204b91a479c62f44084f4f/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL and ALBERT AJI",
      "description": "JDEIDET YABOUS, Syria (AP) — Families fleeing the escalating conflict in Lebanon poured into Syria in growing numbers on Wednesday, waiting for hours in heavy traffic to reach the relative safety of another war-torn country.",
      "publishedAt": "2024-09-25T17:25:58Z",
      "title": "Thousands are pouring into Syria, fleeing worsening conflict in Lebanon",
      "url": "https://apnews.com/8a1fbde03c81fb3672e27d479f5b5a34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67a9e22c74164d378c6013ccaac7c4bd/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — The acting director of the Secret Service was incensed at what had happened that July evening. “What I saw made me ashamed,” Ronald Rowe Jr. said. “I cannot defend why that roof was not better secured.”",
      "publishedAt": "2024-09-25T12:16:40Z",
      "title": "A tale of crushing security lapses and missed chances to stop the man who shot Trump",
      "url": "https://apnews.com/1a6d957a9607b350c362b0a4e2a3e1b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ca3186190464c7b916eed89f5cede8f/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Derided by Donald Trump as a “communist,” Kamala Harris is playing up her street cred as a capitalist.Attacked by Harris as a rich kid who got $400 million from his father on a “silver platter,” Trump is leaning into his raw populism.",
      "publishedAt": "2024-09-25T09:06:10Z",
      "title": "In dueling speeches, Harris is to make her capitalist pitch while Trump pushes deeper into populism",
      "url": "https://apnews.com/bda4bfe7cb02c1c5c2f6232bf05ad670",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f24ac07dcd1c4c25a30ed416032b56c6/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and STEPHEN SMITH",
      "description": "TALLAHASSEE, Fla. (AP) — Helene became a hurricane Wednesday after the huge storm rapidly strengthened in the Caribbean Sea and moved north along Mexico's coast on a path toward the U.S., leading residents to evacuate, schools to close, and officials to declare emergencies in Florida and Georgia.",
      "publishedAt": "2024-09-25T04:45:17Z",
      "title": "Helene is expected to strike Florida as a major hurricane. Residents are fleeing",
      "url": "https://apnews.com/a953d0a51d219226f7d76178af2d3f4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4895f681636427d9fc2c5c2241bc00e/1920.jpeg"
    },
    {
      "author": "BERENICE GARCIA, URIEL J. GARCÍA, JUAN LOZANO, JAKOB MAURER, ALEJANDRO SERRANO and ELLIOT SPAGAT",
      "description": "As midnight nears, the lights of El Paso, Texas, and Ciudad Juárez, Mexico, fill the sky on the silent banks of the Rio Grande. A few months ago, hundreds of asylum-seeking families, including crying toddlers, waited for an opening to crawl through razor wire from Juarez into El Paso.",
      "publishedAt": "2024-09-25T10:06:07Z",
      "title": "One day along the Texas-Mexico border shows that realities shift more rapidly than rhetoric",
      "url": "https://apnews.com/a378073ed4e565570b4d4aa20f3a9ff8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63c1f96d4a774c3aa0414bcaa87320d8/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "UNITED NATIONS (AP) — Ukraine’s president urged global leaders Wednesday to stand with his country and not seek “a lull” instead of a “real, just peace\" more than two years into Russia's war.",
      "publishedAt": "2024-09-25T14:21:50Z",
      "title": "Ukraine urges world leaders not to seek 'lull' in Russia's war instead of true peace",
      "url": "https://apnews.com/6ce7f77db02cc391b950d5e2c4781823",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/194d1e2b074a47fc9cfc17cd4f25a7d7/2672.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — From the dais of the U.N. General Assembly just a year ago, Israeli Prime Minister Benjamin Netanyahu triumphantly hailed a new peace he said would sweep through the Middle East.",
      "publishedAt": "2024-09-25T08:51:41Z",
      "title": "Netanyahu will address the UN as Israel, bogged down by one war, barrels toward another",
      "url": "https://apnews.com/e761de05e4c4a7f54bfd27e8795bceb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00b0d5309d0341b988c4c2beda0c4c3e/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and DAVID SHARP",
      "description": "The carbon fiber hull of the experimental submersible that imploded en route to the wreckage of the Titanic had imperfections dating to the manufacturing process and behaved differently after a loud bang was heard on one of the dives the year before the tragedy, an engineer with the National Transportation Safety Board said Wednesday.",
      "publishedAt": "2024-09-25T04:17:20Z",
      "title": "NTSB engineer says carbon fiber hull from submersible showed signs of flaws",
      "url": "https://apnews.com/f1ee1b9d4e48bf782af328590c417f03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b71476c31ed45ed96a10ee3e2a861cb/1920.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "VENICE, Italy (AP) — “ Joker ” is a hard act to follow. Todd Phillips’ dark, Scorsese-inspired character study about the Batman villain made over a billion dollars at the box office, won Joaquin Phoenix his first Oscar, dominated the cultural discourse for months and created a new movie landmark.",
      "publishedAt": "2024-09-25T13:22:02Z",
      "title": "C’mon get happy, Joker is back (this time with Lady Gaga)",
      "url": "https://apnews.com/e66d45aea04ef20a728e5a979eab17cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d4c98f6899b4c8693813343e8fe753b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}