{
  "articles": [
    {
      "author": null,
      "description": "Gaza health officials and the ambulance service say at least 25 people were killed by Israeli airstrikes and gunshots overnight as ceasefire talks appear to have stalled and Palestinians in Gaza are facing famine. The majority of people were killed by gunfire waiting for aid trucks close to the Zikim crossing with Israel, officials said Saturday. The strikes come as ceasefire talks between Israel and Hamas have hit a standstill after the U.S and Israel recalled their negotiating teams this week throwing the future of the negotiations into further uncertainty. The United Nations and experts say that Palestinians in Gaza are at risk of famine, with reports of increasing numbers of people dying from causes related to malnutrition.",
      "publishedAt": "2025-07-26T09:37:43Z",
      "title": "At least 25 people killed by Israeli gunshots and strikes in Gaza, some while seeking aid",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-26-2025-8eca83b00e50f1e6d78a0cce877b3b90",
      "urlToImage": "https://dims.apnews.com/dims4/default/eda1a1e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fd7%2Fbe3f44997ba007c899e86a8e0775%2F9738ac005d6d4deca84257ca17453ec4"
    },
    {
      "author": null,
      "description": "Families of Palestinian-Americans killed in the West Bank are demanding justice. They say Israeli settlers and forces have killed four American teenagers of Palestinian descent since the Gaza war began. The families have expressed doubt that anyone will be held accountable. They say they are losing faith in the U.S. government's promises to seek justice. The Trump administration has urged Israel to investigate but has not promised its own investigations. Critics argue Israel often treats its soldiers and settlers with impunity. The families of those killed report facing travel bans, interrogations, and detentions.",
      "publishedAt": "2025-07-26T05:14:31Z",
      "title": "Families of Americans slain in West Bank press for justice",
      "url": "https://apnews.com/article/israel-palestinians-killed-west-bank-trump-gaza-41ec0962b4fe87498a781b87f85949ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/cee747d/2147483647/strip/true/crop/2032x1143+0+106/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2Fb4%2F114d26075e7e4d3b2eeed47f6493%2F6bb6d29515d043829bcecd844a5a28d5"
    },
    {
      "author": null,
      "description": "Thailand and Cambodia have accused each other of new attacks as border clashes continue for a third day, leaving at least 33 people dead and over 168,000 displaced as international pressure mounts on both sides to reach a ceasefire. Artillery fire and gunshots have been reported near several border villages. The fighting flared again Thursday after a land mine explosion wounded five Thai soldiers. Both countries have recalled their ambassadors, and Thailand has closed its northeastern border crossings with Cambodia. The U.N. Security Council has called for de-escalation and urged ASEAN to mediate a peaceful solution. Human Rights Watch has urged both governments to protect civilians.",
      "publishedAt": "2025-07-26T09:18:21Z",
      "title": "Thailand and Cambodia trade accusations as deadly border clashes enter third day",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-eda96eb133a4561fa192029466da8dcf",
      "urlToImage": "https://dims.apnews.com/dims4/default/b47abe0/2147483647/strip/true/crop/3365x1893+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Fbb%2Fd0d805b7c3aa4b63a4f94b5128da%2F635772705f66480695ad1f80e1f7ea24"
    },
    {
      "author": null,
      "description": "Unknown attackers have launched a gun and grenade attack on a court building in southeast Iran, killing six people and wounding 20. State TV reports that security forces killed three of the gunmen in the armed clash in Sistan and Baluchestan province. The attack happened in the capital city of Zahedan. Police and security forces quickly took control of the site. The semiofficial Tasnim news agency blamed the militant group Jaish al-Adl for the attack. The province has been the site of occasional deadly clashes involving militant groups, armed drug smugglers and Iranian security forces.",
      "publishedAt": "2025-07-26T08:49:16Z",
      "title": "Unknown gunmen kill 6, wound 20 in an attack on a court building in southeast Iran",
      "url": "https://apnews.com/article/iran-gunmen-armed-attack-35e64d11996ec195413ae508d32f55b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "In the aftermath of intense sectarian fighting, the eerily silent streets of Syria's southern province of Sweida are filled with the stench of decaying bodies left uncollected for days amid scenes of charred buildings and burned-out cars. The destruction has left a haunting silence across the Druze-majority city. This follows deadly clashes that erupted last week between Druze fighters and armed Bedouin clans, killing hundreds and devastating the once-bustling southern province. The violence has shaken Syria’s fragile postwar transition and strained the Druze community’s relations with the new government. Though authorities intervened, they were seen as siding with the clans, fueling perceptions of targeted sectarian attacks.",
      "publishedAt": "2025-07-26T10:00:44Z",
      "title": "Streets of Syria's Sweida filled with stench of death after sectarian bloodshed",
      "url": "https://apnews.com/article/syria-sweida-sectarianism-ahmad-alsharaa-druze-fighting-e1cec070de22805a492c9151c0ec6fd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/a0ffaed/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F14%2F10f6eef1c9d810f066566383dca8%2Fd871cfecc88e4019bbc6dce9bf810ac7"
    },
    {
      "author": null,
      "description": "Florida Gov. Ron DeSantis says deportation flights from the remote Everglades immigration lockup known as ”Alligator Alcatraz″ began in the past few days. DeSantis said Friday that the flights operated by the Department of Homeland Security have transferred about 100 detainees from the immigration detention center to other countries. He expects that number to increase soon. Officials say two or three flights have happened, though they didn't say which countries those flights headed to. Critics have condemned the facility as cruel and inhumane, but DeSantis and other Republicans have defended it as part of the state’s aggressive push to support President Donald Trump’s crackdown on illegal immigration.",
      "publishedAt": "2025-07-25T14:27:41Z",
      "title": "Florida governor says deportation flights from 'Alligator Alcatraz' have started",
      "url": "https://apnews.com/article/alligator-alcatraz-desantis-immigration-264b9d3cf49be876ed6bcb32c07e23bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/936c00b/2147483647/strip/true/crop/5200x2925+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F24%2F3efc5ed46c9f9e5e55d2e70557e7%2F5240e3e2a6dd4758be381b5259c256cc"
    },
    {
      "author": null,
      "description": "Taiwanese voters have rejected a bid to oust about one-fifth of their lawmakers from the opposition Nationalist Party in a recall election. The ruling Democratic Progressive Party hoped to flip the balance of power in the legislature. Preliminary results on Saturday showed the recall efforts failed to remove any of the KMT lawmakers. The recall elections are unprecedented in scale, with more votes set for August 23. If those results are unfavorable to the DPP, President Lai Ching-te's government could face strong resistance in the legislature before the next elections expected in 2028.",
      "publishedAt": "2025-07-26T01:18:25Z",
      "title": "Taiwanese voters reject bid to oust lawmakers from China-friendly party in closely watched poll",
      "url": "https://apnews.com/article/taiwan-recall-oust-lawmakers-kmt-dpp-china-e81a7dc977ff5f0d1924c930fce6ac06",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf6b0fb/2147483647/strip/true/crop/5000x2813+0+324/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F74%2Fb5126156ea3048352577b451a9a0%2Faa1fd4b03385418f9e061c1ec37b1714"
    },
    {
      "author": null,
      "description": "President Donald Trump faces ongoing questions about the Jeffrey Epstein case, overshadowing his administration's achievements. On Friday, reporters pressed the Republican president about pardoning Epstein's accomplice, Ghislaine Maxwell, but he deflected, emphasizing his administration's successes. Despite enacting significant policies, Trump's past ties to Epstein continue to stir controversy. Supporters demand transparency, believing Epstein's death in a New York jail cell six years ago hides a larger conspiracy. Administration officials who previously fueled theories now claim there's nothing more to reveal. Trump denies prior knowledge of Epstein's crimes and urges supporters to move on. But the Epstein case remains a challenging distraction.",
      "publishedAt": "2025-07-25T18:23:42Z",
      "title": "Trump's toughest test: Shifting focus from Epstein case",
      "url": "https://apnews.com/article/trump-epstein-conspiracies-97200cfab77572a36bc9ab25841a8833",
      "urlToImage": "https://dims.apnews.com/dims4/default/93c7fb4/2147483647/strip/true/crop/5419x3048+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2F62%2F122b3265e297602a281fe3f95151%2F170cc21c3aca46cb878f39bb5abcc39b"
    },
    {
      "author": null,
      "description": "A 14-year-old boy has been killed and a 19-year-old has been wounded after in overnight shooting at a University of New Mexico dormitory. Authorities have arrested an 18-year-old suspect. University officials lifted a shelter in place order late Friday afternoon, saying the main campus in Albuquerque would still remain closed. Campus police said four people, including the suspect, were playing video games inside a dorm room belonging to one of them when the shooting began. State police said they are investigating why the suspect fired. The fall semester is scheduled to begin in about three weeks.",
      "publishedAt": "2025-07-25T13:15:23Z",
      "title": "Shooting at University of New Mexico dorm leaves 1 dead, 1 wounded",
      "url": "https://apnews.com/article/dorm-shooting-university-new-mexico-albuquerque-dcb395e35a2c1843a0d3c78147d1d84d",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5724be/2147483647/strip/true/crop/4752x2673+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F23%2F34bfa96a3c831102d86d2ecf6867%2Fb8568ede4ff545518222d3d664aa42f2"
    },
    {
      "author": null,
      "description": "Jared Allen was raised on a horse ranch in California and fulfilled his vision of becoming a professional football player with a fun-loving cowboy style. He totaled 136 sacks over 12 seasons in the NFL primarily with the Kansas City Chiefs and Minnesota Vikings. Allen will be inducted in the Hall of Fame next weekend. The crossroad of his career came in 2008 after the trade he requested from the Chiefs sent him to the Vikings. Allen cleaned up his life off the field and took his pass-rushing game to another level as the highest-paid defensive player in the league.",
      "publishedAt": "2025-07-26T10:00:10Z",
      "title": "Jared Allen's 136 sacks and fun-loving cowboy style for Chiefs, Vikings have him Hall of Fame-bound",
      "url": "https://apnews.com/article/hall-of-fame-induction-jared-allen-894d495c95e99262e44f2f0517509ce2",
      "urlToImage": "https://dims.apnews.com/dims4/default/defe5f8/2147483647/strip/true/crop/3758x2114+0+163/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fa7%2Fdc0c522b62b7c792c18898922e04%2Fcd5b2224ddce49549692b015f7cbb28c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}