{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday struck down a Trump-era ban on bump stocks, the rapid-fire gun accessories used in the deadliest mass shooting in modern U.S.",
      "publishedAt": "2024-06-14T14:13:26Z",
      "title": "Supreme Court strikes down Trump-era ban on rapid-fire rifle bump stocks, reopening political fight",
      "url": "https://apnews.com/b3bd1b4163d78514a6d5acc5b44c8b3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc382556be6e45fe953a42022e272981/1019.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "BARI, Italy (AP) — Leaders of the Group of Seven leading industrialized nations turned their attention to artificial intelligence, economic security and migration on the second and final day of their summit Friday, as their delegations worked on a comprehensive joint communique touching on many of the world's major geopolitical and social challenges.",
      "publishedAt": "2024-06-14T04:03:08Z",
      "title": "G7 leaders tackle migration, artificial intelligence on the second day of their summit in Italy",
      "url": "https://apnews.com/4ae6630cd267f87925f3dcbac2785aae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23aa0d44c3a04a73baa96cfd37318481/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and KELVIN CHAN",
      "description": "BARI, Italy (AP) — Pope Francis challenged leaders of the world’s wealthy democracies Friday to keep human dignity foremost in developing and using artificial intelligence, warning that such powerful technology risks turning human relations themselves into mere algorithms.",
      "publishedAt": "2024-06-14T04:27:52Z",
      "title": "Pope Francis becomes first pontiff to address a G7 summit, raises alarm about AI",
      "url": "https://apnews.com/610b8f16aac4d36aa8a56c88de2ca09f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b666cb7ba7e54e29bb0c57d27df1ef6e/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Russian President Vladimir Putin promised Friday to “immediately” order a cease-fire in Ukraine and start negotiations if Kyiv began withdrawing troops from the four regions annexed by Moscow in 2022 and renounced plans to join NATO.",
      "publishedAt": "2024-06-14T10:45:31Z",
      "title": "Putin offers truce if Ukraine exits Russian-claimed areas and drops NATO bid. Kyiv rejects it",
      "url": "https://apnews.com/4f58423548b3d2e8594c9d9eb8e9d36e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64fbf01adc29457d95f96f9e28c01a9d/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways. But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.",
      "publishedAt": "2024-06-14T10:55:14Z",
      "title": "US Navy faces its most intense combat since World War II against Yemen's Iran-backed Houthi rebels",
      "url": "https://apnews.com/7a9997f9d84ac669fae69ecf819913fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3112d2a2bfd4e79bef0b88e857f9dca/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A federal judge on Friday ordered the liquidation of conspiracy theorist Alex Jones ′ personal assets but was still deciding on his company’s separate bankruptcy case, leaving the future of his Infowars media platform uncertain as he owes $1.5 billion for his false claims that the Sandy Hook Elementary School shooting was a hoax.",
      "publishedAt": "2024-06-14T04:03:35Z",
      "title": "Alex Jones’ personal assets will be sold to help pay Sandy Hook debt as judge decides Infowars’ fate",
      "url": "https://apnews.com/3ccd113496caee18a085dfa54c6e6c0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bb09daacc0c4c05bf520511dc1be60e/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN and TATIANA POLLASTRI",
      "description": "MOGI GUACU, Brazil (AP) — Orange juice prices have always been volatile, falling when bumper harvests create an oversupply of oranges and rising when frost or a hurricane knocks out fruit trees.",
      "publishedAt": "2024-06-14T15:13:34Z",
      "title": "High orange juice prices may be on the table for a while due to disease and extreme weather",
      "url": "https://apnews.com/8a8f97573d9c26ab44a62c6a0228686e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c67a6037f58841c0aacfd9ae99345f68/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — In the last two years, bird flu has been blamed for the deaths of millions of wild and domestic birds worldwide. It's killed legions of seals and sea lions, wiped out mink farms, and dispatched cats, dogs, skunks, foxes and even a polar bear.",
      "publishedAt": "2024-06-14T16:14:33Z",
      "title": "Bird flu is highly lethal to some animals, but not to others. Scientists want to know why",
      "url": "https://apnews.com/ae01d3717783f0cf41e23f3fedb97017",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a777a87340c0460c8f64eb193ed085be/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "RIVERWOODS, Ill. (AP) — The ground had seemed to undulate at night, alive with bugs. Crawling cicada nymphs, striving to get higher after 17 years underground, marched en masse toward and up trees, pausing to shed their skin and emerge as adults.",
      "publishedAt": "2024-06-14T13:30:58Z",
      "title": "Illinois is hit with cicada chaos. This is what it's like to see, hear and feel billions of bugs",
      "url": "https://apnews.com/ab82f46e224ea56a44302a3b569e8074",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dbb42f4a402403687cd7f33a563f870/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and DANICA KIRKA",
      "description": "LONDON (AP) — The Princess of Wales said Friday she is “making good progress” in her cancer treatment and will attend King Charles III 's ceremonial birthday parade on Saturday, Kate’s first public appearance since her diagnosis.",
      "publishedAt": "2024-06-14T17:03:12Z",
      "title": "Princess of Wales says she's making ‘good progress’ in cancer treatment, will attend a public event",
      "url": "https://apnews.com/255a3da40725ba9fc702a9a4ccce470f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5643fd0d7b34127b93dc7d3d50f5a49/2908.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}