{
  "articles": [
    {
      "author": "SEUNG MIN KIM, TOM KRISHER and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden’s decision to stand alongside United Auto Workers pickets on Tuesday on the 12th day of their strike against major carmakers underscores an allegiance to labor unions that appears to be unparalleled in presidential history.",
      "publishedAt": "2023-09-26T04:02:36Z",
      "title": "Biden will join the UAW strike picket line. Experts can't recall the last time a president did that",
      "url": "https://apnews.com/8ecc84eeca15c99673f31bdac6921f7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/617a30324ac74d3a9dbe84eb321bbd99/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — With a government shutdown five days away, Congress is moving into crisis mode as Speaker Kevin McCarthy faces an insurgency from hard-right Republicans eager to slash spending even if it means curtailing federal services for millions of Americans.",
      "publishedAt": "2023-09-26T04:03:27Z",
      "title": "With a government shutdown just days away, Congress is moving into crisis mode",
      "url": "https://apnews.com/e4c37673b6507deaed2902f2166ef759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7acb63d752284c6b8943cb4ebf11afe9/3000.jpeg"
    },
    {
      "author": "AVET DEMOURIAN",
      "description": "YEREVAN, Armenia (AP) — At least 20 people were killed and nearly 300 others injured by an explosion at a crowded gas station in Nagorno-Karabakh as thousands of people rushed to flee into Armenia, separatist authorities in the region said Tuesday.",
      "publishedAt": "2023-09-26T07:21:14Z",
      "title": "At least 20 dead in gas station explosion as Nagorno-Karabakh residents flee to Armenia",
      "url": "https://apnews.com/e882628cc8a3895ddd23fd79d333b996",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef2a6b541d864669bbaa3bea3a8b50b5/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — The first of thousands of residents who lost their homes in the wildfire that destroyed the Hawaii town of Lahaina returned to their devastated properties Monday, with some stopping for a moment of reflection and others searching for mementos among the ruins.",
      "publishedAt": "2023-09-25T04:25:39Z",
      "title": "First of thousands of Lahaina residents return to homes destroyed by deadly wildfire",
      "url": "https://apnews.com/c5f6f108afc9432d66edf34a4976d48f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d6b4d80b036441b9391f90b1d0da828/1920.jpeg"
    },
    {
      "author": "TRAVIS LOLLER",
      "description": "NASHVILLE, Tenn. (AP) — Alyssa Milligan was someone who intuitively knew when another person needed help, encouragement or a kind word. Although she was new to Tennessee, the 23-year old physical therapy student, whose mother called her “Sweet Alyssa,” had already made many close connections, especially within the tight-knit cycling community around Nashville — before she was killed this month, struck by a pickup truck while cycling with a friend.",
      "publishedAt": "2023-09-26T05:08:38Z",
      "title": "New cars are supposed to be getting safer. So why are fatalities on the rise?",
      "url": "https://apnews.com/afcf8e6fd1b1cbfbd1a5360a29f08308",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e01ad3eb665c4b83b4406fde1bbdf5e0/1080.jpeg"
    },
    {
      "author": null,
      "description": "NAIROBI, Kenya (AP) — Researchers say they have verified 1,329 deaths from hunger in Ethiopia’s northern Tigray region since a cease-fire ended a two-year conflict there in November.",
      "publishedAt": "2023-09-26T07:09:45Z",
      "title": "Researchers have verified 1,329 hunger deaths in Ethiopia's Tigray region since the cease-fire there",
      "url": "https://apnews.com/6d5a15fa7cda213b86f41c87b1a185e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b4f03e309f143c8a5e32e40752984f0/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "HANGZHOU, China (AP) — A month before the Asian Games, China released a new national map, doubling down on its claims to almost the entire South China Sea and disputed border territories with India.",
      "publishedAt": "2023-09-26T08:22:10Z",
      "title": "China goes on charm offensive at Asian Games, but doesn't back down from regional confrontations",
      "url": "https://apnews.com/5afc8de9f2287ea3a06e7a3bf3d5dddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/affaa200050e49f38d6717adb4128601/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea paraded thousands of troops and an array of weapons capable of striking North Korea through its capital as part of its biggest Armed Forces Day ceremony in 10 years on Tuesday, as its president vowed to build a stronger military to thwart any provocation by the North.",
      "publishedAt": "2023-09-26T04:07:54Z",
      "title": "South Korea parades troops and powerful weapons in its biggest Armed Forces Day ceremony in years",
      "url": "https://apnews.com/4a2f96d61d0e8c14d67b4434d50cf4ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60c61b1b58474d1c9b0f079edea0d667/3000.jpeg"
    },
    {
      "author": "JON MARCUS of The Hechinger Report",
      "description": "BOSTON (AP) — Like a lot of high school students, Kevin Tran loves superheroes, though perhaps for different reasons than his classmates.“They’re all insanely smart. In their regular jobs they’re engineers, they’re scientists,” said Tran, 17.",
      "publishedAt": "2023-09-26T04:12:09Z",
      "title": "America's poor math skills raise alarms over global competitiveness",
      "url": "https://apnews.com/b60b740c480270d552d750c15ed287b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc30b5e10b3448cfbb7136649a895556/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — The deal is made, the pickets have been suspended, and Hollywood's writers are on the verge of getting back to work after months on strike.",
      "publishedAt": "2023-09-26T04:20:20Z",
      "title": "Writers strike is not over yet with key votes remaining on deal",
      "url": "https://apnews.com/d3119d670a4fd3449773bf8f4026fb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96bf5e1e63ed4799906fd90d178ac0de/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}