{
  "articles": [
    {
      "author": "WAFAA SHURAFA, BASSEM MROUE and DAVID RISING",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A four-day cease-fire between Israel and Hamas began Friday, allowing sorely needed aid to start flowing into Gaza and setting the stage for the release of dozens of hostages held by militants and Palestinians imprisoned by Israel.",
      "publishedAt": "2023-11-24T05:02:34Z",
      "title": "Israel and Hamas begin cease-fire, setting stage for release of some hostages and more aid to Gaza",
      "url": "https://apnews.com/172256dd593189f7b37f7c62f4739c6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a34dc8862024523a3dc6b6dabda5dc9/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — A temporary cease-fire agreement to facilitate the release of dozens of people taken hostage during Hamas’ raid on Israel is expected to bring the first respite to war-weary Palestinians in Gaza and a glimmer of hope to the families of the captives.",
      "publishedAt": "2023-11-22T08:21:14Z",
      "title": "What does the cease-fire between Israel and Hamas look like?",
      "url": "https://apnews.com/af1cfbc9dcaa1485ed7a9efaca7ec2b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/551fc16b24dc4df98c798b2f914b5301/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — Israel's military offensive has turned much of northern Gaza into an uninhabitable moonscape. Whole neighborhoods have been erased.",
      "publishedAt": "2023-11-23T13:55:13Z",
      "title": "Gaza has become a moonscape in war. When the battles stop, many fear it will remain uninhabitable",
      "url": "https://apnews.com/f299a28410b70ee05dd764df97d8d3a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5eb01e60d1e44183a9ff5302b8f0d3b5/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Expect big discounts and other enticements to lure shoppers to stores for Black Friday. But retailers worry those may not be enough.Consumers are coming under pressure as their savings dwindle and their credit card debt grows.",
      "publishedAt": "2023-11-24T05:02:14Z",
      "title": "Retailers offer big deals for Black Friday but will shoppers spend?",
      "url": "https://apnews.com/fe9ab8137c76aa0df2e5b0a7cc3ecda4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01d2988a4f5c4cd7b6a7c9162bc68c8a/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Irish police arrested 34 people after suspected far-right protesters in central Dublin attacked police, damaged shops and set fire to vehicles Thursday night following the stabbing of three children by an unidentified man earlier in the day.",
      "publishedAt": "2023-11-24T09:25:10Z",
      "title": "Irish police arrest 34 people in Dublin rioting following stabbings outside a school",
      "url": "https://apnews.com/2eaabb92b4e1623615a0860911cab91b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/004332cf7f0341929e79bb5174feb49b/1920.jpeg"
    },
    {
      "author": "FRANCES D'EMILIO",
      "description": "ROME (AP) — After the latest, horrifying killing of a college student allegedly by her resentful and jealous ex-boyfriend, students from Turin to Palermo have taken to pounding on classroom desks in unison to demand a stop to the slaying of women in Italy at the hands of men.",
      "publishedAt": "2023-11-24T05:11:11Z",
      "title": "Make noise! A murder and a movie stir Italians to loudly demand an end to violence against women",
      "url": "https://apnews.com/5b3c6101464b3536640fb9fb60d8761f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88bad55137864c1383e5fdff2e56a7f1/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — Oscar Pistorius could be granted parole on Friday after spending nearly 10 years in prison in South Africa for murder.",
      "publishedAt": "2023-11-24T00:04:57Z",
      "title": "South African Olympic runner Oscar Pistorius up for parole 10 years after killing his girlfriend",
      "url": "https://apnews.com/fb0ea8f28f786f6b91fb93b85ab0d315",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5182a6d1c4a74d3caaff02fef8beca47/2500.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "When Daniel Skousen scrubs at the ash and soot covering his Maui home, he worries about the smell.",
      "publishedAt": "2023-11-24T05:04:47Z",
      "title": "Maui residents wonder if their burned town can be made safe. The answer? No one knows",
      "url": "https://apnews.com/20caacae75766e700d10c6fa3da9de1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97f2a52330c346b480410da3af546157/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MARIA CHENG",
      "description": "CAPE TOWN, South Africa (AP) — South Africa, Colombia and other countries that lost out in the global race for coronavirus vaccines are taking a more combative approach towards drugmakers and pushing back on policies that deny cheap treatment to millions of people with tuberculosis and HIV.",
      "publishedAt": "2023-11-24T05:07:56Z",
      "title": "South Africa, Colombia and others are fighting drugmakers over access to TB and HIV drugs",
      "url": "https://apnews.com/0f6de15ea57279b699c147c015b23c02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e51e35c9cce4074acb516cbf27de3da/3000.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY and ALEXANDRE PLAZA",
      "description": "KING GEORGE ISLAND, Antarctica (AP) — On the cusp of the COP28 climate talks, U.N.",
      "publishedAt": "2023-11-23T14:24:51Z",
      "title": "On the cusp of climate talks, UN chief Guterres visits crucial Antarctica",
      "url": "https://apnews.com/11c99dd43dc99f5c8b98cee481da15d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccb15cf9d4e9423eba6134c1b69e94d6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}