{
  "articles": [
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — The Perseids are back to dazzle the sky with bursts of light and color.",
      "publishedAt": "2024-08-08T13:03:54Z",
      "title": "The Perseids are here. Here's how to see the 'fireballs' of summer's brightest meteor shower",
      "url": "https://apnews.com/82a9918fa1aafa3c23ef0db4cecfc54b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2b171c3b5a845d5aebae6775aa2d6d6/2371.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "SAINT-DENIS, France (AP) — Setting out to prove that topping Paris isn’t mission impossible, Los Angeles rolled out a skydiving Tom Cruise, Grammy winner Billie Eilish and other stars on Sunday as it took over Olympic hosting duties from the French capital, which closed out its 2024 Games just as they started — with joy and panache.",
      "publishedAt": "2024-08-11T19:03:12Z",
      "title": "Paris closes the Olympics, and Los Angeles turns to Tom Cruise for its 2028 mission",
      "url": "https://apnews.com/b1786f8e9ae6c5e2b709cf0b2cf6bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00c4114b3974bd8a643659cdc216961/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.",
      "publishedAt": "2024-08-11T07:15:02Z",
      "title": "Israel widens evacuation orders in southern Gaza. Hamas wants plans for a deal instead of more talks",
      "url": "https://apnews.com/18b0a73f930e3cc472a4207168b09ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a94c0722e85744c9997b2a69bc0d39a4/1920.jpeg"
    },
    {
      "author": "RON TODT and HOLLY RAMER",
      "description": "PHILADELPHIA (AP) — The weather system previously known as Hurricane Debby was not quite done with parts of the U.S. Sunday as flood warnings remained in effect in North Carolina and thousands were without power in New York, Ohio and Pennsylvania.",
      "publishedAt": "2024-08-11T18:54:35Z",
      "title": "Debby's aftermath leaves thousands in the dark; threatens more flooding in the Carolinas",
      "url": "https://apnews.com/6b586b15e0773d983b0048b80da0ee50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/694c13bf7fba477690ace3f064682886/3000.jpeg"
    },
    {
      "author": "BY BILL BARROW",
      "description": "ATLANTA (AP) — Republican vice presidential nominee JD Vance used a round of Sunday news show appearances to disparage the Democratic ticket and promote Donald Trump's record and second-term plans and defend himself from criticism over past remarks that have become a campaign issue.",
      "publishedAt": "2024-08-11T18:03:19Z",
      "title": "Vance hails Trump's Fed idea and pushes back against criticism over past words on American families",
      "url": "https://apnews.com/b4b0c58adafaf464071751c6f2cafb17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb7285d7f9c543a9864b55983b4bf848/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — The people of Southport, England, came together Sunday for the first of the funerals for three girls killed during a dance class, remembering 9-year-old Alice da Silva Aguiar’s radiant smile and calling for an end to the unrest that has convulsed Britain since the attack two weeks ago.",
      "publishedAt": "2024-08-11T19:36:29Z",
      "title": "English town of Southport mourns 9-year-old stabbing victim and calls for an end to unrest",
      "url": "https://apnews.com/c7dc709e6693f10dd8a592bf21056e84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/384e76f5b4cb4968b0f0ba8c9a94d0f3/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "MIAMI (AP) — The dated gold and silver trophies packed in the china cabinet of Dr. Vivek Murthy’s childhood home still boast the surgeon general’s many talents, from dance performances to math competitions.",
      "publishedAt": "2024-08-11T11:56:33Z",
      "title": "US surgeon general was warned by his mom to avoid politics, but he jumped into the fray anyway",
      "url": "https://apnews.com/f2cff4178e6e6ca311099d2741e277a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b85d088405f4bda86b96871a08d119a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Days after Ukraine began a surprise military incursion into Russia’s Kursk border region, President Volodymyr Zelenskyy has broken the government’s silence on it by indirectly acknowledging the ongoing military actions to “push the war out into the aggressor’s territory.”",
      "publishedAt": "2024-08-11T07:00:19Z",
      "title": "Ukraine's president acknowledges military incursion onto Russian soil",
      "url": "https://apnews.com/256adcd7e5ad8beef792a08fc0f0fe8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a54c306508a4b8790b0bbcf5a9d026b/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "LAS VEGAS (AP) — Big crowds, go-to applause lines, talk of joy — and some unsolicited Republican counterprogramming.These were common themes during the first big campaign swing for Vice President Kamala Harris and her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-11T15:43:08Z",
      "title": "Early Harris-Walz rallies feature big crowds, talk of 'joy' and unsolicited GOP counterprogramming",
      "url": "https://apnews.com/7da99aace01fec1c784fba27fdbce558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d35ea168f244cdf8cc07c81c055c689/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and MARGERY A. BECK",
      "description": "MANKATO, Minn. (AP) — Jacob Reitan said he told Gwen Walz he was gay before he told his parents.Reitan was a student in 1999 at Mankato West High School in Minnesota, where Walz and her husband, Tim, were teachers.",
      "publishedAt": "2024-08-11T11:32:19Z",
      "title": "Former students and colleagues recall high school teachers Tim and Gwen Walz as allies and advocates",
      "url": "https://apnews.com/4e03b28f956e7862dc72d25b852af448",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e59eeae89d7a43d3a3d5c1acec2a2492/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}