{
  "articles": [
    {
      "author": "TAMMY WEBBER and JIM MORRIS",
      "description": "VANCOUVER, British Columbia (AP) — Residents heeded warnings to evacuate the capital of Canada's Northwest Territories as a wildfire burned toward the city of 20,000, while firefighters on Friday battled a growing fire that set homes ablaze in a city in British Columbia.",
      "publishedAt": "2023-08-18T04:59:08Z",
      "title": "City empties as thousands flee wildfire closing in on capital of Canada's Northwest Territories",
      "url": "https://apnews.com/7b8c327876d86a483c8e25df7bc2c566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/beb59c0c189c48d19697c69c987426c3/1920.jpeg"
    },
    {
      "author": "MARK STEVENSON and JULIE WATSON",
      "description": "MEXICO CITY (AP) — Hurricane Hilary grew rapidly into Category 4 strength off Mexico’s Pacific coast on Friday and could reach Southern California as the first tropical storm there in 84 years, which forecasters warned could cause extreme flooding, mudslides and even tornados.",
      "publishedAt": "2023-08-18T07:58:35Z",
      "title": "Hurricane Hilary grows rapidly off Mexico. Rare tropical storm watch issued for California",
      "url": "https://apnews.com/406a3f7474eacb6222cedc33993d4657",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3c1cfd21797406fb22fd8a4b85e4fa3/3000.jpeg"
    },
    {
      "author": "KEN SWEET and MAE ANDERSON",
      "description": "NEW YORK (AP) — The Federal Emergency Management Agency said Friday it has approved more than $5.6 million in assistance to nearly 2,000 households in Maui so far as the federal government tries to help survivors of the devastating wildfires.",
      "publishedAt": "2023-08-18T18:10:45Z",
      "title": "FEMA has paid out more than $5.6 million to Maui survivors, a figure expected to grow significantly",
      "url": "https://apnews.com/973218438d06164d218ce60d252d7c32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a08e3ac64bc45f48bfa104005cefa18/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and DARLENE SUPERVILLE",
      "description": "CAMP DAVID, Md. (AP) — President Joe Biden and the leaders of Japan and South Korea agreed Friday to expand security and economic ties at a historic summit at the U.S. presidential retreat of Camp David.",
      "publishedAt": "2023-08-18T09:35:11Z",
      "title": "US, Japan and South Korea agree to expand security ties at summit amid China, North Korea worries",
      "url": "https://apnews.com/0bc36bb3705a3dc1b69dc8cd47b35dd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/284b83c029cf42cdae2fe70d0f6c6b3c/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Authorities are searching for a member of the Proud Boys extremist group who disappeared days before his sentencing in a U.S. Capitol riot case, where prosecutors are seeking more than a decade in prison, according to a warrant made public Friday.",
      "publishedAt": "2023-08-18T15:29:39Z",
      "title": "Proud Boy on house arrest in Jan. 6 case disappears ahead of sentencing",
      "url": "https://apnews.com/1341d4596fb96ee2828b54d70ef7e126",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3e9c61b340648789eeb918b1b4d5915/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — When the invitation to lunch at the Empire State Building first arrived last summer, some of George Santos’ campaign staffers were wary.The sender described himself as a deep-pocketed donor, eager to max out his contribution to the Republican congressional candidate.",
      "publishedAt": "2023-08-18T18:41:48Z",
      "title": "George Santos says ex-fundraiser caught using a fake name tried a new tactic: spelling it backwards",
      "url": "https://apnews.com/8db3d2c788b34d8a6e5f4f1f79cc01c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67a262e1906c4fd280e2fe83b83c532d/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "Phil Durst recalled clawing at his face after a chemical from a commercial dishwashing machine squirted into his eyes, causing “the most indescribable pain I’ve ever felt — ever, ever, ever.”His left eye bore the brunt of the 2017 work accident, which stole his vision, left him unable to tolerate light and triggered four to five cluster headaches a day.",
      "publishedAt": "2023-08-18T18:01:09Z",
      "title": "Stem cells from one eye show promise in healing injuries in the other",
      "url": "https://apnews.com/b2896563880f2ef9b6eda43263aec095",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f53dc955ca147c3b72ec1308bbe5c7f/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Miami Mayor Francis Suarez claimed on Friday that he has qualified for next week's Republican presidential debate and would become the ninth White House hopeful to meet the fundraising and polling thresholds required to participate in the opening face-off of the 2024 campaign.",
      "publishedAt": "2023-08-18T14:43:55Z",
      "title": "Miami Mayor Francis Suarez claims he's qualified for GOP presidential debate, but RNC can't confirm",
      "url": "https://apnews.com/5898b380b1d239a94d9de358e72253b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e8d6a0c51024fa1a443db3bc4911f22/3000.jpeg"
    },
    {
      "author": "PAN PYLAS and BRIAN MELLEY",
      "description": "LONDON (AP) — A neonatal nurse in a British hospital was found guilty Friday of murdering seven babies and trying to kill six others during a yearlong campaign of deception that saw her prey on the vulnerabilities of sick newborns and their anxious parents.",
      "publishedAt": "2023-08-18T12:18:30Z",
      "title": "A neonatal nurse in a British hospital has been found guilty of killing 7 babies",
      "url": "https://apnews.com/b9d0d8ccb7cb5acec0cc2d14e3b632a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a844342f86fb424b88142c8274ae5ddc/3000.jpeg"
    },
    {
      "author": "TERRY CHEA",
      "description": "SAN FRANCISCO (AP) — First came the robotaxis. Then the driverless buses arrived.San Francisco has launched an autonomous shuttle service -- less than a week after California regulators approved the expansion of robotaxis despite traffic and safety concerns.",
      "publishedAt": "2023-08-18T18:05:07Z",
      "title": "San Francisco launches driverless bus service following robotaxi expansion",
      "url": "https://apnews.com/802c39fdfc57adccaea604c7ee13a128",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aafac26c34344aed89772a333c7ddc8b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}