{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, the likely Democratic nominee for president, is attempting to bridge divides within the party over the war in Gaza, emphasizing Israel's right to defend itself while also focusing on alleviating Palestinian suffering.",
      "publishedAt": "2024-07-26T04:02:34Z",
      "title": "Harris tries to thread the needle on Gaza after meeting with Netanyahu",
      "url": "https://apnews.com/dad5fd3715f35e8311bd4039aeff8173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9255a23a74bb4dfcbc6e4848460b5d4a/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — As president, Donald Trump went well beyond his predecessors in fulfilling Israeli Prime Minister Benjamin Netanyahu’s top wishes from the United States.",
      "publishedAt": "2024-07-26T04:03:47Z",
      "title": "Netanyahu will meet Trump at Mar-a-Lago, mending a years-long rift",
      "url": "https://apnews.com/3d7a6b47060fbe51f66d82104ac5e1aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b17e746d3a34de3948705b450451f3d/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, MARÍA VERZA and CHRISTOPHER SHERMAN",
      "description": "WASHINGTON (AP) — Ismael “El Mayo” Zambada, a longtime leader of Mexico’s Sinaloa cartel, and Joaquín Guzmán López, a son of another infamous cartel leader, were arrested by U.S. authorities in Texas on Thursday, the U.S.",
      "publishedAt": "2024-07-26T00:32:04Z",
      "title": "US arrests 2 leaders of Mexico’s Sinaloa cartel: ‘El Mayo’ Zambada and son of 'El Chapo'",
      "url": "https://apnews.com/092bb02d8116fe462b6e1340547a4c77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e4608862cd64f4889fde8b5bece4b71/1944.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The future of Venezuela is on the line. Voters will decide Sunday whether to reelect President Nicolas Maduro, whose 11 years in office have been beset by crisis, or allow the opposition a chance to deliver on a promise to undo the ruling party's policies that caused economic collapse and forced millions to emigrate.",
      "publishedAt": "2024-07-26T04:11:24Z",
      "title": "Venezuelan voters face crucial choice: Reelect Maduro or give opposition a chance after 25 years",
      "url": "https://apnews.com/115b02aa4ad25b7fb8cf583b3dd10a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2373dffe6630428d9a25eb2adf0d0432/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris told reporters on Thursday that she’s “ready to debate Donald Trump.”She accused him of “backpedaling” away from a previous agreement for a debate hosted by ABC News on Sept.",
      "publishedAt": "2024-07-25T19:39:41Z",
      "title": "Harris says she's ready to debate Trump and accuses him of 'backpedaling' from Sept. 10 faceoff",
      "url": "https://apnews.com/83872f2a0339044795d2884cfab899c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcc7fb823cfd410da78153ef46e8af7b/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Prosecutors are urging a judge to uphold Donald Trump’s historic hush money conviction, arguing in court papers made public Thursday that the verdict should stand despite the Supreme Court’s recent ruling on presidential immunity.",
      "publishedAt": "2024-07-25T19:41:03Z",
      "title": "Prosecutors urge judge not to toss out Trump’s hush money conviction, pushing back on immunity claim",
      "url": "https://apnews.com/a6662f61014a7f47400a4af163e01eb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f0719891b584760b32d2f08f7ae8aa2/3000.jpeg"
    },
    {
      "author": "JOHN ANTCZAK and HOLLY RAMER",
      "description": "A burning car pushed into a gully sparked California’s largest wildfire of the year, authorities said Thursday as they announced the arrest of a suspect. Meanwhile other blazes scorched the Pacific Northwest.",
      "publishedAt": "2024-07-25T13:45:09Z",
      "title": "Lightning and a burning car pushed into a gully are blamed for wildfires scorching the West",
      "url": "https://apnews.com/1809c690e8902a4578c9f4286949550d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33d613ded7054b6b8c4e65619e580256/1920.jpeg"
    },
    {
      "author": null,
      "description": "MELBOURNE, Australia (AP) — At least 26 people were reportedly killed by a gang in three remote villages in Papua New Guinea’s north, United Nations and police officials say.",
      "publishedAt": "2024-07-26T04:06:05Z",
      "title": "Gang kills at least 26 villagers in remote Papua New Guinea, officials say",
      "url": "https://apnews.com/cf3d0f498dc9a5be36801372b6081a3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/019296b1f17044cbacfa49ea95a64cdf/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — Hollywood's video game performers announced they would go on strike Thursday, throwing part of the entertainment industry into another work stoppage after talks for a new contract with major game studios broke down over artificial intelligence protections.",
      "publishedAt": "2024-07-25T19:22:14Z",
      "title": "Video game performers will go on strike over artificial intelligence concerns",
      "url": "https://apnews.com/4f4c7d846040c24553dbc2604e5b6034",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadff722e0794e3fa606d7e5ca2d61ed/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — Paris has long been a city of dreamers: Just look at the Eiffel Tower, for decades the world's loftiest structure. Audacity also underpins the French capital's plans for its first Olympic Games in a century, which open Friday with an opening ceremony for the ages.",
      "publishedAt": "2024-07-25T07:14:07Z",
      "title": "With big goals and gambles, Paris aims to reset the Olympics with audacious Games and a wow opening",
      "url": "https://apnews.com/f64992c91be8dc2095ef21863af6e7f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62f57866f1fa422d8a6e58595a9764a2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}