{
  "articles": [
    {
      "author": "Sam Mednick",
      "description": "Israel has identified the remains of Eliyahu Margalit, a 76-year-old hostage handed over by Hamas. Margalit was abducted on October 7, 2023, during Hamas' attack on Israel. Israel’s Prime Minister’s office said Saturday his family has been notified. This marks the 10th returned hostage body since a ceasefire began over a week ago. Hamas has handed over an 11th body, but it wasn't a hostage. The ceasefire agreement includes the return of all hostages’ bodies, totaling 28. Meanwhile, aid into Gaza remains limited, with only 339 trucks offloaded since the ceasefire began, despite an agreement allowing 600 trucks daily. The humanitarian situation in Gaza remains dire.",
      "publishedAt": "2025-10-18T06:38:10Z",
      "title": "Israel identifies the remains of another hostage",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-18-2025-4d13aaceec91c360449dd5fa737b192b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1c82a4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F1d%2Fb10f04968b2ee66aacce923989e7%2Fa7aef0b7232e42aaaf3791541c41d02d"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump is set to host Ukrainian President Volodymyr Zelenskyy for talks at the White House on Friday. The U.S. leader is signaling he’s not ready to agree to sell Kyiv a long-range missile system that the Ukrainians say they desperately need. The meeting comes a day after Trump had a lengthy phone call with Russian President Vladimir Putin to discuss the Russia-Ukraine conflict. In recent days, Trump had shown openness to selling Ukraine long-range Tomahawk cruise missiles, even as Putin warned against it. Following Thursday’s call with Putin, Trump appeared to downplay the prospects of Ukraine getting the missiles.",
      "publishedAt": "2025-10-17T04:03:05Z",
      "title": "Trump hosts Zelenskyy after call with Putin on Ukraine war",
      "url": "https://apnews.com/article/trump-zelenskyy-putin-ukraine-tomahawks-ce697e5eda6ce9793b4343499d105a8c",
      "urlToImage": "https://dims.apnews.com/dims4/default/9766b91/2147483647/strip/true/crop/5582x3140+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F23%2F07d7f959bfbe4ffa645c14cb9326%2F7a5b930f1e154f35b60ef1ae8ca08c29"
    },
    {
      "author": "Konstantin Toropin, Lisa Mascaro",
      "description": "Two U.S. officials have confirmed to The Associated Press that the U.S. military has carried out a sixth deadly strike on a suspected drug-smuggling vessel in the Caribbean. One of the officials said the strike, conducted on what is believed to be a semi-submersible or submersible vessel, killed at least one person and left behind at least two survivors. Both officials were granted anonymity due to the sensitivity of the matter. This strike on Thursday brings the death toll from the Trump administration’s military action against vessels in the region to at least 28.",
      "publishedAt": "2025-10-17T15:46:14Z",
      "title": "US seizes survivors after strike in Caribbean, AP source says",
      "url": "https://apnews.com/article/venezuela-drug-smuggling-pentagon-strike-12820c173da3de80c1a7a559c252c743",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ff2728/2147483647/strip/true/crop/4775x2686+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F28%2Fe353d3cefb51234ff373bac235ff%2Fbebe4cabc75f4d88b6dfdb72ea0253c5"
    },
    {
      "author": "Mark Thiessen, Gene Johnson",
      "description": "Damage to remote Alaska villages hammered by flooding last weekend is so extreme that many of the more than 2,000 people displaced won’t be able to return to their homes for at least 18 months. That's what Gov. Mike Dunleavy said in a request to the White House for a major disaster declaration. In one of the hardest hit villages, Kipnuk, an initial assessment showed that 121 or homes — or 90% of the total — have been destroyed, Dunleavy wrote. In Kwigillingok, where three dozen homes floated away, slightly more than one-third of the residences are uninhabitable.",
      "publishedAt": "2025-10-17T20:04:00Z",
      "title": "Alaska villages face 18-month recovery after devastating flooding",
      "url": "https://apnews.com/article/alaska-typhoon-flooding-7e6e6b72c5587c3a00b82982ffab56bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/dead5a8/2147483647/strip/true/crop/4499x2531+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fc7%2F4c47167e8aac06763fdc92c8b5f5%2F5eacb55022044e188b4f11b9b36c3028"
    },
    {
      "author": "Eric Tucker, Alanna Durkin Richer",
      "description": "John Bolton is expected to surrender to authorities and make his first court appearance. The former Trump administration national security adviser is accused of storing top secret records at home and sharing with relatives diary-like notes that contained classified information. Bolton's lawyer says Bolton \"did not unlawfully share or store any information.” Bolton is expected to appear later Friday in federal court in Greenbelt, Maryland. It's the third case to be filed against a Trump adversary in the past month. There are concerns that the Justice Department is pursuing the Republican president’s political enemies while at the same time sparing his allies from scrutiny.",
      "publishedAt": "2025-10-17T11:39:06Z",
      "title": "Bolton is expected to surrender to authorities after his indictment",
      "url": "https://apnews.com/article/bolton-justice-department-trump-classified-information-indictment-f3c0bd8036ead827db5178b7a6090b38",
      "urlToImage": "https://dims.apnews.com/dims4/default/6725fec/2147483647/strip/true/crop/3094x1740+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2Ff9%2Fdc811afbc5be8cb6ebb704021306%2Ffef046cdf6fe4e9b8f49e2eea30aa352"
    },
    {
      "author": null,
      "description": "Afghan and Pakistani delegations are going to the Qatari capital Doha for crisis talks. More than a week of fighting has killed dozens of people and injured hundreds on both sides. On Saturday, the Taliban government said the Afghan delegation included the defense minister and head of the national intelligence agency. Each country has said it is responding to aggression from the other. Pakistan accuses Afghanistan of harboring militants who carry out attacks in border areas, a charge rejected by the country’s Taliban government. A 48-hour ceasefire expired Friday evening.",
      "publishedAt": "2025-10-18T06:58:09Z",
      "title": "Afghan and Pakistani delegations head to Qatar for talks",
      "url": "https://apnews.com/article/afghanistan-pakistan-cricket-border-fighting-232bb8c59918af77a92b6d16e4adb52b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce7fdeb/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F85%2F5ed6c1481cf2ae2663957660ca9f%2F87760bc7fb1041d8aa13a52276e35b34"
    },
    {
      "author": "Collin Binkley",
      "description": "The five remaining universities that have not announced a decision on President Donald Trump’s higher-education compact have been asked to join a White House call Friday to discuss the proposed deal, according to two people familiar with the matter. The people spoke on condition of anonymity to discuss details of the private call. It follows a flurry of rejections from four of the nine universities invited to be “initial signatories” of the agreement. The White House asked university leaders to provide initial feedback by Oct. 20, yet as the deadline approaches, none have signed on to the document.",
      "publishedAt": "2025-10-17T17:42:47Z",
      "title": "White House asks for call with colleges still weighing Trump's compact",
      "url": "https://apnews.com/article/trump-higher-education-compact-colleges-e509133146c540b8a3d4df403a2c69f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/be9a7e8/2147483647/strip/true/crop/2852x1604+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F61%2Fd119b3cd74cbcd3cdbaacdb8a291%2F6412b542a61648b9b3b7ae6b6f849792"
    },
    {
      "author": null,
      "description": "President Donald Trump says he has commuted the sentence of former U.S. Rep. George Santos, who is serving more than seven years in federal prison after pleading guilty to fraud and identity theft charges. The New York Republican was sentenced in April after admitting last year to deceiving donors and stealing the identities of 11 people — including his own family members — to make donations to his campaign. He reported to Federal Correctional Institution in Fairton, in southern New Jersey, on July 25 and is being housed in a minimum security prison camp with fwere than 50 other inmates. “I just signed a Commutation, releasing George Santos from prison, IMMEDIATELY,” Trump posted on his social media platform.",
      "publishedAt": "2025-10-17T22:13:04Z",
      "title": "Trump commutes sentence of former US Rep. George Santos",
      "url": "https://apnews.com/article/trump-george-santos-commutation-pardon-8ae46d6351cefe01d79f74920521b7a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1d0785/2147483647/strip/true/crop/3358x1889+0+176/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F14%2F24c0214314fb0bbf8575898570f9%2F586c3c8c909d43e8a0c779bf9a963422"
    },
    {
      "author": "Joey Cappelletti, Seung Min Kim",
      "description": "Democrats are calling on President Donald Trump to get more involved with negotiations to end the government shutdown. Trump is showing no interest in interjecting in the fight that has stretched through three weeks with little movement. Republican leadership in Congress is hoping it stays that way, with Senate Majority Leader John Thune reiterating Thursday that negotiations are possible “once the government opens up.” But some in Trump's party are expressing frustration with the lack of movement. Republican Sen. Lisa Murkowski said she thinks some in the Trump administration are happy that the role of Congress is being diminished.",
      "publishedAt": "2025-10-17T04:05:20Z",
      "title": "Democrats say Trump should be involved in shutdown talks",
      "url": "https://apnews.com/article/shutdown-deal-trump-democrats-republicans-negotiations-527a738b282186058366642af8a8f461",
      "urlToImage": "https://dims.apnews.com/dims4/default/1307e43/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F5f%2Fdba4bddedba02401166fa175d97f%2F013735ef799944b481209e6279ccafc3"
    },
    {
      "author": "Sibi Arasu, Jennifer McDermott",
      "description": "The U.S. has blocked a global fee on shipping emissions as an international maritime meeting ended Friday without adopting new regulations. The world's largest maritime nations had been discussing ways to move the shipping industry away from fossil fuels. On Thursday, U.S. President Donald Trump urged countries to vote against the regulations. The International Maritime Organization adjourned its meeting Friday. The proposed regulations would have set a marine fuel standard and imposed fees for emissions above allowable limits. Shipping emissions have grown to about 3% of the global total, prompting calls for action.",
      "publishedAt": "2025-10-17T14:03:41Z",
      "title": "US blocks a global fee on shipping emissions as international meeting ends without new regulations",
      "url": "https://apnews.com/article/shipping-climate-change-carbon-fee-a5f854e7028d08035689db50814a6519",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a0aaa2/2147483647/strip/true/crop/5051x2841+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F15%2F4f903b22f52d8bef285c08749548%2Ff9d919a8a4fa42fc8dafa859b1f41323"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}