{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza (AP) — Fifteen Israeli soldiers have been killed in combat in Gaza over the weekend, the Israeli military said Sunday, while tentative efforts continued on a deal for another exchange of hostages for Palestinians held by Israel.",
      "publishedAt": "2023-12-24T08:00:21Z",
      "title": "A weekend of combat in Gaza kills 15 Israeli soldiers as public support for the war is tested",
      "url": "https://apnews.com/9451d609ecdf85d14795caa628e2a127",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80773a0cc88646c4a6eec06a96d14dab/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "BETHLEHEM, West Bank (AP) — The typically bustling biblical birthplace of Jesus resembled a ghost town Sunday after Christmas Eve celebrations in Bethlehem were called off due to the Israel-Hamas war.",
      "publishedAt": "2023-12-24T09:34:45Z",
      "title": "On Christmas Eve, Bethlehem resembles a ghost town. Celebrations are halted due to Israel-Hamas war.",
      "url": "https://apnews.com/e408a3e48d18c69a7a0b018505cdc732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61467ff3817a42949826a108eb2a4688/1920.jpeg"
    },
    {
      "author": "DAVID McHUGH, ABDUL RAHMAN SHAHEEN and SHAZIA BHATTI",
      "description": "FRANKFURT, Germany (AP) — Christians around the world were striving on Christmas Eve to put aside the worries and fears of an unsettled, war-torn world as they prepared to celebrate the birth of Jesus of Nazareth.",
      "publishedAt": "2023-12-24T12:38:54Z",
      "title": "In a troubled world, Christians strive to put aside earthly worries on Christmas Eve",
      "url": "https://apnews.com/12aac83f3a9d1bb1c05768c02e75771b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62622830dfb04060ad5ad8ac957757cc/1920.jpeg"
    },
    {
      "author": "SAGAR MEGHANI",
      "description": "WASHINGTON (AP) — As children around the world eagerly await Santa’s arrival on Christmas, the military is closely tracking his every move.Armed with radar, sensors, aircraft and Christmas spirit, the North American Aerospace Defense Command in Colorado is reporting on the movements of Santa's sleigh since his takeoff from the North Pole for parts of the globe where Christmas comes first.",
      "publishedAt": "2023-12-22T05:03:51Z",
      "title": "A North American military command is tracking Santa's every move and kids can follow along",
      "url": "https://apnews.com/2f9a2083102decafa3186a7d6f8f8e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/662bb1e1516c46a4aeab310e364b9518/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "FORT MORGAN, Colo. (AP) — Magdalena Simon's only consolation after immigration officers handcuffed and led her husband away was the contents of his wallet, a few bills.The hopes that had pushed her to trudge thousands of miles from Guatemala in 2019, her son’s small frame clutched to her chest, ceded to despair and loneliness in Fort Morgan, a ranching outpost on Colorado’s eastern plains, where some locals stared at her too long and the wind howls so fiercely it once blew the doors half off a hotel.",
      "publishedAt": "2023-12-24T05:05:11Z",
      "title": "New migrants face fear and loneliness. A town on the Great Plains has a storied support network",
      "url": "https://apnews.com/c452a587f92c5f1b9dc9a6decc6cf8fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/735b6445366f40fab7d4aff80d69600c/3000.jpeg"
    },
    {
      "author": "ANGELA CHARLTON and ELISE MORTON",
      "description": "PARIS (AP) — Judges in France were expected to decide Sunday whether about 300 Indian citizens who are suspected of being victims of human trafficking should continue to be sequestered in a small airport in Champagne country.",
      "publishedAt": "2023-12-24T11:34:59Z",
      "title": "Judges to decide if 300 possible victims of trafficking from India should remain grounded in France",
      "url": "https://apnews.com/98c1d9e9d86a3f1fea46403d88d4b7ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10df2f4f381a44029d7d9964b1252245/3000.jpeg"
    },
    {
      "author": "JAMES ROBSON",
      "description": "MANCHESTER, England (AP) — After a decade without winning the Premier League, Manchester United announced Sunday that it had agreed to sell a minority stake in the storied club to Jim Ratcliffe in a deal that would also see the British billionaire and boyhood fan take control of its soccer operations.",
      "publishedAt": "2023-12-24T16:09:20Z",
      "title": "Manchester United announces deal to sell up to 25% of EPL club to UK billionaire Jim Ratcliffe",
      "url": "https://apnews.com/a78ec58384d7062b486f162fe4138cac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/105309021d414874bc0c8e9af16b644c/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — As the Senate wrapped up its work for the year, Sen. Michael Bennet took to the floor of the nearly empty chamber and made a late-night plea for Congress to redouble support for Ukraine: “Understand the stakes at this moment.\"",
      "publishedAt": "2023-12-24T13:25:23Z",
      "title": "As conflicts rage abroad, a fractured Congress tries to rally support for historic global challenges",
      "url": "https://apnews.com/31075fce7dfcb3aaa6d3eb595e62ed09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e1fee5af4dd490c845890f5a01a5170/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "It’s not a secret that Fantasia Barrino did not want to play Celie again. The “American Idol” winner hadn’t had the best time doing “The Color Purple” on Broadway.The protagonist of Alice Walker’s Pulitzer Prize-winning novel tells her story of sexual, physical and psychological abuses in the early twentieth century South in a series of letters to God.",
      "publishedAt": "2023-12-24T16:02:47Z",
      "title": "Finding new dimensions, sisterhood, and healing in ‘The Color Purple’",
      "url": "https://apnews.com/21c75312a55f8e001a5c1c5947c09bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61387c56f53d4724b4f90c92e782e1c2/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "“ Aquaman and the Lost Kingdom ” led a crowd of new releases at the box office on the weekend before Christmas Monday.",
      "publishedAt": "2023-12-24T17:06:32Z",
      "title": "On the weekend before Christmas, ‘Aquaman’ sequel drifts to first",
      "url": "https://apnews.com/b11c243a659b1b7ad826d5a8298c5855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a14e4dd9db6246c69af2d63c83e57a7f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}