{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump confirmed tariffs on goods from Mexico paused by a month for negotiations, hours before they were to take effect.",
      "publishedAt": "2025-02-03T11:18:00Z",
      "title": "Live updates: Trump agrees to pause tariffs on Mexico for a month",
      "url": "https://apnews.com/live/trump-presidency-updates-day-15",
      "urlToImage": "https://dims.apnews.com/dims4/default/ecefae1/2147483647/strip/true/crop/5416x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F43%2Fdebb99ab4269a7bd810785132ef3%2Fap25034030462557.jpg"
    },
    {
      "author": "ELLEN KNICKMEYER, FARNOUSH AMIRI, ADRIANA GOMEZ LICON",
      "description": "The Trump administration and billionaire ally Elon Musk have moved to shutter an agency that provides crucial aid to fund education and fight starvation overseas, sparking a showdown with congressional Democrats who blasted the effort as illegal and vowed a court fight. Officers prevented staffers of the U.S. Agency for International Development and lawmakers the agency’s Washington headquarters. Trump says shutting down USAID “should have been done a long time ago.” The lawmakers, who appeared outside the USAID building before they were denied entrance, gave the most forceful response against Trump since the Republican took office last month.",
      "publishedAt": "2025-02-03T11:29:28Z",
      "title": "USAID notice instructs staffers to stay out of its headquarters",
      "url": "https://apnews.com/article/trump-musk-usaid-c0c7799be0b2fa7cad4c806565985fe2",
      "urlToImage": "https://dims.apnews.com/dims4/default/b03f22d/2147483647/strip/true/crop/5890x3313+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fa5%2Fe1c0e609f77c15a73198701138f3%2F3e43230db7ee4cf5b4437e3f01c472c8"
    },
    {
      "author": "STAN CHOE",
      "description": "President Donald Trump’s tariffs sent Wall Street on a roller coaster. The S&P 500 fell 0.8% Monday following sharper loses across Asia and Europe. The Dow Jones Industrial Average fell 0.3%, and the Nasdaq composite lost 1.2%. U.S. stocks had initially been on track for much worse losses on worries about how much pain U.S. companies would feel because of the U.S. tariffs announced for imports from Canada, Mexico and China. The S&P 500 was briefly down nearly 2%, and the Dow dropped as many as 665 points. But they pared losses after Mexico’s president said she had negotiated a one-month reprieve for her country. After the U.S. stock market closed for the day, Canadian Prime Minister Justin Trudeau said a conversation he had with Trump also led to a 30-day pause.",
      "publishedAt": "2025-02-03T03:38:46Z",
      "title": "Wall Street falls following Trump's tariffs, but not as badly as feared in the morning",
      "url": "https://apnews.com/article/stock-market-trump-tariffs-5f365936ea9bdf45a0460556f3a5f4e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/29f769e/2147483647/strip/true/crop/5323x2994+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F50%2Fd55790e81b49c6ac6eb1ddbf36c3%2Fe52136739eca462c8e97b0fbfc4c204b"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump has taken executive action to impose or threaten new tariffs on imports from Canada, Mexico and China. The moves fulfill certain campaign promises but also have roiled stock markets and supply chains, while testing relations with the country’s North American neighbors and, in China’s case, the world’s second-largest economy. But Trump is also declaring initial victories as Mexican and Canadian leaders agreed to more cooperation on border control. Unlike during the 2024 campaign, when Trump billed his economic agenda as guaranteed to reduce the cost of living for Americans, the Republican president now is acknowledging what many economists have long forecasted: that his approach could yield higher prices and lower supplies across a roiled U.S. market.",
      "publishedAt": "2025-02-02T19:20:39Z",
      "title": "What to know about Trump's tariffs targeting Mexico and others",
      "url": "https://apnews.com/article/trumps-tariffs-canada-mexico-china-taxes-910cf9a18fce654597a30dbaaa8d1576",
      "urlToImage": "https://dims.apnews.com/dims4/default/25d1b64/2147483647/strip/true/crop/3000x1688+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F6e%2F8edc95838ac17634cbd62e9139ad%2F1c83fbaab2e84da4998433ecac6f262e"
    },
    {
      "author": "JIM MUSTIAN, BRETT MARTEL",
      "description": "Hundreds of internal emails show executives of the New Orleans Saints were far more involved than previously known in providing public relations help to Catholic Church leaders as they confronted a clergy sex abuse crisis. The emails sharply undercut assurances the Saints provided five years ago when they asserted they had provided only “minimal” assistance to the Archdiocese of New Orleans. Survivors of clergy abuse say they're disgusted by the team's involvement. The Saints said in a statement Saturday that the team does not condone sex abuse. They also criticized the media for using leaked emails to misconstrue what they called “a well-intended effort.”",
      "publishedAt": "2025-02-03T11:46:52Z",
      "title": "NFL emails reveal extent of Saints' damage control for clergy sex abuse crisis",
      "url": "https://apnews.com/article/new-orleans-saints-catholic-church-sex-abuse-77f92deb50e6333fa04a9db1897f8171",
      "urlToImage": "https://dims.apnews.com/dims4/default/36c6e1e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fd4%2Fc421d3fedae058c2734626f37801%2Fd06dd9217ee5435b81773f886fc22f38"
    },
    {
      "author": "DAVID R. MARTIN, MICHAEL R. SISAK, CLAUDIA LAUER",
      "description": "Salvage crews have recovered an engine and large pieces of fuselage and are working to retrieve a wing from wreckage of last week’s midair collision near Washington’s Reagan National Airport. Officials say they have also recovered more human remains from the Potomac River, but did not give specifics. Instead, they are reiterating that 55 of the 67 victims have been identified. Authorities say the operation to remove the plane will take several days and they will then work to remove the military helicopter involved. The crash between the American Airlines jet and an Army helicopter over Washington, D.C. on Wednesday is the deadliest U.S. air disaster since 2001.",
      "publishedAt": "2025-02-03T13:27:33Z",
      "title": "Salvage crews recover engine, large portion of jet from river after deadly air collision near DC",
      "url": "https://apnews.com/article/washington-plane-crash-helicopter-recovery-958ac5e48c5061625718a5a4280608f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/b70f176/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fc9%2Fad850bec4f4033a6ae1ab2d2367a%2F5b4980dab8ca45c599c7b92b1d6a9885"
    },
    {
      "author": "MARIA CHENG, JAMEY KEATEN",
      "description": "The World Health Organization chief is asking global leaders to lean on Washington to reverse President Donald Trump’s decision to withdraw from the U.N. health agency. WHO Director-General Tedros Adhanom Ghebreyesus said in a closed-door meeting with diplomats last week that the U.S. will be hurt by a lack of access to critical information about global disease outbreaks. Internal materials obtained by The Associated Press show countries pressed WHO about how it might cope with the exit of its biggest donor. A confidential budget document showed WHO’s health emergencies program has a “heavy reliance” on American cash and that emergency operations in the Middle East, Ukraine and Sudan would be the most affected.",
      "publishedAt": "2025-02-03T06:00:06Z",
      "title": "WHO chief asks countries to push Washington to reconsider its withdrawal",
      "url": "https://apnews.com/article/who-trump-tedros-global-health-a2eafc341cd2200e8800a2421d30bdfc",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd9d482/2147483647/strip/true/crop/4310x2424+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fd0%2Fade71f06400ed6e3a067e21d0fd6%2F06c689833bfc412892938bd88f9e463a"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump says Americans could feel “some pain” from the emerging trade war triggered by his tariffs against Canada, Mexico and China. He's also claiming that Canada would “cease to exist” without its trade surplus with the United States. The trade penalties that Trump signed Saturday at his Florida resort are causing a mix of panic, anger and uncertainty. And they're threatening to rupture a decades-old partnership on trade in North America while further straining relations with China. But by following through on a campaign pledge, Trump may have simultaneously broken his promise to voters in last year’s election that his administration could quickly reduce inflation. The tariffs are set to launch on Tuesday.",
      "publishedAt": "2025-02-02T15:59:51Z",
      "title": "Trump says Americans could feel 'some pain' from his new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-trade-surplus-3010e6368545e2976feb5ac6b41e528e",
      "urlToImage": "https://dims.apnews.com/dims4/default/cae9348/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2Fda%2F725a80e73ebfe411d5ef8d4f098c%2Fb7a0362c4822401e89edc6f790ef7897"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "President Donald Trump's threat of tariffs on goods from Mexico, Canada and China is aimed at stopping the flow of fentanyl into the U.S. Chinese and Mexican officials say the opioid crisis is largely a U.S. problem because that's where the demand is. Ingredients for fentanyl are produced in China and used by pharmaceutical companies to make legal painkillers, but a portion of those chemicals is purchased by the Sinaloa and Jalisco cartels in Mexico for the manufacture of illicit drugs. The cartels make fentanyl in labs and then smuggle the drug into the U.S., largely at official land crossings in California and Arizona.",
      "publishedAt": "2025-02-03T18:38:37Z",
      "title": "Tariff threats take aim at fentanyl trafficking. Here's how the drug reaches the US",
      "url": "https://apnews.com/article/fentanyl-border-mexico-trump-tariffs-drug-canada-3b7f4b39aaa1c9e2ca9a2b1c4cb40715",
      "urlToImage": "https://dims.apnews.com/dims4/default/73b6192/2147483647/strip/true/crop/3000x1688+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F1b%2Fd63afad91c623a1a8750cbe96d14%2Fbb1149d10b484c2a874f6cddc06339fe"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Early Monday, billionaire Trump advisor Elon Musk held a live session on X Spaces, previously known as Twitter Spaces, and said that he spoke in detail about USAID with the president. The Trump administration has already placed two top security chiefs at the U.S. Agency for International Development on leave after they refused to turn over classified material in restricted areas to Musk’s government-inspection teams. That's according to a current and a former U.S. official with knowledge of the incident who spoke on condition of anonymity. The former official says members of Musk’s Department of Government Efficiency — known as DOGE — eventually did gain access Saturday to the agency’s classified information, which includes intelligence reports.",
      "publishedAt": "2025-02-02T17:31:31Z",
      "title": "USAID security chiefs put on leave after trying to keep DOGE from classified info",
      "url": "https://apnews.com/article/doge-musk-trump-classified-information-usaid-security-35101dee28a766e0d9705e0d47958611",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ab7c96/2147483647/strip/true/crop/3766x2118+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fee%2F0997bcaf57345565945c51712359%2Fd3a4fab52dc143bc9473fc6c9b40ff39"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}