{
  "articles": [
    {
      "author": null,
      "description": "A judge has rejected a Trump administration request to unseal transcripts from grand jury investigations of Jeffrey Epstein years ago in Florida. A similar records request is pending in New York. U.S. District Judge Robin Rosenberg in West Palm Beach said Wednesday the request to release grand jury documents from 2005 and 2007 did not meet any of the extraordinary exceptions under federal law that could make them public.",
      "publishedAt": "2025-07-23T19:14:36Z",
      "title": "Judge rejects effort to unseal Epstein grand jury records in Florida",
      "url": "https://apnews.com/article/epstein-trump-grand-jury-records-florida-3254decc623fbf2a5ee2967c7adfa2e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "A judge is expected to order Bryan Kohberger to serve four life sentences without parole this week for brutally stabbing four University of Idaho students to death nearly three years ago. Wednesday’s sentencing hearing will be an opportunity for the families of Xana Kernodle, Madison Mogen, Ethan Chapin and Kaylee Goncalves to tell the court and Kohberger about the anguish they’ve felt since he broke into a home and killed their loved ones in the early morning hours of Nov. 13, 2022. Kohberger pleaded guilty to four counts of first-degree murder and one count of burglary in a deal that avoids the death penalty. He waived his right to appeal.",
      "publishedAt": "2025-07-23T04:07:30Z",
      "title": "Bryan Kohberger expected to receive 4 life sentences for killing Idaho university students",
      "url": "https://apnews.com/article/idaho-students-murdered-bryan-kohberger-sentencing-97325ba6addb5e0fe20af6b68f021f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/571583a/2147483647/strip/true/crop/6000x3375+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fb3%2F8f6e3eede38612e6fd9becc5b28c%2F6d3955aeb8b74941a66179ff3e5753e2"
    },
    {
      "author": null,
      "description": "A federal judge in Maryland has prohibited the Trump administration from taking Kilmar Abrego Garcia into immediate immigration custody if he’s released from jail in Tennessee while awaiting trial on human smuggling charges. U.S. District Judge Paula Xinis ordered the U.S. government to provide notice of three business days if Immigration and Customs Enforcement intends to deport him. The judge also ordered the government to restore the federal supervision that Abrego Garcia was under before he was wrongfully deported to his native El Salvador in March. That supervision had allowed Abrego Garcia to live and work in Maryland.",
      "publishedAt": "2025-07-23T19:15:26Z",
      "title": "Judge bars ICE from immediately taking Abrego Garcia into custody",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-ice-27fa028f2bcc7ceb6667963f1fb04c74",
      "urlToImage": "https://dims.apnews.com/dims4/default/9591a8b/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F80%2F0236bd058f8b627c092f5ab94862%2Ff6908b2c90b84a938a23fb4762876cf7"
    },
    {
      "author": null,
      "description": "President Donald Trump has unveiled an “AI Action Plan” shaped by Silicon Valley tech leaders who supported his campaign. The plan, disclosed Wednesday, focuses on boosting artificial intelligence technology exports, streamlining permits for energy-intensive data centers and exporting American AI around the world. Trump gave his tech advisers six months to come up with new AI policies after revoking President Joe Biden’s AI guardrails on his first day in office. Opponents of the Republican president's AI agenda argue it prioritizes the needs of Big Tech over people. More than 100 groups have come together to sign a resolution calling for a “People's AI Action Plan” that would preserve safeguards for the American public.",
      "publishedAt": "2025-07-23T04:04:58Z",
      "title": "Trump's new AI plan leans heavily on Silicon Valley industry ideas",
      "url": "https://apnews.com/article/trump-ai-artificial-intelligence-3763ca207561a3fe8b35327f9ce7ca73",
      "urlToImage": "https://dims.apnews.com/dims4/default/763f3f4/2147483647/strip/true/crop/5817x3272+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fbc%2Fb9dcc3f503d47658a3d1bc132236%2Ff2aaee9d03b940ae8c1d3b2ac7e267ba"
    },
    {
      "author": null,
      "description": "Columbia University has reached a deal with the Trump administration to pay more than $220 million to the federal government to restore federal research money that was canceled in the name of combating antisemitism on campus, the university announced Wednesday. Under the agreement, the Ivy League school will pay the $200 million settlement over three years to the federal government, the university said. It will also pay $21 million to settle investigations brought by the U.S. Equal Employment Opportunity Commission.",
      "publishedAt": "2025-07-23T23:52:05Z",
      "title": "Columbia University reaches a deal with Trump to restore federal research funds",
      "url": "https://apnews.com/article/columbia-trump-deal-00eef5dca9f003e593d2cb151f5cce17",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The United Nations’s top court says that if countries fail to take measures to protect the planet from climate change, they could be in violation of international law. The International Court of Justice is delivering an advisory opinion in a landmark case about nations’ obligations to tackle climate change and consequences they may face if they don’t. The court calls it an “urgent and existential” threat to humanity. The court president says that “failure of a state to take appropriate action to protect the climate system ... may constitute an internationally wrongful act.\"",
      "publishedAt": "2025-07-23T04:07:26Z",
      "title": "UN's top court delivers landmark decision on tackling climate change",
      "url": "https://apnews.com/article/un-court-opinion-climate-change-1ac84a94a5aaffd63518ef1da3502a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9195c68/2147483647/strip/true/crop/8173x4597+0+426/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2Ff3%2F5f16148ba1a12e7381a5bd2158e2%2Fe82ec12b7491413f8b5d94af56f17282"
    },
    {
      "author": null,
      "description": "A doctor has pleaded guilty to illegally supplying ketamine to Matthew Perry before the overdose death of the ‘Friends’ star. On Wednesday, Dr. Salvador Plasencia admitted in federal court to providing Perry with ketamine vials, lozenges, and syringes in the weeks leading up to his death on October 28, 2023. Prosecutors say Plasencia also injected Perry with the drug and taught his assistant how to administer it. Perry had struggled with addiction for years. Plasencia faces up to 40 years in prison but has not yet been sentenced and may get a lighter sentence. Another defendant’s trial is set for next month.",
      "publishedAt": "2025-07-23T04:46:29Z",
      "title": "Doctor pleads guilty to selling Matthew Perry ketamine",
      "url": "https://apnews.com/article/matthew-perry-doctor-guilty-plea-salvador-plasencia-ea9957df817535ab17fac24660c9c431",
      "urlToImage": "https://dims.apnews.com/dims4/default/5948b76/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F97%2Fb5ae85e6af08e83c15579830c6ab%2Ff6aa4409066b49a782e527cb042a4db1"
    },
    {
      "author": null,
      "description": "More than 100 charity and human rights groups say that Israel’s blockade and ongoing military offensive are pushing Palestinians in the Gaza Strip toward starvation. Israeli strikes meanwhile killed another 21 people overnight and into Wednesday, according to local health officials. The Trump administration’s Mideast envoy Steve Witkoff was set to meet with a senior Israeli official about ceasefire talks, a sign that lower-level negotiations that have dragged on for weeks could be approaching a breakthrough. Experts say Gaza is at risk of famine because of Israel’s blockade and offensive, launched in response to Hamas’ Oct. 7, 2023, attack.",
      "publishedAt": "2025-07-23T14:23:18Z",
      "title": "Gaza on the brink of famine as Israeli strikes kill 21 overnight",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-aid-ceasefire-hostages-07-23-2025-1d1cfef28bc593adac2c2a0e432cfc97",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc2b381/2147483647/strip/true/crop/4781x2689+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fb2%2F61ed96c997ea27f0c21d38cb6cc0%2Fdff36adf3273496980db39ad8dabe3ab"
    },
    {
      "author": null,
      "description": "Ukrainian activists are calling for more protests against a law they say weakens the country’s anti-corruption bodies. Thousands of people gathered in the capital and other cities across Ukraine on Tuesday to urge President Volodymyr Zelenskyy to veto a controversial bill passed by Ukraine’s Parliament. After Zelenskyy approved it, activists called on social media for another demonstration Wednesday in the center of Kyiv. Critics, including EU officials and rights groups, say the law undermines the agencies' independence and threatens Ukraine's democratic reforms. Zelenskyy defends the law, claiming it removes Russian influence and accelerates stalled corruption cases.",
      "publishedAt": "2025-07-23T10:09:12Z",
      "title": "More protests are expected in Ukraine after Zelenskyy signs controversial anti-corruption bill",
      "url": "https://apnews.com/article/russia-ukraine-war-corruption-protests-zelenskyy-talks-fb2fdeb3fbf36a37b2e1eefb385bac87",
      "urlToImage": "https://dims.apnews.com/dims4/default/270676f/2147483647/strip/true/crop/4240x2385+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fb8%2Fe59cbd54bcd0927387078956d9c4%2F51267112ca184a3b977835bf3d90e21a"
    },
    {
      "author": null,
      "description": "The Muscogee Nation Supreme Court has ruled in favor of two descendants of former slaves held by the tribe. The court found Wednesday that when the Muscogee Nation’s citizenship board denied them membership, it violated an 1866 treaty granting citizenship to former slaves once held by the tribe. The Muscogee Nation is one of five tribes in Oklahoma that once practiced slavery. In that 1866 treaty with the U.S. government, the tribe both abolished it and granted citizenship to the formerly enslaved.",
      "publishedAt": "2025-07-23T20:51:21Z",
      "title": "Muscogee Nation Supreme Court rules Freedmen descendants entitled to tribal citizenship",
      "url": "https://apnews.com/article/muscogee-nation-freedmen-citizenship-ruling-f5edb1fb723a9dd039a1a6c2ea8a853f",
      "urlToImage": "https://dims.apnews.com/dims4/default/6169055/2147483647/strip/true/crop/5847x3289+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2Fad%2Ff1edbee909d838419e2360c7e2bc%2F56c22ed2d1ca4920b7f5afc62db74527"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}