{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are poised Friday to hold negotiations in Oman at least over Tehran’s nuclear program. The talks follow a chaotic week that initially saw plans for regional countries to take part in talks in Turkey. Previous rounds of meetings turned to ash following Israel’s launch of a 12-day war against Iran back in June. The U.S. bombed Iranian nuclear sites during that war. Meanwhile, nationwide protests have shaken Iran's theocracy. It responded with a bloody crackdown that killed thousands and reportedly saw tens of thousands arrested. President Donald Trump has threatened to strike the country in the time since, spurring the talks.",
      "publishedAt": "2026-02-06T02:59:03Z",
      "title": "Iran and US set for talks in Oman over nuclear program",
      "url": "https://apnews.com/article/iran-us-protests-nuclear-negotiations-oman-muscat-32d621b98f7a3a68831f885d262bb70e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a239a1/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Ffc%2F656f9a9b6faed54cc26b99bc5926%2F265e9954c2334a6c863434b160aa85b2"
    },
    {
      "author": "Paul Wiseman, Christopher Rugaber",
      "description": "President Donald Trump claims his tariffs have revived the U.S. economy, calling it an “American economic miracle.” He argues that tariffs have boosted growth and reduced inflation. However, the facts tell a different story. The U.S. economy was already growing before his second term. During the first three quarters of the year, Trump’s tariffs — or the threat of them — delivered mixed results for the American economy. Inflation figures are skewed by data disruptions, and tariffs have actually increased core goods prices. Trump also claims foreign producers bear most tariff costs, but studies show U.S. consumers and firms are affected.",
      "publishedAt": "2026-02-06T05:02:58Z",
      "title": "Trump says tariffs led to economic growth. The facts tell another story",
      "url": "https://apnews.com/article/trump-economy-inflation-tariffs-gdp-fact-check-fc415e879519f14ea5219f00a97994f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/83eb4a0/2147483647/strip/true/crop/4290x2859+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Fef%2Fe5ef24807dc1033c552dc78df7df%2F74747226277f468e8050a50bdc2bf4db"
    },
    {
      "author": "Bianca Vázquez Toness",
      "description": "For many immigrant families in Minnesota, sending a child to school each day requires faith that one of the thousands of federal immigration officers deployed around the state won’t detain them. Thousands of children are staying home, often for lack of door-to-door transportation — or simply trust that they'll make it to school. For some families, the fear has turned into reality. Many parents and at least some children have been detained. Schools, parents and community groups have mobilized to help students get to class so they can learn, socialize and have consistent access to two meals.",
      "publishedAt": "2026-02-06T05:01:16Z",
      "title": "In Minnesota immigration crackdown, attending school is act of faith",
      "url": "https://apnews.com/article/minnesota-school-children-immigration-enforcement-f5ae3c38217339d9e6630ee264b5a801",
      "urlToImage": "https://dims.apnews.com/dims4/default/d26c7ae/2147483647/strip/true/crop/5416x3609+0+130/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F28%2F67b6245f0ad7a7407baa6ba38df8%2F40e43b9c768d4cf1a2ee166f86a0f200"
    },
    {
      "author": "Barbara Ortutay, Ed White",
      "description": "Savannah Guthrie made a heart-wrenching plea for “proof of life” of her 84-year-old mother. And in this digital age, the NBC “Today” co-anchor says she knows that voices and images can be manipulated. At least three news organizations have reported receiving purported ransom notes about Nancy Guthrie that they handed over to investigators. As technology has advanced, some have grown savvy and used it to their benefit, confusing police and the public and masking their identities. A former FBI agent says “it just adds to the other shoe-leather work” of solving crimes.",
      "publishedAt": "2026-02-06T05:01:43Z",
      "title": "Savannah Guthrie wants proof that her mom is alive. That's complicated in this era of AI",
      "url": "https://apnews.com/article/nancy-guthrie-ai-deepfakes-fbi-16298b586ea0fb7d5a5578d2c54b342a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fb8fcf/2147483647/strip/true/crop/2797x1864+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F59%2F07fb815dba026543f4f8659c8858%2Fbaa9e3e7f56048f7935ed4eade48d5da"
    },
    {
      "author": "Sejal Govindarao, Jacques Billeaud",
      "description": "There has been no public sign of a response to NBC “Today” show host Savannah Guthrie’s message to her 84-year-old mother’s kidnapper. In a recorded video posted Wednesday on social media, Guthrie said her family is ready to talk. But she says they want proof that Nancy Guthrie, who authorities believe was taken from her home in Arizona against her will, is still alive. Guthrie says her family heard media reports about a ransom letter. Nancy Guthrie was last seen Saturday night and she was reported missing midday Sunday after she didn’t appear at a church. Authorities on Wednesday offered no detailed update on their search. Their next news conference is scheduled for Thursday.",
      "publishedAt": "2026-02-05T12:34:13Z",
      "title": "No sign of response to Guthrie's message to her mom's kidnapper",
      "url": "https://apnews.com/article/savannah-guthrie-nancy-guthrie-mom-missing-2765f354b498e6146b955162c3b71d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/156b2e7/2147483647/strip/true/crop/2341x1560+329+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F19%2Fc59e122a370290bd5210f2e5762f%2Ff085a4ce99ef43ceab5ce9c26dfa3a55"
    },
    {
      "author": null,
      "description": "A deputy chief of Russian military intelligence has been shot and wounded. Officials say Lt. Gen. Vladimir Alekseyev was attacked by an unidentified assailant in Moscow. The incident happened on Friday. Investigative Committee spokesperson Svetlana Petrenko says Alekseyev was hospitalized. She did not comment on who might be behind the attack. Alekseyev has served as the first deputy head of Russia’s military intelligence since 2011.",
      "publishedAt": "2026-02-06T08:15:09Z",
      "title": "A deputy chief of Russian military intelligence was shot and wounded in Moscow",
      "url": "https://apnews.com/article/russia-military-intelligence-officer-shot-moscow-82f1878b3ad7236b1d29279b522c2a2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The U.S. military says it has carried out another deadly strike on a vessel accused of trafficking drugs in the eastern Pacific Ocean. U.S. Southern Command said Thursday on social media that the boat “was transiting along known narco-trafficking routes in the Eastern Pacific and was engaged in narco-trafficking operations.” It said the strike killed two people. A video linked to the post shows a boat moving through the water before exploding in flames. Thursday’s attack raises the death toll from the Trump administration’s strikes on alleged drug boats to 128 people.",
      "publishedAt": "2026-02-06T04:05:31Z",
      "title": "US strikes another alleged drug boat in Eastern Pacific",
      "url": "https://apnews.com/article/trump-cartels-strike-boat-pacific-576876c948f283958eb2485c0d7b081a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a8c88d/2147483647/strip/true/crop/3548x2364+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F7d%2Fe402c7726fe77f42fd428c9d8ed9%2F583c5d1dc3ce439a92154bf29bb87065"
    },
    {
      "author": "Hillel Italie",
      "description": "Woody Allen’s friendship with Jeffrey Epstein has been known for years, but emails in the huge trove of records released by the Justice Department illustrate that relationship in new depth. The filmmaker, his wife and Epstein were neighbors in New York City. Records show the three dined together often. They also commiserated with each other about being accused of sexual misconduct. One year, Epstein used his connections to a former member of President Barack Obama’s administration to help Allen and his wife, Soon-Yi Previn, get a White House tour. A message sent to an assistant for Allen and Previn via email seeking comment wasn’t immediately returned.",
      "publishedAt": "2026-02-06T00:37:26Z",
      "title": "New Epstein documents reveal Woody Allen's White House visit",
      "url": "https://apnews.com/article/woody-allen-jeffrey-epstein-previn-farrow-0e53f8176fd47318e3d4477f3fc967e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9f49c3/2147483647/strip/true/crop/4137x2757+0+122/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F54%2Fb8b3ca39b2fa872509ae3d4b3383%2Fcf63f627ccbb4192970ee8bff6bf69d6"
    },
    {
      "author": "Jesse Bedayn",
      "description": "Derrick Johnson buried his mother’s ashes in 2023 alongside his home on Maui, fulfilling her wish of a final resting place overlooking her grandchildren. The FBI called Johnson a year later. They said his mother’s remains weren’t in the ashes he buried. Instead, his mother was among nearly 200 decomposing bodies found inside a Colorado funeral home. The funeral home owners had given families fake ashes for years. Jon and Carie Hallford were arrested in 2023 and charged with abusing corpses. On Friday, Jon Hallford will be sentenced. Johnson will be among the grieving families to speak, advocating for the maximum sentence of 50 years in prison.",
      "publishedAt": "2026-02-05T23:17:30Z",
      "title": "A man whose mother's body was among 189 corpses stashed in a Colorado funeral home speaks out",
      "url": "https://apnews.com/article/funeral-home-colorado-decomposing-bodies-human-remains-ac3bcd47bf6f492ba177a70fb4b30d71",
      "urlToImage": "https://dims.apnews.com/dims4/default/7918fbb/2147483647/strip/true/crop/3000x1999+0+35/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F3e%2Fa8d081853e96c7bc5098ccdb3ae7%2Fe320851c8cda49fc837f930bf6fc4ca5"
    },
    {
      "author": "Meg Kinnard",
      "description": "The chairman of prestigious law firm Paul Weiss has resigned from that position after emails revealed his exchanges with Jeffrey Epstein. Brad Karp will remain at the firm where he's practiced for 40 years and has served as chairman since 2008. He said in a statement from the firm that “recent reporting has created a distraction and has placed a focus on me that is not in the best interests” of Paul Weiss. Emails recently released by the Department of Justice as part of its Epstein investigation show Karp thanking Epstein for hosting an unforgettable evening in 2015. Karp also sought Epstein's help in 2016 for Karp's son's film career.",
      "publishedAt": "2026-02-05T18:05:50Z",
      "title": "Chairman of law firm Paul Weiss resigns after release of Epstein emails",
      "url": "https://apnews.com/article/epstein-karp-paul-weiss-emails-justice-department-0af16206a386198cd85ade0cd6c807d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/19895b6/2147483647/strip/true/crop/4842x3226+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F7b%2Fac2de2383b2af88176bb8374cb36%2F29303bc65d794eccbca66b346eedab76"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}