{
  "articles": [
    {
      "author": null,
      "description": "The House is expected to approve President Donald Trump’s request to claw back about $9 billion for public broadcasting and foreign aid. A final vote to approve the spending cuts package is scheduled for Thursday evening. Republicans are targeting institutions and programs they view as bloated or out of step with their agenda. The White House has described the package as a test case and says if Congress goes along, more requests will come. The House’s approval would mark the first time in decades that a president has successfully submitted such a request to Congress.",
      "publishedAt": "2025-07-17T16:58:02Z",
      "title": "House set to OK Trump's $9 billion cut to public broadcasting and foreign aid",
      "url": "https://apnews.com/article/pbs-npr-budget-cuts-trump-republicans-b0044285659ab708e23eb2dc2f3eabfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/4370289/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Fe5%2F2ab65bfc786e5ea4a992b70769a3%2F93a946a4feba42c0a10c155f5d5a981e"
    },
    {
      "author": null,
      "description": "House Republicans are trying to formulate a response to the Trump administration’s handling of records in the Jeffrey Epstein sex trafficking case. They ultimately put forward a resolution Thursday that carried no legal weight but nodded to the growing demand for greater transparency. The House resolution could potentially be voted on next week. It will do practically nothing to force the Justice Department to release more records in the case. Still, the Republican response showed how backlash from the Republican base is putting pressure on the Trump administration and roiling GOP lawmakers.",
      "publishedAt": "2025-07-18T02:34:17Z",
      "title": "House Republicans grasp for response to Epstein demands",
      "url": "https://apnews.com/article/congress-jeffrey-epstein-trump-24bf59310361b709a7cf6ee881a42e0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/08c0e00/2147483647/strip/true/crop/4502x2532+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Faf%2F4f0849ff49ac6d936f5a436d153c%2F9474d8e1b7c9467db6dd232edcbd1d57"
    },
    {
      "author": null,
      "description": "In the last two months, dozens of Russian regions have been hit by cellphone connectivity outages. Officials say such disruptions are needed to foil Ukrainian drone attacks. Areas affected range from those near the fighting to parts of Siberia and even the Far East. In some regions, Wi-Fi outages also have been reported. Russians contacted by The Associated Press describe the inconveniences as surmountable — ride-sharing apps don’t work and ATMs sometimes fail. But experts point to the unprecedented nature of the measures and warn of far-reaching consequences in a country where online freedom already is curtailed significantly.",
      "publishedAt": "2025-07-18T04:08:52Z",
      "title": "Russians endure disruptions of cellphone links to the internet in the name of wartime security",
      "url": "https://apnews.com/article/russia-internet-cellphone-disruptions-ukraine-war-9644b7147d661a8e0809465afffb452f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4465ea9/2147483647/strip/true/crop/4673x2629+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F7a%2Ffe348a5ec5eca2bc2ef9732e6dab%2Fc5b1803e61344f43bd52c217367d063f"
    },
    {
      "author": null,
      "description": "Officials in Iraq are struggling to identify more than a dozen bodies pulled from a deadly fire at a shopping mall. An official said the blaze at the newly-opened shopping center in Wasit province killed a total of 63 people, including 18 victims who remain unidentified due to severe burns. The fire broke out late Wednesday on the second floor of the Corniche Hypermarket mall, which had opened just days before. Civil defense crews rescued 45 people. Most victims were trapped on upper floors. Officials blame poor safety standards and lack of permits for the tragedy. Legal complaints had been filed against the building owner and shopping center owner.",
      "publishedAt": "2025-07-18T10:00:56Z",
      "title": "Officials try to identify 18 bodies in deadly Iraq shopping mall fire",
      "url": "https://apnews.com/article/iraq-mall-fire-62d7e306d589f56470306c1284e79150",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b0628f/2147483647/strip/true/crop/5366x3018+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2Fde%2F8b1f6dbb3c67115ce06aa92f63f6%2F0ab6ebd44f37481fa8f5ccbd6d972ed5"
    },
    {
      "author": null,
      "description": "Members of Syria's Druze community are searching for loved ones and counting their dead after days of clashes in a southern province that left bloodied bodies of civilians on the streets and homes looted. The fighting in Sweida province this week began with tit-for-tat kidnappings and attacks between local Sunni Bedouin tribes and Druze armed factions. Government forces that intervened to restore order clashed with the Druze militias, but also in some cases attacked civilians. One monitoring group said dozens of civilians were rounded up by fighters and shot and killed. The violence has left Druze more skeptical of Syria’s new leadership and doubtful of peaceful coexistence.",
      "publishedAt": "2025-07-18T05:03:14Z",
      "title": "Syria's Druze search for loved ones, find bodies in the streets after clashes",
      "url": "https://apnews.com/article/syria-sweida-druze-beduins-clashes-killings-18ef9342394408ecb7810fdb0e89168e",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fd118e/2147483647/strip/true/crop/3200x1800+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F6e%2Fb27cf87280c1d7d50d5a330e4733%2F654f02a6f2bd4498a212e9057fb7c950"
    },
    {
      "author": null,
      "description": "A new AP-NORC poll shows that while Republican elected officials are promoting their recently passed tax and spending bill as a win for working Americans, everyday Americans broadly see it as a win for the wealthy. About two-thirds of U.S. adults expect the new tax law will help the wealthy, according to the survey. Most — about 6 in 10 — think it will do more to hurt than help low-income people. About half say it will do more harm than good for middle-class people and people like them. Republicans have already begun airing advertisements framing the legislation as a tax cut for all Americans, but the new poll indicates that they have some persuading to do.",
      "publishedAt": "2025-07-18T11:08:41Z",
      "title": "Most think GOP tax bill will help the wealthy, poll finds",
      "url": "https://apnews.com/article/trump-taxes-spending-deficit-government-spending-79e6a1bd795e7f82ca39986a407ddbef",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c2b6db/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F79%2F76c42a1f134c1e058189903915a0%2Fdda00f0ffebc46a4ad4f0cf61d73234e"
    },
    {
      "author": null,
      "description": "U.S. Immigration and Customs Enforcement officials will gain access to personally identifiable information for all of the nation’s 79 million Medicaid enrollees. That's according to an agreement obtained by The Associated Press. ICE officials plan to track immigrants who may not be living legally in the United States. The agreement was signed Monday between officials at the Centers for Medicare and Medicaid Services and the Department of Homeland Security. Direct access will be given to the addresses, Social Security numbers, birth dates as well as the ethnicity and race of all Medicaid enrollees.",
      "publishedAt": "2025-07-17T16:19:47Z",
      "title": "Trump administration hands over nation's Medicaid enrollee data to ICE",
      "url": "https://apnews.com/article/immigration-medicaid-trump-ice-ab9c2267ce596089410387bfcb40eeb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9000fb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fc9%2F487a5a83c70b764651f423a1d942%2F17de1c7cd4c74c1f8d4f7b9ddb4122a8"
    },
    {
      "author": null,
      "description": "From crypto coins to bibles, overseas development deals to an upcoming line of cellphones, Trump family businesses have raked in hundreds of millions of dollars since his election. That flood of often shadowy money –- from billionaires, foreign governments and cryptocurrency tycoons, all with interests before the federal government –- has permitted the president to leverage the power of his office for personal gain unlike any of his predecessors.",
      "publishedAt": "2025-07-18T11:13:03Z",
      "title": "For Sale: Trump is leveraging power of his office to reap profits for family businesses",
      "url": "https://apnews.com/article/trump-businesses-trump-organization-white-house-conflicts-of-interest-b970b5681b27f86dcd461ff473be23fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/415a85b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F3f%2Fbb498fb0cebce83634ba08874adf%2Ffae0c9ad787e4e2e994e8c7556028986"
    },
    {
      "author": null,
      "description": "Former Missouri congressman Billy Long is set to be ceremonially sworn in as IRS commissioner on Friday. Long, who once advocated for abolishing the IRS, takes over an agency struggling with staffing cuts and leadership turnover. He was confirmed by the Senate last month despite Democratic concerns over his ties to a tax credit scheme and campaign contributions linked to his nomination by then President-elect Donald Trump. Long, who lacks tax administration experience, has pledged to improve the agency's culture. His appointment follows a trend of Trump appointees leading agencies they previously criticized or sought to dismantle.",
      "publishedAt": "2025-07-18T11:06:07Z",
      "title": "Former Rep. Billy Long will be sworn in as IRS commissioner",
      "url": "https://apnews.com/article/donald-trump-billy-long-irs-commissioner-ceremony-ed7aa83d9b0ced76fa6ce21daf635280",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab4aa22/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F7a%2Fd6b715272798cd66de6272728d5e%2F200915e1e0ce41c8a0d75be18f9b1d8c"
    },
    {
      "author": null,
      "description": "CBS is axing “The Late Show With Stephen Colbert” in May 2026. The announcement on live air Thursday came two days after Colbert spoke out against Paramount Global settling with President Donald Trump over a “60 Minutes” story. The news was also announced in a press release sent from CBS with a link to a clip of Colbert’s announcement on Instagram. The comedian and TV personality began by telling the audience he was sharing something he learned the night before. Colbert said, \"I’m not being replaced. This is all just going away.”",
      "publishedAt": "2025-07-17T23:57:05Z",
      "title": "Stephen Colbert's 'Late Show' has been canceled by CBS",
      "url": "https://apnews.com/article/stephen-colbert-late-show-cbs-end-8bad9f16f076df62c0ffc50e9c8adbab",
      "urlToImage": "https://dims.apnews.com/dims4/default/63fd624/2147483647/strip/true/crop/3696x2079+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fc0%2F3074814f0ccd27ad994aedf70a3f%2F3e5b8168beeb4cecbc00ddc252a7fad6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}