{
  "articles": [
    {
      "author": null,
      "description": "JERUSALEM (AP) — The Israeli army has told Palestinians to begin evacuating eastern Rafah, according to an Israeli Defense Force statement on Monday, signaling that a ground invasion is imminent.People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
      "publishedAt": "2024-05-06T05:29:00Z",
      "title": "Israeli army tells Palestinians to temporarily evacuate parts of Rafah ahead of an expected assault",
      "url": "https://apnews.com/8659eae6e0a7362504f0aa4aa4be53e0",
      "urlToImage": ""
    },
    {
      "author": "NICK PERRY and PHILIP MARCELO",
      "description": "Students protesting the war in Gaza abandoned their camp at the University of Southern California early Sunday after being surrounded by police and threatened with arrest, while Northeastern University's commencement ended peacefully at Boston's Fenway Park.",
      "publishedAt": "2024-05-05T11:45:27Z",
      "title": "Anti-war protesters leave USC after police arrive, while Northeastern ceremony proceeds calmly",
      "url": "https://apnews.com/3afafc2d56c6dc87635549475d94e1d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc83ed3d636d40418b19ff667cdfdce2/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Prosecutors in Donald Trump's hush money trial are moving deeper into his orbit following an inside-the-room account about the former president's reaction to a politically damaging recording that surfaced in the final weeks of the 2016 campaign.",
      "publishedAt": "2024-05-06T04:24:11Z",
      "title": "Prosecutors move deeper into Trump's orbit as testimony in hush money trial enters a third week",
      "url": "https://apnews.com/c41df6a82434247352fe7a110daae981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50ef7eeb17eb496595cf8252e10c49ef/3000.jpeg"
    },
    {
      "author": "GARANCE BURKE and ALAN SUDERMAN",
      "description": "FORT LAUDERDALE, Fla. (AP) — Donald Trump’s former campaign manager looked squarely into the camera and promised his viewers they were about to witness a bold new era in politics.“You’re going to see some of the most amazing new technology in artificial intelligence that’s going to replace polling in the future across the country,” said Brad Parscale in a dimly lit promotional video accentuated by hypnotic beats.",
      "publishedAt": "2024-05-06T04:04:09Z",
      "title": "Brad Parscale helped Trump win in 2016 using Facebook ads. Now he’s back, and an AI evangelist",
      "url": "https://apnews.com/3ff2c8eba34b87754cc25e96aa257c9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31bb8d1109f14cf1b67c6082faa1aba0/1920.jpeg"
    },
    {
      "author": "COURTNEY SUBRAMANIAN",
      "description": "WASHINGTON (AP) — President Joe Biden’s campaign and Democratic candidates are in a fevered race with Republicans over who can best exploit the potential of artificial intelligence, a technology that could transform American elections — and perhaps threaten democracy itself.",
      "publishedAt": "2024-05-06T04:08:58Z",
      "title": "Nervous about falling behind the GOP, Democrats are wrestling with how to use AI",
      "url": "https://apnews.com/520f22de269ba1eff24d1544ca38d569",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0db2d38979484f57a8725289600327e8/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, DIDI TANG and NATHAN ELLGREN",
      "description": "WASHINGTON (AP) — After a student leader of the historic Tiananmen Square protests entered a 2022 congressional race in New York, a Chinese intelligence operative wasted little time enlisting a private investigator to hunt for any mistresses or tax problems that could upend the candidate's bid, prosecutors say.",
      "publishedAt": "2024-05-06T04:15:43Z",
      "title": "As China and Iran hunt for dissidents in the US, the FBI is racing to counter the threat",
      "url": "https://apnews.com/ee48c1b9c32d187b183faaa616d9ab16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39e7b7f2ae994abe8fe0444f0fe89d0a/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Relatives have identified three bodies found in a well as those of two Australian surfers and one American who went missing last weekend, Mexican authorities said Sunday.Baja California state prosecutors said the relatives had viewed the corpses recovered from a remote well about 50 feet (15 meters) deep and recognized them as their loved ones.",
      "publishedAt": "2024-05-05T19:44:06Z",
      "title": "3 bodies in Mexican well identified as Australian and American surfers killed for truck's tires",
      "url": "https://apnews.com/94f03f0570312308a4989476435c3102",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1412aff3356d4a839097b14fd0025196/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Massive floods in Brazil’s southern Rio Grande do Sul state have killed at least 75 people over the last seven days, and another 103 were reported missing, local authorities said Sunday.",
      "publishedAt": "2024-05-05T15:27:50Z",
      "title": "Floods in southern Brazil kill at least 75 people over 7 days, with 103 people missing",
      "url": "https://apnews.com/f62a0ace01aad5832a928ec4a918b579",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0cd9bd423c34f839d0cd4c3c36b007e/2000.jpeg"
    },
    {
      "author": "JAMIE STENGLE and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — Floodwaters closed some Texas schools on Monday after days of heavy rains pummeled the Houston area and led to hundreds of rescues including people who were standed on rooftops.",
      "publishedAt": "2024-05-06T04:30:11Z",
      "title": "Heavy rains ease around Houston but flooding remains after hundreds of rescues and evacuations",
      "url": "https://apnews.com/117b0f63c9bd53be31ee34e11547da21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98b6de3af54848d38c2310358b1feaa0/1920.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — In the latest round of their decades-long battle for dominance in commercial aircraft, Europe’s Airbus established a clear sales lead over Boeing even before the American company encountered more fallout from manufacturing problems and ongoing safety concerns.",
      "publishedAt": "2024-05-06T04:01:22Z",
      "title": "Commercial jet maker Airbus is staying humble even as Boeing flounders. There's a reason for that",
      "url": "https://apnews.com/8a7c361e379285c87c9a84638faf9302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e658e14d232456eb6d94162b6a0faf3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}