{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump's defense attorneys grilled Stormy Daniels Thursday on the transaction at the center of the former president's hush money trial, pressing her on why she accepted a $130,000 payment to keep quiet about her alleged sexual encounter with Trump instead of going public.",
      "publishedAt": "2024-05-09T04:03:49Z",
      "title": "Stormy Daniels spars with Trump defense attorney in tense exchange over cash-for-silence transaction",
      "url": "https://apnews.com/d8be160e53c8050bf788d7772f483a64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a8ac4a1517642178f48bbe78fe2453d/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Stormy Daniels concluded her testimony in Donald Trump's hush money trial Thursday after spending roughly 7 1/2 hours on the stand over two days.",
      "publishedAt": "2024-05-09T10:19:13Z",
      "title": "The Latest | Testimony in Trump's hush money trial forges ahead with more witnesses",
      "url": "https://apnews.com/27cc4c7fdaea835f06fa31fe87b83364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c0bd997b5eb44ce976553de8cf88c5c/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS, SAM MEDNICK and MENELAOS HADJICOSTIS",
      "description": "JERUSALEM (AP) — Israel's military spokesman says the army has the weapons it needs to press ahead with its offensive in the southern Gaza city of Rafah.Rear Adm. Daniel Hagari was asked at a news conference whether the army can conduct the operation without U.S.",
      "publishedAt": "2024-05-09T10:53:43Z",
      "title": "Israeli military says it has weapons it needs for Rafah ground operation",
      "url": "https://apnews.com/c2f2545739b7c9499476e6b4cfa9b5df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1eaa2b3ea974a1fb214ec66d486ba65/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The United States warned on Thursday that Israel will be dealing a strategic victory to Hamas if it carries out plans for an all-out assault on Rafah, the militants' last major stronghold in Gaza.",
      "publishedAt": "2024-05-09T17:41:07Z",
      "title": "US says Rafah offensive would jeopardize cease-fire talks as Biden threatens to halt more Israel aid",
      "url": "https://apnews.com/5c743e621c5594b49e0a89c985a605f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b086fee770154441958b7c8c7f7d8dc2/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Mike Johnson's job isn't safe yet. In a stunning show of unity in the often divided House, Democrats joined a majority of Republicans on Wednesday to save the GOP speaker from an attempt by fellow Republican Rep.",
      "publishedAt": "2024-05-09T17:31:50Z",
      "title": "House Speaker Mike Johnson survived a motion to vacate. Here's why his job is far from safe.",
      "url": "https://apnews.com/2e091748562e99373561ed8015cf5e82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/900c2c1fe59a4f20a26f3155fb97d552/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The rate of guns stolen from cars in the U.S. has tripled over the last decade, making them the largest source of stolen guns in the country, an analysis of FBI data by the gun safety group Everytown found.",
      "publishedAt": "2024-05-09T10:22:05Z",
      "title": "Guns are being stolen from cars at triple the rate they were 10 years ago, a report finds",
      "url": "https://apnews.com/66316ff1933dad8df984803fca377775",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2398bdc13ac4753b60f893097034d7c/1277.jpeg"
    },
    {
      "author": "LYNN BERRY, DIDI TANG, JILL COLVIN and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Making future military aid to Ukraine contingent on the country participating in peace talks with Russia.",
      "publishedAt": "2024-05-09T13:01:48Z",
      "title": "Trump-affiliated group releases new national security book outlining possible second-term approach",
      "url": "https://apnews.com/54080728c6e549c8312c4d71150480ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df8a61b2edc14d57924c25d7d1ce76b0/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Harvey Weinstein will remain locked up in New York as a court works out whether he should stay in a city jail while awaiting retrial, or be sent to California to serve his prison sentence for rape there.",
      "publishedAt": "2024-05-09T13:48:51Z",
      "title": "Harvey Weinstein won't be sent back to California while he awaits New York rape retrial",
      "url": "https://apnews.com/d24201a3453a019bab96e8f59b136d4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee1855769a3140bd9d6e8f2cc5099bb7/1920.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — A newly released ad promoting Apple's new iPad Pro has struck quite a nerve online.The ad, which was released by the tech giant Tuesday, shows a hydraulic press crushing just about every creative instrument artists and consumers have used over the years — from a piano and record player, to piles of paint, books, cameras and relics of arcade games.",
      "publishedAt": "2024-05-09T17:46:20Z",
      "title": "Technology crushing human creativity? Apple's 'disturbing' new iPad ad has struck a nerve online",
      "url": "https://apnews.com/12e7fbd335feb4875d94c31b87379359",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dae61a77ffa42eabb36b850341d7bff/2432.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Tom Selleck starts his memoir in the middle of a car crash. He is 17 and in the passenger seat when he and two friends go airborne in his mom's red Chevy Corvair, tumbling off Mulholland Drive in Los Angeles.",
      "publishedAt": "2024-05-09T15:35:27Z",
      "title": "In new memoir, Tom Selleck looks back at the hard years that made him a star in 'Magnum, P.I.'",
      "url": "https://apnews.com/acf166c42037f6d1f343ec951e27b86d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/386e61b653d44c41b270bd4c935e4741/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}