{
  "articles": [
    {
      "author": "SAM MEDNICK and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — A delegation of the Palestinian militant group Hamas was in Cairo on Saturday as Egyptian state media reported “noticeable progress” in ongoing cease-fire talks with Israel while an Israeli official downplayed the prospects for a full end to the war.",
      "publishedAt": "2024-05-04T11:15:59Z",
      "title": "Egypt media cite progress in truce talks as Israel downplays chances of end to war with Hamas",
      "url": "https://apnews.com/4eae8b7a75440d4dd9a201219d60bcd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/211ba69ec1264318831df1ed12d9a404/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "KYIV, Ukraine (AP) — The Ukrainian village of Ocheretyne has been battered by fighting, drone footage obtained by The Associated Press shows. The village has been a target for Russian forces in the Donetsk region of eastern Ukraine.",
      "publishedAt": "2024-05-04T09:09:47Z",
      "title": "Drone footage shows Ukrainian village battered to ruins as residents flee Russian advance",
      "url": "https://apnews.com/9828527032079d4cf669c49be09fdd68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9230c9169344225b8ec033328aa1539/1935.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — The Houston area was under threat of worsening flood conditions Saturday, a day after heavy storms slammed the region and authorities warned those in low-lying areas to evacuate ahead of an expected “catastrophic” surge of water.",
      "publishedAt": "2024-05-04T05:03:47Z",
      "title": "Houston braces for flooding to worsen in wake of storms",
      "url": "https://apnews.com/bdac71b839dc0966cd03288113956279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e72ac835221b48f6b976dd5c4b9ba011/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, JILL COLVIN and CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Joe Biden and Donald Trump are two presidents with unfinished business and an itch to get it done.",
      "publishedAt": "2024-05-04T04:02:43Z",
      "title": "Biden and Trump offer worlds-apart contrasts on issues in 2024's rare contest between 2 presidents",
      "url": "https://apnews.com/1a904cd70f14581f264b851a5cb2f9e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d08e7b35ef4a38939a6264d4132856/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — For two decades, U.S. Rep. Henry Cuellar has stood out as a moderate Democrat along the Texas-Mexico border, bucking his party at times over guns and immigration while seldom facing a tough reelection.",
      "publishedAt": "2024-05-04T04:18:58Z",
      "title": "Rep. Henry Cuellar of Texas vows to continue his bid for an 11th term despite bribery indictment",
      "url": "https://apnews.com/ec9904da5c51d11600718a3261f73d0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d45164c3c1243c8bf09be5526c19263/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Israel this week briefed Biden administration officials on a plan to evacuate Palestinian civilians ahead of a potential operation in the southern Gaza city of Rafah aimed at rooting out Hamas militants, according to U.S.",
      "publishedAt": "2024-05-03T22:47:04Z",
      "title": "Israel has briefed US on plan to evacuate Palestinian civilians ahead of potential Rafah operation",
      "url": "https://apnews.com/eba21ef4b7c61fb2f1de77c14ca90cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d354f62f4f5543e3a1941eadc4c3ea7b/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — Israel-Hamas war demonstrations at the University of Mississippi turned ugly this week when one counter-protester appeared to make monkey noises and gestures at a Black student in a raucous gathering that was endorsed by a far-right congressman from Georgia.",
      "publishedAt": "2024-05-04T00:56:09Z",
      "title": "Congressman praises heckling of war protesters, including 1 who made monkey gestures at Black woman",
      "url": "https://apnews.com/49c768142013680198809903e9e66a5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7b5ae9f50c0467cbeb1a52b8198f86b/1920.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — Kevin Spacey, the Oscar-winning actor, has denied new allegations of inappropriate behaviour from men who will feature in a documentary on British television that is due to be released next week.",
      "publishedAt": "2024-05-04T11:32:54Z",
      "title": "Kevin Spacey denies new allegations of inappropriate behavior to be aired on UK television next week",
      "url": "https://apnews.com/abb53b9bba264dd602404ff4f74678b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b0dd28ae6204e64b2cc1b27a6ef38de/2890.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "As the U.S. government moves toward reclassifying marijuana as a less dangerous drug, there may be little immediate impact in the dozen states that have not already legalized cannabis for widespread medical or recreational use by adults.",
      "publishedAt": "2024-05-04T04:11:28Z",
      "title": "Marijuana backers eye proposed federal regulatory change as an aid to legalizing pot in more states",
      "url": "https://apnews.com/83b1ad0e01bcd65142ca6cf4abdd110b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/101fa376b6574309b35fecf66463f108/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — A flood and a landslide hit Indonesia’s Sulawesi island, killing 14 people, officials said Saturday.Torrential rain pounding the area since Thursday triggered a landslide in Luwu district in South Sulawesi province, said local rescue chief Mexianus Bekabel.",
      "publishedAt": "2024-05-04T03:35:13Z",
      "title": "Flood and landslide hit Indonesia's Sulawesi island, killing 14",
      "url": "https://apnews.com/c19c525d08f17412d0ee0c64b9a78cd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/274b3856eeba4389ae9518ef05ac7bf8/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}