{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Israel increased airstrikes on the Gaza Strip and sealed it off from food, fuel and other supplies Monday in retaliation for a bloody incursion by Hamas militants, as the war's death toll rose to nearly 1,600 on both sides.",
      "publishedAt": "2023-10-09T04:45:19Z",
      "title": "Israel strikes and seals off Gaza after incursion by Hamas, which vows to execute hostages",
      "url": "https://apnews.com/4377e096f62bf535bebcdff38cf16049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65221dd6242b48a0badbf7dca87a2d39/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and ERIC TUCKER",
      "description": "WASHINGTON (AP) — President Joe Biden has been interviewed as part of an independent investigation into his handling of classified documents, the White House said late Monday.",
      "publishedAt": "2023-10-09T23:41:35Z",
      "title": "Biden interviewed as part of special counsel investigation into handling of classified documents",
      "url": "https://apnews.com/025f25d04a5c0e45d758fbaaa2f231b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe9b22feca3a49b49a7777eaab46e74b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republicans have no clear idea who will be the next U.S. House speaker, leaving an unprecedented power vacuum in Congress and severely limiting America's ability to quickly respond to the crisis in Israel — or any number of other problems at home and abroad.",
      "publishedAt": "2023-10-09T19:24:48Z",
      "title": "As Republicans split over who will be House speaker, McCarthy positions himself as a de facto leader",
      "url": "https://apnews.com/58c7df019c59e144b2a526c657cf6087",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35d09217fcf444e7883fbee3369f07d2/1920.jpeg"
    },
    {
      "author": "OMID HAQJO",
      "description": "ZINDA JAN, Afghanistan (AP) — People dug through the rubble of the quake in western Afghanistan for their few possessions but the material losses seemed unimportant.",
      "publishedAt": "2023-10-09T07:58:45Z",
      "title": "Mounds of rubble and a future of grief are what's left after Afghanistan earthquake killed thousands",
      "url": "https://apnews.com/0aecf4c94979bd663d63922949f5ad0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/309e6b8056f941b8a9e8951ad16a03c7/1920.jpeg"
    },
    {
      "author": "MARK THIESSEN and MORGAN LEE",
      "description": "ANCHORAGE, Alaska (AP) — Events across the country — including a sunrise gathering in Minneapolis, a statehouse rally in Maine, a celebratory march in Seattle and traditional dancing, music, and food in Alaska and Arizona — marked celebrations of Indigenous Peoples Day.",
      "publishedAt": "2023-10-09T16:54:36Z",
      "title": "Sunrise gatherings, dances and speeches mark celebration of culture on Indigenous Peoples Day",
      "url": "https://apnews.com/03201cd01d147773b3236806282d3518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa514aa619e442d95b90e9aacdc440e/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN",
      "description": "FARMERVILLE, La. (AP) — A judge delivered a victory Monday to the state prosecution of white Louisiana lawmen in the deadly 2019 arrest of Ronald Greene, allowing the most serious charge of negligent homicide to go forward against a trooper captured on body-camera video dragging the Black motorist by his ankle shackles and forcing him to lie facedown in the dirt.",
      "publishedAt": "2023-10-09T22:10:12Z",
      "title": "Judge upholds most serious charges in deadly arrest of Black driver Ronald Greene",
      "url": "https://apnews.com/7ebc9b2ba67501e32389b67b946b3c7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb3c69ca9eb14656ba6f7104417c08cc/2492.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Former Republican Texas congressman Will Hurd suspended his presidential bid on Monday and endorsed fellow GOP primary candidate Nikki Haley, officially abandoning a brief campaign built on criticizing Donald Trump at a time when his party seems even more determined to embrace the former president.",
      "publishedAt": "2023-10-09T22:56:06Z",
      "title": "Former Texas Rep. Will Hurd suspends long-shot GOP 2024 presidential bid, endorses Nikki Haley",
      "url": "https://apnews.com/c34b3c8d9ef44126e8e36623b1dc3021",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f76728bcf0a340b7bd982c996f6a1817/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — How much is Donald Trump's Mar-a-Lago worth? That's been a point of contention after a New York judge ruled that the former president exaggerated the Florida property's value when he said it's worth at least $420 million and perhaps $1.5 billion.",
      "publishedAt": "2023-10-09T14:37:45Z",
      "title": "Is Mar-a-Lago worth $1 billion? Trump's winter home valuations are at the core of his fraud trial",
      "url": "https://apnews.com/51fea4e520b1901c1c045590b2a7bdc0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbb6e29ba3c14f5ebdaf39747214d93b/3000.jpeg"
    },
    {
      "author": "BY RALPH D. RUSSO",
      "description": "When a new football stadium was built at South Alabama, located in one of America's rainiest cities, the decision was made to go with an artificial turf playing surface.At San Diego State, where the weather seems almost always perfect, going with a grass field was an easy choice — but not the usual one in major college football.",
      "publishedAt": "2023-10-09T15:00:07Z",
      "title": "Costly upkeep, less-than-ideal weather lead most college football stadiums to use artificial turf",
      "url": "https://apnews.com/345b555ae64e96873dc3d2677ecc779d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/088af90336ca4512879e81334ffed76d/3000.jpeg"
    },
    {
      "author": "ALICIA RANCILIO",
      "description": "You could say Joe Cristalli tweeted his role as an executive producer and co-showrunner on the new “ Frasier ” sitcom into existence. About 10 years ago as a fledgling TV writer and “Frasier” super fan, Cristalli started a Twitter account with “random jokes\" about the show and character made famous by Kelsey Grammer in the sitcoms “Cheers” and “Frasier.”",
      "publishedAt": "2023-10-09T18:56:54Z",
      "title": "'Frasier' returns to TV but you don't need to be a superfan of the original to laugh at its jokes",
      "url": "https://apnews.com/5c1a887d0b8ee3c5386523196ec86617",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5974461932c84692bfb56414d62eea35/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}