{
  "articles": [
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Men walk through a lush plantation between Ecuador ’s balmy Pacific coast and its majestic Andes, lopping hundreds of bunches of green bananas from groaning plants twice their height.",
      "publishedAt": "2023-09-04T04:21:18Z",
      "title": "Security in Ecuador has come undone as drug cartels exploit the banana industry to ship cocaine",
      "url": "https://apnews.com/6d6529e2b1d8f3cbd16aea74ade0b93d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f8c3bf4be1a4d0f8c7164c5bd2581a9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin said Monday that a landmark deal allowing Ukraine to export grain safely through the Black Sea amid the war won’t be restored until the West meets Moscow's demands on its own agricultural exports.",
      "publishedAt": "2023-09-04T08:04:09Z",
      "title": "Putin says he won't renew the grain deal until the West meets his demands. The West says it has",
      "url": "https://apnews.com/ac41cb453a6d6c597d543873850414eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb6484dc8cc440199f379715cce3401/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — Steve Harwell, the longtime frontman of the Grammy-nominated pop rock band Smash Mouth that was behind the megahit “All Star” has died.",
      "publishedAt": "2023-09-04T16:30:52Z",
      "title": "Smash Mouth frontman Steve Harwell, known for the ubiquitous pop-rock hit 'All Star,' dies at 56",
      "url": "https://apnews.com/868ae1aa513ce66dbf5ef0499c13261a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5afb08d435c943799db0c0660a7098c0/3000.jpeg"
    },
    {
      "author": null,
      "description": "BLACK ROCK DESERT, Nev. (AP) — An unusual late-summer storm turned a week-long counterculture fest into a sloppy mess with tens of thousands of partygoers stuck in foot-deep mud and with no working toilets in the northern Nevada desert.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Burning Man flooding strands tens of thousands at Nevada site; authorities are investigating 1 death",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "PHILADELPHIA (AP) — President Joe Biden, who often says he's the most pro-union president in history, touted the importance of organized labor and applauded American workers in building the economy during a Labor Day appearance in Philadelphia on Monday.",
      "publishedAt": "2023-09-04T10:43:25Z",
      "title": "Biden celebrates unions and job creation during a Philadelphia Labor Day appearance",
      "url": "https://apnews.com/011b5c6b283b60d3b69398f1e081a0d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25cf09bdb5e041a0b96cd55c9dcc83be/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — A 46% pay raise. A 32-hour week with 40 hours of pay. A restoration of traditional pensions.The demands that a more combative United Auto Workers union has pressed on General Motors, Stellantis and Ford — demands that even the UAW's own president calls “audacious” — are edging it closer to a strike when its contract ends Sept.",
      "publishedAt": "2023-09-04T09:00:28Z",
      "title": "UAW's clash with Big 3 automakers shows off a more confrontational union as strike deadline looms",
      "url": "https://apnews.com/349a6e7281f1b07710cfcad511dcaa05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/037814effb2e4aad82688d2a66a4fc61/1920.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Iran has slowed the pace at which it is enriching uranium to nearly weapons-grade levels, according to a report by the United Nations’ nuclear watchdog seen by The Associated Press on Monday.",
      "publishedAt": "2023-09-04T09:50:57Z",
      "title": "UN nuclear watchdog report seen by AP says Iran slows its enrichment of near-weapons-grade uranium",
      "url": "https://apnews.com/af4a183a2e97375708a494d5324c2836",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55d4f68555444d10b39f41c0aa810ebe/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "ANDERSON, S.C. (AP) — A microphone in hand, Sen. Tim Scott left the podium at a recent barbecue event in South Carolina and made his way through tables draped in red, white and blue as attendees finished plates of pulled pork and baked beans.",
      "publishedAt": "2023-09-04T04:06:23Z",
      "title": "In the pivotal South Carolina primary, Republican candidates search for a path against Donald Trump",
      "url": "https://apnews.com/0f7e001af12f4044a64f38330e429f42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d8018c15284c2e964a866abf5ff136/2223.jpeg"
    },
    {
      "author": "ALLEN G. BREED",
      "description": "ALLIGATOR RIVER NATIONAL WILDLIFE REFUGE, N.C. (AP) — Jeff Akin had to bite his tongue.He was chatting with a neighbor about efforts to protect and grow the area’s red wolf population. The endangered wolves are equipped with bright orange radio collars to help locals distinguish the federally protected species from invasive, prolific coyotes.",
      "publishedAt": "2023-09-04T05:13:48Z",
      "title": "Endangered red wolves need space to stay wild. But there’s another predator in the way — humans",
      "url": "https://apnews.com/f3232e07520fbff33b2ba179dc8ee651",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1977df96c9244768b6b1e8f8badf14a/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — The wait is over: The Rolling Stones will soon release new music.On Monday, the band announced they are preparing to release their first album of original material in 18 years — since 2005's “A Bigger Bang.”",
      "publishedAt": "2023-09-04T19:00:40Z",
      "title": "The Rolling Stones will release their first studio album in 18 years, 'Hackney Diamonds'",
      "url": "https://apnews.com/2fea496b0ab0dfac78f1cb4c2c740aed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b241314e9e24fde919f8459c935553a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}