{
  "articles": [
    {
      "author": "ERIC TUCKER and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Former President Donald Trump faced new charges Thursday in a case accusing him of illegally possessing classified documents, with prosecutors alleging that he asked a staffer to delete camera footage at his Florida estate in an effort to obstruct a federal investigation into the records.",
      "publishedAt": "2023-07-27T22:01:08Z",
      "title": "Trump accused of asking staffer to delete camera footage in Florida classified documents case",
      "url": "https://apnews.com/2025feb3f0f4e3820d14387c67ce4316",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202f5335493a45bdb3be08d4946c0c51/1920.jpeg"
    },
    {
      "author": "MEG KINNARD and ALANNA DURKIN RICHER",
      "description": "New charges — and a new defendant — added to the classified documents case against former President Donald Trump underscore how the Mar-a-Lago investigation is still very much ongoing, even as the focus has been on an expected indictment in a separate case related to the 2020 election.",
      "publishedAt": "2023-07-28T02:17:25Z",
      "title": "Donald Trump faces new charges in the Mar-a-Lago classified documents case. Here's what to know",
      "url": "https://apnews.com/bee867f48da593d351c5a91e87c356a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8d497cca6b64a5bb06baee018092205/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The unraveling of Hunter Biden's plea agreement has thrust his criminal case into uncertain waters and given new fodder to Republican critics in Congress as they push ahead with investigations into the president's youngest son.",
      "publishedAt": "2023-07-27T17:58:31Z",
      "title": "What's next for Hunter Biden in court and Congress after his plea deal derails",
      "url": "https://apnews.com/ad80b195c8c0f48241740881cf9b9bce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/191e9d5e1e7c4d33b673520a30b1f28d/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "WASHINGTON (AP) — July has been so hot thus far that scientists calculate that this month will be the hottest globally on record and likely the warmest human civilization has seen, even though there are several days left to sweat through.",
      "publishedAt": "2023-07-27T13:38:57Z",
      "title": "July has been so blistering hot, scientists already calculate that it's the warmest month on record",
      "url": "https://apnews.com/65e13c9c3d88932b50de935c7977ee70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/180309f5954d4218a7416988f0d40355/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, BRENDAN FARRINGTON and KAT STAFFORD",
      "description": "TALLAHASSEE, Fla. (AP) — Civil rights activists cheered when Ron DeSantis pardoned four Black men wrongfully convicted of rape as one of his first actions as Florida's governor.",
      "publishedAt": "2023-07-27T14:14:41Z",
      "title": "DeSantis is defending new slavery teachings. Civil rights leaders see a pattern of 'policy violence'",
      "url": "https://apnews.com/1fb51d663e6051051aa23b71421b9479",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd789fb720064504ba21d2aa2fda9c01/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ and JONATHAN MATTISE",
      "description": "MEMPHIS, Tenn. (AP) — The U.S. Department of Justice said Thursday it is investigating how Memphis Police Department officers use force and conduct arrests, nearly seven months after the violent beating of Tyre Nichols by five officers after a traffic stop strengthened nationwide calls for police reform.",
      "publishedAt": "2023-07-27T16:27:19Z",
      "title": "Justice Department investigating Memphis policing methods, months after Tyre Nichols' death",
      "url": "https://apnews.com/0d1b1133863abcc0d078a311dc5e8d76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6abd43fbf9da4a3285a06fa3039b9d42/2300.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — Bronny James has been discharged from Cedars-Sinai Medical Center and is resting at home, three days after the 18-year-old son of LeBron James went into cardiac arrest.Dr. Merije Chukumerije, a consulting cardiologist for Bronny James, said in a statement issued by the hospital Thursday that James was “successfully treated for a sudden cardiac arrest.\" Chukumerije gave credit to “the swift and effective response by the USC athletics’ medical staff” after the incident Monday at the University of Southern California's Galen Center, where the incoming freshman guard was participating in basketball practice.",
      "publishedAt": "2023-07-27T16:20:18Z",
      "title": "Bronny James discharged from hospital as LeBron sends thanks and says family is 'safe and healthy'",
      "url": "https://apnews.com/e0ae07320014b74ae0573439605bdc33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73dde11bfeba40e680062c6f1551660c/3000.jpeg"
    },
    {
      "author": "KEN RITTER",
      "description": "LAS VEGAS (AP) — Casino mogul Steve Wynn has ended a yearslong legal fight with Nevada gambling regulators that started with claims of workplace sexual misconduct, agreeing to pay a $10 million fine and cut ties to the industry he helped shape in Las Vegas.",
      "publishedAt": "2023-07-27T04:08:23Z",
      "title": "Casino mogul Steve Wynn fined $10M to end fight over claims of workplace sexual misconduct in Nevada",
      "url": "https://apnews.com/e9bc383ad296902df1290a33e6284f2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d09157bb63b442db73b36d40938b8b6/2370.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and DASHA LITVINOVA",
      "description": "KYIV, Ukraine (AP) — Fierce fighting raged Thursday in southeastern Ukraine, where a Western official said Kyiv has launched a major push and Russian President Vladimir Putin said “hostilities have intensified significantly.”",
      "publishedAt": "2023-07-27T08:50:54Z",
      "title": "Fighting intensifies in southeastern Ukraine with Kyiv claiming gains in its counteroffensive",
      "url": "https://apnews.com/12334bbee83b608221dafced4727369e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31c32b6e65f349ae948234990b191eb2/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Randy Meisner, a founding member of the Eagles who added high harmonies to such favorites as “Take It Easy” and “The Best of My Love” and stepped out front for the waltz-time ballad “Take It to the Limit,” has died, the band said Thursday.",
      "publishedAt": "2023-07-27T23:41:28Z",
      "title": "Randy Meisner, founding member of the Eagles and singer of 'Take It to the Limit,' dies at 77",
      "url": "https://apnews.com/b4f9bdabdc17f8e789262fb8023c5f7d",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}