{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump are poised to move much closer to winning their parties' nominations Tuesday during the biggest day of the primary campaign, setting up a historic rematch that many voters would rather not endure.",
      "publishedAt": "2024-03-05T05:06:26Z",
      "title": "Coast-to-coast Super Tuesday contests poised to move Biden and Trump closer to November rematch",
      "url": "https://apnews.com/e36971a222a2b50d35cb0a2c603ce4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b0f2fa81734d45be637f1e852a9165/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY, TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "CAIRO (AP) — Three days of negotiations with Hamas over a cease-fire in Gaza and the release of Israeli hostages ended Tuesday without a breakthrough, Egyptian officials said, less than a week before the start of the Muslim holy month of Ramadan, the informal deadline for a deal.",
      "publishedAt": "2024-03-05T13:23:42Z",
      "title": "Gaza cease-fire talks have ended without a breakthrough with Ramadan days away, Egypt says",
      "url": "https://apnews.com/a13c5fa6e23fedbda42e3028a96ca14e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9207bd440a44917b148191a5a948720/1920.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "BEIJING (AP) — China's Premier Li Qiang promoted an image of confidence as he announced modest economic growth goals for the world's second largest economy, at one of the country's most important political gatherings.",
      "publishedAt": "2024-03-05T06:53:55Z",
      "title": "What you should know from the opening of China's legislature",
      "url": "https://apnews.com/76ee304ab3fcafb45c0af9a2968e8d5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40f0e337086d47a4b637c758fabdcb02/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Heavily armed gangs tried to seize control of Haiti’s main international airport on Monday, exchanging gunfire with police and soldiers in the latest attack on key government sites in an explosion of violence that includes a mass escape from the country’s two biggest prisons.",
      "publishedAt": "2024-03-04T05:06:37Z",
      "title": "Gangs in Haiti try to seize control of main airport in newest attack on key government sites",
      "url": "https://apnews.com/105ca137aa337b9e6681cf87add9a5c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4454225a32e74d11bdda57b467680fc6/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Senate leader Mitch McConnell is the highest-ranking Republican in Congress who has yet to endorse Donald Trump's bid to return to the White House — having once called the defeated president “morally responsible\" for the Jan.",
      "publishedAt": "2024-03-05T05:20:03Z",
      "title": "McConnell weighs endorsing Trump. It's a stark turnaround after the Jan. 6, 2021, attack",
      "url": "https://apnews.com/6f9202ff2709518db276c5a0c68943c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3396284455d04e95a5c4d7cc10d84856/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine claimed Tuesday it has sunk another Russian warship in the Black Sea using high-tech sea drones as Kyiv’s forces continue to take aim at targets deep behind the war’s front line.",
      "publishedAt": "2024-03-05T08:55:42Z",
      "title": "Ukraine claims it has sunk another Russian warship in the Black Sea using high-tech sea drones",
      "url": "https://apnews.com/a316215f5d9fc88a488ef2d99eb828c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3aed7d6cf1949a7bf5ff707a4998376/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "Thirty-seven-year-old Corinn O’Brien is about two months pregnant through in vitro fertilization, but an ultrasound recently showed the fetus might be in trouble, and she wants the option to try again if she needs to.",
      "publishedAt": "2024-03-05T15:17:29Z",
      "title": "As threat to IVF looms in Alabama, patients over 35 or with serious diseases worry for their futures",
      "url": "https://apnews.com/8a6e653c79511fc39bbb7c2267941e7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f67b531980746ddb97133e7754cfd8c/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO and LINDSAY WHITEHURST",
      "description": "AUSTIN, Texas (AP) — Texas’ plans to arrest migrants who enter the U.S. illegally and order them to leave the country is headed to the Supreme Court in a legal showdown over the federal government’s authority over immigration.",
      "publishedAt": "2024-03-04T21:51:18Z",
      "title": "Supreme Court temporarily blocks Texas law that allows police to arrest migrants",
      "url": "https://apnews.com/fd9e25f3a49a67eb735a12fa7938fdfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30710ba13544459797f4a8d4b41fe93c/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Bitcoin has hit an all-time high less than two years after the collapse of the crypto exchange FTX severely damaged faith in digital currencies and sent prices plunging.",
      "publishedAt": "2024-03-05T15:36:00Z",
      "title": "Bitcoin bounces to an all-time high less than two years after FTX scandal clobbered crypto",
      "url": "https://apnews.com/c5d6d4b09e93bbc22222fab3231bdf59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb0d4ceb0f994c6d9fe5bf364434330f/3000.jpeg"
    },
    {
      "author": "KEN SWEET and JOSH BOAK",
      "description": "WASHINGTON (AP) — The Biden administration announced a rule Tuesday to cap all credit card late fees, the latest effort in the White House push to end what it has called junk fees and a move that regulators say will save Americans up to $10 billion a year.",
      "publishedAt": "2024-03-05T10:06:10Z",
      "title": "Regulator would cap credit card late fees at $8, part of Biden's campaign against junk fees",
      "url": "https://apnews.com/16e3dc606a5e62cf3da01868ec627bc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3547e6f172a493c83d419b0197a34d1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}