{
  "articles": [
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan's strongest earthquake in a quarter century rocked the island during the morning rush hour Wednesday, damaging buildings and highways and leaving nine people dead.In the capital, Taipei, tiles fell from older buildings as the earthquake shook the city, and schools evacuated their students to sports fields, equipping them with yellow safety helmets.",
      "publishedAt": "2024-04-03T00:24:07Z",
      "title": "Taiwan's strongest earthquake in nearly 25 years damages buildings, leaving 9 dead",
      "url": "https://apnews.com/f086aac0c3082036d1ca77c01828fb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8f3f3a9184548898c4ff1f8328380d7/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Some of Israel's closest allies, including the United States, on Tuesday condemned the deaths of seven aid workers who were killed by airstrikes in Gaza — a loss that prompted multiple charities to suspend food deliveries to Palestinians on the brink of starvation.",
      "publishedAt": "2024-04-02T05:29:52Z",
      "title": "With famine looming, aid group halts food delivery in Gaza after Israeli strike kills 7 workers",
      "url": "https://apnews.com/9bdf66771b62af37d85a2800f71c0e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3eecc7e630f4303b8057b24464aa184/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli airstrikes that killed seven aid workers in Gaza reverberated around the world Tuesday, as friends and relatives mourned the losses of those who were delivering food to besieged Palestinians with the charity World Central Kitchen.",
      "publishedAt": "2024-04-02T18:40:33Z",
      "title": "Family and friends recall dedication of World Central Kitchen aid workers killed in Gaza",
      "url": "https://apnews.com/f79eccaf93e34e36d39ae16c848dde92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27f84080751545e28f22a51e6671ab73/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and CLAUDIA LAUER",
      "description": "In the moments before the cargo ship Dali rammed into the Francis Scott Key Bridge and sent it crumbling into the water, a flurry of urgent warnings crackled over radios and enabled police to block traffic from getting on the span, likely saving lives.",
      "publishedAt": "2024-04-03T04:11:02Z",
      "title": "Workers had little warning as Maryland bridge collapsed, raising concerns over safety, communication",
      "url": "https://apnews.com/f907ab712588d9ef0fdb58d85022bd95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d987555257b40a0b9808fa6f9242cce/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "The aftermath of last year's fiery train derailment in eastern Ohio doesn't qualify as a public health emergency because widespread health problems and ongoing chemical exposures haven't been documented, federal officials said.",
      "publishedAt": "2024-04-03T05:08:39Z",
      "title": "AP Exclusive: EPA didn't declare a public health emergency after fiery Ohio derailment",
      "url": "https://apnews.com/be238b72219ecc4b6e5c7b88eefbf6f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/945324c7927940aeb3a7c8472ffb8d08/3000.jpeg"
    },
    {
      "author": "GARY FIELDS and AMELIA THOMSON DEVEAUX",
      "description": "WASHINGTON (AP) — Despite the country's deep political polarization, most Americans share many core beliefs about what it means to be an American, according to a new poll.The poll from The Associated Press-NORC Center for Public Affairs Research found that about 9 in 10 U.S.",
      "publishedAt": "2024-04-03T04:03:20Z",
      "title": "Yes, we're divided. But new AP-NORC poll shows Americans still agree on most core American values",
      "url": "https://apnews.com/b1047da72551e13554a3959487e5181a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0123ba172e4448f0ae9694e929ade7e2/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine on Wednesday lowered the military conscription age from 27 to 25 in an effort to replenish its depleted ranks after more than two years of war following Russia’s full-scale invasion.",
      "publishedAt": "2024-04-03T07:52:41Z",
      "title": "Ukraine lowers its conscription age to 25 to plug a shortfall in troop numbers fighting Russia",
      "url": "https://apnews.com/251058a942a253f3eaec2c53373adf03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb09bb625417474699bfa8816bdf7bb2/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "The largest producer of fresh eggs in the U.S. said Tuesday it had temporarily halted production at a Texas plant after bird flu was found in chickens, and officials said the virus had also been detected at a poultry facility in Michigan.",
      "publishedAt": "2024-04-02T20:47:51Z",
      "title": "The largest fresh egg producer in the US has found bird flu in chickens at a Texas plant",
      "url": "https://apnews.com/dbae49f8786dda586036c1b86b9d0997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/790f5e5b746946f29f8bfaeafd3fb5f2/3000.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "PORTLAND, Ore. (AP) — A huge disparity between the men's and women's weight rooms drew attention to the women's NCAA Tournament for all the wrong reasons in 2022, starting a conversation about equity that has carried over into today.",
      "publishedAt": "2024-04-03T10:00:58Z",
      "title": "The women's NCAA Tournament is having a big moment that has also been marred by missteps",
      "url": "https://apnews.com/fd6dea02ffbe10de2202739ff1c8155b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddf68a74d8e041a48edf2135dd1faf46/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — A crowd of people, some weeping, gathered at a rain-soaked amusement park in South Korea to bid farewell to a beloved giant panda before her departure to China on Wednesday.",
      "publishedAt": "2024-04-03T03:26:50Z",
      "title": "South Koreans bid emotional farewell to beloved panda leaving for China",
      "url": "https://apnews.com/83688054b1bf1319ea6d7692367e5409",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31217aa5bfc84f4b8ec099415ff8de55/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}