{
  "articles": [
    {
      "author": "TERRY SPENCER",
      "description": "The last time the eye of a major storm like Hurricane Milton struck Tampa Bay, in 1921, the city was a sleepy backwater of a few hundred thousand people. A century later, it's among the fastest-growing metropolises in the United States, with more than 3 million people, and highly vulnerable to flooding due to climate change.",
      "publishedAt": "2024-10-07T19:54:06Z",
      "title": "As Milton takes aim at Florida, why is Tampa Bay so vulnerable to hurricanes?",
      "url": "https://apnews.com/ace324900762a0e3c385830f3cf1479b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df60d25621874df7b85f5152d78a4490/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER and HAVEN DALEY",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton weakened slightly Tuesday but remained a ferocious storm that could land a once-in-a-century direct hit on the populous Tampa Bay region with towering storm surges and the power to turn debris from Helene's devastation into dangerous projectiles.",
      "publishedAt": "2024-10-08T04:08:46Z",
      "title": "Tampa Bay hasn’t been hit directly by a major hurricane since 1921. Milton may be the one",
      "url": "https://apnews.com/7678939c52fdf00da748937d22df1fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1af9325cff8e47aa98596a1ad9ac886a/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Explosively intensifying Hurricane Milton is the latest freaky system to come out of what veteran hurricane scientists call the weirdest storm season of their lives.",
      "publishedAt": "2024-10-08T13:32:44Z",
      "title": "An unusual hurricane season goes from ultra quiet to record busy and spawns Helene and Milton",
      "url": "https://apnews.com/db98e8cfbcc29a191c216a8bc9157f1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e24fb08fa63848b68f3fade6169d1d6c/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Hezbollah fired a barrage of rockets into Israel on Tuesday, and the militant group’s acting leader vowed to keep up pressure that has forced tens of thousands of Israelis from their homes near the Lebanese border.",
      "publishedAt": "2024-10-08T09:15:08Z",
      "title": "Hezbollah steps up rocket fire into Israel, which sends more troops into Lebanon",
      "url": "https://apnews.com/0bc0a8970c066c048ee1875bcdc8df79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/711c0fba80f34a64920cf0d98822b1fb/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israeli military strikes are targeting Iran's armed allies across a nearly 2,000-mile stretch of the Middle East and threatening Iran itself.",
      "publishedAt": "2024-10-08T04:05:55Z",
      "title": "Israel's strikes are shifting the power balance in the Middle East, with US support",
      "url": "https://apnews.com/36d7c0bbc35964ed6ac9d21de17c632a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/924d2e2dcff442038e3232fe15cee0a0/3000.jpeg"
    },
    {
      "author": "MATT BROWN and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Black registered voters have an overwhelmingly positive view of Vice President Kamala Harris, but they’re less sure that she would change the country for the better, according to a recent poll from the   AP-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-08T04:01:48Z",
      "title": "What polling shows about Black voters' views of Harris and Trump",
      "url": "https://apnews.com/78e344ddea4886dd23582f4a51eb0da6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cb9ddfdcc2f4b2ba59e2bb8c1bad677/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY and MICHAEL PHILLIS",
      "description": "WASHINGTON (AP) — A decade after the Flint, Michigan, water crisis raised alarms about the continuing dangers of lead in tap water, President Joe Biden is setting a 10-year deadline for cities across the nation to replace their lead pipes, finalizing an aggressive approach aimed at ensuring that drinking water is safe for all Americans.",
      "publishedAt": "2024-10-08T09:23:32Z",
      "title": "Biden sets a 10-year deadline for US cities to replace lead pipes and make drinking water safer",
      "url": "https://apnews.com/4aae63134894762cbe904ee460e62708",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d739346cabad46eda8a3f64dc7774098/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A former New York City official was charged Tuesday with witness tampering and destroying evidence in a federal investigation that led to Mayor Eric Adams’ bribery indictment.",
      "publishedAt": "2024-10-08T14:38:38Z",
      "title": "A former aide to New York Mayor Eric Adams is charged with destroying evidence as top deputy quits",
      "url": "https://apnews.com/eb8b63381e218419529b52eb8a1e0f04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5498ea5d4cdb43e3aca2192b8d87ad3e/2432.jpeg"
    },
    {
      "author": "DANIEL NIEMANN, SETH BORENSTEIN and MATT O'BRIEN",
      "description": "STOCKHOLM (AP) — Two pioneers of artificial intelligence — John Hopfield and Geoffrey Hinton — won the Nobel Prize in physics Tuesday for helping create the building blocks of machine learning that is revolutionizing the way we work and live but also creates new threats for humanity.",
      "publishedAt": "2024-10-08T07:50:55Z",
      "title": "Pioneers in artificial intelligence win the Nobel Prize in physics",
      "url": "https://apnews.com/fc0567de3f2ca45f81a7359a017cd542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16c0c942687149428a227a36570a1b0d/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "More than a dozen states and the District of Columbia have filed lawsuits against TikTok on Tuesday, alleging the popular short-form video app is harming youth mental health by designing its platform to be addictive to kids.",
      "publishedAt": "2024-10-08T14:09:08Z",
      "title": "States sue TikTok, claiming its platform is addictive and harms the mental health of children",
      "url": "https://apnews.com/2993f8e70d2e3d4eab9988df168fb948",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f542cddd8f704ea7a6cd1cbf36f4a166/2737.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}