{
  "articles": [
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump says the U.S. will delay implementation of a 50% tariff on goods from the European Union from June 1 until July 9 to buy time for negotiations with the bloc. That agreement came after a call Sunday with Ursula von der Leyen, the president of the European Commission. Trump says she told him she “wants to get down to serious negotiations.\" Trump told reporters later Sunday that he had told “anybody that would listen, they have to do that.” He said Von der Leyen vowed to “rapidly get together and see if we can work something out.”",
      "publishedAt": "2025-05-25T22:51:43Z",
      "title": "Trump says he'll delay a threatened 50% tariff on the European Union until July",
      "url": "https://apnews.com/article/donald-trump-trade-tariffs-european-union-f335ba9aa9d0b36cfe483f6f045c9b01",
      "urlToImage": "https://dims.apnews.com/dims4/default/f21eca5/2147483647/strip/true/crop/5846x3288+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fb2%2Fddfb28eca3654f16ee21bb8f1bac%2F7b71602fe8df4098b5262bef11b8bf00"
    },
    {
      "author": "Steve Karnowski",
      "description": "Minneapolis has changed, slowly, since a city police officer murdered George Floyd on Memorial Day in 2020. The city is still struggling to decide what should become of the intersection where Floyd met his demise, which has become a place of pilgrimage known as George Floyd Square. City leaders have not agreed on whether to close the intersection to all traffic as a permanent memorial. Minneapolis has also begun a remake of its police department under court supervision — an effort that the mayor and police chief say will continue with or without the backing of the Trump administration.",
      "publishedAt": "2025-05-26T05:28:17Z",
      "title": "5 years since George Floyd's death, how has Minneapolis evolved?",
      "url": "https://apnews.com/article/george-floyd-murder-anniversary-minneapolis-11871dabb9736de7216d61f1c2e95e51",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0bf816/2147483647/strip/true/crop/8093x4552+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fd2%2Fb245b684692751c28efcde1bbe1c%2F85f28f2caad043f495a583c80ca9ca23"
    },
    {
      "author": null,
      "description": "Ukrainian officials say that a massive Russian drone-and-missile attack targeted the country for a second consecutive night, killing at least twelve people and injuring dozens. The attack early on Sunday came on the third day of a planned prisoner swap between Russia and Ukraine, the only tangible outcome from peace talks in Istanbul earlier this month which have so far failed to produce a ceasefire. Ukraine’s President Volodymyr Zelenskyy and Russia’s defense ministry said each side brought home 307 more soldiers on Saturday, a day after each released a total of 390 combatants and civilians. Further releases were expected on Sunday.",
      "publishedAt": "2025-05-25T05:24:51Z",
      "title": "A massive Russian drone-and-missile attack on Ukraine kills at least 12",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-dbefc3d0a83826c865908aa29dd40f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ef8ea2/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fd9%2Fd3ab0a5e78158586ab83c2e6968d%2Faff05b9e9af543d78d9f71004eb1165b"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "An Israeli strike on a school-turned-shelter in the Gaza Strip has killed at least 25 people, mostly women and children, according to the territory’s Health Ministry. The strike on the school in northern Gaza also wounded more than 55 people, said Fahmy Awad, head of the ministry’s emergency service. He said the school was hit three times while people slept, setting their belongings ablaze. Footage circulating online showed rescuers struggling to extinguish fires and recovering charred remains. There was no immediate comment from the Israeli military.",
      "publishedAt": "2025-05-26T05:12:35Z",
      "title": "Israeli strike on school-turned-shelter in Gaza kills 25, medics say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-26-2025-6a7285f144a3619e8239138e6883b3b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": "The Associated Press",
      "description": "In what had long been celebrated every May 30 to honor America’s fallen soldiers, Memorial Day officially became a federal holiday in 1971, observed on the last Monday in May. Businesses increasingly have chosen to stay open on the holiday, leading to what is now one of the biggest retail sales and travel weekends of the year. Government offices, post offices and schools are closed, as is the stock market, banks and a handful of businesses. The vast majority of retailers will be open, with many trying to lure customers with big promotional sales.",
      "publishedAt": "2025-05-25T13:51:06Z",
      "title": "What's open and closed on Memorial Day?",
      "url": "https://apnews.com/article/memorial-day-2025-stores-open-closed-217c9b4b29bcfd58f0f825ba549a4d1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c177ba/2147483647/strip/true/crop/2038x1146+0+106/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F13%2F4ea0709690e713d23a452a907b80%2F892dd88881ba448daaa5aa2c5c9d7fd5"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has declared himself a Roman as he completes the final ceremonial steps cementing his role as the bishop of Rome. Leo formally took possession of the St. John Lateran Basilica, which is Rome’s cathedral and seat of the diocese. He then took the popemobile for a visit to St. Mary Major. There he prayed before Pope Francis’ tomb and an icon of the Virgin Mary beloved to many Roman faithful.",
      "publishedAt": "2025-05-25T15:26:18Z",
      "title": "Pope Leo XIV declares 'I am Roman!' as he completes formalities to become bishop of Rome",
      "url": "https://apnews.com/article/rome-pope-bishop-ceremony-basilicas-ae01507115934e82a15e5f6758d08637",
      "urlToImage": "https://dims.apnews.com/dims4/default/58db232/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F9f%2F925bd61e19a4dfdd1fba3966463a%2F03700c3af116422d9fb127959ad583bf"
    },
    {
      "author": "Barbara Ortutay, Claire Rush",
      "description": "One initiative distributes laptops in rural Iowa. Another helped people get back online in North Carolina after Hurricane Helene washed away computers and phones. And there are efforts in Oregon and rural Alabama teach digital skills to older people, including some who’ve never touched a computer. Those and others are in jeopardy after President Donald Trump said he's cutting a program aimed at filling gaps in the digital divide. The Digital Equity Act was intended to cover unmet needs that surfaced during the country's broadband rollout. Trump has branded the program as racist and illegal, and claims it amounts to “woke handouts based on race.”",
      "publishedAt": "2025-05-25T11:36:03Z",
      "title": "Trump looks to end digital equity program he says is racist",
      "url": "https://apnews.com/article/digital-equity-act-trump-broadband-rural-diversity-90d1c8a618d289ecb16e1667194e37d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9e03db/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fb1%2F4d8687340c46ebd5cf6e9d695907%2F3a97ed6c0d2649d9a12c3e5b5fe954e3"
    },
    {
      "author": "Christina Larson, Adithi Ramakrishnan, Jamey Keaten",
      "description": "As the Trump administration cut billions of dollars in federal funding to scientific research, thousands of scientists in the U.S. lost their jobs or grants. And governments and universities around the world spotted an opportunity and launched programs to lure researchers from the U.S. Since World War II, the U.S. has invested huge amounts of money in scientific research conducted at independent universities and federal agencies. That funding helped the U.S. to become the world’s leading scientific power. But today that system is being shaken by deep cuts. The Trump administration says it is reviewing the previous administration’s projects, identifying waste and realigning research spending to match the “American people’s priorities.”",
      "publishedAt": "2025-05-25T04:43:55Z",
      "title": "Foreign universities hope to lure scientists from the US after Trump research cuts",
      "url": "https://apnews.com/article/trump-research-funding-cuts-brain-drain-f1ac9fe5c8a90f5d5ec9b2726475e10e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b15cc2/2147483647/strip/true/crop/5347x3008+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2Fd0%2F917000883c32c200acea29e4da9d%2F8fe8d54f49264dce8fb25db4b1874524"
    },
    {
      "author": "Jenna Fryer",
      "description": "The start of the Indianapolis 500 has been delayed because of rain sprinkles around the track — a weather disruption that could ruin Kyle Larson’s attempt to run “the double” for a second consecutive year. The NASCAR star is trying to complete 1,100 miles of racing in one day — a feat only accomplished once, by Tony Stewart. His bid at completing “the double” failed last year because a rain delay in Indianapolis made him miss the Coca-Cola 600 in North Carolina. Larson and Hendrick Motorsports have promised NASCAR that Larson will be at Charlotte Motor Speedway for the start of Sunday's Cup Series race.",
      "publishedAt": "2025-05-25T13:24:37Z",
      "title": "Rain delays Indy 500, jeopardizing Kyle Larson's double attempt",
      "url": "https://apnews.com/article/indy-500-bc71ef31fd4ce00e4c36f50ca2feba9a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ec407d/2147483647/strip/true/crop/8363x4704+0+436/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F25%2F4e9ee6ff1a9e2ec5ff9ff1d95af0%2Fbc42abde9a0c4297925fb2a23121d0dc"
    },
    {
      "author": "Andrew Dalton",
      "description": "“Lilo & Stich” team with Tom Cruise for what may be a record-breaking Memorial Day box office weekend. According to studio estimates Sunday, Disney's “Lilo & Stich” earned a staggering $145.5 million in North American theaters, the second biggest opening of the year after “A Minecraft Movie.” Paramount Pictures’ “Mission: Impossible – The Final Reckoning,” the eighth and probably last appearance of Tom Cruise as Ethan Hunt in a nearly three decade run, was a very distant second domestically, but still brought in a franchise record $63 million through Sunday, out-earning “Mission Impossible: Fallout,” which opened domestically to $61 million in 2018.",
      "publishedAt": "2025-05-25T16:44:41Z",
      "title": "'Lilo & Stich' team with Tom Cruise and 'Mission Impossible' for a monster Memorial Day weekend",
      "url": "https://apnews.com/article/lilo-stich-mission-impossible-039dac917c7077a7dd23d7ca6349711b",
      "urlToImage": "https://dims.apnews.com/dims4/default/540a05f/2147483647/strip/true/crop/3351x1885+574+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Fbb%2Fd55890735495224d5fae815dc308%2F5ec04cc7572d4dc08e54ffc5a934865d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}