{
  "articles": [
    {
      "author": "MARCIA DUNN",
      "description": "MESQUITE, Texas (AP) — Millions of spectators along a narrow corridor stretching from Mexico to the U.S. to Canada eagerly awaited Monday's celestial sensation — a total eclipse of the sun — even as forecasters called for clouds.",
      "publishedAt": "2024-04-08T05:00:20Z",
      "title": "Huge crowds await a total solar eclipse in North America. Clouds may spoil the view",
      "url": "https://apnews.com/a667cf827dd4d78d1f41fdd5483e3508",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c56e87cda014934a402ac4df36e2910/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A total solar eclipse crossing North America on Monday will darken skies along a path through Mexico, the United States and Canada. Totality will last up to 4 minutes, 28 seconds in certain spots.The first location in continental North America to experience totality: Mexico's Pacific coast, at around 2 p.m.",
      "publishedAt": "2024-04-08T13:45:08Z",
      "title": "The Latest | Cheers in Mexico as moon begins passing over sun",
      "url": "https://apnews.com/4e77a7294447355b7f6bd8aa165efee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f430d1de0e742459d5c2bee086af9cc/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Streams of Palestinians filed into the southern Gaza city of Khan Younis on Monday to salvage what they could from the vast destruction left in the wake of Israel’s offensive, a day after the Israeli military announced it was withdrawing troops from the area.",
      "publishedAt": "2024-04-08T09:32:27Z",
      "title": "Palestinians returning to Khan Younis after Israeli withdrawal find an unrecognizable city",
      "url": "https://apnews.com/c8776b6a074cd182d0641214f5f352d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e047fe248ee4ea4bc0fb073ec5cfc3e/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican on Monday declared gender-affirming surgery and surrogacy as grave violations of human dignity, putting them on par with abortion and euthanasia as practices that reject God’s plan for human life.",
      "publishedAt": "2024-04-08T10:02:21Z",
      "title": "Vatican blasts gender-affirming surgery, surrogacy and gender theory as violations of human dignity",
      "url": "https://apnews.com/3f84d8eb97f045b0cfb0ec1efa4e614e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42356152b6a24e3f901afdca1e4f28bb/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — President Joe Biden is traveling to Wisconsin on Monday to announce details of a new plan to ease student loan debt for more than 30 million borrowers, the latest attempt by the Democratic president to make good on a campaign promise that could buoy his standing with young voters.",
      "publishedAt": "2024-04-08T04:08:04Z",
      "title": "Biden will talk about student debt relief in Wisconsin after primary voting delivered warning signs",
      "url": "https://apnews.com/069d64e7e6fc4edd967adf6bc5f7e699",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbeb29ae9df0487fabe7647311bdc8cd/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and MEG KINNARD",
      "description": "NEW YORK (AP) — Former President Donald Trump said he believes abortion limits should be left to the states, in a video released Monday declining to endorse a national ban after months of mixed messages and speculation.",
      "publishedAt": "2024-04-08T04:42:49Z",
      "title": "Trump declines to endorse a national abortion ban. He says limits should be left to the states",
      "url": "https://apnews.com/7bf06e0856b88a710c79a6eb85cffa6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3327e708069748efb7e8095f2c9bf718/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ALBERT AJI",
      "description": "DAMASCUS, Syria (AP) — Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.",
      "publishedAt": "2024-04-08T17:04:57Z",
      "title": "Iran's foreign minister accuses U.S. of giving Israel 'green light' to attack consulate in Syria",
      "url": "https://apnews.com/68c7a652c5434d80fbff47e0ddbdd483",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07a17cbe6a6a4bc59546d6c7f87959a3/1280.jpeg"
    },
    {
      "author": null,
      "description": "PANAMA CITY (AP) — The trial of 27 people charged in connection with the worldwide “Panama Papers” money laundering started Monday in a Panamanian criminal court.",
      "publishedAt": "2024-04-08T16:30:24Z",
      "title": "'Panama Papers' trial starts. 27 people charged in the worldwide money laundering case",
      "url": "https://apnews.com/ff16769071b2535ad3678c8099ad0e9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc350df59f784d589066e41cf0944c88/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Actor Jonathan Majors has been ordered to complete a yearlong counseling program but avoided jail time Monday for assaulting his ex-girlfriend in a high-profile case that derailed the once-promising star’s career.",
      "publishedAt": "2024-04-08T11:23:19Z",
      "title": "Actor Jonathan Majors avoids jail time, sentenced to counseling for assaulting ex-girlfriend",
      "url": "https://apnews.com/24212fa7708d397452d44f9cbc9fb127",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7fdc1c478a947c0b934cfd296757697/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and ANITA SNOW",
      "description": "PHOENIX (AP) — As ranchera music filled the Phoenix recording studio at Radio Campesina, a station personality spoke in Spanish into the microphone.“Friends of Campesina, in these elections, truth and unity are more important than ever,” said morning show host Tony Arias.",
      "publishedAt": "2024-04-08T04:12:20Z",
      "title": "Latino voters are coveted by both major parties. They also are a target for election misinformation",
      "url": "https://apnews.com/563ff36ba39d38d55eeb5d29d93d400e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adedc220bda84fca9881a6bb667f89fb/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}