{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is touting tens of billions of dollars of energy and tech investments at a new summit focusing on energy and innovation. At the event Tuesday in Pittsburgh helmed by Republican Sen. David McCormick, Trump boasted of a “true golden age for America” in energy policy and artificial intelligence. Pennsylvania is a swing state critical to Trump's wins in 2016 and 2024, and is at the forefront of his energy agenda. In a panel discussion, Commerce Secretary Howard Lutnick said the Trump administration won't let the U.S. lose the artificial intelligence race. Participating companies at the conference included Blackstone, Bridgewater, SoftBank, Amazon Web Services and ExxonMobil.",
      "publishedAt": "2025-07-15T04:02:37Z",
      "title": "Trump promotes energy investments in Pennsylvania",
      "url": "https://apnews.com/article/trump-pennsylvania-energy-innovation-summit-b11f7f4053bac2603664ffbd1dc4c6da",
      "urlToImage": "https://dims.apnews.com/dims4/default/29e288d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F48%2F56778b201ee531ca6f0ff33a8460%2F8f98b68d6b8042aab310cb519f0866da"
    },
    {
      "author": null,
      "description": "Gaza health officials say Israeli strikes overnight and into Tuesday killed more than 90 Palestinians across the Gaza Strip, including several families. One strike in the northern Shati refugee camp killed a 68-year-old Hamas member of the Palestinian legislature, as well as a man and a woman and their six children in the same building, according to officials from Shifa Hospital, where the casualties were taken. There was no immediate comment from the Israeli military on the strikes.",
      "publishedAt": "2025-07-15T15:27:08Z",
      "title": "Israeli strikes in Gaza kill 93 Palestinians, including several families, health officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-07-15-2025-43e559363cba4eb99cd7238c00d1de12",
      "urlToImage": "https://dims.apnews.com/dims4/default/a214d01/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fcb%2Fae31c6aad39b4ed091252e46505f%2Fe6f045c3650948fe8a528fd434033262"
    },
    {
      "author": null,
      "description": "President Donald Trump is downplaying the possibility of sending Ukraine long-range weapons as Kyiv awaits an injection of U.S. weaponry that it hopes will help it beat back an intensifying Russian air offensive. Trump on Tuesday offered a more cautious tone on what to expect after he threatened Russia a day earlier with steep tariffs if President Vladimir Putin doesn’t soon end the three-year conflict. Trump also told the BBC in an interview published Tuesday that he trusts “almost nobody” when asked whether he trusts Putin. It was further evidence of a break with Putin, whom he has long spoken admiringly of.",
      "publishedAt": "2025-07-15T21:10:23Z",
      "title": "Trump downplays possibility of sending Ukraine long-range weapons",
      "url": "https://apnews.com/article/trump-russia-ukraine-longrange-weapons-ccde532a4bd6c2c1d6bb73b28d90b0f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/227f35b/2147483647/strip/true/crop/4808x2705+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fde%2Fd0f335db0ee25cfd215079013da7%2F4a84487a10f44d108d512f4ee1270c01"
    },
    {
      "author": null,
      "description": "President Donald Trump says he plans to place tariffs of over 10% on smaller countries, including nations in Africa and the Caribbean. “We’ll probably set one tariff for all of them,” Trump said Tuesday, adding that it could be “a little over 10% tariff” on goods from at least 100 nations. Commerce Secretary Howard Lutnick interjected that the nations with goods being taxed at these rates would be in Africa and the Caribbean, places that generally do relatively modest levels of trade with the U.S. and would be relatively insignificant for addressing Trump’s goals of reducing trade imbalances with the rest of the world.",
      "publishedAt": "2025-07-15T23:28:16Z",
      "title": "Trump to put tariffs of over 10% on smaller nations",
      "url": "https://apnews.com/article/trump-tariffs-africa-caribbean-c0307a66f3fbab26c0ece454d78e48cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/415a85b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F3f%2Fbb498fb0cebce83634ba08874adf%2Ffae0c9ad787e4e2e994e8c7556028986"
    },
    {
      "author": null,
      "description": "A federal grand jury has indicted the man accused of fatally shooting a prominent Minnesota state representative and her husband and seriously wounding a state senator and his wife. The indictment handed up Tuesday lists murder, stalking and firearms charges against Vance Boelter. The murder counts in the deaths of former House Speaker Melissa Hortman and her husband could carry the federal death penalty. Boelter is accused of going to the lawmakers’ homes June 14 disguised as a police officer in a fake squad car with lists of other Democratic officials as potential targets.",
      "publishedAt": "2025-07-15T19:44:09Z",
      "title": "Federal grand jury indicts man accused of killing Minnesota legislator",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-federal-indictment-fbce6398689c6bed37782fb4d918aad5",
      "urlToImage": "https://dims.apnews.com/dims4/default/87941fb/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2Fa2%2F790de53d08bafb32e3da191b06c7%2F2a3cdf60d8424fc4b277a1c60bc2fcf8"
    },
    {
      "author": null,
      "description": "Major League Baseball faces a potential lockout in December 2026. Players and management have long clashed over salary cap proposals, a format that union head Tony Clark criticizes as harmful to competition and player salary guarantees. Commissioner Rob Manfred argues the cap could address payroll disparities as MLB also tries to deal with declining revenue from regional sports networks. Teams like the Dodgers and Mets have pushed payrolls to record levels, highlighting disparity. Baseball’s collective bargaining agreement expires in December 2026, and past negotiations have led to nine work stoppages.",
      "publishedAt": "2025-07-15T17:00:34Z",
      "title": "Baseball faces looming lockout and salary cap battle after 2026 season",
      "url": "https://apnews.com/article/mlb-lockout-salary-cap-b2abf5a48833dac97d65dc92ce32d0bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e6b46d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2Fa1%2F625f08ccb4144a04376d7be83e03%2F74a0f0babdf14670b35f4a3db64b2057"
    },
    {
      "author": null,
      "description": "Authorities say two people in New Jersey were killed after their vehicle was swept up in floodwaters during a storm that moved across the U.S. Northeast overnight. Authorities said Tuesday their names haven't been released yet. Meanwhile, York City’s subway system is fully operational following overnight heavy rains. But some roads in New Jersey and Pennsylvania remained closed and there were dozens of flight delays and cancelations at area airports, including 159 total cancelations at Newark Liberty Airport.",
      "publishedAt": "2025-07-15T13:10:32Z",
      "title": "2 dead in New Jersey after flood waters carry away vehicle during heavy rains",
      "url": "https://apnews.com/article/new-york-city-new-jersey-flooding-f55d98547abc20e94dbb6be16a7f72cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b545f2/2147483647/strip/true/crop/3200x1800+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F49%2Ffcc0a7208c4fce51b56a67b40577%2F576dd22c55ab499db07ba1afe4ce14f0"
    },
    {
      "author": null,
      "description": "President Donald Trump’s strategy has been to downplay the uproar over the Jeffrey Epstein sex trafficking case as his supporters demand the Justice Department release much-hyped records in the investigation. Trump's problem is the nothing-to-see-here approach doesn’t work for those who've learned from him they must not give up until the government’s deepest, darkest secrets are exposed. Last week, the Justice Department and the FBI abruptly walked back the notion there's an Epstein client list of elites who participated in the wealthy New York financier’s trafficking of underage girls. The Republican president quickly defended Attorney General Pam Bondi, but the online backlash was swift.",
      "publishedAt": "2025-07-15T11:04:49Z",
      "title": "Trump's embrace of conspiracy theories haunts him with Epstein case",
      "url": "https://apnews.com/article/trump-epstein-conspiracy-theories-bondi-bongino-fbi-a143076353acbc1193cb9697e7fc4a90",
      "urlToImage": "https://dims.apnews.com/dims4/default/a0d6c91/2147483647/strip/true/crop/14845x8350+0+775/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F8e%2Fafb2d5bebc6c4ca0afc6e85011b9%2F0e75b10afbd7443abf9931ace520814f"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Trump administration says it is ending deployment of 2,000 National Guard troops in Los Angeles",
      "url": "https://apnews.com/article/immigration-raids-los-angeles-national-guard-4424658cc059df31317a83cb53c2b59e",
      "urlToImage": null
    },
    {
      "author": null,
      "description": "Senate Republicans are working to slightly scale back President Donald Trump’s request to cancel $9.4 billion in previously approved spending. The changes are designed to build momentum for the package before two key test votes on Tuesday evening. The amended package will remove proposed cuts to a program known as PEPFAR that is credited with saving millions of lives since its creation under then-President George W. Bush to combat HIV/AIDS. Trump is looking to claw back money for foreign aid programs targeted by his Department of Government Efficiency and for the Corporation for Public Broadcasting. The change to save the PEPFAR funding will preserve about $400 million that the administration had sought to cancel.",
      "publishedAt": "2025-07-15T16:52:31Z",
      "title": "Republicans mull changes to Trump's request for $9.4B in spending cuts",
      "url": "https://apnews.com/article/trump-republicans-budget-cuts-pepfar-pbs-npr-b224d4dd5962f141b23e76a4893e0d39",
      "urlToImage": "https://dims.apnews.com/dims4/default/8706680/2147483647/strip/true/crop/2820x1586+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F0c%2F5d29f3080d62bc69820a199e8ef6%2F73d24f40c01d40e8a85e57f358b7dce5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}