{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — One of Gaza's last functioning hospitals has been emptying out in recent days as Israel has ordered the evacuation of nearby areas and signaled a possible ground operation in a town that has been largely spared throughout the war, officials said Monday.",
      "publishedAt": "2024-08-26T10:53:31Z",
      "title": "One of Gaza's last functioning hospitals is emptying out as Israeli forces draw near",
      "url": "https://apnews.com/6d0101cf3dd45dcc7ecee35e0d716ac3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/970381b482f9416186953803d5393f8e/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — In Jerusalem’s Old City, nearly all souvenir shops are closed. In Haifa’s flea market, forlorn merchants polish their wares on empty streets. Airlines are canceling flights, businesses are failing and luxury hotels are half empty.",
      "publishedAt": "2024-08-26T04:46:19Z",
      "title": "Israel's economy is struggling. Economists say ending the war would help",
      "url": "https://apnews.com/f647a0436bae20dca2129e02814068a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c812c3ef43643e18c487de6abf780ba/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The ferocious exchange of fire by Hezbollah and the Israeli military is raising fears of a regional war beyond the tense border.",
      "publishedAt": "2024-08-26T05:08:13Z",
      "title": "Its economy and infrastructure battered, can Lebanon afford a war with Israel?",
      "url": "https://apnews.com/d5433642fcfce79facf8a1369b14d0f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02b7b380aca549f88ace037fa1a52984/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — She’s the sitting vice president who has been in office for 3 1/2 years. She’s also the presidential candidate of just five weeks promising a “new way forward.” Kamala Harris is having it both ways as she hits the campaign trail after the Democratic National Convention, taking credit for parts of President Joe Biden's record in rallies staged in front of Air Force Two while casting herself as a new leader who rails against “the politics of the past.\"",
      "publishedAt": "2024-08-26T08:23:28Z",
      "title": "She's the sitting vice president. She's the candidate of change. How Harris is having it both ways",
      "url": "https://apnews.com/4e64f2b46287cb80c61f17a8d2efdf0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a3350682b8e45609dff5f4304173275/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "Former President Donald Trump on Monday is expected to tie Vice President Kamala Harris to the chaotic Afghanistan War withdrawal on the third anniversary of the suicide bombing that killed 13 service members.",
      "publishedAt": "2024-08-26T04:03:50Z",
      "title": "Trump is expected to tie Harris to chaotic Afghanistan War withdrawal on 3rd anniversary of attack",
      "url": "https://apnews.com/46eb2b0861939bf022747920c0ee0234",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a3ec09184d74baba49c46c58ff33c53/2876.jpeg"
    },
    {
      "author": "ABDUL SATTAR and MUNIR AHMED",
      "description": "QUETTA, Pakistan (AP) — Gunmen in southwestern Pakistan killed at least 37 people in three separate attacks on Monday, officials said, while security forces killed 12 insurgents, marking one of the deadliest days of violence in the restive Baluchistan province, with reports of other shootings and destruction in the area.",
      "publishedAt": "2024-08-26T05:05:19Z",
      "title": "Gunmen kill 37 people in 3 separate attacks in southwestern Pakistan; 12 insurgents also killed",
      "url": "https://apnews.com/5ad252efec8fe9818ee869b23e49477a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b36cd37f9ac04cc38c8a8fb453ea99b7/1920.jpeg"
    },
    {
      "author": null,
      "description": "ANCHORAGE, Alaska (AP) — One person was killed and three were injured by a landslide that prompted a mandatory evacuation in the Alaska city of Ketchikan, authorities said.Three people were transported to Ketchikan Medical Center following the landslide, which struck around 4 p.m.",
      "publishedAt": "2024-08-26T04:45:57Z",
      "title": "Alaska landslide kills 1 person and injures 3 in Ketchikan, authorities say",
      "url": "https://apnews.com/32e0ee1db2ee45a4af581dcecb017e43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/876b517e3a9247afb2ed713e51ef68d2/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy on Monday condemned Russia’s overnight and early morning barrage on his country as “vile” and said it involved over 100 missiles of various types and about 100 “Shahed” drones.",
      "publishedAt": "2024-08-26T06:55:24Z",
      "title": "Ukraine's president says Russian overnight attack involved over 100 missiles and about 100 drones",
      "url": "https://apnews.com/25296eee7c9c394d07d806f44a2ec09e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/671344a434d94436a66a3552a797556a/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and GEIR MOULSON",
      "description": "SOLINGEN, Germany (AP) — German Chancellor Olaf Scholz vowed to toughen knife laws and step up deportations of rejected asylum-seekers Monday as he visited the scene of the knife attack in which a suspected Islamic extremist from Syria is accused of killing three people.",
      "publishedAt": "2024-08-26T10:40:13Z",
      "title": "German leader vows tougher knife laws and more deportations after fatal attack in Solingen",
      "url": "https://apnews.com/117af221d0489ca38811df8c7224a761",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12c5ee4a17cb4d2ea255c30caa4a439c/3000.jpeg"
    },
    {
      "author": "MARK BANCHEREAU",
      "description": "THIAROYE-SUR-MER, Senegal (AP) — Salamba Ndiaye was 22 when she first tried to get to Spain, dreaming of a career as a real estate agent. Without her parents' knowledge, she made it onto a small fishing boat known as a pirogue, but the Senegalese police intercepted the vessel before it could leave.",
      "publishedAt": "2024-08-26T06:18:24Z",
      "title": "'Barcelona or die.' For Senegalese dreaming of Europe, the deadly Atlantic route is not a deterrent",
      "url": "https://apnews.com/d3c7d60d445ad047075ae1836e72ac35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0529a15d0da475ea49ed2de85f6a3d7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}