{
  "articles": [
    {
      "author": "DANA BELTAJI, ISABELLA O'MALLEY",
      "description": "Fire danger remains high in parts of Los Angeles that have been ablaze for days. But there is hope that better weather over the weekend will give firefighters battling the flames some relief. After calmer weather on Tuesday helped firefighters snuff out fires, a rare warning of a “Particularly Dangerous Situation” was issued for Wednesday in an area near the two fires that killed at least 25 people and destroyed thousands of homes. A red flag warning was issued by the National Weather Service from Central Coast to the border with Mexico from 3 a.m. to 3 p.m. But forecasts suggest that conditions for firefighting will later improve, with calmer winds and more humidity expected.",
      "publishedAt": "2025-01-15T13:08:25Z",
      "title": "Firefighters need better weather to fight California's flames. When will they get relief?",
      "url": "https://apnews.com/article/california-wildfires-los-angeles-calmer-weather-explainer-10031db80379c587db6af6879f03f01b",
      "urlToImage": "https://dims.apnews.com/dims4/default/44ee855/2147483647/strip/true/crop/8047x4526+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F5d%2Fd80292cad62471271fca84423235%2F1ebc69e99c8940db81f02d57e3ba5293"
    },
    {
      "author": "The Associated Press",
      "description": "Californians in the greater Los Angeles area are on edge as dangerous winds and temperatures are forecast. The Palisades and Eaton fires have killed at least 25 and destroyed thousands of homes.",
      "publishedAt": "2025-01-15T08:02:00Z",
      "title": "LA fires live updates: Dangerous winds and dry conditions forecast for Wednesday",
      "url": "https://apnews.com/live/california-wildfires-updates-1-15-25",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2c57bf/2147483647/strip/true/crop/5104x2871+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F82%2Ff9655ca1309bc0b9574f7948eecc%2Fb82688e071d741e28c64fd6e53633156"
    },
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE",
      "description": "The National Weather Service's warning about the “particularly dangerous situation” in which any new fire could explode in size in the Los Angeles area didn’t mention fire tornadoes. But meteorologist Todd Hall says they're possible given the extreme conditions. Fire whirl, fire devil, fire tornado or even firenado — scientists, firefighters and regular folks use multiple terms to describe similar phenomena, and they don’t always agree on what’s what. Some say fire whirls are formed only by heat, while fire tornadoes involve clouds generated by the fire itself. In 2018, a fire tornado the size of three football fields killed a firefighter near Redding, California. Across the country, scientists are studying the fire whirls in a lab in Massachusetts.",
      "publishedAt": "2025-01-15T05:08:04Z",
      "title": "Fire tornadoes a risk under California extreme wildfire conditions",
      "url": "https://apnews.com/article/firenado-fire-tornado-california-wildfire-dd53971839343ff6737156af3b983d0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3204b9/2147483647/strip/true/crop/5097x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F9e%2F38e17d15a35fc8408adaf1529b8c%2F14c6c486a3a1408f99da4a194fb71c32"
    },
    {
      "author": "BRITTANY PETERSON",
      "description": "As fires burn in Los Angeles, water utilities are responding to extensive damage to pipes and storage and treatment facilities. Several have issued “do not drink” notices to households until there is time to assess whether the water is safe. One utility official in Pasadena, which issued a “do not drink” notice last week for the first time in its long history, said you have to assume the worst. Water providers are used to dealing with occasional contamination that can be boiled out. But a warmer, drier climate means wildfires are encroaching on cities, like Santa Rosa, California and Louisville, Colorado, where damaged water pipes sucked in toxic chemicals common in urban fires, and remained contaminated for months.",
      "publishedAt": "2025-01-14T14:30:15Z",
      "title": "Contaminated drinking water is a growing concern for cities facing wildfires",
      "url": "https://apnews.com/article/california-los-angeles-wildfires-drinking-water-contamination-121cc5d8ff22e577342e7fa79de791ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d7eb70/2147483647/strip/true/crop/5734x3225+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2F31%2F604dba7c1f2429ca2f9f812fbb33%2F3cf0f0504e734f529ecefbc6e78d1465"
    },
    {
      "author": null,
      "description": "Fires that have been burning homes and businesses in Los Angeles for a week have killed at least 25 people, displaced thousands of others and destroyed more than 12,000 structures. Nearly 30 people are missing. The blazes started early last week and have been powered by gusts from the Santa Ana winds, which strengthened Tuesday. Investigators have not determined what sparked the fires. Estimates suggest they could be the nation's costliest ever. The National Weather Service issued a rare warning about a “particularly dangerous situation” related to severe fire conditions.",
      "publishedAt": "2025-01-08T14:58:14Z",
      "title": "Los Angeles wildfires: What to know about evacuations and burned homes",
      "url": "https://apnews.com/article/california-fires-things-to-know-winds-f93d41dc901e352b63e86ab67ef7790e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a01ab3d/2147483647/strip/true/crop/4209x2368+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F47%2F447facc06dc807fa62be9d381dee%2F31812c5942a94ee2925dd5a22d16dbe7"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "U.S. regulators are banning the dye called Red 3 from the food supply. The move comes nearly 35 years after the dye was barred from cosmetics such as lipsticks because of potential cancer risk. Food and Drug Administration officials on Wednesday granted a 2022 petition filed by consumer advocates. The groups argued that some studies found the dye causes cancer in laboratory rats. FDA officials cited a statute known as the Delaney Clause, which requires FDA to ban any additive found to cause cancer in people or rats. Officials say the cancer risk has not been documented in people.",
      "publishedAt": "2025-01-15T15:11:35Z",
      "title": "FDA bans red dye No. 3 from foods",
      "url": "https://apnews.com/article/fda-red-dye-no-3-ban-94c3e418584fb1e91ca3b0cbeb3d5a60",
      "urlToImage": "https://dims.apnews.com/dims4/default/fcc5d7c/2147483647/strip/true/crop/960x540+0+50/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fac%2Fbedea4e7e18256ce7170785bc19b%2Fc82dcf2b48a245ba96d5bf160749e208"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "Ever since the U.S. Social Security Administration opened its books to the Department of the Treasury’s Bureau of Fiscal Service, it has been able to stop and recover more than $31 million in improper Social Security payments to dead people. “These results are just the tip of the iceberg,” the Treasury’s Fiscal Assistant Secretary David Lebryk said in a news release. As part of the omnibus appropriations bill in 2021, Congress gave Treasury temporary access to Social Security’s ‘Full Death Master File’ for three years, effective December 2023 through 2026. The Treasury projects that it will recover more than $215 million during its three-year access period.",
      "publishedAt": "2025-01-15T17:24:32Z",
      "title": "US recovers $31 million in Social Security payments to dead people",
      "url": "https://apnews.com/article/social-security-biden-treasury-trump-doge-cc46365b82a32038123576502977dd26",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc3e898/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fd7%2F4fef18e1216a7599bcd96555fb79%2F0c594a441b504e8f90e4d87e042dee2f"
    },
    {
      "author": "HAYA PANJWANI",
      "description": "Presidential inaugurations are deeply rooted in American history. The customs and festivities bring spectacle to the nation’s capital. But the date and oath of office are prescribed in the Constitution. In an episode of “The Story Behind the AP Story,” Associated Press Washington radio correspondent Sagar Meghani and White House correspondent Darlene Superville peel back the curtain and share what we can expect during a presidential inauguration and what they expect to see when Donald Trump is inaugurated Monday. Superville says the ceremony is probably one of the oldest traditions in the United States. Meghani says it's steeped in tradition from when George Washington first took the oath in 1789.",
      "publishedAt": "2025-01-15T15:37:36Z",
      "title": "The pomp, pageantry and circumstance of presidential inaugurations in the words of AP reporters",
      "url": "https://apnews.com/article/associated-press-inauguration-trump-biden-898f999243fc4a43170d6191fa355ea7",
      "urlToImage": "https://dims.apnews.com/dims4/default/717f726/2147483647/strip/true/crop/8380x4714+0+439/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F61%2F5790c93d9cfb2073190daede794a%2F18550b24c50448229c06d9ec452154dc"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY, JOSEF FEDERMAN",
      "description": "Officials announced that Israel and Hamas agreed to a ceasefire deal to pause the devastating 15-month war in the Gaza Strip, raising the possibility of winding down the deadliest and most destructive fighting between the bitter enemies. The deal, coming after weeks of painstaking negotiations in the Qatari capital, promises the release of dozens of hostages held by Hamas in phases, the release of hundreds of Palestinian prisoners in Israel and would allow hundreds of thousands of displaced people in Gaza to return to what remains of their homes. It also would flood badly needed humanitarian aid into a devastated territory. Qatar's prime minister said the deal would go into effect on Sunday. Israel said final details still need ironing out.",
      "publishedAt": "2025-01-15T16:35:52Z",
      "title": "Officials tout a Gaza ceasefire deal and plan to free hostages. Israel says details still in flux",
      "url": "https://apnews.com/article/gaza-israel-hamas-ceasefire-334ecc4420fe3b6fce9f7a27ca886b65",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ac7b57/2147483647/strip/true/crop/8583x4828+0+447/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F3e%2F71a35200039fd5b1fb83759611f6%2F0903c1dd755f4de98c0880b249783fe0"
    },
    {
      "author": "MATTHEW LEE, AAMER MADHANI, ELLEN KNICKMEYER",
      "description": "President Joe Biden and President-elect Donald Trump are both claiming credit for Israel and Hamas agreeing to a ceasefire deal in Gaza after the White House brought Trump’s Middle East envoy into negotiations that have dragged on for months. Trump wasted no time in claiming to be the moving force behind the deal, saying it “could have only happened as a result of our Historic Victory in November.” Israeli Prime Minister Benjamin Netanyahu’s office says the final details were still being ironed out. Biden stressed in a statement that a deal was reached under “the precise contours” of a plan that he set out in late in May.",
      "publishedAt": "2025-01-15T19:08:34Z",
      "title": "Trump and Biden both claim credit for Gaza ceasefire deal",
      "url": "https://apnews.com/article/gaza-ceasefire-trump-biden-israel-hamas-0e6c324ba0e3e9413bafe740fdefebc6",
      "urlToImage": "https://dims.apnews.com/dims4/default/c940fd6/2147483647/strip/true/crop/5802x3264+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F87%2Ffe94fa9cdb027243e8b39fb1b0a5%2Fc9b7b4a2bac241139305673ecad24edf"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}