{
  "articles": [
    {
      "author": null,
      "description": "Fighting between Thailand and Cambodia over disputed border areas has entered a second day, leaving at least 15 dead and displacing more than 58,000 people. Clashes flared up again Friday in multiple areas, including Chong Bok and Phu Makhuea in Thailand’s Ubon Ratchathani province. The Thai army accused Cambodian forces of using heavy artillery, prompting what Thai officials described as “appropriate supporting fire” in return. Malaysia has expressed concern and offered to mediate. U.N. Secretary-General Antonio Guterres has also called for restraint and urged both countries to resolve disputes through dialogue.",
      "publishedAt": "2025-07-25T06:26:28Z",
      "title": "Tens of thousands flee Thailand-Cambodia fighting",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-deaa0baeecf76876340105a26651653f",
      "urlToImage": "https://dims.apnews.com/dims4/default/78e0607/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F84%2Fda0f81206ee8189bfe40621d7dac%2Ffede83760de148819850ea15d746615e"
    },
    {
      "author": null,
      "description": "Serious armed clashes have erupted between Thailand and Cambodia over a disputed border area. The fighting, which erupted on Thursday, included gunfire exchanges and shelling and rocket fire, which Thai authorities say killed a Thai soldier and 13 civilians and injured 14 soldiers and 32 other civilians. Thailand has responded with air strikes. It was the second armed confrontation since a Cambodian soldier was shot dead in May. Border disputes are long-standing issues that have caused periodic tensions between the two neighbors. Thailand and Cambodia share more than 800 kilometers of land border. The contesting claims stem largely from a 1907 map drawn under French colonial rule.",
      "publishedAt": "2025-07-24T07:26:37Z",
      "title": "What's behind the deadly border clashes between Thailand and Cambodia",
      "url": "https://apnews.com/article/thailand-cambodia-border-conflict-explainer-0eb99510a4ea16ee769a5934e0c07383",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ca0d9f/2147483647/strip/true/crop/7640x4298+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Ff7%2F09b4dbeb4f62a1aa06f5f25b4c84%2F042c799cceb04440a7b20a9c44f13179"
    },
    {
      "author": null,
      "description": "U.S. troops are sharing command stations and vehicles with civilian immigration authorities at the southern U.S. border under an emergency declaration from President Donald Trump. A two-star general general leads 7,600 border troops and an assortment of helicopters and drones, and says the military has been freed from menial work to help apprehend immigrants, protect newly designated militarized turf and disrupt smuggling cartels. Legal experts say the strategy flouts a ban on law enforcement by the military on U.S. soil and thrusts the armed forces into a potentially politicized mission. In a twist of fate, immigrants are part of the U.S. fighting forces at the border.",
      "publishedAt": "2025-07-25T04:12:00Z",
      "title": "Trump's mission to seal the US-Mexico border brings US military into enforcement",
      "url": "https://apnews.com/article/mexico-us-border-militarized-zones-arizona-trump-be3ee9f55a62c323ac5e03b5366f5d25",
      "urlToImage": "https://dims.apnews.com/dims4/default/13f8b1e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F4b%2F69651271a6e93008d6ead3ee2cdf%2Fd85d6af8bf6c44708ef95c2ceafaf0e2"
    },
    {
      "author": null,
      "description": "President Donald Trump’s special envoy Steve Witkoff says the U.S. is cutting short Gaza ceasefire talks and bringing home its negotiating team from Qatar for consultations after the latest response from Hamas “shows a lack of desire to reach a ceasefire in Gaza.” Witkoff said Thursday, “While the mediators have made a great effort, Hamas does not appear to be coordinated or acting in good faith.\" Witkoff says the United States will now \"consider alternative options to bring the hostages home and try to create a more stable environment for the people of Gaza.” Witkoff adds it's “a shame that Hamas has acted in this selfish way” and the U.S. is “resolute” in seeking an end to the conflict in Gaza.",
      "publishedAt": "2025-07-24T17:11:40Z",
      "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks",
      "url": "https://apnews.com/article/mideast-wars-trump-witkoff-gaza-ceasefire-4d713a205d5d33e664b7c5853c6f5a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Health workers and aid groups fear hunger that has been building in Gaza for months under Israel's blockade is now reaching a tipping point into accelerating death. The Gaza Health Ministry says that in the past three weeks, at least 48 people died of causes related to malnutrition, including 20 children. That’s up from 10 children who died in the five previous months of 2025. At the main emergency center for malnourished kids in northern Gaza, five children died in rapid succession over four days last week, with staff unable to treat them because key medicines had run out.",
      "publishedAt": "2025-07-24T19:56:26Z",
      "title": "Starving children die in a Gaza hospital as malnutrition spreads",
      "url": "https://apnews.com/article/gaza-palestinians-starvation-famine-israel-children-3a7403d4f6ec483a03d6cbb0c45fd06a",
      "urlToImage": "https://dims.apnews.com/dims4/default/af2dd61/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2Fa9%2Fa1fb2d14b7b2d26006080af99161%2Fe1f62c9cb2d64b2f87c752f8002b62a3"
    },
    {
      "author": null,
      "description": "A new poll shows Americans’ views of the Supreme Court have moderated somewhat since the court’s standing dropped sharply after its ruling overturning Roe v. Wade in 2022. But the AP-NORC poll shows concern the court has too much power is rising, fueled largely by Democrats. The poll finds about a third of U.S. adults have hardly any confidence in the court, but that’s down from 43% three years ago. The decrease in negative opinion about the court is driven by Republicans and independents. Still, views of the nation’s highest court remain more negative than they were as recently as early 2022, before the high-profile Dobbs ruling that overturned the constitutional right to abortion.",
      "publishedAt": "2025-07-25T11:01:14Z",
      "title": "Views of Supreme Court less negative than just after 2022 abortion ruling",
      "url": "https://apnews.com/article/supreme-court-poll-trump-conservative-justices-abortion-dc4ef3a6adaee2ee9cc32d22dce0a74e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e62521/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F32%2F7c730175f20443d927a11af15cd4%2Ff79ca671346e49f7a2d5e9c38a8b662f"
    },
    {
      "author": null,
      "description": "Disgraced former U.S. Rep. George Santos is set to begin serving a seven-year prison sentence for the fraud charges that got him ousted from Congress. The New York Republican is slated to report to federal prison by 2 p.m. on Friday. It’s unclear where he’ll serve his time. Santos and his lawyers have declined to comment, as has the federal Bureau of Prisons. Santos pleaded guilty last summer to federal wire fraud and aggravated identity theft. He admitted that he deceived donors and stole the identities of nearly a dozen people to fund his congressional campaign. He served less than a year in Congress before being expelled in 2023.",
      "publishedAt": "2025-07-25T04:02:46Z",
      "title": "Ex-GOP Rep. George Santos to start 7-year prison term for fraud charges",
      "url": "https://apnews.com/article/george-santos-fraud-prison-29cdb8a9e9dfe7283d53091a6e20b1ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/42ea047/2147483647/strip/true/crop/4300x2419+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F94%2F4281e8d3fa1104babea46f18ca67%2Fbe27fd344308436cab27ce0e430dbd7d"
    },
    {
      "author": null,
      "description": "A government school building's roof collapsed in Rajasthan, India, killing seven children and injuring at least 21. The incident occurred Friday as students were about to start their school assembly. The school is located in Piplod village, Jhalawar district, and serves students up to eighth grade. Around 35 students were present, and the deceased were from seventh and eighth grade. Injured students have been admitted to two local hospitals. Prime Minister Narendra Modi expressed his condolences, calling the accident \"tragic\" and \"deeply saddening.\" Authorities are providing assistance to those affected.",
      "publishedAt": "2025-07-25T11:08:38Z",
      "title": "School roof collapse in western India kills 7 children, injures 21",
      "url": "https://apnews.com/article/india-rajasthan-school-roof-collapse-a4684047c7b3b6c8effb9eb60166859c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Justice Department officials will meet with Ghislaine Maxwell, the imprisoned girlfriend of financier and convicted sex offender Jeffrey Epstein. That's according to a person familiar with the matter. The person tells The Associated Press the meeting is Thursday in Florida, where Maxwell is held. The meeting is part of a Justice Department effort to cast itself as transparent following backlash from parts of President Donald Trump’s base over an earlier refusal to release additional Epstein records. A Justice Department spokesman hasn't returned a message seeking comment. A lawyer for Maxwell says she'll \"always testify truthfully.” Maxwell was convicted of helping Epstein sexually abuse underage girls. Epstein died in a New York jail awaiting trial.",
      "publishedAt": "2025-07-24T15:03:01Z",
      "title": "Justice Department will meet with Epstein's girlfriend Maxwell",
      "url": "https://apnews.com/article/epstein-maxwell-trump-sex-offender-b828f96be4a438edfe8051511be8c5da",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "Asian shares are lower after Wall Street inched to more records as gains for Alphabet and artificial-intelligence stocks offset a steep tumble for EV-maker Tesla. Japan’s Nikkei 225, fell 0.7% after two days of gains following President Donald Trump’s announcement of a trade deal that would place a 15% tax on imports coming from Japan. That’s lower than the 25% rate that Trump had earlier said would kick in on Aug. 1. Chinese markets also declined ahead of trade talks next week with the U.S. On Thursday, the S&P 500 edged up 0.1% to another all-time high. The Dow Jones Industrial Average fell 0.7%, and the Nasdaq composite rose 0.2% to its own record.",
      "publishedAt": "2025-07-25T04:55:30Z",
      "title": "Asian shares retreat after Wall Street inched to more records",
      "url": "https://apnews.com/article/markets-stocks-earnings-tariffs-trump-2882d3cf706eb9891bdc0600e46e6524",
      "urlToImage": "https://dims.apnews.com/dims4/default/118f793/2147483647/strip/true/crop/4169x2345+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F4a%2F0e25f1f0c823fd706f8b648fe780%2Fe75c2c2fe2e3455e9ae5788db7d0aaa1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}