{
  "articles": [
    {
      "author": "Wafaa Shurafa, Bassem Mroue",
      "description": "At least 82 people were killed by Israeli strikes in Gaza on Friday, as US President Donald Trump wrapped up his regional trip. Strikes overnight and into Friday hit across Gaza, including the outskirts of Deir al-Balah and the city of Khan Younis. At least 66 people were killed according to the Indonesian hospital, where most of the bodies were taken. A further 16 bodies were taken to Nasser hospital, said health officials. The widespread attacks across northern Gaza come as Trump finishes his visit to Gulf states but not Israel. There had been widespread hope that Trump’s regional visit could usher in a ceasefire deal or renewal of humanitarian aid to Gaza.",
      "publishedAt": "2025-05-16T06:24:07Z",
      "title": "Israeli strikes kill at least 82 people in Gaza as Trump wraps up his Middle East visit",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-hostages-05-16-2025-fb5e3b08af46a55b6faeead7b8647dc6",
      "urlToImage": "https://dims.apnews.com/dims4/default/29f2c0f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F8f%2F43c913f63702034fb6057dc31aa6%2F11901daf8d814518b31914ec397e88e7"
    },
    {
      "author": "Hanna Arhirova, Andrew Wilks",
      "description": "Delegations from Russia and Ukraine have met in Istanbul for their first direct peace talks in three years. A Ukrainian delegation led by Defense Minister Rustem Umerov sat down Friday with a low-level Russian team headed by presidential aide Vladimir Medinsky. That's according to Ukraine’s Foreign Ministry spokesperson who published a photo of the meeting. The officials present sat around a U-shaped table, with the Russians and Ukrainians facing each other. Officials and observers expect the Turkish-brokered talks to yield little immediate progress on stopping the more than three-year war.",
      "publishedAt": "2025-05-16T08:08:59Z",
      "title": "Russia and Ukraine to hold their first peace talks in 3 years",
      "url": "https://apnews.com/article/russia-ukraine-turkey-peace-talks-9a75e2069cea6c73d1276a9e53e7d6e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/424c638/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F06%2Fcd1d26a7f032a62b1e56955c05f2%2F8a391d328a4b4aa9a672a1d5b2ddaa99"
    },
    {
      "author": "Zeke Miller, Jon Gambrell",
      "description": "U.S. President Donald Trump said Friday that Iran has an American proposal over its rapidly advancing nuclear program as negotiations between the two countries go on. Trump made the comment aboard Air Force One as he ended his trip to the United Arab Emirates, the last stop on his three-nation tour of the Middle East. Trump did not elaborate on the substance of the proposal and Iran did not immediately acknowledge having it. On Thursday, Foreign Minister Abbas Araghchi spoke to journalists at the Tehran International Book Fair and said that Iran did not have any proposal from the Americans yet.",
      "publishedAt": "2025-05-16T10:32:30Z",
      "title": "Trump says Iran has US proposal on nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-ab3c43258835d5d4b30b83e02cb05131",
      "urlToImage": "https://dims.apnews.com/dims4/default/d280c67/2147483647/strip/true/crop/4789x2694+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Fc1%2F6100383e000084c3535c106fba23%2Fc07cefe1317f4923a277483476d039ec"
    },
    {
      "author": "Zeke Miller, Aamer Madhani",
      "description": "President Donald Trump has used the first major foreign trip of his second term to outline a vision for restoring global stability that is grounded in pragmatism and self-interest rather than values. His four-day swing through Saudi Arabia, Qatar and the United Arab Emirates puts a spotlight on Trump’s transactional approach to foreign affairs as he was feted by autocratic rulers. His trip played out against the backdrop of stubborn global conflicts that showed the limits of his influence. But Trump insisted he was turning the page on American “interventionalism” as he moved to recognize the new government in Syria for the first time and prodded Iran to engage on nuclear talks.",
      "publishedAt": "2025-05-16T07:54:50Z",
      "title": "Opulence, business deals and a $400M plane from Qatar: Takeaways from Trump's Mideast tour",
      "url": "https://apnews.com/article/trump-mideast-trip-uae-qatar-russia-ukraine-963b695c94b908a2f9c76271ea9d131b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f93cd8/2147483647/strip/true/crop/3739x2103+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F46%2F54fa3263c417eecd02824f2dfd1b%2F633e79f45c0f4097ad29ab37ba650b18"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "House Republicans are preparing to push their hard-fought package of tax breaks and spending cuts through its next hurdle in the Budget Committee. But renegade conservatives have warned they'll vote against it Friday without further changes. Tallying a whopping 1,116 pages, the One Big Beautiful Bill Act is teetering at a critical moment. Conservatives are holding out for steeper cuts to Medicaid and other programs to help offset the costs of the tax breaks. Lawmakers from high-tax states including New York are demanding a deeper local tax deduction. House Speaker Mike Johnson insists Republicans are on track with the bill he says will shore up the economy.",
      "publishedAt": "2025-05-16T10:46:10Z",
      "title": "Trump's bill of tax breaks and spending cuts faces next hurdle in Congress",
      "url": "https://apnews.com/article/republicans-trump-bill-tax-cuts-spending-medicaid-a9f9c0a23cd2a6e7917d5b73f935e1fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/73f6bdf/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F25%2F369171fdb34a27b2b876d99e47b4%2F55766a219ddf4338afdcc7480c4d320e"
    },
    {
      "author": "Jintamas Saksornchai",
      "description": "A construction magnate and more than a dozen other people have surrendered to police on criminal negligence charges for the collapse of a Bangkok high-rise during a March 28 earthquake. Premchai Karnasuta, the president of Italian-Thai Development Co, the main Thai contractor for the building project, and 16 other people were charged with the felony of professional negligence causing death. They have denied wrongdoing. Ninety-two people were confirmed dead in the rubble of the building that had been under construction. The building, which was to become a new State Audit Office, was the only one in Thailand to collapse in the earthquake that was centered in neighboring Myanmar.",
      "publishedAt": "2025-05-16T04:09:29Z",
      "title": "Thai construction magnate surrenders on felony negligence charges over building collapse in quake",
      "url": "https://apnews.com/article/bangkok-building-collapse-thailand-myanmar-earthquake-ee56ec5b47304c771d38c5998e587a5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/31f8c77/2147483647/strip/true/crop/6988x3931+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F91%2Fb5a2919dd292651566ddaebf69b2%2Fe3d08c0d4dd64b2b9477a67f8ac49b09"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has affirmed core Catholic teaching on marriage and the unborn in his first meeting with the ambassadors accredited to the Holy See. He said Friday the family is founded on the “stable union between a man and a woman” and that the unborn and elderly enjoy dignity as God’s creatures. Leo also called for reviving multilateral diplomacy and promoting dialogue between religions in the search for peace. The encounter with the Vatican diplomatic corps is one of the protocol requirements after a conclave, allowing a new pope to greet representatives of world governments ahead of his formal installation Mass this Sunday.",
      "publishedAt": "2025-05-16T08:58:30Z",
      "title": "Pope Leo XIV affirms family is based on union between a man and a woman, unborn has inherent dignity",
      "url": "https://apnews.com/article/vatican-pope-leo-peace-abortion-f0678b67da0dc74b4bc7e6e10a77a23e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a082c7/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F4a%2F9cd8a5a5ed1ffd556a1aa74d7ccf%2F787f3ef2e4ef43e0a90c43429cd39e41"
    },
    {
      "author": "Jonathan J. Cooper",
      "description": "Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party. A new book that alleges White House aides covered up Biden’s physical and mental decline has put the questions about Biden’s health back in the spotlight, months after Vice President Kamala Harris lost to President Donald Trump. Several potential Democratic contenders for the 2028 nomination in recent days have said they believe Biden was declining in office or questioned whether he should have sought reelection before a disastrous debate performance led to his withdrawal.",
      "publishedAt": "2025-05-16T04:01:33Z",
      "title": "Joe Biden's mental acuity becomes a Democratic litmus test",
      "url": "https://apnews.com/article/joe-biden-age-democrats-midterms-2028-6738bf46f73c06c70015e4b1abe43df7",
      "urlToImage": "https://dims.apnews.com/dims4/default/1fe7968/2147483647/strip/true/crop/8186x4605+0+426/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F35%2F2eaedd4603af03e4fcd56dd7d948%2Fb13697f97c2a48868a8ef35a7e8a67fa"
    },
    {
      "author": "Bruce Shipkowski",
      "description": "New Jersey Transit train engineers are on strike in a dispute over wages, leaving an estimated 350,000 commuters in New Jersey and New York City to seek other means to reach their destinations or consider staying home. The walkout Friday comes after the latest round of negotiations on Thursday didn’t produce an agreement. Picketers gathered outside transit headquarters and the Hoboken Terminal. It’s the state’s first transit strike in more than 40 years. It halts all NJ Transit commuter trains, which provide heavily used routes between New York City’s Penn Station on one side of the Hudson River and communities in northern New Jersey on the other, as well as the Newark airport.",
      "publishedAt": "2025-05-16T10:09:22Z",
      "title": "New Jersey Transit strike disrupts travel",
      "url": "https://apnews.com/article/new-jersey-transit-strike-train-engineers-nyc-08a230d45019fb96211c4b5710425cfc",
      "urlToImage": "https://dims.apnews.com/dims4/default/b428571/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fe4%2F40bcceca14735e50880fdc9a14a0%2F2e80aa7a8e2a4bb9be830ecaf7f7574d"
    },
    {
      "author": "Tim Sullivan",
      "description": "Asylum-seekers from around the world face new challenges at the U.S. border. President Donald Trump suspended the asylum system just after his inauguration as part of his wide-ranging crackdown on illegal immigration. Lawyers, activists and immigrants say the process is now unclear, with many people deported after fleeting conversations with immigration officials while others languish in Immigration and Customs Enforcement custody. Attorneys who work frequently with asylum-seekers at the border say their phones have gone quiet since Trump took office. Legal battles are ongoing, with rights groups challenging the restrictions.",
      "publishedAt": "2025-05-16T04:27:12Z",
      "title": "Asylum-seekers left in limbo after Trump's crackdown",
      "url": "https://apnews.com/article/trump-immigration-asylum-lawsuit-courts-d325740dd73f425309c66f89e670fd8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f93974a/2147483647/strip/true/crop/4979x2801+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fca%2Fd2977a808a881277a3f65fb4f96d%2F13e90ee637e44101978eb78826604b30"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}