{
  "articles": [
    {
      "author": "AARON MORRISON",
      "description": "WASHINGTON (AP) — A masked white man carrying at least one weapon bearing a swastika fatally shot three Black people inside a Florida store Saturday in an attack with a clear motive of racial hatred, officials said.",
      "publishedAt": "2023-08-27T09:36:03Z",
      "title": "White shooter kills 3 Black people in Florida hate crime as Washington celebrates King’s dream",
      "url": "https://apnews.com/51edd341db7fe2374cb69970840ef76f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/924d1aa8b4474477b4c10eaef95a0709/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "CANBERRA, Australia (AP) — A United States Marine Corps aircraft carrying troops crashed on a north Australian island Sunday, killing three Marines and injuring 20 during a multination training exercise, officials said.",
      "publishedAt": "2023-08-27T06:09:45Z",
      "title": "3 US Marines killed, 20 injured in an aircraft crash in Australia during a training exercise",
      "url": "https://apnews.com/e85fcd46cd3c85933d724a8cf4f253b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54eef8db745f4a02a1bef19e04afc25b/1778.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia’s Investigative Committee said Sunday that it confirmed that Yevgeny Prigozhin, founder and head of the mercenary force Wagner who led a short-lived armed rebellion against Russia's military, was killed in a plane crash.",
      "publishedAt": "2023-08-27T10:50:13Z",
      "title": "Russia says it confirmed Wagner leader Prigozhin died in a plane crash",
      "url": "https://apnews.com/2c77567908c73e538f9f1c76ae406f8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bae004ca6a954cab86dffab99d22feb4/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Yevgeny Prigozhin smiled as a crowd of adoring fans surrounded his black SUV on June 24 in Russia’s southern city of Rostov-on-Don and cheered him on.“You rock!” fans shouted while taking selfies with the chief of the Wagner mercenary group, who was sitting in the vehicle after nightfall.",
      "publishedAt": "2023-08-27T06:39:16Z",
      "title": "Prigozhin's final months were overshadowed by questions about what the Kremlin had in store for him",
      "url": "https://apnews.com/0f8a68561e7dbaa4e97ae6d1192559e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0154bd28b7714e2ca6986ff24ecf0a04/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — For former President Donald Trump, a picture is worth... more than $7 million.Trump's campaign says he has raised $7.1 million since Thursday when he was booked at the Fulton County Jail in Georgia on charges that he illegally schemed to overturn the 2020 election in the state and became the first former president in U.S.",
      "publishedAt": "2023-08-26T23:44:18Z",
      "title": "Trump campaign reports raising more than $7 million after Georgia booking",
      "url": "https://apnews.com/f09f923de753995e0548bd05ddb49c0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5027781a1fc6444cb028a8fcd34dfccd/2760.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "CHRISTCHURCH, New Zealand (AP) — The howling winds and perpetual darkness of the Antarctic winter were easing to a frozen spring when mechanic Liz Monahon at McMurdo Station grabbed a hammer.If those in charge weren’t going to protect her from the man she feared would kill her, she figured, she needed to protect herself.",
      "publishedAt": "2023-08-27T04:04:46Z",
      "title": "Women working in Antarctica say they were left to fend for themselves against sexual harassers",
      "url": "https://apnews.com/ba0e550fddf1ab0afd031ff4d25143cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d62d148ce8284d169f6694480f71a7fd/3000.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT, BERNARD CONDON and MICHAEL BIESECKER",
      "description": "In the first moments of the Maui fires, when high winds brought down power poles, slapping electrified wires to the dry grass below, there was a reason the flames erupted all at once in long, neat rows -- those wires were bare, uninsulated metal that could spark on contact.",
      "publishedAt": "2023-08-26T12:04:26Z",
      "title": "Bare electrical wire and leaning poles on Maui were possible cause of deadly fires",
      "url": "https://apnews.com/9f23f79821ea50256f0725ac9b0b3905",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7acf0f415a2f4cbc9e66afa4d47c73ea/3000.jpeg"
    },
    {
      "author": "GABE STERN",
      "description": "RENO, Nev. (AP) — Santos Brizuela spent more than two decades laboring outdoors, persisting despite a bout of heatstroke while cutting sugarcane in Mexico and chronic laryngitis from repeated exposure to the hot sun while on various other jobs.",
      "publishedAt": "2023-08-27T04:37:03Z",
      "title": "Workers exposed to extreme heat have no consistent protection in the US",
      "url": "https://apnews.com/1d53c85d0f8dd2cb973f950c54fb17eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2d16352c35e48628daad6c23af5fdf1/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "JACKSON HOLE, Wyoming (AP) — Rising trade barriers. Aging populations. A broad transition from carbon-spewing fossil fuels to renewable energy.The prevalence of such trends across the world could intensify global inflation pressures in the coming years and make it harder for the Federal Reserve and other central banks to meet their inflation targets.",
      "publishedAt": "2023-08-27T09:00:23Z",
      "title": "Global inflation pressures could become harder to manage in coming years, research suggests",
      "url": "https://apnews.com/aec9e51d969ed56e2348a8c839e764e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41aaa4e2cf224a14a877337cef1f72c9/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA and GERALD IMRAY",
      "description": "HARARE, Zimbabwe (AP) — Zimbabwe's main opposition leader on Sunday alleged “blatant and gigantic fraud” in the country's election after President Emmerson Mnangagwa was declared the winner and international observers reported an atmosphere of intimidation against voters.",
      "publishedAt": "2023-08-27T11:00:43Z",
      "title": "Zimbabwe's opposition alleges 'gigantic fraud' in vote that extends the ZANU-PF party's 43-year rule",
      "url": "https://apnews.com/3a6b92a3a586d136928a7878b916d9fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b55d5e3adb3432c928efe289c3f126d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}