{
  "articles": [
    {
      "author": "PAOLA FLORES and MEGAN JANETSKY",
      "description": "LA PAZ, Bolivia (AP) — Led by a top general vowing to “restore democracy,” armored vehicles rammed the doors of Bolivia's government palace Wednesday in what the president called a coup attempt, then quickly retreated — the latest crisis in the South American country facing a political battle and an economic crisis.",
      "publishedAt": "2024-06-26T20:00:23Z",
      "title": "Bolivian general arrested after apparent failed coup attempt as government faces new crisis",
      "url": "https://apnews.com/028cd88f3be1fb02164c05deb0faa099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/307c11d063da4c3098865dd4e949ce6b/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT, BILL BARROW and DARLENE SUPERVILLE",
      "description": "ATLANTA (AP) — President Joe Biden and his Republican rival, Donald Trump, will meet for a debate on Thursday that offers an unparalleled opportunity for both candidates to try to reshape the political narrative.",
      "publishedAt": "2024-06-27T04:08:30Z",
      "title": "How the Biden-Trump debate could change the trajectory of the 2024 campaign",
      "url": "https://apnews.com/0e7577e9a354a69f50675494fea54ca9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c893ff1f39934584a4143329d87f01f5/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "To hear former President Donald Trump tell it, the U.S. has fallen apart under President Joe Biden: the economy is failing, countries are emptying their prisons and mental institutions across the southern border and crime has skyrocketed.",
      "publishedAt": "2024-06-27T04:12:34Z",
      "title": "FACT FOCUS: Here's a look at the false claims you might hear during tonight's presidential debate",
      "url": "https://apnews.com/577507522762aa10f6ee5be3a0ced2bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d4135a6ccf9483fbe5b1dab8880f498/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — In the waning moments of Iran's final televised presidential debate, one of the top candidates to replace the late hard-line President Ebrahim Raisi invoked the name of the one person who perhaps has done more than anyone to change the trajectory of the Islamic Republic's relationship with the wider world in recent years.",
      "publishedAt": "2024-06-27T05:06:00Z",
      "title": "Analysis: No matter who wins Iran's presidential election, much may hinge on the 'Great Satan' US",
      "url": "https://apnews.com/b876feed55807a36aef03ea44fd1c10d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd4d65b24f244531a5eba9bf01203547/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JULIA FRANKEL",
      "description": "DEIR AL-BALAH, Gaza (AP) — Children in sandals trudge through water contaminated with sewage and scale growing mounds of garbage in Gaza’s crowded tent camps for displaced families.",
      "publishedAt": "2024-06-27T04:15:18Z",
      "title": "In the searing heat of the Gaza summer, Palestinians are surrounded by sewage and garbage",
      "url": "https://apnews.com/d96fbbbc37e7a73acfd0aa47978394c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70dff15b51194fa0a554d748865b97e6/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "NOGALES, Mexico (AP) — Ana Ruiz was dismayed seeing migrants from some countries released in the United States with orders to appear in immigration court while she and other Mexicans were deported on a one-hour bus ride to the nearest border crossing.",
      "publishedAt": "2024-06-27T05:03:29Z",
      "title": "Biden's asylum halt is falling hardest on Mexicans and other nationalities Mexico will take",
      "url": "https://apnews.com/43468ec3b154f478f726a62d07204a53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88d17b5bf3ad46749d14d2842f4d8122/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — A solid majority of Americans say Supreme Court justices are more likely to be guided by their own ideology rather than serving as neutral arbiters of government authority, a new poll finds, as the high court is poised to rule on major cases involving former President Donald Trump and other divisive issues.",
      "publishedAt": "2024-06-27T04:02:21Z",
      "title": "7 in 10 Americans think Supreme Court justices put ideology over impartiality: AP-NORC poll",
      "url": "https://apnews.com/2918d3af5e37e44bbad9c3526506c66d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/086a99bb06cc43aeba15cdc9f0c39ad9/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and DAVE COLLINS",
      "description": "DES MOINES, Iowa (AP) — A family that watched their home collapse into a flooded river near an at risk Minnesota dam is vowing to reopen their nearby store to sell its homemade pie and burgers as soon as its safe to do so.",
      "publishedAt": "2024-06-27T05:06:04Z",
      "title": "Family that lost home to flooded river vows to keep store open as floodwaters devastate Midwest",
      "url": "https://apnews.com/3153b9fee3dde564289386d1baa3842e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/389a630ac6e04f01a95821da4f2dd8be/1920.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Nearly a year after wind-whipped flames raced through Kim Ball’s Hawaii community, the empty lot where his house once stood is a symbol of some of the progress being made toward rebuilding after the deadliest U.S.",
      "publishedAt": "2024-06-27T05:47:44Z",
      "title": "Maui officials highlight steps toward rebuilding as 1-year mark of deadly wildfire approaches",
      "url": "https://apnews.com/6e1bb5c6d97955b6f891690ee63a50b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/febfcf2f9832441dae66c49f6e427214/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "BETHEL, N.Y. (AP) — Beverly “Cookie” Grant hitchhiked to the Woodstock music festival in 1969 without a ticket and slept on straw. Ellen Shelburne arrived in a VW microbus and pitched a pup tent.Fifty-five years later, the two longtime friends finally got back to the garden, but this time in high style.",
      "publishedAt": "2024-06-27T05:04:18Z",
      "title": "Back to Woodstock, with Wi-Fi: Women return after 55 years to glamp and relive the famous festival",
      "url": "https://apnews.com/832670a5086f03922d61c5cf77dfd9c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/927f2853fcd34f03b47571a7cc6a2534/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}