{
  "articles": [
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Trump is on his way to Davos, where his quest to own Greenland could overshadow his other goals",
      "url": "https://apnews.com/article/trump-davos-housing-greenland-gaza-a2f3f4c18ba321c8025a3e208fc0ddf6",
      "urlToImage": null
    },
    {
      "author": null,
      "description": "European leaders and California Gov. Gavin Newsom have expressed strong concerns at the World Economic Forum over the Greenland crisis and global trade issues. On Tuesday, French President Emmanuel Macron warned against a \"new colonial approach\" that could harm international collaboration. European Commission President Ursula von der Leyen criticized proposed U.S. tariffs, emphasizing the importance of maintaining alliances. In a blunt statement, Newsom urged leaders to stand firm against U.S. President Donald Trump's actions, calling for more decisive diplomacy. The forum in Davos, Switzerland, highlighted tensions between the U.S. and Europe over trade and territorial sovereignty.",
      "publishedAt": "2026-01-20T15:52:22Z",
      "title": "Trump’s threats over Greenland draw warnings and profanities at global forum",
      "url": "https://apnews.com/article/davos-greenland-trump-macron-newsom-wef-leyen-ee1791fd72153cef9bd428e2d37cc354",
      "urlToImage": "https://dims.apnews.com/dims4/default/3685ae5/2147483647/strip/true/crop/5261x2959+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F63%2F6a07423e80dfbf199cdab669980a%2F36a8245c69ef4a98b8e1e991bf14439d"
    },
    {
      "author": "Jamey Keaten",
      "description": "U.S. Treasury Secretary Scott Bessent says America’s relations with Europe remain strong. Speaking on the sidelines of the World Economic Forum annual meeting in Davos, Switzerland, he urged trading partners to “take a deep breath” and let tensions driven by the Trump administration’s new tariff threats over Greenland “play out.” “I think our relations have never been closer,” he said. On Saturday, Trump announced a 10% import tax starting in February on goods from eight European nations that have rallied around Denmark in the wake of his stepped up calls for the United States to take over the semi-autonomous territory of Greenland. Trump has insisted the U.S. needs the territory for security reasons against possible threats from China and Russia.",
      "publishedAt": "2026-01-20T08:01:23Z",
      "title": "Bessent says US-Europe relations have 'never been closer' despite Greenland crisis",
      "url": "https://apnews.com/article/denmark-greenland-trump-bessent-davos-ab05ebfaae6a413d1f8125cb9726a4c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/13eab06/2147483647/strip/true/crop/8154x4587+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Ffc%2F2b037395dea0f8702fd39db6c153%2F1e93d29d8de342b3973e1d93714d9590"
    },
    {
      "author": "Hernán Muñoz, Suman Naishadham",
      "description": "A commuter train crash in Catalonia, Spain, has led to the suspension of rail services in the region. The crash occurred when a train hit a retaining wall that had fallen onto the tracks. At least one person died, and 37 others were injured. Emergency services responded with 20 ambulances, and the injured were taken to local hospitals. The crash happened near Gelida, about 35 minutes from Barcelona. Heavy rainfall is believed to have caused the wall to collapse. This incident follows a deadly high-speed train crash in southern Spain on Sunday that killed at least 42 people.",
      "publishedAt": "2026-01-21T08:35:56Z",
      "title": "Barcelona commuter train crash halts Catalonia rail service",
      "url": "https://apnews.com/article/spain-train-crash-adamuz-barcelona-71f6ad926cd48044df6854fdd52ba722",
      "urlToImage": "https://dims.apnews.com/dims4/default/d654ec7/2147483647/strip/true/crop/2240x1260+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F43%2F0070c36e45fa5b954a0e7ecdb364%2F1925b23951764c46890cf4e9681c4c48"
    },
    {
      "author": "Hyung-Jin Kim",
      "description": "A South Korean court has ruled the 2024 imposition of martial law by then President Yoon Suk Yeol constituted an act of rebellion as it sentenced his prime minister to 23 years in prison for his involvement. Ex-Prime Minister Han Duck-soo became the first Yoon administration official convicted of rebellion charges in related to Yoon’s martial law imposition in December 2024. Wednesday’s verdict is expected to set the stage for upcoming rulings involving Yoon and his other associates who also face rebellion charges. Han, who was appointed by Yoon prime minister, the No. 2 post in South Korea.",
      "publishedAt": "2026-01-21T08:20:48Z",
      "title": "Top ally of South Korea's Yoon given 23 years in prison for rebellion over martial law crisis",
      "url": "https://apnews.com/article/south-korea-rebellion-han-yoon-martial-law-02cd62787fae86f1f86db8b8e6c9b1f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/c077da6/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2Fda%2Fbca450ac3a601d53508528f8b576%2Ff8e2db54582440f18311442651ec8f9c"
    },
    {
      "author": "Joseph Wilson",
      "description": "A 6-year-old girl has survived Sunday's deadly train crash in southern Spain. Her parents, her brother and a cousin were not as fortunate. They were counted among the 42 confirmed deaths from the brutal wreck that has shaken the nation. Relative Juan Barroso confirmed her age to reporters. He said that she was in good health after receiving three stitches in her head at a hospital. The mayor of her village said that the girl was with her grandparents in a hotel in Cordoba, the nearest city to the crash. The mayor called her survival a “miracle.”",
      "publishedAt": "2026-01-20T13:36:23Z",
      "title": "6-year-old girl survived Spain train wreck that killed her family",
      "url": "https://apnews.com/article/spain-train-crash-girl-survivor-andalusia-family-a9eccc716c5ffd4e8023babb067921f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a7b50d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F22%2Ff1e975fe45454e3ad8ed1b756889%2Fb63e8f7df15f4fed89b4a536ee867acf"
    },
    {
      "author": "Steve Karnowski, Alanna Durkin Richer",
      "description": "Confrontations with federal officers over their massive immigration enforcement operation in Minnesota are showing no signs of stopping. Meanwhile, legal battles over the surge and the local response are also intensifying. A person familiar with the matter said Tuesday that federal prosecutors have served six grand jury subpoenas to Minnesota officials, including Gov. Tim Walz. It's part of an investigation into whether they obstructed or impeded federal law enforcement during a sweeping immigration operation in Minneapolis-St. Paul area. The person was not authorized to publicly discuss an ongoing investigation and spoke to The Associated Press on condition of anonymity. Walz has said the Trump administration is not seeking justice, only creating distractions.",
      "publishedAt": "2026-01-21T06:05:09Z",
      "title": "Legal battles over ICE operation in Minnesota intensify",
      "url": "https://apnews.com/article/subpoenas-minnesota-investigation-lawsuit-federal-officers-8693014921e7a240108cb7f58dc56a46",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ef412a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F8f%2Faac50aed8ffa74d6da57d449c080%2F417383c18c734110b2fd517ef1d1b071"
    },
    {
      "author": "Matt Brown",
      "description": "Democrats are rethinking their midterm election strategy due to the controversial immigration crackdown in Minnesota. The killing of an American mother by federal agents has sparked outrage, but the party is divided on how to respond. Some are calling to abolish ICE, echoing \"defund the police\" rhetoric from President Donald Trump's first term. Others are proposing legislation to curb alleged abuse, which activists criticize as insufficient. The party faces pressure to balance immigration issues with core messages on health care and affordability. Republicans, meanwhile, feel confident in their stance on immigration and crime.",
      "publishedAt": "2026-01-21T05:03:57Z",
      "title": "After Minneapolis, Democrats walk tightrope to battle Trump on immigration",
      "url": "https://apnews.com/article/donald-trump-democrats-immigration-minneapolis-1108b6228c0f088aa85d4c6d8ce744ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ce3f27/2147483647/strip/true/crop/5309x2986+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F33%2F57fd3279a98a3f34b2485bd56116%2F143d4d6f5e5e47f3bb052d8d4a4aeb12"
    },
    {
      "author": "Morgan Lee, Savannah Peters",
      "description": "Actor Timothy Busfield has been released from a jail in New Mexico, where he faces charges of child sexual abuse. Attorneys for the actor known for appearances in “The West Wing” and “Field of Dreams” successfully argued during a detention hearing Tuesday that he's not a danger to the community. Prosecutors sought to keep him behind bars, emphasizing the gravity of the charges and what they say is a pattern of sexual misconduct, grooming behavior and abuse of power by Busfield over decades. Busfield is accused of inappropriately touching a minor while working as a director on the set of the TV series “The Cleaning Lady.” Busfield denies the allegations.",
      "publishedAt": "2026-01-20T16:46:37Z",
      "title": "Melissa Gilbert may speak at sex abuse hearing for husband Timothy Busfield",
      "url": "https://apnews.com/article/timothy-busfield-child-sex-abuse-charges-d35a83ab57dc0e7a37c25a92ffc63a11",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6e054f/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2Fd8%2F1cc45c4720d1ba14287eacafb0ea%2Fb0dd0fc3334f4202a6f3e05c18d1837d"
    },
    {
      "author": null,
      "description": "Prime Minister Benjamin Netanyahu of Israel says he's agreed to join Trump’s Board of Peace. Netanyahu made the announcement Wednesday from his office. The announcement came after Israel said the makeup of the Board’s Gaza executive body did not align with Israel’s interests. A statement from Netanyahu’s office said he had accepted Trump’s invitation. The Board of Peace led by U.S. President Donald Trump was originally envisioned as a small group of world leaders overseeing the Gaza ceasefire plan. The Trump administration’s ambitions have ballooned into a more sprawling concept, with Trump extending invitations to dozens of nations and hinting it will soon broker global conflicts, like a pseudo-U.N. Security Council.",
      "publishedAt": "2026-01-21T06:42:13Z",
      "title": "Israel's Netanyahu agrees to join Trump’s Board of Peace",
      "url": "https://apnews.com/article/mideast-wars-gaza-board-of-peace-trump-1-21-2026-2f0e063d03babbd3276f31289ba5f2a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc02f2a/2147483647/strip/true/crop/5473x3079+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F70%2F7e193a65d42a9f6f203fb9c3cc55%2Ff7129cd5a24e4a3e995c2df284e4f9f1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}