{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — After a resounding election victory, delivering what President-elect Donald Trump and Republicans said is a mandate to govern, an uneasy political question is emerging: Will there be any room for dissent in the U.S.",
      "publishedAt": "2024-11-15T05:04:01Z",
      "title": "Trump is already testing Congress and daring Republicans to oppose him",
      "url": "https://apnews.com/59a69fe1758f5fb106d574895c70eba5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c44e1877df24828a22b11cc9451aa0d/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and AMANDA SEITZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump announced Thursday he will nominate anti-vaccine activist Robert F.",
      "publishedAt": "2024-11-14T21:01:26Z",
      "title": "Trump chooses anti-vaccine activist Robert F. Kennedy Jr. as health secretary",
      "url": "https://apnews.com/f40ee2398e3a280c1586eecdd80bdf7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79698a9a2ce44b1998e733077e321b58/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE and DAVID RISING",
      "description": "BEIRUT (AP) — Lebanon’s caretaker prime minister on Friday asked Iran to help secure a cease-fire in the war between Israel and Hezbollah and appeared to urge it to convince the militant group to agree to a deal that could require it to pull back from the Israel-Lebanon border.",
      "publishedAt": "2024-11-15T10:55:42Z",
      "title": "Lebanon's prime minister asks Iran to help secure a cease-fire in Israel-Hezbollah war",
      "url": "https://apnews.com/4659bd568a65da4511852a34f54fbc17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be147bf5c71e4a079278e00f38a559a4/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — Donald Trump's vision for education revolves around a single goal: to rid America’s schools of perceived “ wokeness ” and “left-wing indoctrination.”",
      "publishedAt": "2024-11-15T05:18:35Z",
      "title": "Trump wants to end 'wokeness' in education. He has vowed to use federal money as leverage",
      "url": "https://apnews.com/24f864d83e2f5745d12a79ebac0d7cc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8174c89442fe48ba9308af0ac3df07ba/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN, MATTHEW DALY and COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — Biden administration officials are working against the clock doling out billions in grants and taking other steps to try to preserve at least some of the outgoing president's legacy before President-elect Donald Trump takes office in January.",
      "publishedAt": "2024-11-15T10:01:55Z",
      "title": "The last actions the Biden administration will take before Trump takes over the White House",
      "url": "https://apnews.com/2c27fb2239640fdb667f274215b712fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34e8d9ec20da4b1dae0f4284f3aeac8f/3000.jpeg"
    },
    {
      "author": "RIO YAMAT",
      "description": "LAS VEGAS (AP) — Hundreds of hotel workers at a casino near the Las Vegas Strip went on strike just before dawn Friday after a long and highly publicized fight for a new contract.",
      "publishedAt": "2024-11-15T13:09:20Z",
      "title": "Hundreds of hotel workers go on strike at a casino near the Las Vegas Strip",
      "url": "https://apnews.com/5b31b33e27247f7b9511f71e84d4c940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e421666fddf4a04a2b74ecb1e241d1a/3000.jpeg"
    },
    {
      "author": "MALAK HARB",
      "description": "BEIRUT (AP) — When Sara first arrived at her rescuers' home, she was sick, tired, and was covered in ringworms and signs of abuse all over her little furry body.After spending two months in a small Beirut apartment with an animal rights group, the four-and-half-month-old lion cub arrived Friday at a wildlife sanctuary in South Africa after a long journey on a yacht and planes, escaping both Israeli airstrikes and abusive owners.",
      "publishedAt": "2024-11-15T13:25:29Z",
      "title": "A lion cub evacuated from Lebanon to a South African sanctuary escapes airstrikes and abuse",
      "url": "https://apnews.com/e371d8463f7baab8730896c69e60094a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9923765d8cd14dda91224e185240b7d6/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Volcanoes were erupting on the mysterious far side of the moon billions of years ago just like on the side that we can see, new research confirms. Researchers analyzed lunar soil brought back by China's Chang'e-6, the first spacecraft to return with a haul of rocks and dirt from the little-explored far side.",
      "publishedAt": "2024-11-15T10:05:36Z",
      "title": "The far side of the moon once had erupting volcanoes too",
      "url": "https://apnews.com/5ac2d80e9f715f728f8c3be2caf56797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de20e90ebff34063b61da79a44ab7c70/1280.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and SIBI ARASU",
      "description": "BAKU, Azerbaijan (AP) — Good or bad, the United Nations climate negotiations process itself became the focus of the international talks that aim to curb warming from coal, oil and natural gas.Environmental advocates released reports Friday decrying fossil fuel industry influence at the climate talks called COP29.",
      "publishedAt": "2024-11-15T06:46:42Z",
      "title": "Frustration grows at fossil fuel influence and structure of UN climate talks. Some call for reform",
      "url": "https://apnews.com/c29d2993a94ff16507a6d3a1560411ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/559f9d2064584274bb2568884c02a948/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Country comes naturally to Ringo Starr.It's been a low-key part of his of his career since his Beatle beginnings, so it was not a serious swerve for him to make a whole country album, the forthcoming “Look Up,” a collaboration with the modern maestro of classic country and Americana, T Bone Burnett.",
      "publishedAt": "2024-11-15T14:36:37Z",
      "title": "Ringo goes country, again. The ex-Beatle mixes peace and love with twang and heartache on new album",
      "url": "https://apnews.com/d0464925c2ca176d532a2b1faa7d1888",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e75a0273bc640418ae0541042f9d831/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}