{
  "articles": [
    {
      "author": null,
      "description": "BATON ROUGE, La. (AP) — Louisiana Legislature votes to make abortion pills controlled dangerous substances under first-of-its-kind measure.",
      "publishedAt": "2024-05-23T17:32:26Z",
      "title": "Louisiana Legislature votes to make abortion pills controlled dangerous substances under first-of-its-kind measure",
      "url": "https://apnews.com/9c4744d658a4aa0c45be5d4b513615c9",
      "urlToImage": ""
    },
    {
      "author": "TARA COPP and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The United States is expected to announce an additional $275 million in military aid for Ukraine on Friday as Kyiv struggles to hold off advances by Russian troops in the Kharkiv region, two U.S.",
      "publishedAt": "2024-05-23T13:44:40Z",
      "title": "US will announce $275 million more in artillery and ammunition for Ukraine, officials say",
      "url": "https://apnews.com/cdbbdbd05c38741b934cc5e63a1bc39c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1d6958cbded474bae770fed468886a9/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran interred President Ebrahim Raisi at the nation's holiest Shiite shrine Thursday, days after he was killed in a helicopter crash that added to the woes of a country already beset by international sanctions, internal unrest and tensions abroad.",
      "publishedAt": "2024-05-23T05:45:50Z",
      "title": "Iran inters its late president at holiest Shiite site in nation after fatal helicopter crash",
      "url": "https://apnews.com/aa975288bab8a63af93c8c5f9a31a615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45c9fdb865fe45569523e11d55bf2c6c/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Diminished but not deterred, Hamas is still putting up a fight after seven brutal months of war with Israel, regrouping in some of the hardest-hit areas in northern Gaza and resuming rocket attacks into nearby Israeli communities.",
      "publishedAt": "2024-05-23T08:10:37Z",
      "title": "How does this end? With Hamas holding firm and fighting back in Gaza, Israel faces only bad options",
      "url": "https://apnews.com/0fcb4e20821ba8c0e49edf6571486d3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f01efd2f3ccb4f1988a94c1fad8a4b08/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and WYATTE GRANTHAM-PHILIPS",
      "description": "WASHINGTON (AP) — The Justice Department filed a sweeping antitrust lawsuit against Ticketmaster and parent company Live Nation Entertainment on Thursday, accusing them of running an illegal monopoly over live events in America — squelching competition and driving up prices for fans.",
      "publishedAt": "2024-05-23T14:31:26Z",
      "title": "Justice Department says illegal monopoly by Ticketmaster and Live Nation drives up prices for fans",
      "url": "https://apnews.com/df9b552d127e1494db13e3cd625787a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1db08b5f038746709f5e67be36b6de6b/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Senate Democrats are trying for a second time to push ahead with a bill to clamp down the number of migrants allowed to claim asylum at the U.S.-Mexico border as Senate Majority Leader Chuck Schumer sought on Thursday to underscore Republican resistance to the proposal.",
      "publishedAt": "2024-05-23T16:02:47Z",
      "title": "Senate holds a test vote on border bill as Democrats seek to underscore Republican resistance",
      "url": "https://apnews.com/924f48912eecf1dc544dc648d757c3fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6e8c3e377624459a635a842e48723c1/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and BARBARA ORTUTAY",
      "description": "President Joe Biden's administration is pushing the tech industry and financial institutions to shut down a growing market of abusive sexual images made with artificial intelligence technology.New generative AI tools have made it easy to transform someone's likeness into a sexually explicit AI deepfake and share those realistic images across chatrooms or social media.",
      "publishedAt": "2024-05-23T13:09:31Z",
      "title": "White House pushes tech industry to shut down market for sexually abusive AI deepfakes",
      "url": "https://apnews.com/c76c46b48e872cf79ded5430e098e65b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc2cc2651cf54206ad4cd595fc471970/2000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Britain’s political party leaders crisscrossed the country on Thursday, kicking off a six-week election campaign in which Prime Minister Rishi Sunak's Conservative Party is trying to overturn a widespread sense that it will be ousted from power.",
      "publishedAt": "2024-05-23T08:00:47Z",
      "title": "UK politicians kick off a 6-week election campaign with incumbent Sunak playing the underdog",
      "url": "https://apnews.com/554b4cfb26df92437fdbb2b6d96853ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c146238f4464204bd16fc1a30970793/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "WASHINGTON (AP) — House Republicans have summoned the leaders of Northwestern University and Rutgers University to testify about concessions they gave to pro-Palestinian protesters to end demonstrations on their campus.",
      "publishedAt": "2024-05-23T04:07:44Z",
      "title": "Leaders of Northwestern, UCLA and Rutgers to testify before Congress on campus protests",
      "url": "https://apnews.com/41cd2b843999523bccc927004b13d5e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46ca60402f3a4ab99178670c1a6351c9/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump will campaign in one of the most Democratic counties in the nation Thursday, holding a rally in the South Bronx to woo minority voters days before a Manhattan jury will begin deliberations on whether to convict him of felony charges in his criminal hush money trial.",
      "publishedAt": "2024-05-23T04:14:19Z",
      "title": "Trump is holding a rally in the South Bronx as he tries to woo Black and Hispanic voters",
      "url": "https://apnews.com/00fae754f78333111c508d6e740a3610",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e16f7aa079144f599b59c0dc0f34283f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}