{
  "articles": [
    {
      "author": null,
      "description": "Israeli Defense Minister Israel Katz said that Iran had “completely violated” the ceasefire between Israel and Iran by launching missiles after the ceasefire came into effect. Katz said he instructed the Israeli military to resume targeting Iranian paramilitary and government targets. Israel said it had identified missiles launched from Iran into its airspace less than three hours after the ceasefire went into effect, after both Israel and Iran accepted President Donald Trump’s plan to end the 12-day war roiling the Middle East.",
      "publishedAt": "2025-06-24T05:46:42Z",
      "title": "Trump ceasefire plan falters as Israel says Iran launched more missiles and pledges response",
      "url": "https://apnews.com/article/israel-iran-trump-ceasefire-attacks-continue-f1e60190722cc3410b69f21717872ffa",
      "urlToImage": "https://dims.apnews.com/dims4/default/883d6ad/2147483647/strip/true/crop/4408x2480+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F02%2F7f93c3434f16a04bb8a2b8ad24c8%2F25611577134a49829bf7e621833531b1"
    },
    {
      "author": null,
      "description": "A new U.S. intelligence report finds that Iran’s nuclear program has been set back only a few months after U.S. strikes, not totally destroyed as President Donald Trump has said. That's according to two people familiar with the early assessment. The people were not authorized to address the matter publicly and spoke on condition of anonymity. The report found that while the Saturday strikes at the Fordo, Natanz and Isfahan nuclear sites did significant damage, they were not “completely and totally obliterated,” as Trump said. The White House strongly pushed back on the assessment, calling it “flat-out wrong.”",
      "publishedAt": "2025-06-24T20:52:45Z",
      "title": "US strikes only set back Iran’s nuclear program by months, report says",
      "url": "https://apnews.com/article/iran-nuclear-program-military-strikes-trump-f0fc085a2605e7da3e2f47ff9ac0e01d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3143ad8/2147483647/strip/true/crop/6220x3499+0+795/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Fc5%2Fd4e20aac7d56c645707ccf4d65aa%2F6d47ede2e97e457dbd0d5c6a384f97c1"
    },
    {
      "author": null,
      "description": "Palestinian witnesses say Israeli forces and drones opened fire toward hundreds of people waiting for aid trucks in central Gaza. Hospitals say at least 25 people were killed and more than 140 wounded. Israel's military says it was reviewing reports of casualties from Israeli fire after a group of people approached troops. The Awda hospital in the Nuseirat camp, which received the victims, says the Palestinians were waiting for the trucks on a road south of Wadi Gaza. Witnesses have told The Associated Press that Israeli forces opened fire as people were advancing closer. One man says fire from drones and gunfire from tanks came at people, “even as we were fleeing.” Another says drones flew over the crowds first, then there was fire from tanks and drones as people moved eastward.",
      "publishedAt": "2025-06-24T06:50:32Z",
      "title": "25 killed by Israeli forces while waiting on aid trucks in Gaza, Palestinians say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-06-24-2025-dbbdba6c1986376e6e09900650814412",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f62991/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fc2%2F2e961ad9d37967374839c8107f45%2F84d5917ece7d48e2875d1c5c77690aed"
    },
    {
      "author": null,
      "description": "The temperature in New York City have reached 100 degrees as the eastern U.S. sweltered under an extreme heat wave. According to the National Weather Service, Kennedy International Airport recorded 100 degrees Fahrenheit at midday Tuesday. Large swaths of the country were broiling under a heat dome, worsened by a humid atmosphere that’s circling the East. After nearly 40 US cities broke record high marks Monday, the weather service expected dozens of records Tuesday when the heat dome should hit its peak.",
      "publishedAt": "2025-06-24T16:50:34Z",
      "title": "Temperature in New York City reaches 100 degrees as eastern US swelters under extreme heat wave",
      "url": "https://apnews.com/article/extreme-heat-new-york-city-fc6f3e60a868b5a5f615e3408c0d05fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e004885/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F92%2F413fd72d7be8471155879d9522c6%2F3ab0d225c27a4f45a941861aa6426625"
    },
    {
      "author": null,
      "description": "The prosecution has rested in Sean “Diddy” Combs’ sex trafficking trial after more than six weeks of testimony from 34 witnesses, capping a six-week-long presentation of evidence against the hip-hop maven. The move on Tuesday came after defense lawyer Teny Geragos finished questioning the government’s final witness: Joseph Cerciello, a Homeland Security Investigations agent. Prosecutors have cited the “freak offs” as proof of sex trafficking and racketeering conspiracy. Defense lawyers say they were consensual sexual encounters in the swingers lifestyle. Combs has pleaded not guilty.",
      "publishedAt": "2025-06-24T17:24:19Z",
      "title": "Prosecution rests in Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-231655958c4cec9631f71dadc4a726b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/49c8828/2147483647/strip/true/crop/3500x1969+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Ffa%2Fcb91befbffaec71c35c0db2b9110%2F861b9855cfc147318e1ce97221df5f5b"
    },
    {
      "author": null,
      "description": "World leaders are gathering in the Netherlands for the start of a historic two-day NATO summit that could unite the world’s biggest security organization around a new defense spending pledge or widen divisions among the 32 allies. The allies are expected to endorse a goal of spending 5% of their gross domestic product on their security, to be able to fulfil the alliance’s plans for defending against outside attack. Ukrainian President Volodymyr Zelenskyy arrived in The Hague for a series of meetings, despite his absence from a leaders’ meeting aiming to seal the agreement to boost military spending.",
      "publishedAt": "2025-06-24T08:00:40Z",
      "title": "World leaders gather for historic NATO summit with unity on the line",
      "url": "https://apnews.com/article/nato-ukraine-zelenskyy-trump-iran-israel-rutte-1cdf87daa23ac024ae050fed9b7b8c49",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9f34c5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F5a%2F65745481e9d3808f140ac61d8f00%2F1f44f0bbda1f406faf85689d47ed2f6f"
    },
    {
      "author": null,
      "description": "A Washington man charged with aiding the bomber of a fertility clinic in California has died after he was found unresponsive in federal custody. Daniel Park was arrested earlier this month after he was extradited from Poland, where he fled to four days after the attack. The 32-year-old Park was accused of supplying chemicals to Guy Edward Bartkus of California, the bomber, who died in the May 17 explosion. Prison officials say Park, of suburban Seattle, was found unresponsive in the Metropolitan Detention Center in Los Angeles on Tuesday morning and was pronounced dead at the hospital. No cause of death has been provided.",
      "publishedAt": "2025-06-24T19:52:52Z",
      "title": "Man charged in California fertility clinic bombing dies in custody",
      "url": "https://apnews.com/article/california-explosion-daniel-park-4188bcc40df88e1d3c81101940409348",
      "urlToImage": "https://dims.apnews.com/dims4/default/85f0870/2147483647/strip/true/crop/3163x1779+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F43%2F20f64cc84d894087c6516e1d2fc7%2F6959a3f31681429e8aaaf7e8ff02d238"
    },
    {
      "author": null,
      "description": "Stock markets have rallied and oil prices fell after U.S. President Donald Trump announced what appears to be a shaky ceasefire in the Israel-Iran conflict. Oil prices declined on hopes that the potential threat to the global flow of crude may have abated, even after the U.S. carried out strikes on Iranian nuclear sites. A barrel of benchmark U.S. oil dropped about 3% early Tuesday and more than 7% on Monday after briefly topping $78 Sunday night. On Monday, the S&P 500 rose 1%, the Dow Jones Industrial Average added 0.9% and the Nasdaq composite also gained 0.9%. Treasury yields fell.",
      "publishedAt": "2025-06-24T03:52:04Z",
      "title": "World shares rally after Trump announces what appears to be a shaky Israeli-Iran ceasefire",
      "url": "https://apnews.com/article/stocks-markets-oil-iran-tariffs-rates-d5713bc60bcc433702b215076d2d35fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5f36e6/2147483647/strip/true/crop/8933x5025+0+465/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2Ffb%2F10b504747709550abdc5d146ae7d%2Fdb4bd83ec68049e6a3690b3bda142bb6"
    },
    {
      "author": null,
      "description": "A Texas law promoting the Trump administration’s “Make America Healthy Again” agenda requires first-ever warning labels on certain foods like chips and candies. It also mispresents the status of some ingredients that would trigger the action. The law signed by Republican Gov. Greg Abbott requires foods made with any of over 40 dyes and additives to have labels starting in 2027 saying they contain ingredients “not recommended for human consumption” in Australia, Canada, the European Union or the U.K. But at least a dozen of the targeted additives are authorized in those countries — or are already restricted in the U.S.",
      "publishedAt": "2025-06-24T13:45:17Z",
      "title": "Texas food warning labels fact check: State's additives list has inaccuracies",
      "url": "https://apnews.com/article/texas-food-label-additives-warning-481258c546e6f123b90771c6168ca32e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0a79a19/2147483647/strip/true/crop/4463x2510+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fff%2Fc8ed98dc7db5a0ddbe9152b2e7fc%2Fa3c5f213e6844ec6836225370a6cb9dc"
    },
    {
      "author": null,
      "description": "Former teen idol Bobby Sherman has died at 81. His winsome smile and fashionable shaggy mop top helped make him into a star in the 1960s and ’70s with bubblegum pop like “Little Woman” and “Julie, Do Ya Love Me.” His wife, Brigitte Poublon, announced the death Tuesday and family friend John Stamos posted her message on Instagram. Sherman revealed he had Stage 4 cancer earlier this year. After the limelight moved on, Sherman became a certified medical emergency technician and instructor for the Los Angeles Police Department, teaching police recruits first aid and CPR. He donated his salary.",
      "publishedAt": "2025-06-24T17:49:23Z",
      "title": "Bobby Sherman, teen idol in the 1960s and '70s, dies at 81",
      "url": "https://apnews.com/article/bobby-sherman-dies-d4cbbcc4bac0697754e82dde6afe155a",
      "urlToImage": "https://dims.apnews.com/dims4/default/c723b20/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F76%2F30e39db37a7a837af8952b864e05%2Fbf2082f69c1a4a6682006b7adee83c15"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}