{
  "articles": [
    {
      "author": "RAF CASERT, LORNE COOK and SAMUEL PETREQUIN",
      "description": "BRUSSELS (AP) — Far-right parties rattled the traditional powers in the European Union and made major gains in parliamentary elections Sunday, dealing an especially humiliating defeat to French President Emmanuel Macron.",
      "publishedAt": "2024-06-09T04:02:15Z",
      "title": "Far-right gains in the EU election deal stunning defeats to France's Macron and Germany's Scholz",
      "url": "https://apnews.com/0fbfcb7bd987008e802d70f759fa870b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e7b8283f40340f7ac6f62eb45cb10b9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Far-right parties made big gains in the European Parliament in election results that rattled the traditional powers and made French President Emanuel Macron call snap legislative elections.",
      "publishedAt": "2024-06-09T07:35:41Z",
      "title": "The Latest | Election shifts the European Parliament further right",
      "url": "https://apnews.com/d66061efe90a5b3d1762d3ddfade0491",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8aff9a1c561482bb62f72c8bf0578f2/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel's dramatic weekend rescue of four hostages from deep inside an urban area of the Gaza Strip came at a sensitive time in the 8-month-old war, as Israel and Hamas weigh a U.S.",
      "publishedAt": "2024-06-10T05:17:29Z",
      "title": "A look at the prospects for a cease-fire deal after Israel rescued 4 hostages from Hamas captivity",
      "url": "https://apnews.com/0faafb8a1b0e4f0050dd20efc81e937d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a27201022c1423b95c7d17c1dd6d99f/787.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Benny Gantz, a centrist member of Israel’s three-man war Cabinet, announced his resignation Sunday, accusing Prime Minister Benjamin Netanyahu of mismanaging the war effort and putting his own “political survival” over the country's security needs.",
      "publishedAt": "2024-06-09T17:48:53Z",
      "title": "Centrist Benny Gantz is quitting Israel's war Cabinet, citing frustrations with Netanyahu",
      "url": "https://apnews.com/48a4a60ccccdb7f74b4bf7816f9a7c67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4efae52ce8d43eea967a89d5edc286d/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, RANDALL CHASE and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — The criminal trial of President Joe Biden's son heads into its final stretch Monday as the defense tries to chip away at prosecutors' case laying bare some of the darkest moments of Hunter Biden's drug-fueled past.",
      "publishedAt": "2024-06-10T04:21:11Z",
      "title": "Hunter Biden's gun trial enters its final stretch after deeply personal testimony about his drug use",
      "url": "https://apnews.com/774dd2f5661b246085c7409139dedaef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899311c8db69476eafcd5938b7bfcbfe/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and PETER SMITH",
      "description": "INDIANAPOLIS (AP) — Donald Trump on Monday will address a Christian group that calls for abortion to be “eradicated entirely,\" as the presumptive Republican nominee again takes on an issue that Democrats want to make a focus of this year's presidential election.",
      "publishedAt": "2024-06-10T04:35:40Z",
      "title": "Trump will speak to a Christian group that calls for abortion to be 'eradicated entirely'",
      "url": "https://apnews.com/13318983232798e44e9638a33811f844",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/661620918c6840bca9edba1cfbe3cf6e/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "SCHURZ, Nevada (AP) — Members of the Walker River Paiute Tribe have watched the boundaries of their land recede over time along with the waters of the lake that are central to their identity, threatening the cultural symbol that gave the tribe its name — Agai Dicutta, or Trout Eaters.",
      "publishedAt": "2024-06-10T04:24:03Z",
      "title": "Nevada has a plan to expand electronic voting. That concerns election security experts",
      "url": "https://apnews.com/ea74f2fdbf58c84f38fc80603d1db46e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a47e3fec62343eb9433e8fb8b169365/3000.jpeg"
    },
    {
      "author": "MARIAM FAM",
      "description": "Once a year, Muslim pilgrims flowing into Saudi Arabia unite in a series of religious rituals and acts of worship as they perform the Hajj, one of the pillars of Islam. As they fulfill a religious obligation, they immerse themselves in what can be a spiritual experience of a lifetime for them and a chance to seek God's forgiveness and the erasure of past sins.",
      "publishedAt": "2024-06-10T05:10:42Z",
      "title": "What's Hajj, the Islamic pilgrimage, and why is it significant for Muslims?",
      "url": "https://apnews.com/b7fef33d791a15a21193e696c0fe8cc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fbd3eabf6b344c8b7573a577fed87c8/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "VINEYARD HAVEN, Mass. (AP) — An 81-year-old woman on Martha's Vineyard drove up to the Island Time dispensary last week seeking her usual order of pot. But owner Geoff Rose had to tell her the cupboard was bare — he'd been forced to temporarily close three weeks earlier after selling every last bud and gummy.",
      "publishedAt": "2024-06-10T04:16:11Z",
      "title": "Martha's Vineyard is about to run out of pot. That's led to a lawsuit and a scramble by regulators",
      "url": "https://apnews.com/f59e9907f9d523c7eb60bd6c109cd12c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebdc2bf227b14c72a7515e2e6950d95c/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "Apple's annual World Wide Developers Conference on Monday is expected to herald the company's move into generative artificial intelligence, marking its late arrival to a technological frontier that's expected to be as revolutionary as the invention of the iPhone.",
      "publishedAt": "2024-06-10T04:08:47Z",
      "title": "Apple expected to enter AI race with ambitions to overtake the early leaders",
      "url": "https://apnews.com/4217d67977f95ead880835a71ecce098",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}