{
  "articles": [
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers who document such remarks for posterity, according to two U.S.",
      "publishedAt": "2024-11-01T01:33:59Z",
      "title": "AP sources: White House altered record of Biden's 'garbage' remarks despite stenographer concerns",
      "url": "https://apnews.com/326e2f516a94a470a423011a946b6252",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53901cead5554d55a03b426693981c22/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "PHOENIX (AP) — Kamala Harris said Thursday that Donald Trump’s comment that he would protect women whether they “like it or not” shows that the Republican presidential nominee does not understand women’s rights “to make decisions about their own lives, including their own bodies.\"",
      "publishedAt": "2024-10-31T15:48:42Z",
      "title": "Kamala Harris says Trump's comment on women 'is offensive to everybody'",
      "url": "https://apnews.com/f5903d49488ebc733d7ba5812b36f935",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0fff418c1014d9e81ee5cb9fb2e2dff/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — Donald Trump is traveling to New Mexico and Virginia in the campaign's final days, taking a risky detour from the seven battleground states to spend time in places where Republican presidential candidates have not won in decades.",
      "publishedAt": "2024-10-31T12:22:34Z",
      "title": "Donald Trump gambles with late-stage trips to Democratic New Mexico and Virginia",
      "url": "https://apnews.com/55502679ef9df70306d10e0a431a3d69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b76a3469f7146ad86606d6784f2a182/1375.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Donald Trump is set to visit Dearborn, Michigan — the nation’s largest Arab-majority city — on Friday, according to a local business owner who first insisted the former president call for peace in Lebanon before hosting him.",
      "publishedAt": "2024-10-31T23:19:52Z",
      "title": "Trump will become first major 2024 candidate to visit majority-Arab Dearborn, Michigan",
      "url": "https://apnews.com/e5209f39724d17c500d5ae3d5e4fc830",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60db0598300b4c02b511e3b1f8204028/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — Protesters can create awkward moments for presidential candidates. They interrupt, heckle and, oftentimes, knock a candidate off track.But Vice President Kamala Harris is trying a new strategy late in the campaign to turn what would otherwise be awkward interactions into moments of energy used to rally her supporters and subtly drive her message against her Republican opponent, Donald Trump.",
      "publishedAt": "2024-10-31T20:12:08Z",
      "title": "Harris tries to turn Gaza protests into a way to energize the crowds at her rallies",
      "url": "https://apnews.com/d6aac06c7492bd4c93c567d70aaba38e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83aa376cfba6498a8e6859aadfb81538/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN, JULIA FRANKEL and FADI TAWIL",
      "description": "TEL AVIV, Israel (AP) — Rocket barrages from Lebanon into northern Israel killed four foreign workers and three Israelis on Thursday, Israeli medics said, the deadliest cross-border strikes in Israel since it invaded Lebanon.",
      "publishedAt": "2024-10-31T11:51:27Z",
      "title": "Rocket fire from Lebanon kills 7 in Israel as US officials try to push for cease-fires",
      "url": "https://apnews.com/5554f469d1ac348c8da19b7faa3e5fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19196d0ae6b84de48485a109f688367b/1920.jpeg"
    },
    {
      "author": "DIDI TANG and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The U.S. and South Korea have called on China to use its influence over Russia and North Korea to prevent escalation after Pyongyang sent thousands of troops to Russia to aid Moscow's war against Ukraine.",
      "publishedAt": "2024-10-31T21:53:53Z",
      "title": "US calls on a silent China to use its sway over Russia and North Korea",
      "url": "https://apnews.com/0d28afb21d3afbdbb3cb9c29a945c3f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f4c67b670b4480b5ee330c63f07855/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea on Friday bragged of its recently tested new intercontinental ballistic missile, calling it “the world’s strongest,” a claim viewed by outside experts as propaganda though the test showed an advancement in the North's quest to build a more reliable weapons arsenal.",
      "publishedAt": "2024-11-01T00:26:35Z",
      "title": "North Korea boasts of its new long-range missile targeting the US",
      "url": "https://apnews.com/4173ce128b8336b2cb315a3bf62c6980",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3a3bd250d8447d7980520d227df2e09/3000.jpeg"
    },
    {
      "author": "ALBERTO SAIZ, JOSEPH WILSON and ALICIA LEÓN",
      "description": "BARRIO DE LA TORRE, Spain (AP) — Crews searched for bodies in stranded cars and sodden buildings Thursday as residents salvaged what they could from their ruined homes following monstrous flash floods in Spain that claimed at least 158 lives, with 155 deaths confirmed in the eastern Valencia region alone.",
      "publishedAt": "2024-10-31T08:18:41Z",
      "title": "Spain searches for bodies after unprecedented flooding claims at least 158 lives",
      "url": "https://apnews.com/30c6ef59ddf27598c691c89d0ba41442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a00382b5abe465ea7b7405cc74e74f6/1920.jpeg"
    },
    {
      "author": "JAIMIE DING",
      "description": "LOS ANGELES (AP) — Los Angeles County is taking on Pepsi and Coke for their role in plastic pollution.",
      "publishedAt": "2024-10-31T21:34:48Z",
      "title": "Los Angeles County sues Pepsi and Coca-Cola over plastic bottles",
      "url": "https://apnews.com/c326225a08b2a2778afdd27d3db2d628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86fd4e92e24a4961ace931ce2189fed1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}