{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and BASSEM MROUE",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Hamas agreed to release 13 Israelis and seven foreigners late Saturday in exchange for 39 Palestinians imprisoned by Israel, Qatari and Egyptian mediators said, after the militant group delayed the second round of swaps for several hours and claimed that Israel had violated the terms of a truce deal.",
      "publishedAt": "2023-11-25T07:24:36Z",
      "title": "Hamas to release 13 Israelis, 7 foreigners for 39 Palestinians after hours-long snag, mediators say",
      "url": "https://apnews.com/7d83895eb736c09fab3eada4c31524b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecea10c927c04b5eacc5653e50a5786b/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A container ship owned by an Israeli billionaire came under attack by a suspected Iranian drone in the Indian Ocean as Israel wages war on Hamas in the Gaza Strip, an American defense official said Saturday.",
      "publishedAt": "2023-11-25T08:08:40Z",
      "title": "An Israeli-owned ship was targeted in suspected Iranian attack in Indian Ocean, US official tells AP",
      "url": "https://apnews.com/39929cae42a191b2f242896a053123a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52f333bfd302473db051683447ade5f0/3000.jpeg"
    },
    {
      "author": "DAVID R. MARTIN and MICHAEL CASEY",
      "description": "ELMSFORD, N.Y. (AP) — When Sean Rafferty got his start in the grocery business, anything that wasn't sold got tossed out.But on a recent day, Rafferty, the store manager for ShopRite of Elmsford-Greenburgh in New York, was preparing boxes of bread, donuts, fresh produce and dairy products to be picked up by a food bank.",
      "publishedAt": "2023-11-25T05:08:52Z",
      "title": "Tackling climate change and alleviating hunger: States recycle and donate food headed to landfills",
      "url": "https://apnews.com/886b14d62a6b1d2961c94815630d4376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8550d9dbf56a41b8b65a61a9fcfac5ac/1920.jpeg"
    },
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump is using a college football rivalry weekend to bask among his supporters in a state and region that are key to his presidential fortunes, while potentially upstaging his Republican opponent Nikki Haley on her home turf.",
      "publishedAt": "2023-11-25T05:03:54Z",
      "title": "Donald Trump will look to upstage Clemson grad Nikki Haley at her alma mater's football rivalry game",
      "url": "https://apnews.com/62ca25d5ad44bb8f1fb352805b3bcd2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce55c304e7b47d18028a165bdcfd09a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russia on Saturday morning launched its most intense drone attack on Ukraine since the beginning of its full-scale invasion in 2022, targeting the Ukrainian capital, military officials said.",
      "publishedAt": "2023-11-25T08:40:10Z",
      "title": "Ukraine's military says Russia launched its largest drone attack since the start of the invasion",
      "url": "https://apnews.com/ad3eef50f980a4df023fad78d7bc197d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04702d1b3a724115a30a5d19e6769f0b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — As war and winter collide, a top adviser to Ukrainian President Volodymyr Zelenskyy acknowledged during a recent visit to Washington that the days ahead “will be tough” as his country battles Russia while U.S.",
      "publishedAt": "2023-11-25T13:29:32Z",
      "title": "The debate over Ukraine aid was already complicated. Then it became tangled up in US border security",
      "url": "https://apnews.com/8592ddcb1627fc6d0b43349bac3fe329",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cc94cfcd880455498aec05115c7b1d2/3000.jpeg"
    },
    {
      "author": null,
      "description": "ROME (AP) — Pope Francis went to the hospital Saturday for tests after he came down with the flu, but the results ruled out any respiratory problems, the Vatican said.Francis, who had part of one lung removed as a young man, underwent a CAT scan, Vatican spokesman Matteo Bruni said.",
      "publishedAt": "2023-11-25T09:18:16Z",
      "title": "Pope Francis has a hospital checkup after coming down with the flu",
      "url": "https://apnews.com/600fd34afaa58bbe2447546c3a0deaeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05c46bf04b13492fb081bd3238f88e07/3000.jpeg"
    },
    {
      "author": "GIOVANNA DELL’ORTO",
      "description": "ST. PAUL, Minn. (AP) — For the annual fall renewal of her shaman spirit, Mee Vang Yang will soon ritually redecorate the tall altar in her living room where she keeps her father’s ring-shaped shaman bells.",
      "publishedAt": "2023-11-25T15:35:54Z",
      "title": "In the US, Hmong 'new year' recalls ancestral spirits while teaching traditions to new generations",
      "url": "https://apnews.com/e4bc9026b7840919d86e97d7d4fa1a77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb26d218e6a40418a35002fd1609ab0/3000.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "The negative impact on the climate from passenger vehicles, which is considerable, could have dropped by more than 30% over the past decade if not for the world's appetite for large cars, a new report from the Global Fuel Economy Initiative suggests.",
      "publishedAt": "2023-11-25T13:42:48Z",
      "title": "Buyers worldwide go for bigger cars, erasing gains from cleaner tech. EVs would help",
      "url": "https://apnews.com/56128f2121a77063f9c47803def36b76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7d57880fb004f2687d57d9eef072a42/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona, a person familiar with the matter told The Associated Press.",
      "publishedAt": "2023-11-25T01:54:52Z",
      "title": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says",
      "url": "https://apnews.com/f24cde6aa28877d034530c2dc40ef7ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}