{
  "articles": [
    {
      "author": "Collin Binkley, Ben Finley",
      "description": "Jeanine Pirro, the U.S. attorney for the District of Columbia, has announced upgraded charges against a man accused of shooting two National Guard members. The charges are now first-degree murder after the death of Specialist Sarah Beckstrom. Beckstrom, 20, and Staff Sgt. Andrew Wolfe, 24, were critically injured in Wednesday's shooting. President Donald Trump announced Thursday evening that Beckstrom had died. Authorities say Rahmanullah Lakanwal drove across the country to carry out an “ambush-style” attack. Pirro mentioned it's too soon to determine the suspect’s motives.",
      "publishedAt": "2025-11-28T15:24:40Z",
      "title": "US attorney upgrades charges to first-degree murder in DC National Guard case",
      "url": "https://apnews.com/article/national-guard-shooting-suspect-585e36855d1dddd3e801708987c776c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac8d901/2147483647/strip/true/crop/6016x3384+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Fff%2Fde6522d2a6446a80c378a6ed4d1c%2F2d71e74e9e0c4b28b292a3e23653e0b3"
    },
    {
      "author": "Jeffrey Collins",
      "description": "The man accused of shooting two National Guard members in Washington is one of about 76,000 Afghans brought to the U.S. after the chaotic withdrawal from Afghanistan. The program, called Operation Allies Welcome, was created in 2021. Then-President Joe Biden said the U.S. owed it to those who opposed the Taliban to provide a safe haven. Critics argued the resettlement process was poorly planned. The accused shooter, Rahmanullah Lakanwal, worked with the CIA in Afghanistan. Resettlement groups emphasize that one individual's actions shouldn't reflect on all Afghan refugees.",
      "publishedAt": "2025-11-27T18:26:44Z",
      "title": "National Guard shooting brings scrutiny to Afghan refugee program",
      "url": "https://apnews.com/article/national-guard-shooting-afghan-operation-allies-welcome-b11c48fb0b807e8f519c266e2a004d8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fa410b/2147483647/strip/true/crop/5150x2897+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Ff5%2F1c6358ebb67451b9633688213926%2F749928fe84d14881927846625b9a8316"
    },
    {
      "author": "David Rising, Chan Ho-him",
      "description": "Hong Kong firefighters have found dozens more bodies during an intensive search of a high-rise complex after a massive fire engulfed seven of its eight buildings. The death toll has risen to at least 128 people, making it one of the city's deadliest blazes. Crews prioritized apartments from which they received calls for assistance during the blaze. The fire started midafternoon Wednesday and took firefighters about 24 hours to control. Authorities suspect some materials on the exterior walls did not meet fire resistance standards. Three men have been arrested on suspicion of manslaughter.",
      "publishedAt": "2025-11-28T02:44:06Z",
      "title": "Death toll rises to 128 as Hong Kong firefighters search fire-ravaged towers",
      "url": "https://apnews.com/article/hong-kong-tai-po-wang-fuk-court-fire-a84627d7f3ee62050c36a9aa3218205c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ad8bb6/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2Fd0%2Fde00c8daa169853066aafbef0acf%2F760b12e36e5b4c0ca6a05cc58835a256"
    },
    {
      "author": "Andrew Wilks, Suzan Fraser",
      "description": "Turkish Transport Minister Abdulkadir Uraloglu says two oil tankers said to be part of Russia’s “shadow fleet” may have been hit by mines, drones or missiles. Tankers Kairos and Virat were struck in quick succession and set ablaze off Turkey’s Black Sea coast, prompting rescue operations. Crew members on board both vessels were reported to be safe. Uraloglu told broadcaster NTV early Saturday that explosions were caused by “external interference,” indicating ”a mine, a missile, a marine vessel, or a drone.\" The OpenSanctions database describes the vessels as part of a fleet used to evade sanctions imposed on Russia following its 2022 invasion of Ukraine.",
      "publishedAt": "2025-11-29T06:43:05Z",
      "title": "Turkish official says Black Sea tankers may have been hit by mines, missiles or drones",
      "url": "https://apnews.com/article/tankers-russia-sanctions-shadow-fleet-mines-drones-black-sea-76dce005c40a0bf38faf2fbf8be71e38",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV is visiting Istanbul’s Blue Mosque. The head of Turkey’s Diyanet religious affairs directorate showed Leo the soaring blue tiled dome of the mosque and the Arabic inscriptions on its columns. The Vatican said Leo would observe a “brief minute of silent prayer.” The visit kicked off an intense day of meetings and liturgies with Turkey’s religious leaders, with a Catholic Mass scheduled for the late afternoon. After the mosque visit, Leo held a private meeting scheduled with Turkey’s Christian leaders at the Syriac Orthodox Church of Mor Ephrem.",
      "publishedAt": "2025-11-29T06:57:11Z",
      "title": "Pope visits Istanbul's Blue Mosque at start of day of meetings with Turkey's religious leaders",
      "url": "https://apnews.com/article/pope-leo-turkey-visit-blue-mosque-christian-0774b9b59eb773a535e01390e2efe6eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4faa7d/2147483647/strip/true/crop/7557x4251+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Fb9%2F3dee1923db38816da3da05bbc0bf%2F192d46cf38304eb5a4fb47eb747147e0"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump said Friday that he will be pardoning former Honduran President Juan Orlando Hernandez, who in 2024 was convicted for drug trafficking and weapons charges and sentenced to 45 years in prison. The president explained his decision on social media by posting that “according to many people that I greatly respect,” Hernandez was “treated very harshly and unfairly.” Hernandez had been convicted last year in the U.S. of conspiring to import cocaine and two weapons counts. He had served two terms as the leader of the Central American nation of roughly 10 million people.",
      "publishedAt": "2025-11-28T21:34:18Z",
      "title": "Trump says he plans to pardon former Honduran President Hernandez",
      "url": "https://apnews.com/article/trump-hernandez-honduras-pardon-96ac8d1d44d438f64beb8b24ca54b651",
      "urlToImage": "https://dims.apnews.com/dims4/default/3b071e8/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F5d%2F7ff78a5ff6821f6f942b0f85f46d%2F55fd6b5069e74a4badc20c85ddd26029"
    },
    {
      "author": "Abdulrahman Shaheen",
      "description": "Israeli forces have opened fire in southern Syria, killing at least 10 people, according to Syrian media and officials. This happened on Friday when Israeli troops raided the village of Beit Jin to detain local men. The Syrian state news agency SANA reported that Israeli forces fired heavily after residents protested. Israel said the operation aimed to apprehend suspects from Jamaa Islamiya, who were planning to attack Israeli civilians. Several militants fired at Israeli troops, injuring soldiers. Israel responded with aerial assistance. The raid concluded with suspects apprehended and militants killed. Syrian officials condemned the incursion as a violation of sovereignty.",
      "publishedAt": "2025-11-28T09:32:01Z",
      "title": "Israeli forces in southern Syria open fire, killing 10, residents say",
      "url": "https://apnews.com/article/israel-syria-hamas-gaza-a91d1b457d2540e038d01083a76fe696",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6ab568/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fd0%2F06d4cc76ef4b0263da7e3bf68029%2F6dce6d689ca14c9e9d294091f86da154"
    },
    {
      "author": "Audrey McAvoy",
      "description": "Airlines around the world canceled and delayed flights heading into the weekend to fix software on a widely used commercial plane after an analysis found computer code may have contributed to a sudden drop in the altitude of a JetBlue aircraft last month. Airbus says an analysis of the JetBlue incident revealed intense solar radiation may corrupt data critical to the functioning of flight controls on the A320 family of aircraft. In Japan, All Nippon Airways canceled 65 of its domestic flights. American Airlines expects some delays but is focused on limiting cancellations while placing overriding priority on safety. American Airlines expects to finish the fixes on Saturday.",
      "publishedAt": "2025-11-28T22:43:09Z",
      "title": "Software fix for the Airbus A320 may cause some flight delays",
      "url": "https://apnews.com/article/airbus-airlines-software-fix-flight-delays-d7b3c6a1315fef77d5cf1b5a588c72a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ac63d0/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F7c%2F09ecc10844b4236cffd968d7d770%2Ff64019059d3b42b3b5dd7860b40bc4ae"
    },
    {
      "author": "Assana Sambu, Mark Banchereau",
      "description": "Soldiers in Guinea-Bissau have appointed a close ally of the deposed president as prime minister after seizing power following disputed elections. The new military leader, Gen. Horta Inta-a, announced finance minister Ilídio Vieira Té as prime minister. Vieira Té is a close ally of the deposed President Umaro Sissoco Embaló. Soldiers seized power on Wednesday, three days after the contested election. The opposition claims the coup was fabricated to avoid election defeat. Calm has returned to the capital, and the curfew has been lifted. ECOWAS has suspended Guinea-Bissau from its decision-making bodies until constitutional order is restored.",
      "publishedAt": "2025-11-28T11:19:02Z",
      "title": "Soldiers appoint deposed leader's ally as Guinea-Bissau's prime minister",
      "url": "https://apnews.com/article/guinea-bissau-military-takeover-ecowas-0d06bcc9cf7eaf29243a1fcf6d7b307a",
      "urlToImage": "https://dims.apnews.com/dims4/default/1555e07/2147483647/strip/true/crop/1200x675+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F71%2F08951413dd516802b48cbd5c992b%2Fd71950036d3f4bd78b653087583496e4"
    },
    {
      "author": "The Associated Press",
      "description": "The Russian authorities have outlawed Human Rights Watch as an “undesirable organization,” making all involvement with the group a criminal offense. The designation means the international human rights group must stop all work in Russia, and opens those who cooperate with or support the organization to prosecution. The decision by the Russian Prosecutor General’s office is the latest in the unrelenting crackdown on Kremlin critics, journalists and activists that intensified to unprecedented levels after Moscow launched its full-scale invasion of Ukraine in February 2022.",
      "publishedAt": "2025-11-28T15:48:47Z",
      "title": "Russian authorities label Human Rights Watch an undesirable organization",
      "url": "https://apnews.com/article/russia-crackdown-undesirable-organization-human-rights-watch-17cd57227679c9995626e9444fd60ff5",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}