{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel on Tuesday bombed areas of southern Gaza where it had told Palestinians to flee to ahead of an expected invasion, killing dozens of people. Meanwhile, mediators struggled to break a deadlock over delivering aid to millions of increasingly desperate civilians in the territory, which has been besieged and under assault by Israel since a brutal attack by Hamas militants.",
      "publishedAt": "2023-10-17T04:58:59Z",
      "title": "Israeli bombings in Gaza kill dozens as efforts persist to get aid to millions in besieged enclave",
      "url": "https://apnews.com/e062825a375d9eb62e95509cab95b80c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af13accb7e634c4c92d8c6b5e1d3d2f1/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — From its first months in office, the Biden administration made a distinctive decision on its Middle East policy: It would deprioritize a half-century of high-profile efforts by past U.S.",
      "publishedAt": "2023-10-17T04:14:14Z",
      "title": "Biden didn't make Israeli-Palestinian talks a priority. Arab leaders say region now paying the price",
      "url": "https://apnews.com/d930f103b33a4b1e40dd1da5d9c8b05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04895e0372cf4b3e93247a4c7a5e2fc9/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE, MELISSA PEREZ WINDER and SOPHIA TAREEN",
      "description": "BRIDGEVIEW, Ill. (AP) — Crowds of mourners in a heavily Palestinian Chicago suburb paid respects Monday to a 6-year-old Muslim boy killed in an alleged hate crime, hours after authorities revealed new details about the evidence used to charge the family's landlord with stabbing the child and his mother.",
      "publishedAt": "2023-10-16T16:15:29Z",
      "title": "Mourners in heavily Palestinian Chicago suburb remember Muslim boy killed as kind, energetic",
      "url": "https://apnews.com/9f30f422e47ed8ef36ea6a25a4052341",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b41cbd29203c477a85e0de04edd6841e/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Republicans will try to elect a firebrand Rep. Jim Jordan as the new House speaker, elevating a chief ally of Donald Trump to a center-seat of U.S.",
      "publishedAt": "2023-10-17T04:08:54Z",
      "title": "Republicans will try to elect Trump ally Rep. Jim Jordan as House speaker but GOP holdouts remain",
      "url": "https://apnews.com/f2b2bf9dc834742bde93d5fc918d9940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ede1e8ca750454b821d3d5c1c78d544/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former President Donald Trump returns to a New York City courthouse Tuesday to be a spectator at the civil fraud trial threatening to disrupt his real estate empire.",
      "publishedAt": "2023-10-17T04:26:15Z",
      "title": "Donald Trump is returning to his civil fraud trial, but star witness Michael Cohen won't be there",
      "url": "https://apnews.com/067501b1d742d4dccba2521ac3262fdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7b6f101fb6142119236602791844f3a/3000.jpeg"
    },
    {
      "author": "RICHARD LARDNER, TRENTON DANIEL and AARON KESSLER",
      "description": "WASHINGTON (AP) — Donald Trump’s political fundraising machine is raking in donations at a prodigious pace, but he’s spending tens of millions of dollars he’s bringing in to pay attorneys to deal with the escalating costs of the various criminal cases he is contending with as he moves further into the 2024 presidential campaign.",
      "publishedAt": "2023-10-17T04:18:48Z",
      "title": "Lawyers, Trump and money: Ex-president spends millions in donor cash on attorneys as legal woes grow",
      "url": "https://apnews.com/2e06de2a8a90b3752e7758dfea56a509",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c566e4c8eb34b018826c0d538accf70/3000.jpeg"
    },
    {
      "author": "LORNE COOK, SYLVAIN PLAZY and RAF CASERT",
      "description": "BRUSSELS (AP) — Police in Belgium on Tuesday shot dead a suspected Tunisian extremist accused of killing two Swedish soccer fans in a brazen shooting on a Brussels street before disappearing into the night.",
      "publishedAt": "2023-10-17T06:14:38Z",
      "title": "Police shoot dead suspected extremist accused of killing 2 Swedish soccer fans on a Brussels street",
      "url": "https://apnews.com/a81ef9502207095ebf0afdc5cac5676a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0cce31a71654a8287492e2e85abd434/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Russian President Vladimir Putin arrived in Beijing on Tuesday for a visit that underscores China’s support for Moscow during its war in Ukraine as well as Russian backing for China's bid to expand its economic and diplomatic influence abroad.",
      "publishedAt": "2023-10-17T05:11:39Z",
      "title": "Putin begins visit in China underscoring ties amid Ukraine war and Israeli-Palestinian conflict",
      "url": "https://apnews.com/db5a0b4b804fac0b5831f44e2a5859e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51a37117f6b84129818ee152c1cab8a5/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — Stalled spending on electrical grids worldwide is slowing the rollout of renewable energy and could put efforts to limit climate change at risk if millions of miles of power lines are not added or refurbished in the next few years, the International Energy Agency said.",
      "publishedAt": "2023-10-17T05:07:49Z",
      "title": "Electrical grids aren't keeping up with the green energy push. That could risk climate goals",
      "url": "https://apnews.com/82d1fedd21e58d36e27c6c2396498c0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6601dc3951d6479ca11ecdafed81f772/3000.jpeg"
    },
    {
      "author": "JACKIE MADER of The Hechinger Report",
      "description": "Laura Jackson became seriously concerned about her daughter and math when the girl was in third grade. While many of her classmates flew through multiplication tests, Jackson’s daughter relied on her fingers to count, had difficulty reading clocks and burst into tears when asked at home to practice math flashcards.",
      "publishedAt": "2023-10-17T04:15:35Z",
      "title": "Math disabilities hold many students back. Schools often don't screen for them",
      "url": "https://apnews.com/1365774aecc6c04fd40ece9e5082a2b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2387d90fad254e4c94e4517b41b72392/1075.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}