{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAM MEDNICK and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel on Saturday carried out its largest hostage rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza in a heavy air and ground assault.",
      "publishedAt": "2024-06-08T10:46:01Z",
      "title": "Israel rescues 4 hostages taken in Hamas' Oct. 7 attack, and 210 Palestinians are reported killed",
      "url": "https://apnews.com/a5d1ef04763a5ed17de2d050ebc5d490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6e4d510eb964a2cbcb33f3e77b431d6/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER and SYLVIE CORBET",
      "description": "PARIS (AP) — President Joe Biden said France was America's “first friend” at its founding and is one of its closest allies more than two centuries later as he was honored with a state visit Saturday by French President Emmanuel Macron aimed at showing off their partnership on global security issues and easing past trade tensions.",
      "publishedAt": "2024-06-08T04:00:47Z",
      "title": "Biden calls France 'our first friend' as host Macron says, 'Allied we are and allied we will stay'",
      "url": "https://apnews.com/0c46f64738ecfcbb45e624e9dd226d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfe37b8e3c434426b0a0685ea4a85a78/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, RANDALL CHASE and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Pictures of President Joe Biden's son with drug paraphernalia and bare-chested in a bubble bath. Text messages between Hunter Biden and drug dealers.",
      "publishedAt": "2024-06-08T14:42:25Z",
      "title": "Takeaways from Hunter Biden's gun trial: His family turns out as his own words are used against him",
      "url": "https://apnews.com/a385e245fb4a0f06ad6ee73d38fcd374",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899311c8db69476eafcd5938b7bfcbfe/1920.jpeg"
    },
    {
      "author": "GIADA ZAMPANO, KAREL JANICEK and RAF CASERT",
      "description": "ROME (AP) — Prime Minister Giorgia Meloni joined voters in Italy and a half dozen European Union nations in casting a ballot during the penultimate day of European Union parliamentary elections on Saturday.",
      "publishedAt": "2024-06-08T05:18:35Z",
      "title": "Your time is up, Italy's hard-right leader tells EU center parties as she votes in European election",
      "url": "https://apnews.com/0e7fd468dcbe8c85a6277b2992de9da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f5d10e831748a0961e8823700b1c8c/3000.jpeg"
    },
    {
      "author": "DARREN SANDS",
      "description": "CALVERTON, Md. (AP) — The Rev. Matthew L. Watley says it’s not happenstance his suburban Maryland congregation, part of the historically Black African Methodist Episcopal denomination, landed at the top of a list of the fastest-growing churches in America.",
      "publishedAt": "2024-06-08T12:33:22Z",
      "title": "How this Maryland pastor ended up leading one of the fastest-growing churches in the nation",
      "url": "https://apnews.com/566ac03a1d0aee9fc338d1b3606ceba3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bedf06f534e34d29862546ef25ecfacb/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — The weeklong heat wave that baked most of the U.S.",
      "publishedAt": "2024-06-08T18:59:38Z",
      "title": "Weeklong heat wave loosens grip slightly on US Southwest but forecasters still urge caution",
      "url": "https://apnews.com/761a5f251ad1cc714e87ee605b97440b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cedd038345cb439baec5841f11aa5d40/3000.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — Seriously overdue credit card debt is at the highest level in more than a decade, and people 35 and under are struggling more than other age groups to pay their bills.",
      "publishedAt": "2024-06-08T14:27:46Z",
      "title": "Credit card delinquencies are rising. Here's what to do if you're at risk",
      "url": "https://apnews.com/c8197a70d38a3c5605f40fc1f4f775bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be114a4664a54db09b0150a3a2f1478d/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "CARENTAN-LES-MARAIS, France (AP) — Together, the collective age of the bride and groom was nearly 200. But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.",
      "publishedAt": "2024-06-08T11:17:23Z",
      "title": "A World War II veteran just married his bride near Normandy's D-Day beaches. He's 100, she's 96",
      "url": "https://apnews.com/fd4c4d73b87238787fe616719286a561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/593b0a806fbf4c3badeb027c45561d5a/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "LOS GATOS, Calif. (AP) — Although its video streaming service sparkles with a Hollywood sheen, Netflix still taps its roots in Silicon Valley to stay a step ahead of traditional TV and movie studios.",
      "publishedAt": "2024-06-08T11:40:19Z",
      "title": "Netflix's recipe for success includes 'secret sauce' spiced with Silicon Valley savvy",
      "url": "https://apnews.com/7146b50bc23d72f752f7eba8d3b156e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73e03c4fd48040ee81f9e019f48c7836/2672.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "PARIS (AP) — For a few minutes, anyway, it seemed as if Iga Swiatek was a bit off in the French Open final against Jasmine Paolini. Swiatek kept making mistakes early Saturday, got broken in the third game and trailed at Court Philippe Chatrier.",
      "publishedAt": "2024-06-08T07:00:36Z",
      "title": "Iga Swiatek wins a third consecutive French Open women's title by overwhelming Jasmine Paolini",
      "url": "https://apnews.com/2d5b61ea5937361d6bb351593edf9544",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b39f9f706c74e959ab8e0ef1cb7f663/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}