{
  "articles": [
    {
      "author": "BASSAM HATOUM, MELANIE LIDMAN and BASSEM MROUE",
      "description": "MASNAA BORDER CROSSING, Lebanon (AP) — Powerful new explosions rocked Beirut's southern suburbs late Saturday as Israel expanded its bombardment in Lebanon, also striking a Palestinian refugee camp deep in the north for the first time as it targeted both Hezbollah and Hamas fighters.",
      "publishedAt": "2024-10-05T11:44:37Z",
      "title": "Israel expands its bombardment in Lebanon as thousands flee widening war",
      "url": "https://apnews.com/a8b70daeccc57a86fc6d939c604f2caf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b707a0919047460f8a91ff31f8c356b4/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — At a busy Tel Aviv entertainment district, diners spill into outdoor seating and clink glasses as music fills the air. There’s laughter, there’s life. But all around the patrons, staring down from lampposts and shop windows, are pictures of hostages held in Gaza, stark reminders that Israel is at war and forever scarred by the deadliest attack in its history.",
      "publishedAt": "2024-10-05T04:03:41Z",
      "title": "At Israel's cafes and bars, life may seem normal. But the war has cast a pall nationwide",
      "url": "https://apnews.com/28daf7e6aa8ddab419cf76e31b111d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b06ab6665c14837938b7f38be7a300e/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and BILL BARROW",
      "description": "WASHINGTON (AP) — On the last day of August, President Joe Biden was asked about his fall campaign plans. He promised a Labor Day appearance in Pittsburgh and said he would be “on the road from there on.”",
      "publishedAt": "2024-10-05T14:48:20Z",
      "title": "Biden pledged to campaign hard for Harris. So far, he's been mostly a no-show",
      "url": "https://apnews.com/79496a704736e8965010eea3bb6b6b5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18b7e9c899694581bb4cf77c1d58f03d/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "BUTLER, Pa. (AP) — Donald Trump returned on Saturday to the Pennsylvania fairgrounds where he was nearly assassinated in July, holding a sprawling rally with thousands of supporters in a critical swing state Trump hopes to return to his column in November's election.",
      "publishedAt": "2024-10-05T04:15:07Z",
      "title": "Trump returns to site of Pennsylvania assassination attempt for a major swing-state rally",
      "url": "https://apnews.com/24a8718393eb6fdab01336ca4438a0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bf8e8e2e61c4956ad3fd7b7cd4acbde/1920.jpeg"
    },
    {
      "author": "ALLEN G. BREED",
      "description": "CHIMNEY ROCK VILLAGE, N.C. (AP) — The stone tower that gave this place its name was nearly a half billion years in the making — heated and thrust upward from deep in the Earth, then carved and eroded by wind and water.",
      "publishedAt": "2024-10-05T13:03:52Z",
      "title": "Inside the North Carolina mountain town that Hurricane Helene nearly wiped off the map",
      "url": "https://apnews.com/da802219b70161816b73b24482b50684",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47c74e7a739e4b6c88596631f93637df/3000.jpeg"
    },
    {
      "author": "SALLY HO",
      "description": "A week after Hurricane Helene overwhelmed the Southeastern U.S., homeowners hit the hardest are grappling with how they could possibly pay for the flood damage from one of the deadliest storms to hit the mainland in recent history.",
      "publishedAt": "2024-10-05T12:00:53Z",
      "title": "Homeowners hit by Hurricane Helene face the grim task of rebuilding without flood insurance",
      "url": "https://apnews.com/07bbf25fba01c2fac5f66dd6ac56e0ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3cf3936df90435b94a7b5b22cdbb667/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Transgender rights, the regulation of “ghost guns” and the death penalty highlight the Supreme Court's election-season term that begins Monday, with the prospect of the court's intervention in voting disputes lurking in the background.",
      "publishedAt": "2024-10-05T12:35:26Z",
      "title": "The Supreme Court opens its new term with election disputes in the air but not yet on the docket",
      "url": "https://apnews.com/50d7d3d0a85932efe407a80aeaea75fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e64a423984704f1da451fd5e9a0b0bef/3000.jpeg"
    },
    {
      "author": "RUTH ALONGA",
      "description": "GOMA, Congo (AP) — Congolese authorities Saturday began vaccinations against mpox, nearly two months after the disease outbreak that spread from Congo to several African countries and beyond was declared a global emergency by the World Health Organization.",
      "publishedAt": "2024-10-05T14:06:20Z",
      "title": "Congo finally begins mpox vaccinations in a drive to slow outbreaks",
      "url": "https://apnews.com/26cb3224edf6fe28b5db507241fee68f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/055d476336e144478dd3eb0d4332d260/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — If you have stained or chipped teeth, you might be considering veneers, customized teeth coverings that can restore a photogenic smile without more extensive dental work.But dentists warn that these pricey cosmetic enhancements are at the center of a worrisome online trend: unlicensed practitioners without proper training or supervision offering low-cost veneers.",
      "publishedAt": "2024-10-05T13:01:25Z",
      "title": "Don't fall for fake dentists offering veneers and other dental work on social media",
      "url": "https://apnews.com/d0d9d57613a10f18bc9735dc5eca4b41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cd3a9d83d1a47389120a23056d2a17b/1439.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — George Brett watched the Kansas City Royals prepare to face the New York Yankees and remembered the combustible clashes of the 1970s.",
      "publishedAt": "2024-10-05T10:00:24Z",
      "title": "George Brett reminds Royals players of intensity of past playoffs against Yankees",
      "url": "https://apnews.com/213cf4b358d61ab7b878f4be44eca2b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bee5ecd71f14f3190f39ab32cfa5a1b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}