{
  "articles": [
    {
      "author": "STEPHEN GROVES, LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Staring down a fast-approaching government shutdown that threatens to disrupt life for millions of Americans, Speaker Kevin McCarthy has turned to a strategy that so far has preserved his tenuous hold on House leadership but also marked it by chaos: giving hard-right lawmakers what they want.",
      "publishedAt": "2023-09-23T18:32:39Z",
      "title": "Speaker McCarthy gives in to hard-line conservatives in hopes of solving government funding impasse",
      "url": "https://apnews.com/dd94770223f697c1c68229133f031df4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d8cbc80599d487da3d2136f6ba54857/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — This probably wasn't how President Joe Biden envisioned his big foreign policy week ending.Biden spent much of the time trying to make the case to world leaders at the U.N.",
      "publishedAt": "2023-09-23T14:34:36Z",
      "title": "Biden faces foreign policy trouble spots as he aims to highlight his experience on the global stage",
      "url": "https://apnews.com/c137a6e8b102fdb0e3b93f09059d7b36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d55962a034444c0af65066347470dc7/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Residents in parts of coastal North Carolina and Virginia experienced flooding Saturday after Tropical Storm Ophelia made landfall near a North Carolina barrier island, bringing rain, damaging winds and dangerous surges.",
      "publishedAt": "2023-09-23T05:30:10Z",
      "title": "Coastal North Carolina hit by flooding as Tropical Storm Ophelia moves inland",
      "url": "https://apnews.com/f6c9d5e3a9a5b0258543cc92b609c12e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1a582487caa4731890d91ea71610155/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The family of a Black high school student in Texas who was suspended over his dreadlocks filed a federal civil rights lawsuit Saturday against the state's governor and attorney general, alleging they failed to enforce a new law outlawing discrimination based on hairstyles.",
      "publishedAt": "2023-09-23T16:17:08Z",
      "title": "A Black student was suspended for his hairstyle. Now his family is suing Texas officials",
      "url": "https://apnews.com/e79ede512923b672a275abf054e2407b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11757d7770524ea48062da07f43be3a3/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Even after escalating its strike against Detroit automakers on Friday, the United Auto Workers union still has plenty of leverage in its effort to force the companies to agree to significant increases in pay and benefits.",
      "publishedAt": "2023-09-23T18:05:36Z",
      "title": "Auto workers still have room to expand their strike against car makers. But they also face risks",
      "url": "https://apnews.com/1e68877dc9b15879879845fb4f77788e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb9357e8ae3944cdb06098d4aff86982/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — In late 2020, Sen. Bob Menendez met with Philip Sellinger, a private practice lawyer and former fundraiser for the senator, to assess his potential fit as the next U.S. attorney for the state of New Jersey — and to discuss one case in particular.",
      "publishedAt": "2023-09-23T04:40:25Z",
      "title": "Bribery case against Sen. Menendez shines light on powerful NJ developer accused of corruption",
      "url": "https://apnews.com/b533417693a82f83865ce9df26253708",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dbdab64b8e64e11920f1b8ad2d9dbef/2000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "NASHVILLE, Tenn. (AP) — For months, Carlton Clemons endured crippling pain from a rotting wisdom tooth. He couldn’t sleep, barely ate and relied on painkillers to get by.The 67-year-old from Nashville, Tennessee, could not afford to see a dentist on the $1,300-a-month his family gets in Social Security and disability payments.",
      "publishedAt": "2023-09-23T12:30:14Z",
      "title": "Many states are expanding their Medicaid programs to provide dental care to their poorest residents",
      "url": "https://apnews.com/c45d52fc9f7e24adf877a3063b086da4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/626c4a5f172041c19bf7b4c72b0fd656/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — President Joe Biden has gotten the updated COVID-19 vaccine and annual flu shot, the White House said Saturday.",
      "publishedAt": "2023-09-23T17:28:02Z",
      "title": "Biden has gotten the updated COVID-19 vaccine and the annual flu shot, the White House says",
      "url": "https://apnews.com/ab355a0dee38e224399825e19c2fff01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f8dfc329a0d46aa92be01cb7acafcde/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Ukraine on Saturday morning launched another missile attack on Sevastopol on the occupied Crimean Peninsula, a Russian-installed official said, a day after an attack on the headquarters of Russia’s Black Sea Fleet that left a serviceman missing and the main building smoldering.",
      "publishedAt": "2023-09-23T11:24:37Z",
      "title": "Ukraine targets a key Crimean city a day after striking Russia's Black Sea Fleet headquarters",
      "url": "https://apnews.com/9c287d5bad840beedbd68eb32c4c76a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d11c1d5d280a4885918c5c038235c213/2000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "The landmark Washington National Cathedral unveiled new stained-glass windows Saturday with a theme of racial justice, filling the space that had once held four windows honoring Confederate Gens.",
      "publishedAt": "2023-09-23T16:58:35Z",
      "title": "National Cathedral replaces windows honoring Confederacy with stained-glass homage to racial justice",
      "url": "https://apnews.com/d669541e259665a1ac175980e8721257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d97cb20d6eb144efb2349f8b8a2ce4f8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}