{
  "articles": [
    {
      "author": null,
      "description": "LONDON (AP) — UK court orders delay to extradition of WikiLeaks founder Julian Assange to the US on espionage charges.",
      "publishedAt": "2024-03-26T10:38:51Z",
      "title": "UK court orders delay to extradition of WikiLeaks founder Julian Assange to the US on espionage charges",
      "url": "https://apnews.com/85f9324007f4982ae023479f3e173141",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "BALTIMORE (AP) — Baltimore fire chief says two people rescued from water after bridge collapse, one seriously injured.",
      "publishedAt": "2024-03-26T10:30:43Z",
      "title": "Baltimore fire chief says two people rescued from water after bridge collapse, one seriously injured",
      "url": "https://apnews.com/4515a562b746887a68dbc4c6cfa2dce9",
      "urlToImage": ""
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — A container ship rammed into a major bridge in Baltimore early Tuesday, causing it to snap in a few places and plunge into the river below. Several vehicles fell into the chilly waters, and rescuers were initially searching for at least seven people.",
      "publishedAt": "2024-03-26T07:10:17Z",
      "title": "Cargo ship hits Baltimore's Key Bridge, bringing it down. Several people believed to be in water",
      "url": "https://apnews.com/53169b379820032f832de4016c655d1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8561679d7c8f49e4a60ffee3141ea9b5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, JACK JEFFERY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Prime Minister Benjamin Netanyahu on Tuesday vowed to press ahead with Israel's offensive and blasted a U.N. Security Council resolution calling for a pause in the fighting, saying it had emboldened Hamas to reject a separate proposal for a cease-fire and hostage release.",
      "publishedAt": "2024-03-26T08:02:44Z",
      "title": "Israel and Hamas dig in as international pressure builds for a cease-fire in Gaza",
      "url": "https://apnews.com/49326c412161df2473c167c311781363",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bd7e4ff438a4465bc4e59253590e565/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin will meet with Israel's minister of defense on Tuesday and discuss ways to defeat Hamas other than conducting a ground invasion of the southern Gaza city of Rafah, the Pentagon said, at a time of rising tensions between the two countries.",
      "publishedAt": "2024-03-26T04:07:27Z",
      "title": "US and Israeli defense chiefs to meet Tuesday as tensions rise over Gaza",
      "url": "https://apnews.com/ba2fa9612856b2e6e8c9e0e1624fd3aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f64cab9b118f41f795ba359176240b4c/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The U.S. warning to Russia couldn't have been plainer: Two weeks before the deadliest attack in Russia in years, Americans had publicly and privately advised President Vladimir Putin's government that “extremists” had “imminent plans” for just such slaughter.",
      "publishedAt": "2024-03-26T04:15:32Z",
      "title": "‘Duty to warn’ guided US advance warning of the Moscow attack. Adversaries don’t always listen",
      "url": "https://apnews.com/ab89b8b933c1c51b25903166951a1c7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/304bf244c1064627a3e3b78907bb0d42/2061.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden and Vice President Kamala Harris will promote their health care agenda on Tuesday in North Carolina, a battleground state that Democrats hope to flip in their favor after falling short to Donald Trump in the last two presidential elections.",
      "publishedAt": "2024-03-26T09:02:15Z",
      "title": "Biden and Harris team up for health care event in North Carolina",
      "url": "https://apnews.com/282cabddd8b5bcfaccce86b9c499a2da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31355217a3964665908e8c8cd19943de/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — As Donald Trump’s social media company begins trading publicly Tuesday, would-be investors might ask themselves if the stock is too pricey and potentially too volatile.Trump Media &amp; Technology Group Corp.",
      "publishedAt": "2024-03-26T07:01:27Z",
      "title": "Trump's social media company starts trading on Nasdaq with a market value of almost $6.8 billion",
      "url": "https://apnews.com/106d7c423174ca1d7cc3cc9a3f3897a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c5969dfb3174f258f6fe549f7804710/2900.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and COLLEEN LONG",
      "description": "NEW YORK (AP) — Two properties belonging to music mogul Sean “Diddy” Combs in Los Angeles and Miami were searched Monday by federal Homeland Security Investigations agents and other law enforcement as part of an ongoing sex trafficking investigation by federal authorities in New York, two law enforcement officials told The Associated Press.",
      "publishedAt": "2024-03-25T21:43:15Z",
      "title": "Feds search Sean 'Diddy' Combs’ properties as part of sex trafficking probe, AP sources say",
      "url": "https://apnews.com/8883ed2c7308f3fcdb2cdf03fbe329d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9642210aeca64dde8fe2ca29813a44ee/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is hearing arguments Tuesday in its first abortion case since conservative justices overturned the constitutional right to an abortion two years ago.",
      "publishedAt": "2024-03-26T04:04:12Z",
      "title": "Supreme Court hears arguments Tuesday in case that could restrict access to abortion medication",
      "url": "https://apnews.com/4406d53e8af90f6a523264f535f5adf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7061fe564dfc4019bc5e857f8e82719a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}