{
  "articles": [
    {
      "author": "FATIMA HUSSEIN and LORNE COOK",
      "description": "WASHINGTON (AP) — The United States and the European Union are piling new sanctions on Russia on the eve of the second anniversary of its invasion of Ukraine and in retaliation for the death of noted Kremlin critic Alexei Navalny last week in an Arctic penal colony.",
      "publishedAt": "2024-02-23T10:48:23Z",
      "title": "US and EU pile new sanctions on Russia for the Ukraine war's 2nd anniversary and Navalny's death",
      "url": "https://apnews.com/28a5d7faabbcbc5fe3a0de3ec84fd87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f63accfa94594038b3e4680b9cd2ade8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An ally of the late opposition leader Alexei Navalny said Friday that Russian authorities have given his mother a deadline to agree to forgo a public funeral or else they’ll bury him on prison grounds.",
      "publishedAt": "2024-02-23T11:33:16Z",
      "title": "Ally of late Kremlin critic Navalny says authorities threaten to bury him on prison grounds",
      "url": "https://apnews.com/5f95938f29ba478cec19dfdb7d460a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c231535a1e59451fadb188e6e4e95139/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel seeks open-ended control over security and civilian affairs in the Gaza Strip, according to a long-awaited postwar plan by Prime Minister Benjamin Netanyahu. It was swiftly rejected Friday by Palestinian leaders and runs counter to Washington's vision for the war-ravaged enclave.",
      "publishedAt": "2024-02-23T12:31:14Z",
      "title": "Netanyahu seeks open-ended control over security and civilian affairs in Gaza in new postwar plan",
      "url": "https://apnews.com/a5da6005cfa6734225af35ca460a75fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a0a4f93a6b046aeb7c6f4ada5566825/1920.jpeg"
    },
    {
      "author": "PETER SMITH and TIFFANY STANLEY",
      "description": "When the Alabama Supreme Court ruled that frozen embryos are considered children under state law, its chief justice had a higher authority in mind.",
      "publishedAt": "2024-02-23T13:01:29Z",
      "title": "Bible-quoting Alabama chief justice sparks church-state debate in embryo ruling",
      "url": "https://apnews.com/d9b7f720b5ef865ab35205ad36061f2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37499e29697644f287fe281324304a85/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — The moon’s newest arrival was said to be “alive and well” a day after making the first U.S.",
      "publishedAt": "2024-02-23T16:37:34Z",
      "title": "Lander 'alive and well' after company scores first US moon landing since Apollo era",
      "url": "https://apnews.com/14dfdc76176f9f7a6a68a099c98bbbb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/288c6bb70faf4de6a30fd3ce99add85f/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A former FBI informant who claims to have links to Russian intelligence and is charged with lying about a multimillion-dollar bribery scheme involving President Joe Biden's family was again taken into custody Thursday in Las Vegas, two days after a judge released him.",
      "publishedAt": "2024-02-22T22:29:40Z",
      "title": "Ex-FBI source accused of lying about Bidens and having Russian contacts is returned to US custody",
      "url": "https://apnews.com/e6de5f083e7ea7c2f1aa6233d24d7cfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84eb1a784aff472787e43b692e0b97ca/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Former President Donald Trump urged a Florida judge to dismiss the criminal case charging him with illegally retaining classified documents, claiming in part that presidential immunity protects him from prosecution even as that sweeping argument has so far in failed in federal appeals courts in a separate case.",
      "publishedAt": "2024-02-23T05:28:00Z",
      "title": "Trump's lawyers call for dismissal of classified documents case, citing presidential immunity",
      "url": "https://apnews.com/cfbb3a9cc50495da1652fa63315dcb05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/856c2e72be3e41ac8c4902b839613c1d/3000.jpeg"
    },
    {
      "author": null,
      "description": "ATHENS, Ga. (AP) — A woman found dead on the University of Georgia campus was a student at a nearby nursing school, said authorities, who were checking security cameras and advising students to travel in groups and avoid the wooded area where her body was found.",
      "publishedAt": "2024-02-23T14:31:53Z",
      "title": "A woman was found dead on the University of Georgia campus after she failed to return from a run",
      "url": "https://apnews.com/1e41b14c2d1e7c4889bc509abf5b42df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a45d10d05534541a0ca7ba997a378a2/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Majority Leader Chuck Schumer is in Ukraine to try to reassure President Volodymyr Zelenskyy and other officials that Congress will deliver another round of U.S. aid, even as a package that would provide $60 billion is stalled in the U.S.",
      "publishedAt": "2024-02-23T07:01:08Z",
      "title": "Senate Majority Leader Chuck Schumer is in Ukraine to meet Zelenskyy as US aid hangs in the balance",
      "url": "https://apnews.com/d2af898d3b8d90869a40340a67e39974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0faeb4b07c1f4b6b92bce3d46e959ca4/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "The complete shrouding of our sun by the moon has mesmerized humanity for millennia — a moment in time when skies darken and stillness creeps in.",
      "publishedAt": "2024-02-23T15:19:10Z",
      "title": "AP PHOTOS: Total solar eclipses through the decades",
      "url": "https://apnews.com/ec03a06a0f46d715eb1894dbafbfe511",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65c981f70c684a22a22ba8f8d481d5af/2885.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}