{
  "articles": [
    {
      "author": null,
      "description": "The chief federal judge in Minnesota says the Trump administration has failed to comply with orders to hold hearings for detained immigrants and has ordered the head of Immigration and Customs Enforcement to appear before him Friday to explain why he shouldn’t be held in contempt. In an order dated Monday, Chief Judge Patrick J. Schiltz said Todd Lyons, the acting director of ICE, must appear personally in court. Schlitz took the administration to task over its handling of bond hearings for immigrants it has detained. The order says Schlitz recognizes that ordering the head of a federal agency to appear personally is extraordinary, but that the “extent of ICE’s violation of court orders is likewise extraordinary.”",
      "publishedAt": "2026-01-27T13:27:48Z",
      "title": "ICE chief must appear in court to explain why detainees have been denied due process",
      "url": "https://apnews.com/article/immigration-enforcement-minnesota-ice-b0cec9d1c5bae4b62469011775082300",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Charlotte Kramon, Russ Bynum",
      "description": "A new influx of arctic air is expected to spur freezing temperatures in parts of the South already covered in snow and ice. Many people have fled to warming shelters, and crews worked Tuesday to restore power knocked out by a massive weekend winter storm. At least 30 deaths have been reported in states afflicted with severe cold. The storm dropped over a foot of snow from Arkansas to New England, halting traffic, canceling thousands of flights and triggering wide school closures Monday. The National Weather Service says more widespread record cold temperatures are forecast for Tuesday, with eastern Texas through western Pennsylvania under extreme cold warnings.",
      "publishedAt": "2026-01-27T05:59:57Z",
      "title": "Crews work to restore power as more icy temperatures descend on South",
      "url": "https://apnews.com/article/frigid-temperatures-arctic-air-us-south-tennessee-9d4beb4d548e29d5ce737fd001d67a64",
      "urlToImage": "https://dims.apnews.com/dims4/default/457244d/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fd1%2F84e7c01f875e6a46326f9012bff4%2F6e937e40391f47dd83697f4f0c820a8b"
    },
    {
      "author": "Jon Gambrell",
      "description": "Activists say that at least 6,126 people were killed in Iran’s crackdown on nationwide protests and many more are still feared dead. The new figures Tuesday came from the U.S.-based Human Rights Activists News Agency, which has been accurate in multiple rounds of unrest in Iran. The group verifies each death with a network of activists on the ground in Iran. The Associated Press has been unable to independently assess the death toll given authorities cutting off the internet and disrupting calls into the Islamic Republic. Iran’s government has put the death toll at a far lower 3,117, saying 2,427 were civilians and security forces, and labeled the rest “terrorists.”",
      "publishedAt": "2026-01-27T01:49:11Z",
      "title": "Activists say at least 6,126 people killed in Iran’s crackdown on nationwide protests",
      "url": "https://apnews.com/article/iran-protests-deaths-crackdown-aeaeb26493d25d86d5169f8ae455e405",
      "urlToImage": "https://dims.apnews.com/dims4/default/b992c35/2147483647/strip/true/crop/5807x3869+0+65/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F0b%2F7d934333fbf221fdd59a7deb8834%2F51b4c540c7a24bcf81fddf81199cb1f7"
    },
    {
      "author": "Kaitlyn Huamani",
      "description": "The Trump administration has not shied away from sharing AI-generated imagery online, embracing cartoonlike visuals and memes and promoting them on official White House channels. But an edited — and realistic — image of a civil rights attorney in tears after being arrested is raising new alarms about how the government is blurring the line between what is real and what is fake, especially with leaders mocking criticism of the edited image. Misinformation experts are concerned the spread of AI-generated or edited images could erode public perception of the truth and sow distrust.",
      "publishedAt": "2026-01-27T15:07:25Z",
      "title": "Trump's use of AI images pushes new boundaries, further eroding public trust",
      "url": "https://apnews.com/article/ai-videos-trump-ice-artificial-intelligence-08d91fa44f3146ec1f8ee4d213cdad31",
      "urlToImage": "https://dims.apnews.com/dims4/default/29772b9/2147483647/strip/true/crop/3926x2616+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F25%2Fc231e22dce01b274680dc10818de%2F17172084f4f9476b92e116dc22fc2160"
    },
    {
      "author": "Dasha Litvinova",
      "description": "Russian authorities use various strategies to recruit new troops to replenish its supply of soldiers for its nearly 4-year-old full-scale invasion of Ukraine. They are offering financial incentives, freedom for convicts and simplified paths to citizenship paths for foreigners who are willing to sign military contracts to go into battle. This effort aims to avoid a nationwide mobilization of men, which could be unpopular. When a limited mobilization of 300,000 men was tried in 2022, tens of thousands of Russians fled abroad. Recruiting foreigners, including migrants in Russia and those from other countries, appears to be a part of that strategy.",
      "publishedAt": "2026-01-27T05:18:58Z",
      "title": "Russia offers incentives for fighting in Ukraine, but some recruits complain of coercion",
      "url": "https://apnews.com/article/russia-ukraine-war-recruits-foreigners-78285219e6e10be694e8e1e007c5b6e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe8bd08/2147483647/strip/true/crop/5472x3646+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F1e%2Ff481c65ed68676e6a54c23de5b59%2Fa3fdb7a89dd54a43959940abb4562d75"
    },
    {
      "author": "Seung Min Kim, Hannah Fingerhut",
      "description": "President Donald Trump is heading to Iowa as the White House tries to focus on affordability ahead of the midterm elections despite fallout over the administration's immigration crackdown. While there, Trump will visit a local business and deliver a speech at the Horizon Events Center in Clive. Tuesday's trip also highlights energy policy as part of a plan to have Trump travel weekly before the elections. This visit comes amid the Trump administration's handling of the shooting death of ICU nurse Alex Pretti in Minnesota. Republicans hope Trump's visit will refocus attention on the tax bill, a key part of their campaign strategy.",
      "publishedAt": "2026-01-27T05:24:49Z",
      "title": "Trump to visit Iowa in an effort to focus on affordability",
      "url": "https://apnews.com/article/donald-trump-iowa-affordability-e6dc4aee8ede8e8e906f81f35a10a25b",
      "urlToImage": "https://dims.apnews.com/dims4/default/43dda5a/2147483647/strip/true/crop/4999x3331+0+2085/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F7b%2Ff715a7bfc62e701ef71b33cdde18%2F7ac5b59871944eeda6f637d70a84f730"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "NTSB hearing underway to highlight what led to a deadly midair collision near Washington, DC",
      "url": "https://apnews.com/article/dc-plane-crash-army-helicopter-ntsb-cause-c2ebc159a163068b782dd4824097b00b",
      "urlToImage": null
    },
    {
      "author": "Mike Schneider",
      "description": "President Donald Trump's crackdown on immigration has contributed to a year-to-year drop in the U.S. growth rate as the nation's population hit 341.8 million people in 2025. That's according to population estimates released Tuesday by the U.S. Census Bureau. The 0.5% growth rate for 2025 was a sharp drop from 2024’s almost 1% growth rate, which was the highest since 2001 and was fueled by immigration. The 2024 estimates put the U.S. population at 340 million people. Immigration increased by 1.3 million people last year, compared with 2024’s increase of almost 2.8 million people. Trump made a surge of migrants at the southern border a central issue in his winning 2024 Republican presidential campaign.",
      "publishedAt": "2026-01-27T15:12:21Z",
      "title": "Trump immigration crackdown contributes to drop in US growth rate",
      "url": "https://apnews.com/article/census-bureau-immigration-trump-us-population-7130f180e3d8c03185932e3e6f9974e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/1eb87c6/2147483647/strip/true/crop/4979x3318+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F1a%2Fec02bffe7ea93632c229832ccf86%2Fc951bce6243b4ad2a1403cb76c24aa67"
    },
    {
      "author": "Matt O'Brien",
      "description": "A new humanoid robot named Sprout, developed by Fauna Robotics, is making its debut. Unlike sleek and powerful-looking machines from companies like Tesla, Sprout is designed to be approachable and friendly. Standing at 3.5 feet tall, it features a soft, foam exterior and expressive features. Fauna Robotics aims to create a new industry of “approachable” robots for homes, schools and social spaces. Sprout is more of a software developer platform, priced at $50,000, targeting university labs and tech entrepreneurs. Early customers include Disney and Boston Dynamics. The robot's design draws inspiration from beloved science fiction characters like WALL-E, Baymax and R2-D2.",
      "publishedAt": "2026-01-27T13:02:05Z",
      "title": "Creators go for a friendly look in building the Sprout robot",
      "url": "https://apnews.com/article/friendly-home-robot-fauna-robotics-sprout-57b396cd6f4b98ef83913a5efa9e0db2",
      "urlToImage": "https://dims.apnews.com/dims4/default/705cd52/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Ff5%2Fbc11912aeed8ddccd7b8aea208fb%2F17f316d8508e49e2873f21a8d7b15149"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are zigzagging following a rush of mixed profit reports from UnitedHealth, General Motors and other big companies. The crosscurrents are keeping overall indexes in check on Tuesday, and the S&P 500 rose 0.5% and could top its all-time high set a couple weeks ago. The Dow Jones Industrial Average dropped 382 points, and the Nasdaq composite climbed 0.9%. Gains for Apple, Microsoft, GM and others helped offset sharp drops for UnitedHealth Group and other health care stocks. Treasury yields eased in the bond market after a report said U.S. consumer confidence tumbled to its lowest level since 2014.",
      "publishedAt": "2026-01-27T05:09:54Z",
      "title": "Stocks zigzag on Wall Street following mixed profit reports from UnitedHealth, GM and others",
      "url": "https://apnews.com/article/stocks-markets-trump-gold-federal-9490a04190f0cb649966b3b8d7724bef",
      "urlToImage": "https://dims.apnews.com/dims4/default/f53a975/2147483647/strip/true/crop/3970x2645+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fb2%2F1e9a921efcbb389a4616e72be093%2F7dd5d96696234632ae749262a24be1d7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}