{
  "articles": [
    {
      "author": "ALEXANDRA OLSON, ZEKE MILLER",
      "description": "President Donald Trump’s administration is directing that all federal diversity, equity and inclusion staff be put on paid leave, and that agencies develop plans to lay them off. That's according to a memo Tuesday from the Office of Personnel Management. The memo follows an executive order Trump signed on his first day ordering a sweeping dismantling of the federal government’s diversity and inclusion programs that could touch on everything from anti-bias training to funding for minority farmers and homeowners. The memo directs agencies to place DEI office staffers on paid leave by 5 p.m. Wednesday, and take down all public DEI-focused webpages by the same deadline.",
      "publishedAt": "2025-01-21T23:03:53Z",
      "title": "Trump directs all federal diversity, equity and inclusion staff be put on leave",
      "url": "https://apnews.com/article/dei-trump-executive-order-diversity-834a241a60ee92722ef2443b62572540",
      "urlToImage": "https://dims.apnews.com/dims4/default/e93f226/2147483647/strip/true/crop/4479x2519+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F70%2F5f7e23f4ef8e66616922e00aa2c7%2F1891260582d84f2598be01c9cd832936"
    },
    {
      "author": "BECKY BOHRER",
      "description": "Alaska's political leaders are cheering an expansive executive order signed by President Donald Trump that aims to boost oil and gas drilling, mining and logging in the state. But environmental groups cast the policies outlined by Trump as worrisome. Trump signed the order on his first day in office Monday. It was consistent with a wish list submitted by Republican Gov. Mike Dunleavy shortly after Trump’s election. In many ways, the order seeks to revert to policies that were in place during Trump’s first term. Among other things, it calls for allowing drilling in the coastal plain of the Arctic National Wildlife Refuge.",
      "publishedAt": "2025-01-22T06:01:19Z",
      "title": "Trump targets Alaska's oil and other resources as environmentalists gear up for a fight",
      "url": "https://apnews.com/article/trump-alaska-arctic-refuge-drilling-2db02694a0496678903124788758c05a",
      "urlToImage": "https://dims.apnews.com/dims4/default/1149eaa/2147483647/strip/true/crop/8091x4551+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F94%2F58fa61367f1b84dcf2df930059de%2Fa9a4fd02eea64c8988e59f5bcfb7ef41"
    },
    {
      "author": "MICHELLE L. PRICE, ZEKE MILLER",
      "description": "President Donald Trump has defended his decision to pardon people convicted of assaulting police officers during the attack on the Capitol and suggests there could be a place in U.S. politics for the Proud Boys extremist group, quickly evoking some of the controversies of his first term. Trump on Tuesday defended his decision to use his first hours in office to pardon hundreds of people who participated in violence at the Capitol siege on Jan. 6, 2021, including the former leaders of the Oath Keepers and Proud Boys, who were convicted of seditious conspiracy charges but released from prison after Trump signed his order.",
      "publishedAt": "2025-01-21T16:47:26Z",
      "title": "Trump defends pardons for rioters and suggests Proud Boys could have place in politics",
      "url": "https://apnews.com/article/trumps-first-day-white-house-b9ab76e21a159e681ea5ac74231adcea",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8e0d4b/2147483647/strip/true/crop/2143x1205+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fc1%2F0e82ad14f27645de7ff8c5013a7d%2Fe65c455f5db64376a121505d05d5ed07"
    },
    {
      "author": "CHRIS MEGERIAN, LISA MASCARO",
      "description": "President Donald Trump unleashed an unprecedented barrage of executive orders after taking office this week. It's a sign that he's breaching the traditional boundaries of executive power as he returns to the White House. Although he tried to follow a similar playbook during his first term, there are fewer guardrails this time. His administration is stocked with loyalists, there's a conservative majority on the U.S. Supreme Court and Republicans are in full control of Washington. Legal battles could eventually slow Trump down, but in the meantime he's drafting a blunt force blueprint for the presidency.",
      "publishedAt": "2025-01-22T05:01:19Z",
      "title": "Donald Trump finds new ways to flex presidential power after returning to the White House",
      "url": "https://apnews.com/article/trump-executive-orders-power-border-tiktok-history-e77458bc0312c60f3f2b0eeb131d0056",
      "urlToImage": "https://dims.apnews.com/dims4/default/a514282/2147483647/strip/true/crop/2143x1205+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F6d%2F7729139dafde91820e1461acfce6%2Fce5cad3e4a514283b331e2aa89d7eb85"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "President Donald Trump has publicly promised a shock-and-awe campaign to deliver major policy victories, and less than 36 hours after Trump’s inauguration, Democrats are struggling to confront it. In less than two days, the Republican president has moved to end diversity and inclusion programs across the federal government, withdrawn the U.S. from the Paris climate accords, blocked a federal law banning TikTok, and sought to end the constitutional guarantee of birthright citizenship. Each of those actions enrages part of the Democratic base. Together, they make it difficult to formulate a response by an already fractured party.",
      "publishedAt": "2025-01-21T22:34:02Z",
      "title": "Democrats struggle to pick their message against Trump",
      "url": "https://apnews.com/article/democrats-messaging-trump-tech-billionaires-strategy-policies-4c4a340700cbab5f36aeb8aa23f2691c",
      "urlToImage": "https://dims.apnews.com/dims4/default/60152ce/2147483647/strip/true/crop/3847x2164+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F8d%2F8cbe1d06b4887adaa197c60996b4%2F7f407e7370d949c98c8ac79d85943501"
    },
    {
      "author": null,
      "description": "The Episcopal bishop of Washington used the inaugural prayer service at the Washington National Cathedral Tuesday to directly address President Donald Trump, urging him to \"have mercy\" and compassion for LGBTQ people and undocumented migrant workers.",
      "publishedAt": "2025-01-21T19:25:02Z",
      "title": "Reverend at inaugural prayer service implores Trump to ‘have mercy’ on LGBTQ people and migrants",
      "url": "https://apnews.com/video/reverend-at-inaugural-prayer-service-implores-trump-to-have-mercy-on-lgbtq-people-and-migrants-1667ce77106b4fcbb92658f92ec772bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/71ecdb9/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F9a%2F30a44cb34650a81b41ea31457043%2Fyoutube-thumbnails-2025-01-21t143458-931.png"
    },
    {
      "author": "ALAN SUDERMAN",
      "description": "President Donald Trump’s goodwill in the cryptocurrency industry has taken a hit after he and his wife launched meme coins — a move critics say looks like an unseemly cash grab that undermines an effort to legitimize digital assets. The industry, which felt unfairly targeted by the Biden administration and spent heavily to help Trump win, is eager for the new president’s help to make crypto a bigger part of mainstream financial systems. Trump has promised a lighter regulatory touch and picked pro-crypto officials for key government positions. By associating himself so closely with meme coins, some crypto fans worry that Trump hurts his chances to help the wider crypto industry.",
      "publishedAt": "2025-01-21T22:48:11Z",
      "title": "Trump's embrace of meme coin sours mood in crypto industry",
      "url": "https://apnews.com/article/trump-crypto-meme-coin-regulation-c624272aead106ff7ca04419e68949d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee72faa/2147483647/strip/true/crop/3941x2217+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2Fa7%2Fb369d7261d04302076f9a81f4743%2F14f45dbfb90b4bdc85cd3d5bed7832e3"
    },
    {
      "author": "BERNARD CONDON",
      "description": "Right-wing extremists are celebrating Elon Musk’s straight-arm gesture during a speech Monday, although his intention wasn’t totally clear and some hate watchdogs are saying not to read too much into it. One extremist group saw it as a rallying cry for their movement. Hate watchdogs said it was unclear what Musk was trying to convey and urged caution. Musk himself was dismissive of the critics who saw it as a Nazi salute, though he didn't offer further explanation. But the confusion and plea for calm hasn’t stopped critics and fans alike of the world’s richest man from reading into the gesture what they wanted.",
      "publishedAt": "2025-01-21T18:51:54Z",
      "title": "Musk's straight-arm gesture embraced by right-wing extremists regardless of what he meant",
      "url": "https://apnews.com/article/musk-gesture-salute-antisemitism-0070dae53c7a73397b104ae645877535",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ebb23d/2147483647/strip/true/crop/4011x2256+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fea%2F65d56ae4a8288299545146d3bfe2%2F87e399711fe94f7ba2a0d63e87a1ec7c"
    },
    {
      "author": "ERIC TUCKER",
      "description": "The Justice Department has reassigned key senior officials across multiple divisions as part of a leadership shakeup ahead of the expected confirmation of President Donald Trump’s pick for attorney general, Pam Bondi. Among those moved to other positions inside the department is Bruce Swartz, the longtime head of the Justice Department’s office of international affairs, which handles extradition matters. That's according to people familiar with the matter who spoke on condition of anonymity to The Associated Press to discuss personnel moves and who said that as many as 20 officials had been reassigned. Another affected official is George Toscas, a veteran deputy assistant attorney general in the department’s national security division.",
      "publishedAt": "2025-01-21T23:16:14Z",
      "title": "Key career officials at Justice Department reassigned to different positions",
      "url": "https://apnews.com/article/trump-fbi-justice-department-360fe0c616e11f72bca68ab69f5eed6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f247266/2147483647/strip/true/crop/2713x1526+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fcf%2F8a041454efbec095a5dc10d5e736%2F06bfd46193044af6b286847339eeb6e7"
    },
    {
      "author": "OLGA R. RODRIGUEZ, MORIAH BALINGIT, BIANCA VÁZQUEZ TONESS, JOCELYN GECKER",
      "description": "As President Donald Trump cracks down on immigrants in the U.S. illegally, some families are wondering if it is safe to send their children to school. In many districts, educators have sought to reassure parents that schools are safe places for their kids, despite the president’s campaign pledge to carry out mass deportations. But many migrants’ fears intensified when the Trump administration announced Tuesday it would allow federal immigration agencies to make arrests at schools, churches and hospitals, ending a decades-old policy.",
      "publishedAt": "2025-01-22T06:01:17Z",
      "title": "Trump allows ICE immigration arrests at schools, worrying families",
      "url": "https://apnews.com/article/trump-immigration-ice-raids-school-2d899678264f44fe1021847ee385fd15",
      "urlToImage": "https://dims.apnews.com/dims4/default/c0d2ae8/2147483647/strip/true/crop/5676x3193+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F0b%2Fc04f3953f7d5759cae784528e609%2F7582a9ce8d854e71b574a82c37cb6ada"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}