{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An apparent Israeli drone attack on Iran saw troops fire air defenses at a major air base and a nuclear site early Friday morning near the central city of Isfahan, an assault coming in retaliation for Tehran's unprecedented drone-and-missile assault on the country.",
      "publishedAt": "2024-04-19T01:55:21Z",
      "title": "Iran fires at apparent Israeli attack drones near Isfahan air base and nuclear site",
      "url": "https://apnews.com/a7ccbae2e2844bab089e8e4377a24ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31291fae655e4c8e98611c57986901e0/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Iran fired air defense batteries Friday reports of explosions near a major air base at the city of Isfahan, the state-run IRNA news agency reported. It remained unclear if the country was under attack, but tensions remain high after Iran’s unprecedented missile-and-drone attack on Israel.",
      "publishedAt": "2024-04-18T12:55:20Z",
      "title": "The Latest | Iran says air defense batteries fire after explosions reported near major air base",
      "url": "https://apnews.com/dc34b0c2986834549da9fabd64ef1f7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59ad4e74441b4c4c9de59de9e3e4abb5/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — A third panel of potential jurors will be questioned Friday in Donald Trump’s hush money case, drawing jury selection a step closer to completion in the first criminal trial of a former U.S.",
      "publishedAt": "2024-04-19T04:03:35Z",
      "title": "Jury selection could be nearing a close in Donald Trump's hush money trial in New York",
      "url": "https://apnews.com/24147c3774c8a411044c530cafcab292",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a288a3db60b41e88fd4069719ebd065/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Millions of Indians began voting Friday in a six-week election that's a referendum on Narendra Modi, the populist prime minister who has championed an assertive brand of Hindu nationalist politics and is seeking a rare third term as the country's leader.",
      "publishedAt": "2024-04-19T01:33:50Z",
      "title": "Indians vote in the first phase of the world's largest election as Modi seeks a third term",
      "url": "https://apnews.com/7ea0983c9b7bc7506c8457f44afcfd64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e1b975b797c4e7abb398e6ebc9edf01/1920.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — One woman miscarried in the restroom lobby of a Texas emergency room as front desk staff refused to admit her. Another woman learned that her fetus had no heartbeat at a Florida hospital, the day after a security guard turned her away from the facility.",
      "publishedAt": "2024-04-19T04:03:06Z",
      "title": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom",
      "url": "https://apnews.com/9ce6c87c8fc653c840654de1ae5f7a1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/353ade75acd44a2cb2dbc02f7d7cc414/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "CHICAGO (AP) — The closure of Wadsworth Elementary School in 2013 was a blow to residents of the majority-Black neighborhood it served, symbolizing a city indifferent to their interests.So when the city reopened Wadsworth last year to shelter hundreds of migrants, without seeking community input, it added insult to injury.",
      "publishedAt": "2024-04-19T04:17:44Z",
      "title": "Chicago's response to migrant influx stirs longstanding frustrations among Black residents",
      "url": "https://apnews.com/ab8d7f22eea423d86fb350665b9e66f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d330cc6fed74dfd85d1a09e623bdca1/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "The rights of LGBTQ+ students will be protected by federal law and victims of campus sexual assault will gain new safeguards under rules finalized Friday by the Biden administration.The new provisions are part of a revised Title IX regulation issued by the Education Department, fulfilling a campaign pledge by President Joe Biden.",
      "publishedAt": "2024-04-19T09:01:04Z",
      "title": "Biden’s new Title IX rules protect LGBTQ+ students, but transgender sports rule still on hold",
      "url": "https://apnews.com/d0fc0ab7515de02b8e4403d0481dc1e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cab6712749164dc799adac0a08d470e4/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian troops are ramping up pressure on exhausted Ukrainian forces to prepare to seize more land this spring and summer as muddy fields dry out and allow tanks, armored vehicles and other heavy equipment to roll to key positions across the countryside.",
      "publishedAt": "2024-04-19T05:04:11Z",
      "title": "Russia pummels exhausted Ukrainian forces with smaller attacks ahead of a springtime advance",
      "url": "https://apnews.com/8fce40ee08fdcc483f1d0fbe51c44bbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/122d5f0593994e19b4b280e1801aae73/3000.jpeg"
    },
    {
      "author": "PAMELA SAMPSON",
      "description": "RAMAT GAN, Israel (AP) — When Ben Binyamin was left for dead, his right leg blown off during the Hamas attack on the Tribe of Nova music festival, the Israeli professional soccer player thought he would never again play the game he loved.",
      "publishedAt": "2024-04-19T04:12:43Z",
      "title": "Soldiers who lost limbs in Gaza fighting are finding healing on Israel's amputee soccer team",
      "url": "https://apnews.com/dbe42c8792fdcda4f315279ff02b09e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/179f35ab2a9a4b97b5225fec6cfd35df/3000.jpeg"
    },
    {
      "author": "ADIL JAWAD",
      "description": "KARACHI, Pakistan (AP) — A suicide bomber detonated his explosive-laden vest near a van carrying Japanese autoworkers, who narrowly escaped the attack Friday that wounded three bystanders in Pakistan's port city of Karachi, police said.",
      "publishedAt": "2024-04-19T05:15:54Z",
      "title": "5 Japanese workers narrowly escape suicide bombing that targeted their vehicle in Pakistan",
      "url": "https://apnews.com/d796b4df5757f82fdc4b6e937553e1b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62f737f030c846b699a51205a540ea69/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}