{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The Israeli ambassador to Washington says that a cease-fire deal to end fighting between Israel and the Lebanon-based Hezbollah could be reached “within days.”Ambassador Mike Herzog told Israeli Army Radio on Monday that there remained “points to finalize” and that any deal required agreement from the government.",
      "publishedAt": "2024-11-25T08:42:05Z",
      "title": "Middle East latest: Israeli ambassador to US says Hezbollah cease-fire deal could come 'within days'",
      "url": "https://apnews.com/625d22d49f84f2442d8d9de285a183d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/332c69d36de84d5198510951cb541c36/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The Lebanese civilians most devastated by the Israel- Hezbollah war are Shiite Muslims, and many of them believe they are being unfairly punished because they share a religious identity with Hezbollah militants and often live in the same areas.",
      "publishedAt": "2024-11-25T05:30:07Z",
      "title": "Lebanon's Shiite Muslims pay high price in war between Israel and Hezbollah",
      "url": "https://apnews.com/2d242ffd84ea48d373cf6ef94399fb5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3e897f250714f04989442c37bb7349f/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — Donald Trump’s personnel choices for his new Cabinet and White House reflect his signature positions on immigration and trade but also a range of viewpoints and backgrounds that raise questions about what ideological anchors might guide his Oval Office encore.",
      "publishedAt": "2024-11-25T05:05:56Z",
      "title": "Trump 2.0 has a Cabinet and executive branch of different positions and eclectic personalities",
      "url": "https://apnews.com/986154f35c82452e0e2e642a3e1752a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7e2b0156e9c44ca9dbce3b4acd322a4/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — It's a short phrase in the Constitution, mentioned in passing. But it's already taking on an outsize significance as President-elect Donald Trump charts his return to office.",
      "publishedAt": "2024-11-25T05:07:26Z",
      "title": "Senators took down one Trump Cabinet pick. But the fight over their authority is just beginning",
      "url": "https://apnews.com/cee5cddaa714b8874db05356c6af2a04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27aee690c1584bec846aaf48a9500314/2593.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's military captured a British national fighting with Ukrainian troops who have occupied part of Russia's Kursk region, according to reports Monday, as Moscow began daylight drone attacks on civilian areas of Ukraine and its ground forces accelerated gains along parts of the front line.",
      "publishedAt": "2024-11-25T07:55:23Z",
      "title": "Russia reportedly captures a Briton fighting for Ukraine as Russian troops advance",
      "url": "https://apnews.com/e7fd8790cd151ff3b73a5edcc5e00bf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3808dfe620814457bc9723bc7435cd9f/2532.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "FIUGGI, Italy (AP) — Foreign ministers from the world’s leading industrialized nations are meeting Monday, with the wars in Ukraine and the Middle East entering decisive phases and a certain pressure to advance diplomatic efforts ahead of the new U.S.",
      "publishedAt": "2024-11-25T05:06:51Z",
      "title": "Foreign ministers meet in Italy for the last G7 of the Biden administration",
      "url": "https://apnews.com/87c0ce76ef6f4106bd8ced4056779a21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/641ce42eba154cf6a7414044bb6cc44d/3000.jpeg"
    },
    {
      "author": "MINDAUGAS KULBIS and JON GAMBRELL",
      "description": "VILNIUS, Lithuania (AP) — A DHL cargo plane crashed on approach to an airport in Lithuania's capital and skidded into a nearby house Monday morning, killing a Spanish crew member, officials said. The cause of the accident is under investigation.",
      "publishedAt": "2024-11-25T06:12:56Z",
      "title": "DHL cargo plane crashes and skids into a house in Lithuania, killing Spanish crew member",
      "url": "https://apnews.com/ff6382bb359c64ca2a345d50e523c396",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/380e0ed041f648abb5659e2590821b48/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "AVIGNON, France (AP) — A mammoth rape trial in France moved into a new phase Monday with prosecutors beginning to lay out the verdicts and punishments they want for dozens of men accused of raping Gisèle Pelicot while she was drugged and rendered unconscious by her husband.",
      "publishedAt": "2024-11-25T10:10:19Z",
      "title": "French prosecutors demand maximum sentence for Gisèle Pelicot's ex-husband in rape trial",
      "url": "https://apnews.com/b52c6894b74890573d6ac5e38394f245",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d92d3b53e6a147bb97ae6c99972b236f/3000.jpeg"
    },
    {
      "author": "MUNIR AHMED",
      "description": "ISLAMABAD (AP) — Thousands of supporters of Pakistan's imprisoned former premier Imran Khan have defied a lockdown and widespread arrests to head to the capital Monday to demand his release.",
      "publishedAt": "2024-11-25T08:31:37Z",
      "title": "Thousands of Imran Khan supporters defy tear gas, lockdown and arrest to head to Pakistani capital",
      "url": "https://apnews.com/ec6cb96753c83be24b20cd32588ead71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/153e2cb4e55044ccb8d695c4b46bb1ca/2295.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Just as there are good odds the turkey will taste dry, airports and highways are expected to be jam-packed during Thanksgiving week, a holiday period likely to end in another record day for air travel in the United States.",
      "publishedAt": "2024-11-25T05:03:32Z",
      "title": "‘Busiest Thanksgiving ever’: How the TSA plans to handle record air travel",
      "url": "https://apnews.com/38cfcfe5f9d7b19fdc9d843827ed21f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0cb4c706181470793e0f29dcc0749d8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}