{
  "articles": [
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Sitting in the Oval Office behind the iconic Resolute desk in 2022, an animated President Joe Biden described the challenge of leading a psychologically traumatized nation.",
      "publishedAt": "2024-07-21T19:50:43Z",
      "title": "Biden's legacy: Far-reaching accomplishments that didn't translate into political support",
      "url": "https://apnews.com/5aee4f47ecb317d4f6ef2a2148eba1d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dde32eb91d14997817d14172e06bb9e/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris moved swiftly to lock up Democratic delegates behind her campaign for the White House after President Joe Biden stepped aside amid concerns from within their own party that he would be unable to defeat Donald Trump.",
      "publishedAt": "2024-07-22T04:16:47Z",
      "title": "Harris looks to lock up Democratic nomination after Biden steps aside, reordering 2024 race",
      "url": "https://apnews.com/9fbd153493cb3f088994854fe61a73e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81affd8f52e54bf6b90a1955555c4f8f/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — For the past year, the presidential campaign seemed destined to be a monotonous slog featuring two candidates, President Joe Biden and former President Donald Trump, that voters didn’t really want.",
      "publishedAt": "2024-07-22T04:14:59Z",
      "title": "Harris gets chance to press reset on 2024 race against Trump",
      "url": "https://apnews.com/90b9d5c6dc5553703af88dfa442a6bac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81affd8f52e54bf6b90a1955555c4f8f/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump's campaign has spent the last year-and-a-half viciously attacking Joe Biden, ridiculing his policies, mocking his fumbles and relishing a rematch they felt they were winning.",
      "publishedAt": "2024-07-22T00:15:45Z",
      "title": "Trump's campaign quickly pivots to Harris after Biden announces decision to leave the race",
      "url": "https://apnews.com/920d7fe1c364e82290abeb9e0d1411c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d77e08bb46d044c39dbb00e5ec4f3a6e/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "President Joe Biden’s abrupt decision to bow out of the presidential race and endorse Vice President Kamala Harris to be the Democratic candidate against former President Donald Trump caused a political earthquake on Sunday.",
      "publishedAt": "2024-07-22T04:18:33Z",
      "title": "Takeaways from a day that fundamentally changed the presidential race",
      "url": "https://apnews.com/23adb69be6a46f9a72f46886e2e6bfba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ded1e540ed104ef78f8fcc23a383c66c/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Joe Biden's withdrawal from the U.S. presidential race injects greater uncertainty into the world at a time when Western leaders are grappling with wars in Ukraine and Gaza, a more assertive China in Asia and the rise of the far-right in Europe.",
      "publishedAt": "2024-07-22T02:02:54Z",
      "title": "Biden's withdrawal injects uncertainty into wars, trade disputes and other foreign policy challenges",
      "url": "https://apnews.com/a627c5f773d5f440541bd299efe3dbc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff95bfc102b4f5e9407e4e3a1df5389/2567.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and AAMER MADHANI",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu heads to Washington on Monday, leaving behind a brutal war to make a politically precarious speech before Congress at a time of great uncertainty following Joe Biden’s withdrawal from the presidential race.",
      "publishedAt": "2024-07-21T20:48:50Z",
      "title": "Israel's Netanyahu walks political tightrope on Washington trip following Biden's exit from race",
      "url": "https://apnews.com/9e207697206c7d4f31e4ca07e19c5565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0179ecc96d87421cb879f755d1471a19/2666.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — U.S. Homeland Security Secretary Alejandro Mayorkas has appointed a bipartisan, independent panel to review this month's assassination attempt on former President Donald Trump, officials said Sunday.",
      "publishedAt": "2024-07-22T02:16:43Z",
      "title": "Homeland Security secretary names independent panel to review Trump assassination attempt",
      "url": "https://apnews.com/e978cb8e572fb6d9091ede49320612ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0d82892170e4e34a322cc068fc7f0e8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — Airlines, including Delta Air Lines, continued to struggle to restore operations two days after a faulty software update caused technological havoc worldwide and resulted in several carriers grounding flights.",
      "publishedAt": "2024-07-21T21:38:25Z",
      "title": "Delta Air Lines says cancellations continue as it tries to restore operations after tech outage",
      "url": "https://apnews.com/bc470d7ae7c1627b2b590d2cb01b2b4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc8edbd7425b42ea8b5e69a07045e55f/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — China’s central bank has cut both its five-year loan prime rate and its one-year rate, moving to revive its ailing property sector and rev up the slowing economy.The five-year rate, which is a benchmark for mortgages, was cut by 10 basis points to 3.85% from 3.95%.",
      "publishedAt": "2024-07-22T04:24:48Z",
      "title": "China's central bank cuts interest rates, moving to put more pep into the economy",
      "url": "https://apnews.com/4fadac1744961f47a1c10db74c9fd30d",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}