{
  "articles": [
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Speaker Kevin McCarthy said he is launching an impeachment inquiry against President Joe Biden, yielding to mounting pressure from former President Donald Trump and his allies in what's shaping up as an election-year clash between Congress and the White House.",
      "publishedAt": "2023-09-12T17:17:48Z",
      "title": "What's ahead now that Republicans are opening an impeachment inquiry into President Joe Biden",
      "url": "https://apnews.com/57c5b1b40d19ede4ecf7fde08c027cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bfbc34ffc1445b2a3331c7bab014a0e/1920.jpeg"
    },
    {
      "author": "ADRIAN SAINZ and JONATHAN MATTISE",
      "description": "MEMPHIS, Tenn. (AP) — Five former Memphis police officers were charged Tuesday with federal civil rights violations in the beating death of Tyre Nichols as they continue to fight second-degree murder charges in state courts arising from the killing.",
      "publishedAt": "2023-09-12T18:12:39Z",
      "title": "5 former officers charged with federal civil rights violations in Tyre Nichols beating death",
      "url": "https://apnews.com/c1fe19b1377365969a6335de61a952e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d5c017f658241f89ed2376eaa198a2b/2498.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "CUPERTINO, Calif. (AP) — Apple on Tuesday unveiled its next generation of iPhones — a line-up that will boast better cameras, faster processors, a new charging system and a price hike for the fanciest model.",
      "publishedAt": "2023-09-12T04:00:59Z",
      "title": "Apple’s new iPhones get faster chips, better cameras and new charging ports",
      "url": "https://apnews.com/4ce309e39cabc302912bcf189605483e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9bd19ec55e34993abbac6192afabaac/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Emergency workers uncovered more than 1,500 bodies in the wreckage of Libya’s eastern city of Derna on Tuesday, and it was feared the toll could spiral with 10,000 people reported still missing after floodwaters smashed through dams and washed away entire neighborhoods of the city.",
      "publishedAt": "2023-09-12T07:33:18Z",
      "title": "10,000 people are missing and thousands are feared dead as eastern Libya is devastated by floods",
      "url": "https://apnews.com/95379b164871d97fb74b1cd1bcb5640c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7a1b3f322b14026b5dd62496e00cd76/3000.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "An earthquake has sown destruction and devastation in Morocco, where death and injury counts continue to rise after rescue crews dug out people both alive and dead in villages that were reduced to rubble.",
      "publishedAt": "2023-09-11T04:05:47Z",
      "title": "What to know about the Morocco earthquake and the efforts to help",
      "url": "https://apnews.com/fe5a0fbe71646f9b1b4f6a85889b414a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a48360284cd643168ce407a5474db602/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and MICHAEL LIEDTKE",
      "description": "WASHINGTON (AP) — Google has exploited its dominance of the internet search market to lock out competitors and smother innovation, the Department of Justice said Tuesday at the opening of the biggest U.S.",
      "publishedAt": "2023-09-12T04:04:04Z",
      "title": "US claims Google pays more than $10 billion a year to maintain its search dominance",
      "url": "https://apnews.com/687b9a5b90ec18f207d36df3ba11aebd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77c834d682e946c987572cb253f4c34c/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE and COREY WILLIAMS",
      "description": "CHICAGO (AP) — It took four and a half months for Shannon Ross’ life to unravel.Ross, who describes himself as Indigenous and a person of color, was arrested in Chicago in October 2019 on weapons charges and ultimately found not guilty.",
      "publishedAt": "2023-09-12T04:10:31Z",
      "title": "Cash bail disproportionately impacts communities of color. Illinois is the first state to abolish it",
      "url": "https://apnews.com/b8aac667b7d3016e12ea64a70964bf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00bb869152984e6291b73a8afe103bcb/3000.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE and MARC LEVY",
      "description": "POTTSTOWN, Pa. (AP) — Escaped murderer Danelo Souza Cavalcante stole a rifle from a garage and fled a homeowner's gunfire, authorities said Tuesday as police closed roads in a rural stretch of southeastern Pennsylvania, told residents to lock their doors and set up a new search area in the nearly 2-week-old manhunt.",
      "publishedAt": "2023-09-12T11:09:39Z",
      "title": "Escaped Pennsylvania inmate stole rifle, fled homeowner's gunfire and remains at large, police say",
      "url": "https://apnews.com/b59e73762beca9ec9852be97afca39e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f16925bc916648f5bca2f824dbf623a5/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — During her husband’s 1992 presidential campaign, Hillary Clinton observed that “our lives are a mixture of different roles” and said most people are trying to find the right balance.",
      "publishedAt": "2023-09-12T04:05:48Z",
      "title": "Hillary Clinton is stepping over the White House threshold in yet another role",
      "url": "https://apnews.com/3648880e2ee103817073ece8e1c082a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13de3d63d0bd454e9476098865f50de1/2900.jpeg"
    },
    {
      "author": "KRISTIE RIEKEN",
      "description": "HOUSTON (AP) — It’s almost 10 p.m. and still a sweltering, sticky 95 degrees when Texas Southern’s Ocean of Soul band marches onto the top of a parking garage a stone’s throw from downtown Houston.",
      "publishedAt": "2023-09-12T16:09:22Z",
      "title": "For HBCUs, the bands are about much more than the show to the Black community: 'This is family'",
      "url": "https://apnews.com/33ac33f006b67ad1713a07843ad6172a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a556bddfd1204a00add12075ce401dab/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}