{
  "articles": [
    {
      "author": "FARID ABDULWAHED",
      "description": "MOSUL, Iraq (AP) — A raging fire seemingly caused by fireworks set off to celebrate a Christian wedding consumed a hall packed with guests in northern Iraq, killing more than 100 people and injuring 150 others as authorities warned Wednesday the death toll could still rise.",
      "publishedAt": "2023-09-26T23:57:11Z",
      "title": "A fire at a wedding hall in northern Iraq has killed more than 100 people and injured 150",
      "url": "https://apnews.com/1d8a5dbbda46a01b1688a547b95b39a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0a2a7c200643e09520b4783e75dc49/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House, and he ordered some of the former president's companies removed from his control and dissolved.",
      "publishedAt": "2023-09-26T20:24:03Z",
      "title": "Judge rules Donald Trump defrauded banks, insurers while building real estate empire",
      "url": "https://apnews.com/1569245a9284427117b8d3ba5da74249",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa036bfc4ccf4693a48708be783f0fb1/1424.jpeg"
    },
    {
      "author": "WILL WEISSERT and STEVE PEOPLES",
      "description": "SIMI VALLEY, Calf. (AP) — Republicans are meeting for their second presidential debate Wednesday as his top rivals seek to blunt the momentum of Donald Trump, who is so confident of cruising through the party's primary that he again won't share a stage with them.",
      "publishedAt": "2023-09-27T04:02:52Z",
      "title": "Republicans face growing urgency to stop Trump as they enter the second presidential debate",
      "url": "https://apnews.com/46ce9209b5150d577d5ff361522f6bed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f821a87729234c77b5bb05ec00c57864/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A total of 192 Azerbaijani troops were killed and 511 were wounded during Azerbaijan’s offensive in Nagorno-Karabakh last week, the country’s Health Ministry announced on Wednesday. It also said that one Azeri civilian died in the hostilities.",
      "publishedAt": "2023-09-27T07:30:05Z",
      "title": "Azerbaijan says 192 of its troops were killed in last week's offensive in Nagorno-Karabakh",
      "url": "https://apnews.com/1d13668014fac4e44a76c04b54378268",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81724fbdf3fd421291dc1002223c6176/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, JENNIFER McDERMOTT and BERNARD CONDON",
      "description": "Melted remains of an old car tire. Heavily burned trees. A charred stump of an abandoned utility pole.Investigators are examining these and other pieces of evidence as they seek to solve the mystery of last month’s deadly Maui wildfire: How did a small, wind-whipped fire sparked by downed power lines and declared extinguished flare up again hours later into a devastating inferno?",
      "publishedAt": "2023-09-27T05:19:57Z",
      "title": "How did the Maui fire spread so quickly? Overgrown gully, stubborn embers may be key to probe",
      "url": "https://apnews.com/d9e1e84d5cc643d6bb2a2e362fe58ba0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0f3d99ac761488296cefd77a8e26250/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Hollywood's writers strike was declared over after nearly five months Tuesday night when board members from their union approved a contract agreement with studios, bringing the industry at least partly back from a historic halt in production.",
      "publishedAt": "2023-09-26T04:20:20Z",
      "title": "The Hollywood writers strike is over after guild leaders approve contract with studios",
      "url": "https://apnews.com/d3119d670a4fd3449773bf8f4026fb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0908b98aea9b41acb07b8537bf4bfcef/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The Congress is starkly divided over very different paths to preventing a federal shutdown — the Senate charging ahead with a bipartisan package to temporarily fund the government but the House slogging through a longshot effort with no real chance of finishing by Saturday's deadline.",
      "publishedAt": "2023-09-26T04:03:27Z",
      "title": "Congress says its wants to avoid a shutdown. But the House and Senate are moving even further apart.",
      "url": "https://apnews.com/e4c37673b6507deaed2902f2166ef759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9e637e076fb46108471b6eb0ffb3180/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama is headed to the first significant revamp of its congressional map in three decades after the U.S. Supreme Court rejected the state's bid to keep using a plan with a single majority-Black district.",
      "publishedAt": "2023-09-27T04:12:47Z",
      "title": "In a win for Black voters in redistricting case, Alabama to get new congressional lines",
      "url": "https://apnews.com/114ba2e144d903efc77ad31fe40ee47f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3553aeb0177b4521a3a56be96093a4ac/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "KATOWICE, Poland (AP) — Poland’s hard-right Confederation party opened its electoral campaign convention as if it were a rock concert, with a singer riding up on a motorcycle, its engine revving, and a pyrotechnic show of flames and sparklers.",
      "publishedAt": "2023-09-27T04:11:40Z",
      "title": "A hard-right party gathers strength in Poland, pushing a new, less friendly course on Ukraine",
      "url": "https://apnews.com/3d29f10eb59ad880c6f64d5025277a8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f74c0bcf8d3e49caae3cd15b02187750/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — In a new study, Black Americans expressed broad concerns about how they are depicted in the news media, with majorities saying they see racist or negative depictions and a lack of effort to cover broad segments of their community.",
      "publishedAt": "2023-09-27T05:17:13Z",
      "title": "Black Americans express concerns about racist depictions in news media, lack of coverage efforts",
      "url": "https://apnews.com/8d09b5fc085c82a1c4835348333cf396",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76ebf11919544fa2a628747d7e2455d3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}