{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Prosecutors said Thursday they are open to delaying the start of Donald Trump's New York hush-money criminal trial by a month “in an abundance of caution” to give the former president's lawyers time to review evidence they only recently obtained from a previous federal investigation into the matter.",
      "publishedAt": "2024-03-14T19:26:57Z",
      "title": "Prosecutors say they're open to delaying Donald Trump's March 25 hush-money trial for a month",
      "url": "https://apnews.com/0ad15520f3f9779425d1cb6077e8c11c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d72ddf41bc64d0598b26373d43d50d3/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Voters headed to the polls in Russia on Friday for a three-day presidential election that is all but certain to extend President Vladimir Putin’s rule by six more years after he stifled dissent.",
      "publishedAt": "2024-03-14T20:08:48Z",
      "title": "Russians head to polls in a vote set to extend Putin's rule. His foes are in jail, in exile or dead",
      "url": "https://apnews.com/227e65cb2a3f2c4cfdb58a9525fbe884",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/968a29df82694a8f9cf1c6d2c43e2101/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — A major deadline under the half-century-old War Powers Resolution came this week for President Joe Biden to obtain Congress' approval to keep waging his military campaign against Yemen's Houthis, in line with its sole authority under the U.S.",
      "publishedAt": "2024-03-14T18:50:27Z",
      "title": "Middle East conflicts revive clash between the president and Congress over war powers",
      "url": "https://apnews.com/c9cfce9a874fbc520ddcc4ef182bf63a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31f5747452d24997a17423aa31dcecbd/3000.jpeg"
    },
    {
      "author": "BERT WILKINSON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A plan to create a transitional presidential council is moving forward after a majority of Haitian parties and coalitions submitted the names of those charged with finding new leaders for the country, Caribbean officials said Thursday.",
      "publishedAt": "2024-03-14T17:34:42Z",
      "title": "A plan to find new leadership for Haiti is moving forward, Caribbean officials say",
      "url": "https://apnews.com/442ae5ac6eeab904ceaaa23e7672e6f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffc6e7ce4afc4ece8c5d269f1b66e59d/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Senate Majority Leader Chuck Schumer on Thursday called on Israel to hold new elections, saying he believes Israeli Prime Minister Benjamin Netanyahu has “lost his way” and is an obstacle to peace in the region amid a growing humanitarian crisis in Gaza.",
      "publishedAt": "2024-03-14T14:06:07Z",
      "title": "Top Democrat Schumer calls for new elections in Israel, saying Netanyahu is an obstacle to peace",
      "url": "https://apnews.com/1ebf21e4c9c0f6f42478bb26e1db7a9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af34ae813d414c61b9ad964c631e580a/1920.jpeg"
    },
    {
      "author": null,
      "description": "RAMALLAH, West Bank (AP) — Palestinian President Mahmoud Abbas has appointed his longtime economic adviser to be the next prime minister in the face of U.S. pressure to reform the Palestinian Authority as part of Washington's postwar vision for Gaza.",
      "publishedAt": "2024-03-14T18:28:59Z",
      "title": "Palestinian leader appoints longtime adviser as prime minister in the face of calls for reform",
      "url": "https://apnews.com/d7907aa06db3d6be6f8d59cc29e57897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3290a58783874b6ca09767da7a12d748/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO and MICHELLE CHAPMAN",
      "description": "Former Treasury Secretary Steven Mnuchin said Thursday that he will put together an investor group to buy TikTok after the House passed a bill that would ban the popular video app in the U.S.",
      "publishedAt": "2024-03-14T13:05:09Z",
      "title": "Former Treasury Secretary Steve Mnuchin says he's putting together investor group to buy TikTok",
      "url": "https://apnews.com/ffdf37776e63a09bb6966d741df7093b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c132bd4a62f94ddf912df7fd06970e80/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — With the Supreme Court's approval hovering near record lows, two justices have teamed up to promote the art of disagreeing without being nasty about it.",
      "publishedAt": "2024-03-14T14:46:34Z",
      "title": "Supreme Court Justices Barrett and Sotomayor, ideological opposites, unite to promote civility",
      "url": "https://apnews.com/cef871fc8ed114bae1e444bdaae4f31d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3da21f1f6304f0688961c8cd97d11db/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis says he has no plans to resign and isn’t suffering from any health problems that would require doing so, saying in a new memoir he still has “many projects to bring to fruition.”",
      "publishedAt": "2024-03-14T12:27:56Z",
      "title": "Pope acknowledges criticism, health issues but says in upcoming memoir he has no plans to retire",
      "url": "https://apnews.com/0cac91e2193178dd221f1ed751e45e36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2396962db3146948b59474d1e614e4a/3000.jpeg"
    },
    {
      "author": "GIOVANNA DELL'ORTO and DARREN SANDS",
      "description": "MIAMI (AP) — Neglect, abandonment and destruction have been the fate of thousands of segregated cemeteries across the country where African Americans – from former slaves to prominent politicians and business owners -- were buried over many decades.",
      "publishedAt": "2024-03-14T12:20:53Z",
      "title": "As threats to Black cemeteries persist, a movement to preserve their sacred heritage gains strength",
      "url": "https://apnews.com/f606d64a95bb7ffaccbf731840a21a25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9954a3c665b3491fadea2bce818a3ca6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}