{
  "articles": [
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Israel has agreed to put in place four-hour daily humanitarian pauses in its assault on Hamas in northern Gaza starting on Thursday, the White House said, as President Joe Biden pressed Israelis for a multi-day stoppage in the fighting in a bid to release hostages held by the militant group.",
      "publishedAt": "2023-11-09T15:48:45Z",
      "title": "Israel agrees to 4-hour daily pauses in Gaza fighting to allow civilians to flee, White House says",
      "url": "https://apnews.com/b8fc613ffd8b9351c0dc37b90b6e10dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1414b74133994ae49af28a27f296e337/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — Fistfights break out in bread lines. Residents wait hours for a gallon of brackish water that makes them sick. Scabies, diarrhea and respiratory infections rip through overcrowded shelters.",
      "publishedAt": "2023-11-09T17:18:45Z",
      "title": "Fights in bread lines, despair in shelters: War threatens to unravel Gaza's close-knit society",
      "url": "https://apnews.com/f225bf0723bb5b3ae1961ba6cdef1917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b243a9f66318463ea4c7f7f5d7a08d0f/3000.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "CHARLESTON, W.Va. (AP) — Democratic Sen. Joe Manchin of West Virginia announced Thursday that he won’t seek reelection in 2024, giving Republicans a prime opportunity to pick up a seat in the heavily GOP state.",
      "publishedAt": "2023-11-09T19:44:58Z",
      "title": "Democratic Sen. Joe Manchin of West Virginia says he won’t seek reelection in 2024",
      "url": "https://apnews.com/35e5285934c5801db37215802ca2cd94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07a2ad0f68e84f77852cdf9020746e84/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NEW YORK (AP) — Surgeons have performed the world’s first transplant of an entire human eye, an extraordinary addition to a face transplant — although it’s far too soon to know if the man will ever see through his new left eye.",
      "publishedAt": "2023-11-09T15:30:52Z",
      "title": "Man receives the first eye transplant plus a new face. It's a step toward one day restoring sight",
      "url": "https://apnews.com/0d88cbb9d6190c64b53c01fafb9c2d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/056903a87ac0452886b59ea037a3bfd4/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "WASHINGTON (AP) — Authorities on Thursday were trying to determine who sent letters filled with fentanyl or other substances to local election offices, an attack that appears to have targeted multiple states in the latest instance of threats faced by election workers around the country.",
      "publishedAt": "2023-11-09T15:57:36Z",
      "title": "Election offices are sent envelopes with fentanyl or other substances. Authorities are investigating",
      "url": "https://apnews.com/5d39155be4b2fcd5481b570cc109cb9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e4dae3207764751a43b37aa1ea5078f/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Democrats on the Senate Judiciary Committee abruptly adjourned a meeting on Thursday without holding an expected vote on subpoenas for two conservatives who have helped arrange luxury travel and other benefits for Supreme Court justices.",
      "publishedAt": "2023-11-09T18:42:54Z",
      "title": "Democrats postpone a subpoena vote in the Supreme Court ethics probe after a blowup with Republicans",
      "url": "https://apnews.com/18343a29419f8534a50384fb91deb15b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48464b46884f430bae068e9dd742cafa/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "SMITHS STATION, Ala. (AP) — After the 2019 suicide of a local teenager, small-town mayor and pastor F.L. “Bubba” Copeland helped students place roadside signs in his Alabama community to try to reach others who might be hurting.",
      "publishedAt": "2023-11-09T17:44:32Z",
      "title": "Pastor's suicide brings grief, warnings of the dangers of outing amid erosion of LGBTQ+ rights",
      "url": "https://apnews.com/1a7394ab2d25d9bc96314e232de610a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d4c2b45421542ea92f1e20412fe77f6/1763.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SAN FRANCISCO (AP) — The man accused of bludgeoning former House Speaker Nancy Pelosi’s husband with a hammer was caught up in conspiracies when he broke into her San Francisco home last year, his defense attorney said at his trial opened Thursday.",
      "publishedAt": "2023-11-09T05:35:59Z",
      "title": "The man accused of attacking Nancy Pelosi's husband was caught up in conspiracies, defense says",
      "url": "https://apnews.com/28f189e4b005b8f7d413df0b79f2aeaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f660d6b2c1f94b24b9f0e526e3af140b/2402.jpeg"
    },
    {
      "author": "ALICIA LEÓN and JOSEPH WILSON",
      "description": "MADRID (AP) — Veteran Spanish right-wing politician Alejandro Vidal-Quadras was shot in the face in broad daylight on a central Madrid street on Thursday. His life was not in danger, according to the hospital where he was rushed for treatment.",
      "publishedAt": "2023-11-09T14:08:27Z",
      "title": "Spanish conservative politician is shot in the face in Madrid. The gunman fled on a motorbike",
      "url": "https://apnews.com/d98bb2f3c482eb006ece10b8669d4c12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2aa0c1617fff409e91bca18abf758266/2465.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The proportion of U.S. kindergartners exempted from school vaccination requirements has hit its highest level ever, 3%, U.S. health officials said Thursday.More parents are questioning routine childhood vaccinations that they used to automatically accept, an effect of the political schism that emerged during the pandemic around COVID-19 vaccines, experts say.",
      "publishedAt": "2023-11-09T18:05:27Z",
      "title": "US childhood vaccination exemptions reach their highest level ever",
      "url": "https://apnews.com/951427e55b24c8e7eb3a23b26946f630",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6331ae0b34ef460e8154e59b676beaf9/2954.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}