{
  "articles": [
    {
      "author": "TIA GOLDENBERG, JON GAMBRELL and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — A senior Qatari official has urged both Israel and Hamas to show “more commitment and more seriousness” in cease-fire negotiations in interviews with Israeli media, as pressure builds on both sides to move toward a deal that would set Israeli hostages free and bring potential respite in the nearly 7-month-long war in Gaza.",
      "publishedAt": "2024-04-28T08:41:07Z",
      "title": "A top Qatari official urges Israel and Hamas to do more to reach a cease-fire deal",
      "url": "https://apnews.com/78410c1eaf671008cd60dccc00b44ee4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/719c3ed84e8a4ba3a3a51f1d04bde07a/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY and JAMES POLLARD",
      "description": "NEW YORK (AP) — From New York to California, students protesting the Israel-Hamas war slept in tents at college campuses, as some universities moved to shut down encampments and arrested dozens of demonstrators.",
      "publishedAt": "2024-04-28T07:50:08Z",
      "title": "Campus anti-war protesters dig in from New York to California as universities and police take action",
      "url": "https://apnews.com/cadbf05cf542c08dc3c664431b7a1f4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68cbf35472b2423f8c9e93862f3b001d/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The war in Gaza spurred large protests outside a glitzy roast with President Joe Biden, journalists, politicians and celebrities Saturday but went all but unmentioned by participants inside, with Biden instead using the annual White House correspondents’ dinner to make both jokes and grim warnings about Republican rival Donald Trump’s fight to reclaim the U.S.",
      "publishedAt": "2024-04-27T20:26:17Z",
      "title": "Chants of ‘shame on you’ greet guests at White House correspondents’ dinner shadowed by war in Gaza",
      "url": "https://apnews.com/5843271c1d3a868d700cfc525ddc7f8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fd802767c8b4ed6b5b81babed72bb62/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Even by Donald Trump's standards, this was a dizzying week.The first criminal prosecution of a former president began in earnest with opening statements and testimony in a lower Manhattan courtroom.",
      "publishedAt": "2024-04-27T13:08:58Z",
      "title": "From New York to Arizona: Inside the head-spinning week of Trump's legal drama",
      "url": "https://apnews.com/72a13a37ece0a71daf45b5d7d819ae03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4c084ed9cba41559eb42c574c864283/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Harvey Weinstein’s lawyer said Saturday that the onetime movie mogul has been hospitalized for a battery of tests after his return to New York City following an appeals court ruling nullifying his 2020 rape conviction.",
      "publishedAt": "2024-04-27T18:37:25Z",
      "title": "Harvey Weinstein hospitalized after his return to New York from upstate prison",
      "url": "https://apnews.com/12b765ba6ec3b9522d2ff5ed46cc7af6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1603ce19062346a19d97310b059c8d93/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA, OMAR FARUK and DESMOND TIRO",
      "description": "HARARE, Zimbabwe (AP) — From ancient fertilizer methods in Zimbabwe to new greenhouse technology in Somalia, farmers across the heavily agriculture-reliant African continent are looking to the past and future to respond to climate change.",
      "publishedAt": "2024-04-28T05:06:18Z",
      "title": "African farmers look to the past and the future to address climate change",
      "url": "https://apnews.com/e0edfba75053cad02097f2e5bfe528fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5926ed5e788e410fae03c026c1c4def1/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and PAOLO SANTALUCIA",
      "description": "VENICE, Italy (AP) — Venice has always been a place of contrasts, of breathtaking beauty and devastating fragility, where history, religion, art and nature have collided over the centuries to produce an otherworldly gem of a city.",
      "publishedAt": "2024-04-28T04:10:44Z",
      "title": "Pope visits Venice to speak to the artists and inmates behind the Biennale's must-see prison show",
      "url": "https://apnews.com/885ddbcd4171c3ba08e1e8ee6039ddc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0e3bd72ccd74f0fa65885ddc0e2b267/1920.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "JOINT BASE PEARL HARBOR-HICKAM, Hawaii (AP) — Richelle Dietz, a mother of two and wife of a U.S. Navy officer, often thinks about water. The family, stationed in Honolulu, spends more than $120 a month on jugs of bottled water for drinking, cooking and cleaning, as well as showerhead and sink filters.",
      "publishedAt": "2024-04-28T04:13:29Z",
      "title": "A Hawaii military family avoids tap water at home. They're among those suing over 2021 jet fuel leak",
      "url": "https://apnews.com/6a8e02155741552aaa5611ac9f89e79f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ac6b66649e643b4b12a2435e1a3de27/3000.jpeg"
    },
    {
      "author": "SOPHENG CHEANG",
      "description": "CHBAR MON, Cambodia (AP) — Security was tight around a military base in southwestern Cambodia on Sunday, a day after a huge explosion there killed 20 soldiers, wounded others and damaged nearby houses.",
      "publishedAt": "2024-04-28T05:02:34Z",
      "title": "A munitions explosion at a Cambodian army base kills 20 soldiers, but its cause is unclear",
      "url": "https://apnews.com/530def1f2c8da38138d73b0b895df0e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ead89878cdc4a00bc5b9fb045160c43/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER",
      "description": "OKMULGEE, Okla. (AP) — As winter fades to spring and the bright purple blossoms of the redbud trees begin to bloom, Cherokee chef Bradley James Dry knows it’s time to forage for morels as well as a staple of Native American cuisine in Oklahoma: wild green onions.",
      "publishedAt": "2024-04-28T04:15:40Z",
      "title": "Wild onion dinners mark the turn of the season in Indian Country",
      "url": "https://apnews.com/8854fa8c3e90eec5f16e9331d2af1156",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec7296141b1b41469a312aa236cc5702/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}