{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel pressed ahead with its Gaza offensive on Sunday after a series of shootings, including of three hostages who were shirtless and waving a white flag, raised questions about its conduct in a 10-week-old war that has brought unprecedented death and destruction to the coastal enclave.",
      "publishedAt": "2023-12-17T07:44:45Z",
      "title": "Israel presses ahead in Gaza as errant killing of captives adds to concern about its wartime conduct",
      "url": "https://apnews.com/22e6e6ac2098dbf29c89c1a49980907b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/737f8c227eb24d81876b14576667de6b/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Tantrums, tears, temperature, toilet accidents. These travails of childhood are familiar to any parent. But for Doron Katz Asher, the daily whims of children took on a new, frightening dimension while in Hamas captivity with her two young daughters.",
      "publishedAt": "2023-12-17T09:52:26Z",
      "title": "In Hamas captivity, an Israeli mother found the strength to survive in her 2 young daughters",
      "url": "https://apnews.com/e43def41c75a1da378e59d7f126b351c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd36e51b8c1145c7b37028b282523b2a/1600.jpeg"
    },
    {
      "author": "NOREEN NASIR and AARON MORRISON",
      "description": "Cydney Wallace, a Black Jewish community activist, never felt compelled to travel to Israel, though “Next year in Jerusalem” was a constant refrain at her Chicago synagogue.The 39-year-old said she had plenty to focus on at home, where she frequently gives talks on addressing anti-Black sentiment in the American Jewish community and dismantling white supremacy in the U.S.",
      "publishedAt": "2023-12-17T05:02:29Z",
      "title": "Black American solidarity with Palestinians is rising and testing longstanding ties to Jewish allies",
      "url": "https://apnews.com/966a5eb8f0fb5b34beced29c4dda7331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d09d1ca576849aeb3a571a638c60632/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER SHERMAN",
      "description": "MEXICO CITY (AP) — Once nearly impenetrable for migrants heading north from Latin America, the jungle between Colombia and Panama this year became a speedy but still treacherous highway for hundreds of thousands of people from around the world.",
      "publishedAt": "2023-12-17T05:09:40Z",
      "title": "Jungle between Colombia and Panama becomes highway for migrants from around the world",
      "url": "https://apnews.com/712d00c90114568fe8a1b5c9e26fdadd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4294f14f09a24ca0beeba0b14dc0120f/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Ohio was in the throes of a bitter debate over abortion rights this fall when Brittany Watts, 21 weeks and 5 days pregnant, began passing thick blood clots.",
      "publishedAt": "2023-12-16T13:05:43Z",
      "title": "A Black woman was criminally charged after a miscarriage. It shows the perils of pregnancy post-Roe",
      "url": "https://apnews.com/b8090abfb5994b8a23457b80cf3f27ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db051f5015a34a778b33012988b84790/3000.jpeg"
    },
    {
      "author": null,
      "description": "COLUMBUS, Ohio (AP) — The Ohio Supreme Court has dismissed the state’s challenge to a judge’s order that has blocked enforcement of Ohio's near-ban on abortions for the past 14 months.",
      "publishedAt": "2023-12-16T17:26:55Z",
      "title": "Order blocking enforcement of Ohio abortion ban stands after high court dismisses appeal",
      "url": "https://apnews.com/9d8f9e75aecb1ce2dc98d2e9ff9b4071",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd4b52d8846d466d982eba16f781154f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — A boat carrying dozens of migrants trying to reach Europe capsized off the coast of Libya, leaving more than 60 people dead, including women and children, the U.N. migration agency said.",
      "publishedAt": "2023-12-17T05:39:05Z",
      "title": "Over 60 people have drowned in the capsizing of a migrant vessel off Libya, the UN says",
      "url": "https://apnews.com/8c2f45c6a54e09fe4f234f9f60398b4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7739307da4ed460cb01f56b2ea9c2292/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — The scene: A crowded shopping center in the weeks before Christmas. Or a warehouse store. Or maybe a packed airport terminal or a commuter train station or another place where large groups gather.",
      "publishedAt": "2023-12-17T05:05:58Z",
      "title": "As 2023 holidays dawn, face masks have settled in as an occasional feature of the American landscape",
      "url": "https://apnews.com/8337bc3f9c5d99192d7bf58a7c2e7cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a144e3937ef34ebea990ff5653bc5141/3000.jpeg"
    },
    {
      "author": "JACK DURA",
      "description": "BISMARCK, N.D. (AP) — All election ballots would be counted by hand under a proposal that could go to North Dakota voters, potentially achieving a goal of activists across the country who distrust modern vote counting but dismaying election officials who say the change would needlessly delay vote tallies and lead to more errors.",
      "publishedAt": "2023-12-17T05:07:46Z",
      "title": "Can a state count all its votes by hand? A North Dakota proposal aims to be the first to try",
      "url": "https://apnews.com/2a96b85f9ddd807d5b7d5a4d5fe4b363",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63343dbea65a4b6d89443a2fb2723b1f/2880.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JALAL BWAITEL",
      "description": "BETHLEHEM, West Bank (AP) — Bethlehem is gearing up for a subdued Christmas, without the festive lights and customary Christmas tree towering over Manger Square, after officials in Jesus' traditional birthplace decided to forgo celebrations due to the Israel-Hamas war.",
      "publishedAt": "2023-12-16T18:22:52Z",
      "title": "Under the shadow of war in Gaza, Jesus' traditional birthplace is gearing up for a subdued Christmas",
      "url": "https://apnews.com/a42bbd967c27a68f71f8aace59387963",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fef988b26d164296a258e7531462d630/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}