{
  "articles": [
    {
      "author": "EMMA BURROWS and DASHA LITVINOVA",
      "description": "Russians crowded outside polling stations at noon Sunday on the last day of a presidential election, apparently heeding an opposition call to protest against President Vladimir Putin in a vote that offered them no real alternatives after he ruthlessly cracked down on dissent.",
      "publishedAt": "2024-03-17T05:27:51Z",
      "title": "Putin is poised to extend his rule in highly orchestrated vote even as Russians quietly protest",
      "url": "https://apnews.com/d4dcaa5c93dc44b745cec7d811831daa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ead152dbfb6849648e48705f30337154/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and RAVI NESSMAN",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu railed Sunday against growing criticism from top ally the United States against his leadership amid the devastating war with Hamas, describing calls for a new election as “wholly inappropriate.”",
      "publishedAt": "2024-03-17T13:19:11Z",
      "title": "Netanyahu snaps back against growing US criticism after being accused of losing his way on Gaza",
      "url": "https://apnews.com/ab0b75fdd8f0ab51c5e38b1870afecd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Hamas’ unprecedented raid on southern Israel has prompted a legal predicament: How does a country scarred by the deadliest attack in its history bring the perpetrators to justice?",
      "publishedAt": "2024-03-17T04:19:33Z",
      "title": "How should Israel bring to justice the perpetrators behind the worst attack in its history?",
      "url": "https://apnews.com/2af944dfd5a55dff0876fd3a9743afb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dc88efc70ac4845a30a86dfead636f4/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Judge Juan M. Merchan looked across his high-ceilinged courtroom, facing the defendant in a complicated case.Not the one everyone knows about. Yes, Merchan could become the first judge ever to oversee a former U.S.",
      "publishedAt": "2024-03-17T05:23:05Z",
      "title": "'There's no agenda here': A look at the judge who is overseeing Trump's hush money trial",
      "url": "https://apnews.com/c227f5eab200cccffb19ed931b4dac92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5f9f4ebb4804490b7874a3648a9ab61/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "BOSTON (AP) — While some American cities celebrated St.",
      "publishedAt": "2024-03-17T20:59:23Z",
      "title": "AP PHOTOS: Boston celebrates St. Patrick's Day; Biden holds White House brunch with Irish leader",
      "url": "https://apnews.com/3f3db00d515d8696c0509f663a9256a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74aa7a6299fe426db987ef66475d2bb6/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and JILL COLVIN",
      "description": "VANDALIA, Ohio (AP) — Former President Donald Trump claimed that he — not President Joe Biden — will protect Social Security and warned of a “bloodbath” if he loses in November as he campaigned for Senate candidate Bernie Moreno in Ohio.",
      "publishedAt": "2024-03-16T22:52:17Z",
      "title": "Trump ramps up dark rhetoric in Ohio stump speech for Senate candidate Bernie Moreno",
      "url": "https://apnews.com/3b450dcfc24a02c8cac3a3feb657ddc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ba397c940fa45bd8e561a812792b01a/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Vaughan Gething's election as the next leader of Wales marks a milestone: For the first time, none of the U.K.’s four main governments is led by a white man.",
      "publishedAt": "2024-03-17T14:03:26Z",
      "title": "Wales' first Black leader is a testament to Britain's political diversity, but racism persists",
      "url": "https://apnews.com/a7b923519abf74b69cf53160341ee8eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5f4d67f1e8b4e5ea864a5754dd55b54/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — The European Union on Sunday announced a 7.4 billion-euro ($8 billion) aid package for cash-strapped Egypt as concerns mount that economic pressure and conflicts in neighboring countries could drive more migrants to European shores.",
      "publishedAt": "2024-03-17T11:32:17Z",
      "title": "The European Union announces an $8 billion aid package for Egypt as concerns mount over migration",
      "url": "https://apnews.com/e4b3daca0df53a0ec537d92cd083bc01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d0df8658598423e82e20ac0baffb5b3/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and CHRISTINE FERNANDO",
      "description": "COLUMBUS, Ohio (AP) — It's been nearly four decades since liberal-leaning justices held a majority on Ohio's supreme court.Democrats hope this is the year that changes, in a campaign that will begin to take shape with Tuesday's primary.",
      "publishedAt": "2024-03-17T11:59:48Z",
      "title": "Ohio primary will set up a fall election that could flip partisan control of the state supreme court",
      "url": "https://apnews.com/0f2b7df8332a52a804e2a1a7ac177773",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2edd37c4a926494da09ab63727904858/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "Defending champion Connecticut, along with Houston, Purdue and North Carolina, are the top seeds in a March Madness bracket that started going haywire even before the pairings came out Sunday.",
      "publishedAt": "2024-03-17T10:10:21Z",
      "title": "March Madness is here. UConn, Purdue, Houston and North Carolina get top seeding in NCAA Tournament",
      "url": "https://apnews.com/e2b9dd2bb2f776a163de389c8e737ab4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/231853fcc4ac4a3192ce597a59a29697/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}