{
  "articles": [
    {
      "author": "ALANNA DURKIN RICHER, ERIC TUCKER and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith moved to abandon two criminal cases against Donald Trump on Monday, acknowledging that Trump’s return to the White House will preclude attempts to federally prosecute him for retaining classified documents or trying to overturn his 2020 election defeat.",
      "publishedAt": "2024-11-25T18:28:29Z",
      "title": "Special counsel moves to abandon election interference and classified documents cases against Trump",
      "url": "https://apnews.com/d6172cf98d8e03e099571c908267456c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1bb078fa804c258b700ef27b539b49/1920.jpeg"
    },
    {
      "author": "SALLY ABOU ALJOUD, JOE FEDERMAN and SAM METZ",
      "description": "BEIRUT (AP) — Israel's military launched airstrikes across Lebanon on Monday, unleashing explosions throughout the country and killing at least 31 while Israeli leaders appeared to be closing in on a negotiated ceasefire with the Hezbollah militant group.",
      "publishedAt": "2024-11-25T18:55:32Z",
      "title": "Israel launches new airstrikes on Lebanon as leaders draw closer to a ceasefire with Hezbollah",
      "url": "https://apnews.com/2b8d33a720931ed0ac315b055dfce57b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0907a1f0f65a427eaac2bd36fea60445/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Diplomats and other officials say there have been several sticking points in ceasefire talks to end the war between Israel and the Lebanese militant group Hezbollah, even as conditions for an agreement appear to be ripe.",
      "publishedAt": "2024-11-25T10:55:15Z",
      "title": "What's blocking a ceasefire between Israel and Hezbollah?",
      "url": "https://apnews.com/ce56620463c579a33a4d8b03de035ae3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/332c69d36de84d5198510951cb541c36/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Airports and highways are expected to be jam-packed during Thanksgiving week, a holiday period likely to end with another record day for air travel in the United States.",
      "publishedAt": "2024-11-25T16:46:29Z",
      "title": "Thanksgiving Travel Latest: Airport strike, staff shortages and weather could impact holiday travel",
      "url": "https://apnews.com/9c42556a16a14af750b648ba6e8de4eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5af54c36d31c437585eebc98b1ec90af/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "A white Florida woman who fatally shot a Black neighbor through her front door during an ongoing dispute over the neighbor’s boisterous children was sentenced Monday to 25 years in prison for her manslaughter conviction.",
      "publishedAt": "2024-11-25T05:12:08Z",
      "title": "White Florida woman sentenced to 25 years in prison for shooting Black neighbor in lengthy dispute",
      "url": "https://apnews.com/eeebdfa89b98164b87179629ca36799c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f92a44825544a20adc5e1b07de02272/3000.jpeg"
    },
    {
      "author": "JAIMIE DING",
      "description": "LOS ANGELES (AP) — A judge on Monday delayed until January his decision on whether to resentence Erik and Lyle Menendez for killing their parents in their Beverly Hills mansion 35 years ago, squashing their family’s hope the brothers would be released and home for the holidays.",
      "publishedAt": "2024-11-25T05:03:22Z",
      "title": "Judge in LA delays until January decision on resentencing Menendez brothers",
      "url": "https://apnews.com/f3264b1e7009ea4c176b02b1d3fe9850",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eaa13ad1a19f4ab5965b4b42e090f7ac/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court won’t hear a challenge to a federal requirement that cigarette packages and advertising include graphic images demonstrating the effects of smoking.",
      "publishedAt": "2024-11-25T15:01:00Z",
      "title": "Supreme Court won’t hear challenge to graphic cigarette warning labels",
      "url": "https://apnews.com/cfe9776053b25cebf6a371d8f7ae5704",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e7302b4b7b841069b21de905e130686/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's military captured a British national fighting with Ukrainian troops who have occupied part of Russia's Kursk region, according to reports Monday, as Moscow began daylight drone attacks on civilian areas of Ukraine and its ground forces accelerated gains along parts of the front line.",
      "publishedAt": "2024-11-25T07:55:23Z",
      "title": "Russia reportedly captures a Briton fighting for Ukraine as Russian troops advance",
      "url": "https://apnews.com/e7fd8790cd151ff3b73a5edcc5e00bf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3808dfe620814457bc9723bc7435cd9f/2532.jpeg"
    },
    {
      "author": "MEAD GRUVER and AMY BETH HANSON",
      "description": "A judge on Monday rejected a request to block a San Jose State women’s volleyball team member from playing in a conference tournament on grounds that she is transgender.",
      "publishedAt": "2024-11-25T20:06:02Z",
      "title": "Judge rejects request to sideline a San Jose State volleyball player on grounds she’s transgender",
      "url": "https://apnews.com/a45e6751924f73abd5ba5d786d43f5a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a1f8b3b199f401f9d1bbcf6844f834b/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — There's no place like home for the holidays. And that may not necessarily be a good thing.In the wake of the very contentious and divisive 2024 presidential election, the upcoming celebration of Thanksgiving and the ramp-up of the winter holiday season could be a boon for some — a respite from the events of the larger world in the gathering of family and loved ones.",
      "publishedAt": "2024-11-25T19:06:27Z",
      "title": "So you're gathering with relatives whose politics are different. Here are some tips for the holidays",
      "url": "https://apnews.com/467c692d3f2f11f0abb31da1b6fef5f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e916e316f3c74c9dab3f52f71c586cab/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}