{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFREY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — A flurry of Israeli airstrikes Tuesday on a refugee camp near Gaza City leveled apartment buildings, leaving craters where they once stood, as ground troops battled Hamas militants across northern Gaza and attacked underground compounds.",
      "publishedAt": "2023-10-31T07:23:16Z",
      "title": "Israeli airstrikes level apartments in Gaza refugee camp, as ground troops battle Hamas militants",
      "url": "https://apnews.com/54ab6bd7f6861be86266770c245827e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d87af732325f459fb40fa3ae606ecb72/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A deluge of Israeli airstrikes Tuesday on a refugee camp near Gaza City demolished apartment buildings, leaving gaping holes where they once stood, while ground troops battled Hamas militants across northern Gaza.",
      "publishedAt": "2023-10-31T07:32:38Z",
      "title": "Live updates | Israeli ground forces attack Hamas targets in north as warplanes strike across Gaza",
      "url": "https://apnews.com/7990a2ce65c08b2b512319c9a9bb280a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d18f9f0c624c7daf1de0b1c19f34d0/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court wrestled Tuesday with whether public officials can block critics from commenting on their social media accounts, an issue that first arose in a case involving former President Donald Trump.",
      "publishedAt": "2023-10-31T18:12:47Z",
      "title": "The Supreme Court wrestles with social media cases that have echoes of Donald Trump",
      "url": "https://apnews.com/f7abfec1e5367c18de51497ecb46bc5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4bdaa68c96249fea9eb0c6b8db92da2/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The nation's top military and diplomatic leaders urged an increasingly divided Congress on Tuesday to send immediate aid to Israel and Ukraine, arguing at a Senate hearing that broad support for the assistance would signal U.S.",
      "publishedAt": "2023-10-31T04:04:16Z",
      "title": "U.S. military and diplomatic leaders urge a divided Congress to send aid to both Israel and Ukraine",
      "url": "https://apnews.com/a56354873731af2ea5a96db227059969",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a62d0c44769f43898aa192f4e2508de4/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "NIAGARA FALLS, N.Y. (AP) — Inside the columned church on the corner, the rich tones of the organ have wrapped congregants in their embrace. The time has come for the Rev. Jimmie Hardaway Jr. to preach the lessons embodied by the Prince of Peace.",
      "publishedAt": "2023-10-31T12:01:16Z",
      "title": "Two pastors worry for their congregants’ safety. Are more guns the answer or the problem?",
      "url": "https://apnews.com/a44329af27040d18a0c55844cc4945ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5995c74f7e0d4beb9e4577c0ad208ac6/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — Children returned to school Tuesday and planned to go trick-or-treating in the evening after spending days locked in their homes while authorities combed the area for the man responsible for the deadliest mass shooting in Maine's history.",
      "publishedAt": "2023-10-31T15:31:51Z",
      "title": "Kids return to school, plan to trick-or-treat as Maine communities start to heal from mass shooting",
      "url": "https://apnews.com/ea276b1835c9e68f8ed7e4619ee8a3b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32d26e815b0b4eb490769b62e3497f39/1920.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "BOSTON (AP) — In 1648, Margaret Jones, a midwife, became the first person in Massachusetts — the second in New England — to be executed for witchcraft, decades before the infamous Salem witch trials.",
      "publishedAt": "2023-10-31T04:20:03Z",
      "title": "Group seeks to clear names of all accused, convicted or executed for witchcraft in Massachusetts",
      "url": "https://apnews.com/0a6793fbe3c04abac17efbd9ff576141",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0944c248d6744e2dbe59c4670d323768/1693.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Chatbots like ChatGPT wowed the world with their ability to write speeches, plan vacations or hold a conversation as good as or arguably even better than humans do, thanks to cutting-edge artificial intelligence systems.",
      "publishedAt": "2023-10-31T06:05:51Z",
      "title": "Cutting-edge AI raises fears about risks to humanity. Are tech and political leaders doing enough?",
      "url": "https://apnews.com/ce89e842a176e55e46b6cc493cd515a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99dfa0956fbc4db6ac4bf65866bcd3e9/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "In her 25 years of making films, Sofia Coppola has always found the poetry behind the headlines, the banality in the glamour, the soul in the superficial.",
      "publishedAt": "2023-10-31T16:12:59Z",
      "title": "Sofia Coppola turns her lens on an American icon: Priscilla Presley",
      "url": "https://apnews.com/be584d476c954556eb5706e954016d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94d0c54852494a88bbb6cc38aed090a6/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "WASHINGTON (AP) — Chuck Goldstein has not used a whistle to coach football in more than a decade. It has become commonplace for him.Since arriving at Gallaudet University as an assistant in 2009, Goldstein has embraced coaching a team of Deaf and hard-of-hearing players and the adjustments that go with it.",
      "publishedAt": "2023-10-31T15:18:48Z",
      "title": "From inventing the huddle to trying a new helmet, Gallaudet is home to a proud football tradition",
      "url": "https://apnews.com/50dc17dd9fa387a7db8fdf2bf1298e05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c728d8bc421b4e499561415e69849fa5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}