{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Nearly three dozen trucks entered Gaza on Sunday in the largest aid convoy since the war between Israel and Hamas began, but humanitarian workers said the assistance still fell desperately short of needs after thousands of people broke into warehouses to take flour and basic hygiene products.",
      "publishedAt": "2023-10-29T06:19:43Z",
      "title": "Gaza receives largest aid shipment so far as deaths top 8,000 and Israel widens military offensive",
      "url": "https://apnews.com/de1a7d660ba2f6d80b3d7aeaae5bb0f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0f3062ef68f4ef594ecd9bebea2871a/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, CHRIS MEGERIAN, WILL WEISSERT and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — As the 3-week-old Israel-Hamas war enters what Israeli Prime Minister Benjamin Netanyahu says could be a “long and difficult” new stage, President Joe Biden is calling on Israeli and Arab leaders to think hard about their eventual postwar reality.",
      "publishedAt": "2023-10-29T11:57:58Z",
      "title": "Mission impossible? Biden says Mideast leaders must consider a two-state solution after the war ends",
      "url": "https://apnews.com/cf16a65d2e6ac2cf2218d305e3073df7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f955d8b9be604007973f2adb98353d64/3000.jpeg"
    },
    {
      "author": null,
      "description": "Matthew Perry was widely mourned this weekend by friends, co-stars and some very famous fans, including his childhood classmate, Canadian Prime Minister Justin Trudeau; his “Friends” mom Morgan Fairchild; and even Adele.",
      "publishedAt": "2023-10-29T14:43:12Z",
      "title": "'Friends' creators, actors, family mourn Matthew Perry: 'The One Where Our Hearts Are Broken'",
      "url": "https://apnews.com/c4e6ead4b4169652d90ec09f54059b62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35cb39d36a3841f5a5c5182c3740bd35/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, JAKE BLEIBERG and ROBERT F. BUKATY",
      "description": "LEWISTON, Maine (AP) — More than 1,000 people packed a cavernous church Sunday night, and hundreds more spilled outside, to hug, sing, weep and seek comfort in the wake of Maine’s most deadly mass shooting.",
      "publishedAt": "2023-10-29T12:10:28Z",
      "title": "More than 1,000 pay tribute to Maine's mass shooting victims on day of prayer, reflection on tragedy",
      "url": "https://apnews.com/d08e0c1a102e2b68d02c947ae5b0e9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9ac3abb45b498a97099b95a6d115ea/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Hundreds of people stormed into the main airport in Russia's Dagestan region and onto the landing field Sunday, chanting antisemitic slogans and seeking passengers arriving on a flight from Tel Aviv, Israel, Russian news agencies and social media reported.",
      "publishedAt": "2023-10-29T19:26:58Z",
      "title": "Hundreds storm airport in Russia in antisemitic riot over arrival of plane from Israel",
      "url": "https://apnews.com/fa06b16131ed41c0c789981cdcaac84f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e7e37169503474eb4ff23594248fa54/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and FRANK BAJAK",
      "description": "DETROIT (AP) — The United Auto Workers union has widened its strike against General Motors, the lone holdout among the three Detroit automakers, after reaching a tentative contract agreement with Jeep maker Stellantis.",
      "publishedAt": "2023-10-29T19:01:24Z",
      "title": "UAW escalates strike against lone holdout GM after landing tentative pacts with Stellantis and Ford",
      "url": "https://apnews.com/64c756ec121d7f39205fdea396d21bc0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7681eb2a4a1a4e5eaf4cddb9e1785eda/3000.jpeg"
    },
    {
      "author": "FELIX MARQUEZ and MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — At least 48 people died when Category 5 Hurricane Otis slammed into Mexico’s southern Pacific coast, most of them in Acapulco, Mexican authorities said Sunday as the death toll continued to climb and families buried loved ones.",
      "publishedAt": "2023-10-29T04:25:41Z",
      "title": "Hurricane Otis death toll rises to 48, missing now number 36 as search and recovery work continues",
      "url": "https://apnews.com/50eb6a8fe677455428cbacfd3966e72c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/656aa74929d7467db04319f5e8dddc2d/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The federal judge overseeing Donald Trump's 2020 election interference case in Washington on Sunday reimposed a narrow gag order barring him from making public comments targeting prosecutors, court staff and potential witnesses.",
      "publishedAt": "2023-10-30T01:02:03Z",
      "title": "Federal judge reimposes limited gag order in Donald Trump's 2020 election interference case",
      "url": "https://apnews.com/1357b62d5800b73746241db424875a4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a61e48f9a1fb4c75907f19c638d9cb7f/3000.jpeg"
    },
    {
      "author": "MELINA WALLING and BRITTANY PETERSON",
      "description": "Hudson, Colo. (AP) — Alan Mazzotti can see the Rocky Mountains about 30 miles west of his pumpkin patch in northeast Colorado on a clear day. He could tell the snow was abundant last winter, and verified it up close when he floated through fresh powder alongside his wife and three sons at the popular Winter Park Resort.",
      "publishedAt": "2023-10-29T12:30:55Z",
      "title": "How extreme weather in the US may have affected the pumpkins you picked this year for Halloween",
      "url": "https://apnews.com/81905cc284aacf30744b2cb5dbe0a141",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47434b5d003f40a4a7ab99f2b1f63c7f/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON and CHRIS O'MEARA",
      "description": "TAMPA, Fla. (AP) — A man has been arrested in Tampa, Florida, in a mass shooting that erupted during Halloween festivities early Sunday. Two people were killed and 18 injured, police said.At least two shooters opened fire just before 3 a.m.",
      "publishedAt": "2023-10-29T11:19:49Z",
      "title": "Arrest made in Halloween weekend's fatal shooting of 2 in Tampa; 18 more victims injured",
      "url": "https://apnews.com/6791b6cf9c4165b9f287b6126732f257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80cd0090fefb446193458bb2d039cbf5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}