{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, BASSEM MROUE and LEE KEATH",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu on Friday pushed back against growing U.S. pressure for a “humanitarian pause” in the nearly month-old war to protect civilians and allow more aid into Gaza, insisting there would be no temporary cease-fire until the roughly 240 hostages held by Hamas are released.",
      "publishedAt": "2023-11-03T07:23:39Z",
      "title": "Israel resists US pressure to pause the war to allow more aid to Gaza, wants hostages back first",
      "url": "https://apnews.com/94d5d0b58bc10a14be6ac191060e47e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f106985cdd71450ea329a6cdb7266953/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE, KAREEM CHEHAYEB and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — When Israeli warplanes bombed the crowded Jabaliya refugee camp in northern Gaza this week, neonatal nurse Hudaa Ali Eldaor felt the vibration in her ward at the nearby Kamal Adwan Hospital.",
      "publishedAt": "2023-11-03T14:48:48Z",
      "title": "Trapped in hell: Palestinian civilians try to survive in northern Gaza, focus of Israel's offensive",
      "url": "https://apnews.com/8a25acaf136b897492158d128bf5742d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b6a851470524f9aab5d8dfeff5b4ff8/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court agreed on Friday to decide whether a Trump era-ban on bump stocks, the gun attachments that allow semi-automatic weapons to fire rapidly like machine guns, violates federal law.",
      "publishedAt": "2023-11-03T17:48:02Z",
      "title": "Supreme Court will rule on ban on rapid-fire gun bump stocks, used in the Las Vegas mass shooting",
      "url": "https://apnews.com/2b66dbcbce4c04c19b448951696fe4b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/867e5c4e5e994df5907408ff323a7c50/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and ANNE D'INNOCENZIO",
      "description": "WASHINGTON (AP) — The nation’s employers slowed their hiring in October, adding a modest but still decent 150,000 jobs, a sign that the labor market may be cooling but remains resilient despite high interest rates that have made borrowing much costlier for companies and consumers.",
      "publishedAt": "2023-11-03T04:01:24Z",
      "title": "US employers pulled back on hiring in October, adding 150,000 jobs in face of higher borrowing rates",
      "url": "https://apnews.com/941e0963d178e3435dfd01f3393787aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9233a8297eec4e19ab8ef41e78083f57/1920.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Helicopters and ground troops rushed to help people hurt in a strong earthquake that shook northwestern Nepal districts just before midnight Friday, killing at least 128 people and injuring dozens dozens more, officials said Saturday.",
      "publishedAt": "2023-11-03T19:01:17Z",
      "title": "At least 128 dead as strong quake rocks northwestern Nepal, and officials say toll expected to rise",
      "url": "https://apnews.com/47b0b262ed1aa26957285dd1a55699fb",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "PANAMA CITY (AP) — Panama’s President, Laurentino Cortizo, signed into law an indefinite moratorium on new mining concessions Friday.",
      "publishedAt": "2023-11-04T01:16:25Z",
      "title": "Panama president signs into law a moratorium on new mining concessions. A Canadian mine is untouched",
      "url": "https://apnews.com/3ed264e871f09fa5ee7ed6fb6eeb0c61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a994d3e13be242f2a7254ed4653fc78e/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The judge in Donald Trump's civil business fraud trial barred attorneys in the case Friday from commenting on “confidential communications” between him and his staff, after the former president's attorneys renewed claims that a clerk is poisoning the proceedings.",
      "publishedAt": "2023-11-03T14:27:35Z",
      "title": "Lawyers in Trump's civil fraud trial are ordered to clam up about judge's communications with staff",
      "url": "https://apnews.com/af902a6800c01abba93277c54d07c7f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64c451f94fdd4fd7a8664d72f054957c/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and CHRISTINE FERNANDO",
      "description": "DENVER (AP) — Can former President Donald Trump run for his old job again after his role in the Jan. 6, 2021, attack on the U.S. Capitol? The answer may depend on the definition of insurrection.Liberal groups have filed lawsuits in Colorado, Minnesota and other states to bar Trump from the ballot, citing a rarely used constitutional prohibition against holding office for those who swore an oath to uphold the Constitution but then “engaged in insurrection” against it.",
      "publishedAt": "2023-11-03T17:58:01Z",
      "title": "Can Trump be on the ballot in 2024? It can hinge on the meaning of 'insurrection'",
      "url": "https://apnews.com/64ea3e076af335a3e1bce6d7620d58a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d78e49ec16e645db8c278f49253f4b18/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CARLA K. JOHNSON",
      "description": "FINDLAY, Ohio (AP) — Communities ravaged by America's opioid epidemic are starting to get their share of a $50 billion pie from legal settlements.Most of that money comes with a requirement that it be used to address the overdose crisis and prevent more deaths.",
      "publishedAt": "2023-11-03T04:19:41Z",
      "title": "As billions roll in to fight the US opioid epidemic, one county shows how recovery can work",
      "url": "https://apnews.com/d186d72250f35056892bc9d70b5ab2c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6909068bb02d445b92deac95e9c129da/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — The Army reservist who opened fire inside at a bowling alley and a bar in Lewiston, Maine, before disappearing was alive and possibly on the run during a good portion of the massive search that followed, according to a conclusion from the state medical examiner’s office released Friday.",
      "publishedAt": "2023-11-03T22:18:48Z",
      "title": "Maine mass shooter was alive for most of massive 2-day search, autopsy suggests",
      "url": "https://apnews.com/822ee952fdb9e25022c761f437523593",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd50fda949194cdda1c8be877773f459/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}