{
  "articles": [
    {
      "author": "LORNE COOK and RAF CASERT",
      "description": "BRUSSELS (AP) — Tens of millions across the European Union voted Sunday in EU parliamentary elections in a massive exercise of democracy that is expected to shift the bloc to the right and redirect its future.",
      "publishedAt": "2024-06-09T04:02:15Z",
      "title": "Voting in 20 EU countries under way as elections for the European Parliament enters its final day",
      "url": "https://apnews.com/0fbfcb7bd987008e802d70f759fa870b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c5df287a3a847539507aad852bb6c04/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Voters across the European Union are going to the polls on the final day of voting for the European parliamentary elections to choose their representatives for the next five-year term.Polls opened in 20 EU countries early Sunday for the June 6-9 elections for a new European Parliament, the legislative branch of the 27-member bloc.",
      "publishedAt": "2024-06-09T07:35:41Z",
      "title": "The Latest | Europeans go to the polls on the final day of voting for EU elections",
      "url": "https://apnews.com/d66061efe90a5b3d1762d3ddfade0491",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fea14919378c43968179ecb5886a89dd/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 274 Palestinians were killed and hundreds more were wounded in the Israeli raid that rescued four hostages held by Hamas, Gaza's Health Ministry said Sunday.",
      "publishedAt": "2024-06-09T10:07:06Z",
      "title": "Gaza's Health Ministry says 274 Palestinians were killed in Israeli raid that rescued 4 hostages",
      "url": "https://apnews.com/61eb1be9a9d0cf2dbf250cd4a8ed4dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6e4d510eb964a2cbcb33f3e77b431d6/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "PARIS (AP) — President Joe Biden will close out his trip to France by paying his respects at an American military cemetery that Donald Trump notably skipped visiting when he was president, hoping his final stop Sunday will draw the stakes of the November election in stark relief.",
      "publishedAt": "2024-06-09T04:01:48Z",
      "title": "Cemetery visit will close out Biden trip to France that has served as a rebuke to Trump",
      "url": "https://apnews.com/451275981e578163c51b5a2562ae6694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/817ff58915db4e0b91bb8c82f2afb796/1920.jpeg"
    },
    {
      "author": "DEMETRIS NELLAS",
      "description": "ATHENS (AP) — Police said that a body believed to be that of missing British TV presenter Michael Mosley was found on a Greek island Sunday morning. A police spokesman, who spoke on condition of anonymity because of an ongoing investigation, said the body was found on a rocky coast by a private boat and that formal identification was pending.",
      "publishedAt": "2024-06-09T08:17:02Z",
      "title": "Body believed to be missing TV presenter Michael Mosley found on Greek island",
      "url": "https://apnews.com/4bf0111220b0c283bbd2837a628555f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21eafd0110324e3983a2053d4db890e8/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 600 kilometers (370 miles) from the front lines, after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.",
      "publishedAt": "2024-06-09T10:04:03Z",
      "title": "Ukraine says it struck one of Russia's most advanced warplanes",
      "url": "https://apnews.com/2c5202df044e05bea8d9e641be9987b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b99edc71836b4866bc78cba6246843b0/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — The Border Patrol arrested Gerardo Henao 14 hours after President Joe Biden suspended asylum processing at the U.S.",
      "publishedAt": "2024-06-09T04:01:35Z",
      "title": "Some nationalities escape Biden's sweeping asylum ban because deportation flights are scarce",
      "url": "https://apnews.com/7ac8e8279109e0fa483b6f3f26957702",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/398eb54337b94ee881617daed9581994/3000.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "EL AMRA, Tunisia (AP) — For many migrants who’ve long dreamed of Europe, one of the last stops is an expanse of olive trees on North Africa's Mediterranean coastline.But in Tunisia, less than 100 miles (161 kilometers) from the Italian islands that form the European Union’s outermost borders, for many that dream has become a nightmare.",
      "publishedAt": "2024-06-09T08:11:48Z",
      "title": "Stranded migrants confront violence and despair as Tunisia partners to keep them from Europe",
      "url": "https://apnews.com/e6162d4221062bf09dd13de690da9f91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750916ef1bd942709a55bdbea8c6b0af/1920.jpeg"
    },
    {
      "author": "GIOVANNA DELL’ORTO",
      "description": "PARIS (AP) — As athletes rev up their training and organizers finalize everything from ceremonies to podiums before the Paris Olympics, more than 120 faith leaders are preparing for a different challenge — spiritually supporting some 10,000 Olympic athletes from around the world, especially those whose medal dreams will inevitably get crushed.",
      "publishedAt": "2024-06-09T08:01:19Z",
      "title": "In secular France, chaplains prepare to provide Olympians with spiritual support during the Games",
      "url": "https://apnews.com/198fdeeab0aa452ccf94e3f1395eea30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf62b457a6534002b05a6f159aadc4dd/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "SUNRISE, Fla. (AP) — Sergei Bobrovsky turned the puck over on the first shift and recovered.",
      "publishedAt": "2024-06-09T03:01:32Z",
      "title": "Bobrovsky makes 32 saves as the Panthers shut out the Oilers 3-0 in Game 1 of Stanley Cup Final",
      "url": "https://apnews.com/ac405da89df48e90e1b07fa2bb571662",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3a35ebf24e040fc8d37bb77602ef92f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}