{
  "articles": [
    {
      "author": "Lisa Mascaro, Josh Boak",
      "description": "President Donald Trump’s 2026 budget plan would slash non-defense domestic spending by $163 billion, while increasing expenditures on national security. That's according to statements released by the White House on Friday. The budget showed a desire to crack down on diversity programs and initiatives to address climate change. But the administration has yet to release detailed tables on what it wants income taxes, tariffs or the budget deficit to be. This budget is engineered by Trump budget director Russell Vought, a chief architect of Project 2025. It comes as Congress is already deep into drafting the Republican president's big bill of tax breaks, spending cuts and bolstered money for deportations and border security.",
      "publishedAt": "2025-05-02T12:04:48Z",
      "title": "White House will unveil Trump's 2026 budget",
      "url": "https://apnews.com/article/trump-budget-taxes-spending-vought-4549eb165410186da001c8cdce462492",
      "urlToImage": "https://dims.apnews.com/dims4/default/8399a22/2147483647/strip/true/crop/4468x2513+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fa0%2Fee970540346605ce3aa8b66ff39d%2Feb34fd75a3b945379d31da80793398ef"
    },
    {
      "author": "Sam Mednick, Renata Brito",
      "description": "A drone struck a vessel carrying aid to Gaza on Friday off the coast of Malta, said a statement by Codepink, a grassroots peace and social justice movement. The vessel belonging to the Gaza Freedom Flotilla was trying to get food and supplies to people in Gaza, said the statement. Malta’s government said 12 crew members and four civilians were on board and no casualties were reported. For two months Israel has blocked any humanitarian aid from entering Gaza, throwing Gaza into what is believed to be the worst humanitarian crisis in nearly 19 months of war. Israel’s army didn’t respond to a request for comment.",
      "publishedAt": "2025-05-02T08:11:36Z",
      "title": "Drone strikes vessel carrying aid to Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-02-2025-malta-2ff92bc0e1a8f667e122892f830a72f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Damian J. Troise",
      "description": "Stocks are rising on Wall Street following a stronger-than-expected report on the U.S. job market. The S&P 500 climbed 0.8% in morning trading Friday, putting the index on track for a ninth straight day of gains. The Dow Jones Industrial Average added 316 points, or 0.8%, and the Nasdaq composite was up 0.8%. Employers added 177,000 jobs in April, more than forecast. However the latest job figures don't yet reflect the effects on the economy of President Donald Trump’s across-the-board tariffs against America's trading partners. Treasury yields rose in the bond market.",
      "publishedAt": "2025-05-02T04:48:02Z",
      "title": "Wall Street gains ground following a stronger-than-expected report on the US job market",
      "url": "https://apnews.com/article/stocks-market-rates-trump-tariffs-7849168ab82e0abfb26c6b6ed18267f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/89f3ebe/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa9%2F30721ea00ba11c4b3dfa03a1bb94%2Ff24ed6025abe403a8f80ec7541276335"
    },
    {
      "author": "David Bauder",
      "description": "The head of PBS says President Donald Trump’s executive order aiming to slash public subsidies to PBS and NPR is unlawful. Public Broadcasting Service CEO Paula Kerger said Friday the Republican president's order threatens PBS' ability to serve the American public with educational programming as it has for 50-plus years. Trump signed the order Thursday, alleging “bias” in the broadcasters’ reporting. Trump's order instructs the Corporation for Public Broadcasting and other federal agencies to “cease Federal funding” for Arlington, Virginia-based PBS and Washington, D.C.-based National Public Radio. The broadcasters get roughly half a billion dollars in public money and have been preparing for the possibility of stiff cuts since Trump’s election.",
      "publishedAt": "2025-05-02T15:08:56Z",
      "title": "PBS chief decries Trump executive order on federal funding cuts as unlawful",
      "url": "https://apnews.com/article/trump-pbs-npr-media-funding-8b51113b8edd932aa850235318b73e53",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f5e843/2147483647/strip/true/crop/5780x3251+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F15%2F18ef281662e83ecf4e1352050c8b%2F2c72d52b3209464bb7edea00d19ca352"
    },
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump is re-upping his threat to strip Harvard University of its tax-exempt status. He's escalating a showdown with the first major college that has defied his efforts to crack down on campus activism. Trump wrote on his social media site Friday: “We are going to be taking away Harvard’s Tax Exempt Status.\" The president has questioned that status since the school refused to comply with the administration’s demands for broad government and leadership changes, revisions to its admissions policy, and audits of how diversity is viewed on the campus. That prompted the administration to block more than $2 billion in federal grants to the institution.",
      "publishedAt": "2025-05-02T13:53:03Z",
      "title": "Trump again threatens Harvard's tax-exempt status",
      "url": "https://apnews.com/article/donald-trump-harvard-university-white-house-education-fb6d5fe0191b08677441ebb9b9431d19",
      "urlToImage": "https://dims.apnews.com/dims4/default/74eee16/2147483647/strip/true/crop/4744x2669+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F19%2Fd17f999fd36e85307b5e2969fbeb%2Fdea64eaddc534f51bd4afbad8fe6c7b9"
    },
    {
      "author": null,
      "description": "Idaho State Police say seven people died and eight were injured after a pickup truck and a tour van collided in eastern Idaho near Yellowstone National Park. Police said in a press release that the crash happened Thursday night on a highway near Henry’s Lake State Park. The driver of the Dodge Ram pickup died, along with six people inside the Mercedes passenger van. The van was carrying a tour group of 14 people. The Fremont County coroner’s office has not yet released the name of those killed in the crash. Authorities have not said what led up to the crash, which is under investigation.",
      "publishedAt": "2025-05-02T16:16:24Z",
      "title": "7 people are dead after a pickup and tour van collided near Yellowstone, police say",
      "url": "https://apnews.com/article/yellowstone-fatal-collision-tour-van-154ad5070cbc7f544011c48fb68fb642",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb38c51/2147483647/strip/true/crop/3024x1701+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Fb1%2F705661bcc7b20ed5050efdcb967e%2F7ae5ce68c13a4361bfedaa26119a4a7e"
    },
    {
      "author": "Mike Stobbe",
      "description": "More U.S. children have died this flu season than at any time since the swine flu pandemic 15 years ago. The Centers for Disease Control and Prevention on Friday said 216 pediatric deaths already have been reported. That eclipses the 207 reported the previous flu season, and is the most since the 2009-2010 H1N1 global flu pandemic. There are likely several contributors to this season’s severity, but one pediatric infectious diseases specialist says a big one is that fewer children are getting flu shots. Flu vaccinations may not prevent people from getting sick, but research shows they do prevent hospitalizations and deaths.",
      "publishedAt": "2025-05-02T15:20:23Z",
      "title": "CDC reports 216 child deaths this flu season, the most in 15 years",
      "url": "https://apnews.com/article/flu-deaths-children-cdc-e79b1e4169d629ad4bc1095d95d82110",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fd5209/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F00%2F338ba9b28c2db550ed001212ff2a%2Fccc88a68673146bcbe774b7201dc4614"
    },
    {
      "author": "Adithi Ramakrishnan",
      "description": "A Wisconsin man has been bitten by snakes hundreds of times, and scientists are studying his blood to treat snakebite. Tim Friede has injected himself with snake venom for nearly two decades and has been bitten by black mamas, water cobras and more. In a new study published Friday in the journal Cell, scientists created one antivenom to treat snakebites from several different species in mice — using antibodies from Friede’s blood. A more universal antivenom for humans is still many years away. The group hopes to test their concoction in dogs next before eventually moving to human trials.",
      "publishedAt": "2025-05-02T15:00:16Z",
      "title": "Snakes have bitten this man hundreds of times. His blood could help make a better treatment",
      "url": "https://apnews.com/article/snake-antivenom-snakebite-cobra-mamba-f7e64a2162b55b26408a34bab5913d55",
      "urlToImage": "https://dims.apnews.com/dims4/default/96eb497/2147483647/strip/true/crop/3072x1728+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F9d%2Ff043e656198f0447b1fe60f87070%2F6051f5855a964460b5a28937c1c141c1"
    },
    {
      "author": "Beth Harris",
      "description": "Ruth Buzzi, who rose to fame as the frumpy and bitter Gladys Ormphby on the groundbreaking sketch comedy series “Rowan & Martin’s Laugh-In” and made over 200 television appearances during a 45-year career, has died at age 88. Her agent Mike Eisenstadt says Buzzi died at her ranch in Texas. Buzzi won a Golden Globe and was a two-time Emmy nominee for the NBC show that ran from 1968 to 1973. She was the only regular to appear in all six seasons, including the pilot. She was first spotted by “Laugh-In” creator and producer George Schlatter playing various characters on “The Steve Allen Comedy Hour.”",
      "publishedAt": "2025-05-02T15:05:21Z",
      "title": "Ruth Buzzi, comedy sketch player on groundbreaking series 'Laugh-In,' dies at 88",
      "url": "https://apnews.com/article/ruth-buzzi-dead-88-laughin-0ad12e343297d352fe5406067851367f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7342c09/2147483647/strip/true/crop/3000x1688+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F9d%2F71a6d4fa45842ee8c02d472fb995%2Feb537871f043415d940608f05e1f2f47"
    },
    {
      "author": "Tim Reynolds",
      "description": "Gregg Popovich stepped down as coach of the San Antonio Spurs on Friday, ending a three-decade run that saw him lead the team to five NBA championships, become the league’s all-time wins leader and earn induction into the Basketball Hall of Fame. He will remain as team president. Popovich says “while my love and passion for the game remain, I’ve decided it’s time to step away as head coach.”",
      "publishedAt": "2025-05-02T16:07:33Z",
      "title": "Gregg Popovich, the NBA's all-time wins leader, retires after 29 seasons as coach in San Antonio",
      "url": "https://apnews.com/article/spurs-gregg-popovich-retires-d721a3d62bcdbb3946f0c3a23b1f096d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d22b711/2147483647/strip/true/crop/4541x2554+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F03%2F01dd0def6b8877dfce95fb560c58%2F203c4685f210483cb361c06a0651cd90"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}