{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A U.S. Army vessel carrying equipment for building a temporary pier in Gaza was on its way to the Mediterranean on Sunday, three days after U.S. President Joe Biden announced plans to ramp up aid deliveries by sea to the besieged enclave where hundreds of thousands of Palestinians have been going hungry.",
      "publishedAt": "2024-03-10T08:14:04Z",
      "title": "A US ship with equipment for building a pier is on its way to Gaza as part of a plan to ramp up aid",
      "url": "https://apnews.com/cf0b639c9996715a1dc611c3d74b6a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a702d6985214c48b7bb3beb632362e8/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WILMINGTON, Del. (AP) — President Joe Biden said Saturday that he believes Israeli Prime Minister Benjamin Netanyahu is “hurting Israel more than helping Israel” in how he is approaching its war against Hamas in Gaza.",
      "publishedAt": "2024-03-09T23:33:38Z",
      "title": "Biden: Netanyahu 'hurting Israel' by not preventing more civilian deaths in Gaza",
      "url": "https://apnews.com/2d4e5657db45ccbe2bb793f06f74c913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e350e6798f4e53a77a5d0999cf0a4c/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, MICHELLE PRICE and JILL COLVIN",
      "description": "ATLANTA (AP) — President Joe Biden said Saturday that he regretted using the term “illegal” during his State of the Union address to describe the suspected killer of Laken Riley, as his all-but-certain 2024 GOP rival, Donald Trump, blasted the Democrat's immigration policies and blamed them for her death at a rally attended by the Georgia nursing student’s family and friends.",
      "publishedAt": "2024-03-09T22:17:15Z",
      "title": "Trump blasts Biden over Laken Riley's death after Biden says he regrets using term 'illegal'",
      "url": "https://apnews.com/04924ffb3be76d60e1b6e8796a968051",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c265ec5459e4619b0c4bfe594d3990b/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "Virginia high school teacher Joe Clement keeps track of the text messages parents have sent students sitting in his economics and government classes:— “What did you get on your test?”— “Did you get the field trip form signed?”",
      "publishedAt": "2024-03-10T05:13:35Z",
      "title": "Why you should stop texting your kids at school",
      "url": "https://apnews.com/fb66d41592482b72b53e8ddd42a24a17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eea4b967e5f44b8e9d4afd0a0f9cae10/3000.jpeg"
    },
    {
      "author": "JOSH KELETY",
      "description": "PHOENIX (AP) — A nationwide review of procedures by The Associated Press and CNHI News revealed a patchwork of complicated systems for resolving open government disputes that often put the burden of enforcing transparency laws on private citizens.",
      "publishedAt": "2024-03-10T05:32:50Z",
      "title": "States have hodgepodge of cumbersome rules for enforcing sunshine laws",
      "url": "https://apnews.com/8623bd3a8069edf41c6a487bbaff6854",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4aeac930a5f641199acf034b8ccc1766/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "LOS ANGELES (AP) — Hi, “Oppenheimer.”When Hollywood gathers for the 96th Academy Awards on Sunday, the blockbuster biopic is widely expected to overpower all competition — including its release-date companion, “Barbie” — at an election-year Oscars that could turn into a coronation for Christopher Nolan.",
      "publishedAt": "2024-03-10T05:00:57Z",
      "title": "'Oppenheimer' set to overpower at the Oscars Sunday night",
      "url": "https://apnews.com/e72ce0ad9d9fbb77cb43770766b2042d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45357ae69f2141298b584b3705debd0d/3000.jpeg"
    },
    {
      "author": "MICHAEL WEISSENSTEIN",
      "description": "Haiti’s prime minister was last seen in Puerto Rico, negotiating his return to a homeland gripped by violence and controlled by heavily armed gangsters.",
      "publishedAt": "2024-03-10T05:11:37Z",
      "title": "Why is Haiti so chaotic? Leaders used street gangs to gain power. Then the gangs got stronger",
      "url": "https://apnews.com/142c57f868c5f8b0cdf01627b3f5350b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8c76e172a3247fab9acc0953283de78/3000.jpeg"
    },
    {
      "author": "BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Polls have officially opened Sunday in Portugal’s general election with mainstream moderates trying to keep a populist party at bay.The election, with 10.8 million registered voters, is set against a backdrop of corruption and economic hardship that have eroded faith in moderate mainstream parties and could push a significant number of voters into the arms of a radical right populist party.",
      "publishedAt": "2024-03-10T05:06:02Z",
      "title": "Polls open in Portugal’s general election with mainstream moderates trying to keep populists at bay",
      "url": "https://apnews.com/2507301c18e4bbe3c8a84152bef07fc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d82a8c1f9a747c7857c0ec4f5105502/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and MICHELLE L. PRICE",
      "description": "ATLANTA (AP) — President Joe Biden and former President Donald Trump warned of dire consequences for the country if the other wins another term in the White House as the pair held dueling rallies in Georgia Saturday fresh off strong wins in Super Tuesday contests that positioned them for an all-but-certain rematch this November.",
      "publishedAt": "2024-03-09T05:00:47Z",
      "title": "Biden, Trump issue dire warnings of the other, as rematch comes into view in Georgia",
      "url": "https://apnews.com/5ae87db6c20f95eae55d7f3c603144e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7b78856c6bc4f629b392a4a164e64a8/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "KURIGA, Nigeria (AP) — Rashidat Hamza is in despair. All but one of her six children are among the nearly 300 students abducted from their school in Nigeria’s northwest, riddled with Islamic extremists and armed gangs.",
      "publishedAt": "2024-03-10T02:56:10Z",
      "title": "Gunmen kidnap 300 students in northwest Nigeria. Two days later, some have lost hope of finding them",
      "url": "https://apnews.com/3fd64cbd482c2011d2e8c18acc18ba0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/007c1e43d087472a8da5be1e8b6a2ae3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}