{
  "articles": [
    {
      "author": "BARBARA SURK and HELENA ALVES",
      "description": "PARIS (AP) — French voters surged to the polls Sunday in the first round of high-stakes early parliamentary elections that could put the government in the hands of nationalist, far-right parties for the first time since the Nazi era.",
      "publishedAt": "2024-06-30T04:00:35Z",
      "title": "Strong turnout in France's high-stakes elections as support for the far right grows",
      "url": "https://apnews.com/f07061a929ed8eaad0e714e948159cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6262ced419a42d9b458f3a24cbe5840/1920.jpeg"
    },
    {
      "author": "LAURIE KELLMAN and CHRISTINE FERNANDO",
      "description": "DARTFORD, England (AP) — Distrust has settled over the campaign trails in the United States and United Kingdom ahead of July 4 like a soggy summer haze.On that day, British voters will choose a new Parliament in an election expected to finish with a Labour government after 14 years under the Conservatives.",
      "publishedAt": "2024-06-30T05:05:58Z",
      "title": "American and British voters share deep roots. In 2024, they distrust their own leaders, too",
      "url": "https://apnews.com/29ce2a2c366219ac068e6c4f55f56f44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acbb667b31a44306bbb3bdc81b1d94f4/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Beginning Monday, a California law will require credit card networks like Visa and Mastercard to provide banks with special retail codes that can be assigned to gun stores in order to track their sales.",
      "publishedAt": "2024-06-30T04:38:33Z",
      "title": "Should gun store sales get special credit card tracking? States split on mandating or prohibiting it",
      "url": "https://apnews.com/abe3a28ea7117340d9a4a8bcde3693fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a710c563f6604218ae3834bbe31cfec1/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Beryl strengthened into what experts called an \"extremely dangerous” Category 4 storm as it approaches the southeast Caribbean, which began shutting down Sunday amid urgent pleas from government officials for people to take shelter.",
      "publishedAt": "2024-06-30T10:50:38Z",
      "title": "Hurricane Beryl strengthens into a Category 4 storm as it nears the southeast Caribbean",
      "url": "https://apnews.com/aaae273e307658866fdd27f9f2c76592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5b2f70b8f404244868532c2c7aa6dcc/3000.jpeg"
    },
    {
      "author": "MAE ANDERSON",
      "description": "NEW YORK (AP) — With summer having gotten off to a scorching start, workers across the country may be dreaming of a seaside escape or cutting out early to watch a movie in an air-conditioned theater.",
      "publishedAt": "2024-06-30T12:09:11Z",
      "title": "Summer hours are a perk small businesses can offer to workers to boost morale",
      "url": "https://apnews.com/bd420489d2b71649deec784f68e14440",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5643a1b7c1f44b0a8919f4554f0cc31/3000.jpeg"
    },
    {
      "author": "CHANNI ANAND, PIYUSH NAGPAL and SIBI ARASU",
      "description": "JAMMU, India (AP) — The putrid smell of burning garbage wafts for miles from the landfill on the outskirts of Jammu in a potentially toxic miasma fed by the plastics, industrial, medical and other waste generated by a city of some 740,000 people.",
      "publishedAt": "2024-06-30T01:05:20Z",
      "title": "For India's garbage pickers, a miserable and dangerous job made worse by extreme heat",
      "url": "https://apnews.com/ba2664b6b651550141421466150229c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0525bee8f58e4e5393eea317b4263ead/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The monthlong celebration of LGBTQ+ Pride reaches its exuberant grand finale on Sunday, bringing rainbow-laden revelers to the streets for marquee parades in New York, Chicago, San Francisco and elsewhere across the globe.",
      "publishedAt": "2024-06-30T05:41:20Z",
      "title": "Parties and protests mark the culmination of LGBTQ+ Pride month in NYC, San Francisco and beyond",
      "url": "https://apnews.com/0c8dd29c5f0d09c9e52b8b47a39efcd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18f364fce25b4438ad6f4bd7773522e4/1920.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and EVGENIY MALOLETKA",
      "description": "DONETSK REGION, Ukraine (AP) — Drone footage from Ukraine’s military released Sunday has shown what appears to be bodies in a civilian area in the embattled eastern town of Toretsk, which has come under heavy Russian bombardment in recent days.",
      "publishedAt": "2024-06-30T08:55:15Z",
      "title": "Zelenskyy appeals to West to relax targeting limits for Ukraine as glide bombs hammer front line",
      "url": "https://apnews.com/88c66094944eb1154619520034307008",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb90fe55face42b6bc0314454f49c2d8/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Even as a legal challenge is already underway over a new Louisiana law requiring the Ten Commandments to be displayed in classrooms, the details of how the mandate will be implemented and enforced remain murky.",
      "publishedAt": "2024-06-30T05:02:10Z",
      "title": "How will Louisiana's new Ten Commandments classroom requirement be funded and enforced?",
      "url": "https://apnews.com/25207ca74c0656563c171c1c8ed921b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/541d4e26763a4d22b5c1ffad5636b105/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Relatives of a 13-year-old boy who was shot and killed by police in central New York were demanding justice as members of their immigrant community from Myanmar aimed Sunday to press local officials for accountability.",
      "publishedAt": "2024-06-30T16:24:59Z",
      "title": "Kin, community demand accountability for fatal NY police shooting of 13-year-old boy",
      "url": "https://apnews.com/234d947f193da65b25b4a5d1ed2c2fce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29ab8a5518064406a6c5029ea425da1c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}