{
  "articles": [
    {
      "author": "Sam McNeil, Jon Gambrell",
      "description": "The European Union appears poised to sanction Iran’s paramilitary Revolutionary Guard over Tehran’s deadly crackdown on nationwide protests. Kaja Kallas said that she expects foreign ministers meeting in Brussels on Thursday to agree on adding Iran’s Guard to its terrorist list. She said the move would put the Guard on the same footing as al-Qaida, Hamas and the Islamic State group. Iran had no immediate comment, but it has been criticizing Europe in recent days as it considered the move, which follows the U.S. earlier sanctioning the Guard.",
      "publishedAt": "2026-01-29T07:03:45Z",
      "title": "EU appears poised to sanction Iran's Revolutionary Guard",
      "url": "https://apnews.com/article/european-union-iran-revolutionary-guard-terrorist-f7d9d64b1302cfc2d9311417b2dfeaf6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7db0713/2147483647/strip/true/crop/7194x4794+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fec%2F0afd1ded6fb418af8946e1528b78%2Faab32e561e9f417099fd66b862f63416"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "Donald Trump lost his bid for reelection in 2020. But for more than five years, he’s been trying to convince Americans the opposite is true by falsely saying the election was marred by widespread fraud. Now that he’s president again, Trump is pushing the federal government to back up those bogus claims. On Wednesday, the FBI served a search warrant at the election headquarters of Fulton County, Georgia, which includes most of Atlanta, seeking ballots from the 2020 election. It marks an escalation of Trump's obsession with the election he lost to Democrat Joe Biden, and some observers say his administration is using Georgia as a blueprint for challenging results this November.",
      "publishedAt": "2026-01-29T05:02:32Z",
      "title": "FBI's Georgia raid highlights Trump's obsession with 2020 election",
      "url": "https://apnews.com/article/trump-2020-election-false-claims-fraud-georgia-55786848ca20c02cbcf749ede2db8852",
      "urlToImage": "https://dims.apnews.com/dims4/default/f862d71/2147483647/strip/true/crop/5405x3601+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F41%2F7b64d033590bdd36fc654cd8fd3a%2F88b24e93fc3143abb18cb20955bc4f6a"
    },
    {
      "author": "Michael Biesecker, Jesse Bedayn",
      "description": "Videos that emerged Wednesday show Alex Pretti was forcefully taken to the ground by federal immigration agents after kicking out the tail light of their vehicle during a Minneapolis protest 11 days before he was shot and killed by Border Patrol officers. The Jan. 13 scuffle was captured in a pair of videos that emerged Wednesday evening, showing Pretti shouting an expletive at federal immigration agents and struggling with them before he either breaks free or is let go. The new videos have rekindled the national debate about the death of Pretti, 37, an intensive care nurse at the Minneapolis VA Medical Center. A Minneapolis-based attorney representing Pretti’s parents says the earlier incident in no way justified the officers' use of deadly force more than a week later.",
      "publishedAt": "2026-01-29T03:53:04Z",
      "title": "New videos show Alex Pretti scuffle with federal officers the week before his death",
      "url": "https://apnews.com/article/minneapolis-ice-alex-pretti-videos-immigration-809506eb23f44a3e8f6e53b9fda7b700",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a98fce/2147483647/strip/true/crop/636x424+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fd9%2F0f5c6ee63d7a370b85b0b6b6b5f0%2Fab4890130a6b40c4a8787cbb50b24dce"
    },
    {
      "author": "Tim Sullivan",
      "description": "If there’s been a soundtrack to life in Minneapolis in recent weeks, it’s the shrieking whistles and honking horns of thousands of people following immigration agents across the city. They are the ever-moving shadow of Operation Metro Surge. They are teachers, scientists and stay-at-home parents. They own small businesses and wait tables. And when the White House shifted to a more conciliatory tone after the weekend killing of Alex Pretti, holding talks with local and state that President Donald Trump had long disdained and pushing aside Gregory Bovino, the Border Patrol senior official who had become public face of the immigration crackdown, it was quickly clear no one was giving up.",
      "publishedAt": "2026-01-29T05:02:02Z",
      "title": "Minneapolis streets echo with protests against immigration raids",
      "url": "https://apnews.com/article/protests-activists-minnesota-immigration-enforcement-ice-f86ce49f26230a1e5ad1592dcac0a5a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/21d73b6/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F80%2Fe3fd006049a662c50e4e031b9b2d%2Ff310000a8e57449e8646bf8542f2e434"
    },
    {
      "author": null,
      "description": "British Prime Minister Keir Starmer has called for a deeper relationship with China during what he describes as challenging times for the world. On Thursday, he told China's top leader Xi Jinping that their countries need to work together on global stability, climate change, and other issues. Starmer, the first British prime minister to visit in eight years, is holding talks in Beijing to improve relations after years of tension. He is trying to expand opportunities for British companies as the domestic economy slows. More than 50 top business executives have joined him on the trip.",
      "publishedAt": "2026-01-29T03:29:16Z",
      "title": "Starmer calls for UK to have a deeper relationship with China",
      "url": "https://apnews.com/article/uk-prime-minister-starmer-xi-beijing-trade-062717a30f70bcfd64db08436e9aff90",
      "urlToImage": "https://dims.apnews.com/dims4/default/af6499b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F57%2F757eae776d7bd1010821bf70078a%2F070845639d294f27a75927e908fdb2f9"
    },
    {
      "author": "Sophie Bates, Jeff Martin, Russ Bynum",
      "description": "The situation for some of the most vulnerable people trapped in homes in Tennessee and Mississippi without electricity is reaching a breaking point. Officials say it could be days before power is restored across the South and more subfreezing temperatures are expected by Friday. The growing misery and anxiety comes amid what Mississippi officials say is the state’s worst winter storm in more than 30 years. Roughly 298,000 homes and businesses remained without power Wednesday night. The vast majority of them are in Tennessee and Mississippi, where many are unaccustomed to and ill-equipped for freeing temperatures. At least 70 people have died across the U.S. in states afflicted by the dangerous cold.",
      "publishedAt": "2026-01-29T06:14:42Z",
      "title": "Ongoing frigid temperatures in US South pose danger to those lacking electricity",
      "url": "https://apnews.com/article/frigid-temperatures-power-outages-mississippi-tennessee-4dc03f84a5f6c2ae8b8c8de39995e8ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/25a0c7b/2147483647/strip/true/crop/2529x1685+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Ff5%2F5f4c99f97d1c6d3ca33ff6e09e4c%2F84bf3db1531948f9af16a63b87701811"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking, Lisa Mascaro",
      "description": "Senate Democrats are poised to block legislation that would fund the Department of Homeland Security and several other agencies on Thursday. That would bring the government a step closer to a partial shutdown if Republicans and the White House do not agree to new restrictions on President Donald Trump’s surge of immigration enforcement. As the country reels from the deaths of two protesters at the hands of federal agents in Minneapolis, irate Senate Democrats laid out a list of demands Wednesday, including that officers take off their masks and identify themselves and obtain warrants for arrest.",
      "publishedAt": "2026-01-29T05:34:50Z",
      "title": "Democrats poised to trigger government shutdown over ICE reform",
      "url": "https://apnews.com/article/senate-democrats-budget-shutdown-trump-homeland-security-5e6788e433e51399c8aa4399035aee22",
      "urlToImage": "https://dims.apnews.com/dims4/default/90bdea3/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F45%2F5ebc78b72f468d7ec4d555217983%2Ff5b38bc5ffad4dae83a13d12f5dc2880"
    },
    {
      "author": "Sudhin Thanawala",
      "description": "A federal appeals court says the Trump administration acted illegally when it ended legal protections that gave hundreds of thousands of people from Venezuela permission to live and work in the United States. A three-judge panel of the 9th U.S. Circuit Court of Appeals late Wednesday upheld a lower court ruling that found Homeland Security Secretary Kristi Noem exceeded her authority when she ended temporary protected status for Venezuelans. The decision, however, will not have any immediate practical effect after the Supreme Court in October allowed Noem’s decision to take effect pending a final decision by the justices. An email late Wednesday night to the Department of Homeland Security was not immediately returned.",
      "publishedAt": "2026-01-29T06:27:13Z",
      "title": "Appeals court rules against Trump administration over temporary legal status for immigrants",
      "url": "https://apnews.com/article/immigration-trump-venezuela-haiti-court-9049b2f6a934b80bead487639c1cf9af",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7c1629/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F12%2F4e716cba1c39ec166fa6dd7a5c37%2Fca063a8f27bb42a8821e9b16abf9beb0"
    },
    {
      "author": "Hallie Golden",
      "description": "A man has been arrested after repeatedly crashing his car into the Chabad Lubavitch world headquarters in New York City. The incident happened Wednesday night while people were gathered for prayer at the deeply revered Hasidic Jewish site. No one was injured. Police Commissioner Jessica Tisch says it is too early to speculate on the driver’s motives. Tisch say the incident is being investigated as a possible hate crime. Video posted online shows a car moving forward and backward on an icy driveway leading to a building in the complex. The vehicle rams the doors at least four times. The driver emerges and tells bystanders that it slipped. The driver also makes a comment to police about trying to park.",
      "publishedAt": "2026-01-29T03:38:50Z",
      "title": "Car rams into Chabad headquarters in New York City",
      "url": "https://apnews.com/article/chabad-headquarters-car-crash-new-york-06e8ef680526ec95ea33276cdf293f7e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8bf904d/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F63%2F2ba936d48bda62b5eb6a5c22a185%2F124f3f8c3ffe43749de19654f9995780"
    },
    {
      "author": "Geir Moulson",
      "description": "German Chancellor Friedrich Merz says the European Union can be an “alternative to imperialism and autocracy” and can forge deals with like-minded partners in a world of increasing great power rivalry. Merz underlined the continuing value of a NATO in which Europe will intensify its defense efforts. He said Thursday the bloc will always seek cooperation with the United States, but not as a “subordinate.” He also joined other European leaders in pushing back against U.S. President Donald Trump’s assertion that troops from non-U.S. NATO countries avoided the front line during the war in Afghanistan.",
      "publishedAt": "2026-01-29T10:00:14Z",
      "title": "German leader hails Europe as an 'alternative to imperialism and autocracy'",
      "url": "https://apnews.com/article/germany-merz-europe-trump-nato-alliances-trade-65a8342f7b3fde483e85c20051845aa5",
      "urlToImage": "https://dims.apnews.com/dims4/default/e445e88/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2Fd2%2F70a72e97b7ee09f42ff77f2e2eab%2Fa31c0d6b334640c99c3cc22589e3e0a1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}