{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Connecticut is back at No. 1 in the AP Top 25 to start its repeat bid in March Madness; Houston, Purdue, Iowa State next.",
      "publishedAt": "2024-03-18T16:58:33Z",
      "title": "Connecticut is back at No. 1 in the AP Top 25 to start its repeat bid in March Madness; Houston, Purdue, Iowa State next",
      "url": "https://apnews.com/b8a5d70de78effb85ab9db46faa67304",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "RAFAH, Gaza Strip (AP) — The U.N. food agency said Monday that “famine is imminent” in northern Gaza, where 70% of the remaining population is experiencing catastrophic hunger, and that a further escalation of the war could push around half of Gaza's total population to the brink of starvation.",
      "publishedAt": "2024-03-18T07:54:23Z",
      "title": "UN says 'famine is imminent' in northern Gaza as Israel launches another raid on the main hospital",
      "url": "https://apnews.com/eefc526aec97821fe5f1e845801a6640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f224fe0f9ba349ea8f64eb6d1485a7be/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER and JULIA FRANKEL",
      "description": "WASHINGTON (AP) — President Joe Biden and Israeli Prime Minister Benjamin Netanyahu spoke on Monday, their first interaction in more than a month, as the divide has grown between allies over the food crisis in Gaza and conduct of the war, according to the White House.",
      "publishedAt": "2024-03-18T15:58:45Z",
      "title": "Biden and Netanyahu hold first call in more than a month as tension grows over food crisis, war",
      "url": "https://apnews.com/24b8ff4a6ce61ed410fe5a1beb640b4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e055863a3e5439696531a8f35068c36/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS, DASHA LITVINOVA and JIM HEINTZ",
      "description": "President Vladimir Putin extended his reign over Russia in a landslide election whose outcome was never in doubt, declaring Monday his determination to advance deeper into Ukraine and dangling new threats against the West.",
      "publishedAt": "2024-03-18T05:15:35Z",
      "title": "Putin extends rule in preordained Russian election after harshest crackdown since Soviet era",
      "url": "https://apnews.com/ebdaae1bf12b44343b88ba471f9f0cb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ead152dbfb6849648e48705f30337154/1920.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BERLIN (AP) — When Sabine Thonke joined a recent demonstration in Berlin against Germany's far-right party, it was the first time in years she felt hopeful that the growing power of the extremists in her country could be stopped.",
      "publishedAt": "2024-03-18T04:10:11Z",
      "title": "Germans thought they were immune to nationalism after confronting their Nazi past. They were wrong",
      "url": "https://apnews.com/2dce0ea7ed40fccd3f0ec1c46edcfd42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77f630163e99498b97f297091d3d7667/3000.jpeg"
    },
    {
      "author": "NICK PERRY and LISA RATHKE",
      "description": "ELMORE, Vt. (AP) — Julie wants more donations to the food pantry. Kipp is busy knitting a sweater. Shorty is ready to ask: Why is so much being spent on a truck? The coffee, fresh-baked bread and donuts have been laid out.",
      "publishedAt": "2024-03-18T04:08:12Z",
      "title": "In Vermont, 'Town Meeting' is democracy embodied. What can the rest of the country learn from it?",
      "url": "https://apnews.com/11d7d1b63037d054506e77e261aff87c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e26705a903454a42a4269de1eaffee50/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "The lack of excitement many Americans feel about a presidential rematch has heightened interest in alternatives to the major-party candidates, none more so than Robert F.",
      "publishedAt": "2024-03-18T04:07:39Z",
      "title": "Who is Robert F. Kennedy Jr. and why is he running for president?",
      "url": "https://apnews.com/097ac973a32ddf2e8e4edecd6a8f3153",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a173ad1814af4351ad3c22fd45fec10c/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court seemed likely Monday to side with the Biden administration in a dispute with Republican-led states over how far the federal government can go to combat controversial social media posts on topics including COVID-19 and election security.",
      "publishedAt": "2024-03-18T04:04:13Z",
      "title": "Supreme Court seems favorable to Biden administration over efforts to combat social media posts",
      "url": "https://apnews.com/132df16a8b086cd7ed72954f3b4c2c04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e29b3a8d1e84008bfa65d3784b09ea4/3000.jpeg"
    },
    {
      "author": "PIERRE-RICHARD LUXAMA and ODELYN JOSEPH",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Gangs attacked two upscale neighborhoods in Haiti’s capital early Monday in a rampage that left at least a dozen people dead in surrounding areas.Gunmen looted homes in the communities of Laboule and Thomassin before sunrise, forcing residents to flee as some called radio stations pleading for police.",
      "publishedAt": "2024-03-18T15:21:29Z",
      "title": "Gangs unleash new attacks on upscale areas in Haiti's capital, with at least a dozen killed nearby",
      "url": "https://apnews.com/c1f4d1b367b15253cbd28ae9be886440",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04344dbeaabb4db88d1f06e5b3eb4d1a/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Environmental Protection Agency on Monday announced a comprehensive ban on asbestos, a carcinogen that is still used in some chlorine bleach, brake pads and other products and that kills tens of thousands of Americans every year.",
      "publishedAt": "2024-03-18T15:31:39Z",
      "title": "EPA bans asbestos, a deadly carcinogen still in use decades after a partial ban was enacted",
      "url": "https://apnews.com/72b0fa8b36adedaff6000034d35c2acd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82ec3b007d024ffb9fe35a44d7763d26/2248.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}