{
  "articles": [
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — About 10 minutes into the movie “ Challengers,” Zendaya’s character’s daughter pokes her head into a room and asks about watching something on TV together.",
      "publishedAt": "2024-08-23T10:00:24Z",
      "title": "Thanks to Zendaya, Serena and more, tennis is having a moment as the US Open arrives",
      "url": "https://apnews.com/240a1771255947abdd22eeb16ebcebd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d02b4573f08434488fc080ab5709cb7/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and STEPHANIE LIECHTENSTEIN",
      "description": "SOLINGEN, Germany (AP) — The Islamic State militant group on Saturday claimed responsibility for a knife attack that killed three people and wounded eight more at a crowded festival marking this city's 650th anniversary.",
      "publishedAt": "2024-08-24T06:38:10Z",
      "title": "Islamic State group claims responsibility for knife attack that killed 3 in Solingen, Germany",
      "url": "https://apnews.com/84ad7df23ca5ecc8c2145d57e75090d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f0c4339f1c04c8ab051114de363134f/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and DAVID RISING",
      "description": "CAIRO (AP) — Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.",
      "publishedAt": "2024-08-24T10:08:49Z",
      "title": "Israeli airstrikes kill dozens in Gaza on the eve of high-level cease-fire talks in Egypt",
      "url": "https://apnews.com/2abd1983d176c6ea3d19a5ace02688b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc7c75c746d6454ea216f078d20a0095/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA decided Saturday it’s too risky to bring two astronauts back to Earth in Boeing’s troubled new capsule, and they'll have to wait until next year for a ride home with SpaceX.",
      "publishedAt": "2024-08-24T17:17:24Z",
      "title": "NASA decides to keep 2 astronauts in space until February, nixes return on troubled Boeing capsule",
      "url": "https://apnews.com/e4e81e5a6c23dee2f8f72260ddea011c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5d1a79ee2204ec7b56881bd4eb1012a/3000.jpeg"
    },
    {
      "author": "ALI SWENSON, FARNOUSH AMIRI and GARY FIELDS",
      "description": "CHICAGO (AP) — Before dropping his bid for reelection, President Joe Biden framed voters’ choice in November in dark and ominous terms, painting Republican nominee Donald Trump as a menace to American democracy and questioning whether the country could survive if he won.",
      "publishedAt": "2024-08-24T04:06:34Z",
      "title": "Harris isn’t backing away from Biden’s democracy focus. But she’s putting her own spin on it",
      "url": "https://apnews.com/f156ff565ec70f1b0ada8f295869271f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24d0035ff2ba4c748c909f9736ec651f/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Young girls screamed and elbowed each other in a crush of bodies in southern Gaza, trying desperately to reach the front of the food line. Men doled out rice and chicken as fast as they could, platefuls of the nourishment falling to the ground in the tumult.",
      "publishedAt": "2024-08-24T06:07:30Z",
      "title": "Israeli evacuation orders cram Palestinians into shrinking 'humanitarian zone' where food is scarce",
      "url": "https://apnews.com/f4833f8faf3cdb683e2ddd964767b438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/871537c15e754cc09f220645c528c3b5/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russia and Ukraine exchanged over 100 prisoners of war each on Saturday as Kyiv marked its third Independence Day since Moscow's full-scale invasion.",
      "publishedAt": "2024-08-24T09:40:42Z",
      "title": "Moscow and Kyiv swap prisoners of war as Ukraine marks independence anniversary",
      "url": "https://apnews.com/a7b06472aa1d96f39e417379c6d1782c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51409cc2bb204a05968fef5046bcd0ee/2000.jpeg"
    },
    {
      "author": "MARTHA IRVINE",
      "description": "CHICAGO (AP) — Bearded and bespectacled, YM Masood has a quiet nature that suggests he's older than age 20. A political science major, he plans to graduate from college in December, well ahead of schedule.",
      "publishedAt": "2024-08-24T04:10:45Z",
      "title": "Portrait of a protester: Outside the Democratic convention, a young man talks of passion and plans",
      "url": "https://apnews.com/b08b13802194c245e6a40a1b9be657a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c67f11911694e9eb0c2f6d6e2e54e45/3000.jpeg"
    },
    {
      "author": "JOSH FUNK and ROB GILLIES",
      "description": "TORONTO (AP) — The Canadian arbitrator appointed to resolve a messy railroad labor dispute to protect the North American economy has ordered employees at the country’s two major railroads back to work so both can resume operating.",
      "publishedAt": "2024-08-24T22:28:19Z",
      "title": "Back-to-work order issued for 2 major Canada railroads. Union will comply, but lawsuit planned",
      "url": "https://apnews.com/67b1be6e6a4d5e9535633e54767c5d82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46d2f76a13104bf08f1292182d30c2d3/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Conflicting federal policies may force thousands of residents in flood-prone areas to pay more for flood insurance or be left unaware of danger posed by dams built upstream from their homes and worksites, according to an Associated Press review of federal records and data.",
      "publishedAt": "2024-08-24T04:12:43Z",
      "title": "Conflicting federal policies may cost residents more on flood insurance, and leave them at risk",
      "url": "https://apnews.com/05637fd8a49e4ddcc080981d776e59e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/351474b61e2e4e42831699a431c62420/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}