{
  "articles": [
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump's choice of Matt Gaetz to be attorney general has many Justice Department employees reeling, worried not only about their own jobs but the future of the agency that the Trump loyalist has railed against.",
      "publishedAt": "2024-11-16T13:15:23Z",
      "title": "Anxiety and dismay inside the Justice Department after Trump taps Gaetz as attorney general",
      "url": "https://apnews.com/852d3096a6f154fcdb23581948f906e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e30aaf5ce11f4f69a6e21939d79212bf/3000.jpeg"
    },
    {
      "author": "MIKE CATALINI, PHILIP MARCELO AND AUDREY McAVOY",
      "description": "TOTOWA, N.J. (AP) — Patrons at Murph's Tavern are toasting not just Donald Trump's return to the presidency but the fact that he carried their northern New Jersey county, a longtime Democratic stronghold in the shadow of New York City.",
      "publishedAt": "2024-11-16T13:37:50Z",
      "title": "From New Jersey to Hawaii, Trump made inroads in surprising places in his path to the White House",
      "url": "https://apnews.com/346dbbd11111f9558b69ed137321c630",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e5a9f569edd442697801511cbe67b12/3000.jpeg"
    },
    {
      "author": "BILL BARROW and JOEY CAPPELLETTI",
      "description": "ATLANTA (AP) — Kamala Harris and the Democratic Party's prodigious fundraising operation raised more than $1 billion in her loss to Donald Trump, but the vice president is still pushing donors for more money after the election.",
      "publishedAt": "2024-11-16T16:10:15Z",
      "title": "Kamala Harris raised $1 billion-plus in defeat. She's still sending persistent appeals to donors",
      "url": "https://apnews.com/806eeb3b92eced3242aeb29a964ca259",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6148468605624940844227d854da83aa/2621.jpeg"
    },
    {
      "author": "EMMA BURROWS, HANNA ARHIROVA and LORI HINNANT",
      "description": "KYIV, Ukraine (AP) — At a secretive factory in Russia's central grasslands, engineers are manufacturing hundreds of decoy drones meant to overwhelm Ukrainian defenses as they try to protect against a horrific new weapon, an Associated Press investigation has found.",
      "publishedAt": "2024-11-16T05:06:21Z",
      "title": "Operation False Target: How Russia plotted to mix a deadly new weapon among decoy drones in Ukraine",
      "url": "https://apnews.com/2f904b04fcc5de17549415a974f5a92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76742f121c4d4081a87b504b1a48afc7/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — Over the past two weeks, the political landscape around the negotiations for a cease-fire in Gaza have undergone a dramatic transformation.",
      "publishedAt": "2024-11-16T05:45:40Z",
      "title": "The family of Israeli-American hostage pleads with Biden and Trump to bring hostages home",
      "url": "https://apnews.com/7e3cd6a6f0b9cd70cced92225a31e66c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261f2360482441f08c39757ea7a927a1/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Israeli ground forces reached their deepest point in Lebanon since they invaded six weeks ago before pulling back Saturday after battles with Hezbollah militants, Lebanese state media reported.",
      "publishedAt": "2024-11-16T12:06:32Z",
      "title": "Israeli troops reach deepest point in Lebanon since Oct. 1 invasion, Lebanese media say",
      "url": "https://apnews.com/41d19e05cebf73a66dc320ccad047d4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9a8e406467c4c5aa59eaa61a5a37dfe/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — A fire tore through a neonatal intensive care unit in a hospital in northern India, killing 10 newborn babies and injuring 16 others, authorities said.The fire occurred late Friday at a hospital in Jhansi city in India's Uttar Pradesh state.",
      "publishedAt": "2024-11-16T04:13:50Z",
      "title": "Fire engulfs hospital ward in northern India, killing 10 newborn babies",
      "url": "https://apnews.com/c2236ba37d12e4f5353df5ebb68171e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e164bddb88454fc481800f3d5f67da53/2016.jpeg"
    },
    {
      "author": "HOLLY MEYER",
      "description": "In the new horror movie, “Heretic,” Hugh Grant plays a diabolical religious skeptic who traps two scared missionaries in his house and tries to violently shake their faith.",
      "publishedAt": "2024-11-16T13:34:57Z",
      "title": "From 'The Exorcist' to 'Heretic,' why holy horror can be a hit with moviegoers",
      "url": "https://apnews.com/1252f80811e8c5e6cdc6610d3d87b070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8c6df39ba874ce495d4c4562f49a782/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "HAINES CITY, Fla. (AP) — Not long ago, Polk County’s biggest draw was citrus instead of people. Located between Tampa and Orlando, Florida’s citrus capital produces more boxes of citrus than any other county in the state and has devoted tens of thousands of acres to growing millions of trees.",
      "publishedAt": "2024-11-16T05:12:08Z",
      "title": "Forget downtown or the ’burbs. The far-flung exurbs are where people are moving",
      "url": "https://apnews.com/c98972d87c37faa9ceb89cfcfa07ce1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c7b8184f18f4618b62f64d6272ffc58/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Sean ‘Diddy’ Combs has tried to reach out to prospective witnesses and influence public opinion from jail in a bid to affect potential jurors for his upcoming sex trafficking trial, prosecutors claimed in a court filing urging a judge to reject his latest bail request.",
      "publishedAt": "2024-11-16T07:48:18Z",
      "title": "Sean 'Diddy' Combs is trying to obstruct justice from jail, prosecutors say",
      "url": "https://apnews.com/9194f48e5f3326afb8c36068b2149492",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b358015f8f7444fa823d51559e370b9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}