{
  "articles": [
    {
      "author": "Justin Spike",
      "description": "A planned news conference after talks between Ukrainian President Volodymyr Zelenskyy and U.S. President Donald Trump’s Ukraine envoy has been canceled. The cancellation happened Thursday as political tensions deepen between the two countries over how to end the almost three-year war with Russia. The press event was to include comments to the media by Zelenskyy and retired U.S. Lt. Gen. Keith Kellogg. But it was changed at the last minute so that the two politicians did not deliver statements or field questions from journalists. Ukrainian presidential spokesman Serhii Nikiforov said the change was requested by the U.S. side. Kellogg’s trip to Kyiv coincided with recent feuding between Trump and Zelenskyy.",
      "publishedAt": "2025-02-20T15:01:08Z",
      "title": "A news conference between Zelenskyy and Trump’s Ukraine envoy is canceled amid growing tensions",
      "url": "https://apnews.com/article/ukraine-zelenskyy-trump-kellogg-821625d76fd88a139066f4436323700c",
      "urlToImage": "https://dims.apnews.com/dims4/default/37a9342/2147483647/strip/true/crop/6918x3891+0+360/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F1f%2F32687d734af587fa34aa6c86f392%2Fap25049665850904.jpg"
    },
    {
      "author": "Justin Spike",
      "description": "President Donald Trump has blamed Ukraine for starting the war that has cost tens of thousands of Ukrainian lives. His comments caused outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military. Trump called Ukrainian President Volodymyr Zelenskyy “a dictator without elections” and claimed his support among voters was near rock-bottom. Zelenskyy said Wednesday that the disinformation is coming from Russia, and some of what Trump has said does echo Russia’s own narrative of the conflict.",
      "publishedAt": "2025-02-19T19:25:37Z",
      "title": "Trump says Ukraine started the war that's killing its citizens. What are the facts?",
      "url": "https://apnews.com/article/ukraine-russia-trump-war-zelenskyy-putin-7fe8c0c80b4e93e3bc079c621a44e8bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5822ed/2147483647/strip/true/crop/4660x2621+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F73%2F3ffa368b078fb7b1d2221155e464%2Fafce5fdda4064e0baba94ac9c75ace9a"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin's invasion of Ukraine three years ago has turned into Europe’s largest conflict since World War II. Tens of thousands have been killed, cities have been reduced to ruins, millions of Ukrainians became refugees, and Russia was isolated from the West. Now as top Russian and U.S. officials are talking again and setting the stage for summit meeting, Putin appears closer than ever to cementing Moscow’s gains of about a fifth of Ukraine’s territory and keeping the country out of NATO. President Donald Trump reversed the U.S. policy of isolating Russia, saying they have agreed “to work together very closely” to end the war. He said Ukrainian President Volodymyr Zelenskyy “will be involved” but didn’t elaborate.",
      "publishedAt": "2025-02-20T05:13:50Z",
      "title": "As the Ukraine war reaches its 3-year mark, Russia seems to have time on its side as talks start",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-zelenskyy-f334a0922cecf08b4c78de75aca6d9ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/b183b87/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fca%2F717a0e48c9671c156411fba9e1d0%2F6ebe2572bc2d4b118ce8d6eb44fbf716"
    },
    {
      "author": "Stephany Matat, Aamer Madhani, Mike Pesoli",
      "description": "President Donald Trump has warned Ukrainian President Volodymyr Zelenskyy that he “better move fast” to negotiate an end to Russia’s invasion of Ukraine or risk not having a nation to lead. The rhetoric from Trump toward Ukraine comes amid an escalating back-and-forth between the two presidents and rising tensions between the United States and much of Europe over Trump’s approach to settling the biggest conflict on the continent since World War II. Trump’s broadside came not long after Zelenskyy’s comment that Trump was being influenced by Russian disinformation as he tries to bring the fighting to a close on terms that Kyiv says are too favorable to Moscow.",
      "publishedAt": "2025-02-19T16:31:40Z",
      "title": "Trump warns Zelenskyy to quickly negotiate war's end with Russia or risk not having a nation to lead",
      "url": "https://apnews.com/article/trump-zelenskyy-ukraine-russia-war-7d18400b935166773bbd3b3323c8aa5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7c696b/2147483647/strip/true/crop/3206x1803+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F2b%2F013e7a13efe7dbffe18c0bc707c3%2F1410097b0719430c9215cc688f8d43d5"
    },
    {
      "author": null,
      "description": "Officials say that Russia and Belarus will hold a joint military exercise in September, part of efforts by the two neighbors and allies to expand military ties amid the fighting in Ukraine. The Zapad, or West, 2025 drills will involve over 13,000 troops. That's according to Valery Revenko, an assistant to the Belarusian defense minister. Belarus’ authoritarian President Alexander Lukashenko, who has ruled Belarus with an iron hand for over 30 years and has relied on Kremlin subsidies and support, allowed Russia to use his country’s territory to send troops into neighboring Ukraine in 2022 and to host some of its tactical nuclear weapons.",
      "publishedAt": "2025-02-20T16:06:01Z",
      "title": "Russia and Belarus will hold a joint military drill in September",
      "url": "https://apnews.com/article/russia-belarus-drills-ukraine-war-putin-lukashenko-ad45228521bfe71964f7d70d5ff934a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1113b4/2147483647/strip/true/crop/3017x1697+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2F4c%2F6f19a832e45b99f106a8abaf9413%2F913a3437c4f548c6b9094e17752fb351"
    },
    {
      "author": "Melanie Lidman",
      "description": "The bodies presumed to be of the youngest Israelis held hostage by the militant Hamas group have been returned to Israel, dashing the hopes of a nation hoping for a happier ending. Two boys and their mother were abducted from a kibbutz on Oct. 7, 2023, and became a symbol of the country’s anguish. Hamas had claimed the family was killed in an Israeli airstrike, but their fate remained unclear for months. The father was freed earlier this month in a ceasefire deal. Images of the red-haired children circulated widely and their ordeal fueled calls for the release of all the hostages taken by Hamas. The remains will now be formally identified.",
      "publishedAt": "2025-02-20T09:27:26Z",
      "title": "Israel grieves as Hamas turns over the remains said to be of a mother and her 2 young children",
      "url": "https://apnews.com/article/israel-gaza-ceasefire-hostages-bodies-bibas-1d8718176c8d2564cf23c3e77f09ad72",
      "urlToImage": "https://dims.apnews.com/dims4/default/e526e05/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fdf%2F7ef062f6e65bcc5184c27f453333%2F78404add511541239e870f47a5f88383"
    },
    {
      "author": "Geir Moulson",
      "description": "German voters go to the polls Sunday to elect a parliament that will determine who runs the country for the next four years. Germany has Europe’s biggest economy and is the EU’s most populous nation. It is a leading member of NATO and the second-biggest weapons supplier to Ukraine. The vote count is likely to be final early Monday, but it's not clear what governing coalitions are possible. Preelection polling shows a mainstream conservative bloc with about 30% support and the far-right Alternative for Germany with around 20%. Parties need to get 5% of the vote to win seats, so how many reach that threshold may determine the coalition's makeup. All mainstream parties say they won’t work with AfD.",
      "publishedAt": "2025-02-20T05:19:32Z",
      "title": "German voters prepare to elect a new parliament. Here's what to expect on and after election day",
      "url": "https://apnews.com/article/germany-parliament-election-chancellor-21d264a97ef4a8bf5236308d1e4e5ab1",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f42f48/2147483647/strip/true/crop/6979x3926+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F8e%2Fdffacd57b1b1af3532bd2da35c3b%2F59bd4ef3dec042268c628d2609dd9f0e"
    },
    {
      "author": "Kim Tong-hyung",
      "description": "Actor Kim Sae-ron’s death adds to the list of celebrity deaths in South Korea that underscore the enormous pressure they face under the gaze of a relentlessly unforgiving media that pounces on their every misstep. Experts express concern about increasingly provocative coverage as traditional media compete with YouTube channels and other social media sources for clicks, further dimming the prospects for reforms. Kim rose to stardom as a child actor with the 2010 thriller “The Man from Nowhere” and garnered acclaim and popularity for other acting roles. But she was condemned and ridiculed for many aspects of her life after a drunken-driving crash in 2022.",
      "publishedAt": "2025-02-20T07:16:03Z",
      "title": "Kim Sae-ron's death underscores the huge pressure on South Korean celebrities",
      "url": "https://apnews.com/article/south-korea-actor-kim-sae-ron-suicide-media-coverage-youtube-3924a3a118327d54cf703b1fc0e1e5e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/44102cf/2147483647/strip/true/crop/2694x1515+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F7d%2Ff5bb22d22e76febfd0caf30b8ceb%2Fc2423f45e8694ce68d0d2ac83733d12d"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa, Melanie Lidman",
      "description": "Hamas is set to return the bodies of four Israeli hostages, including a mother and her two children who have long been feared dead and had come to embody the nation’s agony following the Oct. 7, 2023, attack. The remains to be released from the Gaza Strip on Thursday are of Shiri Bibas and her two children, Ariel and Kfir. Kfir was the youngest captive taken that day. Hamas has said all three were killed in an Israeli airstrike early in the war. The militant group also plans to release the body of Oded Lifshitz, who was 83 when he was abducted.",
      "publishedAt": "2025-02-20T05:18:28Z",
      "title": "Hamas to return 4 Israeli bodies, including a mother and her 2 young children",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-20-2025-4c2ffabae1771cff1a9542fddfaf7d07",
      "urlToImage": "https://dims.apnews.com/dims4/default/437be2c/2147483647/strip/true/crop/2000x1125+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F4b%2Fac489de4e6d83532116417958539%2Ffce3fcc65d2e45a79f419633124c4e10"
    },
    {
      "author": "Bruce Schreiner",
      "description": "Sen. Mitch McConnell is announcing he won’t seek reelection next year, ending a decadeslong tenure as a power broker who championed conservative causes but ultimately ceded ground to the fierce populism of President Donald Trump. The Kentucky Republican has chosen his 83rd birthday on Thursday to share his decision to retire when his current term ends in January 2027. McConnell is the longest-serving Senate party leader in U.S. history. McConnell helped forge a conservative Supreme Court and steered the Senate through tax cuts and presidential impeachment trials. McConnell informed The Associated Press of his decision before he was set to address colleagues in a speech on the Senate floor.",
      "publishedAt": "2025-02-20T16:15:47Z",
      "title": "Sen. Mitch McConnell won't seek reelection in Kentucky in 2026",
      "url": "https://apnews.com/article/mitch-mcconnell-senate-retirement-34c79ef12bf62d14cb71d3c393f23a83",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4eee55/2147483647/strip/true/crop/8496x4779+0+443/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F0b%2F93a57008f48c44426f90099fb03b%2F5ba9c44e724f48af8fab4a51822b1c22"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}