{
  "articles": [
    {
      "author": null,
      "description": "A judge has rejected a Trump administration request to unseal transcripts from grand jury investigations of Jeffrey Epstein years ago in Florida. A similar records request is pending in New York. U.S. District Judge Robin Rosenberg in West Palm Beach said Wednesday the request to release grand jury documents from 2005 and 2007 did not meet any of the extraordinary exceptions under federal law that could make them public.",
      "publishedAt": "2025-07-23T19:14:36Z",
      "title": "Judge rejects effort to unseal Epstein grand jury records in Florida",
      "url": "https://apnews.com/article/epstein-trump-grand-jury-records-florida-3254decc623fbf2a5ee2967c7adfa2e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "A House subcommittee has voted to subpoena the Department of Justice for files in the sex trafficking investigation into Jeffrey Epstein. Democrats successfully goaded GOP lawmakers to defy Trump and Republican leadership to support the action. Democrats on a subcommittee of the powerful House Committee on Oversight made a motion for the subpoena Wednesday afternoon, just hours before the House was scheduled to end its July work session and depart Washington for a monthlong break. Three Republicans on the panel voted with Democrats for the subpoena, sending it through on an 8-2 vote tally.",
      "publishedAt": "2025-07-23T19:39:32Z",
      "title": "House subcommittee votes to subpoena Epstein files",
      "url": "https://apnews.com/article/epstein-files-congress-democrats-subpoena-republicans-trump-5d17ea83f7ffeff5784159848b97f38e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ab243e/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2Fec%2Fb6a4cd1364eaceff46020e38a0f9%2F0e8f08f9421344dda24f5a4bcc17bd2c"
    },
    {
      "author": null,
      "description": "Director of National Intelligence Tulsi Gabbard this month declassified material that she claimed proved a “treasonous conspiracy” by the Obama administration in 2016 to politicize U.S. intelligence in service of casting doubt on the legitimacy of Donald Trump’s election victory. But a review by The Associated Press of reports produced by federal prosecutors and congressional committees casts doubt on that claim and others made by the nation’s top intelligence official.",
      "publishedAt": "2025-07-24T04:13:58Z",
      "title": "Gabbard's claims of anti-Trump conspiracy not backed by declassified documents",
      "url": "https://apnews.com/article/gabbard-russia-2016-steele-dossier-0452e1079506daa86d75fa0a2f22fc60",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8f2334/2147483647/strip/true/crop/2688x1512+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F43%2F00e1b4e5fa39fd31bdeb644c2df7%2F02357f21c1c14eed86864e19e8444fe6"
    },
    {
      "author": null,
      "description": "Thai and Cambodian soldiers have fired at each other in a contested border area after the nations downgraded their diplomatic relations in a rapidly escalating dispute. It was not immediately clear if the clash was ongoing. A livestream video from Thailand’s side showed people running from their homes and hiding in a concrete bunker Thursday morning as explosions sounded periodically. The clash happened in an area where the ancient Prasat Ta Muen Thom temple stands along the border of Thailand’s Surin province and Cambodia Oddar Meanchey province. Both Thailand and Cambodia accused each other of opening fire first.",
      "publishedAt": "2025-07-24T03:12:02Z",
      "title": "Thai and Cambodia soldiers fire at each other in disputed border area",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-5b1e15987fb02132268913e474250c51",
      "urlToImage": "https://dims.apnews.com/dims4/default/37cb443/2147483647/strip/true/crop/1473x829+0+77/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Ff3%2F3421e19445c957c4350bd4514f15%2Fc3ba190254464c8a88e8a8870ed028b3"
    },
    {
      "author": null,
      "description": "Columbia University has reached a deal with the Trump administration to pay more than $220 million to the federal government to restore federal research money that was canceled in the name of combating antisemitism on campus, the university announced Wednesday. Under the agreement, the Ivy League school will pay the $200 million settlement over three years to the federal government, the university said. It will also pay $21 million to settle investigations brought by the U.S. Equal Employment Opportunity Commission.",
      "publishedAt": "2025-07-23T23:52:05Z",
      "title": "Columbia University reaches a deal with Trump to restore federal research funds",
      "url": "https://apnews.com/article/columbia-trump-deal-00eef5dca9f003e593d2cb151f5cce17",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A federal appeals court has ruled that President Donald Trump’s order seeking to end birthright citizenship is unconstitutional, affirming a lower-court decision that blocked its enforcement nationwide. The ruling from the 9th U.S. Circuit Court of Appeals comes after the push was also blocked by a federal judge in New Hampshire, and puts the issue one step closer to quickly coming back before the Supreme Court.",
      "publishedAt": "2025-07-24T00:18:25Z",
      "title": "Court finds Trump’s effort to end birthright citizenship unconstitutional",
      "url": "https://apnews.com/article/immigration-birthright-citizenship-16658c712cf6a3141f168c7557c0628d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d1297c/2147483647/strip/true/crop/3840x2160+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F8c%2F510cbabc2bbf9c4a2604af236e64%2F3f27a83261b24d5aa9e3e715235d4170"
    },
    {
      "author": null,
      "description": "A judge is expected to order Bryan Kohberger to serve four life sentences without parole this week for brutally stabbing four University of Idaho students to death nearly three years ago. Wednesday’s sentencing hearing will be an opportunity for the families of Xana Kernodle, Madison Mogen, Ethan Chapin and Kaylee Goncalves to tell the court and Kohberger about the anguish they’ve felt since he broke into a home and killed their loved ones in the early morning hours of Nov. 13, 2022. Kohberger pleaded guilty to four counts of first-degree murder and one count of burglary in a deal that avoids the death penalty. He waived his right to appeal.",
      "publishedAt": "2025-07-23T04:07:30Z",
      "title": "Bryan Kohberger expected to receive 4 life sentences for killing Idaho university students",
      "url": "https://apnews.com/article/idaho-students-murdered-bryan-kohberger-sentencing-97325ba6addb5e0fe20af6b68f021f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/571583a/2147483647/strip/true/crop/6000x3375+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fb3%2F8f6e3eede38612e6fd9becc5b28c%2F6d3955aeb8b74941a66179ff3e5753e2"
    },
    {
      "author": null,
      "description": "A federal judge in Maryland has prohibited the Trump administration from taking Kilmar Abrego Garcia into immediate immigration custody if he’s released from jail in Tennessee while awaiting trial on human smuggling charges. U.S. District Judge Paula Xinis ordered the U.S. government to provide notice of three business days if Immigration and Customs Enforcement intends to deport him. The judge also ordered the government to restore the federal supervision that Abrego Garcia was under before he was wrongfully deported to his native El Salvador in March. That supervision had allowed Abrego Garcia to live and work in Maryland.",
      "publishedAt": "2025-07-23T19:15:26Z",
      "title": "Judge bars ICE from immediately taking Abrego Garcia into custody",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-ice-27fa028f2bcc7ceb6667963f1fb04c74",
      "urlToImage": "https://dims.apnews.com/dims4/default/9591a8b/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F80%2F0236bd058f8b627c092f5ab94862%2Ff6908b2c90b84a938a23fb4762876cf7"
    },
    {
      "author": null,
      "description": "President Donald Trump has unveiled an “AI Action Plan” shaped by Silicon Valley tech leaders who supported his campaign. The plan, disclosed Wednesday, focuses on boosting artificial intelligence technology exports, streamlining permits for energy-intensive data centers and exporting American AI around the world. Trump gave his tech advisers six months to come up with new AI policies after revoking President Joe Biden’s AI guardrails on his first day in office. Opponents of the Republican president's AI agenda argue it prioritizes the needs of Big Tech over people. More than 100 groups have come together to sign a resolution calling for a “People's AI Action Plan” that would preserve safeguards for the American public.",
      "publishedAt": "2025-07-23T04:04:58Z",
      "title": "Trump's new AI plan leans heavily on Silicon Valley industry ideas",
      "url": "https://apnews.com/article/trump-ai-artificial-intelligence-3763ca207561a3fe8b35327f9ce7ca73",
      "urlToImage": "https://dims.apnews.com/dims4/default/763f3f4/2147483647/strip/true/crop/5817x3272+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fbc%2Fb9dcc3f503d47658a3d1bc132236%2Ff2aaee9d03b940ae8c1d3b2ac7e267ba"
    },
    {
      "author": null,
      "description": "More than 100 charity and human rights groups are warning that Palestinians in the Gaza Strip are being pushed toward starvation. The groups issued the warning Wednesday in an open letter that cited Israel’s blockade and military offensive. Meanwhile, local health officials said Israeli strikes killed another 29 people. In other developments, the Trump administration’s Mideast envoy, Steve Witkoff, was set to meet with a senior Israeli official about ceasefire talks. It's a sign that lower-level negotiations that have dragged on for weeks could be approaching a breakthrough. The head of the World Health Organization says many of Gaza's 2 million people are starving.",
      "publishedAt": "2025-07-23T14:23:18Z",
      "title": "Aid groups warn of starvation in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-aid-ceasefire-hostages-07-23-2025-1d1cfef28bc593adac2c2a0e432cfc97",
      "urlToImage": "https://dims.apnews.com/dims4/default/e310070/2147483647/strip/true/crop/5218x2935+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F5c%2F9609daee0f1afb345109a9466cfd%2Fb7fd02103bbb496ea421792306846927"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}