{
  "articles": [
    {
      "author": "JACK JEFFERY",
      "description": "JERUSALEM (AP) — A 12-year-old boy in east Jerusalem lights the fuse of a long firework and hoists it in the air. Then, just before it explodes and illuminates the night sky with a burst of red, he is shot in the chest by Israeli police and falls to the ground.",
      "publishedAt": "2024-03-21T05:08:46Z",
      "title": "A firework is lit, a boy is shot. Israel’s use of deadly force against Palestinians is scrutinized",
      "url": "https://apnews.com/600690541cc356f7648ff6c3a2091004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8b06a10dd914670b3952ff743dbc01f/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "United States Secretary of State Antony Blinken says the “gaps are narrowing” in indirect negotiations between Israel and Hamas over another cease-fire and hostage release that the U.S., Egypt and Qatar have spent several weeks trying to broker.",
      "publishedAt": "2024-03-21T07:40:13Z",
      "title": "The Latest | Gaps are narrowing in Israel-Hamas cease-fire talks, Blinken says during Mideast visit",
      "url": "https://apnews.com/cef55ee4f6aedbab909014582e0b68ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02a14cadd151408ea8db7b4f1cddfa3a/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ANTON SHTUKA",
      "description": "KYIV, Ukraine (AP) — Russia fired 31 ballistic and cruise missiles at Kyiv before dawn Thursday in the first attack on the Ukrainian capital in 44 days, officials said. Air defenses shot down all the incoming missiles, though 13 people including a child were injured by falling wreckage, they said.",
      "publishedAt": "2024-03-21T08:01:50Z",
      "title": "Russia fires 31 missiles at Kyiv in the first attack in 44 days, and 13 people are hurt",
      "url": "https://apnews.com/384e883b85c1e0689a3165830ca440c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7cc533255ca4674bd9cdb5a0cd271e5/3000.jpeg"
    },
    {
      "author": "REZA SAIFULLAH and EDNA TARIGAN",
      "description": "MEULABOH, Indonesia (AP) — An Indonesian search and rescue ship on Thursday located a capsized wooden boat that had been carrying dozens of Rohingya Muslim refugees, and began pulling survivors who had been standing on its hull to safety.",
      "publishedAt": "2024-03-21T05:31:43Z",
      "title": "Weeping, weak and soaked, dozens of Rohingya refugees rescued after night on hull of capsized boat",
      "url": "https://apnews.com/67996f9362830d6ee0fd1d181571fbac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2d848e36c59453ba602926f6133814e/1920.jpeg"
    },
    {
      "author": "GENE JOHNSON and MARK THIESSEN",
      "description": "Authorities are searching for a white supremacist Idaho prison inmate and an accomplice who fled after the accomplice shot and wounded corrections officers as they were transporting the inmate from a Boise hospital, according to police.",
      "publishedAt": "2024-03-21T05:03:40Z",
      "title": "Escaped white supremacist inmate and accomplice still at large after Idaho hospital ambush",
      "url": "https://apnews.com/5d4eb764853ca05d2721145bc435367a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2894e5c59a4831b87642f2f28b35e5/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders from both parties looked to put a positive light on a $1.2 trillion spending package that lawmakers are working to approve before funding expires at midnight Friday for a host of key government agencies.",
      "publishedAt": "2024-03-20T22:09:18Z",
      "title": "Congressional leaders sell $1.2 trillion spending package to members before shutdown deadline",
      "url": "https://apnews.com/38ed7713ae6436ee27c81ce62b0a9a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18e7165d632a450f8b5bb3f4069e1cd5/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — With abortion rights poised to be one of the major issues in the 2024 election, a new poll shows that Asian Americans, Native Hawaiians and Pacific Islanders in the United States are highly supportive of legal abortion, even in situations where the pregnant person wants an abortion for any reason.",
      "publishedAt": "2024-03-21T04:07:28Z",
      "title": "Nearly 8 in 10 AAPI adults in US think abortion should be legal, AP-NORC poll finds",
      "url": "https://apnews.com/7d90bc4db4093791b3ef31081a8addd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bea04883ced64afeb8423a44865de482/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN and ALI SWENSON",
      "description": "LONDON (AP) — AI fakery is quickly becoming one of the biggest problems confronting us online. Deceptive pictures, videos and audio are proliferating as a result of the rise and misuse of generative artificial intelligence tools.",
      "publishedAt": "2024-03-21T05:25:04Z",
      "title": "One Tech Tip: How to spot AI-generated deepfake images",
      "url": "https://apnews.com/8f7403c7e5a738488d74cf2326382d8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cf459d1f33e456c99dee8813132cb3c/2928.jpeg"
    },
    {
      "author": "STEPHEN WADE AND TONG-HYUNG KIM",
      "description": "SEOUL, South Korea. (AP) — Shohei Ohtani’s interpreter and close friend was fired by the Los Angeles Dodgers following allegations of illegal gambling and theft from the Japanese baseball star.",
      "publishedAt": "2024-03-21T08:26:55Z",
      "title": "Ohtani's interpreter is fired by Dodgers after allegations of 'massive theft' from Japanese star",
      "url": "https://apnews.com/a86471f296e986ad65634574da504e45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/850bd2ca0e4745e096baf0c943a7294d/3000.jpeg"
    },
    {
      "author": "MITCH STACY",
      "description": "DAYTON, Ohio (AP) — Tristan da Silva scored 20 points and Colorado won its first NCAA Tournament game in three years, wrapping up the First Four with a sloppy 60-53 win over Boise State on Wednesday night.",
      "publishedAt": "2024-03-21T04:05:00Z",
      "title": "Tristan da Silva scores 20 points as Colorado outlasts Boise State 60-53 to cap the First Four",
      "url": "https://apnews.com/0f63642919f0622b38e9976c4033d41d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ded50ff94104e21b3de9afd32a11fad/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}