{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The White House is claiming victory in a showdown with Colombia over accepting flights of deported migrants from the U.S. on Sunday, hours after President Donald Trump threatened steep tariffs on imports and other sanctions on the longtime U.S. partner.",
      "publishedAt": "2025-01-27T07:49:00Z",
      "title": "Live updates: White House claims victory in a showdown with Colombia over taking deported migrants",
      "url": "https://apnews.com/live/trump-presidency-day-8-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/60b2d83/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F77%2F5fa44d084b49b5ab15400be48444%2Fcolombiaminsite.jpg"
    },
    {
      "author": "EMMA BURROWS, DAVID KLEPPER",
      "description": "Current and former European and U.S. officials have raised concerns about some of President Donald Trump’s picks for top intelligence posts. The Associated Press spoke with 18 current and former officials who also have raised questions about Trump’s past relationship with America’s spies and their ability to share information at a time of heightened terror threats and signs of greater cooperation between U.S. adversaries. They say there are concerns about his nominations for key intelligence roles, including Tulsi Gabbard and Kash Patel, but expressed hope that America's relationships with allies are strong enough to survive any storm.",
      "publishedAt": "2025-01-27T05:04:07Z",
      "title": "Trump could test intelligence sharing ties between the US and its allies",
      "url": "https://apnews.com/article/trump-intelligence-sharing-russia-ukraine-nato-f8ed7e5e9d40b24ba3c075b80894ce5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d1615a/2147483647/strip/true/crop/3577x2012+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F3a%2F89c837b207beed91d4bd430fc97c%2Ffa4b56d5411441d4ac401cbaa026aeca"
    },
    {
      "author": "SOPHIA TAREEN, ALANNA DURKIN RICHER",
      "description": "Top Trump administration officials visited Chicago on Sunday to witness the start of ramped-up immigration enforcement in the nation’s third-largest city as federal agencies touted arrests around the country. “Border czar” Tom Homan and Acting Deputy Attorney General Emil Bove were in Chicago. Few details of the operation were immediately made public, including any arrests. Federal agents in Colorado detained about 50 people in an operation targeting drug trafficking by a Venezuelan hang. The sheer number of federal agencies involved showed President Donald Trump’s willingness to use federal law enforcement beyond the Department of Homeland Security to carry out his long-promised mass deportations.",
      "publishedAt": "2025-01-26T16:55:11Z",
      "title": "Top Trump administration officials in Chicago for immigration enforcement crackdown",
      "url": "https://apnews.com/article/trump-deportations-chicago-immigration-arrests-cfb20a3e412443aa2ca6c6ed4d1070d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5688acc/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd2%2Fdbafab1b6c61cd45b33c040a85e6%2F06d1369792c24a9e9353588fcedb52d8"
    },
    {
      "author": "MICHAEL PHILLIS, ALEXA ST. JOHN",
      "description": "President Trump is reversing his predecessor’s efforts to clean up areas hardest hit by pollution from heavy industry, ports and roadways – communities that are often largely Black, Latino and low-income. He eliminated the “Justice 40” initiative the Biden created which required 40% of the benefits from certain environmental programs go to hard-hit communities. He disbanded a team of White House advisors who focus on the issue. It's part of a spate of early executive orders that align with Trump's campaign pledge to slash regulations and eliminate an emphasis on diversity, equity and inclusion. The new administration actions end a short-lived federal embrace of environmental justice.",
      "publishedAt": "2025-01-26T14:30:06Z",
      "title": "Trump eliminates help for Black, Latino communities hit by pollution",
      "url": "https://apnews.com/article/climate-health-trump-environmental-justice-pollution-59baf164c81049d3995d2dfe1eceda8c",
      "urlToImage": "https://dims.apnews.com/dims4/default/c784aab/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F9f%2Fe2f469dfeffca86c3731880e964f%2Fe6dac41036eb4ee4b875d0de89816f55"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP",
      "description": "There will be a lot on the plate for new Defense Secretary Pete Hegseth when he steps into his office on the Pentagon’s third floor E Ring. Issues confronting him range from global conflicts and border security to administrative tasks. He'll have to address President Donald Trump’s priority to strengthen the U.S. military presence along the southern border. And Hegseth will be reviewing whether active-duty forces should be used for law enforcement. That's something done rarely. He'll have decisions to make about aid to Ukraine, the ceasefire in Gaza and troop deployments in the Mideast. Not to mention Trump directives to rid the government of diversity programs and personnel.",
      "publishedAt": "2025-01-26T13:40:32Z",
      "title": "Pentagon: What changes could come as Pete Hegseth takes charge",
      "url": "https://apnews.com/article/pentagon-hegseth-priorities-border-budget-3227111b703be8a90ad93da289784932",
      "urlToImage": "https://dims.apnews.com/dims4/default/99a7baa/2147483647/strip/true/crop/7410x4168+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F77%2Feaff75e91b3fa26a89c63d1474d9%2Fd8acb40c65f44e25b9de8ed8eef901f7"
    },
    {
      "author": "WILL WEISSERT",
      "description": "A key ally of President Donald Trump says the White House pardoning rioters who fought with police while storming the U.S. Capitol in 2021 is “sending the wrong signal” and expressed concern about the future ramifications of issuing sweeping clemencies. “I have always said that, I think, when you pardon people who attack police officers, you’re sending the wrong signal to the public at large,” Sen. Lindsey Graham, a South Carolina Republican who is close to Trump, told CNN on Sunday. “It’s not what you want to do to protect cops.” Appearing on NBC's “Meet the Press” Graham called the pardons “a mistake.”",
      "publishedAt": "2025-01-26T17:40:39Z",
      "title": "Lindsey Graham says pardoning Capitol attackers sends 'wrong signal'",
      "url": "https://apnews.com/article/trump-capitol-attack-pardons-rhodes-graham-fcaae053eac12e22ba6a8ae7c0c33f5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/36db1a0/2147483647/strip/true/crop/5507x3098+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fd4%2Fff8c7e2d51bc2676215ab6ee9e9f%2Fbf485271fe17435694e105a79f1c65ce"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JOSEPH KRAUSS",
      "description": "Israel is allowing Palestinians to return to the heavily destroyed north of the Gaza Strip for the first time since the early weeks of the 15-month war with Hamas, in accordance with a fragile ceasefire. Thousands of Palestinians headed north Monday after waiting for days to cross. Associated Press reporters saw people crossing the so-called Netzarim corridor shortly after 7 a.m. The opening was delayed over a dispute between Hamas and Israel, which said the militant group had changed the order of the hostages it released in exchange for scores of Palestinian prisoners.",
      "publishedAt": "2025-01-27T05:17:24Z",
      "title": "Israel allows Palestinians to return to northern Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-27-2025-48a7eb98d6900cdf24b32ea93b5bc584",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bdabcc/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2Fa8%2F14b1f8312da084bb77558eb9ce26%2Fd5b82bd14a594a9394636c146d2b81ad"
    },
    {
      "author": "SUSAN HAIGH, DEVI SHASTRI",
      "description": "Vaccination bills are popping up in more than 15 states as lawmakers aim to potentially resurrect or create new religious exemptions from immunization mandates, establish state-level vaccine injury databases or dictate what providers must tell patients about the shots. Many see a political opportunity to rewrite policies in their states during President Donald Trump's administration and if Robert F. Kennedy, Jr. is confirmed as the next secretary of the Department of Health and Human Services. Childhood vaccination rates against dangerous infections have fallen nationwide. A new poll by The Associated Press-NORC Center for Public Affairs Research says about half of Americans are “very” or “extremely” concerned that those declining childhood vaccination rates will lead to more outbreaks.",
      "publishedAt": "2025-01-27T12:01:37Z",
      "title": "Vaccine bills stack up in statehouses across the US",
      "url": "https://apnews.com/article/vaccines-whooping-cough-rfk-measles-exemptions-covid-27dae6f61505ef1953ca869a78c71942",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4ee6dc/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2Fa7%2F98fc7370d30f38a5cc4b5eef6a92%2F7f6716d87e1e4e6989a01a2ef39fd7ea"
    },
    {
      "author": null,
      "description": "The Washington Commanders jumped offsides four times in a sequence of five plays while trying to stop Philadelphia’s vaunted tush push. The repeated penalties earned them a warning from the referee that he could award the Eagles a touchdown if the Commanders did it again. Jonathan Allen was flagged twice and Frankie Luvu was flagged twice during the sequence, with Luvu leaping over the Eagles' line on consecutive plays. Referee Shaun Hochuli told the crowd, “Washington has been advised that referees can award a score if this type of behavior happens again.”",
      "publishedAt": "2025-01-26T23:33:24Z",
      "title": "Commanders warned referees can 'award a score' after 4 penalties near goal line in loss to Eagles",
      "url": "https://apnews.com/article/eagles-commanders-hurts-tush-push-4f73a5412557dae060472b9cc19d46bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/408c524/2147483647/strip/true/crop/6920x3893+0+361/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F0d%2F7b3db8f2c610719191120458c557%2F0cf8228351614576b4c940e24b83d523"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Residents of northern Israel are surveying damage and trying to rebuild after the 14-month war between Israel and Hezbollah. The devastation of the kibbutz of Manara, near the Lebanese border, became a symbol of the heavy price of fighting. All homes on the ridge facing nearby Lebanon are destroyed. It will be years before some homes are livable again. But no one wants to ask the difficult question: Will some residents choose not to return? Many residents are skeptical of the government’s pledges to ensure their safety. A tenuous ceasefire has largely held, though it was tested on Sunday as a 60-day deadline passed for Israel and Hezbollah to withdraw their forces from southern Lebanon.",
      "publishedAt": "2025-01-27T06:02:56Z",
      "title": "A destroyed Israeli kibbutz on the Lebanese border starts to pick up the pieces. Who will return?",
      "url": "https://apnews.com/article/israel-lebanon-hezbollah-war-ceasefire-displaced-kibbutz-fdec88efa0c5255f9cb0abef6d396bb9",
      "urlToImage": "https://dims.apnews.com/dims4/default/d81f5a7/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb9%2Fdd2155a39e6f0020d1918b170d3d%2F496c6c504bea4fdd9feee6e28e644d7e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}