{
  "articles": [
    {
      "author": "DAVID SHARP, PATRICK WHITTLE, HOLLY RAMER and MICHELLE R. SMITH",
      "description": "LEWISTON, Maine (AP) — The Army reservist who opened fire in a bowling alley and then at a bar in Lewiston, Maine, killing 18 people, was found dead Friday from a self-inflicted gunshot, ending an intensive two-day search that had the state on edge.",
      "publishedAt": "2023-10-27T05:03:11Z",
      "title": "Maine mass killing suspect has been found dead, ending search that put entire state on edge",
      "url": "https://apnews.com/fed5ab0aaee9d7d4c0f0fccb3d301bb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d67d7f41f3624083a1c560d8213d4768/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JOSEF FEDERMAN and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel knocked out internet and communications in the Gaza Strip in stepped-up bombardment Friday night, largely cutting off its 2.3 million people from contact with each other and the outside world and creating a near-blackout of information, as the military said it was “expanding” ground operations in the territory.",
      "publishedAt": "2023-10-27T06:40:44Z",
      "title": "Israel steps up air and ground attacks in Gaza and cuts off the territory's communications",
      "url": "https://apnews.com/e41b5b12e8cdf9db62395314d9a782b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e26069a15ab4e9a829962cad893452e/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military says its ground forces will expand their activities in Gaza Friday night.",
      "publishedAt": "2023-10-27T07:31:53Z",
      "title": "Live updates | UN calls for ‘humanitarian truce’ in Gaza as Israel expands activity in the territory",
      "url": "https://apnews.com/af48f964636c8a2836e02e78ff01ec4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c14a86a6aee482ead988f4808460f71/1920.jpeg"
    },
    {
      "author": "DIDI TANG, MATTHEW LEE and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden and Chinese President Xi Jinping have agreed to meet on the sidelines of next month’s Asia-Pacific Economic Cooperation summit in San Francisco, according to a U.S.",
      "publishedAt": "2023-10-27T04:09:33Z",
      "title": "Agreement reached for Biden-Xi talks, but details still being worked out, official tells AP",
      "url": "https://apnews.com/fbaef1a1afb599807a8fe47f3600a384",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ac22e332a834fe0bb8725cc911f6e67/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "FALMOUTH, Maine (AP) — Maine's close-knit community of deaf and hard of hearing people is grieving in the wake of the Lewiston shootings that killed beloved members, many of whom were ardent advocates.",
      "publishedAt": "2023-10-27T20:59:03Z",
      "title": "Maine's close-knit deaf community is grieving in the wake of shootings that killed 4 beloved members",
      "url": "https://apnews.com/a6bfb5f48e45fd7a20317010bf6e18e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/517f7936ecc242fe850f56f47bde618e/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — Desperate families made missing posters Friday and joined online groups to look for loved ones out of touch since Hurricane Otis devastated the Mexican Pacific coast city of Acapulco.",
      "publishedAt": "2023-10-27T04:42:33Z",
      "title": "Families hunt for loved ones not heard from since Hurricane Otis pummeled Acapulco",
      "url": "https://apnews.com/4c33ae4a3ebcf272eb05b89ae898bb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis has ordered the Vatican to reopen the case of a well-known priest-artist accused of sexually, psychologically and spiritually abusing adult women, and removed the statute of limitations that had previously prevented a church trial based on their claims.",
      "publishedAt": "2023-10-27T11:27:32Z",
      "title": "Pope orders Vatican to reopen case of priest accused of adult abuse but allowed to keep ministering",
      "url": "https://apnews.com/cb8e67c99fd8ecfb8517f6282765d70e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dc50ec8cdb84507b83f7c2077fe68f1/2307.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A bullet-riddled family photo tacked to a refrigerator in Kibbutz Kissufim in southern Israel following the Oct. 7 Hamas attack. Horrific scenes of the lifeless bodies of Palestinian children pulled from the rubble in the Gaza Strip following Israeli retaliatory airstrikes.",
      "publishedAt": "2023-10-27T21:25:36Z",
      "title": "AP PHOTOS: Scenes of sorrow and despair on both sides of Israel-Gaza border on week 3 of war",
      "url": "https://apnews.com/1b8b60293a5593f9865cb26f1ea9f824",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2272f376e2b4829a6041708a7f84ce8/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump is set to testify Nov. 6 at his New York civil fraud trial, following his three eldest children to the witness stand in a case that threatens to disrupt their family's real estate empire, state lawyers said Friday.",
      "publishedAt": "2023-10-27T04:12:45Z",
      "title": "Donald Trump is set to testify Nov. 6 in civil fraud trial. Daughter Ivanka also will testify",
      "url": "https://apnews.com/c7018a92f3a2cb2496a55ad1cacf2412",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b620e984f49e59f57a59d8024cf50/1920.jpeg"
    },
    {
      "author": "KEVIN McGILL and STEPHEN SMITH",
      "description": "NEW ORLEANS (AP) — The heating element removed from Monique Plaisance's water heater in September was disintegrating, streaked with rust and covered in a dry crust. She blamed the corrosion on the water piped in from the area's longtime drinking water source: the Mississippi River.",
      "publishedAt": "2023-10-27T05:01:28Z",
      "title": "A salty problem for people near the mouth of the Mississippi is a wakeup call for New Orleans",
      "url": "https://apnews.com/1a55ad43ce83419247642929629377b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eeec4e271fc940d1bd1351e0728c5516/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}