{
  "articles": [
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "AMIZMIZ, Morocco (AP) — People in Morocco slept in the streets of Marrakech for a third straight night as soldiers and international aid teams in trucks and helicopters began to fan into remote mountain towns hit hardest by a historic earthquake.",
      "publishedAt": "2023-09-10T07:48:16Z",
      "title": "Moroccans sleep in the streets for 3rd night following an earthquake that took more than 2,100 lives",
      "url": "https://apnews.com/a927c7d286bf6e1047feb1c91ab96fd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b44fa075dfd34c8a9484714921bc37cf/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and AAMER MADHANI",
      "description": "HANOI, Vietnam (AP) — President Joe Biden said Sunday his visit to Vietnam to showcase stronger ties with Hanoi was not about trying to start a “cold war” with China, but rather was part of a broader effort to provide global stability by building U.S.",
      "publishedAt": "2023-09-10T03:32:28Z",
      "title": "Biden says US outreach to Vietnam is about providing global stability, not containing China",
      "url": "https://apnews.com/ac8f9dd899f77910c42295769d3fedb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8aa99f5bc953490f95d8c745b5b27ca6/2791.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Michael White had only recently arrived in a grim Iranian jail when a curious fellow prisoner, an English-speaking Iranian, approached him in the courtyard for a conversation.",
      "publishedAt": "2023-09-10T11:54:36Z",
      "title": "A US Navy veteran got unexpected help while jailed in Iran. Once released, he repaid the favor",
      "url": "https://apnews.com/0a6b5a9c63c414e530a6871b9deebb1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45837db1c58040898de6a1f28fc9a9b8/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — A drone attack Sunday on an open market south of Sudan's capital, Khartoum, killed at least 43 people, activists and a medical group said, as the military and a powerful rival paramilitary group battle for control of the country.",
      "publishedAt": "2023-09-10T08:35:46Z",
      "title": "A drone attack on an open market has killed at least 43 people in Sudan as rival troops battle",
      "url": "https://apnews.com/ded192c55c6b0e8cc29b1b5bc5965fc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b70f290faac4a7ea2f626f2d1509300/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Two foreign aid workers were reportedly killed in eastern Ukraine on Sunday as Russian shelling hit a van carrying a team of four working with a Ukrainian nongovernmental organization, while dozens of Russian drones targeted Kyiv and wounded at least one civilian.",
      "publishedAt": "2023-09-10T10:14:33Z",
      "title": "Russian strikes on Ukraine kill 2 foreign aid workers and target Kyiv",
      "url": "https://apnews.com/a8d300ce02127880ff168d610b312c6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df773cb8a6e453bafe82781c05bba05/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Luis Rubiales, the suspended head of the Spanish soccer federation, finally folded under immense pressure Sunday and resigned three weeks after his kiss of a player on the lips overshadowed Spain’s first-ever Women’s World Cup title.",
      "publishedAt": "2023-09-10T20:35:29Z",
      "title": "Rubiales resigns as Spain's soccer president 3 weeks after kissing player at Women's World Cup final",
      "url": "https://apnews.com/7ae39241dd3798d251230ba3c8ffa303",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0772700e62ef411d98cb71586e40deda/3000.jpeg"
    },
    {
      "author": "YUCHENG TANG",
      "description": "BANGKOK (AP) — Xinyu Wen traveled to Thailand in June, planning a two-week vacation around Bangkok's Pride parade.",
      "publishedAt": "2023-09-11T02:02:29Z",
      "title": "Thailand's LGBTQ+ community draws tourists from China looking to be themselves",
      "url": "https://apnews.com/64aa8fa85e11ff92ce0adad810af58a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bbbadcf2236434681f2ed18ef42623e/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — About 146,000 U.S. auto workers are set to go on strike this week if General Motors, Ford and Stellantis fail to meet their demands for big pay raises and the restoration of concessions the workers made years ago when the companies were in financial trouble.",
      "publishedAt": "2023-09-10T11:00:28Z",
      "title": "Why the United Auto Workers union is poised to strike major US car makers this week",
      "url": "https://apnews.com/0c41761e174236151a29cc698f5dc7d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/977d90caed8f4e12a313575e4e73971d/3000.jpeg"
    },
    {
      "author": null,
      "description": "HONOLULU (AP) — Kilauea, one of the most active volcanoes in the world, began erupting Sunday after a two-month pause, displaying glowing lava that is a safe distance from people and structures in a national park on the Big Island.",
      "publishedAt": "2023-09-11T02:20:51Z",
      "title": "Hawaii volcano Kilauea erupts after nearly two months of quiet",
      "url": "https://apnews.com/acbd84358872fafe63b3244af7d4d2a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3938d8ffc1d44cf884c01ed9830d33fa/2880.jpeg"
    },
    {
      "author": "ISSAM ADWAN",
      "description": "GAZA CITY, Gaza Strip (AP) — Israeli fighter jets bombed the Zorob family’s two-story home in the Gaza Strip in 2019, leaving nothing but a pile of debris and despair.",
      "publishedAt": "2023-09-10T05:17:02Z",
      "title": "Families in Gaza have waited years to move into new homes. Political infighting is keeping them out",
      "url": "https://apnews.com/7d0f528ca58802d4007e9e0bab0dda8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f637945f1e14299b36de98fba804cd2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}