{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and MELANIE LIDMAN",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel released another group of Palestinian prisoners Friday, hours after Hamas freed additional Israeli hostages under a last-minute agreement to extend their cease-fire by another day in Gaza.",
      "publishedAt": "2023-11-30T06:10:08Z",
      "title": "More Israeli hostages freed and more Palestinian prisoners released under tenuous Gaza truce",
      "url": "https://apnews.com/ea1a8fad4e2f4a394e5427a7c5815d38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/433c7028ee5841a2b5e57f4e3fc17496/1920.jpeg"
    },
    {
      "author": "AMY TEIBEL",
      "description": "JERUSALEM (AP) — Bayan Khateeb knows she's a terrible cook. So when she managed to pull off a dish of cooked tomatoes and eggs, she took a photo to show friends on social media.“Soon we shall eat the Shakshouka of victory!” crowed her caption, which included an emoji of the Palestinian flag.",
      "publishedAt": "2023-11-30T17:58:29Z",
      "title": "Wartime Israel shows little tolerance for Palestinian dissent",
      "url": "https://apnews.com/b0a85e866c8a2ee9235ed4452d3185a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e0a26a474a24cae9fedcb426a5586e8/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Two big-state governors with presidential ambitions, California Democratic Gov. Gavin Newsom and Florida Republican Gov. Ron DeSantis, argued Thursday over the economy, pandemic restrictions and President Joe Biden's leadership in a prime-time showdown filled with fiery clashes over policy and personal insults.",
      "publishedAt": "2023-11-30T05:17:18Z",
      "title": "DeSantis and Newsom lob insults and talk some policy in a faceoff between two White House aspirants",
      "url": "https://apnews.com/d7695de79221caf80a730532c614c01f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e0ecb0282dc41f7825386ddf54e9b99/1860.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — About two weeks into a major offensive against Myanmar's military-run government by an alliance of three well-armed militias of ethnic minorities, an army captain, fighting in a jungle area near the northeastern border with China, lamented that he'd never seen such intense action.",
      "publishedAt": "2023-12-01T01:01:50Z",
      "title": "Myanmar's military is losing ground against coordinated nationwide attacks, buoying opposition hopes",
      "url": "https://apnews.com/8e9381ba35dd07620ae20772486a5ecd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f9dabd9d9ca4ffabbac9513b7a62644/2000.jpeg"
    },
    {
      "author": "NANCY BENAC",
      "description": "WASHINGTON (AP) — All these years later, the scene still is almost too bizarre to imagine: a tearful president and his perplexed aide, neither very religious, kneeling in prayer on the floor of a White House bedroom in the waning hours of a shattered presidency.",
      "publishedAt": "2023-11-30T05:04:32Z",
      "title": "Henry Kissinger was a trusted confidant to President Nixon until the bitter, bizarre end",
      "url": "https://apnews.com/d760662fa0b911ed86333c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9835bac5ec674741bd7f3397bed9daad/1920.jpeg"
    },
    {
      "author": "FOSTER KLUG and GEIR MOULSON",
      "description": "TOKYO (AP) — The death of former U.S. Secretary of State Henry Kissinger drew both admiration and scorn Thursday from political leaders around the world, highlighting the complicated legacy of Kissinger’s views about what it meant to serve America’s interests during the Cold War — and how the country should exert its influence.",
      "publishedAt": "2023-11-30T03:35:01Z",
      "title": "Henry Kissinger’s complicated legacy draws admiration and scorn from across the globe",
      "url": "https://apnews.com/4e98e88ae257d21603924651c75a383d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fe9cf047f14a37b52b38bf6e805e41/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — The Republican National Committee's rules for next year's nominating contest and convention were released this week without addressing a question the GOP could well face next summer: Can the party's delegates vote for a different candidate if the presumptive nominee is convicted of a felony?",
      "publishedAt": "2023-11-30T18:36:34Z",
      "title": "What if Donald Trump is convicted? The 2024 Republican convention rules don't address the issue",
      "url": "https://apnews.com/0bc16f9bf75ae9f42d85a8a5276aa03b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7f08a2fdcfb49599805c8ef0e594ae4/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and COURTNEY BONNELL",
      "description": "LONDON (AP) — The OPEC oil cartel led by Saudi Arabia and allied producers including Russia made another big swipe at propping up lagging crude prices Thursday, expanding some output cuts into next year and bringing up-and-coming oil supplier Brazil into the fold.",
      "publishedAt": "2023-11-30T05:02:33Z",
      "title": "Some OPEC+ members will cut the oil that they send to the world to try to boost prices",
      "url": "https://apnews.com/b7e7be4f92afc9ad1ba35830aa0da818",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2423f17afc44120b8077a8757aecd16/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and DAVE BRYAN",
      "description": "LONDON (AP) — Shane MacGowan, the boozy, rabble-rousing singer and chief songwriter of The Pogues, who infused traditional Irish music with the energy and spirit of punk, died Thursday, his family said.",
      "publishedAt": "2023-11-30T12:18:01Z",
      "title": "Shane MacGowan, lead singer of The Pogues and a laureate of booze and beauty, dies at age 65",
      "url": "https://apnews.com/5b6f1f1becb575ceffca4ee01b3b12a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/184427cf5b7740caba2617e7e4d93d93/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — It's a challenge for all new parents: Getting enough sleep while keeping a close eye on their newborns. For some penguins, it means thousands of mini-catnaps a day, researchers discovered.",
      "publishedAt": "2023-11-30T19:09:55Z",
      "title": "Penguin parents sleep for just a few seconds at a time to guard newborns, study shows",
      "url": "https://apnews.com/cbbcad774a1252857cd9e61977e371d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfdf7571ace3431fa9f1ee9923f82eac/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}