{
  "articles": [
    {
      "author": "JILL COLVIN and AMANDA SEITZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump announced Thursday he will nominate anti-vaccine activist Robert F.",
      "publishedAt": "2024-11-14T21:01:26Z",
      "title": "Trump chooses anti-vaccine activist Robert F. Kennedy Jr. as health secretary",
      "url": "https://apnews.com/f40ee2398e3a280c1586eecdd80bdf7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79698a9a2ce44b1998e733077e321b58/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — After a resounding election victory, delivering what President-elect Donald Trump and Republicans call a “mandate” to govern, an uneasy political question is emerging: Will there be any room for dissent in the U.S.",
      "publishedAt": "2024-11-15T05:04:01Z",
      "title": "Trump is already testing Congress and daring Republicans to oppose him",
      "url": "https://apnews.com/59a69fe1758f5fb106d574895c70eba5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c44e1877df24828a22b11cc9451aa0d/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump spent much of his first term feeling stung and betrayed by those he’d placed in power. This time, he’s not taking chances.",
      "publishedAt": "2024-11-15T01:01:31Z",
      "title": "As he fills his new administration, Trump values loyalty above all else",
      "url": "https://apnews.com/ca140eec67df051cf6d378b7108f0f5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1604b050aa7f4f679609d029dfcb14ce/2862.jpeg"
    },
    {
      "author": "DAVID BILLER",
      "description": "LIMA, Peru (AP) — Representatives from 21 members representing the Pacific Rim are meeting in Peru on Friday for the Asia-Pacific Economic Cooperation forum, the first global summit since U.S. President-elect Donald Trump’s victory featuring several major world leaders.",
      "publishedAt": "2024-11-15T04:18:12Z",
      "title": "APEC leaders to open Lima summit as Trump prepares to return to office",
      "url": "https://apnews.com/fc2ac014b2f7314bfa1a53351b0bc3a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87f6490cc7a142faa6ade4a06a9e71f1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and TIA GOLDENBERG",
      "description": "BEN GURION INTERNATIONAL AIRPORT, Israel (AP) — At Israel's Ben Gurion International Airport, more than a year of war has taken its toll. Global airlines have canceled flights, gates are empty and pictures of hostages still held in the Gaza Strip guide the few arriving passengers to baggage claim.",
      "publishedAt": "2024-11-15T05:15:32Z",
      "title": "As airlines avoid Israel, UAE's FlyDubai and Etihad keep up flights for both diplomacy and dollars",
      "url": "https://apnews.com/816f5ac4fe206d35889989f0d40feda5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fed9493d104246dfb2c199b9e01569b2/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and SIBI ARASU",
      "description": "BAKU, Azerbaijan (AP) — Cities in Asia and the United States emit the most heat-trapping gas that feeds climate change, with Shanghai the most polluting, according to new data that combines observations and artificial intelligence.",
      "publishedAt": "2024-11-15T06:46:42Z",
      "title": "The world's most polluting cities are revealed at COP29 as frustration grows at fossil fuel presence",
      "url": "https://apnews.com/c29d2993a94ff16507a6d3a1560411ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95cc2253a65a477ba418bd29cd48d3cc/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN, MATTHEW DALY and COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — Biden administration officials are working against the clock doling out billions in grants and taking other steps to try to preserve at least some of the outgoing president's legacy before President-elect Donald Trump takes office in January.",
      "publishedAt": "2024-11-15T10:01:55Z",
      "title": "The last actions the Biden administration will take before Trump takes over the White House",
      "url": "https://apnews.com/2c27fb2239640fdb667f274215b712fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34e8d9ec20da4b1dae0f4284f3aeac8f/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — Donald Trump's vision for education revolves around a single goal: to rid America’s schools of perceived “ wokeness ” and “left-wing indoctrination.”",
      "publishedAt": "2024-11-15T05:18:35Z",
      "title": "Trump wants to end 'wokeness' in education. He has vowed to use federal money as leverage",
      "url": "https://apnews.com/24f864d83e2f5745d12a79ebac0d7cc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8174c89442fe48ba9308af0ac3df07ba/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — How do you remove children from the harms of social media? Politically the answer appears simple in Australia, but practically the solution could be far more difficult.The Australian government’s plan to ban children from social media platforms including X, TikTok, Facebook and Instagram until their 16th birthdays is politically popular.",
      "publishedAt": "2024-11-15T01:23:11Z",
      "title": "Australia's plan to ban children from social media proves popular and problematic",
      "url": "https://apnews.com/1abadf5445418c8c14f5f68cf76b38d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6df7da910284012bbfd61fc52d967ac/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Volcanoes were erupting on the mysterious far side of the moon billions of years ago just like on the side that we can see, new research confirms. Researchers analyzed lunar soil brought back by China's Chang'e-6, the first spacecraft to return with a haul of rocks and dirt from the little-explored far side.",
      "publishedAt": "2024-11-15T10:05:36Z",
      "title": "The far side of the moon once had erupting volcanoes too",
      "url": "https://apnews.com/5ac2d80e9f715f728f8c3be2caf56797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de20e90ebff34063b61da79a44ab7c70/1280.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}