{
  "articles": [
    {
      "author": "CHRISTOPHER RUGABER, DARLENE SUPERVILLE",
      "description": "President Donald Trump says he'll announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week. He's also reaffirming that he'll announce “reciprocal tariffs” — “probably Tuesday or Wednesday.” That means the U.S. would impose import duties on products in cases where another country has levied duties on U.S. goods. Trump spoke to reporters aboard Air Force One as he flew on Sunday from Florida to attend the Super Bowl in New Orleans.",
      "publishedAt": "2025-02-09T22:02:31Z",
      "title": "Trump says he will announce 25% steel and aluminum tariffs Monday",
      "url": "https://apnews.com/article/trump-steel-aluminum-tariffs-import-duties-74d7bfde0da59e111a45e772d199f2b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0cd7bc/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2Fb9%2F8d23900ecc1261cc038f96ce30e8%2F771129d26549492dbd10bf7fc70fd76b"
    },
    {
      "author": "JILL COLVIN",
      "description": "President Donald Trump said he is serious about wanting Canada to become the 51st state in an interview that aired Sunday during the Super Bowl preshow. “Yeah it is,” Trump told Fox News Channel’s Bret Baier when asked whether his talk of annexing Canada is “a real thing” — as Canadian Prime Minister Justin Trudeau recently warned. In the interview, Trump also said he has not seen enough action from Canada and Mexico to stave off the tariffs he has threatened to impose. “No, it’s not good enough,” he said of the United States' two largest trading partners. “Something has to happen. It’s not sustainable. And I’m changing it.”",
      "publishedAt": "2025-02-09T22:11:40Z",
      "title": "In Super Bowl interview, Trump says he wants Canada to be 51st state",
      "url": "https://apnews.com/article/canada-gulf-america-super-bowl-bret-baier-musk-7e1959c7d430899b01629c800db6f17b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e5c069/2147483647/strip/true/crop/7573x4260+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F10%2F8d4c6169c3d207e68ad6d830f154%2F5d2651b7eb764c438e45800ca57c5354"
    },
    {
      "author": "MARK SHERMAN",
      "description": "President Donald Trump will need the Supreme Court, with three justices he appointed, to enable the most aggressive of the many actions he has taken in just the first few weeks of his second White House term. But even a conservative majority with a robust view of presidential power might balk at some of what the president wants to do. The court gave Trump major victories last year that helped clear away potential obstacles to his reelection, postponing his criminal trial in Washington, D.C., then affording immunity from prosecution for official actions. But Trump’s first term was marked by significant defeats — as well as some wins — at the court.",
      "publishedAt": "2025-02-10T05:02:05Z",
      "title": "Supreme Court that Trump helped shape could have the last word on his aggressive executive orders",
      "url": "https://apnews.com/article/trump-supreme-court-birthright-citizenship-presidential-power-076bca4dba472d0d7e3b1d059cac7978",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb4dc04/2147483647/strip/true/crop/5166x2906+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2F3c%2F0f3946dc801b91c5de9c303a73b9%2F1d9cebc6463e4513943fa33c867b8f91"
    },
    {
      "author": null,
      "description": "A federal court has blocked the Trump administration from sending three Venezuelan immigrants held in New Mexico to Guantanamo Bay Naval Base in Cuba as part of the president’s immigration crackdown. In a legal filing Sunday, lawyers for the men asked the court for a temporary restraining order blocking their transfer, adding that “the mere uncertainty the government has created surrounding the availability of legal process and counsel access is sufficient to authorize the modest injunction.” An attorney for the men says that the court granted the temporary order during a brief hearing a short time later. A message seeking comment was left for ICE.",
      "publishedAt": "2025-02-10T00:53:33Z",
      "title": "Court grants request to block detained Venezuelan immigrants from being sent to Guantanamo",
      "url": "https://apnews.com/article/immigration-detention-guantanamo-venezuela-new-mexico-ice-8fa3d0d5ef2e0a50061aba04f1a13845",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6a19bf/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F09%2F48b9c850fddf980e25ca4a1e0a17%2F641559248699404e8703f62e799c6bb7"
    },
    {
      "author": "JILL COLVIN",
      "description": "President Donald Trump says he has directed the Treasury Department to stop minting new pennies, citing the rising cost of producing the one-cent coin. Trump wrote in a post Sunday night on his Truth Social site: “For far too long the United States has minted pennies which literally cost us more than 2 cents. This is so wasteful!” He added: “I have instructed my Secretary of the US Treasury to stop producing new pennies.” The move by Trump is the latest in what has been a rapid-fire effort by his new administration to enact sweeping change through executive order and proclamation.",
      "publishedAt": "2025-02-10T02:46:09Z",
      "title": "Trump says he has directed US Treasury to stop minting new pennies, citing rising cost",
      "url": "https://apnews.com/article/trump-penny-treasury-mint-192e3b9ad9891d50e7014997653051ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/23a7837/2147483647/strip/true/crop/6793x3821+0+354/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F66%2Fbe69129d93a8046ed0f69c69b450%2Fe4077503a0764e1192db15dcc00754bf"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down the agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal. Russell Vought is the newly installed director of the Office of Management and Budget. Vought directed the CFPB in a Saturday night email to stop work on proposed rules, to suspend the effective dates on any rules that were finalized but not yet effective, and to stop investigative work and not begin any new investigations. The agency has been a target of conservatives since President Barack Obama created it following the 2007-2008 financial crisis.",
      "publishedAt": "2025-02-09T16:08:36Z",
      "title": "Trump administration orders consumer protection agency to stop work, closes building",
      "url": "https://apnews.com/article/trump-consumer-protection-cease-1b93c60a773b6b5ee629e769ae6850e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b953726/2147483647/strip/true/crop/5588x3143+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F3b%2F060b1f79df14ceca38d7abf2f9ef%2F150b19a0430743adb1da70f86374ff16"
    },
    {
      "author": "JON GAMBRELL",
      "description": "A brief protest by a performer at Kendrick Lamar’s Super Bowl halftime show referenced Sudan and the Gaza Strip, two wars in the Middle East that have killed tens of thousands. But what’s happening in Gaza and Sudan? In the Gaza Strip, much of the territory has been obliterated in an Israeli offensive after a Hamas-led attack in 2023. In the initial attack, 1,200 people were killed and 250 others taken hostage. The Israeli offensive has killed more than 47,000 Palestinians, according to local authorities. In Sudan, a civil war since April 2023 has killed more than 28,000 people. Other estimates suggest a far higher death toll.",
      "publishedAt": "2025-02-10T07:05:21Z",
      "title": "What's happening in the Gaza Strip and Sudan that sparked a protest at the Super Bowl halftime show?",
      "url": "https://apnews.com/article/super-bowl-protester-whats-happening-gaza-sudan-dd79957e52b06212044cae6d4ce9e87e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0a27c1e/2147483647/strip/true/crop/4333x2437+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fef%2Fe61c544c731dff0c8b51c53069be%2F9f56317ebd6246d7a28c18d0382e81dc"
    },
    {
      "author": "SYLVIE CORBET, AAMER MADHANI",
      "description": "Major world political leaders are meeting for an AI summit in Paris, where challenging diplomatic talks are expected while tech titans fight for dominance in the fast-moving technology industry. Heads of state, top government officials, CEOs and scientists from around 100 countries are participating in the two-day international summit. They include U.S. Vice President JD Vance, on his first overseas trip since taking office, and Chinese Vice Premier Zhang Guoqing. The summit will give many European leaders a chance to meet Vance for the first time. On Tuesday, Vance will have a working lunch with French President Emmanuel Macron.",
      "publishedAt": "2025-02-10T06:02:04Z",
      "title": "High-stakes AI summit in Paris: World leaders, tech titans and challenging diplomatic talks",
      "url": "https://apnews.com/article/vance-ai-summit-paris-macron-be59047c41c86b03fafe646ea3a93bc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4056bec/2147483647/strip/true/crop/3971x2234+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F4f%2F2ebdbfecf7f8f83059878cff5f23%2Fe4296f613f8541f9b1c5bc98a2027eae"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "Ecuador will choose its next president in a runoff election after conservative incumbent Daniel Noboa and leftist lawyer Luisa González garnered enough votes Sunday to beat 14 other candidates. The contest will be a repeat of the October 2023 snap election that earned Noboa a 16-month presidency. He and González are now vying for a full four-year term, promising voters to reduce the widespread criminal activity that upended their lives four years ago. The spike in violence across the South American country is tied to the trafficking of cocaine produced in neighboring Colombia and Peru. The runoff election is set for April 13.",
      "publishedAt": "2025-02-10T04:51:27Z",
      "title": "Ecuador's conservative incumbent and a leftist lawyer advance to presidential runoff",
      "url": "https://apnews.com/article/ecuador-presidential-election-gonzalez-noboa-correa-crime-650a730693168df58914266fe3faa82c",
      "urlToImage": "https://dims.apnews.com/dims4/default/76f0a57/2147483647/strip/true/crop/6201x3488+0+323/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F02%2F92f1380f53763e11f3ac619a2daf%2Fbcec6ec17f5f4373ae06e412935f197a"
    },
    {
      "author": "BRETT MARTEL",
      "description": "The Philadelphia Eagles defeated the Kansas City Chiefs 40-22 in the first Super Bowl to be held in New Orleans in a dozen years. It was played amid heavy security — and with President Donald Trump in attendance — just 41 days after a man plowed a truck into New Year’s revelers on Bourbon Street. There were tributes before the game, and some big plays during it. The Eagles defense dominated with six sacks and two interceptions of Chiefs star quarterback Patrick Mahomes. Jalen Hurts passed for two TDs and scored another on the Eagles' renowned “tush push\" play.",
      "publishedAt": "2025-02-10T07:45:52Z",
      "title": "Super Bowl delivers moving tributes, memorable action and a historic presidential visit",
      "url": "https://apnews.com/article/super-bowl-memorable-moments-20a80371714da8cd3a99397ee5de3c96",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a4e72d/2147483647/strip/true/crop/7349x4134+0+383/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F77%2F7613b5f2c6caf8ad78c111cb8bbd%2Fef402867b3fe47b5b2559d0baebcfb11"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}