{
  "articles": [
    {
      "author": "KARIN LAUB, NAJIB JOBAIN and JACK JEFFERY",
      "description": "RAMALLAH, West Bank (AP) — The Israeli military on Friday mistakenly killed three Israeli hostages during its ground operation in the Gaza Strip, military officials said.The army’s chief spokesman, Rear Adm.",
      "publishedAt": "2023-12-15T08:04:04Z",
      "title": "Israeli military says it mistakenly killed 3 Israeli hostages in Gaza",
      "url": "https://apnews.com/072436cece0f2351fadfed892e985554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f84be0d7988430ab21c07c6779fc65f/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "CORALVILLE, Iowa (AP) — Donald Trump was uncharacteristically serious when he implored an audience in eastern Iowa to carry him to a blowout in next month's Republican caucuses. “The margin of victory is very important, it's just very important,” Trump told about 1,000 people attending a Wednesday rally aimed at organizing campaign volunteers.",
      "publishedAt": "2023-12-15T15:47:14Z",
      "title": "With Iowa's caucuses a month away, Trump urges voters to hand him not just a victory, but a blowout",
      "url": "https://apnews.com/ef6ede3e5b2172157fb48579a6c90840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b60b3f73b61f48b781048c6fd41200f8/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The United States experienced a dramatic 12% increase in homelessness to its highest reported level as soaring rents and a decline in coronavirus pandemic assistance combined to put housing out of reach for more Americans, federal officials said Friday.",
      "publishedAt": "2023-12-15T18:01:18Z",
      "title": "US homelessness up 12% to highest reported level as rents soar and coronavirus pandemic aid lapses",
      "url": "https://apnews.com/60bd88687e1aef1b02d25425798bd3b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77b116fcfeb849189c6bd2c1ff9d592a/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A boy, his face coated in fresh blood, screams as rescuers try to pull him out of the rubble of a destroyed building following an Israeli airstrike in Gaza.",
      "publishedAt": "2023-12-15T05:02:23Z",
      "title": "A year of war: 2023 sees worst-ever Israel-Hamas combat as Russian attacks on Ukraine grind on",
      "url": "https://apnews.com/2fb8b6f9083c188ef94e3870f4eb462f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88b791656cf4cb099c84a8b36571532/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "A quarter of U.S. congregations in the United Methodist Church have received permission to leave the denomination during a five-year window, closing this month, that authorized departures for congregations over disputes involving the church's LGBTQ-related policies.",
      "publishedAt": "2023-12-15T13:00:05Z",
      "title": "One fourth of United Methodist churches in US have left in schism over LGBTQ ban. What happens now?",
      "url": "https://apnews.com/70b8c89ea49174597f4548c249bab24f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdec19efa7a64485b4d18b80eb1be71e/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Jurors on Friday began their second day of deliberations to decide how much Rudy Giuliani must pay two former Georgia election workers for spreading lies about them after the 2020 election that led to a barrage of racist threats and upended their lives.",
      "publishedAt": "2023-12-15T15:22:18Z",
      "title": "Georgia election workers' defamation case against Giuliani opens second day of damages deliberations",
      "url": "https://apnews.com/6f6446c4f5224f521db8ff7763fb12d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d94036546f4d4546857fe3e177606704/3000.jpeg"
    },
    {
      "author": "BEN FINLEY and DENISE LAVOIE",
      "description": "NEWPORT NEWS, Va. (AP) — The mother of a 6-year-old who shot his teacher in Virginia was sentenced Friday to two years in prison for felony child neglect, nearly a year after her son used her gun to critically wound the educator.",
      "publishedAt": "2023-12-15T05:01:25Z",
      "title": "Mother of 6-year-old who shot teacher in Virginia gets 2 years in prison for child neglect",
      "url": "https://apnews.com/9b99a00c2745dcbcd49b4c25f2a86f96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04ff0df33ef34c77b664d10cd2b8f908/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER and JILL LAWLESS",
      "description": "LE PECQ, France (AP) — The vehicle's headlights silhouetted the exhausted teenager walking alone in the rain in deepest rural France, with a skateboard tucked under his arm. “I said to myself, ‘That’s strange.",
      "publishedAt": "2023-12-15T10:02:31Z",
      "title": "Declared missing as a child, British teenager lives off-grid for 6 years, then pops up in France",
      "url": "https://apnews.com/843cabd6b4f25870d29d8862e7e9f9fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909c22cdb38a45b4af4ce28b506f6388/3000.jpeg"
    },
    {
      "author": "ALICIA RANCILIO",
      "description": "There's a common phrase associated with Jack Reacher in Lee's Child's books: “Reacher says nothing.” Saying nothing, however, can be terrifying for Alan Ritchson, who plays Reacher on TV.",
      "publishedAt": "2023-12-15T14:18:37Z",
      "title": "'Reacher' star Alan Ritchson talks season two of hit show and how 'Amazon took a risk' on him",
      "url": "https://apnews.com/511e07c850977ce4918621df9ab5a6a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3a7865415ff4018b10c1812f84bc530/1920.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "Coach Brandon Staley and general manager Tom Telesco were fired by the Los Angeles Chargers on Friday morning after one of the worst losses in franchise history.The Chargers made the playoffs last season but are one of this year's biggest disappointments at 5-9, with losses in five of their last six games.",
      "publishedAt": "2023-12-15T17:21:57Z",
      "title": "Chargers fire coach Brandon Staley, general manager Tom Telesco in midst of disappointing season",
      "url": "https://apnews.com/31e9c0d0a52ea7903bdf0d8fccdcdaec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/486ed138323e49e6a5bfb0b3c524e344/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}