{
  "articles": [
    {
      "author": "MATTHEW LEE, BARAA ANWER, DASHA LITVINOVA",
      "description": "Top Russian and U.S. officials are set to hold talks hold talks in Saudi Arabia in a bid to improve their ties and negotiate an end to the war in Ukraine. The meeting between the two countries’ top diplomats in Riyadh on Tuesday would be their most significant since the Russia invaded its neighbor almost three years ago, and is meant to pave the way for a meeting between U.S. President Donald Trump and Russian President Vladimir Putin. Earlier this month, Trump upended U.S. policy toward Ukraine and Russia, saying he and Putin had agreed to begin negotiations on ending the war.",
      "publishedAt": "2025-02-18T06:18:20Z",
      "title": "Top Russian and US officials are set to hold talks on Ukraine war without Kyiv",
      "url": "https://apnews.com/article/russia-ukraine-war-riyadh-talks-trump-putin-rubio-0c3beebfef5839e9d509ff58239a6bc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd21604/2147483647/strip/true/crop/4819x2711+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2Fea%2Fe7d22ebe1e90de0ea053ccb510c6%2F5e52c5603e5f4db59f4166d4fc68b1cc"
    },
    {
      "author": "The Associated Press",
      "description": "Top Russian diplomats met with U.S. officials Tuesday in Saudi Arabia to discuss improving ties and negotiating an end to the war in Ukraine.",
      "publishedAt": "2025-02-18T07:46:00Z",
      "title": "Live updates: Russian official says Russia-US talks have ended, no date yet for Trump-Putin meeting",
      "url": "https://apnews.com/live/trump-presidency-updates-2-18-2025#00000195-192c-dbf1-abdf-df6ddc030000",
      "urlToImage": "https://dims.apnews.com/dims4/default/11d6442/2147483647/strip/true/crop/5500x3094+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F9a%2F759061a63aeeb684e045aa14aab2%2F56b9eba19b13467d9322e53bc380af50"
    },
    {
      "author": "THOMAS ADAMSON",
      "description": "European leaders were summoned by French President Emmanuel Macron in a high-profile display of European coordination on Ukraine. But even as the French leader hosted heads of state in Paris, presenting himself as Europe’s de facto leader, deep divisions lurked beneath the surface. With Trump administration officials preparing to negotiate directly with Russia, Macron seized the moment to convene key European players in Paris. Would Europe take charge of its own security, or would it remain sidelined? From Macron’s push for European-led defense to Keir Starmer’s ‘third way’ diplomacy, Giorgia Meloni’s alignment with Trump, and Olaf Scholz’s reluctance to break with NATO’s traditional framework, the continent remains at odds over the best path forward.",
      "publishedAt": "2025-02-18T16:29:44Z",
      "title": "Sidelined by Trump, Macron tries to rally Europe on Ukraine. But divisions run deep",
      "url": "https://apnews.com/article/europe-ukraine-security-summit-trump-2292c464676bd2876bda19518d9dd186",
      "urlToImage": "https://dims.apnews.com/dims4/default/f21c50c/2147483647/strip/true/crop/8108x4561+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Fde%2Fdc53120e197e66cb3897ac5a7449%2Fc8af53863f004953a38277f3a4a95043"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "After nearly three years of living under constant threat of Russian airstrikes while their troops fight a grinding campaign against Russia’s invasion, many Ukrainians long for an end to the war. But they now fear it could come on unfavorable terms. Top U.S. and Russian officials plan to meet Tuesday in Saudi Arabia to discuss an end to the war. Kyiv won't participate. That rankles some Ukrainians who worry they will be sidelined. While Ukraine will not take part in Tuesday’s talks, U.S. State Department spokesperson Tammy Bruce said any actual peace negotiations would only take place with Ukraine’s involvement.",
      "publishedAt": "2025-02-17T17:54:29Z",
      "title": "Many weary Ukrainians long for an end to the war but now fear it will come on unfavorable terms",
      "url": "https://apnews.com/article/ukraine-russia-war-peace-talks-trump-reaction-a3135cb1dfecc7dbcde663d3bb512e77",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bf9454/2147483647/strip/true/crop/5393x3034+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F1c%2F09a7558a32f2fc8588c3db078b95%2Fe6027cc7b26c43b8bdae301f7dedae08"
    },
    {
      "author": "JOHN SEEWER",
      "description": "The crash of a passenger jet that flipped while landing in Toronto, Canada, is raising questions about not only cause of the accident but also the safety of flying. The crash was the fourth major aviation accident in North America in the past three weeks. All 80 people on board the Delta Air Lines flight from Minneapolis that flipped Monday survived. Authorities say at least 18 people suffered relatively minor injuries. Communications between the tower at Toronto’s Pearson Airport and the pilot were normal as the plane approached the runway. Right now, it’s not clear what went wrong.",
      "publishedAt": "2025-02-18T16:18:37Z",
      "title": "What to know about the airplane that crashed and flipped while landing at Toronto's airport",
      "url": "https://apnews.com/article/delta-plane-flip-toronto-canada-airport-minneapolis-6d064bbc7a3bb8595183d6765d61a0ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/217fb0d/2147483647/strip/true/crop/3024x1701+0+4/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F45%2Fd99abe8189d4c28342e4e2d5c557%2F590a98ae5c4d4c0d90b018cf8c8e997b"
    },
    {
      "author": "AMANDA SEITZ, ANDREW DEMILLO, KEVIN FREKING",
      "description": "Republicans are weighing billions of dollars in cuts to Medicaid, jeopardizing health care coverage for some of the 80 million U.S. adults and children enrolled in the safety net program. The increasing number of Americans who signed up for taxpayer-funded health care coverage was lauded by Democrats during the Biden administration. But Republicans during the Trump administration are looking to slash federal spending. The $880 billion Medicaid program is financed mostly by federal taxpayers. The GOP-controlled Congress is eyeing work requirements for Medicaid and considering paying a shrunken, fixed rate to states. Over the next decade, Republican lawmakers could try to siphon billions of dollars from the nearly-free health care coverage offered to the poorest Americans.",
      "publishedAt": "2025-02-18T12:03:45Z",
      "title": "Republicans consider cuts and work requirements for Medicaid, jeopardizing care for millions",
      "url": "https://apnews.com/article/medicaid-cuts-work-requirements-congress-republicans-90ec1119f1d95de067c76f79eec7fa87",
      "urlToImage": "https://dims.apnews.com/dims4/default/17493a9/2147483647/strip/true/crop/5800x3263+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2Fee%2F5f5292f8886d0bd6b2df4df0581a%2F82f84c9cbec2453cbf13c93939a4635b"
    },
    {
      "author": "RYAN J. FOLEY",
      "description": "At least 29 recruits have died during basic training at law enforcement academies nationwide in the last decade. That's according to an AP investigation based on an extensive review of lists of law enforcement deaths in every state, workplace safety records and news reports. The investigation shows most died of exertion, dehydration, heat stroke and other conditions tied to intense exercise. Many deaths occurred on the first day of physical training. Others came weeks in, sometimes after drills or timed runs on hot days. Experts were surprised by AP’s findings and said many deaths were preventable. No federal agency or outside organization tracks recruit deaths, unlike those of officers. Black men comprised nearly 60% of the deaths, while just 12% of local police forces.",
      "publishedAt": "2025-02-18T09:05:04Z",
      "title": "Investigation: Dozens of police recruits have died while training to become officers",
      "url": "https://apnews.com/article/police-academy-recruits-deaths-investigation-sickle-cell-14362b1a86d648967645986cfb4529c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/6480d11/2147483647/strip/true/crop/1920x1080+0+99/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F14%2Ffd55c2284b47a8a106e85d2be713%2Fdying-to-serve-header2.jpg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "President Donald Trump is signing new executive orders while his first joint television interview with adviser Elon Musk airs in prime time. Trump's private club and home in Palm Beach, Florida, is also the setting Tuesday night for an awards program by a conservative group led by Mike Flynn, who served briefly as national security adviser in the Republican president's first term. Trump has been in Florida since Friday. The White House hasn't commented on the new executive orders Trump will sign at his Mar-a-Lago club and home. Trump has used previous executive orders to address issues including border security and transgender rights. Trump and Musk's interview is with Fox News Channel's Sean Hannity.",
      "publishedAt": "2025-02-18T16:17:28Z",
      "title": "Trump will sign new executive orders while his first joint TV interview with Musk airs in prime time",
      "url": "https://apnews.com/article/trump-executive-order-musk-hannity-143316eda581ac466cd923cdf4568d87",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb5cf87/2147483647/strip/true/crop/2613x1470+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe3%2Fb6f84db18540ad5515dc9530dcef%2F3431098aace84487b3ece39de6d0dfc0"
    },
    {
      "author": "SAMY MAGDY, NATALIE MELZER",
      "description": "A top Hamas leader in a surprise announcement says the militant group will release six living Israeli hostages on Saturday and the bodies of four hostages on Thursday. They will include the remains of the Bibas family, who for many Israelis have embodied the captives’ plight in Gaza. Kfir Bibas was 9 months old and the youngest hostage taken in Hamas’ Oct. 7, 2023, attack that triggered the war. Three living hostages had been expected to be freed on Saturday in the first phase of the current ceasefire. It is not immediately clear why Hamas changed the plan.",
      "publishedAt": "2025-02-18T13:21:25Z",
      "title": "Hamas says it will free 6 hostages and hand over bodies of Bibas mother and children before then",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-18-2025-873e5177fea96dbf569ca96980eed29c",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9f2a88/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F89%2F3ee52a3c87ec8c206aac47d7c039%2F8ca264427bc64204ba731da970e563a6"
    },
    {
      "author": "MICHAEL BIESECKER, SAM MEDNICK, GARANCE BURKE",
      "description": "U.S. tech giants have quietly empowered Israel to track and kill many more alleged militants more quickly in Gaza and Lebanon through a sharp spike in artificial intelligence and computing services. But as the number of civilians killed has also soared, so have fears that these tools are contributing to the deaths of innocent people. The Israeli military uses AI to sift through vast troves of intelligence, intercepted communications and surveillance to find suspicious speech or behavior and learn its enemies' movements. An Associated Press investigation found after the surprise attack by Hamas militants on Oct. 7, 2023, its use of Microsoft and OpenAI technology skyrocketed.",
      "publishedAt": "2025-02-18T12:06:02Z",
      "title": "As Israel uses US-made AI models in war, concerns arise about tech’s role in who lives and who dies",
      "url": "https://apnews.com/article/israel-palestinians-ai-technology-737bc17af7b03e98c29cec4e15d0f108",
      "urlToImage": "https://dims.apnews.com/dims4/default/a467ddf/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2Fae%2Faee560f26084376cd217c0cf14ac%2F077ccb5398dd41f6bb0e70a5ff014c98"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}