{
  "articles": [
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is hearing arguments in its first case stemming from the flurry of actions marking the start of President Donald Trump’s second term. Before the court Thursday are the Trump administration’s emergency appeals of lower court orders putting nationwide holds on the Republican president’s push to deny citizenship to children born to people who are in the U.S. illegally. Birthright citizenship is among several issues the administration has urgently asked the court to deal with, after lower courts acted to slow Trump’s agenda. The administration, like the Biden administration before it, complains judges are overreaching by issuing nationwide injunctions that apply to everyone instead of just the parties before the court.",
      "publishedAt": "2025-05-15T10:40:09Z",
      "title": "What to know about the Supreme Court arguments over birthright citizenship",
      "url": "https://apnews.com/article/immigration-supreme-court-birthright-citizenship-nationwide-injunctions-2c495cddc1436e21a9fa976d295dc292",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee92b39/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F6b%2F55a3f63410f5534ed4cb72f35b25%2F2469e2cdc3704cb18ed25331aec37954"
    },
    {
      "author": "Lolita Baldor",
      "description": "Defense officials say military commanders will be told to identify troops in their units who are transgender or have gender dysphoria, then send them to medical checks in order to force them out of the service. A senior defense official laid out Thursday what could be a complicated and lengthy new process aimed at fulfilling President Donald Trump’s directive to remove all transgender service members from the U.S. military. The new order to commanders relies on routine annual health checks that service members are required to undergo. It scraps, for now, plans to go through troops’ health records to identify those with gender dysphoria. Instead, transgender troops who don’t voluntarily come forward could be outed by commanders or others.",
      "publishedAt": "2025-05-15T22:26:14Z",
      "title": "Military commanders will be told to send transgender troops to medical checks to oust them",
      "url": "https://apnews.com/article/transgender-ban-military-discharge-troops-0218f0b6fec595c420bd0ac072d87335",
      "urlToImage": "https://dims.apnews.com/dims4/default/8986ca1/2147483647/strip/true/crop/6298x3543+0+328/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Fb7%2Fa784d823e5b5f89a4c26e172a780%2F98c345a55f0942ed97c6b3a8d1d87af3"
    },
    {
      "author": "Zeke Miller, Aamer Madhani",
      "description": "U.S. President Donald Trump has left Qatar for the United Arab Emirates on the final leg of his Middle East tour. Trump will visit the country’s largest mosque, where the country's founder is buried in a courtyard. Trump also will be hosted for a state visit by the UAE's president at a palace. Trump wrapped up his visit to Qatar by stopping at a U.S. installation Thursday, telling troops his “priority is to end conflicts.” Earlier in the day, Trump said he wasn't surprised Russian President Vladimir Putin will be a no-show for anticipated peace talks with Ukraine in Turkey. Earlier this week, Trump met with Syria’s president and announced plans to ease sanctions on the war-torn country.",
      "publishedAt": "2025-05-15T04:02:17Z",
      "title": "Trump will visit US troops in Qatar during Middle East tour",
      "url": "https://apnews.com/article/trump-qatar-syria-aludeid-air-base-9c868799582685b3a115c6f0c243d606",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1e4cdc/2147483647/strip/true/crop/3639x2047+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F87%2F977425b8fdf10152ee6e528b1b9f%2Fa766ae442522424fbcd4b464315650e7"
    },
    {
      "author": "Mohammad Jahjouh, Tia Goldenberg",
      "description": "A hospital in southern Gaza says 54 people have been killed in overnight airstrikes on the city of Khan Younis. An Associated Press cameraman counted 10 airstrikes on the city overnight into Thursday and saw numerous bodies taken to the morgue in Nasser Hospital. Some bodies arrived in pieces, with some body bags containing the remains of multiple people. The hospital’s morgue confirmed 54 people had been killed. The strikes come as U.S. President Donald Trump visits the Middle East, visiting Gulf states but not Israel. There had been hope that Trump’s regional visit could usher in a ceasefire or renewal of humanitarian aid to Gaza. An Israeli blockade of the territory is now in its third month.",
      "publishedAt": "2025-05-15T06:43:42Z",
      "title": "54 people killed in overnight airstrikes on southern Gaza city, hospital says",
      "url": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-05-15-2025-b32d055195ffec2b349a0948582c68e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/28db1cd/2147483647/strip/true/crop/6886x3873+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F9d%2F7e2901282351a444195d5008cb28%2Fe174e34502a344e4a5be151e05fe3585"
    },
    {
      "author": "Mehmet Guzel",
      "description": "Russian officials say Russia’s delegation has arrived in Istanbul for peace talks with Ukraine. However, President Vladimir Putin was not part of the delegation, according to a list released by the Kremlin Wednesday night, prompting criticism from Western officials that Moscow isn’t serious about the peace effort. Earlier this week, Ukraine’s President Volodymyr Zelenskyy challenged the Russian leader to meet in person in Turkey. Earlier this week, Ukrainian President Volodymyr Zelenskyy challenged the Russian leader to meet in person in Turkey. Ukraine’s presidential adviser, Mykhailo Podolyak, said Zelenskyy will sit at the table only with Putin.",
      "publishedAt": "2025-05-15T07:55:07Z",
      "title": "A Russian delegation has arrived in Istanbul for Ukraine talks. It doesn't include Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-istanbul-talks-zelenskyy-putin-05795eea960b9035f93a143c3e177c3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b85eaa7/2147483647/strip/true/crop/2955x1662+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fff%2F322926c1aa03f855d06788296976%2F681b2f6ad2704ee79556d44b68b9303b"
    },
    {
      "author": "Jeff Amy, Geoff Mulvihill",
      "description": "A hospital is using a breathing tube and other measures to keep a brain-dead Georgia woman's body functioning because she is pregnant. Her family says it should have the option to stop the life-support devices but that they've been told state law removes that choice. Georgia bars abortion in most cases after cardiac activity can be detected, which is usually around six weeks into pregnancy. One expert says whether states can force measures to preserve the life of a fetus are murky in the aftermath of the 2022 Supreme Court decision that overturned Roe v. Wade and opened the door to state abortion bans.",
      "publishedAt": "2025-05-15T17:47:00Z",
      "title": "Georgia's anti-abortion law keeps brain-dead pregnant woman Adriana Smith on life support",
      "url": "https://apnews.com/article/pregnant-woman-brain-dead-abortion-ban-georgia-a85a5906e5b2c4889525f2300c441745",
      "urlToImage": "https://dims.apnews.com/dims4/default/21cb809/2147483647/strip/true/crop/2738x1540+0+142/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F58%2F4992c943ca931601e23a914a9f60%2F8b347f52b5b9483cb2c1200e8c585a0d"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Lawyers for Sean “Diddy” Combs say they’ll be questioning R&B singer Cassie about how infidelity fueled her combustible, nearly 11-year relationship with the music mogul, who is on trial for sex trafficking. The defense cross-examination of the prosecution's star witness will begin Thursday in a Manhattan courtroom. It'll be Cassie's third day on the witness stand after having testified that Combs raped her when she broke up with him in 2018. She also said Combs locked her into a life of physical abuse by threatening to release degrading sexual videos of her. Combs denies the allegations. He faces at least 15 years in prison if convicted.",
      "publishedAt": "2025-05-15T13:30:02Z",
      "title": "Sean 'Diddy' Combs' lawyers plan to press Cassie about infidelity during cross-examination",
      "url": "https://apnews.com/article/diddy-trial-sex-trafficking-cassie-testimony-69c7a6ad766103e39c4f7f35df841205",
      "urlToImage": "https://dims.apnews.com/dims4/default/deb7c37/2147483647/strip/true/crop/3872x2178+0+11/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc7%2Fa896760638f8637dd3703d090966%2Ffde0b54fcc7147ad88d825532de42341"
    },
    {
      "author": "Todd Richmond",
      "description": "A Wisconsin judge accused of helping a man evade federal immigration agents has pleaded not guilty to federal charges. Milwaukee County Circuit Judge Hannah Dugan entered the plea during an arraignment Thursday in federal court. She and her lawyers left after the brief hearing without talking to reporters. Dugan is charged with obstruction and concealing an individual to prevent arrest. According to an FBI affidavit, Dugan showed a man out the back door of her courtroom last month after learning immigration agents were in the courthouse looking to arrest him for being in the country illegally. The case has escalated a clash between Trump administration and Democrats over the president’s sweeping immigration crackdown.",
      "publishedAt": "2025-05-15T04:01:41Z",
      "title": "Wisconsin judge pleads not guilty to helping a man evade federal immigration agents",
      "url": "https://apnews.com/article/dugan-wisconsin-judge-arrested-trump-immigration-plea-ba8ef8e5cc1d0f66d4319e4f36f08766",
      "urlToImage": "https://dims.apnews.com/dims4/default/9326b3a/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fb4%2F47d08704ebafbc5d08e654a052d1%2F2d83c10c042d4d4e995b0eaf9a08ddf1"
    },
    {
      "author": "Brian Witte, Lea Skene",
      "description": "An audit of Maryland autopsies has uncovered at least 36 in-custody police deaths that should have been considered homicides. State officials announced their findings Thursday following a comprehensive review of such cases spurred by widespread concerns about the former state medical examiner’s testimony in the death of George Floyd. Investigators focused on 87 autopsies performed during the tenure of Dr. David Fowler. Fowler testified for the defense at the 2021 murder trial of former Minneapolis police Officer Derek Chauvin. Fowler had backed the widely rejected theory that attributed Floyd’s death to a sudden heart rhythm disturbance as a result of his heart disease.",
      "publishedAt": "2025-05-15T17:57:04Z",
      "title": "Autopsies misclassified in-custody deaths that were actually homicides, Maryland officials say",
      "url": "https://apnews.com/article/david-fowler-maryland-autopsy-homicides-george-floyd-71e52a4cd2cc4103eab9648a127f1835",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f5ebb1/2147483647/strip/true/crop/2102x1182+0+6/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F88%2Fa4cdaddcdf1c94b52eb614c0efbf%2Ff312398bf16242199b9a0b769c087235"
    },
    {
      "author": "Andrew Dalton",
      "description": "The Los Angeles County Sheriff’s Department says it has opened a criminal investigation into rape and sexual assault allegations against Smokey Robinson. The department confirmed the investigation in a statement Thursday. Last week, four former housekeepers of Robinson filed a lawsuit alleging that the Motown music luminary repeatedly sexually assaulted and raped them while they worked for him. Robinson's lawyer didn't immediately respond to a request for comment, but he previously called the allegations “vile” and “false.” The women's attorneys say they are pleased law enforcement is looking into the matter and their clients will fully cooperate.",
      "publishedAt": "2025-05-15T22:24:21Z",
      "title": "Criminal investigation opened in rape and sexual assault allegations against Smokey Robinson",
      "url": "https://apnews.com/article/smokey-robinson-sexual-misconduct-investigation-la-72bebfd2659f2c8b324557395ceb37bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb3fe34/2147483647/strip/true/crop/5380x3026+0+338/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Fa5%2F2975f3e5f647be0fea73812a9cf5%2F90ce2019aac1452292b475498744ecab"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}