{
  "articles": [
    {
      "author": "DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — The man identified as a person of interest in a mass killing in Maine is a firearms instructor trained by the military and was recently committed to a mental health facility, according to a state police bulletin.",
      "publishedAt": "2023-10-26T00:24:51Z",
      "title": "Firearms instructor treated at mental health facility is person of interest in Maine shooting: cops",
      "url": "https://apnews.com/49da6d06a8b5a15d3b619b3927bc33ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34d4f15910be4a029b16d6a1e456cc03/2000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union said Wednesday it has reached a tentative contract agreement with Ford that could be a breakthrough toward ending the nearly 6-week-old strikes against Detroit automakers.",
      "publishedAt": "2023-10-25T17:24:17Z",
      "title": "Autoworkers reach a deal with Ford, a breakthrough toward ending strikes against Detroit automakers",
      "url": "https://apnews.com/08a81503d72e44d4efa40549f684d5a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b36d130cce04d7096f85c64efc63152/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES, FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republicans unanimously elected Rep. Mike Johnson as House speaker on Wednesday, eagerly elevating a deeply conservative but lesser-known leader to the major seat of U.S.",
      "publishedAt": "2023-10-25T04:14:30Z",
      "title": "Mike Johnson, a staunch Louisiana conservative, is elected House speaker as GOP moves past chaos",
      "url": "https://apnews.com/54352a64be041cd445bda8df28b24f03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b83db651a1f34e34a33ed2f6c57d6b5f/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — The U.N. warned Wednesday that it is on the verge of running out of fuel in the Gaza Strip, forcing it to sharply curtail relief efforts in the territory blockaded and devastated by Israeli airstrikes since Hamas militants launched an attack on Israel more than two weeks ago.",
      "publishedAt": "2023-10-25T09:03:53Z",
      "title": "UN warns Gaza blockade could force it to sharply cut relief missions as Israeli bombings rise",
      "url": "https://apnews.com/94db5fa6029977f302cf2af57349badc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/017460449b1b4626bf112874bae9b9a8/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump was abruptly called to the witness stand and then fined $10,000 on Wednesday after the judge in his civil fraud trial said the former president had violated a gag order.",
      "publishedAt": "2023-10-25T13:45:54Z",
      "title": "Trump is fined $10,000 over a comment he made outside court in his New York civil fraud trial",
      "url": "https://apnews.com/7f6e536e97d77ef1cd441e4d5ec41ee4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b620e984f49e59f57a59d8024cf50/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — The White House turned down the pizazz for Wednesday's state dinner, but more than 300 guests from politics, business, government and beyond turned out to celebrate close U.S. ties to ally Australia while striking a measured tone in a time of death and suffering in the Middle East.",
      "publishedAt": "2023-10-25T19:45:52Z",
      "title": "White House throws lavish state dinner for Australia but turns down pizazz a notch in time of war",
      "url": "https://apnews.com/c142f6a5a246a9035a65e7400d8aa1db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfb12388f2e54d448594306f7516532f/1920.jpeg"
    },
    {
      "author": "MARK STEVENSON and MARÍA VERZA",
      "description": "ACAPULCO, Mexico (AP) — Hurricane Otis tore across Mexico’s southern Pacific coast as a powerful and dangerous Category 5 hurricane Wednesday, unleashing massive flooding in the resort city of Acapulco and setting off looting as desperate relatives tired of waiting for help to arrive.",
      "publishedAt": "2023-10-25T06:56:27Z",
      "title": "Hurricane Otis unleashes massive flooding in Acapulco, triggers landslides before dissipating",
      "url": "https://apnews.com/8daa7fcfa6d538ae2ca672fe54a31519",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01d554b4a91540e4ae826d793c1a6f92/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER",
      "description": "LOS ANGELES (AP) — The 22-year-old driver of a BMW that struck and killed four Pepperdine University students in Malibu, California, last week pleaded not guilty Wednesday to four counts of murder, and prosecutors said he was speeding at more than 100 mph moments before the crash.",
      "publishedAt": "2023-10-25T14:43:36Z",
      "title": "Driver in Malibu crash that killed 4 college students pleads not guilty to murder, held on $4M bail",
      "url": "https://apnews.com/80cfb5a0328b82e9c345fd6bc9627702",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/806e76fa59444b058e0b8b8351ce878f/3000.jpeg"
    },
    {
      "author": "JASON DEAREN and MICHELLE R. SMITH",
      "description": "People convicted of crimes related to domestic extremism face far shorter prison terms than those convicted in international terrorism cases, even when the crimes are similar, a new report on the outcomes of hundreds of federal criminal cases has found.",
      "publishedAt": "2023-10-25T11:00:46Z",
      "title": "International terror defendants face longer prison terms than domestic counterparts, new study finds",
      "url": "https://apnews.com/0ef19a71d3d75a1d663704ede7dfc0ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c34060403edb44eb934c3a89414b4026/3000.jpeg"
    },
    {
      "author": "RAUL DOMINGUEZ",
      "description": "SAN ANTONIO (AP) — The Victor Wembanyama era is underway in San Antonio.Wembanyama made his NBA debut with the Spurs against the Dallas Mavericks on Wednesday night and made an immediate splash.",
      "publishedAt": "2023-10-26T01:27:47Z",
      "title": "No. 1 pick Victor Wembanyama debuts with the Spurs and the world is watching",
      "url": "https://apnews.com/a0d4aa8851311110a55b59da9eb84023",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff9a0bf359294b349fb50cbf27b9fd00/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}