{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "The Justice Department has asked a federal judge overseeing the criminal case against former President Donald Trump in Washington to step in after he released a post online that appeared to promise revenge on anyone who goes after him.",
      "publishedAt": "2023-08-05T02:59:03Z",
      "title": "Prosecutors ask judge to issue protective order after Trump post appearing to promise revenge",
      "url": "https://apnews.com/71cd642e876c47fff4e1283c15f8ca01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7955bd9fa14f9d84d6d7d56691e48d/2915.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "HOFFMAN ESTATES, Ill. (AP) — Simone Biles spent two years trying to distance herself from those strange days in Tokyo and all the outside noise that came along with it.She dove into theory and slowly — very slowly — returned to training even though she wavered on whether she was really up for a third Olympics and all of the pressure and expectations that come with it when you're considered the greatest of all time.",
      "publishedAt": "2023-08-06T02:16:18Z",
      "title": "Simone Biles dazzles in her return from a 2-year layoff to dominate the US Classic",
      "url": "https://apnews.com/9c6588cef944f4371ee84e0d91258b4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe353deb84e5459199048e4949e625a4/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Monica Lee sat outside her parents' home, where a former Mississippi sheriff’s deputy pummeled her son, who died hours later in the hospital.It was a sweltering afternoon in Braxton — the same town where, in a separate episode, six white law enforcement officers tortured two other Black men in January, shaking seasoned federal prosecutors, elected officials and ordinary people to their core.",
      "publishedAt": "2023-08-06T04:03:18Z",
      "title": "Racist abuse by Mississippi officers reveals a culture of misconduct, residents say",
      "url": "https://apnews.com/1feb54483e62bef53efe1a1a16be29f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63885d539f6b41f3a630dd30bd538bd2/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Moscow promised retaliation Saturday after Ukrainian drones hit a Russian tanker in the Black Sea near Crimea late Friday, the second sea attack involving drones in one day. Ukraine struck a major Russian port earlier on Friday.",
      "publishedAt": "2023-08-05T09:14:02Z",
      "title": "Russia promises retaliation after Ukrainian drones hit a Russian tanker in 2nd sea attack in a day",
      "url": "https://apnews.com/d6ab9c0d71fe9d3d95e1af5953fe8d8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e6f8e1e2dc74835bc1d3caa8e6f18de/2762.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un toured the country’s key weapons factories, including those producing artillery systems and launch vehicles for nuclear-capable ballistic missiles, and pledged to speed up efforts to advance his military’s arms and war readiness, state media said Sunday.",
      "publishedAt": "2023-08-06T02:07:47Z",
      "title": "North Korean leader Kim tours weapons factories and vows to boost war readiness in face of tensions",
      "url": "https://apnews.com/9410ff2f85dd59db5a0b5f85916eadba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98f9e17e36844e49aab03daebc2dcf6e/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Police have arrested a 17-year-old high school student on a hate-motivated murder charge in the fatal stabbing of a professional dancer during an altercation between two groups of friends at a New York City gas station last weekend.",
      "publishedAt": "2023-08-05T19:42:25Z",
      "title": "New York City high school student charged with hate-motivated murder in killing of gay dancer",
      "url": "https://apnews.com/e180c63cf44ba1036141e5d30b1f5969",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e73ee54a164146e68ab082557bf4da63/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — The Philippine military condemned on Sunday a Chinese coast guard ship's “excessive and offensive” use of a water cannon to block a Filipino supply boat from delivering new troops, food, water and fuel to a Philippine-occupied shoal in the disputed South China Sea.",
      "publishedAt": "2023-08-06T04:11:02Z",
      "title": "Philippine military condemns Chinese coast guard's use of water cannon on its boat in disputed sea",
      "url": "https://apnews.com/bdfd261518a34a5d86f50efd0f2228d8",
      "urlToImage": ""
    },
    {
      "author": "NICOLE WINFIELD, BARRY HATTON and PIETRO DE CRISTOFARO",
      "description": "LISBON, Portugal (AP) — An estimated 1.5 million young people filled a field in the Portuguese capital Lisbon on Saturday for Pope Francis’ World Youth Day vigil, braving scorching heat to secure a spot for the evening prayer and to camp out overnight for his final farewell Mass on Sunday morning.",
      "publishedAt": "2023-08-05T08:01:15Z",
      "title": "Pilgrims brave scorching heat for pope's vigil in Lisbon after Francis ditches Fatima peace prayer",
      "url": "https://apnews.com/5154121a45ae768b21f4e8555b72d9e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a46090dd3e9845c99fbd7e83e0296887/2642.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Pakistan’s former Prime Minister Imran Khan was arrested Saturday after a court handed him a three-year jail sentence for corruption, a development that could end his future in politics.",
      "publishedAt": "2023-08-05T08:20:28Z",
      "title": "Pakistan's former Prime Minister Imran Khan handed 3-year sentence and moved to high-security prison",
      "url": "https://apnews.com/e44842d4880c581ee093ff680a9a09d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5f8a7482124c2b9e4e26405d71a9bf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}