{
  "articles": [
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Mexico’s Supreme Court decriminalizes abortion nationwide.",
      "publishedAt": "2023-09-06T20:07:38Z",
      "title": "Mexico’s Supreme Court decriminalizes abortion nationwide",
      "url": "https://apnews.com/83bef69c290538586848a22a55d04750",
      "urlToImage": ""
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — A liberal group on Wednesday filed a lawsuit to bar former President Donald Trump from the primary ballot in Colorado, arguing he is ineligible to run for the White House again under a rarely used clause in the U.S.",
      "publishedAt": "2023-09-06T16:28:22Z",
      "title": "Lawsuit contends Constitution's 'insurrection' clause bars Trump from running again for president",
      "url": "https://apnews.com/19ca3f17881e8818302cb1260e7c2aed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5484c4bba4bc43cb978d5dbefd0353da/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Federal prosecutors plan to ask a grand jury to indict President Joe Biden’s son Hunter by the end of the month, according to court documents filed Wednesday.The exact charges the president’s son would face were not immediately clear, but appeared related to a gun possession charge in which he was accused of having a firearm while being a drug user.",
      "publishedAt": "2023-09-06T20:00:36Z",
      "title": "Prosecutors seeking new indictment for Hunter Biden before end of September",
      "url": "https://apnews.com/1dc4471d64475e1c1f617238f6e0e5ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acd81aedc754c7592c2b3bfe3f16ab8/2344.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Mexico’s Supreme Court decriminalized abortion nationwide Wednesday, two years after ruling that abortion was not a crime in one northern state.That earlier ruling had set off a grinding process of decriminalizing abortion state by state.",
      "publishedAt": "2023-09-06T20:11:16Z",
      "title": "Mexico’s Supreme Court decriminalizes abortion nationwide",
      "url": "https://apnews.com/d87f6edbdf68c2e6c8f5700b3afd15de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a25134fcd80f43bdad6f128e5a791e6f/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A Russian missile tore through an outdoor market in eastern Ukraine on Wednesday, killing 17 people and wounding dozens, as U.S. Secretary of State Antony Blinken returned to the country with more than $1 billion in new American funding for Ukraine, including military and humanitarian aid.",
      "publishedAt": "2023-09-06T08:23:49Z",
      "title": "Russian missile strike on Ukrainian market kills 17 as Blinken announces new $1B aid package",
      "url": "https://apnews.com/92b9ff2b9328f40516a4e47864d446e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0919c137d15f42828b4e8c96fa197183/1920.jpeg"
    },
    {
      "author": "ED KOMENDA",
      "description": "SEATTLE (AP) — A high school football coach in Washington state who won his job back after the U.S. Supreme Court ruled he could pray on the field resigned Wednesday after just one game back.",
      "publishedAt": "2023-09-06T19:34:29Z",
      "title": "A football coach who got job back after Supreme Court ruled he could pray on the field has resigned",
      "url": "https://apnews.com/461b92b19ea395677657518914825573",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebaecf22de5a4c19b8f11941390f4662/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia election subversion case involving former President Donald Trump on Wednesday denied requests by two of the 19 defendants to be tried alone, instead saying the pair would be tried together starting next month.",
      "publishedAt": "2023-09-06T17:55:06Z",
      "title": "Georgia judge rules that Sidney Powell and Kenneth Chesebro can be tried together starting Oct. 23",
      "url": "https://apnews.com/9221ddaed203695015ddd5615337fb4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9574033d3e2e47609b0d66265c5edb9c/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Four months after a civil trial jury found that Donald Trump sexually abused and defamed advice columnist E.",
      "publishedAt": "2023-09-06T15:17:12Z",
      "title": "The writer who won a sex abuse and defamation lawsuit against Trump scores another victory",
      "url": "https://apnews.com/723b36258af48395b677bd5136668673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbd9fd860a044eae99e6f3c1c36bf05f/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CHARLOTTE, N.C. (AP) — Republican presidential hopeful Chris Christie says Florida Gov. Ron DeSantis had put “politics ahead of his job” by declining to meet with President Joe Biden during the Democrat's weekend visit to survey Hurricane Idalia's damage in DeSantis' state.",
      "publishedAt": "2023-09-06T15:43:22Z",
      "title": "Christie says DeSantis put 'politics ahead of his job' by not seeing Biden during hurricane visit",
      "url": "https://apnews.com/069ea88ffca4523cda8f439776f57418",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ca7b22f50f943d6970e9ef9d69a6aec/3000.jpeg"
    },
    {
      "author": "JAKE BLEIBERG and PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — An extramarital affair Texas Attorney General Ken Paxton had with a donor's employee helped connect the dots about why the Republican was using his power in ways that are now at the center of his impeachment trial on accusations of corruption, a former top aide testified Wednesday.",
      "publishedAt": "2023-09-06T04:46:57Z",
      "title": "Texas AG Ken Paxton's affair explains his illegal acts, former aide testifies at impeachment trial",
      "url": "https://apnews.com/519956746ed2d3e4a121e70190fd4b3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41ff03f1e6d44757a1466359a9945fc4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}