{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden has a fresh opportunity Thursday to try to prove to the American public that he’s capable of serving another four years after his shocking debate flop threw the future of his presidency into doubt.",
      "publishedAt": "2024-07-11T04:21:32Z",
      "title": "Biden's press conference will be a key test for him. But he's no master of the big rhetorical moment",
      "url": "https://apnews.com/f213c40509e35ed485ed3c57277ee911",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6acb81a93f6d4df9a794c7ff80d0d887/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ISABELLA VOLMERT, MARC LEVY and JONATHAN J. COOPER",
      "description": "SAGINAW, Mich. (AP) — Considering her choices in this year’s rapidly approaching presidential election, Rochelle Jones thinks both major party candidates should step aside.",
      "publishedAt": "2024-07-11T04:12:25Z",
      "title": "Biden says pressure on him is driven by elites. Voters paint a more complicated picture",
      "url": "https://apnews.com/c694cae7a3d6a7ce688b4a49d1fbcc82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a591543cd982454880c8689962a3e2e4/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As he prepares to accept the Republican nomination for the third time, Donald Trump has promised new efforts to expand his coalition — and, in particular, to win over more of the nonwhite voters who largely rejected him during the 2020 election.",
      "publishedAt": "2024-07-11T04:04:13Z",
      "title": "Trump wants Black and Latino support. But he's not popular with either group, poll analysis shows",
      "url": "https://apnews.com/59acadcda6cf9cb1082d4bdd9d4c4a81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de49e814afa4dcc9c0112eb26921926/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Prosecutors sought to cast Alec Baldwin as someone who flouts rules and has little regard for safety at the first day of his New Mexico trial in the shooting of a cinematographer.",
      "publishedAt": "2024-07-11T04:02:53Z",
      "title": "Gun and ammunition evidence is the focus as Alec Baldwin trial starts second day",
      "url": "https://apnews.com/86e4265a0c4d8e130b02a1289ae99520",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62a517d6fd3e45b9b64698b1593caf72/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The House on Thursday rejected a GOP effort to fine Attorney General Merrick Garland $10,000 a day until he turns over audio of President Joe Biden’s interview in his classified documents case as a handful of Republicans resisted taking an aggressive step against a sitting Cabinet official.",
      "publishedAt": "2024-07-11T16:28:18Z",
      "title": "House rejects GOP effort to fine Attorney General Garland for refusal to turn over Biden audio",
      "url": "https://apnews.com/dfeedd79750484b7418e70de8b1e28d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54b607ddb2b64b5c9d5b78cd3573d399/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An oil tanker held by Iran for over a year after being seized amid tensions between Tehran and the United States reached international waters on Thursday, tracking data showed.",
      "publishedAt": "2024-07-11T10:50:27Z",
      "title": "Oil tanker held by Iran for over a year heads reaches international waters, tracking data shows",
      "url": "https://apnews.com/dd5f39e2af24df831a2d00d0ec327e48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79338874762343228dd32ee006865d78/3000.jpeg"
    },
    {
      "author": "JUAN LOZANO and NADIA LATHAN",
      "description": "HOUSTON (AP) — About 500,000 customers still won’t have electricity into next week as wide outages from Hurricane Beryl persist and frustration mounts over the pace of restoration, an official with Houston’s biggest power utility said Thursday.",
      "publishedAt": "2024-07-11T15:52:25Z",
      "title": "Houston utility says 500K customers still won't have electricity next week as Beryl outages persist",
      "url": "https://apnews.com/7f624c7e14f41284449009295e69ac12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/950ebb862dc1462bb06f541cab8187d9/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "NORTH CHARLESTON, S.C. (AP) — Shalom Koray never knew his real name or his birthday. He was saved from the streets of a burning Warsaw neighborhood while he was a toddler during World War II, when the rest of his family was killed by Nazis in Poland.",
      "publishedAt": "2024-07-11T16:47:12Z",
      "title": "He was orphaned in the Holocaust and never met any family. Now he has cousins, thanks to DNA tests",
      "url": "https://apnews.com/7b00af200ff75b745b25396e14f98f8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49708a8178b448378fb386e7d04b22e7/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "GRAFTON, Mass. (AP) — When two octogenarian buddies named Nick discovered that ChatGPT might be stealing and repurposing a lifetime of their work, they tapped a son-in-law to sue the companies behind the artificial intelligence chatbot.",
      "publishedAt": "2024-07-11T15:56:42Z",
      "title": "Two 80-something journalists tried ChatGPT. Then, they sued to protect the 'written word'",
      "url": "https://apnews.com/9e92d20327c63460209279c1c2e38238",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42c1cc68fd484f17994ee5ffa6f998e9/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "LONDON (AP) — Jasmine Paolini kept coming back, kept coming back, kept coming back, against Donna Vekic in what would become the longest Wimbledon women's semifinal on record — after dropping the opening set, after being two games from defeat in each of the last two sets, after twice trailing by a break in the third.",
      "publishedAt": "2024-07-11T15:34:19Z",
      "title": "Jasmine Paolini wins Wimbledon's longest women's semifinal to reach a second Grand Slam title match",
      "url": "https://apnews.com/b805a32c483f43af841c7467c1ab9587",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fabae5418c44546ac7092c59d874ccf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}