{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Vermont Sen. Peter Welch calls on Biden to withdraw from November election, becoming the first Senate Democrat to do so.",
      "publishedAt": "2024-07-10T23:24:28Z",
      "title": "Vermont Sen. Peter Welch calls on Biden to withdraw from November election, becoming the first Senate Democrat to do so",
      "url": "https://apnews.com/6ff8c7cfa2525c7e7e5547111444c271",
      "urlToImage": ""
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He’s calling in to his favorite morning cable news show, bashing the “elites” of his party and dismissing unfavorable polls. He’s even talking up his crowd sizes.As an increasingly defiant President Joe Biden rejects calls to step aside after a disastrous debate performance, he’s been embracing some of the tactics used by a man he calls a mortal threat to democracy: his rival, former President Donald Trump.",
      "publishedAt": "2024-07-10T16:51:14Z",
      "title": "A defiant Biden borrows some tactics from his rival as he tries to put debate debacle behind him",
      "url": "https://apnews.com/5132abffb5de5166a26423d9fdba050b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26bccdf42b854163bc8a2ce81cd5f960/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — President Joe Biden's imperiled re-election campaign hit new trouble Wednesday as House Speaker Emerita Nancy Pelosi said merely “it's up to the president to decide” if he should stay in the race, celebrity donor George Clooney said he should not run and Democratic senators and lawmakers expressed fresh fear about his ability to beat Republican Donald Trump.",
      "publishedAt": "2024-07-10T13:45:10Z",
      "title": "Biden's candidacy faces new peril as Pelosi, Clooney and more Democrats weigh in",
      "url": "https://apnews.com/333c0774dec4de05c32c353255b5f627",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8281706a5d34f4284862e04b7226f2d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military urged all Palestinians to leave Gaza City and head south Wednesday, pressing ahead with a fresh offensive across the north, south and center of the embattled territory that has killed dozens of people over the past 48 hours.",
      "publishedAt": "2024-07-10T08:56:10Z",
      "title": "Israeli military orders the evacuation of Gaza City, an early target of its war with Hamas",
      "url": "https://apnews.com/6358a61735f0e30132decce781860594",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909da4d733af4aa89c788522fc1a574e/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS and JOE REEDY",
      "description": "The NBA has agreed to terms on its new media deal, a record 11-year agreement worth $76 billion that assures player salaries will continue rising for the foreseeable future and one that will surely change how some viewers access the game for years to come.",
      "publishedAt": "2024-07-10T21:43:49Z",
      "title": "NBA agrees to terms on a record 11-year, $76 billion media rights deal, AP source says",
      "url": "https://apnews.com/07d021c1248bedfe547885a54f0b3f32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e0a5658f8ad4856a162b3bd04d72ea3/3000.jpeg"
    },
    {
      "author": "KEN RITTER and TY ONEIL",
      "description": "LAS VEGAS (AP) — Las Vegas baked Wednesday in its record fifth consecutive day of temperatures sizzling at 115 degrees Fahrenheit (46.1 Celsius) or greater amid a lengthening hot spell that is expected to broil much of the U.S.",
      "publishedAt": "2024-07-10T05:05:48Z",
      "title": "Las Vegas hits record of fifth consecutive day of 115 degrees or greater as heat wave scorches US",
      "url": "https://apnews.com/ed2009f3f4ad15b4ca96dc1aa0f5e1e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16fd7a402c1d4e84afa814c984646884/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — Pressure mounted Wednesday on Houston’s power utility as millions of residents still had no power nearly three days after Hurricane Beryl made landfall, stoking questions over how a city that is all too familiar with destructive weather was unable to better withstand a Category 1 storm.",
      "publishedAt": "2024-07-10T04:17:24Z",
      "title": "Pressure mounts on Houston power company to quickly restore service as city sweats after Beryl",
      "url": "https://apnews.com/ceb5fdc1db4d89d2376abb22bfd45d99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de4450792004f39922ede47733be81f/1920.jpeg"
    },
    {
      "author": "COREY WILLIAMS",
      "description": "Calls for justice in the death of a Black man who was pinned to the ground during a struggle with security guards at a Milwaukee hotel are growing as thousands of GOP supporters and protesters are expected to gather in the city for the Republican National Convention.",
      "publishedAt": "2024-07-10T18:37:54Z",
      "title": "Calls for justice grow in death of Black man outside Milwaukee hotel as GOP convention approaches",
      "url": "https://apnews.com/d26057cf34270deec725e956b21d6ad2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a95b743acd94b8b9cfeb6757b04941d/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — A defense attorney told jurors Wednesday that the shooting death of cinematographer Halyna Hutchins was an “unspeakable tragedy” but that “ Alec Baldwin committed no crime; he was an actor, acting.”",
      "publishedAt": "2024-07-10T05:03:04Z",
      "title": "Alec Baldwin's involuntary manslaughter trial starts with witnesses recalling chaotic set shooting",
      "url": "https://apnews.com/9f969f6e020028749f5c3f93c549b0d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c94d34e1714e4520b16759e2f128cff0/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "The Senate passed legislation Wednesday to overhaul oversight and bring greater transparency to the crisis-plagued federal Bureau of Prisons following reporting from The Associated Press that exposed systemic corruption in the federal prison system and increased congressional scrutiny.",
      "publishedAt": "2024-07-10T22:52:25Z",
      "title": "Congress OKs bill overhauling oversight of troubled federal Bureau of Prisons",
      "url": "https://apnews.com/a75ef934efd5d39bd5040deda1858391",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f4e4f1dcad64a75884473931185f708/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}