{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A New York judge ordered Donald Trump and his companies on Friday to pay $355 million in penalties, finding they engaged in a yearslong scheme to dupe banks and others with financial statements that inflated his wealth.",
      "publishedAt": "2024-02-16T05:19:12Z",
      "title": "Judge orders Trump and his companies to pay $355 million in New York civil fraud case",
      "url": "https://apnews.com/244024861f0df886543c157c9fc5b3e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0deebd7eefe546dbadb11014d690d4ae/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ, DASHA LITVINOVA and EMMA BURROWS",
      "description": "Alexei Navalny, who crusaded against official corruption and staged massive anti-Kremlin protests as President Vladimir Putin’s fiercest foe, died Friday in the Arctic penal colony where he was serving a 19-year sentence, Russia’s prison agency said.",
      "publishedAt": "2024-02-16T11:37:39Z",
      "title": "Alexei Navalny, galvanizing opposition leader and Putin’s fiercest foe, died in prison, Russia says",
      "url": "https://apnews.com/2d11644f7ae5332587b39150f1fd1738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dfb8702c63c49269b77fafcec73fdc5/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and EMMA BURROWS",
      "description": "TALLINN, Estonia (AP) — The attacks range from the exotic — poisoned by drinking polonium-laced tea or touching a deadly nerve agent — to the more mundane of getting shot at close range. Some take a fatal plunge from an open window.",
      "publishedAt": "2024-02-16T16:24:10Z",
      "title": "Nerve agents, poison and window falls. Kremlin foes have been attacked or killed over the years",
      "url": "https://apnews.com/958c2ed6b8d60ecc4f64092fc1f9ceb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c36b359ba82740e3bf4dd586f76e6d43/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK, ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "ATLANTA (AP) — Attorneys for the state of Georgia seeking to knock down misconduct allegations against Fani Willis called her father to the witness stand Friday to testify about his knowledge of her romantic relationship with the special prosecutor she hired to lead the state's election interference case against Donald Trump.",
      "publishedAt": "2024-02-16T05:20:41Z",
      "title": "Fani Willis case ensnared in legal arguments during testimony about romantic relationship timeline",
      "url": "https://apnews.com/f03734cfd3d27ba34fba4cbbba621355",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74da5313c2344325a3a9bfec0567ece5/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and BASSEM MROUE",
      "description": "TEL AVIV, Israel (AP) — Israel’s defense minister on Friday said Israel is “thoroughly planning” a military offensive in the southern Gaza city of Rafah, signaling determination to move ahead despite growing international concerns about the safety of hundreds of thousands of Palestinians seeking refuge there.",
      "publishedAt": "2024-02-16T08:30:59Z",
      "title": "Israel's defense chief says military 'thoroughly planning' offensive in crowded Gaza border town",
      "url": "https://apnews.com/21e09d731eb09f95bfea8e0ce3c0500c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f40a8fe019f498fbaf46e2607ea0211/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — West Virginia Sen. Joe Manchin announced on Friday that he is not running for president, saying he didn't want to be a “spoiler.”“I will not be seeking a third-party run,\" he said in a speech at West Virginia University.",
      "publishedAt": "2024-02-16T16:55:27Z",
      "title": "West Virginia Sen. Joe Manchin announces he won't run for president in 2024",
      "url": "https://apnews.com/8377c2c336b14c660807941fe943b3b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b538934f13344d7a6cbf0f00988f5ae/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and ALI SWENSON",
      "description": "Major technology companies signed a pact Friday to voluntarily adopt “reasonable precautions” to prevent artificial intelligence tools from being used to disrupt democratic elections around the world.",
      "publishedAt": "2024-02-16T17:19:42Z",
      "title": "Tech companies sign accord to combat AI-generated election trickery",
      "url": "https://apnews.com/c40924ffc68c94fac74fa994c520fc06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddccd9ab92734e40b2a700a5615239cc/2106.jpeg"
    },
    {
      "author": "AMY BETH HANSON and COLLEEN SLEVIN",
      "description": "DENVER (AP) — Colorado authorities issued an arrest warrant Friday for a former funeral home owner they say kept a deceased woman’s body in a hearse for two years at a home where police also found the cremated remains of at least 30 people.",
      "publishedAt": "2024-02-16T19:11:41Z",
      "title": "Woman's corpse and 30 cremated remains found after ex-funeral home owner gets evicted from house",
      "url": "https://apnews.com/096a064be06f7e86c58f8a06d275be0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d76b74820914cd5a0ad76ba5d93484a/3000.jpeg"
    },
    {
      "author": "SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — A former Ohio sheriff's deputy charged in the killing of a Black man remained free Friday, after a jury couldn't agree on a verdict and the judge twice declared a mistrial, ending tumultuous proceedings that saw four jurors dismissed.",
      "publishedAt": "2024-02-16T14:49:23Z",
      "title": "Judge declares a mistrial in a former Ohio deputy’s murder trial",
      "url": "https://apnews.com/a960d23327aebbb5b706cfef2905d252",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edbddc54c1a349bdb825a712e2c500ea/3000.jpeg"
    },
    {
      "author": "NICK INGRAM, SCOTT MCFETRIDGE and JIM SALTER",
      "description": "KANSAS CITY, Mo. (AP) — Two juveniles were charged with crimes connected to the mass shooting at the Kansas City Chiefs’ Super Bowl rally, authorities said Friday, as the city tries to recover in the aftermath of the violence.",
      "publishedAt": "2024-02-16T14:38:12Z",
      "title": "2 juveniles charged in mass shooting at the Kansas City Chiefs Super Bowl parade",
      "url": "https://apnews.com/278e2d3e2cfece1cbe958511e54127ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fe37f93397d48d195cc3f55a1102b7b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}