{
  "articles": [
    {
      "author": "ZEKE MILLER, JILL COLVIN and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump on Wednesday agreed to hold two campaign debates — the first on June 27 hosted by CNN and the second on Sept.",
      "publishedAt": "2024-05-15T12:19:25Z",
      "title": "Biden and Trump, trading barbs, agree to 2 presidential debates, in June and September",
      "url": "https://apnews.com/6b1d1dbb2ed61c7637041b23662d7da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fad05abb6274c609dc7f58274029c9c/3000.jpeg"
    },
    {
      "author": "BELA SZANDELSZKY and KAREL JANICEK",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — Slovakia’s populist Prime Minister Robert Fico was shot multiple times and gravely wounded Wednesday, but his deputy prime minister said he believed Fico would survive.",
      "publishedAt": "2024-05-15T13:08:10Z",
      "title": "Slovakia's populist prime minister shot in assassination attempt, shocking Europe before elections",
      "url": "https://apnews.com/bdaaf0bba01035a700145a67d871a482",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2170846a7304e279ccf39ff55256f2c/1920.jpeg"
    },
    {
      "author": "EMILY WANG FUJIYAMA and CHRIS BODEEN",
      "description": "BEIJING (AP) — Russia’s President Vladimir Putin landed Thursday in Beijing for a two-day state visit to China, in a show of unity between the authoritarian allies as Moscow presses forward with a new offensive in Ukraine.",
      "publishedAt": "2024-05-15T12:00:15Z",
      "title": "Russia's Putin arrives in China for state visit in a show of unity between the authoritarian allies",
      "url": "https://apnews.com/3212ef85d8318cf853f956173f3a682a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af15d996fa434e76a9b78d7293f23570/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN and KEVIN McGILL",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday ordered Louisiana to hold congressional elections in 2024 using a House map with a second mostly Black district, despite a lower-court ruling that called the map an illegal racial gerrymander.",
      "publishedAt": "2024-05-15T21:21:20Z",
      "title": "Supreme Court orders Louisiana to use congressional map with additional Black district in 2024 vote",
      "url": "https://apnews.com/201c1fa9e494ad0d88e4d9ed8328eae0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/531f21033fdc4c30a2bafcd67f1b1c9b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "A gag order. The House Speaker turning up outside court. Angry denouncements of the judge overseeing the case.",
      "publishedAt": "2024-05-15T13:30:34Z",
      "title": "The jurors in Trump's hush money trial are getting a front row seat to history -- most of the time",
      "url": "https://apnews.com/81cc67ee293065cb35ee66f3dec15f25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbbb48db796247e9af7b1cfe268a664f/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and ABBY SEWELL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Wednesday fended off criticism that he is not planning for a postwar reality in the Gaza Strip, saying it was impossible to prepare for any scenario in the embattled Palestinian enclave until Hamas is defeated.",
      "publishedAt": "2024-05-15T08:01:54Z",
      "title": "Netanyahu fends off criticism at home and abroad over his lack of a postwar plan for Gaza",
      "url": "https://apnews.com/e9696aa2da25e447219f2be0c1926b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28d7cc667e94e94ac97a7a460a90985/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The number of reported sexual assaults across the military decreased last year, and a confidential survey found a 19% drop in the number of service members who said they had experienced some type of unwanted sexual contact, according to new figures obtained by The Associated Press.",
      "publishedAt": "2024-05-15T20:49:09Z",
      "title": "Reported sex assaults in the US military have dropped. That reverses what had been a growing problem",
      "url": "https://apnews.com/336323b194a1de1dea25e2885fdcc396",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baac7425ff8f4981bb453075d78133b9/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and TERRY SPENCER",
      "description": "OCALA, Fla. (AP) — A man with a long record of dangerous driving told investigators he smoked marijuana oil and took prescription drugs hours before he sideswiped a bus, killing eight Mexican farmworkers and injuring dozens more, according to an arrest report unsealed Wednesday.",
      "publishedAt": "2024-05-15T04:20:07Z",
      "title": "Driver said he smoked pot oil, took medication before Florida crash that killed 8 Mexican workers",
      "url": "https://apnews.com/e0832b36b75d5cd9beb8080d12edae51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e423bb354aa47cbb46eb25986eb9475/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The number of U.S. fatal overdoses fell last year, according to Centers for Disease Control and Prevention data posted Wednesday.",
      "publishedAt": "2024-05-15T14:01:26Z",
      "title": "Fewer US overdose deaths were reported last year, but experts are still cautious",
      "url": "https://apnews.com/12e961d78cc0458e84a07e0b3f7d1bbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bcfd17422394417a2cdb24025ef86c0/3000.jpeg"
    },
    {
      "author": "WAYNE PARRY",
      "description": "OCEAN GROVE, N.J. (AP) — In this seaside community that calls itself “God's Square Mile at the Jersey Shore,” all the land is owned by a religious group that has for generations enforced an 11th Commandment: Thou shalt stay off the beach on Sunday morning.",
      "publishedAt": "2024-05-15T19:24:47Z",
      "title": "This, too, could pass: Christian group's rule keeping beaches closed on Sunday mornings may end",
      "url": "https://apnews.com/2b92cb93e7b3bda5495974dbbd46c0c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f81ed153ee4c248041aaad200f43d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}