{
  "articles": [
    {
      "author": "Lolita Baldor",
      "description": "Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and potentially a couple thousand civilians. The Associated Press obtained the planning documents, which are dated April 29 and 30. They represent the Army’s most recent blueprint for its long-planned 250th birthday festival on the National Mall and the newly added element — a large military parade that Trump has long wanted but is still being discussed. The slides don't include any price estimates. But it would likely cost tens of millions of dollars to put on an event of that size.",
      "publishedAt": "2025-05-01T23:14:55Z",
      "title": "Army plans for a potential parade on Trump's birthday call for 6,600 soldiers, AP learns",
      "url": "https://apnews.com/article/army-parade-trump-birthday-96bb9c8e9af1ef285c56fdc3d1ba4b35",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f68a6a/2147483647/strip/true/crop/3699x2081+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F76%2Fdab48fd28fc77f58b81ad9b735bb%2F6a84377e82cb492d8a5fe7ad61480f76"
    },
    {
      "author": "Matthew Lee, Farnoush Amiri",
      "description": "Secretary of State Marco Rubio has been thrown into two top national security roles at once after President Donald Trump appointed him to temporarily replace Mike Waltz as national security adviser. Just 100 days into his tenure as America’s top diplomat, the former Florida senator now becomes just the second person to hold both roles, following only the late Henry Kissinger. Rubio is a one-time Trump rival and hawkish conservative who the president derided as “Little Marco” during the 2016 presidential campaign. He's proven adept at aligning himself with Trump’s “America First” foreign policy positions and turning away from previously held priorities.",
      "publishedAt": "2025-05-02T04:07:31Z",
      "title": "Rubio takes on 2 top national security roles",
      "url": "https://apnews.com/article/rubio-trump-waltz-national-security-7d41d818fdade271879a4f3a55de12f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2ddedb/2147483647/strip/true/crop/4759x2677+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F7c%2F70c3af9e8050fac12c4bb96462f6%2Fb5f1e445036a472ab77898beda20870a"
    },
    {
      "author": "Dasha Litvinova",
      "description": "What’s emerged from the Washington-led effort to end the war in Ukraine suggests a deal that seems likely to be favorable to Russia. President Donald Trump has sharply rebuked Ukrainian President Volodymyr Zelenskyy, echoed Kremlin talking points, and indicated Kyiv would have to surrender territory and forego NATO membership. What’s more, he has engaged in a rapprochement with Moscow that was unthinkable months ago. More recently, Trump has offered mixed signals – social media posts that perhaps Russian President Vladimir Putin is stringing him along – and a deal has yet to materialize. While the optics so far have been in the Kremlin’s favor, no proposals that were put forth have been cemented.",
      "publishedAt": "2025-05-02T05:04:25Z",
      "title": "From the Kremlin to the Vatican, US talks on Ukraine yield mixed results so far for Moscow and Kyiv",
      "url": "https://apnews.com/article/russia-ukraine-trump-war-negotiations-a605f8b9ca0e0e9b00e2fddf8219d065",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea50556/2147483647/strip/true/crop/3048x1715+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F08%2Ffb67a2dd7ee539cbc92e9aeec13a%2F9bcaeb6ddd3945c9befa7ebf98fc411d"
    },
    {
      "author": null,
      "description": "Israel’s air force struck near Syria’s presidential palace early Friday hours after warning Syrian authorities not to march toward villages inhabited by members of a minority sect in southern Syria. The strike came after days of clashes between pro-Syrian government gunmen and fighters who belong to the Druze minority sect near the capital, Damascus. The clashes left dozens of people dead or wounded. The Israeli army said in a statement that fighter jets struck adjacent to the area of the Palace of President Hussein al-Sharaa in Damascus. It gave no further details. Pro-government Syrian media outlets said the strike hit close to the People’s Palace on a hill overlooking the city.",
      "publishedAt": "2025-05-02T02:16:10Z",
      "title": "Israeli military strikes near Syria's presidential palace after warning over sectarian attacks",
      "url": "https://apnews.com/article/syria-israel-damascus-palace-druze-eca1ecf0b649964a7ef8052cf350c800",
      "urlToImage": "https://dims.apnews.com/dims4/default/9fa8a04/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F17%2F8282dccf79ff1a10583772750347%2F408486abe33e464c83a52e26c93ab592"
    },
    {
      "author": "Tia Goldenberg",
      "description": "Israeli Prime Minister Benjamin Netanyahu has long been on a campaign against Iran's nuclear program and his opposition helped convince President Trump to withdraw from an Obama era deal meant to rein it in. But with Trump now leading negotiations with Iran, Netanyahu's cries have fallen silent. Netanyahu and his nationalist supporters hoped Trump’s ascent to the White House would be advantageous because of Trump’s history of support for Israel. They thought they might find in him long elusive U.S. backing for a strike on Iranian nuclear facilities. But Trump’s approach to Iran has shown the relationship is more complicated.",
      "publishedAt": "2025-05-02T05:02:51Z",
      "title": "Netanyahu's campaign against Iran's nuclear program is muted with Trump in power",
      "url": "https://apnews.com/article/trump-iran-nuclear-talks-netanyahu-israel-1d11a692c56343e63728ad6b85aadbc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/280c4f0/2147483647/strip/true/crop/3744x2106+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F10%2F37d542911082254c5b170335454b%2F6fa6393b73734a238f96dc811a1271df"
    },
    {
      "author": "Sam Mednick, Renata Brito",
      "description": "A drone struck a vessel carrying aid to Gaza on Friday off the coast of Malta, said a statement by Codepink, a grassroots peace and social justice movement. The vessel belonging to the Gaza Freedom Flotilla was trying to get food and supplies to people in Gaza, said the statement. Malta’s government said 12 crew members and four civilians were on board and no casualties were reported. For two months Israel has blocked any humanitarian aid from entering Gaza, throwing Gaza into what is believed to be the worst humanitarian crisis in nearly 19 months of war. Israel’s army didn’t respond to a request for comment.",
      "publishedAt": "2025-05-02T08:11:36Z",
      "title": "Drone strikes vessel carrying aid to Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-02-2025-malta-2ff92bc0e1a8f667e122892f830a72f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "The Associated Press",
      "description": "China's Commerce Ministry says Beijing is evaluating multiple approaches by the Trump administration for trade talks. However, in a ministry statement it said one-sided tariffs of up to 145% imposed by President Donald Trump remain an obstacle and undermine trust. The statement reiterated China’s stance that is open to talks, but also that Beijing is determined to fight if it must. The statement cited an unnamed ministry spokesperson as saying that Beijing had taken note of various statements by senior U.S. officials indicating a willingness to negotiate over tariffs. But it emphasized that China would regard overtures without a change in President Donald Trump’s sharp tariff hikes as insincere.",
      "publishedAt": "2025-05-02T02:55:06Z",
      "title": "China says it's evaluating US overtures for trade talks, but tariffs remain an obstacle",
      "url": "https://apnews.com/article/china-tariffs-trump-trade-8637f1b88cf6801c9b9d2b3481389bee",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ba933a/2147483647/strip/true/crop/8064x4536+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F34%2F32a02947e71808d2d1c760b2a7e2%2F413ad7abc2514b3fafa36a4217c2c507"
    },
    {
      "author": "Giada Zampano",
      "description": "“Conclave,” the film may have introduced movie-goers to the spectacular ritual and drama of a modern conclave, but the periodic voting to elect a new pope has been going on for centuries and created a whole genre of historical trivia. The longest conclave and the shortest, the oldest pope and the youngest and a handful of antipopes as well. Here are some fun facts about conclaves past, derived from historical studies including Miles Pattenden’s “Electing the Pope in Early Modern Italy, 1450–1700” and interviews with experts including Elena Cangiano, an archeologist at Viterbo’s Palazzo dei Papi (Palace of the Popes).",
      "publishedAt": "2025-05-02T05:26:47Z",
      "title": "From the longest conclave to antipopes: 10 fun facts about the secret voting to elect a pope",
      "url": "https://apnews.com/article/vatican-new-pope-election-conclave-history-fun-facts-6a5dbba91e064dc0c973ae26773a0723",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d3d0c2/2147483647/strip/true/crop/3000x1688+0+29/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F98%2F0aa7e7a260e29b88295a6076d3fa%2Fa60e89272e8944a8a0a2cf920556f1a9"
    },
    {
      "author": "Eileen Ng",
      "description": "Singaporeans will vote Saturday in a general election that is set to return to power the city-state’s long ruling party. It will be closely watched as a gauge of public confidence in Prime Minister Lawrence Wong’s leadership. The People’s Action Party has won every election since the Asian financial hub gained independence in 1965. Wong, who took office last year, hopes to clinch a stronger mandate after the PAP suffered a setback in 2020 polls over voters’ rising discontent with the government. The PAP kept 83 out of 93 parliamentary seats, but it ceded more seats to the opposition, which won 10 seats, the most ever. The opposition has acknowledged it cannot unseat the PAP but is appealing to voters for a stronger voice in Parliament.",
      "publishedAt": "2025-05-02T01:11:03Z",
      "title": "Singapore's long-ruling party seeks stronger election victory in test for new prime minister",
      "url": "https://apnews.com/article/singapore-election-pap-wong-explainer-707a5957751dd3eb96320c41aa4d28d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fdc599f/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fe0%2Fe60bfb80c43d39a64fe86dcce365%2F4ab214cd3de0412f8ef6c8eba18554fd"
    },
    {
      "author": null,
      "description": "The Trump administration has asked the Supreme Court to strip temporary legal protections from 350,000 Venezuelans, potentially exposing them to being deported. The Justice Department asked the high court Thursday to put on hold a ruling from a federal judge in San Francisco that kept in place Temporary Protected Status that would have otherwise expired last month. A federal appeals court had earlier rejected the administration’s request. President Donald Trump’s administration has moved aggressively to withdraw various protections that have allowed immigrants to remain in the country, including ending TPS for a total of 600,000 Venezuelans and 500,000 Haitians.",
      "publishedAt": "2025-05-01T20:46:07Z",
      "title": "Trump administration asks Supreme Court to strip legal protections from 350,000 Venezuelan migrants",
      "url": "https://apnews.com/article/trump-venezuela-immigrants-deportation-protection-80f61585197eaff8b254c9b621976780",
      "urlToImage": "https://dims.apnews.com/dims4/default/41efec0/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe9%2F6ef4d323016b07e4f56d91781143%2F78ad037c00ff44b5b6d53c1bb4674ef6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}