{
  "articles": [
    {
      "author": "SEUNG MIN KIM, COLLEEN LONG, ELLIOT SPAGAT and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday unveiled plans to enact immediate significant restrictions on migrants seeking asylum at the U.S.-Mexico border as the White House tries to neutralize immigration as a political liability ahead the November elections.",
      "publishedAt": "2024-06-04T16:01:28Z",
      "title": "Biden rolls out asylum restrictions, months in the making, to help 'gain control' of the border",
      "url": "https://apnews.com/dec5f83b468b5795479bf1f5e49799d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e93ec3aa1a384424bc30ea847f080b24/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — President Joe Biden on Tuesday unveiled a halt to asylum processing at the U.S.",
      "publishedAt": "2024-06-04T21:27:43Z",
      "title": "How Biden's new order to halt asylum at the US border is supposed to work",
      "url": "https://apnews.com/1905e3565b2da1cffb8f38a778c07118",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d413eddd9ee45b196d781d542eaeb83/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA, SHEIKH SAALIQ and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India’s Prime Minister Narendra Modi, who claimed victory for his alliance in an election seen as a referendum on his decade in power, is a popular but polarizing leader who has presided over a fast-growing economy while advancing Hindu nationalism.",
      "publishedAt": "2024-06-04T16:35:11Z",
      "title": "India's popular but polarizing leader Narendra Modi is extending his decade in power. Who is he?",
      "url": "https://apnews.com/c3a4102d70c5c72e98b26874e1733279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/435427e771b842d38bac7e0e88167583/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE, CLAUDIA LAUER, COLLEEN LONG and MICHAEL KUNZELMAN",
      "description": "WILMINGTON, Del. (AP) — Federal prosecutors on Tuesday painted President Joe Biden’s son Hunter as deceptive and driven by addiction, a man whose dark habits ensnared loved ones and who knew what he was doing when he lied on a federal form to purchase a gun in 2018.",
      "publishedAt": "2024-06-04T04:10:54Z",
      "title": "Prosecutors spend first day of testimony in Hunter Biden's gun trial detailing his drug problems",
      "url": "https://apnews.com/477c0ca9d07afc1a52bd90ef6d2167cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5546eaa7493f4ad49dda4e612123fc4e/1920.jpeg"
    },
    {
      "author": "ANITA SNOW and JACQUES BILLEAUD",
      "description": "PHOENIX (AP) — The Republican-controlled Arizona Legislature gave final approval Tuesday to a proposal asking voters to make it a state crime for noncitizens to enter the state through Mexico at any location other than a port of entry, sending the measure to the Nov.",
      "publishedAt": "2024-06-04T05:05:22Z",
      "title": "Arizona voters will decide if local police can arrest people for crossing into the US from Mexico",
      "url": "https://apnews.com/0b68135c94ad2ebb90b5c731ddf67d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4955e98103f44edaabfbbfc8e010a85/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers are asking a New York judge to lift the gag order that barred the former president from commenting about witnesses, jurors and others tied to the criminal case that led to his conviction for falsifying records to cover up a potential sex scandal.",
      "publishedAt": "2024-06-04T22:17:24Z",
      "title": "Trump's lawyers ask judge to lift gag order imposed during New York trial",
      "url": "https://apnews.com/bc2d7c47d7ba4bea8c926821f9d35906",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8075bb5cc0f4067b544e71a4f5324d0/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The rate Earth is warming hit an all-time high in 2023 with 92% of last year's surprising record-shattering heat caused by humans, top scientists calculated.",
      "publishedAt": "2024-06-04T23:18:38Z",
      "title": "New study finds Earth warming at record rate, but no evidence of climate change accelerating",
      "url": "https://apnews.com/434881547b4585a32fa906cf5495d3f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7091d9f5a90942b69f3e9d85f2799c34/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Attorney General Merrick Garland rebuked Republicans Tuesday for what he described as unprecedented attacks on the Justice Department, telling lawmakers who have sought to hold him in contempt that he will “not be intimidated.”",
      "publishedAt": "2024-06-04T14:02:48Z",
      "title": "Garland slams attacks on the Justice Department, telling lawmakers: 'I will not be intimidated'",
      "url": "https://apnews.com/02ed2ff53f75e3ed9bc955f9f15d87bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d17caae4c22e4ab8827b061424068b72/2960.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House passed legislation Tuesday that would sanction the International Criminal Court for requesting arrest warrants for Israeli Prime Minister Benjamin Netanyahu and other Israeli officials.",
      "publishedAt": "2024-06-04T19:54:38Z",
      "title": "House passes proposal sanctioning top war-crimes court after it sought Netanyahu arrest warrant",
      "url": "https://apnews.com/1114b8fd0c6b9f3a83c3ed5919da3836",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32f831b921024193aca3b1b3d39d9bdf/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico’s newly elected president, the first woman to win the job, faces a long list of challenges, including persistent cartel violence, a deeply divided country, cash-straitened social programs and the long shadow of her mentor, outgoing President Andrés Manuel López Obrador.",
      "publishedAt": "2024-06-04T04:08:06Z",
      "title": "Mexico’s next president faces 3 pressing challenges: money, dialogue and the US election",
      "url": "https://apnews.com/8516bc1d399096367827c511132fedb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfca3d3ae6b44002900f9953ce83df98/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}