{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump’s new tariffs go into effect, including a combined 104% levy on China. The move raises the risk of a recession and of breaking the political and economic alliances that made much of the world stable for business after World War II.",
      "publishedAt": "2025-04-09T00:34:00Z",
      "title": "Live updates: Asia shares sink as US tariffs take effect",
      "url": "https://apnews.com/live/stock-market-economy-tariffs-updates-4-9-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/2005a3b/2147483647/strip/true/crop/6530x3673+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Fbe%2F3d8258a0ce81602e6d94e0d30ead%2Fab24c4b6f9054a6f87bb57d35faeb9a6"
    },
    {
      "author": null,
      "description": "President Donald Trump told a Republican gathering Tuesday evening that \"we're taking in a fortune in tariffs.\"",
      "publishedAt": "2025-04-09T07:08:30Z",
      "title": "Despite market tumult, Trump says 'we're making a fortune with tariffs'",
      "url": "https://apnews.com/video/despite-market-tumult-trump-says-were-making-a-fortune-with-tariffs-65afc6ffa5264b2b9a742791c3a720dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5db53b5/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F19%2Fb31cddf016bfde92ae4384ceb74f%2Fus-trump-nrcc-dinner-tariffs-20250409cr-1920x1080.jpg"
    },
    {
      "author": "Bridget Brown, Bernard McGhee",
      "description": "A number of sweeping new taxes on goods from other countries are already here — and more took effect on Wednesday. Trump has promised higher rates for his latest and most severe volley of duties, which he calls “reciprocal” tariffs.",
      "publishedAt": "2025-04-09T07:19:00Z",
      "title": "Live updates: Trump's latest round of tariffs go into effect",
      "url": "https://apnews.com/live/donald-trump-news-updates-4-9-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/0a41667/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fe9%2F0cc9807190aaad49574fba674105%2F74e1a65efd2e49c187156478ca889c57"
    },
    {
      "author": "Meg Kinnard",
      "description": "As President Donald Trump’s tariffs roil global markets, some of the thought leaders and influential podcasters who backed the Republican’s campaign are voicing doubts. Barstool Sports owner Dave Portnoy, hedge fund manager Bill Ackman and even Elon Musk are adding their voices to a number of congressional Republicans who have weighed in against the tariffs set to take effect on Wednesday. Joe Rogan, one of the nation’s most influential podcasters who endorsed Trump on the eve of last year’s election, also said in March that Trump’s feud with Canada was “stupid” and bemoaned the fact that Canadians “booed us over tariffs” during professional sporting events featuring teams from both countries.",
      "publishedAt": "2025-04-08T17:00:44Z",
      "title": "Joe Rogan and Dave Portnoy backed Trump. Now, they question his tariffs",
      "url": "https://apnews.com/article/trump-tariffs-criticism-musk-rogan-portnoy-ackman-7ee3cda2fe172d707af93e042e2009dd",
      "urlToImage": "https://dims.apnews.com/dims4/default/f15a0a5/2147483647/strip/true/crop/2396x1348+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F41%2Fab57c2c7f5be246a04b695b56eaa%2F36789b4179c84b4c91117ee63c67a1ad"
    },
    {
      "author": "Stephen Groves",
      "description": "Republican senators are confronting the Trump administration with a bevy of worries about the economic impacts of the president’s sweeping tariff strategy. In a Senate hearing and interviews with reporters this week, Republican skepticism of President Donald Trump’s agenda reached a level unseen since he won the GOP presidential nomination last year. While GOP lawmakers made sure to direct their concern at Trump’s aides and advisers, it still amounted to a rare Republican break from Trump. Lawmakers are worried about warnings that the plans could lead to a recession.",
      "publishedAt": "2025-04-09T04:15:10Z",
      "title": "Republicans are going public with their growing worries about Trump's tariffs",
      "url": "https://apnews.com/article/trump-tariffs-republicans-congress-9a5c1eba72514d77c3cdfa3861cb6d4c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ac03f4/2147483647/strip/true/crop/4444x2500+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F06%2F7138f4b7686736cc20f45d6246b9%2F050e7eb909c948dfb03499591e27a4ca"
    },
    {
      "author": "David Bauder",
      "description": "A federal judge has ordered the White House to restore The Associated Press’ full access to cover presidential events. He ruled on a case that touched at the heart of the First Amendment and affirmed that the government cannot punish the news organization for the content of its speech. U.S.. District Judge Trevor N. McFadden, an appointee of Donald Trump, ruled that the government can't retaliate against the AP’s decision not to follow the president’s executive order to rename the Gulf of Mexico. The decision handed the AP a major victory at a time the White House has been challenging the press on several levels.",
      "publishedAt": "2025-04-08T21:16:18Z",
      "title": "Court rules government must readmit AP to White House events",
      "url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09",
      "urlToImage": "https://dims.apnews.com/dims4/default/f2641cd/2147483647/strip/true/crop/3998x2249+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F88%2F9e2aaf41ae2217a21cfa52cf5ddd%2Fdf7fb21ed6a341a0aa4c47757011baf0"
    },
    {
      "author": "Fatima Hussein",
      "description": "The Internal Revenue Service’s acting commissioner is resigning over a deal to share immigrants’ tax data with Immigration and Customs Enforcement for the purpose of identifying and deporting people illegally in the U.S. Two people familiar with Melanie Krause’s decision confirmed the intended resignation to The Associated Press on condition of anonymity because they were not authorized to speak publicly about it. The memo signed Monday by Treasury Secretary Scott Bessent and Homeland Security Secretary Kristi Noem will allow ICE to submit names and addresses of immigrants inside the U.S. illegally to the IRS for cross-verification against tax records.",
      "publishedAt": "2025-04-08T17:47:53Z",
      "title": "IRS agrees to send immigrant tax data to ICE for enforcement",
      "url": "https://apnews.com/article/irs-ice-immigration-enforcement-trump-d2ac6f7ac0a1f60e907cd3b52d0db34d",
      "urlToImage": "https://dims.apnews.com/dims4/default/de66cba/2147483647/strip/true/crop/3484x1960+0+187/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2Fbf%2Fcc3c98ce312a5ffe2c41880624b5%2Fcb56a7c86a844c949c2e33b4362652df"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court has blocked an order for the Trump administration to return to work thousands of federal employees who were let go in mass firings aimed at dramatically downsizing the federal government. The justices acted Tuesday in the Republican administration’s emergency appeal of a ruling by a federal judge in California ordering that 16,000 probationary employees be reinstated while a lawsuit plays out because their firings didn’t follow federal law. The effect of the high court’s order will keep employees in six federal agencies on paid administrative leave for now. The coalition of organizations and labor unions that sued says it's disappointed with the court’s order.",
      "publishedAt": "2025-04-08T16:13:03Z",
      "title": "Supreme Court blocks order requiring Trump administration to reinstate workers",
      "url": "https://apnews.com/article/supreme-court-trump-mass-firings-02e218d2b7ee59925ddcb597b6b0a4fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/fea75c4/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc0%2F32ca597ddce24fcef7eb8e1c5dfb%2F2bffbbd29bdb417db681f7509bc02b66"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "House Speaker Mike Johnson finds himself in a familiar jam, with conservative Republican holdouts stalling action on President Donald Trump’s “big” bill of tax breaks and spending reductions. Those House Republicans are refusing to accept a Senate GOP budget framework approved over the weekend because it doesn’t cut enough. Trump summoned House Republicans to the White House for a Tuesday meeting. But many Republicans left unmoved. Next steps are uncertain. The beleaguered speaker wants to nudge the process forward before lawmakers leave for a two-week spring recess. The budget debate comes as Trump’s tariffs, mass layoffs and government cuts are rippling through the economy.",
      "publishedAt": "2025-04-08T17:31:16Z",
      "title": "Trump meeting with House Republicans as his 'big' bill teeters",
      "url": "https://apnews.com/article/taxes-tariffs-house-speaker-johnson-trump-da4af55882f7cb185da57ed0c80479aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/192b393/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fad%2F5702d61224299cdd2fbf01990e46%2F69847ff2a7ae455caa47eb8a26f3af76"
    },
    {
      "author": "Lolita Baldor",
      "description": "A top Pentagon official says that special operations forces do not have the authority to launch drone attacks at drug cartels in Mexico. Colby Jenkins told a Senate committee that President Donald Trump’s designation of the drug cartels as foreign terrorist organizations doesn’t automatically give the U.S. military the authority to take direct action against them. Jenkins is currently working as the assistant defense secretary for special operations. He was questioned Tuesday by Democratic Sen. Elissa Slotkin of Michigan. He said Trump’s designation “helps us unlock the doors” for a broader government approach to the drug problem.",
      "publishedAt": "2025-04-08T23:08:11Z",
      "title": "Pentagon official: US military has no authority to do drone strikes on drug cartels in Mexico",
      "url": "https://apnews.com/article/pentagon-drone-strikes-drug-cartels-mexico-33af0ea4c766335a3778454f86b3777b",
      "urlToImage": "https://dims.apnews.com/dims4/default/35ee6d7/2147483647/strip/true/crop/6891x3876+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F45%2F4fcb618107d7b2cecfb1f8a27d6b%2Fa79dc8cb95544019a659268ebb691cd8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}