{
  "articles": [
    {
      "author": "LUIS ANDRES HENAO",
      "description": "READING, Pa. (AP) — Religion and politics frequently overlap in Reading, an old industrial city in one of the most pivotal swing states of this year’s presidential election.In Pennsylvania, there is early precedent for this kind of thing.",
      "publishedAt": "2024-07-10T06:12:14Z",
      "title": "In swing-state Pennsylvania, a Latino-majority city embraces a chance to sway the 2024 election",
      "url": "https://apnews.com/8a6bb361a20ed0060836be8e753cb29d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebc346e457b44837807b8a6426d633d8/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes early Wednesday killed 20 Palestinians in central Gaza, including six children and three women, some of them inside a purported “safe zone” declared by the Israeli military, hospital authorities said.",
      "publishedAt": "2024-07-10T08:56:10Z",
      "title": "Israeli strikes in central Gaza kill 20 Palestinians as mediators make new push on cease-fire deal",
      "url": "https://apnews.com/6358a61735f0e30132decce781860594",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5590e36827246b58ee2917d860a22db/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The mood on Capitol Hill turned grimly uncertain Tuesday as Democrats wrestled over President Joe Biden’s reelection and the extraordinary question before them — whether to stand behind his candidacy or push the president to bow out amid concerns over his ability to lead them to victory.",
      "publishedAt": "2024-07-09T17:40:44Z",
      "title": "Biden's support on Capitol Hill grimly uncertain. A seventh Democrat says he should drop out",
      "url": "https://apnews.com/a8926189431d70686f2f1abdc5540fa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f9c068ae6aa4fb09df4ce7e256aa15c/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and MICHELLE L. PRICE",
      "description": "MIAMI (AP) — Former President Donald Trump on Tuesday reveled in the mounting turmoil surrounding President Joe Biden ’s campaign in the wake of their debate and teased the expected announcement of his Republican running mate with one of the top contenders, Florida Sen.",
      "publishedAt": "2024-07-09T04:12:44Z",
      "title": "Trump revels in Democratic turmoil as he returns to campaign trail and teases VP pick",
      "url": "https://apnews.com/6893fb5c5aac589ad83f151e49729bb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45ae7940efe24700b3bc394aaf08d731/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE, ELLEN KNICKMEYER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy said Tuesday that decisive action must be taken before the U.S. presidential election in November to repel Russia's offensive against his country, using an address on the sidelines of the NATO summit to press for greater support during a pivotal but tumultuous stretch in America's political calendar.",
      "publishedAt": "2024-07-09T18:06:37Z",
      "title": "Zelenskyy says the world cannot wait until the US election in November to take action to repel Putin",
      "url": "https://apnews.com/7f6a042e323af10e0425239ea5a023c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b20c13eb954c4cb4af1bdb6488655473/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and MARK VANCLEAVE",
      "description": "HOUSTON (AP) — The return of searing heat in the Houston area has deepened the misery for people still without power after Hurricane Beryl crashed into Texas and left residents in search of places to cool off and fuel up as the extended outages strained one of the nation’s largest cities.",
      "publishedAt": "2024-07-10T04:17:24Z",
      "title": "Houston residents left sweltering after Beryl with over 1.7 million still lacking power",
      "url": "https://apnews.com/ceb5fdc1db4d89d2376abb22bfd45d99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de4450792004f39922ede47733be81f/1920.jpeg"
    },
    {
      "author": "KEN RITTER and CHRISTOPHER WEBER",
      "description": "LAS VEGAS (AP) — Used to shrugging off the heat, Las Vegas residents are now eyeing the thermometer as the desert city is on track Wednesday to set a record for the most consecutive days over 115 degrees Fahrenheit (46.1 Celsius) amid a lingering hot spell that will continue scorching much of the U.S.",
      "publishedAt": "2024-07-10T05:05:48Z",
      "title": "Las Vegas eyes record of 5th consecutive day over 115 degrees as heat wave continues to scorch US",
      "url": "https://apnews.com/ed2009f3f4ad15b4ca96dc1aa0f5e1e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a48851674e1495d8e85c7b554675b5c/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Facing pressure from within his own party to abandon his reelection campaign, President Joe Biden is relying on labor unions to help make the case that his record in office matters more than his age.",
      "publishedAt": "2024-07-10T04:03:13Z",
      "title": "Biden will meet Wednesday with top union leaders as he seeks to reassure worried Democrats",
      "url": "https://apnews.com/8064d7b02c3a99d96b12546cfee0c967",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03ae641a3b374dba8f4551f6109c342a/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "READING, Pa. (AP) — Religion and politics frequently overlap in Reading, an old industrial city in one of the most pivotal swing states of this year’s presidential election.In Pennsylvania, there is early precedent for this kind of thing.",
      "publishedAt": "2024-07-10T06:12:14Z",
      "title": "In swing-state Pennsylvania, a Latino-majority city embraces a chance to sway the 2024 election",
      "url": "https://apnews.com/8a6bb361a20ed0060836be8e753cb29d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebc346e457b44837807b8a6426d633d8/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Sixteen jurors were seated Tuesday for Alec Baldwin’s involuntary manslaughter trial in New Mexico, where opening statements are set to start Wednesday.",
      "publishedAt": "2024-07-09T04:12:53Z",
      "title": "Jury is seated in Alec Baldwin's involuntary manslaughter trial in New Mexico",
      "url": "https://apnews.com/a6731e3226df0990f0469845df3ccde8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ac12785b250419081d4b9f0dcccc6c4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}