{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The first seven jurors for Donald Trump's hush money trial were seated Tuesday after lawyers grilled the jury pool about their social media posts, political views and personal lives to decide who can sit in fair judgment of the former president.",
      "publishedAt": "2024-04-16T04:06:06Z",
      "title": "First 7 jurors are chosen for Trump's hush money criminal trial; 11 more still needed",
      "url": "https://apnews.com/dd1a8dcc063b7ad0fbe14af6e8724c2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adeef1acc8264ca3987358a807524840/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and BILL BARROW",
      "description": "NEW YORK (AP) — Fresh from a Manhattan courtroom, Donald Trump visited a New York bodega where a man was stabbed to death, a stark pivot for the former president as he juggles being a criminal defendant and the Republican challenger intent on blaming President Joe Biden for crime.",
      "publishedAt": "2024-04-16T20:56:10Z",
      "title": "Trump goes from court to campaign at a bodega in his heavily Democratic hometown",
      "url": "https://apnews.com/909f0abee3f1951a2ffdabc8072d61a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/992f66b967504ac5a440ee2a0935bf56/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israel is vowing to retaliate against Iran, risking further expanding the shadow war between the two foes into a direct conflict after an Iranian attack over the weekend sent hundreds of drones and missiles toward Israel.",
      "publishedAt": "2024-04-16T20:13:29Z",
      "title": "Israel says it will retaliate against Iran. These are the risks that could pose to Israel",
      "url": "https://apnews.com/d9145465e2e2d54d3c975e51af95275b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1916792ab5646b9ac03271dbe161021/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The House sent two articles of impeachment against Homeland Security Secretary Alejandro Mayorkas to the Senate on Tuesday, forcing a trial on allegations that he has “willfully and systematically” refused to enforce immigration laws.",
      "publishedAt": "2024-04-16T04:23:18Z",
      "title": "House Republicans send Mayorkas impeachment articles to the Senate, forcing a trial",
      "url": "https://apnews.com/63e9ec242ec8a2f0a95f84497c506e0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8fe582b3a2c4eeb8227235c259a6feb/1920.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — President Joe Biden’s latest plan for student loan cancellation is moving forward as a proposed regulation, offering him a fresh chance to deliver on a campaign promise and energize young voters ahead of the November election.",
      "publishedAt": "2024-04-16T12:47:02Z",
      "title": "Biden's latest plan for student loan cancellation moves forward as a proposed regulation",
      "url": "https://apnews.com/f469500465aefa66aca67e3b31b27430",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30082e7ce8da4fd68081f6f465c220f6/2459.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Defiant and determined, House Speaker Mike Johnson pushed back Tuesday against mounting Republican anger over his proposed U.S. aid package for Ukraine, Israel and other allies, and rejected a call to step aside or risk a vote to oust him from office.",
      "publishedAt": "2024-04-16T16:04:50Z",
      "title": "Facing a Republican revolt, House Speaker Johnson pushes ahead on US aid for Ukraine, allies",
      "url": "https://apnews.com/3f6f6af81c860eb8ce4104e61728a0fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdd9e5212c6d4c7393dab951eeef48ac/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "SCRANTON, Pa. (AP) — President Joe Biden on Tuesday made a nostalgic return to the house where he grew up in working-class Scranton, kicking off a multi-day swing through Pennsylvania where he called for higher taxes on the rich and tried to cast Donald Trump as an out-of-touch elitist — part of an attempt to blunt the populist appeal of his predecessor’s comeback bid.",
      "publishedAt": "2024-04-16T09:05:13Z",
      "title": "Biden visits his Pennsylvania hometown to call for more taxes on the rich and cast Trump as elitist",
      "url": "https://apnews.com/6b3de3a4807cbccdb5732442071f4f6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ec71f1177f14244a386102cd699d5e9/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve Chair Jerome Powell cautioned Tuesday that persistently elevated inflation will likely delay any Fed interest rate cuts until later this year, opening the door to a period of higher-for-longer rates.",
      "publishedAt": "2024-04-16T18:05:00Z",
      "title": "Fed's Powell: Elevated inflation will likely delay rate cuts this year",
      "url": "https://apnews.com/c60436c5e719ce95fc487fdb98395d09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5b246bb901f415ea8037b7d17d2f0ff/3000.jpeg"
    },
    {
      "author": "JEROME PUGMIRE",
      "description": "PARIS (AP) — The talk before the opening ceremony of the Paris Games ideally should be about its grandiose backdrop: a summer sun setting on the Seine River as athletes drift by in boats and wave to cheering crowds.",
      "publishedAt": "2024-04-16T11:27:27Z",
      "title": "The Paris Games' grandiose opening ceremony is being squeezed by security and transport issues",
      "url": "https://apnews.com/d9553ff27dccd3a0ebf34e6601c1eeb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/826840bc2ec54c859c859c52ee6ee248/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israel’s military chief said Monday that his country will respond to Iran’s weekend attack, but he did not elaborate on when and how as world leaders urged against retaliation, trying to avoid a spiral of violence in the Middle East.",
      "publishedAt": "2024-04-15T17:38:44Z",
      "title": "Israel’s military chief says that Israel will respond to Iran’s weekend missile attack",
      "url": "https://apnews.com/aec3627b0b19b42dcafc89a7408dc296",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b3f1987e72e4e38b2294a003158f0df/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}