{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — More than 90 Palestinians, including dozens from an extended family, were killed in Israeli airstrikes on two homes in Gaza, rescuers and hospital officials said Saturday, a day after the U.N.",
      "publishedAt": "2023-12-23T09:31:19Z",
      "title": "Israel strikes 2 homes, killing more than 90 Palestinians. Biden says he didn't request a cease-fire",
      "url": "https://apnews.com/982fae4d0802b20d2a90423445c9f64b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c175b38e4e440d19bf4a0b790385454/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Fadi Sckak has already lost his father to the violence in Gaza. He wants to help his mother escape that fate.",
      "publishedAt": "2023-12-23T17:13:46Z",
      "title": "Americans beg for help getting family out of Gaza. \"I just want to see my mother again,' a son says",
      "url": "https://apnews.com/3d1dda48bed40c8b3e0dc2efa11caf9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01bb498482574a5fa0f9420fc2db2105/2735.jpeg"
    },
    {
      "author": "MARK SHERMAN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Supreme Court said Friday it will not immediately take up a plea by special counsel Jack Smith to rule on whether former President Donald Trump can be prosecuted for his actions to overturn the 2020 election results.",
      "publishedAt": "2023-12-22T19:35:57Z",
      "title": "Supreme Court rejects prosecutor's push to fast-track ruling in Trump election subversion case",
      "url": "https://apnews.com/90b93eeb663ebaf67a2e0bc266390fa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f330bb5f2a44ebe8e25ad558f046f49/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Standing on a portable stage erected at home plate of the Milwaukee Brewers ballpark, Wisconsin Gov. Tony Evers recently praised the professional baseball team as an “essential part” of the state's “culture and identity” and “economic success.”",
      "publishedAt": "2023-12-23T06:07:29Z",
      "title": "Plans abounding for new sports stadiums across the US, carrying hefty public costs",
      "url": "https://apnews.com/a81d825286530bb95f227efc99f2e9d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b6a5b9d47fd4410a21a84f3d7c4ef4b/3000.jpeg"
    },
    {
      "author": null,
      "description": "OCALA, Fla. (AP) — A man died in a shooting at a shopping mall in central Florida two days before Christmas in which the victim was apparently “targeted” for the attack, police said. Ocala Police Chief Mike Balken told reporters Saturday evening that the man was killed after he was shot multiple times in a common area at Paddock Mall in Ocala, located about 80 miles northwest of Orlando.",
      "publishedAt": "2023-12-23T21:49:01Z",
      "title": "One person killed, another injured in shooting at Florida shopping mall",
      "url": "https://apnews.com/990961110c48b7eddbbb76ea199c60df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76d0198e1d5e4af78e11e5d86dd4ebb7/2000.jpeg"
    },
    {
      "author": "KRISTEN GELINEAU, EDNA TARIGAN and REZA SAIFULLAH",
      "description": "PIDIE, Indonesia (AP) — Their screams and sobs could be heard from the ailing boat soon after it emerged into view amid the vastness of the Andaman Sea. Crowded on board were tiny babies and children, alongside mothers and fathers begging to be saved.",
      "publishedAt": "2023-12-23T04:12:38Z",
      "title": "‘Pray for us’: Eyewitnesses reveal first clues about a missing boat with up to 200 Rohingya refugees",
      "url": "https://apnews.com/c174d368f3a20e704b0aa745f8449e01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58c1679cf9de446ba6213b8597e183a6/3000.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — In the 1980s, Fu Xiangdong was a young Chinese virology student who came to the United States to study biochemistry. More than three decades later, he had a prestigious professorship in California and was conducting promising research on Parkinson’s disease.",
      "publishedAt": "2023-12-23T14:12:45Z",
      "title": "US tensions with China are fraying long-cultivated academic ties. Will the chill hurt US interests?",
      "url": "https://apnews.com/44bfd9f18a5f76d8889aa5a30ea165eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0080217fc275484eb9c7a189a0dcf136/2687.jpeg"
    },
    {
      "author": "CHRISTOPHE ENA and ANGELA CHARLTON",
      "description": "VATRY, France (AP) — About 300 Indian citizens heading to Central America were sequestered in a French airport for a third day Saturday after a dramatic police operation prompted by a tip that those aboard might be victims of human trafficking, authorities said.",
      "publishedAt": "2023-12-23T10:47:10Z",
      "title": "About 300 Indian travelers are stuck in a French airport in a human trafficking probe",
      "url": "https://apnews.com/9cb85e74512bed93e87b22b2be9062e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10df2f4f381a44029d7d9964b1252245/3000.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — Rudolph the red-nosed reindeer may have millions of carrots set out for him on Christmas Eve, but what about the rest of the year?Finding food in a cold, barren landscape is challenging, but researchers from Dartmouth College in New Hampshire and the University of St.",
      "publishedAt": "2023-12-23T05:01:23Z",
      "title": "Post-flight feast: Study suggests reindeer vision evolved to spot favorite food",
      "url": "https://apnews.com/838c1854938e71e973363a651cda8fb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a320a6fe2bf84b4782e7767ec10592cd/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "COLORADO SPRINGS, Colo. (AP) — The journey from nowhere to an Olympic gold medal is a tale as old as time.Just as well-worn, but far less explored, are the stories about great athletes who realize they can't make it anywhere unless they have a way to bankroll the trip.",
      "publishedAt": "2023-12-23T16:25:45Z",
      "title": "'The Boys in the Boat' gives the Hollywood treatment to rowing during an Olympic year",
      "url": "https://apnews.com/ba2688b033df2ed2488e0de3074d1e3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8100bbcd21c4e4ab187b564836bf503/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}