{
  "articles": [
    {
      "author": null,
      "description": "Israeli airstrikes have hit Yemen’s capital, Sanaa, just days after the Iran-backed rebels fired cluster munitions toward Israel. That's according to the rebel-run media office and a local television station, which reported the strikes on Sunday. The attack was the first to hit the rebel-held Sanaa since a week ago, when Israel said targeted energy infrastructure it believed was used by the rebels. Israel has not confirmed Sunday’s attack. The Houthis have launched missiles and drones toward Israel and targeted ships in the Red Sea for more than 22 months. They say they are carrying out the attacks in solidarity with the Palestinians amid the war in the Gaza Strip.",
      "publishedAt": "2025-08-24T13:25:15Z",
      "title": "Israeli airstrikes hit Yemen’s capital targeting Iran-backed Houthis, rebels and residents say",
      "url": "https://apnews.com/article/israel-gaza-yemen-houthi-rebels-fe4e0406f2b04cd3a07fd0b41771a5bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/a578b2c/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F25%2Fefb2f41d68b521779b2bab14b9b9%2Ffd3785d305264357b5770c17dedaae99"
    },
    {
      "author": null,
      "description": "Palestinians reported more deadly incidents near aid sites and in areas Israel plans to invade as it seeks control of Gaza’s largest city. Israeli forces on Sunday killed four aid seekers in a military zone where convoys have been overwhelmed by looters and desperate crowds traveling to an aid distribution point. Hospital officials and eyewitness reported the deaths in the Netzarim corridor as Palestinians in northern Gaza braces for a new Israeli offensive. Gaza City is the largest city in the besieged strip and where hundreds of thousands of displaced people are sheltering. Israel has invaded multiple times and believes a network of tunnels used by militants lie beneath the city.",
      "publishedAt": "2025-08-24T09:51:34Z",
      "title": "Israeli forces kill 4 more aid seekers as northern Gaza braces for looming offensive",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-24-2025-616dcac7f06b94119e692094d9515f16",
      "urlToImage": "https://dims.apnews.com/dims4/default/2df5f64/2147483647/strip/true/crop/5189x2919+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2F21%2F939d4603b40d2614570c8c8e855d%2F8e964e52c52442a8bd6791dc3a286e36"
    },
    {
      "author": null,
      "description": "Russia has accused Ukraine of drone strikes that sparked a fire at a nuclear power plant in the Kursk region Sunday as Ukraine marked its Independence Day. The fire was quickly extinguished with no injuries, though a transformer was damaged. Radiation levels remained normal. The U.N. nuclear watchdog called for protecting all nuclear facilities. Russia claimed to have shot down 95 Ukrainian drones overnight, while Ukraine intercepted 48 of 72 Russian drones. President Zelenskyy addressed the nation from Independence Square, calling for “just peace.” U.S. special envoy Keith Kellogg and Canada’s prime minister visited Kyiv, while Norway pledged $695 million in air defense systems, including Patriot missiles.",
      "publishedAt": "2025-08-24T09:17:53Z",
      "title": "Russia says Ukraine has struck a nuclear power plant in the Kursk region",
      "url": "https://apnews.com/article/russia-ukraine-war-independence-nuclear-164e25c537bf1054bbd426764b6e3bd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f1a0b1/2147483647/strip/true/crop/8563x4817+0+472/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F29%2F59ab765dbdd1c67670bccd0cca19%2F218a636b86d4467f978b5908defe36d3"
    },
    {
      "author": null,
      "description": "A German nonprofit organization says three young Sudanese sisters have died after an overcrowded rubber dinghy took on water in bad weather in the Mediterranean Sea. The group RESQSHIP found their bodies after rescuing some 65 people from the boat in international waters north off Libya. The sisters — aged 9, 11 and 17 — are the latest victims of the deadly migration sea route. The sisters' mother and brother were among the survivors who were brought to Italy's island of Lampedusa late on Saturday. Deadly sea crossings by migrants have claimed more than 30,000 lives since the International Organization for Migration started counting in 2014.",
      "publishedAt": "2025-08-24T12:00:20Z",
      "title": "3 Sudanese sisters drown on overcrowded migrant boat in the Mediterranean",
      "url": "https://apnews.com/article/migrant-boat-mediterranean-sudanese-refugees-drowning-migrant-deaths-migration-9c3908ac6e9850e88166d9a4202e9d78",
      "urlToImage": "https://dims.apnews.com/dims4/default/3bea6e0/2147483647/strip/true/crop/2048x1152+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F7d%2Faeaf2f3ffaf8d87a980402e5fda5%2Fffe1d2d4aebd4d0f8fb0fc9ed7dea869"
    },
    {
      "author": null,
      "description": "Immigration and Customs Enforcement, or ICE, is key in President Donald Trump's plan for mass deportations. Deportation officers in the Enforcement and Removal Operations unit handle immigration enforcement. They find and remove non-citizens who can't stay in the U.S. for various reasons. ICE also manages detention facilities for those suspected of immigration violations. The agency is rapidly hiring, with Congress approving $76.5 billion to speed up deportations. ICE plans to hire 10,000 more deportation officers by the end of the year. New recruits are trained at the Federal Law Enforcement Training Center in Georgia.",
      "publishedAt": "2025-08-24T11:43:39Z",
      "title": "What to know: Four ways ICE is training new agents and scaling up",
      "url": "https://apnews.com/article/border-immigration-mass-deportation-ice-trump-2bb1cfbafea8c65d167c0c44ca5d7b43",
      "urlToImage": "https://dims.apnews.com/dims4/default/049cec8/2147483647/strip/true/crop/5000x2813+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F90%2F3f83595ca610ae36e8149e27b267%2F9657ceed9b5041019388433ea578a4f2"
    },
    {
      "author": null,
      "description": "Boaters, beachgoers and fishermen who spend time in the chilly waters of New England and Canada are learning to live with great white sharks. Sightings of the apex predators are up in places like Maine, where they were once very rarely spotted. Scientists link the white shark sightings to increased availability of the seals the sharks feast on, and say beachgoers are generally very safe from shark bites. Researchers who track white sharks say the big fish are being sighted in northern waters more often and also appear to be spending more time there.",
      "publishedAt": "2025-08-24T11:53:04Z",
      "title": "Great white sharks are going to Maine and Canada to eat seals",
      "url": "https://apnews.com/article/great-white-sharks-moving-north-new-england-181c9f93da860f60a680abb7c447da05",
      "urlToImage": "https://dims.apnews.com/dims4/default/369850e/2147483647/strip/true/crop/1893x1065+4+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2Fe5%2F458351fd5e935c736f41f2ccc71a%2F44e6191fa9cc48a8a82034f0644bce76"
    },
    {
      "author": null,
      "description": "A posthumous memoir by prominent Jeffrey Epstein accuser Virginia Roberts Giuffre is set for release on Oct. 21. Titled “Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice,” the book was completed before Giuffre died by suicide in April. Publisher Alfred A. Knopf described it Sunday as an unsparing account of her experiences with Epstein, Ghislaine Maxwell, and others, including Britain's Prince Andrew. Giuffre had long alleged she was part of Epstein's sex-trafficking ring. The memoir aims to highlight systemic failures in addressing trafficking and seeks to foster discussions about these injustices. It's co-written by author-journalist Amy Wallace.",
      "publishedAt": "2025-08-24T17:27:07Z",
      "title": "Epstein accuser Virginia Giuffre's memoir will be published",
      "url": "https://apnews.com/article/virginia-giuffre-memoir-jeffrey-epstein-11a44440f4d0e50c8d6f3741640540d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3523a1/2147483647/strip/true/crop/3000x1688+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fc2%2Fcd1bcc38f489c84b692070574aa8%2F827ffcab645f4682afbac70dc83e9590"
    },
    {
      "author": null,
      "description": "Ukraine is marking 34 years of independence, and the country’s first generation of lawmakers and activists are reflecting on how early decisions shaped its struggle today. Student protests and political reform efforts in 1990 helped secure independence a year later, yet entrenched communist elites and Russian influence persisted. Key choices, including surrendering Ukraine’s nuclear arsenal under pressure from Moscow, left the country vulnerable, making NATO and EU integration urgent priorities amid Russia’s ongoing full-scale invasion.",
      "publishedAt": "2025-08-24T05:00:11Z",
      "title": "Protests paved the way for Ukraine independence but Russia still had influence",
      "url": "https://apnews.com/article/russia-ukraine-war-independence-declaration-day-f82750343551f36c7b8d89cd8d409531",
      "urlToImage": "https://dims.apnews.com/dims4/default/56f8df5/2147483647/strip/true/crop/2040x1148+0+85/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F42%2Fc41213290ec59010883aa134b9fc%2F752b2a7b84b44c7c9f443dbfdbb3ddf7"
    },
    {
      "author": null,
      "description": "Maria Sharapova has entered the International Tennis Hall of Fame, with Serena Williams introducing her at the ceremony on Saturday night. Williams surprised the crowd and honored Sharapova as a “former rival, former fan and forever friend.” She praised Sharapova for pushing her to be her best. Sharapova, the first Russian woman to reach No. 1 in the rankings, was inducted alongside doubles champions Mike and Bob Bryan. The Bryan brothers shared a speech, thanking coaches and teammates from their record-setting career.",
      "publishedAt": "2025-08-23T23:47:12Z",
      "title": "Serena Surprise: Williams makes appearance at Tennis Hall of Fame to induct rival Maria Sharapova",
      "url": "https://apnews.com/article/tennis-hall-of-fame-sharapova-bryan-brothers-7046262d37cc252d38e6175f7a42a0f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2c16e3/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F7d%2Ffab77acc8f7401ff1c500b41df42%2F7479acc399514970aad4c5f1d91c773b"
    },
    {
      "author": null,
      "description": "President Donald Trump says he's coming to the Ryder Cup. And he thinks U.S. captain Keegan Bradley should be playing in the Sept. 26-28 matches against Europe. Trump posted on his social media site that he would be at Bethpage Black for the opening round. The Ryder Cup already is the most flag-waving, raucous event in golf. It has gone up a notch this time because of the venue. Bethpage Black on New York's Long Island is notorious for having the rowdiest fans. Bradley is debating whether he should be the first playing captain in the Ryder Cup since Arnold Palmer in 1963.",
      "publishedAt": "2025-08-24T14:42:44Z",
      "title": "Trump says he'll be at Ryder Cup and he thinks captain Keegan Bradley should play",
      "url": "https://apnews.com/article/ryder-cup-trump-keegan-bradley-bethpage-975ce3b39900160469ce8117ef5abdce",
      "urlToImage": "https://dims.apnews.com/dims4/default/b03557e/2147483647/strip/true/crop/3793x2134+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F00%2F086adf040c3fd57eb674dc7abe8a%2F87638f77dea24b28aa13ed8bb26fe320"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}