{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB, WAFAA SHURAFA and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israel's military announced Sunday it is now taking aim at the Lebanon-based Hezbollah's financial arm and will attack a “large number of targets” in Beirut and elsewhere. Explosions began in Beirut's southern suburbs about an hour later.",
      "publishedAt": "2024-10-20T09:48:04Z",
      "title": "Israel says it will target Hezbollah's financial arm and begins striking Beirut",
      "url": "https://apnews.com/42ea48ce0f6a31d53a25dc50f16796bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a7659bd40b64669a9f119eb55a8df69/1920.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "On top of the grievous toll in human life and misery, Israel's war against the Hamas and Hezbollah militant groups has been expensive, and the painfully high financial costs are raising concerns about the long-term effect of the fighting on the country's economy.",
      "publishedAt": "2024-10-21T04:42:02Z",
      "title": "Israel's war against militants is expensive. Paying the bill could force tough choices",
      "url": "https://apnews.com/32a53a86d946418022ca636539a83f4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3615ce4338e0450693c038dbc4d6b320/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "In the coming days, Russian President Vladimir Putin will be shaking hands with multiple world leaders, including China’s Xi Jinping, India’s Narendra Modi, Turkey’s Recep Tayyip Erdogan and Iran’s Masoud Pezeshkian.",
      "publishedAt": "2024-10-21T04:08:32Z",
      "title": "Putin hosts a summit in a bid to show the West it can't keep Russia off the global stage",
      "url": "https://apnews.com/7c73c1cbee03c0de0d48e5b7314672e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddfa2041d4604ced8813e64b4ff5a1c5/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "RUTHERFORDTON, N.C. (AP) — Renee Kyro already has voted for Republican nominee Donald Trump for the third consecutive presidential election. But she plans to volunteer for the first time, reaching out to her neighbors in hurricane-battered western North Carolina to make sure they have a voting plan amid a flurry of precinct changes.",
      "publishedAt": "2024-10-21T04:20:25Z",
      "title": "In North Carolina, Trump and Harris navigate a hurricane and a rollercoaster governor's race",
      "url": "https://apnews.com/2dea5d3130416a56f21a5c22ce2e4386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c71769153ec04cd7a9fcbd411ff75ee2/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Voters remain largely divided over whether they prefer Republican Donald Trump or Democrat Kamala Harris to handle key economic issues, although Harris earns slightly better marks on elements such as taxes for the middle class, according to a new poll.",
      "publishedAt": "2024-10-21T04:03:48Z",
      "title": "Most voters think the economy is poor, but split on whether Trump or Harris can fix it: AP-NORC poll",
      "url": "https://apnews.com/bd496f938f9fe8e7e256326f973e8ac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d9396905ca47df923fcde646ebc52a/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "BAKER, Nev. (AP) — Few things say America like Janille and Tom Baker's ranch, with its grazing cattle, scrub brush-dotted desert and snow-capped mountains. If only they could get American citizens to work on it.",
      "publishedAt": "2024-10-21T04:07:19Z",
      "title": "Immigrants help power America's economy. Will the election value or imperil them?",
      "url": "https://apnews.com/2bc4d845aa12b75e80db94e0e4c0dd85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fbd374b6c544258b735cfb45406a226/3000.jpeg"
    },
    {
      "author": null,
      "description": "HAVANA (AP) — Tropical Storm Oscar brought heavy rains and winds to Cuba, an island already beleaguered by a massive power outage, late Sunday after brushing the Bahamas.",
      "publishedAt": "2024-10-19T18:14:09Z",
      "title": "Oscar brings winds, heavy rains to eastern Cuba after striking the Bahamas",
      "url": "https://apnews.com/02649631f0ca88ab3b0f643b51541da9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e5813d2d70439fa8bddf49f920f71e/2000.jpeg"
    },
    {
      "author": "STEVEN GRATTAN",
      "description": "BOGOTA, Colombia (AP) — Global environmental leaders gather Monday in Cali, Colombia to assess the world’s plummeting biodiversity levels and commitments by countries to protect plants, animals and critical habitats.",
      "publishedAt": "2024-10-21T02:02:45Z",
      "title": "Environmental delegates gather in Colombia for a conference on dwindling global biodiversity",
      "url": "https://apnews.com/a188a2f1c6319e16ad4f7071a0fc8572",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/451a5bdf682f4bfd95d66489e0cc7e52/1920.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Broadway vs. Hollywood. Subway vs. Freeway. Judge vs. Ohtani.New York neighbors who became cross-country rivals, the Yankees and Dodgers renew their starry struggle in the World Series for the first time in 43 years.",
      "publishedAt": "2024-10-21T03:34:03Z",
      "title": "Yankees and Dodgers meet in World Series for 12th time in matchup of Broadway and Hollywood",
      "url": "https://apnews.com/a0996d2d1906deafe38b2b15dc26ad0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a9f22f4bfcd4549a809037842bc37a1/1176.jpeg"
    },
    {
      "author": "RUSS BYNUM and EMILY WAGSTER PETTUS",
      "description": "SAVANNAH, Ga. (AP) — Orange life jackets bobbed in the water, where bystanders rushed to form a human chain for passing survivors to safety.",
      "publishedAt": "2024-10-21T04:07:11Z",
      "title": "Georgia islanders rushed to rescue survivors after dock walkway collapse that killed 7",
      "url": "https://apnews.com/cc67d03b802cc97594d1fb1a591cb408",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd9dc2dfe3524609b57f20f819be5499/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}