{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — Congress certified President-elect Donald Trump as the winner of the 2024 election in proceedings Monday that unfolded without challenge, in stark contrast to the Jan.",
      "publishedAt": "2025-01-06T05:03:45Z",
      "title": "Congress certifies Trump's 2024 win, without the Jan. 6 mob violence of four years ago",
      "url": "https://apnews.com/b8284b9b6b22f78ab7f23f8c8b3c3da3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1749928959c44dd390f467789b9708ed/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — A huge swath of the U.S. was blasted with ice, snow and wind on Monday as the polar vortex that dipped south over the weekend kept much of the country east of the Rockies in its frigid grip, making many roads treacherous, forcing school closures, and causing widespread power outages and flight cancellations.",
      "publishedAt": "2025-01-06T05:02:53Z",
      "title": "Polar vortex keeps much of the US in its icy grip",
      "url": "https://apnews.com/8b96d7f30cd068a56f7d0401ab51cebe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fea10de29e214a11961691611ad0132a/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Louisiana Attorney General Liz Murrill ordered on Monday an investigation into safety and security deficiencies in New Orleans, where an Army veteran sped around a police blockade and raced down Bourbon Street, killing 14 New Year's revelers.",
      "publishedAt": "2025-01-06T23:13:23Z",
      "title": "Louisiana AG orders security investigation as Biden directs resources to help New Orleans",
      "url": "https://apnews.com/5dd0509ce0cfff1756a255c4c1cd631c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e7de918518442f88176b9e1f4b86544/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A strong earthquake shook a mountainous region in western China near Nepal on Tuesday morning, killing at least 32 people.The official Xinhua News Agency said that 38 others have been injured, citing the regional disaster relief headquarters.",
      "publishedAt": "2025-01-07T01:51:33Z",
      "title": "Strong earthquake kills at least 32 people in western China",
      "url": "https://apnews.com/ca21bd4848209370b9eebcaf107208df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc68b2b6311a4a1da10916316de6f9ab/1507.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau announced his resignation Monday after nearly a decade in power, bowing to rising discontent over his leadership and growing turmoil within his government signaled by the abrupt departure of his finance minister.",
      "publishedAt": "2025-01-06T14:14:44Z",
      "title": "Canada's Trudeau announces resignation after nearly a decade as prime minister",
      "url": "https://apnews.com/03b27b55590bda7fb341065dd51fb873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d84191096ca4f888f401f2257d655b6/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump remains on track to be sentenced this week in his hush money case after a judge on Monday denied his request to halt proceedings while he appeals a ruling that upheld the historic verdict.",
      "publishedAt": "2025-01-06T14:34:59Z",
      "title": "Trump's sentencing still on for Friday after judge rebuffs his push for a delay while he appeals",
      "url": "https://apnews.com/e20933f9418bd378925e5f9e75f28485",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14711bc550b143bb82f4e1c515dc4ad0/1920.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Four years after launching a push for more diversity in its ranks, McDonald’s is ending some of its diversity practices, citing a U.S.",
      "publishedAt": "2025-01-06T20:37:54Z",
      "title": "McDonald's is the latest company to roll back diversity goals",
      "url": "https://apnews.com/845d94cd46511341a43e98e057b0fa8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e28726a5694c34a9a506e178f3d2a4/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The first U.S. bird flu death has been reported — a person in Louisiana who had been hospitalized with severe respiratory symptoms.State health officials announced the death on Monday, and the Centers for Disease Control and Prevention confirmed it was the nation's first due to bird flu.",
      "publishedAt": "2025-01-06T21:27:37Z",
      "title": "First US bird flu death is announced in Louisiana",
      "url": "https://apnews.com/82e4d00876e62cb2b13bb621826c84f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1468de5f8a574a0fa62c3579cbac06d4/2579.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — The Minneapolis City Council on Monday approved an agreement with the federal government to overhaul the city's police training and use-of-force policies in the wake of the murder of George Floyd.",
      "publishedAt": "2025-01-06T16:52:39Z",
      "title": "Minneapolis agrees to overhaul police training and force policies after George Floyd's murder",
      "url": "https://apnews.com/c37b90d4217b549e52fc176e08dec29f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90dc25f5189d4cb5903598a63d3583e9/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel and Hamas once again appear to be inching toward a ceasefire that could wind down the 15-month war in Gaza and bring home dozens of Israelis held hostage there.",
      "publishedAt": "2025-01-06T19:22:23Z",
      "title": "Hurdles remain as Israel and Hamas once again inch toward a ceasefire deal",
      "url": "https://apnews.com/409a3c76c83e75abb7ff2b1d8a5abd38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2185aea760a1461da1da1f045bd62baf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}