{
  "articles": [
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military campaign in Gaza, experts say, now sits among the deadliest and most destructive in history.In just over two months, the offensive has wreaked more destruction than the razing of Syria’s Aleppo between 2012 and 2016, Ukraine’s Mariupol or, proportionally, the Allied bombing of Germany in World War II.",
      "publishedAt": "2023-12-21T20:17:38Z",
      "title": "Israel's military campaign in Gaza seen as among the most destructive in history, experts say",
      "url": "https://apnews.com/419488c511f83c85baea22458472a796",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/560260f88d8541328a26d1b7b8812a17/3000.jpeg"
    },
    {
      "author": "KAREL JANICEK",
      "description": "PRAGUE (AP) — A student opened fire Thursday at a university in Prague, killing at least 14 people, officials said, and injuring more than 20 in the Czech Republic’s worst mass shooting.The bloodshed took place in the philosophy department building of Charles University, where the shooter was a student, Prague Police Chief Martin Vondrasek said.",
      "publishedAt": "2023-12-21T14:55:23Z",
      "title": "Gunman opens fire in a Prague university, killing 14 people in Czech Republic's worst mass shooting",
      "url": "https://apnews.com/9a383bc6919c1b0d929cf06aa4818341",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11e601a0e4574336b4a1c7092d27f123/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Rudy Giuliani filed for bankruptcy on Thursday, acknowledging severe financial strain exacerbated by his pursuit of former President Donald Trump's lies about the 2020 election and a jury’s verdict last week requiring him to pay $148 million to two former Georgia election workers he defamed.",
      "publishedAt": "2023-12-21T17:56:22Z",
      "title": "Rudy Giuliani files for bankruptcy days after being ordered to pay $148 million in defamation case",
      "url": "https://apnews.com/4780ebe8e3f39133817f70c063c3c564",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6280fbf764744638a107f7921ed2c55e/1920.jpeg"
    },
    {
      "author": "MARTHA BELLISLE and MADDY GRASSY",
      "description": "TACOMA, Wash. (AP) — A jury cleared three Washington state police officers of all criminal charges Thursday in the 2020 death of Manuel Ellis, a Black man who was shocked, beaten and restrained face-down on a Tacoma sidewalk as he pleaded for breath.",
      "publishedAt": "2023-12-21T23:20:19Z",
      "title": "Jury acquits 3 Washington state officers in death of a Black man who told them he couldn’t breathe",
      "url": "https://apnews.com/132030b3c8cd675c5e19d90f51f16d24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f2966196ce84cbfae9c23e5a96b43e6/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and ERIC TUCKER",
      "description": "MIAMI (AP) — A defense contractor at the center of one of the biggest bribery scandals in U.S.",
      "publishedAt": "2023-12-21T20:17:28Z",
      "title": "From fugitive to shackled prisoner, 'Fat Leonard' lands back in US court and could face more charges",
      "url": "https://apnews.com/c4821af78770c3b50fcb95963961832b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09abfd6b513e435b94859aa320414264/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "ANAMOSA, Iowa (AP) — Nikki Haley stopped short Thursday of answering one Iowa voter's question the way he'd hoped.Asked by 44-year-old Jacob Schunk to label Donald Trump a “grave danger to our country,” Haley ticked through criticisms of the former president ranging from foreign policy to government spending.",
      "publishedAt": "2023-12-21T23:09:27Z",
      "title": "A voter pushed Nikki Haley to call Donald Trump a 'grave danger' to the US. Here's how she responded",
      "url": "https://apnews.com/9f08b07c08e155eae6552694fb46654c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a301e15addb4330a43e2b132f67b765/3000.jpeg"
    },
    {
      "author": "EUGENE GARCIA and JOHN ANTCZAK",
      "description": "SANTA BARBARA, Calif. (AP) — Motorists were stranded in their vehicles on flooded roadways in typically idyllic Santa Barbara on Thursday, while nearby Oxnard got a month's worth of rain in a single hour in a storm that pummeled Southern California while Christmas travel got underway.",
      "publishedAt": "2023-12-21T16:10:24Z",
      "title": "Pacific storm dumps heavy rains and unleashes flooding in California coastal cities",
      "url": "https://apnews.com/97ea59e806f3bc0950ed194e12009ec8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c8317abc89c41e5a73ca2460086eb79/1920.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — A federal judge hearing a challenge to a transgender health care ban for minors and restrictions for adults noted Thursday that Republican Florida Gov.",
      "publishedAt": "2023-12-22T00:25:53Z",
      "title": "Judge: DeSantis spread false information while pushing trans health care ban, restrictions",
      "url": "https://apnews.com/61639592d4c5e8512af3d3b078e40862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb2a632d15884a2ea5ae626b5b4a5870/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "NEW YORK (AP) — You found the perfect holiday gift online. You ordered it. A notification arrived on your phone, showing the package had arrived. But when you open your doors, the parcel is nowhere to be found.",
      "publishedAt": "2023-12-21T08:00:25Z",
      "title": "Were your holiday deliveries stolen? What to know about porch piracy and what you can do about it",
      "url": "https://apnews.com/100fd1613b059c691072627e7cc0c0d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cc3439a8a3944dcab0f663b85e30092/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "BOSTON (AP) — Growing up in a Boston suburb in the 1960s, Charlie Baker learned his first political lesson — the art of listening to competing viewpoints — around the dinner table as his Democratic mother and Republican father hashed out the topics of the day.",
      "publishedAt": "2023-12-21T16:04:56Z",
      "title": "NCAA President Charlie Baker drawing on lessons learned as GOP governor in Democratic Massachusetts",
      "url": "https://apnews.com/fd82aec7e8aba2f6db726607e721c87a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/015d48d961ce4c3cb61f7e94bb7242ea/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}