{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden has a fresh opportunity Thursday to try to prove to the American public that he’s capable of serving another four years after his shocking debate flop threw the future of his presidency into doubt.",
      "publishedAt": "2024-07-11T04:21:32Z",
      "title": "Biden's press conference will be a key test for him. But he's no master of the big rhetorical moment",
      "url": "https://apnews.com/f213c40509e35ed485ed3c57277ee911",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6acb81a93f6d4df9a794c7ff80d0d887/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — President Joe Biden's imperiled reelection campaign hit new trouble Wednesday as House Speaker Emerita Nancy Pelosi said merely “it's up to the president to decide” if he should stay in the race, celebrity donor George Clooney said he should not run and Democratic senators and lawmakers expressed fresh fear about his ability to beat Republican Donald Trump.",
      "publishedAt": "2024-07-10T13:45:10Z",
      "title": "Biden's candidacy faces new peril, including first Senate Democrat saying he should exit race",
      "url": "https://apnews.com/333c0774dec4de05c32c353255b5f627",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b0ce74d47ff4651abc23cddcc2023ca/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As he prepares to accept the Republican nomination for the third time, Donald Trump has promised new efforts to expand his coalition — and, in particular, to win over more of the nonwhite voters who largely rejected him during the 2020 election.",
      "publishedAt": "2024-07-11T04:04:13Z",
      "title": "Trump wants Black and Latino support. But he's not popular with either group, poll analysis shows",
      "url": "https://apnews.com/59acadcda6cf9cb1082d4bdd9d4c4a81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de49e814afa4dcc9c0112eb26921926/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military urged all Palestinians to leave Gaza City and head south Wednesday, pressing ahead with a fresh offensive across the north, south and center of the embattled territory that has killed dozens of people over the past 48 hours.",
      "publishedAt": "2024-07-10T08:56:10Z",
      "title": "Israeli military orders the evacuation of Gaza City, an early target of its war with Hamas",
      "url": "https://apnews.com/6358a61735f0e30132decce781860594",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909da4d733af4aa89c788522fc1a574e/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — China accused NATO on Thursday of seeking security at the expense of others and told the alliance not to bring the same “chaos” to Asia, a reflection of its determination to oppose strengthening ties between NATO members and Asian nations such as Japan, South Korea and the Philippines.",
      "publishedAt": "2024-07-11T08:17:18Z",
      "title": "China tells NATO not to create chaos in Asia and rejects label of 'enabler' of Russia's Ukraine war",
      "url": "https://apnews.com/689834988a7e0543504010649a63e319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/287478d1170e4e1e9504347185db67bb/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — The National Cancer Institute in Kyiv was busier than usual after a Russian missile struck Ukraine’s largest children’s hospital this week, forcing the evacuation of dozens of its young patients battling cancer.",
      "publishedAt": "2024-07-11T05:09:29Z",
      "title": "Russian missile attack on Ukraine’s largest hospital complicates treatment of kids with cancer",
      "url": "https://apnews.com/0ac47b944af2ed20d840563727836f53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/531bd3421b5c419bb7daa90cfc34370a/1920.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ISABELLA VOLMERT, MARC LEVY and JONATHAN J. COOPER",
      "description": "SAGINAW, Mich. (AP) — Considering her choices in this year’s rapidly approaching presidential election, Rochelle Jones thinks both major party candidates should step aside.",
      "publishedAt": "2024-07-11T04:12:25Z",
      "title": "Biden says pressure on him is driven by elites. Voters paint a more complicated picture",
      "url": "https://apnews.com/c694cae7a3d6a7ce688b4a49d1fbcc82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a591543cd982454880c8689962a3e2e4/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — The delegates at the 1787 Constitutional Convention were trying to create a new governing framework for the fledging United States of America. They knew they needed SOMEONE to be at the helm of the federal government.",
      "publishedAt": "2024-07-11T04:13:32Z",
      "title": "Government power in the US is a swirl of checks and balances, as a recent Supreme Court ruling shows",
      "url": "https://apnews.com/7acd183dda25b7d005b3dea89ac8a61d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/067325e593954546be0ad1a773ae806a/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER",
      "description": "LOS ANGELES (AP) — Authorities in Western states warned of the rising risk of wildfires as hot conditions and low humidity dry out the landscape amid a protracted heat wave that is expected to bake much of the U.S.",
      "publishedAt": "2024-07-11T04:04:15Z",
      "title": "Wildfire risk rises as Western states dry out amid ongoing heat wave baking most of the US",
      "url": "https://apnews.com/27b2d39ff68b87f131c67fc7594163e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/043a8d4296e04ad387f1c1fff44293c5/2821.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Prosecutors sought to cast Alec Baldwin as someone who flouts rules and has little regard for safety at the first day of his New Mexico trial in the shooting of a cinematographer.",
      "publishedAt": "2024-07-11T04:02:53Z",
      "title": "Alec Baldwin cast as reckless flouter of rules at his trial in cinematographer's shooting",
      "url": "https://apnews.com/86e4265a0c4d8e130b02a1289ae99520",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/748e42a0ae754175bd8a7f1d94a146b9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}