{
  "articles": [
    {
      "author": "AUDREY McAVOY and CLAIRE RUSH",
      "description": "LAHAINA, Hawaii (AP) — Richy Palalay so closely identifies with his Maui hometown that he had a tattoo artist permanently ink “Lahaina Grown” on his forearms when he was 16.But a chronic housing shortage and an influx of second-home buyers and wealthy transplants have been displacing residents like Palalay who give Lahaina its spirit and identity.",
      "publishedAt": "2023-08-13T06:07:01Z",
      "title": "Lahaina residents worry a rebuilt Maui town could slip into the hands of affluent outsiders",
      "url": "https://apnews.com/d8902c3ea55a8ec4d9938865f3f749f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6356de9568994df2ab827b1023b67f03/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and BEATRICE DUPUY",
      "description": "LAHAINA, Hawaii (AP) — As the death toll from a wildfire that razed a historic Maui town climbed to 93, authorities warned that the effort to find and identify the dead was still in its early stages.",
      "publishedAt": "2023-08-13T04:28:09Z",
      "title": "As death toll from Maui wildfire reaches 93, effort to find and identify the dead is just beginning",
      "url": "https://apnews.com/fb2ebf6cd39c149a582b82eed6ac3930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98cdb9256f144a8b9a180c6a492d337e/1920.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Seven people – including a 23-day-old baby girl – were killed in Russian shelling in Ukraine's southern Kherson region on Sunday, the country's Internal Affairs Ministry said.Artillery shelling in the village of Shiroka Balka, on the banks of the Dnieper River killed a family — a husband, wife, 12-year-old boy and 23-day-old girl — and another resident.",
      "publishedAt": "2023-08-13T11:29:13Z",
      "title": "7 killed in Ukraine's Kherson region, including a 23-day-old baby girl",
      "url": "https://apnews.com/95be9d8fbe3e3c3f8c39908a7ab1f0c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ccb00de704245918be0348c740ed892/3000.jpeg"
    },
    {
      "author": "AARON MORRISON, AISHA I. JEFFERSON and KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — As bystanders trained their smartphone cameras on the riverfront dock while several white boaters pummeled a Black riverboat co-captain, they couldn’t have known the footage would elicit a national conversation about racial solidarity.",
      "publishedAt": "2023-08-13T04:36:36Z",
      "title": "Alabama riverfront brawl videos spark a cultural moment about race, solidarity and justice",
      "url": "https://apnews.com/b190302a1f347e11868a1a8ddfbd85bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b0546c90b744dfbc85d47b467bdfe7/2911.jpeg"
    },
    {
      "author": "ANITA SNOW and KENDRIA LaFLEUR",
      "description": "PHOENIX (AP) — Postal worker Eugene Gates Jr. was delivering mail in the suffocating Dallas heat this summer when he collapsed in a homeowner's yard and was taken to a hospital, where he died. Carla Gates said she's sure heat was a factor in her 66-year-old husband's death, even though she's still waiting for the autopsy report.",
      "publishedAt": "2023-08-13T04:17:12Z",
      "title": "Mishmash of how US heat deaths are counted complicates efforts to keep people safe as Earth warms",
      "url": "https://apnews.com/7125ad9a5289625bd9ca312945996399",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f573f7865cd43c8b88f50d9b51cc3dd/2000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — One week after a deadline passed for mutinous soldiers in Niger to reinstate the country's ousted president or face military intervention, the junta has not acquiesced. No military action has been taken and the coup leaders appear to have gained the upper hand over the regional group that issued the threat, analysts say.",
      "publishedAt": "2023-08-13T07:59:17Z",
      "title": "Niger's junta gains the upper hand over the regional bloc threatening military force, analysts say",
      "url": "https://apnews.com/57900b121d1fa1499354ed21aca994d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c52a359eedd74c6aa4ad6405dfbd195f/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Poland’s ruling party wants to ask voters in a referendum whether they support accepting “thousands of illegal immigrants from the Middle East and Africa” as part of a European Union relocation plan, the prime minister said Sunday, as his conservative party seeks to hold onto power in an October parliamentary election.",
      "publishedAt": "2023-08-13T07:29:45Z",
      "title": "Polish government plans referendum asking if voters want 'thousands of illegal immigrants'",
      "url": "https://apnews.com/e43f5f5f76a34a6f7f3a24b3d39fbc00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d26faaa98e74a8e918ac297a333f7a9/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and MARGERY A. BECK",
      "description": "MARION, Kan. (AP) — A small central Kansas police department is facing a firestorm of criticism after it raided the offices of a local newspaper and the home of its publisher and owner — a move deemed by several press freedom watchdogs as a blatant violation of the U.S.",
      "publishedAt": "2023-08-13T19:02:41Z",
      "title": "Police questioned over legality of Kansas newspaper raid in which computers, phones seized",
      "url": "https://apnews.com/aca057365ea3925328a69acd615c9893",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42a535c76ab8403ebde121e239df9dd9/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Patients who take blockbuster drugs like Wegovy or Ozempic for weight loss may face life-threatening complications if they need surgery or other procedures that require empty stomachs for anesthesia.",
      "publishedAt": "2023-08-13T08:00:21Z",
      "title": "Popular weight-loss drugs like Wegovy may raise risk of complications under anesthesia",
      "url": "https://apnews.com/6e2556948334d0c6aa2ee0c7cbacb77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93fb044f29f5449da86dc4c974012225/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "SAN SALVADOR, El Salvador (AP) — Douglas Guzmán's TikTok feed was dotted with workout routines and videos showcasing his favorite parts of his country. That changed about a year ago, as rights groups, civil society and even some officials criticized El Salvador's President Nayib Bukele for violating human rights in his crackdown on criminal gangs, and said that his unconstitutional bid for re-election would corrode the country’s democracy.",
      "publishedAt": "2023-08-13T04:08:04Z",
      "title": "As free press withers in El Salvador, pro-government social media influencers grow in power",
      "url": "https://apnews.com/5523937ba0e499af71e7f2ff7e72eeac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03db9c019ce74e4995206bf9692fcb3e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}