{
  "articles": [
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — U.S. military C-130 cargo planes dropped food in pallets over Gaza on Saturday in the opening stage of an emergency humanitarian assistance authorized by President Joe Biden after more than 100 Palestinians who had surged to pull goods off an aid convoy were killed during a chaotic encounter with Israeli troops.",
      "publishedAt": "2024-03-02T14:43:48Z",
      "title": "US military aircraft airdrop thousands of meals into Gaza in emergency humanitarian aid operation",
      "url": "https://apnews.com/f8bc071193f89906abf21478bc70a084",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec2cb3b8ab3449e1ac0025c355c084ae/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Many of the Palestinians killed or wounded in the chaos as they tried to get bags of flour from an aid convoy were hit by Israeli army fire, the European Union’s diplomatic service said Saturday, urging an international investigation.",
      "publishedAt": "2024-03-02T12:12:07Z",
      "title": "Many of those killed or wounded in Gaza stampede for aid were shot by Israel's army, EU arm says",
      "url": "https://apnews.com/531593c27931a2764357b6f7b11ce394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3add734fc214229b2fadfbe6f35e008/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A ship attacked by Yemen's Houthi rebels has sunk in the Red Sea after days of taking on water, officials said Saturday, the first vessel to be fully destroyed as part of their campaign over Israel's war against Hamas in the Gaza Strip.",
      "publishedAt": "2024-03-02T11:27:40Z",
      "title": "A ship earlier hit by Yemen's Houthi rebels sinks in the Red Sea, the first vessel lost in conflict",
      "url": "https://apnews.com/fb64a490ce935756337ee3606e15d093",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61b23ed1bb6a46f0b4db098fba5b1177/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "More delegates are up for grabs Saturday as former President Donald Trump looks to get closer to clinching the Republican nomination and former U.N.",
      "publishedAt": "2024-03-02T05:08:05Z",
      "title": "Republicans in Idaho, Missouri and Michigan will meet to weigh in on the presidential race",
      "url": "https://apnews.com/5d3934acc54d6919427cfb025002f15c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdd48940890b4cc3b52b86bdbf845b3b/2400.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, ERIC TUCKER and ANTHONY McCARTNEY",
      "description": "WASHINGTON (AP) — Alexander Smirnov was cast by Republicans as one of the FBI’s most trusted informants, offering a “highly credible” account of brazen public corruption by Joe Biden that formed a pillar of the House impeachment investigation of the Democratic president.",
      "publishedAt": "2024-03-02T13:33:51Z",
      "title": "How clean is the dirt on Hunter Biden? A key Republican source is charged with lying to the FBI",
      "url": "https://apnews.com/113c1104052dbdc9302606f6d42c9939",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a18021aaf94291b490bd733c0bdaa5/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "STINNETT, Texas (AP) — Firefighters battling the largest wildfire in Texas history face increasingly difficult weather conditions on Saturday.The Smokehouse Creek Fire that began Monday has killed at least two people, left a charred landscape of scorched prairie, dead cattle and destroyed as many as 500 structures, including burned-out homes, in the Texas Panhandle.",
      "publishedAt": "2024-03-02T12:38:35Z",
      "title": "Firefighters face difficult weather conditions as they battle the largest wildfire in Texas history",
      "url": "https://apnews.com/e00e345808351aa015779a28ec494392",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23e2e63075ea4e1eb060b5b7d5dbedd7/1920.jpeg"
    },
    {
      "author": null,
      "description": "DUBAI, United Arab Emirates (AP) — Iran's hard-liners are leading in an initial vote count in the capital Tehran, state media reported Sunday, following a record-low turnout in a parliamentary election.",
      "publishedAt": "2024-03-02T10:10:44Z",
      "title": "Hard-liners are leading in vote count in Iran’s parliamentary election after record-low turnout",
      "url": "https://apnews.com/1717e510c2d912d2d19afd7c352be2c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b500a1a6e8e442d8f05356f888fe2b6/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO and JESSIE WARDARSKI",
      "description": "NASHVILLE, Tenn. (AP) — The young crowd at a Nashville nightclub was ready to dance under the strobe lights to a throbbing mix of hip-hop, rap and Latin beats.",
      "publishedAt": "2024-03-02T13:19:42Z",
      "title": "No twerking. No drinking. No smoking. But it's still a party at this Christian nightclub",
      "url": "https://apnews.com/da3ed45aa9ee39b1114ff132515a960e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdd5ba2a79fe4b8abe9ecc0142ebeac3/1920.jpeg"
    },
    {
      "author": "SCOTT SONNER",
      "description": "RENO, Nev. (AP) — A powerful blizzard raged overnight into Saturday in the Sierra Nevada as the biggest storm of the season shut down a long stretch of Interstate-80 in California and gusty winds and heavy rain hit lower elevations, leaving tens of thousands of customers without power.",
      "publishedAt": "2024-03-02T08:01:57Z",
      "title": "Powerful storm in California and Nevada shuts interstate and dumps snow on mountains",
      "url": "https://apnews.com/d3da8b2ecfca73e2f885d88a83138ac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f10639ba2e5427e997a6a47e7b87566/3000.jpeg"
    },
    {
      "author": "STEPHANIE NANO",
      "description": "NEW YORK (AP) — Where will you be watching the April 8 total solar eclipse? There are just a few weeks left to pick your spot to see the skies darken along a strip of North America, whether by land, sea or air.",
      "publishedAt": "2024-03-02T13:05:21Z",
      "title": "Where will you be for the April 8 total solar eclipse? There's still time to grab a spot",
      "url": "https://apnews.com/14b52646d918184922d651bf8c8daab2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b71b104125e24c94b04e7954f8f38bab/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}