{
  "articles": [
    {
      "author": "JIM HEINTZ, DASHA LITVINOVA and EMMA BURROWS",
      "description": "Alexei Navalny, who crusaded against official corruption and staged massive anti-Kremlin protests as President Vladimir Putin’s fiercest foe, died Friday in the Arctic penal colony where he was serving a 19-year sentence, Russia’s prison agency said.",
      "publishedAt": "2024-02-16T11:37:39Z",
      "title": "Alexei Navalny, galvanizing opposition leader and Putin’s fiercest foe, died in prison, Russia says",
      "url": "https://apnews.com/2d11644f7ae5332587b39150f1fd1738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee1878a49bfe46d8ae2a0f0596287181/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — World leaders and Russian opposition activists wasted no time Friday in blaming the reported death of imprisoned opposition leader Alexei Navalny on President Vladimir Putin and his government.",
      "publishedAt": "2024-02-16T13:35:57Z",
      "title": "Western officials and Kremlin critics blame Putin and his government for Navalny's death in prison",
      "url": "https://apnews.com/19e7fd6318763627f6917a92678cd190",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11b2b539abc94c69b988d6c7b84bc61c/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A verdict is expected Friday in Donald Trump’s New York civil fraud trial, adding to a consequential week on the former president’s legal calendar.Trump could be hit with millions of dollars in penalties and other sanctions in the decision by Judge Arthur Engoron, who has already ruled that the former president inflated his wealth on financial statements that were given to banks, insurers and others to make deals and secure loans.",
      "publishedAt": "2024-02-16T05:19:12Z",
      "title": "Verdict in Donald Trump’s civil fraud trial expected Friday, capping busy week of court action",
      "url": "https://apnews.com/244024861f0df886543c157c9fc5b3e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0deebd7eefe546dbadb11014d690d4ae/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — The Fulton County district attorney's office opted not to put Fani Willis back on the witness stand Friday, avoiding the spectacle of more deeply personal testimony from the top prosecutor as she fights an effort to derail Donald Trump's 2020 Georgia election interference case.",
      "publishedAt": "2024-02-16T05:20:41Z",
      "title": "Ex-Georgia governor testifies that he turned down Fani Willis' offer to be Trump special prosecutor",
      "url": "https://apnews.com/f03734cfd3d27ba34fba4cbbba621355",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74da5313c2344325a3a9bfec0567ece5/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — In a single week, the Republican chairs of three House committees announced they would not be seeking reelection, raising questions about whether the chaos that has reigned this Congress is driving out some of the GOP's top talent.",
      "publishedAt": "2024-02-16T15:45:57Z",
      "title": "A chaotic US House is losing three Republican committee chairs to retirement in the span of a week",
      "url": "https://apnews.com/1fa6864ba5ea80eb8dad88ddcc59cac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed3ac15b46d8469f8099f0d8364cee3c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — Five patients in intensive care died after their oxygen ran out in southern Gaza's main hospital that was stormed by Israeli troops, causing chaos for hundreds of staff and wounded people inside, health officials said Friday.",
      "publishedAt": "2024-02-16T08:30:59Z",
      "title": "5 patients die as oxygen runs out in Gaza hospital seized by Israeli forces, health officials say",
      "url": "https://apnews.com/21e09d731eb09f95bfea8e0ce3c0500c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f40a8fe019f498fbaf46e2607ea0211/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Egypt is building a wall and is leveling land near its border with the Gaza Strip ahead of a planned Israeli offensive targeting the border city of Rafah, satellite images analyzed Friday by The Associated Press show.",
      "publishedAt": "2024-02-16T10:24:00Z",
      "title": "Satellite photos show Egypt building a wall near Gaza Strip as Israeli offensive on Rafah looms",
      "url": "https://apnews.com/07a40fddeaf9dbc82c2a33e1f1614419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84cb8db754c5454297120abb521afd80/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Ukrainian President Volodymyr Zelenskyy signed a bilateral security agreement with Germany and planned to sign another with France on Friday, securing a strong signal of long-term backing as Kyiv works to shore up Western support nearly two years after Russia launched its full-scale war.",
      "publishedAt": "2024-02-16T07:58:13Z",
      "title": "Ukraine's Zelenskyy signing security agreements with Germany, France as Kyiv shores up support",
      "url": "https://apnews.com/eefc83817062c5bb5d7a9e16a276aeaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75bd04d0c5bb414899b21e60da6b5b30/2386.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and LISA MASCARO",
      "description": "WASHINGTON (AP) — An FBI informant has been charged with fabricating a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company, a claim that is central to the Republican impeachment inquiry in Congress.",
      "publishedAt": "2024-02-15T22:14:37Z",
      "title": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company",
      "url": "https://apnews.com/6969656f6012780a23a4b8841ce2689b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6bccbc748d04117b52440f32919e136/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH, SCOTT McFETRIDGE and JOSH FUNK",
      "description": "KANSAS CITY, Mo. (AP) — As Kansas City tries to recover after the mass shooting that turned a Super Bowl celebration into chaos, police are working with juvenile prosecutors to determine what happens next with the two young people in custody.",
      "publishedAt": "2024-02-16T14:38:12Z",
      "title": "Kansas City tries to recover after mass shooting at Super Bowl celebration",
      "url": "https://apnews.com/278e2d3e2cfece1cbe958511e54127ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fe37f93397d48d195cc3f55a1102b7b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}