{
  "articles": [
    {
      "author": "RYAN PEARSON",
      "description": "He left his Los Angeles-area home to cover the wildfires, but the flames were barreling toward his front door. A Los Angeles-based entertainment video editor for The Associated Press, Ryan Pearson's home was among the thousands that burned in the California wildfires last week.",
      "publishedAt": "2025-01-16T05:10:43Z",
      "title": "He left his LA-area home to cover the wildfires. But the flames were barreling toward his front door",
      "url": "https://apnews.com/article/california-wildfires-house-burn-loss-bde3a056407fcd639fbf7cfdeb26ab8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ea00e9/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fee%2Ff5706d7fcd25591750238e04f270%2Fa4110e05b73646979a8f978d66ca6ffa"
    },
    {
      "author": "MARK THIESSEN",
      "description": "Dalyce Curry, or Momma Dee to her family, had a large personality and her granddaughter says there's no other way to describe her other than fabulous. The 95-year-old Curry was among at least 25 victims of the devastating California wildfires, dying at her home in Altadena. Born in 1929 in Little Rock, Arkansas, that big personality had be to be destined for Hollywood. She settled in Los Angeles, where she never became a star but was fortunate enough to rub shoulders with some of the elites of Hollywood,, including backing up singer Pearl Bailey and being an extra in several movies. She was also mentored by the first Black woman to ever sign a movie contract.",
      "publishedAt": "2025-01-15T20:30:24Z",
      "title": "95-year-old grandmother with ties to old Hollywood among California fire victims",
      "url": "https://apnews.com/article/california-fire-victim-hollywood-extra-1b1fb3385aca3b3f922f12a588b87fc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/579ea98/2147483647/strip/true/crop/2592x1458+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F71%2Fb397d7b4646d43b8b6d1a43290a0%2Ff62d97ae6ca04abca576a4fd03693e77"
    },
    {
      "author": "MICHAEL R. BLOOD, JAIMIE DING",
      "description": "Heartbroken families, burned-out business owners and beleaguered Los Angeles leaders are beginning to ponder a monumental task: rebuilding what was lost in the Southern California wildfires. Even with the flames of two large fires still leaping, government officials are talking of the vast job of clearing toxic debris. Then it will be rebuilding homes, restaurants, schools, boutiques and houses of worship in devastated communities. All the while, finding financing for it all. LA County Supervisor Kathryn Barger says homeowners are saying that rebuilding is a question of when, not if. Much remains unknown: What should the neighborhoods look like? And will fire-resistant materials and designs be used?",
      "publishedAt": "2025-01-16T05:02:31Z",
      "title": "As flames linger, talk turns to rebuilding Los Angeles neighborhoods leveled by wildfires",
      "url": "https://apnews.com/article/los-angeles-wildfires-southern-california-15199a02942f11f6a1b7aac340f7e9a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c23438/2147483647/strip/true/crop/5681x3196+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fd2%2Ff49056cda0158aae36ee6627799a%2Fbe8c2384bca84f5db6a384ac95935bc4"
    },
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE",
      "description": "The National Weather Service's warning about the “particularly dangerous situation” in which any new fire could explode in size in the Los Angeles area didn’t mention fire tornadoes. But meteorologist Todd Hall says they're possible given the extreme conditions. Fire whirl, fire devil, fire tornado or even firenado — scientists, firefighters and regular folks use multiple terms to describe similar phenomena, and they don’t always agree on what’s what. Some say fire whirls are formed only by heat, while fire tornadoes involve clouds generated by the fire itself. In 2018, a fire tornado the size of three football fields killed a firefighter near Redding, California. Across the country, scientists are studying the fire whirls in a lab in Massachusetts.",
      "publishedAt": "2025-01-15T05:08:04Z",
      "title": "Fire tornadoes a risk under California extreme wildfire conditions",
      "url": "https://apnews.com/article/firenado-fire-tornado-california-wildfire-dd53971839343ff6737156af3b983d0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3204b9/2147483647/strip/true/crop/5097x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F9e%2F38e17d15a35fc8408adaf1529b8c%2F14c6c486a3a1408f99da4a194fb71c32"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Prime Minister Benjamin Netanyahu said that a “last minute crisis” with Hamas was holding up Israeli approval of the agreement to pause the fighting in the Gaza Strip and release dozens of hostages.",
      "publishedAt": "2025-01-15T11:50:00Z",
      "title": "Israel-Hamas ceasefire live updates: Netanyahu says ‘last-minute crisis’ is holding up approval",
      "url": "https://apnews.com/live/israel-hamas-ceasefire-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c6bfa1/2147483647/strip/true/crop/4965x2793+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F03%2Fc18e3d2b4ca395fd1281299abcf5%2Fap25016513897703.jpg"
    },
    {
      "author": "MATTHEW LEE, AAMER MADHANI, ELLEN KNICKMEYER",
      "description": "President Joe Biden and President-elect Donald Trump are both claiming credit for Israel and Hamas agreeing to a ceasefire deal in Gaza after the White House brought Trump’s Middle East envoy into negotiations that have dragged on for months. Trump wasted no time in claiming to be the moving force behind the deal, saying it “could have only happened as a result of our Historic Victory in November.” Biden stressed that the deal was reached under “the precise contours” of a plan that he set out in late in May.",
      "publishedAt": "2025-01-15T19:08:34Z",
      "title": "Trump and Biden both claim credit for Gaza ceasefire deal",
      "url": "https://apnews.com/article/gaza-ceasefire-trump-biden-israel-hamas-0e6c324ba0e3e9413bafe740fdefebc6",
      "urlToImage": "https://dims.apnews.com/dims4/default/aad6aa3/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F8b%2F4477aae0ba95835bda46f5105e8a%2F77414e91f27c4237961e1a508515d4fc"
    },
    {
      "author": "MELANIE LIDMAN, SAM MEDNICK, WAFAA SHURAFA",
      "description": "The ceasefire announced between Israel and Hamas gives hope to families of hostages and war-weary Palestinians — but their nightmare is far from over. Families of the hostages do not know whether their loved ones are alive or dead, and many will have to wait for a subsequent phase of the agreement that has yet to be negotiated. In war-ravaged Gaza, many displaced Palestinians do not know if their homes are still standing. Thousands are still buried under rubble and dozens are missing after encounters with Israeli forces. Vast areas appear uninhabitable, and it could take decades to rebuild. In the tense leadup to the announcement of the deal, relatives of the hostages were afraid to get their hopes up and agonizing over the unknown.",
      "publishedAt": "2025-01-15T14:55:38Z",
      "title": "Families in Israel and Gaza awaited truce in agony",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-displaced-waiting-5a4fde9e5527b682dccb6466cb48ce83",
      "urlToImage": "https://dims.apnews.com/dims4/default/d258437/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F79%2F54ddd25e1ac4a32f6fe5c66fa723%2F4d3c837f50a74ea683919171a231b313"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA, SAMY MAGDY",
      "description": "Prime Minister Benjamin Netanyahu said Thursday that a “last minute crisis” with Hamas was holding up Israeli approval of a long-awaited agreement to pause the fighting in the Gaza Strip and release dozens of hostages. Israeli airstrikes meanwhile killed dozens of people across the war-ravaged territory. Netanyahu’s office said his Cabinet won’t meet to approve the agreement until Hamas backs down, accusing it of reneging on parts of the agreement in an attempt to gain further concessions. U.S. President Joe Biden and key mediator Qatar announced the deal on Wednesday, which is aimed at releasing scores of hostages held in Gaza and winding down a 15-month war that has destabilized the Middle East and sparked worldwide protests.",
      "publishedAt": "2025-01-16T08:43:40Z",
      "title": "Israel PM Netanyahu says Cabinet won't meet over Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd11b00/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F59%2F59296f6b288a051cf8c9c7dcfe0e%2F146026970d744e6bae6cfc5ea3be8137"
    },
    {
      "author": "LINLEY SANDERS, AMELIA THOMSON-DEVEAUX",
      "description": "Many U.S. adults are skeptical about President-elect Donald Trump's ability to bring down costs. An Associated Press-NORC Center for Public Affairs Research poll shows only about 2 in 10 Americans are “extremely” or “very” confident the Republican will be able to make progress on lowering the cost of groceries, housing or health care this year. The poll shows about 2 in 10 Americans are “moderately” confident. Faith in Trump's ability to create jobs is a little higher: About 3 in 10 Americans are “extremely” or “very” confident he’ll make progress on this in 2025.",
      "publishedAt": "2025-01-16T12:01:19Z",
      "title": "Many Americans doubt Trump will be able to lower prices in his first year, an AP-NORC poll shows",
      "url": "https://apnews.com/article/trump-inauguration-economy-inflation-prices-costs-immigration-35d8451c2a866b21776e50761b5634f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/907df55/2147483647/strip/true/crop/5665x3187+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F65%2Ff4e1e4779deba00c2c1a236b7827%2Fc9272717f395442588c351931d9e9984"
    },
    {
      "author": "JONATHAN J. COOPER, KEVIN S. VINEYS",
      "description": "California, Illinois and New York are shrinking. Texas and Florida are growing rapidly. With America’s population shifting from reliably Democratic states to areas controlled by Republicans, Democrats are facing a demographic time bomb that could reduce their path to winning the U.S. House or the presidency for the long term. If current trends hold through the 2030 census, states that voted for Kamala Harris will lose around a dozen House seats — and Electoral College votes — to states that voted for President-elect Donald Trump. Democrats’ path to 270 Electoral College votes, the minimum needed to win the White House, will get much steeper.",
      "publishedAt": "2025-01-16T05:02:55Z",
      "title": "Democrats are threatened by shrinking blue states",
      "url": "https://apnews.com/article/electoral-college-democrats-2030-census-election-republican-0d3c8e8d34cbfc87412a21796dddbd38",
      "urlToImage": "https://dims.apnews.com/dims4/default/416ba34/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fa8%2F3fdf8ff04f655b3a69311dca28f8%2F2a12d4c4261249d3a6530be812448c18"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}