{
  "articles": [
    {
      "author": null,
      "description": "British Prime Minister Keir Starmer is meeting with Ukrainian President Volodymyr Zelenskyy in London. The visit Thursday follows Zelenskyy's virtual meetings with U.S. President Donald Trump and European leaders a day earlier. Trump assured the leaders he would prioritize a ceasefire in Ukraine during his meeting with Russian President Vladimir Putin in Alaska on Friday. European leaders, including German Chancellor Friedrich Merz and French President Emmanuel Macron, called the discussions constructive. However, some Ukrainians remain skeptical about achieving meaningful progress. Meanwhile, Russian strikes in Ukraine's Sumy and Kherson regions have injured several people, including children.",
      "publishedAt": "2025-08-14T08:17:22Z",
      "title": "Zelenskyy and Starmer meet in London ahead Trump-Putin summit",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-putin-838f844639657d51dd4b195d8c2f417c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3eaff54/2147483647/strip/true/crop/4368x2457+0+228/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Ff1%2Fbb57d0c21e4c04ba3cfae30a5a0b%2F3c9311f961ec4a54a789e0eec1df7c76"
    },
    {
      "author": null,
      "description": "President Donald Trump’s meeting in Alaska with Vladimir Putin could be a decisive moment in the war in Ukraine and in the U.S. leader’s anomalous relationship with his Russian counterpart. Trump has long boasted that he’s always gotten along well with Putin and spoken admiringly of him, even praising him as “pretty smart” for invading Ukraine. But in recent months, he’s expressed open frustrations with Putin and called him “CRAZY” while threatening to impose sanctions on Russia. Still, Trump’s self-imposed deadline for sanctions came and went without any announced penalties or explanation from the White House and the Republican president, tempering expectations for their Friday summit.",
      "publishedAt": "2025-08-14T04:06:00Z",
      "title": "Trump's relationship with Putin is spotlighted in Alaska amid Ukraine war",
      "url": "https://apnews.com/article/trump-putin-relationship-over-years-d7a6c5400d9ec88127d16278be07a145",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcce3f3/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F4f%2Fdf82e1cb246260425f733ae75fb3%2Fe3e41cac1bc44ccb9b330b84a665cc11"
    },
    {
      "author": null,
      "description": "Israel’s far-right finance minister has announced a contentious new settlement construction in the Israeli-occupied West Bank, which Palestinians and rights groups worry will scuttle plans for a future Palestinian state by effectively cutting the West Bank into two separate parts. The announcement comes as many countries said they would recognize a Palestinian state in September. Finance Minister Bezalel Smotrich said, “This reality finally buries the idea of a Palestinian state, because there is nothing to recognize and no one to recognize.”",
      "publishedAt": "2025-08-14T09:34:16Z",
      "title": "Israel announces West Bank settlement that rights groups say could imperil Palestinian state",
      "url": "https://apnews.com/article/israel-west-bank-settlement-smotrich-palestinian-state-3b048633b41ac2c61206675fbf73d197",
      "urlToImage": "https://dims.apnews.com/dims4/default/3842f63/2147483647/strip/true/crop/3844x2162+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F35%2F66312b84824005dfce471e9132dc%2F55e13543b0e146edbc8c38519c01a5e0"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu claims there is no hunger in Gaza, but malnourished children are regularly arriving at Nasser Hospital. The U.N. says starvation and malnutrition in Gaza are at the highest levels since the war began. The Gaza Health Ministry says 171 people have died of malnutrition-related causes since July 1, a quarter of them children. Aid has increased in recent weeks, but food remains scarce or unaffordable for many. While the influx of food might help much of Gaza’s population, experts say that is not necessarily the case for children who are already severely malnourished. They often require treatment first at a hospital, where vital micronutrients must be replenished before their bodies will be able to properly metabolize food.",
      "publishedAt": "2025-08-14T14:41:17Z",
      "title": "A Gaza hospital sees rising numbers of malnourished children",
      "url": "https://apnews.com/article/palestinians-gaza-children-starvation-israel-netanyahu-0549e843c24fe7f20f1e7ce085502450",
      "urlToImage": "https://dims.apnews.com/dims4/default/069e454/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2Fa7%2F5685024b54b54436e2ed4ad93a9e%2F80396af768774f758cace47bcc17f978"
    },
    {
      "author": null,
      "description": "Advocacy organizations are helping clear out homeless encampments in advance of an anticipated crackdown. Under a ramp-up of President Donald Trump’s takeover of city police, a multiagency flood of federal law enforcement has become increasingly high profile in the nation’s capital. National Guard troops and Humvees are guarding some Washington landmarks. Troops were also stationed outside the Union Station transportation hub. Federal officials say they will help with missions like monument security and traffic control and won't be armed. About a dozen unhoused residents in Washington packed up their belongings Thursday with help from volunteers from some city agencies.",
      "publishedAt": "2025-08-14T17:31:30Z",
      "title": "Washington homeless encampments clear out under Trump threat of a crackdown",
      "url": "https://apnews.com/article/washington-trump-homeless-national-guard-police-a0d326fcd3731c564c2c566893385674",
      "urlToImage": "https://dims.apnews.com/dims4/default/eadaa28/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F8e%2F677c42b1f934c16c88698a4a2dc7%2F380018a200db43c197e25a02abdc2aa6"
    },
    {
      "author": null,
      "description": "Justice Department indictments have been unsealed against three leaders and two high-ranking enforcers of Mexico's United Cartels. It's the latest U.S. move against major Mexican drug operations. United Cartels is an umbrella organization made up of smaller cartels that have worked for different groups over time. The organization holds a fierce grip over the western state of Michoacan, Mexico. The U.S. government on Thursday said it's offering a reward of up to $10 million for information leading to the arrest of United Cartels’ top leader, Juan José Farías Álvarez, along with multimillion rewards for the four others. All five are believed to be in Mexico.",
      "publishedAt": "2025-08-14T14:56:45Z",
      "title": "US charges 5 cartels leaders and enforcers of a big Mexican drug operation",
      "url": "https://apnews.com/article/justice-department-drug-cartels-mexico-428cb8ad6180057e37baf6f34e36f68c",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e1cb38/2147483647/strip/true/crop/5842x3286+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F2b%2F05a2303594eabb112913885d90db%2Fc25e267731a24379a5406c75ce248b2a"
    },
    {
      "author": null,
      "description": "Florida Republican Gov. Ron DeSantis’ administration is preparing to open a second immigration detention facility at a state prison in north Florida, as a federal judge decides the fate of the state’s holding center for immigrants at an isolated airstrip in the Florida Everglades dubbed “Alligator Alcatraz.” DeSantis announced Thursday that the new facility is to be build at the Baker Correctional Institution, a state prison about 43 miles (69 kilometers) west of Jacksonville, and is expected to house 1,300 immigration detention beds, though that capacity could be expanded to 2,000, state officials said.",
      "publishedAt": "2025-08-14T14:03:30Z",
      "title": "DeSantis announces plans for second immigration detention facility in north Florida",
      "url": "https://apnews.com/article/florida-immigration-detention-center-desantis-dce8b6b8f634152a604eb06bfc2fb461",
      "urlToImage": "https://dims.apnews.com/dims4/default/32e442d/2147483647/strip/true/crop/5663x3185+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F0f%2F99ea9ae2323aef935c656f7a4dbd%2F409a87f8cb044d2cbc9ef38a5e029fbb"
    },
    {
      "author": null,
      "description": "COVID-19 activity is rising in much of the country. Data shows overall respiratory virus spread is very low in the U.S. But COVID-19 is rising in most states, with more people of all ages going to emergency rooms because of it. The stratus variant is most common. It can cause a “razor blade” sore throat and is considered a “variant under monitoring” by the World Health Organization, but it is only marginally better at evading people’s immune systems. Flu and RSV activity remain very low. Doctors say hot summer weather can drive people indoors where respiratory viruses like to spread.",
      "publishedAt": "2025-08-14T16:39:42Z",
      "title": "What to know about summer colds and the COVID-19 variant named stratus",
      "url": "https://apnews.com/article/covid19-stratus-nimbus-razor-blade-flu-summer-9c9522e398956c528a89e04a24244cf1",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c4ec59/2147483647/strip/true/crop/3504x1971+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2Fe4%2F4b0f0f808ff1233f6fae5c134dd4%2F8319ba0f2ce545fc90d5f0acfa35df1a"
    },
    {
      "author": null,
      "description": "Most stocks are falling on Wall Street after a disappointing report said inflation was worse last month at the U.S. wholesale level than economists expected. Three out of every four stocks in the S&P 500 index dropped on Thursday, though gains for some influential Big Tech companies helped mask the losses. The index slipped 0.1% from its all-time high set the day before. The Dow dipped 79 points, while the Nasdaq composite was virtually unchanged. The hotter-than-expected inflation report forced traders to second guess the widespread consensus that the Federal Reserve will deliver some relief next month by cutting interest rates.",
      "publishedAt": "2025-08-14T04:24:12Z",
      "title": "Most U.S. stocks fall following a disappointing update on inflation",
      "url": "https://apnews.com/article/asia-shares-japan-bessent-wall-street-02e8aa1fa772ad3570249dc81f917325",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd66e2c/2147483647/strip/true/crop/5552x3123+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fc0%2F4fd16616eaff383b8805efbe6c12%2Fd9b8c446798b48ec86290ff3506b246e"
    },
    {
      "author": null,
      "description": "Ohio State and Pittsburgh each placed three players on The Associated Press All-Time All-America football team and four other schools have two players each on the first team. The unveiling of the all-time team is part of the news organization’s celebration of the 100th anniversary of the AP All-America team. The Big Ten led all conferences with seven selections, two more than the Southeastern Conference. A panel of 12 AP sports writers who cover college football selected the all-time team. It cannot be considered definitive. There have been far more great players over the last century than spots available.",
      "publishedAt": "2025-08-14T16:05:06Z",
      "title": "Ohio State and Pittsburgh shine on AP All-Time All-America team",
      "url": "https://apnews.com/article/ap-college-football-allamerica-a7e5c1c4fde40a6c361f058878cf3354",
      "urlToImage": "https://dims.apnews.com/dims4/default/6de2186/2147483647/strip/true/crop/2185x1229+0+113/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F07%2F775b6dea12dfbe20d6a78ac7799d%2F7a14a8914d0e4544aa1715c3ae3c355e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}