{
  "articles": [
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "CHICAGO (AP) — Minnesota Gov. Tim Walz accepted his party's nomination for vice president Wednesday night, using his Democratic National Convention address to thank the packed arena for “bringing the joy” to an election transformed by the elevation of his running mate, Vice President Kamala Harris.",
      "publishedAt": "2024-08-21T10:27:26Z",
      "title": "Harris' running mate Tim Walz talks of 'bringing the joy' in his national introduction at DNC",
      "url": "https://apnews.com/4f299bd2684c0284dd100f7f0731172f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7de0ed2309f14e99b48ef1c777c3d2c5/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and NICHOLAS RICCARDI",
      "description": "CHICAGO (AP) — The Democratic National Convention's third night showcased a familiar former president, Bill Clinton, and introduced more Americans to Minnesota Gov.",
      "publishedAt": "2024-08-22T01:21:50Z",
      "title": "Walz's night, Bill Clinton's dig at Trump, influencers flexing clout. DNC Day 3 takeaways",
      "url": "https://apnews.com/f3d10a4e9fc2af2817cd8829210fc861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49b7f86632bb4029a122e3a5b8b235f4/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "The parents of a 23-year-old American taken hostage by Hamas during the Oct. 7 attack on Israel gave a moving speech Wednesday at the Democratic National Convention, pleading for the release of the dozens of people who continue to be held captive in Gaza.",
      "publishedAt": "2024-08-22T01:12:46Z",
      "title": "Parents of American held by Hamas appeal for hostages' release during Democratic convention",
      "url": "https://apnews.com/8beec50f25edfef0c2430655291254df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3fc703a945d4b29b2e872cbfab8f876/2755.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Key mediator Egypt expressed skepticism Wednesday about the proposal meant to bridge gaps in cease-fire talks between Israel and Hamas as more details emerged a day before negotiations were expected to resume in Cairo.",
      "publishedAt": "2024-08-21T14:36:39Z",
      "title": "Key mediator Egypt expresses skepticism about the Gaza cease-fire proposal as more details emerge",
      "url": "https://apnews.com/4153fa5fe0daf904f570f4e73f31d2c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/136fe8a5e91d41999694aa96465d8a1f/1920.jpeg"
    },
    {
      "author": "ROB GILLIES and JOSH FUNK",
      "description": "TORONTO (AP) — Both of Canada’s major freight railroads have come to a full stop because of a contract dispute with their workers, an impasse that could bring significant economic harm to businesses and consumers in Canada and the U.S.",
      "publishedAt": "2024-08-21T17:52:21Z",
      "title": "Labor dispute stops Canada's major freight railroads, could cause major economic disruption in US",
      "url": "https://apnews.com/a8b705c9b2e69bb8a8bc97d28f0be23c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/267e743ec91f45b0aefc46dd9abdd469/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Some new Ukrainian soldiers refuse to fire at the enemy. Others, according to commanders and fellow fighters, struggle to assemble weapons or to coordinate basic combat movements.",
      "publishedAt": "2024-08-22T04:10:49Z",
      "title": "Poorly trained recruits contribute to loss of Ukrainian territory on eastern front, commanders say",
      "url": "https://apnews.com/ed2d06ad529e3b7e47ecd32f79911b83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e760302532644e5f8d514e907892b01f/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Indian Prime Minister Narendra Modi is set to meet with Ukrainian President Volodymyr Zelenskyy in a historic visit Friday to Ukraine, a month and a half after he traveled to Moscow to hold talks with President Vladimir Putin.",
      "publishedAt": "2024-08-22T04:23:05Z",
      "title": "India's Modi visits Ukraine this week, after a recent trip to Moscow. Here's what it could mean",
      "url": "https://apnews.com/3140f2f1b9b3c0e6c910f2afcedd0337",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/054eb16048614385ae5724b44616cadf/3000.jpeg"
    },
    {
      "author": "OMER FAROOQ",
      "description": "HYDERABAD, India (AP) — A big explosion triggered a fire in a pharmaceutical plant in southern India, killing at least 15 workers, police said Thursday.An additonal 40 people were injured in the blast and the fire in the chemical reactor of the plant in Andhra Pradesh state Wednesday and were hospitalized, police officer M.",
      "publishedAt": "2024-08-22T03:52:04Z",
      "title": "Explosion and fire at a pharmaceutical plant in India kill at least 15 workers and injure 40",
      "url": "https://apnews.com/0fbda5eaf8276d476ed4f189cf64f987",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3fe7f17d8214b199ee34e569549e5df/2000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "ASHEBORO, N.C. (AP) — At his first outdoor rally since last month’s attempted assassination, Donald Trump spoke from behind bulletproof glass Wednesday in North Carolina at an event focused on national security.",
      "publishedAt": "2024-08-21T16:31:56Z",
      "title": "Trump speaks from behind bulletproof glass at first outdoor rally since his attempted assassination",
      "url": "https://apnews.com/60de08931c1a964e8e1fb21d3778d35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/760e66dbea8747db9c8e0cb17b8b4dbd/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Backstage at a celebration of Indigenous peoples in Mexico City's sprawling central square, Carlos CGH traced his fingers across a black and red “gabán,” which is similar to a poncho.",
      "publishedAt": "2024-08-22T05:44:28Z",
      "title": "In Mexico, an Indigenous Triqui artist embraces his roots through contemporary rap",
      "url": "https://apnews.com/171e79cafef8eab83034d69bc4f868ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb640cb3fe7b408ba389ebe7d2298a38/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}