{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The U.S. House voted Tuesday to impeach Homeland Security Secretary Alejandro Mayorkas, with the Republican majority determined to punish the Biden administration over its handling of the U.S-Mexico border after failing last week in a politically embarrassing setback.",
      "publishedAt": "2024-02-13T05:02:38Z",
      "title": "GOP-led House impeaches Homeland Security Secretary Mayorkas — by one vote — over border management",
      "url": "https://apnews.com/80cbd5bbb8f512c6814f155f825a1214",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac9b35e43537483eb3763ebe4b7167f5/2811.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "Democrat Tom Suozzi won a special election for a U.S. House seat in New York on Tuesday, coming out on top in a politically mixed suburban district in a victory that could lift his party’s hopes heading into a fiercely contested presidential election later this year.",
      "publishedAt": "2024-02-13T05:16:51Z",
      "title": "Democrat Tom Suozzi wins New York race to succeed George Santos in Congress",
      "url": "https://apnews.com/be0140979ca3050921579e90507bfe1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6d14c7cd67f4ca6b6a6fcd2ea65f86a/3000.jpeg"
    },
    {
      "author": null,
      "description": "RAFAH, Gaza Strip (AP) — Ibrahim Hasouna trudged over the rubble of the destroyed house, pointing out where family moments had taken place — where his mother and sister-in-law used to sleep, where he played with his 5-year-old nieces, where he helped his 1-year-old nephew take his first steps.",
      "publishedAt": "2024-02-13T21:47:52Z",
      "title": "Airstrike from Israeli hostage rescue wipes out entire Palestinian family in Gaza border town",
      "url": "https://apnews.com/3f28892cf94c5b5c4e64f3f449c8a6f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d488934e75c1428aa6f5a6b903ba86ce/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY, NAJIB JOBAIN and TIA GOLDENBERG",
      "description": "CAIRO (AP) — Israel and Hamas are making progress toward another cease-fire and hostage-release deal, officials said Tuesday, as negotiations went on and Israel threatened to expand its offensive to Gaza's southern edge, where some 1.4 million Palestinians have sought refuge.",
      "publishedAt": "2024-02-13T11:22:06Z",
      "title": "Israel and Hamas are making progress in cease-fire and hostage-release talks, officials say",
      "url": "https://apnews.com/1a0509346f4725ed40d1422808fed076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5436a3dd8e94c63972e22f086c67a66/1920.jpeg"
    },
    {
      "author": "NINIEK KARMINI and JIM GOMEZ",
      "description": "JAKARTA, Indonesia (AP) — Indonesian voters were choosing a new president Wednesday as the world’s third-largest democracy aspires to become a global economic powerhouse a quarter-century after shaking off a brutal dictatorship.",
      "publishedAt": "2024-02-13T17:53:31Z",
      "title": "Indonesian voters are choosing a new president in one of the world's largest elections",
      "url": "https://apnews.com/dd732adb2d0f3b674fc92aee4f547c6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bce3af8387345fdacd904411ab6b570/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA and ELLIOT SPAGAT",
      "description": "WASHINGTON (AP) — Arrests for illegal crossings on the U.S. border with Mexico fell by half in January from record highs in December to the third lowest month of Joe Biden's presidency, authorities said Tuesday.",
      "publishedAt": "2024-02-14T00:02:44Z",
      "title": "Illegal border crossings from Mexico plunge after a record-high December, with fewer from Venezuela",
      "url": "https://apnews.com/1c6e9f612dff721191c0254f980947a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f4f1b5a5bb450988f718a86d9f036b/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — In pushing Michael Whatley as the next leader of the Republican National Committee, Donald Trump zeroed in on the North Carolina GOP chairman's dedication to “election integrity,\" baselessly suggesting he would ensure the 2024 race “can't be stolen.”",
      "publishedAt": "2024-02-13T23:45:05Z",
      "title": "Trump's pick to lead the RNC is facing skepticism from some Republicans",
      "url": "https://apnews.com/b0c1714ac648bfa91b6ee72a30278266",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d8780e1790e4db5a4e9a6032d6eb095/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — The shooter who opened fire at a Houston megachurch before being gunned down by security officers used an AR-style rifle that police say she legally purchased despite a years-long criminal record, a history of mental illness and allegations she threatened to shoot her ex-husband.",
      "publishedAt": "2024-02-14T00:01:23Z",
      "title": "How Texas church shooter bought rifle despite mental illness and criminal history is under scrutiny",
      "url": "https://apnews.com/89c8b72d00c5a1f924907e0d5a85a8ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3925d3f8cb494e49902fa387ae0d45ed/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday said Donald Trump's comments calling into question the U.S. commitment to defend its NATO allies from attack were “dangerous” and “un-American,” seizing on the former president's comments that sowed fresh fears among U.S.",
      "publishedAt": "2024-02-13T19:52:45Z",
      "title": "Biden says Trump sowing doubts about US commitment to NATO is 'un-American'",
      "url": "https://apnews.com/b1ae8f4702e430d1995d40f3bc05ea06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d91a188aa3394ffd98b65c8e005d8376/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK, STEPHEN GROVES and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday called for House Republicans to urgently bring a $95.3 billion aid package for Ukraine, Israel and Taiwan to a vote, warning that refusal to take up the bill, passed by the Senate in the morning, would be “playing into Putin’s hands.”",
      "publishedAt": "2024-02-13T11:42:36Z",
      "title": "Biden warns opposing Ukraine funding plays 'into Putin's hands,' but faces resistance in House",
      "url": "https://apnews.com/5fdcf8cb1964681dcce0f4fe7b9a0f86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9edec8b6639240ada0b4ee066ed1ddce/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}