{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JOSEF FEDERMAN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces rescued two hostages early Monday, storming a heavily guarded apartment in a densely packed town in the Gaza Strip as airstrikes carried out to cover the raid killed more than 60 Palestinians, including women and children.",
      "publishedAt": "2024-02-12T02:48:20Z",
      "title": "Israeli forces rescue 2 hostages in dramatic Gaza raid that killed at least 67 Palestinians",
      "url": "https://apnews.com/4ade5edf47711c6b0c13d1380980de2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5647c50128a74a5cb8162ee1d16b9696/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, KEVIN FREKING and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Donald Trump's claim that he once told a NATO ally that he would encourage Russia “to do whatever the hell they want” to “delinquent” members of the group sent shockwaves through Europe over the weekend.",
      "publishedAt": "2024-02-12T23:58:19Z",
      "title": "Trump's threat to NATO allies draws little condemnation from GOP, reflecting his grip on the party",
      "url": "https://apnews.com/20e902788e8701999ce0424f73d478cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6bf47e0613344779326d0afd8fb3e67/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson late Monday sharply criticized a $95.3 billion aid package for Ukraine, Israel and other countries, casting serious doubts about the future of the package just as Senate leaders were slowly muscling it toward a final vote.",
      "publishedAt": "2024-02-13T02:00:33Z",
      "title": "House speaker casts doubts on Ukraine and Israel aid package as senators grind toward final vote",
      "url": "https://apnews.com/6970b539025d2de5ade9e3aff165c54f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71585f5fbc934f8085fbb60ccd2e3577/3000.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "The longest Super Bowl game will also go down as the most-watched program in television history.According to Nielsen and Adobe Analytics, Kansas City's 25-22 overtime victory over San Francisco on Sunday night averaged 123.4 million viewers across television and streaming platforms.",
      "publishedAt": "2024-02-13T03:41:28Z",
      "title": "Super Bowl thriller was the most-watched program ever, averaging 123.4 million viewers",
      "url": "https://apnews.com/e2f0288ea474bd564ee4df430e41b8bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/532b6be2b8814629a9cd160ec0813c4c/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Pakistan’s parliamentary elections left no clear winner.Allies of imprisoned ex-Prime Minister Imran Khan won the most seats in the lower house of parliament in the elections last Thursday.",
      "publishedAt": "2024-02-12T12:59:59Z",
      "title": "Pakistan's election left no clear winner. So who is likely to govern and what happens next?",
      "url": "https://apnews.com/089949a2f225c272aba2ba3000d7df5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/198a7dfc470f439fa76301fce6a2d0f5/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — Indonesia, the world’s third-largest democracy, will open its polls on Wednesday to nearly 205 million eligible voters in presidential and legislative elections, the fifth since Southeast Asia’s largest economy began democratic reforms in 1998.",
      "publishedAt": "2024-02-13T02:11:14Z",
      "title": "What’s at stake in Indonesia as the world’s third-largest democracy elects a new president?",
      "url": "https://apnews.com/ddcfd22da36645ed521c564421608405",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e79ba1724b3d41228c553c5332279aaf/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.",
      "publishedAt": "2024-02-12T13:21:06Z",
      "title": "Trump asks Supreme Court to put off his election interference trial, claiming immunity",
      "url": "https://apnews.com/60bd61263299a88e48d4005d70b6094f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d072711d824b08b562f6bfcbc4c7fb/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday launched a task force aimed at addressing the \"systemic\" problem of mishandling classified information during presidential transitions, days after a Justice Department special counsel’s sharply critical report said he had done just that.",
      "publishedAt": "2024-02-12T23:00:31Z",
      "title": "Biden forms task force to avoid mishandling of classified documents during presidential transitions",
      "url": "https://apnews.com/0962248067aa95ae129287c4b400f999",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d6bbb0e5e14b2196912cca0b3c9e13/3000.jpeg"
    },
    {
      "author": "JUAN LOZANO, ACACIA CORONADO AND JIM VERTUNO",
      "description": "HOUSTON (AP) — The shooter at a Texas megachurch on Sunday had a history of mental illness and brought their young son to the attack that was carried out using an AR-style rifle and ended in an exchange of gunfire with two off-duty officers, authorities said Monday.",
      "publishedAt": "2024-02-12T17:34:58Z",
      "title": "Shooter entered Texas megachurch with young son and used AR-style rifle in the attack, police say",
      "url": "https://apnews.com/d3c7011f83c57206dc2348cc33035c97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/537675e1c830497a9fabd73510ed8a53/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "HARTFORD, Conn. (AP) — Parts of the Northeast were preparing Monday for a coastal storm that was expected to pack high winds and dump a foot or more of snow in some areas, leading to school closures, warnings against road travel and the possible disruption of flights.",
      "publishedAt": "2024-02-12T19:44:07Z",
      "title": "Difficult driving, closed schools, canceled flights: What to expect from Northeast snowstorm",
      "url": "https://apnews.com/9a6c20e113d79059785e4d3d3b7ba344",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13580f7a88094ceab04205c8b8606590/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}