{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — US government announces criminal charges, seizure of internet domains arising from Russian effort to influence election.",
      "publishedAt": "2024-09-04T17:44:15Z",
      "title": "US government announces criminal charges, seizure of internet domains arising from Russian effort to influence election",
      "url": "https://apnews.com/fc508e22856ed09d44eb0c74ee04f016",
      "urlToImage": ""
    },
    {
      "author": "ERIC TUCKER and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration on Wednesday announced criminal charges, the seizure of internet domains and sanctions related to Russian disinformation efforts to influence the U.S. presidential election.",
      "publishedAt": "2024-09-04T15:50:04Z",
      "title": "US accuses Russia of using state media to spread disinformation before the November election",
      "url": "https://apnews.com/4888f4bfc61e46173101060ad0321d2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f91b7f37dd9498fa19577627292c98e/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Foreign Minister Dmytro Kuleba, one of Ukraine's most recognizable faces on the international stage, resigned Wednesday ahead of an expected reshuffling of government leaders. Russian strikes, meanwhile, killed seven people in a western city, a day after one of the deadliest missile attacks since the war began.",
      "publishedAt": "2024-09-04T06:29:42Z",
      "title": "Ukrainian foreign minister resigns ahead of expected reshuffling of government leaders",
      "url": "https://apnews.com/bb5195cc2df40d32bac374ece6dbc0b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd8ade71a2a1492a9c2567a802490871/1920.jpeg"
    },
    {
      "author": "JACK JEFFERY and JULIA FRANKEL",
      "description": "For more than a week, hundreds of Israeli forces have carried out the deadliest operation in the occupied West Bank since the war in Gaza began.",
      "publishedAt": "2024-09-04T12:32:28Z",
      "title": "What to know about Israel’s major weeklong raid in the West Bank city of Jenin",
      "url": "https://apnews.com/c1618cc024d8a5269486e266593b5434",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09d203d8e6fc48a8bb5fed95626ae4a2/3000.jpeg"
    },
    {
      "author": "PETER SMITH and MICHELLE R. SMITH",
      "description": "By his own account, Ohio Sen. JD Vance’s 2019 conversion to Catholicism provided a spiritual fulfillment he couldn’t find in his Yale education or career success. It also amounted to a political conversion.",
      "publishedAt": "2024-09-04T12:02:22Z",
      "title": "JD Vance's Catholicism helped shape his views. So did this little-known group of Catholic thinkers",
      "url": "https://apnews.com/7e37e43cb1976c516d642a95d495266a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baabf974c9184694b765796c8b5ab43d/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "WINDER, Ga. (AP) — A shooting at a Georgia high school Wednesday caused an unknown number of injuries and a suspect was arrested in a chaotic scene in which officers swarmed the campus and students rushed for shelter in the football stadium.",
      "publishedAt": "2024-09-04T15:56:03Z",
      "title": "Shooting at Georgia high school leads to unknown number of injuries",
      "url": "https://apnews.com/3969d34cf6a7adc787facf21c469ef4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95e4df61b34b40a7af45c079566d8f67/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis urged Indonesia to live up to its promise of “harmony in diversity” and fight religious intolerance on Wednesday, as he set a rigorous pace for an 11-day, four-nation trip through tropical Southeast Asia and Oceania that will test his stamina and health.",
      "publishedAt": "2024-09-04T04:53:19Z",
      "title": "The pope urges Indonesia to live up to its promise of 'harmony in diversity'",
      "url": "https://apnews.com/90b9bbc4f12f7e13a2d8951d6b4ebc67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea66ddac76dd4cec8c76cc3497c3bcb5/2884.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The world creates 57 million tons of plastic pollution every year and spreads it from the deepest oceans to the highest mountaintop to the inside of people's bodies, according to a new study that also said more than two-thirds of it comes from the Global South.",
      "publishedAt": "2024-09-04T15:08:09Z",
      "title": "The world is pumping out 57 million tons of plastic pollution a year",
      "url": "https://apnews.com/dd9ce2a092c5d5826a3436d9f47764c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c0fbbc3c96e4d2ead74104d4834dde5/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Donald Trump is betting that Americans crave trillions of dollars in tax cuts — and that growth will be so fantastic that it's not worth worrying about budget deficits.",
      "publishedAt": "2024-09-04T04:02:15Z",
      "title": "Raise taxes on the rich or cut them? Harris, Trump differ on how to boost the US economy",
      "url": "https://apnews.com/3ce44f07834bf211152029cde1319275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd44d4144c7c49e387e053bd608ad282/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "TULSA, Okla. (AP) — At the site of a race massacre that reduced neighborhoods to ashes a century ago, where murals memorialize a once-thriving “ Black Wall Street,” one African American mother strives to keep others from dying as they try to bring new life into the world.",
      "publishedAt": "2024-09-04T14:04:48Z",
      "title": "America is trying to fix its maternal mortality crisis with federal, state and local programs",
      "url": "https://apnews.com/0aa1fa2a141ef82607026b384cc14af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56dab6e22d30483f82035eefb752c5bf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}