{
  "articles": [
    {
      "author": "MOHAMMAD JAHJOUH",
      "description": "RAFAH, Gaza Strip (AP) — Sabreen Jouda came into the world seconds after her mother left it.Their home was hit by an Israeli airstrike shortly before midnight Saturday. Until that moment, the family was like so many other Palestinians trying to shelter from the war in Gaza's southernmost city of Rafah.",
      "publishedAt": "2024-04-21T19:55:46Z",
      "title": "A Palestinian baby in Gaza is born an orphan in an urgent cesarean section after an Israeli strike",
      "url": "https://apnews.com/19d46c47465a8bc8bb4c56f5247beccc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4904bccf6da0446180955b9e9de70474/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli leaders on Sunday harshly criticized an expected decision by the U.S. to impose sanctions on a unit of ultra-Orthodox soldiers in the Israeli military.The decision, expected as soon as Monday, would mark the first time the U.S.",
      "publishedAt": "2024-04-21T17:42:57Z",
      "title": "Israeli leaders criticize expected US sanctions against military unit that could further strain ties",
      "url": "https://apnews.com/dd18e8ebf07b937bdad09ce9b56bd0cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ece4e4b292004f99a2c4093ba1dd567d/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukrainian commander Oleksiy Tarasenko witnessed a frightening shift last month in Russia's efforts to punch through Kyiv’s defense of the industrial region known as the Donbas.",
      "publishedAt": "2024-04-22T04:16:14Z",
      "title": "Aid approval brings Ukraine closer to replenishing troops struggling to hold front lines",
      "url": "https://apnews.com/5b2cfac8351bff94d8c1ead8704110a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db59f4a23ef34c079c04049bd1b3888f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — For the first time in history, prosecutors will present a criminal case against a former American president to a jury Monday as they accuse Donald Trump of a hush money scheme aimed at preventing damaging stories about his personal life from becoming public.",
      "publishedAt": "2024-04-22T04:03:21Z",
      "title": "Prosecutors to make history with opening statements in hush money case against Trump",
      "url": "https://apnews.com/6beee9b99114898ee0dd60185d43bac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2cc35e3a5f491e9a278191a32d7da7/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "TRAVERSE CITY, Mich. (AP) — The group gathered inside the conference room, mostly women, fell silent as the audio recording began to play.The male voice, clearly agitated, railed against what he thought had been fraud that cost former President Donald Trump reelection four years ago.",
      "publishedAt": "2024-04-22T04:08:33Z",
      "title": "Local election workers fear threats to their safety as November nears. One group is trying to help",
      "url": "https://apnews.com/d2702ae1e1e57c766c3df36f1a7ff763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6276dcb5987746019eaf49a37f0ac8b0/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "NAPLES, Italy (AP) — Europe is the fastest-warming continent and its temperatures are rising at roughly twice the global average, two top climate monitoring organizations reported Monday, warning of the consequences for human health, glacier melt and economic activity.",
      "publishedAt": "2024-04-22T02:04:44Z",
      "title": "Europe is the fastest-warming continent, at nearly twice the average global rate, report says",
      "url": "https://apnews.com/d08b3bd028bc461f281f39828bd73056",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/641360b28165456f926f3f770cb2d629/3000.jpeg"
    },
    {
      "author": "GONZALO SOLANO",
      "description": "QUITO, Ecuador (AP) — Ecuador’s fledgling president got a resounding victory Sunday in a referendum that he touted as a way to crack down on criminal gangs behind a spiraling wave of violence.An official quick count showed that Ecuadorians overwhelmingly voted “yes” to all nine questions focused on tightening security measures, rejecting only two more controversial economic proposals.",
      "publishedAt": "2024-04-21T04:11:14Z",
      "title": "Ecuadorians vote overwhelmingly in referendum to approve toughening fight against gangs",
      "url": "https://apnews.com/85cf4190ba1bdd6028ff78180340499f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14798dcc407f49d6b55fe72da364535d/1920.jpeg"
    },
    {
      "author": "ANDREW MELDRUM and CHRISTOPHER WEBER",
      "description": "NEW YORK (AP) — Terry Anderson, the globe-trotting Associated Press correspondent who became one of America’s longest-held hostages after he was snatched from a street in war-torn Lebanon in 1985 and held for nearly seven years, has died at 76.",
      "publishedAt": "2024-04-21T21:15:03Z",
      "title": "Terry Anderson, AP reporter abducted in Lebanon and held captive for years, has died at 76",
      "url": "https://apnews.com/c266353298c04dbf874ab4d94536f2b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8542e81f57e247cfa79ffa80ae432b00/1920.jpeg"
    },
    {
      "author": "MOHAMEED SHARUHAN",
      "description": "MALE, Maldives (AP) — Maldives President Mohamed Muizzu's political party has swept parliamentary elections in a strong endorsement of his pro-China foreign policy, according to preliminary results reported Monday by local media.",
      "publishedAt": "2024-04-22T03:37:51Z",
      "title": "Pro-China President Muizzu's party sweeps Maldives parliamentary elections, preliminary results say",
      "url": "https://apnews.com/b14d47c13175e2bd3ec85fafeec2ddd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7e59bcefcb54ba0acfa50828dbec747/1620.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — China's sprawling capital city was new territory for Associated Press photographer Tatan Syuflana. Between covering high-ranking officials and capturing the pulse of daily life, the Jakarta-based photographer sought out glimpses of Beijing through windows, doorways and other portals.",
      "publishedAt": "2024-04-22T04:19:42Z",
      "title": "AP PHOTOS: Glimpses of Beijing through windows and doorways",
      "url": "https://apnews.com/56ddf0f538fc5542d7bffd51c5b6eebe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8c3d866a1c846b18a37604aa7cc68ac/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}