{
  "articles": [
    {
      "author": "ABDULRAHMAN SHAHEEN and ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — Syrians poured into streets echoing with celebratory gunfire on Sunday after a stunning rebel advance reached the capital, ending the Assad family's 50 years of iron rule but raising questions about the future of the country and the wider region.",
      "publishedAt": "2024-12-08T07:23:26Z",
      "title": "Jubilation and gunfire as Syrians celebrate the end of the Assad family's half-century rule",
      "url": "https://apnews.com/816e538565d1ae47e016b5765b044d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4668495aaab43d5a4fcebd723a53105/1920.jpeg"
    },
    {
      "author": "ZEINA KARAM and ABBY SEWELL",
      "description": "BEIRUT (AP) — Syrian President Bashar Assad fled the country on Sunday, bringing to a dramatic close his nearly 14-year struggle to hold onto control as his country fragmented in a brutal civil war that became a proxy battlefield for regional and international powers.",
      "publishedAt": "2024-12-08T05:11:00Z",
      "title": "The fall of Bashar Assad after 13 years of war in Syria brings to an end a decades-long dynasty",
      "url": "https://apnews.com/1468a97ff95bb782f5933856d99c9a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20ecebea421d40dab2c0ca91b99117a2/2000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Abu Mohammed al-Golani, the militant leader whose stunning insurgency toppled Syria’s President Bashar Assad, has spent years working to remake his public image, renouncing longtime ties to al-Qaida and depicting himself as a champion of pluralism and tolerance.",
      "publishedAt": "2024-12-08T11:46:31Z",
      "title": "Who is Abu Mohammed al-Golani, the leader of the insurgency that toppled Syria's Assad?",
      "url": "https://apnews.com/aab4c8894238904a4e351076726499fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/368d75a4811843c58ecf83fb3562c5eb/2232.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Police don't know who he is, where he is, or why he did it. As the frustrating search for UnitedHealthcare CEO Brian Thompson’s killer got underway for a fifth day Sunday, investigators reckoned with a tantalizing contradiction: They have troves of evidence, but the shooter remains an enigma.",
      "publishedAt": "2024-12-08T16:19:10Z",
      "title": "The hunt for UnitedHealthcare CEO's elusive killer yields new evidence, but few answers",
      "url": "https://apnews.com/81b07e0210486aea9d0864dd385ae9cb",
      "urlToImage": ""
    },
    {
      "author": "JOANNA KOZLOWSKA and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Donald Trump on Sunday called for an immediate cease-fire in Russia's war with Ukraine and the president-elect renewed warnings that he was open to pulling the United States out of NATO.",
      "publishedAt": "2024-12-08T12:02:22Z",
      "title": "Trump calls for 'immediate' cease-fire in Ukraine and says a US withdrawal from NATO is possible",
      "url": "https://apnews.com/e00a18db202ef74b38e009bb2a5381cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e915c489b5d4d5198eead7efaf2b527/1920.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and EVGENIY MALOLETKA",
      "description": "IZIUM, Ukraine (AP) — Hopes for victory, a swift end to the war and prayers for their loved ones' survival or return from Russian captivity are among the wishes scattered throughout letters sent to a volunteer group by Ukrainian children living in frontline areas.",
      "publishedAt": "2024-12-08T05:13:05Z",
      "title": "'Reindeer' volunteers bring holiday magic to Ukrainian children living on the frontlines",
      "url": "https://apnews.com/55edecb85450421ba69eda70c17ed307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3187b8dd3ef049fa8acbcbf5c6b8f27c/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean prosecutors on Sunday detained a former defense minister who allegedly recommended last week’s brief but stunning martial law imposition to President Yoon Suk Yeol, making him the first figure detained over the case.",
      "publishedAt": "2024-12-08T02:19:04Z",
      "title": "South Korean prosecutors detain ex-defense chief over martial law imposition",
      "url": "https://apnews.com/5bb4ed3108a9c7fb0ff1d01df924bf0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5bb4552d5de44fdbd898213c27bafea/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Shortly after Donald Trump’s win in last month’s U.S. election, Israeli Prime Minister Benjamin Netanyahu rushed to congratulate the president-elect: “History’s greatest comeback!” he gushed.",
      "publishedAt": "2024-12-08T05:18:13Z",
      "title": "Trump's return may be a boon for Netanyahu, but challenges abound in a changed Middle East",
      "url": "https://apnews.com/c5aebb98b47d6100c5bd3c5c7f945e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9074ed8c77834ca2b80e1fc663948ce5/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — At the Westonaria agricultural park near Bekkersdal, east of Johannesburg, farm workers are busy tilling the soil and planting tomatoes and lettuce.",
      "publishedAt": "2024-12-08T05:40:39Z",
      "title": "A farming project in South Africa is helping deaf people build skills and find jobs",
      "url": "https://apnews.com/3f560197d84b2329a60efd3c6d86e86e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a7e8c12c25d49ed909aef158c8cdabb/1920.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "Georgia moved up to No. 2 behind Oregon in The Associated Press Top 25 on Sunday, Texas and Penn State remained in the top five after losing conference championship games and Arizona State appeared in the top 10 for the first time in a decade.",
      "publishedAt": "2024-12-08T15:28:17Z",
      "title": "AP Top 25: Oregon, Georgia, Notre Dame, Texas top poll going into playoff; Tide ranked ahead of SMU",
      "url": "https://apnews.com/4d282d65a443355da8de3eea28138f0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e7dfb8a692643859c8279e67459e847/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}