{
  "articles": [
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "ATLANTA (AP) — Former President Donald Trump returns Saturday to Georgia, which he lost four years ago, to campaign in a state that both Democrats and Republicans see as up for grabs yet again.",
      "publishedAt": "2024-08-03T04:06:03Z",
      "title": "Trump and Vance return to Georgia days after a Harris event in the same arena",
      "url": "https://apnews.com/b21c25bbbfafdd0343c8812f6c3d7c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2936aabedfea4f70a49b4a03c085e840/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Democrats have unified with remarkable speed behind Vice President Kamala Harris as she has taken over the top of the party's ticket heading into the November presidential election.",
      "publishedAt": "2024-08-03T14:12:08Z",
      "title": "Some activists step up criticism of Shapiro and Kelly as Harris closes in on naming a running mate",
      "url": "https://apnews.com/be228f0efdb87954769232a4fb0f4362",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4d0357b5574c3399c43515588a8b1a/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "FARDIS, Lebanon (AP) — Alma Ayman Fakhr al-Din, a lively 11-year-old who loved basketball and learning languages, was playing on a soccer field a week ago in Majdal Shams, a Druze town in the Israeli-occupied Golan Heights, when the rocket hit.",
      "publishedAt": "2024-08-03T16:22:27Z",
      "title": "Horror at deaths of 12 children unites Druze across borders. But Mideast's wars tear at their bonds",
      "url": "https://apnews.com/cd1005be55b3893f0852e431643899bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2825540bfc640e8a81b838f830cf6d4/3000.jpeg"
    },
    {
      "author": "AREF TUFAHA and JACK JEFFERY",
      "description": "ZEITA, West Bank (AP) — Two Israeli airstrikes in the West Bank killed nine Palestinian militants on Saturday, Israel's army said, as violence flared again in the Israeli-occupied territory with tensions high over the war in Gaza and a potential regional escalation.",
      "publishedAt": "2024-08-03T09:46:00Z",
      "title": "Israel kills militants in the West Bank as a nervous region watches latest on cease-fire talks",
      "url": "https://apnews.com/4ccf2a50855866662cd21a0315395286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1df5144e3d5d44ce8ac70d8d8c0ba3c4/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CHAPIN, S.C. (AP) — Donald Trump says he is pulling out of a scheduled September debate with Vice President Kamala Harris on ABC and wants them to face off on Fox News, making it increasingly unlikely that the candidates will confront each other on stage before the November election.",
      "publishedAt": "2024-08-03T17:57:07Z",
      "title": "Trump says he'll skip an ABC debate with Harris in September and wants them to face off on Fox News",
      "url": "https://apnews.com/0d0be341bbe7877a71bfc4bed40610fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ea84cf4bdb446e9a00f6a65dcd552ce/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "VILLEPINTE, France (AP) — Boxer Imane Khelif of Algeria clinched a medal at the Paris Olympics in an emotional fight Saturday that followed days of sharp scrutiny and online abuse as misconceptions about her gender exploded into a larger clash about identity in sports.",
      "publishedAt": "2024-08-03T12:36:48Z",
      "title": "Algerian boxer Imane Khelif clinches medal at Olympics after outcry fueled by gender misconceptions",
      "url": "https://apnews.com/a3c7695f2efc635cfc7a5ba9e2ef01e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7187726c7774f5a89c400f3431ef1d2/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Simone Biles earned her seventh Olympic gold medal by soaring to victory in the women's vault final at the Paris Games on Saturday.",
      "publishedAt": "2024-08-03T14:18:16Z",
      "title": "Simone Biles captures her seventh Olympic gold medal by winning women's vault for a second time",
      "url": "https://apnews.com/92723dd60b8c0d7113ab401e85433f57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d77c0418c74444f923d571cc7ffe4fb/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — A tropical depression over Cuba is growing better organized, forecasters said Saturday, and is likely to bring drenching rain and coastal flooding to much of Florida's Gulf Coast.",
      "publishedAt": "2024-08-03T14:07:45Z",
      "title": "Forecasters expect depression to become Tropical Storm Debby as it nears Florida's Gulf Coast",
      "url": "https://apnews.com/dce34e4d691b2c12a386964f86215220",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f809c1753626486b876708cee46346f7/3000.jpeg"
    },
    {
      "author": "OMAR FARUK",
      "description": "MOGADISHU, Somalia (AP) — Police in Somalia said Saturday that 32 people died and 63 others were wounded in an attack on a beach hotel in the capital, Mogadishu, the previous evening. Al-Qaida’s East Africa affiliate, al-Shabab, said through its radio station that its fighters carried out the attack.",
      "publishedAt": "2024-08-03T09:04:56Z",
      "title": "Somali police say 32 people died in an attack on a beach hotel. Al-Shabab claimed responsibility.",
      "url": "https://apnews.com/62dad34358139d165905384a5971ba14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/461a10997f754cd3835cc6ee8d345ad3/1920.jpeg"
    },
    {
      "author": "DEVNA BOSE",
      "description": "Lauren Bell was stressed out and just starting her first job post-college in New York City when she realized a bout of food poisoning wasn’t going away after weeks. A doctor’s appointment revealed she had irritable bowel syndrome, a surprising diagnosis — until she learned more about the connection between mental health and gut health, as well as the prevalence of digestive problems among women.",
      "publishedAt": "2024-08-03T12:54:48Z",
      "title": "Younger adults are going public with their digestive problems. Experts say it's mostly a good thing",
      "url": "https://apnews.com/10d68f43e0244ada808b8c1c49acc6ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afd4174630524bf294912dc07a447fd1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}