{
  "articles": [
    {
      "author": "Steve Karnowski",
      "description": "A federal judge is set to hear arguments Monday on whether to pause an immigration crackdown in Minnesota. This follows the fatal shootings of two people by government officers. The state and the cities of Minneapolis and St. Paul sued the Department of Homeland Security two weeks ago. They want to restore conditions before the Trump administration's Operation Metro Surge began in December. Democratic Minnesota Attorney General Keith Ellison plans to attend the hearing. Justice Department attorneys have called the lawsuit legally frivolous. The case could have implications for other states facing similar immigration enforcement operations like that underway in Minnesota.",
      "publishedAt": "2026-01-26T05:11:53Z",
      "title": "Federal judge set to hear arguments on Minnesota immigration crackdown",
      "url": "https://apnews.com/article/shooting-minneapolis-protests-ice-immigration-lawsuit-5bd12d70d3c76bfe5eacd802ce7480a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/c56d0d1/2147483647/strip/true/crop/5248x3497+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F25%2F505ec4a3755c414299e05da3bf21%2F335fed26d1434608b70ccf5b2104bc48"
    },
    {
      "author": "Kate Brumback, Julie Walker",
      "description": "The Northeastern U.S. is getting the last brunt of a massive winter storm that dumped snow, sleet and ice across much of the southern and eastern U.S. over the weekend. The colossal storm halted air and road traffic in many areas and sent temperatures plunging. As the work week began, the heaviest snow was falling from New York northward into New England. That's after heavy ice snapped branches and power lines in the South, leaving hundreds of thousands of homes and businesses without electricity. In the meantime, arctic air was spreading in behind the storm and some communities in New York saw record-breaking subzero temperatures.",
      "publishedAt": "2026-01-26T05:01:03Z",
      "title": "Colossal storm dumps deep snow in Northeast after dropping sleet and ice in the South",
      "url": "https://apnews.com/article/winter-weather-storm-snow-ice-cbdc1977b810322baf976c91b622516b",
      "urlToImage": "https://dims.apnews.com/dims4/default/95cb7fa/2147483647/strip/true/crop/7732x5152+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Ff2%2F40b22522b0e4126d5f6422c3f20c%2F082caaf0fa7841939e372c71d7aa5c41"
    },
    {
      "author": "Julia Frankel, Samy Magdy",
      "description": "Israel says the remains of the final hostage in Gaza have been recovered, clearing the way for the next phase of the ceasefire that stopped the Israel-Hamas war. Monday’s announcement came a day after Israel’s government said the military was conducting a “large-scale operation” in a cemetery in northern Gaza to locate the remains of Ran Gvili. The return of all remaining hostages, living or dead, has been a key part of the Gaza ceasefire’s first phase, and Gvili’s family had urged Israel’s government not to enter the second phase until his remains were recovered and returned.",
      "publishedAt": "2026-01-26T11:22:06Z",
      "title": "Israel says the remains of final hostage in Gaza are recovered, key for ceasefire's next phase",
      "url": "https://apnews.com/article/israel-gaza-hamas-rafah-26-1-2026-c0b373a26ef7f4524b9b2bdad766cfda",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7c209a/2147483647/strip/true/crop/8067x5375+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F5e%2Fac5591763b9474be4cd34ccc189a%2F9b5d60d16e00445ca24eed4c4ca17a55"
    },
    {
      "author": "Jim Gomez",
      "description": "An inter-island ferry with more than 350 on board has sunk in the southern Philippines after midnight and rescuers have saved at least 316 passengers and retrieved 15 bodies. Officials say the M/V Trisha Kerstin 3, a cargo and passenger ferry, was sailing from the port city of Zamboanga to southern Jolo island in Sulu province with 332 passengers and 27 crew members early Monday when it apparently encountered technical problems and sank. Coast guard officials said the cause of the accident was not immediately clear, but noted that the boat was cleared by the coast guard before departing and did not appear to be overcrowded.",
      "publishedAt": "2026-01-25T22:49:47Z",
      "title": "Ferry sinks in Philippines with over 350 on board",
      "url": "https://apnews.com/article/philippines-ferry-sinking-passengers-772cfd1802a7ad0ca184869201772754",
      "urlToImage": "https://dims.apnews.com/dims4/default/c864124/2147483647/strip/true/crop/8533x5686+0+357/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F5d%2F13fb1674ed9e2f5845ad9099ded3%2F99f67f3acce84879b123f75d786bf1db"
    },
    {
      "author": null,
      "description": "The Federal Aviation Administration says a private aircraft with eight people on board has crashed on takeoff from Bangor International Airport in Maine. The Bombardier Challenger 600 crashed around 7:45 p.m. Sunday. There was no immediate word on the conditions of those aboard and an airport statement said the airport was closed and emergency crews were at the site. The FAA and the National Transportation Safety Board are investigating. The crash occurred as New England and much of the country grappled with a massive winter storm. Bangor had steady snowfall Sunday like much of the northeastern United States.",
      "publishedAt": "2026-01-26T03:02:18Z",
      "title": "Private jet carrying 8 crashes at Bangor, Maine, airport",
      "url": "https://apnews.com/article/plane-crash-maine-winter-weather-d963803b01c342c3d25d4071d79dba4e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d8ae33/2147483647/strip/true/crop/2386x1590+182+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Ff4%2Fa970bb3525d4f5dba3f86b3519d1%2F14c7fbb9757b4a5783bd60cf6139fed6"
    },
    {
      "author": null,
      "description": "Authorities say gunmen opened fire at a soccer field in central Mexico, killing at least 11 people and wounding 12 others. The attack happened Sunday at the end of a match in Salamanca. Ten people died at the scene, and another died at a hospital. A woman and a minor were among the wounded. Salamanca Mayor Cesar Prieto called the attack part of a \"crime wave\" and asked President Claudia Sheinbaum for help. The Guanajuato state prosecutor’s office is investigating and coordinating with federal authorities. Guanajuato had Mexico’s highest homicide total last year. Overall, Mexico’s government says the country's 2025 murder rate was the lowest since 2016, although analysts have cautioned that the numbers may not fully reflect the country’s violence.",
      "publishedAt": "2026-01-26T04:38:47Z",
      "title": "Gunmen open fire at soccer field in central Mexico",
      "url": "https://apnews.com/article/mexico-cartel-salamanca-guanajuato-sheinbaum-f25805cde730397abafeb73ac451c49f",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "E. Eduardo Castillo",
      "description": "China says it is investigating the army’s top general for suspected serious violations of discipline and law. Gen. Zhang Youxia was the highest military member just below President Xi Jinping. The Defense Ministry said Saturday that authorities were investigating Zhang, the senior of the two vice chairs of the powerful Central Military Commission. Authorities also are investigating Gen. Liu Zhenli, who was in charge of the military’s Joint Staff Department. The full impact of the changes for the army and China in general remains unknown. Some experts say this might have repercussion on Beijing’s next move on Taiwan, the self-rule island that Beijing claims as its own territory.",
      "publishedAt": "2026-01-26T07:58:53Z",
      "title": "China removes top general in military leadership purge",
      "url": "https://apnews.com/article/china-military-purge-general-zhang-investigation-76271533450c6fe6614e65e8016676ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/af41cf2/2147483647/strip/true/crop/2000x1333+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Fb9%2F7905f9c337d6093601e94b2ea086%2F515d38d8f47a4be8babe5669afe53302"
    },
    {
      "author": "The Associated Press",
      "description": "Negotiations to end Russia's invasion of Ukraine are showing signs of progress, but major challenges remain, according to a senior Kremlin official. Talks between Ukraine, Russia and the United States in Abu Dhabi were described as constructive, with another round planned for next week. However, no major breakthroughs have been reported. Ukrainian President Volodymyr Zelenskyy also called the talks constructive and mentioned that a document for U.S. security guarantees is ready but needs formal signing. Meanwhile, the war continues, with both sides engaging in drone attacks over the weekend. Negotiators will meet again in early February.",
      "publishedAt": "2026-01-26T12:32:11Z",
      "title": "Progress in negotiations to end Russia's invasion of Ukraine, says Kremlin",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-abu-dhabi-kremlin-a3f9444e6672f941676d095d63fc42e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c00132/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F83%2Fc671435b2010aaef2f6ffbd736fb%2F1b9a9a7331df482a96f21205daf9d6d1"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen’s Houthi rebels have signaled their willingness to launch new attacks on ships in the Red Sea corridor. This move appears to support Iran, which is concerned about a U.S. aircraft carrier approaching the region. The Houthis released a video showing a ship on fire, hinting at future attacks. Meanwhile, Iraq's Kataib Hezbollah has issued threats against any attacks targeting Iran, warning of a “total war.” The U.S. has moved the USS Abraham Lincoln closer to the region amid tensions. Iran has renewed warnings to Israel and the U.S., emphasizing its preparedness for any conflict.",
      "publishedAt": "2026-01-26T08:51:23Z",
      "title": "2 Iranian-backed militias signal will to attack as Iran-US tensions high",
      "url": "https://apnews.com/article/iran-protests-us-aircraft-carrier-crackdown-yemen-e0a6b3c72775348c553ad185af5bfb20",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb71221/2147483647/strip/true/crop/5705x3801+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fbd%2Fab3ced2c7d8f5e488e0e114cf764%2Fe687430d2ab74aa09fb32abdaf6bed44"
    },
    {
      "author": "Colleen Barry",
      "description": "Michelle Francine Ngonmo, a Cameroonian-Italian, has dedicated her career to promoting Africans and people of color in Italian fashion. She founded the Afrofashion Association a decade ago to address the lack of representation. Ngonmo produces runway shows, mentors talent, and launched the Black Carpet Awards. The association has worked with 3,000 people of color, with 92 in creative jobs. Despite initial momentum from the Black Lives Matter movement, attention has waned. Ngonmo now focuses on supportive institutions like the Italian National Fashion Chamber, which backs emerging Black talents like Victor-Hart.",
      "publishedAt": "2026-01-26T06:47:10Z",
      "title": "Afrofashion Association pushes for more inclusion in Italian fashion and society",
      "url": "https://apnews.com/article/diversity-inclusion-milan-fashion-08900d319dabb1ea85e84b9294c6292a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4fa624b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F83%2Feeb12bae47a0d0ffaeaee805d847%2Fa510f95acf174a5ba73fab6e8e95255b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}