{
  "articles": [
    {
      "author": "ELENA BECATOROS",
      "description": "BARI, Italy (AP) — Leaders of the Group of Seven leading industrialized nations turned their attention to migration at the start of the second day of their summit Friday, seeking ways to combat trafficking and increase investment in countries from where migrants start out on often life-threatening journeys.",
      "publishedAt": "2024-06-14T04:03:08Z",
      "title": "G7 leaders tackle the issue of migration on the second day of their summit in Italy",
      "url": "https://apnews.com/4ae6630cd267f87925f3dcbac2785aae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c9b3b64dbc044bd8693cfd417e61640/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and KELVIN CHAN",
      "description": "BARI, Italy (AP) — Pope Francis is no stranger to artificial intelligence: a deepfake photo of him in a white puffer jacket went viral last year. But his concerns about AI go far beyond an unflattering shot and are now taking center stage at the Group of Seven summit.",
      "publishedAt": "2024-06-14T04:27:52Z",
      "title": "Pope Francis will be the first pontiff to address a G7 summit. He's raising the alarm about AI",
      "url": "https://apnews.com/610b8f16aac4d36aa8a56c88de2ca09f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec1726a804ba43e2a2256facb28d8c4f/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "ABOARD THE USS LABOON IN THE RED SEA (AP) — The U.S. Navy prepared for decades to potentially fight the Soviet Union, then later Russia and China, on the world's waterways. But instead of a global power, the Navy finds itself locked in combat with a shadowy, Iran-backed rebel group based in Yemen.",
      "publishedAt": "2024-06-14T10:55:14Z",
      "title": "US Navy faces its most intense combat since World War II against Yemen's Iran-backed Houthi rebels",
      "url": "https://apnews.com/7a9997f9d84ac669fae69ecf819913fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dab0a5a5e9b4eb78bb8b2926e500031/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and EDITH M. LEDERER",
      "description": "WASHINGTON (AP) — The U.S.-built pier to bring food to Gaza is facing one of its most serious challenges yet — its humanitarian partner is deciding if it can safely and ethically keep delivering supplies arriving by the U.S.",
      "publishedAt": "2024-06-14T04:14:44Z",
      "title": "US-built pier in Gaza is facing its latest challenge — whether the UN will keep delivering the aid",
      "url": "https://apnews.com/2465291ca9308f9d97e3cc51a8cab6c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b1d373e637438ab99e0869597a69d7/2998.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "MINA, Saudi Arabia (AP) — In sweltering temperatures, Muslim pilgrims in Mecca converged on a vast tent camp in the desert on Friday, officially opening the annual Hajj pilgrimage.",
      "publishedAt": "2024-06-14T04:16:33Z",
      "title": "Muslims start the Hajj against the backdrop of the destructive Israel-Hamas war",
      "url": "https://apnews.com/304db8ddf951657d9070bc66459ecb75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15aaf6cb3fd2482c8060ef66aab2a0a7/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Russian President Vladimir Putin promised Friday to “immediately” order a cease-fire in Ukraine and begin negotiations if Kyiv started withdrawing troops from the four regions annexed by Moscow in 2022 and renounced plans to join NATO.",
      "publishedAt": "2024-06-14T10:45:31Z",
      "title": "Putin vows truce if Ukraine exits Moscow-occupied areas and drops NATO bid -- a nonstarter for Kyiv",
      "url": "https://apnews.com/4f58423548b3d2e8594c9d9eb8e9d36e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32707c6251c341e0ab89a71b98c01c2b/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court unanimously upheld access to a drug used in the majority of U.S.",
      "publishedAt": "2024-06-13T20:01:54Z",
      "title": "Takeaways from Supreme Court ruling: Abortion pill still available but opponents say fight not over",
      "url": "https://apnews.com/8b6ac57709fa72e9ce433852582f5fde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4761bd9e926c495eb19a65975be75d8e/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "PARKLAND, Fla. (AP) — A crew is scheduled Friday to begin tearing down the three-story classroom building where 17 people died in the 2018 mass shooting at Parkland's Marjory Stoneman Douglas High School.",
      "publishedAt": "2024-06-14T04:20:00Z",
      "title": "Demolition of the Parkland classroom building where 17 died in 2018 shooting is set to begin",
      "url": "https://apnews.com/2084c00ad62a93bee257da06f1b907cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/346b4993cd424ecb876988164302360c/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and DAVID HAMILTON",
      "description": "DETROIT (AP) — Tesla shareholders voted Thursday to restore CEO Elon Musk's record $44.9 billion pay package that was thrown out by a Delaware judge earlier this year, sending a strong vote of confidence in his leadership of the electric vehicle maker.",
      "publishedAt": "2024-06-13T11:19:45Z",
      "title": "Elon Musk wins back his $44.9 billion Tesla pay package in shareholder vote",
      "url": "https://apnews.com/8b6cce1a1aa460dbbaac69eb73e0e5e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45ada45139dd40f9ab3ed15bd3e00912/3000.jpeg"
    },
    {
      "author": "R.J. RICO and JESSE BEDAYN",
      "description": "ATLANTA (AP) — In a dreary part of downtown Atlanta, shipping containers have been transformed into an oasis for dozens of previously unsheltered people who now proudly call a former parking lot home.",
      "publishedAt": "2024-06-14T04:35:06Z",
      "title": "Micro communities for the homeless sprout in US cities eager for small, quick and cheap solutions",
      "url": "https://apnews.com/63f675d418bd1af6da74f26f4c320324",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19817febeae04961b0f5d7f106a24022/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}