{
  "articles": [
    {
      "author": "JOSH BOAK, STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The White House on Friday directed federal agencies to get ready for a shutdown after House Republicans left town for the weekend with no viable plan to keep the government funded and avert politically and economically costly disruption of federal services.",
      "publishedAt": "2023-09-22T17:03:58Z",
      "title": "White House preparing for government shutdown as House Republicans lack a viable endgame for funding",
      "url": "https://apnews.com/637d4209f1a7ab786459f3a0bbd60296",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77582b41bcb64adc8849b5a293b30fce/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The United Auto Workers union expanded its strike against major carmakers Friday, walking out of all 38 parts-distribution centers operated by General Motors and Jeep and Ram owner Stellantis in 20 states but sparing Ford from further shutdowns.",
      "publishedAt": "2023-09-22T11:51:36Z",
      "title": "Auto workers expand their strike to 38 locations in 20 states. Biden plans visit to show support",
      "url": "https://apnews.com/4132aa222c9a4456415af480d6fafa98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9937312f18c34a60a491b876acc3987c/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Powerful Sen. Bob Menendez of New Jersey was charged Friday with secretly aiding the authoritarian government of Egypt and trying to thwart the criminal prosecution of a friend in exchange for gold bars and cash under a corruption indictment that accuses him of using his foreign affairs influence for personal gain.",
      "publishedAt": "2023-09-22T13:42:13Z",
      "title": "Gold bars, cash-stuffed envelopes: New indictment of Sen. Menendez alleges vast corruption",
      "url": "https://apnews.com/729db45fcf21c42ba707c9d0139349e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31d7288abe184a46969284b6ee983054/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "EAGLE PASS, Texas (AP) — Waiting three weeks and counting to cross into Texas, Lila sat in a shelter on the Mexico border Friday feeling trapped: The cartels make it too dangerous to turn around and the U.S.",
      "publishedAt": "2023-09-22T05:13:25Z",
      "title": "As migrants overwhelm a Texas border city, others wait in Mexico for appointments to enter the US",
      "url": "https://apnews.com/314698bfb5644be8f8f6085ebe9b9b98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e167f93dfe48ab829820da1486ba6d/1920.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — Elijah McClain's mother left a Colorado courtroom in tears Friday after prosecutors showed video footage of the 23-year-old Black man pinned down by police officers during a fatal 2019 confrontation, which rose to prominence during nationwide protests over racial discrimination and excessive force in policing.",
      "publishedAt": "2023-09-22T20:38:08Z",
      "title": "Video of Elijah McClain's stop by police shown as officers on trial in Black man's death",
      "url": "https://apnews.com/63b6b22044a483996046251f5e3425be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccd3d9ae1e074bfc8f63efff2c8234a5/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN and LEA SKENE",
      "description": "The FBI said Friday it has opened a civil rights investigation into allegations in recent lawsuits that police in Baton Rouge, Louisiana, assaulted drug suspects they detained in an obscure warehouse known as the “Brave Cave.”",
      "publishedAt": "2023-09-22T22:25:43Z",
      "title": "FBI is investigating alleged abuse in Baton Rouge police warehouse known as the 'Brave Cave'",
      "url": "https://apnews.com/1be2156027566d9462d142894d7a4399",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87818d36e84a427db92fbde716772244/2000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Surgeons have transplanted a pig’s heart into a dying man in a bid to prolong his life – only the second patient to ever undergo such an experimental feat. Two days later, the man was cracking jokes and able to sit in a chair, Maryland doctors said Friday.",
      "publishedAt": "2023-09-22T18:13:32Z",
      "title": "Surgeons perform second pig heart transplant, trying to save a dying man",
      "url": "https://apnews.com/d894f6ce27b7db71ecb0ec393cac3e86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53355b5718a74e738f2ad0f10b0794b0/1920.jpeg"
    },
    {
      "author": "SARAH BRUMFIELD and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Tropical Storm Ophelia gained strength as it churned toward the North Carolina coast on Friday, promising a weekend of heavy rain and windy conditions throughout the mid-Atlantic.",
      "publishedAt": "2023-09-22T15:19:04Z",
      "title": "Tropical Storm Ophelia off the mid-Atlantic coast producing winds just below hurricane force",
      "url": "https://apnews.com/6cdc050e4114add7ccbaea9032752e53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1a582487caa4731890d91ea71610155/1920.jpeg"
    },
    {
      "author": "ANDREW SELSKY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Residents who survived the wildfire that leveled the Hawaii town of Lahaina might not be able to afford to live there after it is rebuilt unless officials alter the zoning laws and make other changes, economists warned Friday.",
      "publishedAt": "2023-09-22T18:25:03Z",
      "title": "Hawaii economists say Lahaina locals could be priced out of rebuilt town without zoning changes",
      "url": "https://apnews.com/e71b9020be83e39012bf69dc5cfb0d13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b3041bd40304f78bc275a91660e56ed/3000.jpeg"
    },
    {
      "author": "BRIAN HALL",
      "description": "MINNEAPOLIS (AP) — The Minnesota Twins clinched the AL Central title Friday night with an 8-6 victory over the Los Angeles Angels.Alex Kirilloff homered and drove in three runs, and Minnesota held on late to win the division crown for the third time in five seasons under manager Rocco Baldelli.",
      "publishedAt": "2023-09-23T03:14:57Z",
      "title": "Minnesota Twins clinch AL Central title with 8-6 win over Angels",
      "url": "https://apnews.com/bfedf4c10046e366f1d865d6a5a55946",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87b093c7c2ca4ae595da094767055858/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}