{
  "articles": [
    {
      "author": "Rob Gillies, Josh Boak",
      "description": "Canadian Prime Minister Mark Carney has arrived in Washington for a high-stakes meeting with President Donald Trump. Carney will have lunch with Trump before a bilateral meeting Tuesday. The new Canadian prime minster hopes to ease tensions in the trade war, which has created economic uncertainty on both sides of the border. Carney’s Liberal Party scored a stunning comeback victory last month in a vote widely seen as a rebuke of Trump. The Republican president has shattered a decades-old alliance by saying he wants to make Canada the 51st U.S. state and levying steep tariffs. Carney has stressed Canada is “in a once-in-a-lifetime crisis.” Meanwhile, Trump told reporters he wasn’t quite sure why Carney was visiting.",
      "publishedAt": "2025-05-06T10:58:06Z",
      "title": "Canadian Prime Minister Carney arrives in Washington for meeting with Trump",
      "url": "https://apnews.com/article/canada-prime-minister-carney-trump-c279642998197ecb212f39bf38184388",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba26170/2147483647/strip/true/crop/3000x1688+0+60/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F0b%2Feb9e530ff6d847a7a2d3e11c77e0%2F6896fd3b34ee46558e9b0afa7eec1ada"
    },
    {
      "author": "Elena Becatoros",
      "description": "Iranian-backed Houthi rebels in Yemen said that Israeli strikes had hit the capital, Sanaa, shortly after Israel’s military issued a warning for people to evacuate the area of Yemen’s international airport. There was no immediate information on any casualties Tuesday. The strikes come a day after Israel launched airstrikes in retaliation for Sunday’s rebel-launched missile strike on Israel’s international airport. That was the first time a missile struck the grounds of Israel’s main airport, Ben Gurion, since the October 2023 start of the war in Gaza. The Houthis have targeted Israel throughout the war in solidarity with Palestinians in Gaza.",
      "publishedAt": "2025-05-06T12:02:40Z",
      "title": "Houthi rebels say Israeli strikes have hit the Yemeni capital",
      "url": "https://apnews.com/article/israel-yemen-houthis-airport-23c27ae5ef0b8c9c8860dbb79abee5ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Wafaa Shurafa, Melanie Lidman",
      "description": "An Israeli plan to seize the Gaza Strip and expand the military operation has alarmed many in the region. Palestinians are exhausted and hopeless, pummeled by 19 months of heavy bombing. Families of Israeli hostages still being held in Gaza are terrified that the possibility of a ceasefire is slipping further away. Israeli officials said Monday that Cabinet ministers approved the plan to seize Gaza and remain in the Palestinian territory for an unspecified amount of time. Details of the plan were not formally announced. It may be another measure by Israel to try to pressure Hamas into making concessions in ceasefire negotiations.",
      "publishedAt": "2025-05-06T09:40:56Z",
      "title": "Israeli plan to seize Gaza alarms many: 'What's left for you to bomb?'",
      "url": "https://apnews.com/article/israel-palestinians-gaza-war-plan-reaction-e11aa45f829100c6e9b8afdaa4b2567f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4da3941/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F27%2F424ceb995c3c4bd5213823697381%2Fd3ac90abc3834e9c8c5d03dd8e74e9b2"
    },
    {
      "author": "Collin Binkley, Lisa Mascaro",
      "description": "As Congress looks to slash spending and raise revenue for President Donald Trump’s tax bill, Republicans have turned attention to the huge endowments amassed by the country’s wealthiest colleges. Varying proposals have called for raising the rate to 14% or 21%, treating traditionally tax-free universities like major corporations. Trump previously said he wants to see Harvard stripped of its tax-exempt status as he presses for reforms at colleges he accuses of “indoctrinating” students with “radical left” ideas. Republicans appear to be chipping away at the long-held notion that colleges provide the kind of public benefit that deserves to be protected from heavy taxation.",
      "publishedAt": "2025-05-06T17:17:16Z",
      "title": "House GOP looks to hike tax on college endowments",
      "url": "https://apnews.com/article/trump-endowment-tax-college-e5256fcd0962c679cfafad2d7ea1e9d5",
      "urlToImage": "https://dims.apnews.com/dims4/default/90b52c3/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F2b%2F224d82c58fb3f7bfad2bb01d2e43%2F009177e60d43490781afa5bebdfc1a47"
    },
    {
      "author": "Stefanie Dazio",
      "description": "Conservative leader Friedrich Merz’s bid to become Germany’s 10th chancellor has failed in the first round of voting in parliament. Merz had been expected to win smoothly in the vote on Tuesday. A candidate for chancellor has never failed to win on the first ballot in post-World War II Germany. Merz needed a majority of 316 out of 630 votes in a secret ballot but only received 310 votes. The lower house of parliament has 14 days to elect a candidate with an absolute majority. Merz can run again, but other lawmakers can also throw their hat in the ring.",
      "publishedAt": "2025-05-06T04:01:05Z",
      "title": "In a historic first, Friedrich Merz's bid to become Germany's 10th chancellor fails first ballot",
      "url": "https://apnews.com/article/germany-government-merz-coalition-98e9007ea41b8bbd36be8d09baefb632",
      "urlToImage": "https://dims.apnews.com/dims4/default/c469118/2147483647/strip/true/crop/5899x3318+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F3f%2F006df5774d07780b24b9031763e1%2Ff59812f5c98549fca6acdba036c6a6a8"
    },
    {
      "author": "Nicole Winfield",
      "description": "Cardinals electing a new pope have some fundamental questions to weigh, beyond whether to give the Catholic Church its first Asian or African pope. Despite hailing from 70 different countries, the 133 cardinals seem fundamentally united in finding a pope who will be able to make the 2,000-year-old church credible and relevant today, especially to young people. That's a tall task, given the sexual abuse and financials scandals that have sullied the church’s reputation. Add to that the Holy See’s dire financial state and often-dysfunctional bureaucracy, and the job of being pope in the 21st century seems almost impossible. As Cardinal William Seng Chye Goh of Singapore put it: “We need a superman!”",
      "publishedAt": "2025-05-06T05:00:36Z",
      "title": "Beyond a possible Asian or African pope, what are the priorities of the cardinals in the conclave?",
      "url": "https://apnews.com/article/conclave-pope-election-vatican-cardinals-6038362e418d3194848229811c2d1a2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f01703a/2147483647/strip/true/crop/9178x5163+0+478/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fec%2F5755c6df5e812cb4bd11d14273f9%2Fafb8f3590e98424791c7c3b80ac039b2"
    },
    {
      "author": "Rebecca Santana",
      "description": "The head of Homeland Security says travelers who aren’t REAL ID compliant by the upcoming deadline this week will still be able to fly but should be prepared for extra scrutiny. Kristi Noem told a Congressional panel that 81% of travelers already have IDs that comply with the REAL ID requirements. She says security checkpoints will also be accepting passports and tribal identification when the deadline hits Wednesday. She says those who still lack an identification that complies with the REAL ID law “may be diverted to a different line, have an extra step.\" But they'll still be allowed to fly.",
      "publishedAt": "2025-05-06T15:32:15Z",
      "title": "Travelers with no REAL ID can fly for now, Kristi Noem says",
      "url": "https://apnews.com/article/real-id-travelers-security-deadline-homeland-289d84d3c10d96546270ff0e8ca80436",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c63a21/2147483647/strip/true/crop/2623x1475+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2Ff8%2F3d428a9144d77cfb08d187510fb6%2F87f9ed71d09d4776bf3905597d513a3f"
    },
    {
      "author": "David Bauder",
      "description": "The Trump administration has called journalists “despicable,” even questioned the patriotism of some, as part of its vigorous response to criticism in the case of Kilmar Abrego Garcia, who was mistakenly sent by immigration officials to a notorious prison in El Salvador. It reflects a leader whose hostility toward the press is no secret, and his determination not to back down when questioned. The head of the FCC has also become involved, suggesting CNN and MSNBC are guilty of ‘news distortion’ for the way they have covered the story; Trump even questioned whether CNN loves the country.",
      "publishedAt": "2025-05-06T13:25:08Z",
      "title": "Trump administration responds vigorously to Abrego Garcia coverage",
      "url": "https://apnews.com/article/abrego-garcia-trump-white-house-media-9e43cd24486a2db30247153a72714be1",
      "urlToImage": "https://dims.apnews.com/dims4/default/2946545/2147483647/strip/true/crop/5463x3073+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F52%2Faef1d56a6ba1e8a2a15e1f307880%2Fa31d52ab6d7946d0897c6c01362222de"
    },
    {
      "author": null,
      "description": "Rescue crews in Texas have found the body of a 10-year-old girl swept away by rapidly rising floodwaters. Forecasters warn that more heavy rains and flooding could be on the way to the Houston area and the state’s coast. Teams of people scoured the city of Brenham, using drones with thermal imaging and dogs to find the girl. The water rescue operation was scaled back overnight when heavy thunderstorms moved through the area, but four swift water rescue teams resumed operations early Tuesday. The National Weather Service in Houston says the next round of severe storms could bring as much as 6 inches of rain Tuesday to parts of southeastern Texas.",
      "publishedAt": "2025-05-06T05:34:20Z",
      "title": "Rescue crews recover the body of a 10-year-old girl lost in Texas floods",
      "url": "https://apnews.com/article/texas-flooding-storms-us-ed800deb1897ed482b279655ab94368b",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd3efa8/2147483647/strip/true/crop/960x540+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F6b%2Faeddd4936132e46778f95146ddee%2F179c0fd23b8f49cf81d90f3812a66367"
    },
    {
      "author": "Will Graves",
      "description": "Baseball players from major leaguers to Little Leaguers are using sliding mitts as a form of self-expression, even it at some levels, they're not needed at all. The padded gloves are designed to protect a player's hand when they slide head-first to reach for a base. The equipment was first introduced by former major leaguer Scott Podsednik in the late 2000s. The market has exploded in the last 16 years, with millions of them being sold each season to players at all levels in a wide array of colors and designs. At the youth levels, it's all about fashion over function. Most leagues ban or limit head-first slides for players 12 and under. That hasn't stopped them from being in heavy demand anyway.",
      "publishedAt": "2025-05-06T15:20:52Z",
      "title": "Sliding mitts are taking over youth baseball",
      "url": "https://apnews.com/article/sliding-mitts-little-league-566b12315127f05ac75571e8a5d4d062",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b6361e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F97%2Fda24f784811487989e4c52454b4b%2F08c3ea1a98fc4078b25c764dee013d8e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}