{
  "articles": [
    {
      "author": "JAIMIE DING, JULIE WATSON, JOHN SEEWER",
      "description": "Millions of Southern Californians are on edge as a final round of dangerous fire weather is forecast for the region on Wednesday, along with a rare warning of a “Particularly Dangerous Situation” for an area near where two massive blazes have killed at least 25 and destroyed thousands of homes. Firefighters got a reprieve Tuesday when winds were unexpectedly light and they were able to make progress battling the two huge Los Angeles area fires and quickly snuff out several new fires. The Eaton Fire burning just north of Los Angeles and the Palisades Fire that destroyed much of the seaside LA neighborhood of Pacific Palisades broke out Jan. 7 in conditions similar to what’s expected Wednesday.",
      "publishedAt": "2025-01-15T05:17:35Z",
      "title": "LA fires: Red flag warnings issued as millions in Southern California on edge",
      "url": "https://apnews.com/article/los-angeles-wildfires-southern-california-212389bfba69f39baaf72579f1644ddd",
      "urlToImage": "https://dims.apnews.com/dims4/default/00eeece/2147483647/strip/true/crop/5170x2908+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F22%2F3d0ce1903458189d913d5c5dac18%2Fee35d9746fd7497c9e052239530cc02d"
    },
    {
      "author": null,
      "description": "Fires that have been burning homes and businesses in Los Angeles for a week have killed at least 25 people, displaced thousands of others and destroyed more than 12,000 structures. Nearly 30 people are missing. The blazes started early last week and have been powered by gusts from the Santa Ana winds, which strengthened Tuesday. Investigators have not determined what sparked the fires. Estimates suggest they could be the nation's costliest ever. The National Weather Service issued a rare warning about a “particularly dangerous situation” related to severe fire conditions.",
      "publishedAt": "2025-01-08T14:58:14Z",
      "title": "Los Angeles wildfires: What to know about evacuations and burned homes",
      "url": "https://apnews.com/article/california-fires-things-to-know-winds-f93d41dc901e352b63e86ab67ef7790e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a01ab3d/2147483647/strip/true/crop/4209x2368+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F47%2F447facc06dc807fa62be9d381dee%2F31812c5942a94ee2925dd5a22d16dbe7"
    },
    {
      "author": "HOLLY RAMER",
      "description": "The National Weather Service's warning about the “particularly dangerous situation” in which any new fire could explode in size in the Los Angeles area didn’t mention fire tornadoes. But meteorologist Todd Hall says they're possible given the extreme conditions. Fire whirl, fire devil, fire tornado or even firenado — scientists, firefighters and regular folks use multiple terms to describe similar phenomena, and they don’t always agree on what’s what. Some say fire whirls are formed only by heat, while fire tornados involve clouds generated by the fire itself. In 2018, a fire tornado the size of three football fields killed a firefighter near Redding, California.",
      "publishedAt": "2025-01-15T05:08:04Z",
      "title": "Fire tornadoes a risk under California extreme wildfire conditions",
      "url": "https://apnews.com/article/firenado-fire-tornado-california-wildfire-dd53971839343ff6737156af3b983d0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/38f09bd/2147483647/strip/true/crop/3000x1688+0+23/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F66%2Fed622c4cd8e8bc640140dced8f8f%2Fc90c3346e6b444ebbb83fbb2e36e27a6"
    },
    {
      "author": "JAKE COYLE, LINDSEY BAHR",
      "description": "When the Palisades Fire broke out in Los Angeles, Hollywood’s awards season was in full swing. The Golden Globes had transpired less than 48 hours earlier and a series of splashy awards banquets followed in the days after. But the enormity of the destruction in Southern California has quickly snuffed out all festiveness in the movie industry’s high season of celebration. The fires have struck at the very heart of a movie industry still trying to stabilize itself after years of pandemic, labor turmoil and technological upheaval. Not for the first time this decade, the Oscars are facing the question of: Should the show go on? And if it does, what do they mean now?",
      "publishedAt": "2025-01-15T05:20:27Z",
      "title": "As Los Angeles burns, Hollywood's Oscar season turns into a pledge drive",
      "url": "https://apnews.com/article/wildfires-oscars-los-angeles-academy-awards-da8cd994872ac6c1c65dcd4bc8721cc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d4cbbe/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F32%2Fa8f9e1d136f35a5cd7244e0e3c24%2Fccf7700d80d84194a66be903cd130395"
    },
    {
      "author": "MATT SEDENSKY",
      "description": "As California’s massive wildfires burn, thousands of GoFundMe campaigns for victims have become an outlet for onlookers transfixed by the blazes and eager to do something to help. Often plastered with photos of the people at the center of the plea, the appeals are personalizing a tragedy so big it can be hard to comprehend. GoFundMe says more than $100 million has already been raised for wildfire victims on the platform. Ella Marx from Michigan is among those who chipped in. She came across an appeal from a woman who said the houses of her grandmother and three aunts were all destroyed by the Eaton Fire and quickly donated $20.",
      "publishedAt": "2025-01-15T05:11:18Z",
      "title": "Relief, 21st-century style: As wildfires burn, GoFundMe becomes a repository of harrowing stories",
      "url": "https://apnews.com/article/california-wildfires-gofundme-01bc1eaec701d862f442c35a8438519f",
      "urlToImage": "https://dims.apnews.com/dims4/default/594afd1/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fee%2F51fb6d784efb6eb041c6ee7d8345%2Ff8ccde04df0041298bb7beab4c5b9898"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "South Korea’s impeached President Yoon Suk Yeol was detained in a massive law enforcement operation at the presidential compound Wednesday. He said he complied with the warrant after weeks of defiance over attempts to question him in the investigation over his imposition of martial law last month. In a video message recorded before he was escorted to the headquarters of the anti-corruption agency, Yoon lamented that the “rule of law has completely collapsed in this country.” Yoon contends the agency doesn't have the authority to investigate whether his declaration of martial law was attempted rebellion. He insists it was a legitimate act of governance after the liberals leading parliament thwarted his agenda.",
      "publishedAt": "2025-01-14T21:34:24Z",
      "title": "South Korea’s President Yoon detained over martial law chaos",
      "url": "https://apnews.com/article/south-korea-yoon-martial-law-detain-8dd7f03661be39729741de9a3b5d1714",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b9bd90/2147483647/strip/true/crop/3000x1688+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Ffe%2Fc32aad5399446685f874621e8837%2F123ce115fe1a44eb83dd9eb7936fa644"
    },
    {
      "author": "LEE KEATH, SAMY MAGDY",
      "description": "If the Israel-Hamas ceasefire deal goes according to the current draft, then fighting will stop in Gaza for 42 days, and dozens of Israeli hostages and hundreds of Palestinian prisoners will be freed. In this first phase Israeli troops will pull back to the edges of Gaza, and many Palestinians will be able to return to what remains of their homes as stepped-up aid flows in. The question is if the ceasefire will survive beyond that first phase. That will depend on even more negotiations meant to begin within weeks. In those talks, Israel, Hamas, and the U.S, Egyptian and Qatari mediators will have to tackle the tough issue of how Gaza will be governed, with Israel demanding the elimination of Hamas.",
      "publishedAt": "2025-01-14T17:01:34Z",
      "title": "A look at the terms — and tensions — in the Israel-Hamas draft ceasefire deal",
      "url": "https://apnews.com/article/israel-hamas-gaza-ceasefire-draft-terms-hostages-3df21b67620fdc8f62aa1d1e96487880",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7d5d77/2147483647/strip/true/crop/4493x2527+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F38%2F365fe78aafb565cf9bfe3979973e%2F1b49f715a44c40b89a44f0d9d7570911"
    },
    {
      "author": "ROD MCGUIRK",
      "description": "Best-selling British author Neil Gaiman has released a statement denying he has ever engaged in non-consensual sex after a magazine published allegations from several women, accusing him of sexual assault. The 64-year-old author of “The Sandman” comic book series and novel “American Gods” was responding on Wednesday to a New York Magazine article that detailed allegations of assault, abuse and coercion made by eight women. The allegations of four of them had been broadcast in July last year in a podcast and most relate to occasions when Gaiman was in his 40s or older and living in the United States, Britain and New Zealand.",
      "publishedAt": "2025-01-15T06:41:23Z",
      "title": "Neil Gaiman denies engaging in non-consensual sex as more accusers come forward",
      "url": "https://apnews.com/article/australia-neil-gaiman-sexual-assault-allegations-e25ce1b1fa8328c25b67b52477f8ef8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf62c1b/2147483647/strip/true/crop/3936x2214+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fd5%2F1370f580d53325cc7008e9032568%2F52fb25fa33ff4f16a2a5f46247d15ed5"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER",
      "description": "Joe Biden staked his presidency on the idea that he was the best person to keep Donald Trump out of power. Now Trump's return to the White House is reshaping Biden's legacy. On Wednesday, Biden will have an opportunity to reconcile his promises and the results when he delivers a farewell address to the nation. But only a quarter of Americans say he has been a good or great president, even lower than views of Trump when he left office four years ago after the Jan. 6 attack on the U.S. Capitol. It's a difficult ending for Biden, who had hoped to serve as a transformational leader only to see the country turn back to his predecessor.",
      "publishedAt": "2025-01-15T05:22:53Z",
      "title": "Biden grapples with his legacy as Trump prepares to return",
      "url": "https://apnews.com/article/joe-biden-donald-trump-legacy-1a4498e8cd5f764e92e73412d9dfefaa",
      "urlToImage": "https://dims.apnews.com/dims4/default/b89522e/2147483647/strip/true/crop/3692x2077+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fce%2F71dedf7189fe274891aa893b998e%2Ff2ec48b3195f411d833331e58541ab10"
    },
    {
      "author": "LISA MASCARO, TARA COPP, MATT BROWN",
      "description": "Pete Hegseth vows to bring “warrior culture’” to the military if confirmed as President-elect Donald Trump’s defense secretary pick. Questioned by senators during Tuesday's confirmation hearing, Hegseth deflected allegations of sexual assault and excessive drinking. Instead he focused on his own combat experience. The former TV news show host called himself a “change agent” as senators determine whether he is fit to lead the U.S. military. Chairman Roger Wicker says Hegseth will “shake up” the Pentagon. But the top Democrat, Sen. Jack Reed, says the allegations against Hegseth are “extremely alarming.” The Republican-led Senate is rushing to have some of Trump’s Cabinet picks ready to be confirmed as soon as Inauguration Day, Jan. 20.",
      "publishedAt": "2025-01-14T05:01:06Z",
      "title": "Pete Hegseth confronts allegations as Trump's defense nominee",
      "url": "https://apnews.com/article/hegseth-defense-trump-women-allegations-cd3bfa2dbc35afa37a7f98b72e576233",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f3811a/2147483647/strip/true/crop/8585x4829+0+447/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Fe4%2Fa52f4c8f5c4bcfc133e4ad6f092e%2F96e0c8ce057d423fa48101d0d99c2970"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}