{
  "articles": [
    {
      "author": null,
      "description": "ATLANTA (AP) — Fani Willis, prosecutor in Georgia Trump election case, wins Democratic primary in her bid for reelection.",
      "publishedAt": "2024-05-21T23:31:37Z",
      "title": "Fani Willis, prosecutor in Georgia Trump election case, wins Democratic primary in her bid for reelection",
      "url": "https://apnews.com/0d399c74d7decc95adf4d770d6c7678b",
      "urlToImage": ""
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JILL COLVIN and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump's hush money trial moved into a new phase Tuesday, drawing closer to the moment when the jury will begin deciding his fate after testimony concluded without the former president taking the stand in his own defense.",
      "publishedAt": "2024-05-21T04:06:57Z",
      "title": "Trump hush money trial enters new phase after defense rests without testimony from former president",
      "url": "https://apnews.com/b1beb56a666c398ae5393ede16c326da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f13f070fc0c542df86ae49995c5890da/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "President Joe Biden and his Republican rival, Donald Trump, piled up more delegates Tuesday as both presumptive nominees won primaries in Kentucky.",
      "publishedAt": "2024-05-21T04:16:27Z",
      "title": "Biden, Trump win Kentucky primaries as presidential nominating season nears its end",
      "url": "https://apnews.com/9960bc3082a23b116f3c2753b5afe29e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d161c864a534286a85475f52d55c6ca/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, LEE KEATH and TIA GOLDENBERG",
      "description": "CAIRO (AP) — The United Nations suspended food distribution in the southern Gaza city of Rafah on Tuesday due to a lack of supplies and an untenable security situation caused by Israel’s expanding military operation.",
      "publishedAt": "2024-05-21T07:38:07Z",
      "title": "UN halts all food distribution in Rafah after running out of supplies in the southern Gaza city",
      "url": "https://apnews.com/a3320a77a3a6ccff41db2a4bc63e4aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0731ab89e44561a9536e4e96d48b13/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Mourners in black began gathering Tuesday for days of funerals and processions for Iran's late president, foreign minister and others killed in a helicopter crash, a government-led series of ceremonies aimed at both honoring the dead and projecting strength in an unsettled Middle East.",
      "publishedAt": "2024-05-21T08:19:46Z",
      "title": "Mourners begin days of funerals for Iran's president and others killed in helicopter crash",
      "url": "https://apnews.com/7bb445b5885fdf0ac8616820bf7f59f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6a1fd2010f34e48bf32995c6bbbadb2/1920.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT, SCOTT McFETRIDGE and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — Powerful storms that rolled through the Midwest spun up multiple tornadoes, including a fierce twister that smashed through a small Iowa town Tuesday, carving a bleak landscape of destroyed homes and businesses, toppled trees, smashed cars and widely strewn debris and causing an unknown number of injuries.",
      "publishedAt": "2024-05-21T16:00:11Z",
      "title": "Storms spin up tornadoes in Iowa that cause injuries, topple wind turbines",
      "url": "https://apnews.com/07e423f20b8e81f40cc648090b8a2409",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f27ffc6ab5d64f2583b683a9edf3125b/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — The U.S. Department of Justice sued Oklahoma on Tuesday seeking to block a law that seeks to impose criminal penalties on those living in the state illegally.The lawsuit in federal court in Oklahoma City challenges a law that makes it a state crime — punishable by up to two years in prison — to live in Oklahoma without legal immigration status.",
      "publishedAt": "2024-05-21T20:54:49Z",
      "title": "DOJ adds Oklahoma to the list of states it's suing to block their immigration laws",
      "url": "https://apnews.com/4345ecf142a1ed9f518679f4b524f589",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1944facf3e747adae55b36042d8f95a/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD",
      "description": "PHOENIX (AP) — Former New York City Mayor Rudy Giuliani pleaded not guilty Tuesday to nine felony charges stemming from his role in an effort to overturn Donald Trump’s 2020 election loss in Arizona to Joe Biden.",
      "publishedAt": "2024-05-21T05:06:04Z",
      "title": "Ex-NYC Mayor Rudy Giuliani pleads not guilty to felony charges in Arizona election interference case",
      "url": "https://apnews.com/4987d0774412d95a3dac007e81d5c157",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c7246c12fa04ad8b3e8daaec4a26f82/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Israel's shutdown and seizure of an Associated Press video camera that provided a live glimpse into Gaza alarmed many journalists, who worried Tuesday about wider implications for coverage of a war largely fought out of the world's sight to begin with.",
      "publishedAt": "2024-05-21T20:48:44Z",
      "title": "Israel's block of AP transmission shows how ambiguity in law could restrict war coverage",
      "url": "https://apnews.com/3bcd8b15d6a7a1209a1fb05ee0db860e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bca2d867bf9456c9b03a1085e95f3ba/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — The death of a British man and injuries impacting dozens of other people aboard a Singapore Airlines flight that hit severe turbulence Tuesday highlighted the potential dangers of flying through unstable air.",
      "publishedAt": "2024-05-21T21:06:53Z",
      "title": "What is in-flight turbulence, and when does it become dangerous for passengers and crews?",
      "url": "https://apnews.com/afdeda536a5e0b7300905a9994c58e4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6701d2662ec24ad286e1ee21f201d73b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}