{
  "articles": [
    {
      "author": "WYATTE GRANTHAM-PHILIPS, MAE ANDERSON",
      "description": "The U.S. is inching closer and closer to a potential TikTok ban — with the nation’s highest court upholding a law that’s set to officially cut the cord and halt new downloads off the app starting Sunday. But many questions around what exactly this ban will look like, and whether it will actually be enforced in the coming days, remain. That puts millions of users and content creators in limbo — particularly influencers and small business owners who have come to rely on the mega-popular social media platform as a source of income.",
      "publishedAt": "2025-01-17T21:13:08Z",
      "title": "For TikTok users, mourning, frustration and clinging to hope as TikTok ban looms",
      "url": "https://apnews.com/article/tiktok-ban-creators-influencers-react-78a06f9d2a91541710f999cbe39a3290",
      "urlToImage": "https://dims.apnews.com/dims4/default/825cdc4/2147483647/strip/true/crop/5624x3164+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2Ff1%2Fd00fe212551bba025337dea4c2c6%2F2528650573da4492bed209dca6401c17"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "With President-elect Trump adding uncertainty around whether a TikTok ban will go into effect, the focus is now turning to companies like Google and Apple. The two companies are expected to take the popular video sharing app off their platforms in just two days. But it’s unclear how a shutdown of the popular social media platform will play out and what Americans will see when the clock strikes midnight on Sunday. Under the law, mobile app stores and internet hosting services will face major fines if they continue to distribute the platform to U.S. users beyond the deadline for divestment from ByteDance, TikTok’s China-based parent company. The companies could face fines of up to $5,000 for each user who continues to access TikTok, which means the penalties could total a large sum.",
      "publishedAt": "2025-01-17T22:15:50Z",
      "title": "What will happen to TikTok on Apple and Google's app store on Sunday?",
      "url": "https://apnews.com/article/tiktok-ban-app-stores-apple-google-a905693c43984e9b80d432a3a933a73f",
      "urlToImage": "https://dims.apnews.com/dims4/default/2820a51/2147483647/strip/true/crop/3504x1971+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F27%2Fb0af895e555ede75065adee13b7c%2Fb3bbe9065f3f47f69a9b02c48ffab12c"
    },
    {
      "author": null,
      "description": "The supremely popular TikTok could be banned on Jan. 19 under a federal law that forces the video sharing platform to divest itself from its China-based parent company, ByteDance, or shut down its U.S. operations. Several parties have expressed interest in buying the platform, but ByteDance has repeatedly said it does not plan to sell. On Friday, the Supreme Court upheld the law following a legal challenge by the two companies and some TikTok users. Experts have also noted the Chinese government is unlikely to approve a sale that includes TikTok’s coveted algorithm. But until the deadline passes, the possibility of a purchase is still possible.",
      "publishedAt": "2025-01-16T11:00:06Z",
      "title": "Who could buy TikTok? Only a few parties are serious about offering",
      "url": "https://apnews.com/article/tiktok-buyers-divestment-ban-8429dfb422c4cefb6b0807aeb2c5cd56",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad1d182/2147483647/strip/true/crop/3077x1731+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F6c%2Faaf1d99e4e76db5ffe62748fccc0%2F994822f98d514cf5ab78f7d1bf8dbe27"
    },
    {
      "author": "HOLLY RAMER",
      "description": "A new lawsuit alleges that Vermont's child welfare agency routinely targets and tracks pregnant women deemed unsuitable for parenthood. The ACLU of Vermont and Pregnancy Justice, a national advocacy group, filed a lawsuit this week on behalf of a woman who says the Vermont Department for Children and Families relied on baseless allegations about her mental health to secretly investigate her while she was pregnant and win custody of her daughter before the baby was born in February 2022. The lawsuit, which also names a counseling center and the hospital where the woman gave birth, seeks both an end to what it calls an illegal surveillance program and unspecified monetary damages for the woman.",
      "publishedAt": "2025-01-17T19:34:19Z",
      "title": "Lawsuit alleges Vermont tracks pregnant women deemed unsuitable for parenthood",
      "url": "https://apnews.com/article/pregnancy-child-welfare-lawsuit-vermont-2fb1e1b3f89883ecb86b090ac22bf54c",
      "urlToImage": "https://dims.apnews.com/dims4/default/c0db750/2147483647/strip/true/crop/3000x1688+0+335/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F65%2Fe709fa66196464b1c27de9008b36%2F3317ba4e705347ee8c23272578744758"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "In one of her last acts as Treasury Secretary, Janet Yellen said her agency will start taking “extraordinary measures,” or special accounting maneuvers intended to prevent the nation from hitting the debt ceiling, on January 21, in a letter sent to congressional leaders Friday afternoon. She sent a letter in late December to lawmakers stating that Treasury expected to hit the statutory debt ceiling between January 14 and January 23. And now, the agency will stop paying into certain accounts, including the Civil Service Retirement and Disability Fund and the Postal Service Retiree Health Benefits Fund, to make up for the shortfall in money.",
      "publishedAt": "2025-01-17T22:02:31Z",
      "title": "Yellen says Treasury will use 'extraordinary measures' on Jan. 21 to prevent hitting debt ceiling",
      "url": "https://apnews.com/article/treasury-debt-limit-janet-yellen-7e598f2811d75ad5159f9338f7cdce16",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed119dd/2147483647/strip/true/crop/6205x3490+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F65%2F6e56e5156ce7abac3f12be5651ef%2Fbf791a3cfcd64857b17d22d28eb97442"
    },
    {
      "author": "MATTHEW LEE",
      "description": "Outgoing Secretary of State Antony Blinken told The Associated Press that he hopes the incoming Trump administration will press forward with several key points in President Joe Biden’s foreign policy, including on the Middle East and Ukraine. But in an interview Friday on his last workday as America’s top diplomat, he expressed concern that the Trump team might abandon all or some of those policies. Blinken said that “if past is prologue,” there's reason to be concerned that the new administration might not follow through on initiatives that Biden’s national security team put into place to end the war in Gaza, keep Ukraine free of Russian interference and maintain strengthened alliances with key partners.",
      "publishedAt": "2025-01-17T18:00:20Z",
      "title": "Blinken tells AP he's worried Trump administration may abandon key Biden foreign policy initiatives",
      "url": "https://apnews.com/article/blinken-state-department-trump-rubio-e50be53942888bf188a0ceb4ac5dba6f",
      "urlToImage": "https://dims.apnews.com/dims4/default/9586f35/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2Ffa%2Fabf71390cc8be2a69d53114a624a%2F33750b2dc4944093a6af994e1349ff99"
    },
    {
      "author": "MARK SHERMAN",
      "description": "President-elect Donald Trump says he talked with Chinese leader Xi Jinping about TikTok shortly before the Supreme Court unanimously upheld the federal law banning the app beginning Sunday unless it’s sold by its China-based parent company. The court held Friday the risk to national security posed by TikTok's ties to China overcomes concerns about limiting speech by the app or its 170 million users in the U.S. A sale does not appear imminent. The court’s decision means new users won’t be able to download the app and updates won’t be available, but it won’t disappear from users’ phones. Trump had called on the court to keep the ban on hold until after he takes office Monday.",
      "publishedAt": "2025-01-17T15:03:47Z",
      "title": "Supreme Court upholds TikTok ban in the U.S.",
      "url": "https://apnews.com/article/supreme-court-tiktok-china-security-speech-166f7c794ee587d3385190f893e52777",
      "urlToImage": "https://dims.apnews.com/dims4/default/577b6aa/2147483647/strip/true/crop/5624x3164+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F81%2F663658c858f6407eb31e545c8857%2F11e0c055df924ce1b86b85ab4cb6bbaa"
    },
    {
      "author": null,
      "description": "U.S. President-elect Donald Trump and Chinese leader Xi Jinping were speaking on the phone late Friday, China’s Foreign Ministry said in a statement. The conversation comes ahead of Trump’s inauguration on Monday. The U.S.-China relationship is expected to be one of the main focuses of Trump’s second term, with tensions between the two superpowers looming in the areas of trade, technology and the self-ruled island of Taiwan, among other things. Trump has threatened to slap tariffs of 60% on all Chinese imports into the U.S. But he has also in the past praised his relationship with Xi and has suggested China could help mediate international crises such as the war in Ukraine.",
      "publishedAt": "2025-01-17T14:27:31Z",
      "title": "Trump and Xi speak on the phone ahead of the inauguration, China’s foreign ministry says",
      "url": "https://apnews.com/article/trump-xi-inauguration-china-us-782413bbc4ca5e06c9e39ce9ae151ea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "ZEKE MILLER",
      "description": "President-elect Donald Trump may take the oath of office from inside the Capitol Rotunda on Monday due to forecasts of intense cold weather. The Republican president-elect says the weather forecast for Washington, D.C., with the windchill factor, could take temperatures into severe record lows. Trump says there's an Arctic blast sweeping the country and he doesn't want to see people hurt. The Rotunda is prepared as an alternative for each inauguration in the event of inclement weather. The swearing-in was last moved indoors in 1985, when President Ronald Reagan began his second term. Monday’s forecast calls for the lowest inauguration day temperatures since that day.",
      "publishedAt": "2025-01-17T17:03:56Z",
      "title": "Trump's swearing-in will move inside the Capitol Rotunda because of intense cold weather",
      "url": "https://apnews.com/article/trump-inauguration-capitol-rotunda-cold-weather-2e527b4f40309be7fd2b48a8173af390",
      "urlToImage": "https://dims.apnews.com/dims4/default/18ad255/2147483647/strip/true/crop/7311x4112+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F93%2F0a798c7354ab55a8e82025148893%2Fa70640885fa4493fbf1df112f0153b38"
    },
    {
      "author": "SAMY MAGDY, WAFAA SHURAFA, JOSEF FEDERMAN",
      "description": "Israel’s full Cabinet is meeting on a Gaza ceasefire deal after Prime Minister Benjamin Netanyahu confirmed an agreement had been reached that would pause the 15-month war with Hamas and release dozens of hostages. The security Cabinet recommended the deal’s approval earlier Friday. The full Cabinet was expected to approve the ceasefire, which could start as soon as Sunday. The deal has drawn fierce resistance from Netanyahu’s far-right coalition partners, but their objections could destabilize his government. The Cabinet was meeting well past the beginning of the Jewish sabbath, a rare occurrence and a reflection of the moment’s importance.",
      "publishedAt": "2025-01-17T09:47:47Z",
      "title": "Israel's full Cabinet meets on Gaza ceasefire deal after security Cabinet recommends approval",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-01-17-2025-9a97e6c7b2badb3d3e278ab090d6ad15",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9d6a20/2147483647/strip/true/crop/5062x2847+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2Fe0%2F3befe41865c127f24d9a951ffb99%2F4a5bf1cc8eea493a8e4fe9c86eb08cb7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}