{
  "articles": [
    {
      "author": "STEVE KARNOWSKI and HEATHER HOLLINGSWORTH",
      "description": "BURNSVILLE, Minn. (AP) — The paramedic who was killed in a deadly shooting in Minnesota was providing aid to an injured officer when he was shot, authorities said Sunday. Minnesota Bureau of Criminal Apprehension Superintendent Drew Evans says the paramedic was a part of a SWAT team that had been called to a domestic situation in the Minneapolis suburb of Burnsville.",
      "publishedAt": "2024-02-18T17:03:35Z",
      "title": "A paramedic killed in a Minnesota shooting was providing aid to fallen officers when he was shot",
      "url": "https://apnews.com/e742b13f0d2ddca009e38337f46435b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca88d332d38c4650bbdfd0b8d21a70c2/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Dwindling ammunition threatens Ukraine’s hold on the 1,000-kilometer (620-mile) front line under withering assault by Russian artillery. Defensive lines are in jeopardy. Ukrainian forces withdrew from the city of Avdiivka in the Donetsk region on Saturday after daily Russian onslaughts from three directions for the last four months.",
      "publishedAt": "2024-02-18T18:31:24Z",
      "title": "Ukrainian forces don't have enough artillery to battle Russia. A key withdrawal Saturday shows that",
      "url": "https://apnews.com/063ab1bd47a500ad4a815b12f3d1386d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73e1b119a29645b2821dad064d9daef2/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli Prime Minister Benjamin Netanyahu on Sunday brushed off growing calls to halt the military offensive in Gaza, vowing to “finish the job” as a member of his War Cabinet threatened to invade the southern city of Rafah if remaining Israeli hostages are not freed by the upcoming Muslim holy month of Ramadan.",
      "publishedAt": "2024-02-18T08:19:52Z",
      "title": "Israel vows to 'finish the job' in Gaza as War Cabinet member threatens a Ramadan deadline for Rafah",
      "url": "https://apnews.com/380f901e8c2f52d537d0aa9f9bf0a6bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29c4f97eb37b4ae3905fca8c8473fcdd/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Celebrity pastor Joel Osteen's Houston megachurch held a special service Sunday dedicated to healing and thanksgiving a week after a woman opened fire in one of its hallways before being gunned down by security officers.",
      "publishedAt": "2024-02-18T05:04:42Z",
      "title": "Houston megachurch holds healing and thanksgiving service a week after deadly shooting",
      "url": "https://apnews.com/23fcb12563d39f9b9d421ef9677a8f81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/623ad9604a434768b53ac9ceb5dd1424/3000.jpeg"
    },
    {
      "author": null,
      "description": "MELBOURNE, Australia (AP) — Police say 53 men have been massacred in tribal violence in Papua New Guinea, Australian state media reported on Monday.The men were shot dead in an ambush in Enga province in the remote highlands region of the South Pacific island nation, Australian Broadcasting Corp reported.",
      "publishedAt": "2024-02-18T23:03:36Z",
      "title": "Police say 53 men massacred in Papua New Guinea tribal violence, Australian state media reports",
      "url": "https://apnews.com/8b3615e28e5b64fa8bf8090d06fec3f4",
      "urlToImage": ""
    },
    {
      "author": "MIKE CORDER and JULIA FRANKEL",
      "description": "THE HAGUE, Netherlands (AP) — The United Nations' highest court opens historic hearings Monday into the legality of Israel's 57-year occupation of lands sought for a Palestinian state, plunging the 15 international judges back into the heart of the decades-long Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-18T05:07:41Z",
      "title": "Top UN court to hold hearings on legality of the Israeli occupation of Palestinian-claimed lands",
      "url": "https://apnews.com/8e194a5d96bc6a2264a0bb3de8576210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32db803a35dc495eab7ca900eb84d369/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "REHOBOTH BEACH, Del. (AP) — Sen. Tim Scott, a potential running mate if Donald Trump becomes the Republican presidential nominee, is treading carefully on questions about whether he would have certified the 2020 election had he been vice president at that time.",
      "publishedAt": "2024-02-18T18:20:29Z",
      "title": "Trump VP contender Tim Scott doesn't want to talk about vice president's role in certifying election",
      "url": "https://apnews.com/17c4866bce89cc334f8a04159907be59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40f0c6abe8b4496cbd9bc17f23221e1e/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Over 300 people were detained in Russia while paying tribute to opposition leader Alexei Navalny, who died at a remote Arctic penal colony, a prominent rights group reported Sunday.",
      "publishedAt": "2024-02-18T09:30:59Z",
      "title": "Over 300 detained in Russia as country mourns the death of Alexei Navalny, Putin's fiercest foe",
      "url": "https://apnews.com/d0121f49840ee1cd6fbf94f6d7249e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7aac174d6b64ca5bb78ade989f790aa/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Atom bomb epic “Oppenheimer” won seven prizes, including best picture, director and actor, at the 77th British Academy Film Awards on Sunday, cementing its front-runner status for the Oscars next month.",
      "publishedAt": "2024-02-18T10:45:19Z",
      "title": "'Oppenheimer' wins seven prizes, including best picture, at the British Academy Film Awards",
      "url": "https://apnews.com/220af1ec73e47e6222abe2b0934cddc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ed71b9bc2d54450a9f69e1f029d8746/1920.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "DAYTONA BEACH, Fla. (AP) — NASCAR has postponed the season-opening Daytona 500 until Monday because of two days of rain at Daytona International Speedway.The race had been scheduled for Sunday afternoon, although the weather forecast put that in doubt all week.",
      "publishedAt": "2024-02-18T14:48:07Z",
      "title": "Rain pushes Daytona 500 to Monday in first outright postponement since 2012",
      "url": "https://apnews.com/c6b85bbe1d8fb1efd09f22703ae89ca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36293e8a770a4347b800efb3824f741c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}