{
  "articles": [
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The Israeli military said it struck Hezbollah’s headquarters in Beirut on Friday in a series of massive explosions that targeted the leader of the militant group and leveled multiple high-rise apartment buildings.",
      "publishedAt": "2024-09-27T15:34:31Z",
      "title": "Israel strikes Hezbollah in a huge blast targeting the militant group's leader",
      "url": "https://apnews.com/617575d9c5d7c711bc02e7b81d2ba4ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc9881c20d1c4d84ae82a57c898899f2/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "UNITED NATIONS (AP) — Israeli leader Benjamin Netanyahu signaled to the world from the United Nations on Friday that the multiple conflicts in the Middle East were far from resolved, and he vowed to continue battling the Lebanese Hezbollah and defeat Hamas in the Gaza Strip until “total victory.\"",
      "publishedAt": "2024-09-27T13:58:12Z",
      "title": "Netanyahu, at UN, vows that Israel will keep 'degrading Hezbollah' until its objectives are met",
      "url": "https://apnews.com/12e02fd82f35a8438aa907ca6762bac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e0933ea56a84a2a96614c8ce8ed5108/1920.jpeg"
    },
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "PERRY, Fla. (AP) — Hurricane Helene left an enormous path of destruction across Florida and the entire southeastern U.S.",
      "publishedAt": "2024-09-27T05:27:23Z",
      "title": "Rescuers race to free people trapped by Hurricane Helene after storm kills at least 40 in 4 states",
      "url": "https://apnews.com/e5769b56dea81e40fae2161ad1b4e75d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c5d4ba0d39f4bd5be03659c7a33227b/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams pleaded not guilty Friday to federal bribery charges, firmly rejecting allegations that he accepted overseas travel, campaign cash and other perks from foreign interests seeking to harness his influence.",
      "publishedAt": "2024-09-27T04:04:16Z",
      "title": "New York City Mayor Eric Adams pleads not guilty to taking bribes and illegal campaign contributions",
      "url": "https://apnews.com/f384ecdbf6a7b6664bd898e7ebce6e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6c52074bbf64c84a7f69d13666db9de/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "DOUGLAS, Ariz. (AP) — Vice President Kamala Harris walked a scrubby stretch of fence line along Arizona’s border with Mexico on Friday, making her first visit to the international boundary since becoming the Democratic presidential nominee as she confronts one of her biggest vulnerabilities ahead of the November election.",
      "publishedAt": "2024-09-27T09:05:03Z",
      "title": "Harris arrives at the US-Mexico border to try to show that her record is more than Trump criticisms",
      "url": "https://apnews.com/4a87c6f3b2df1736aa226bc620f51b89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92e8e3b856194fbfb045ff687391e36b/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON and LISA MASCARO",
      "description": "NEW YORK (AP) — Ukrainian President Volodymyr Zelenskyy met face-to-face with Donald Trump on Friday with public tensions rising between the two over Ukraine's defense against Russia's invasion and in the midst of the U.S.",
      "publishedAt": "2024-09-27T04:05:15Z",
      "title": "Trump and Zelenskyy meet in New York as election holds high stakes for US support for Ukraine",
      "url": "https://apnews.com/7c163eb5068c5003b219b6d524436517",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f2faacb616b491cbd5b0fdd4dedb7ea/1920.jpeg"
    },
    {
      "author": "BY QASSIM ABDUL-ZAHRA and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. announced an agreement with the Iraqi government Friday to wrap up the military mission in Iraq of an American-led coalition fighting the Islamic State group by next year, with U.S.",
      "publishedAt": "2024-09-27T19:16:34Z",
      "title": "Wrapping up mission, US troops will leave some longstanding bases in Iraq under new deal",
      "url": "https://apnews.com/a79aa83dca8f776f87a138bfe5697fa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b66ef9299e1949e28de2c7f4718b5861/3000.jpeg"
    },
    {
      "author": "TAMMY WEBBER, BRITTANY PETERSON and CAMILLE FASSETT",
      "description": "BELLVUE, Colo. (AP) — Camille Stevens-Rumann crouched in the dirt and leaned over evergreen seedlings, measuring how much each had grown in seven months.\"That's two to three inches of growth on the spruce,” said Stevens-Rumann, interim director at the Colorado Forest Restoration Institute.",
      "publishedAt": "2024-09-27T13:31:43Z",
      "title": "As many forests fail to recover from wildfires, replanting efforts face huge odds -- and obstacles",
      "url": "https://apnews.com/74c5ada85dcbe64d2972a15f2d5b4710",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/693294e92b8441239e714d839e8745fe/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Three Iranian operatives have been charged with hacking Donald Trump’s presidential campaign as part of what the Justice Department says was a sweeping effort to undermine the former president and erode confidence in the U.S.",
      "publishedAt": "2024-09-27T16:24:43Z",
      "title": "Iranian operatives charged in the US with hacking Donald Trump's presidential campaign",
      "url": "https://apnews.com/1d7d83ccdc6c879be2802142f1c47191",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a762534171c244abb14b1d40611082f7/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Maggie Smith, the masterful, scene-stealing actor who won an Oscar for the 1969 film “The Prime of Miss Jean Brodie” and gained new fans in the 21st century as the dowager Countess of Grantham in “ Downton Abbey” and Professor Minerva McGonagall in the Harry Potter films, died Friday.",
      "publishedAt": "2024-09-27T13:16:20Z",
      "title": "Maggie Smith, scene-stealing actor famed for Harry Potter and 'Downton Abbey,' dies at 89",
      "url": "https://apnews.com/03a7b4143cc54b14bc7d9bca24ed1f9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ddac8a5af884c57807497e6b0a32bec/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}