{
  "articles": [
    {
      "author": "JOHN HANNA, MICHAEL CASEY, ADAM GELLER",
      "description": "Passengers aboard the American Airlines flight that collided with an Army helicopter and crashed into the Potomac River included athletes returning from the U.S. Figure Skating Championships and their Russian coaches, a group of hunters coming home after a guided trip in Kansas and an Ohio college student headed back to campus after attending her grandfather's funeral. There were 60 passengers and four crew members on the American Airlines flight Wednesday and three soldiers aboard the training flight on the Black Hawk helicopter. Authorities say there were no survivors.",
      "publishedAt": "2025-01-30T12:36:38Z",
      "title": "Evgenia Shishkova & Vadim Naumov among skaters in D.C. plane crash",
      "url": "https://apnews.com/article/washington-plane-collision-victims-ee829891574aa35a30d8262b7e07e638",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e4193b/2147483647/strip/true/crop/7826x4402+0+407/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fed%2F45247cfd85effb00430c0ab8fae8%2Fe1ce315efc9b4b9f8da575955bd80dc3"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP, ADRIANA GOMEZ LICON, LEA SKENE",
      "description": "A midair collision between an Army helicopter and an American Airlines flight from Kansas has killed all 67 people aboard the two aircraft. That was the word from authorities Thursday as they scrutinized the actions of the military pilot after the country’s deadliest aviation disaster in almost a quarter century. At least 28 bodies were pulled from the icy waters of the Potomac River after the helicopter apparently flew into the path of the jet late Wednesday while it was landing at Ronald Reagan National Airport near Washington. The plane carried 60 passengers and four crew. Three soldiers were aboard the helicopter.",
      "publishedAt": "2025-01-31T05:09:23Z",
      "title": "Midair collision kills 67 people in the deadliest US air disaster in almost a quarter century",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-325edc6c0c2439dd6c1e73a81e382c0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb5006c/2147483647/strip/true/crop/5606x3153+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F5e%2F2906f862faa347ab67a750b218ee%2F6bf61d420d0b48b496f94fb121f81120"
    },
    {
      "author": null,
      "description": "The two Russian figure skating coaches killed in the American Airlines crash were two-time Olympians and former world champions in the pairs event. They were also a married couple with a son who finished fourth last week at the U.S. national championships in Wichita, Kansas. Their son was not on the same flight. Evgenia Shishkova and Vadim Naumov won a world championship title together in pairs skating in 1994 and narrowly missed out on Olympic medals that year at the Lillehammer Games before moving to the U.S. and coaching generations of young skaters in New England. Kremlin spokesman Dmitry Peskov confirmed the pair had been on board the plane.",
      "publishedAt": "2025-01-30T17:30:29Z",
      "title": "World champion Russian skaters on American Airlines jet built a new life as coaches in the US",
      "url": "https://apnews.com/article/vadim-naumov-evgenia-shishkova-dc-jet-crash-c4788cb6f3e123f0caff83e57347a00d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1abbadc/2147483647/strip/true/crop/2968x1669+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F06%2F80f8205a35461e700d179ac83160%2Ffa2760fa26884e88b996ea915fa37109"
    },
    {
      "author": "RYAN J. FOLEY, JIM MUSTIAN, MICHAEL BIESECKER",
      "description": "The airspace around Washington, D.C., is congested and complex — a combination aviation experts have long worried could lead to catastrophe. Those fears materialized Wednesday night when an American Airlines plane collided with a military helicopter, taking the lives of 67 people, including three soldiers and more than a dozen figure skaters. Even in peak flying conditions, experts say, the airspace around Reagan Washington National Airport can challenge the most experienced pilots, who must navigate hundreds of other commercial planes, military aircraft and restricted areas around sensitive sites.",
      "publishedAt": "2025-01-31T01:00:34Z",
      "title": "Pilots have long worried about DC's complex, crowded airspace",
      "url": "https://apnews.com/article/american-airlines-5342-blackhawk-reagan-national-airport-81a43f2ba5cc59cbe9273fa593f1e9cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/d58b903/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fe2%2Fa0234435897aa9a3205223fc102b%2Ff5fe6030d3884a3595d58a5a66a16c10"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "President Donald Trump began his White House briefing with a moment of silence and a prayer for the victims of Wednesday’s crash at Reagan National Airport. But his remarks quickly became a diatribe against diversity hiring. Trump on Thursday variously pointed the finger at the helicopter’s pilot, air traffic control, his predecessor, Joe Biden, and other Democrats including former Transportation Secretary Pete Buttigieg, whom he labeled a “disaster.” Buttigieg responded by calling Trump “despicable.” The cause of the crash is still unknown. Authorities are investigating and have not publicly identified the cause or said who might have been responsible for the collision of an American Airlines plane and a U.S. Army helicopter.",
      "publishedAt": "2025-01-30T20:08:21Z",
      "title": "What Trump said about the DC plane crash and his claims about DEI",
      "url": "https://apnews.com/article/plane-crash-washington-dc-trump-dei-claims-3ac5486ec594d81e919e8ebbd9733869",
      "urlToImage": "https://dims.apnews.com/dims4/default/5454c76/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F2c%2Fa60d352ef8ecca2f26934fc63665%2Fa22ef2f8043e41bf8f97c67f66d5acb4"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Lebanon's Health Ministry says Israeli strikes that hit an unofficial border crossing in eastern Lebanon killed two people and wounded 10. The Israeli military said in a statement on Friday that it struck “a military site that included underground infrastructure for developing and producing combat equipment, in addition to infrastructure for crossing the Syrian-Lebanese border,” used by the militant group Hezbollah in the Bekaa Valley. Hamas also released the names of three male hostages set to be released Saturday in the fourth round of exchanges in the ceasefire deal that has paused fighting in Gaza. The previous day in Gaza, Hamas released eight hostages in exchange for 110 Palestinian prisoners held by Israel.",
      "publishedAt": "2025-01-31T10:22:04Z",
      "title": "Middle East latest: Israeli strike hits unofficial border crossing in Lebanon",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-ceasefire-news-01-31-2025-bec2c535faedea457f837d6dbef64d81",
      "urlToImage": "https://dims.apnews.com/dims4/default/1477cbf/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fb4%2F8fb791026ad9e9fe2833a3ebc6cc%2Fd51ffc1d5a6a46d3b4025c915d42b71d"
    },
    {
      "author": "JILL LAWLESS",
      "description": "Friday marks five years since Britain left the European Union at 11 p.m. on Jan. 31, 2020. People and businesses are still wrestling with the economic, social and cultural aftershocks of a decision that divided the country. For businesses, Brexit has meant new red tape, costs and delays to trading with the 27 EU countries. Brexit supporters argue that short-term pain will be offset by Britain’s new freedom to strike trade deals around the world, though so far they have had only a minor impact. British Prime Minister Keir Starmer has promised to “reset” relations with the EU after years of acrimony. But rejoining the bloc remains a distant prospect.",
      "publishedAt": "2025-01-31T05:50:11Z",
      "title": "5 years after Britain left the EU, the full impact of Brexit is still emerging",
      "url": "https://apnews.com/article/brexit-five-year-anniversary-uk-eu-economy-8a8b87fb3ddd9e9ac278469c291f97c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/81bcfe5/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fa9%2F256f4ef6d693c75a3e51b5528173%2F6d76c490a5ee4b9089e5c0d2fe317751"
    },
    {
      "author": "MARK THIESSEN",
      "description": "The Alaska Gold Rush town of Nome was hundreds of miles from anywhere, cut off by the frozen sea and under siege from a contagious disease known as the “strangling angel” for the way it suffocated children. Now, 100 years later, Nome is remembering its saviors, the sled dogs and mushers who raced hundreds of miles to deliver its cure. It took more than five days through hypothermia, frostbite, gale-force winds and blinding whiteouts to bring the life-saving serum to the community on Feb. 2, 1925. Events celebrating the serum run centennial are being celebrated throughout Alaska and elsewhere. A Maine man is even recreating the 675-mile trip with sled dogs in Alaska.",
      "publishedAt": "2025-01-31T05:01:51Z",
      "title": "Mushers and dogs braved a horrific Alaska winter to deliver lifesaving serum 100 years ago",
      "url": "https://apnews.com/article/alaska-diphtheria-outbreak-nome-anniversary-dogs-balto-3fc1889c11e5c310c1cacb186f841125",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f0c0e6/2147483647/strip/true/crop/3000x1688+0+356/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F8f%2F705573c0c0760de1048bb438c271%2F5597ca8c794a45b3a62ad35073ba59f2"
    },
    {
      "author": "JEFF AMY, RIO YAMAT",
      "description": "Seven of the 67 people killed when an American Airlines jet collided midair with an Army helicopter were members of the two flight crews. The American Airlines crew members were traveling on a daily route from Wichita, Kansas, to Washington, D.C., on Wednesday night. The soldiers aboard the Black Hawk helicopter were conducting an annual night proficiency training flight. Family and friends have identified three of the four members on the American Airlines flight as pilots Sam Lilley and Jonathan Campos and flight attendant Danasia Elder. Relatives identified two of the soldiers as Ryan O'Hara and Andrew Eaves.",
      "publishedAt": "2025-01-31T05:02:32Z",
      "title": "Crews in midair crash included 2nd-generation pilot and flight attendant ‘full of life’",
      "url": "https://apnews.com/article/plane-crash-kansas-dc-american-airlines-army-4fb9cd89ef9023fa848fc2331b24ee8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d76ad86/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F41%2Fdcefdad62349006a500a7fe51ef4%2Fbf2aed08f1ff477cb468ac4bcb35c563"
    },
    {
      "author": null,
      "description": "A deadly midair collision between an American Airlines jet and an Army helicopter near the nation's capital is bringing renewed focus on the federal agency charged with investigating aviation disasters. National Transportation Safety Board Chairwoman Jennifer Hommendy has described the investigation into Wednesday night's crash as an “all-hands-on-deck event” for her agency. She appeared at a news conference Thursday with members of the board and a senior investigator overseeing the probe. The NTSB is an independent federal agency responsible for investigating all civil aviation accidents and other serious incidents in the U.S. Authorities say 60 passengers and four crew died aboard the jet and three soldiers aboard the helicopter.",
      "publishedAt": "2025-01-31T05:02:38Z",
      "title": "What to know about the NTSB and the investigation into the DC plane crash",
      "url": "https://apnews.com/article/national-transportation-safety-board-dc-helicopter-crash-e6f43d112e9fa48f7a2ead01a6a61d27",
      "urlToImage": "https://dims.apnews.com/dims4/default/a84ae8a/2147483647/strip/true/crop/4598x2586+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F86%2F6ca1cbd5a05647d8c2bcc12e0c8e%2F6aeda13ca79845479ce60ea1704538f4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}