{
  "articles": [
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration believes it has won assurances from Israel that it will not hit Iranian nuclear or oil sites as it looks to strike back following Iran's missile barrage earlier this month, two U.S.",
      "publishedAt": "2024-10-15T16:04:08Z",
      "title": "Israel assures US it won't strike Iranian nuclear or oil sites, US officials say",
      "url": "https://apnews.com/f5dd702de7d990dd1d00f665e1484dee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0a06d036df4bd69b3bd2004af1acf4/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "DETROIT (AP) — Vice President Kamala Harris stopped by a Detroit art gallery Tuesday accompanied by three Hollywood stars for a conversation with Black men about entrepreneurship as both she and Donald Trump sought to energize key constituencies their allies worry may be slipping away.",
      "publishedAt": "2024-10-15T15:13:51Z",
      "title": "Harris zeroes in on Black men as she and Republican Donald Trump seek to fire up key voting blocs",
      "url": "https://apnews.com/2eab5daa1095b7ecb38fe92857acdb86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63c7cadfd02e4425bee729775621ae37/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Democratic vice presidential nominee Minnesota Gov. Tim Walz on Tuesday unveiled his ticket's plans to improve the lives of rural voters, as Vice President Kamala Harris looks to cut into former President Donald Trump's support.",
      "publishedAt": "2024-10-15T10:23:22Z",
      "title": "Walz unveils Harris' plan for rural voters as campaign looks to cut into Trump's edge",
      "url": "https://apnews.com/291214562d083593f29f8972429a9bec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b31e8d5138346229ae776446a1d092d/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON",
      "description": "RALEIGH, N.C. (AP) — North Carolina Republican Lt. Gov. Mark Robinson sued CNN on Tuesday over its recent report that he made explicit racial and sexual posts on a pornography website’s message board, calling the reporting reckless and defamatory.",
      "publishedAt": "2024-10-15T14:02:00Z",
      "title": "North Carolina governor candidate Mark Robinson sues CNN over report about posts on porn site",
      "url": "https://apnews.com/e195d3d8a03ce7d0b3496ab7cecefbe7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78f124d3725348cb9b46f91bf584685f/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and JILL COLVIN",
      "description": "CHICAGO (AP) — Donald Trump seized Tuesday on an opening to sound his frequent argument that imposing huge tariffs on foreign goods would amount to an economic elixir — one that he claims would raise enormous sums for the government, protect U.S.",
      "publishedAt": "2024-10-15T20:06:32Z",
      "title": "Trump uses interview on economics to promote tariffs and riff on his favorite themes",
      "url": "https://apnews.com/6a4b07be04e342bf657ad12ef7b6bbfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18018b1bba846ce941f6fc9a75134e6/3000.jpeg"
    },
    {
      "author": "MAKIYA SEMINERA and SARAH BRUMFIELD",
      "description": "ASHEVILLE, N.C. (AP) — Federal disaster personnel have resumed door-to-door visits as part of their hurricane-recovery work in North Carolina, an effort temporarily suspended amid threats that prompted officials to condemn the spread of disinformation.",
      "publishedAt": "2024-10-15T18:42:10Z",
      "title": "FEMA resumes door-to-door visits in North Carolina after threats tied to disinformation",
      "url": "https://apnews.com/04b8f753a82c652bc013d556d22a5d46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed57c7800c0645b6afefd6a654f3e87b/1920.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — A diplomatic row that has strained bilateral relations between India and Canada for over a year has boiled over as the countries expelled each other’s top diplomats over the killing of a Sikh activist in Canada and allegations of other crimes there.",
      "publishedAt": "2024-10-15T12:02:11Z",
      "title": "Canada-India dispute over assassination allegations could impact Modi's global ambitions",
      "url": "https://apnews.com/42080eab5c86b861f44ed7bb3f33b4e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28555c2272fd4b3b919af9d81c6b535e/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "U.S. Agriculture Department officials have launched an internal investigation into how the agency handled reports of serious problems at a Boar's Head deli meat plant tied to a deadly listeria outbreak, a lawmaker said Tuesday.",
      "publishedAt": "2024-10-15T15:19:16Z",
      "title": "USDA launches an internal investigation into the deadly Boar's Head outbreak",
      "url": "https://apnews.com/bdcecaa25363c87d08ba01cf71aefb0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2ad11f6f4041099fb9ea07974d1df7/3000.jpeg"
    },
    {
      "author": "SALLY HO and MAE ANDERSON",
      "description": "Now that the threat of Hurricanes Helene and Milton has receded, millions of homeowners and business-owners across Florida and the Southeastern U.S.",
      "publishedAt": "2024-10-15T17:35:49Z",
      "title": "After hurricanes, the business of rebuilding lives means navigating the insurance claims process",
      "url": "https://apnews.com/292d09e727f9c7b4ad59d23e1703e876",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a633b247e67b41f19218947003ba6bd8/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA and MELISSA PEREZ WINDER",
      "description": "CHICAGO (AP) — For Luis Martinez, competing in lowriding bike and car competitions is about more than glory and bragging rights. The lowrider clubs in the Chicago area have become like one big family and a source of mutual support.",
      "publishedAt": "2024-10-15T13:28:18Z",
      "title": "Lowriding is more than just cars. It's about family and culture for Mexican Americans",
      "url": "https://apnews.com/762d6d557c73f5c8b251257201797cf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d030ac33ab44438a931eb97bee238e74/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}