{
  "articles": [
    {
      "author": "STEVE PEOPLES and MEG KINNARD",
      "description": "NEW YORK (AP) — Donald Trump recounted his assassination attempt in vivid detail and promised the largest deportation in U.S. history during a high-profile return to the social media platform formerly known as Twitter — a conversation that was plagued by technical glitches.",
      "publishedAt": "2024-08-12T14:19:34Z",
      "title": "Trump and Musk talk about assassination attempt and deportations during glitchy chat on X",
      "url": "https://apnews.com/83d6d07fc0ffef4151c96fc56aeec9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753f2fede2ff4fa781b89575f58b7544/2205.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is trying to outmaneuver former President Donald Trump and address old vulnerabilities on her policy positions as she starts to fill in how she would govern if elected in November.",
      "publishedAt": "2024-08-13T04:10:04Z",
      "title": "Harris cautiously rolls out policy, aiming to outmaneuver Trump and address 2020 liabilities",
      "url": "https://apnews.com/e606b41cce817e69a38663cc68ce7ad6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1905480e4784449a5079c1e4319ae6d/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "At least three news outlets were leaked confidential material from inside the Donald Trump campaign, including its report vetting JD Vance as a vice presidential candidate. So far, each has refused to reveal any details about what they received.",
      "publishedAt": "2024-08-13T04:11:48Z",
      "title": "News outlets were leaked insider material from the Trump campaign. They chose not to print it",
      "url": "https://apnews.com/e30bdccbdd4abc9506735408cdc9bf7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24cea06d6f9f4ad1aead3f916e2e4668/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The leaders of France, Germany and Britain in a joint statement have endorsed the latest push by mediators United States, Qatar and Egypt to broker an agreement to end the 10-month Israel-Hamas war.",
      "publishedAt": "2024-08-12T06:24:00Z",
      "title": "Israel-Hamas war latest: Leaders of France, Germany and Britain endorse push for cease-fire in Gaza",
      "url": "https://apnews.com/ea8cb6224cd789e7b19f6130a6201026",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52937ea7862b47d39f6204c886fec4a1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen's Houthi rebels targeted shipping in the Red Sea on Tuesday, officials said, the latest in their campaign of assaults over the Israel-Hamas war.",
      "publishedAt": "2024-08-13T02:08:16Z",
      "title": "Suspected attacks by Yemen's Houthi rebels target shipping in the Red Sea, officials say",
      "url": "https://apnews.com/ca514c95d58b0395dd09b70e76753e3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfc79ce8f2fc449286513489ead794e5/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.",
      "publishedAt": "2024-08-12T09:24:25Z",
      "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia's Kursk region",
      "url": "https://apnews.com/afa42b9613323901bef07800ac2cae9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/511d837f510849558a3f22a73bea2f98/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "KOBLENZ, Germany (AP) — Sasha Skochilenko and Sofya Subbotina are planning to get married.",
      "publishedAt": "2024-08-13T04:09:27Z",
      "title": "Russian artist released in swap builds a new life in Germany, now free to marry her partner",
      "url": "https://apnews.com/0bffaa2bfc70db2d63f1ca6bca486d9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec24a74ba117485eb3a3e5d64fa26fad/2860.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "NORTHFIELD, Ill. (AP) — The students — most with gray hair, some with canes, all at least in their 60s — couldn't believe what they were hearing.“Oh, my God,” whispered a retired college professor.",
      "publishedAt": "2024-08-13T04:21:08Z",
      "title": "Older Americans prepare themselves for a world altered by artificial intelligence",
      "url": "https://apnews.com/bc30958c273af7c79bfe77d321617738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be8ac43ea1214c66a7c5837285b3e8ba/1920.jpeg"
    },
    {
      "author": "MONIKA PRONCZUK",
      "description": "MLOMP, Senegal (AP) — It’s almost dusk, and the West African heat is finally faltering. In Mlomp, a village in southern Senegal, dozens of teenagers in colorful jerseys are throwing each other to the ground to the rhythm of Afrobeats against a backdrop of palm trees.",
      "publishedAt": "2024-08-13T04:30:07Z",
      "title": "In one region of Senegal, girls can become wrestlers — and win. But only until marriage",
      "url": "https://apnews.com/e2920d24ccdbc0b87f83a6b222595edf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fa2d1f4271941c3a259d68066a6d9d5/2400.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "USA Gymnastics officials say an arbitration panel won't reconsider a decision asking gymnast Jordan Chiles to return the bronze medal she was awarded in the floor exercise at the Paris Olympics.",
      "publishedAt": "2024-08-12T22:54:40Z",
      "title": "Jordan Chiles medal inquiry: USA Gymnastics says arbitration panel won't reconsider decision",
      "url": "https://apnews.com/b982ecfff1e846c57b0e1cb524a84cad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/897c653e592140c3a9a96bb6dab606b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}