{
  "articles": [
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — As the Senate marches ahead with a bipartisan approach to prevent a government shutdown, House Speaker Kevin McCarthy is back to square one — asking his hard-right Republicans to do what they have said they would never do: approve their own temporary House measure to keep the government open.",
      "publishedAt": "2023-09-27T16:03:16Z",
      "title": "House Speaker McCarthy is back to square one as the Senate pushes ahead to avert a federal shutdown",
      "url": "https://apnews.com/18ef8a03363d31742c5b4c5ecb23506f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b04ce8047e34e779ac991ebc2eff575/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and STEVE PEOPLES",
      "description": "SIMI VALLEY, Calif. (AP) — Republicans are meeting for their second presidential debate on Wednesday as Donald Trump's top rivals seek to blunt the momentum of the former president, who is so confident of cruising through the party's primary that he again won't share a stage with them.",
      "publishedAt": "2023-09-27T04:02:52Z",
      "title": "Republicans face growing urgency to stop Trump as they enter the second presidential debate",
      "url": "https://apnews.com/46ce9209b5150d577d5ff361522f6bed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b2bfd7ba1ba4a86819869dc3a5eeaea/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and TOM KRISHER",
      "description": "DETROIT (AP) — As his Republican rivals gather onstage in California for their second primary debate, former President Donald Trump will be in battleground Michigan on Wednesday night working to win over blue-collar voters in the midst of an autoworkers’ strike.",
      "publishedAt": "2023-09-27T04:08:08Z",
      "title": "Trump heads to Michigan to compete with Biden for union votes while his GOP challengers debate",
      "url": "https://apnews.com/165c2d45cb43992814b23a1f6c7572f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54f97c2473d54316a3079b9fbd9be0c7/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, KIM TONG-HYUNG and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. has secured the release of a U.S. soldier who sprinted across a heavily fortified border into North Korea more than two months ago, and he is on his way back to America, officials announced Wednesday.",
      "publishedAt": "2023-09-27T10:30:06Z",
      "title": "US secures the release of the soldier who crossed into North Korea 2 months ago",
      "url": "https://apnews.com/00c171778e378d95fe1115fe31612ec2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25aad81ef84e4772a2288aa9f224a8a8/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER, ALANNA DURKIN RICHER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez of New Jersey pleaded not guilty on Wednesday to federal charges accusing him of pocketing bribes of cash and gold bars in exchange for wielding his political influence to secretly advance Egyptian interests and do favors for local businessmen.",
      "publishedAt": "2023-09-27T04:09:54Z",
      "title": "US Sen. Bob Menendez pleads not guilty to pocketing bribes in a wide-ranging corruption case",
      "url": "https://apnews.com/49599ba95fbf19ed5169055e24817fea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bced26b5a644bdea54ee89ac8f14a6f/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, JENNIFER McDERMOTT and BERNARD CONDON",
      "description": "Melted remains of an old car tire. Heavily burned trees. A charred stump of an abandoned utility pole.Investigators are examining these and other pieces of evidence as they seek to solve the mystery of last month’s deadly Maui wildfire: How did a small, wind-whipped fire sparked by downed power lines and declared extinguished flare up again hours later into a devastating inferno?",
      "publishedAt": "2023-09-27T05:19:57Z",
      "title": "An old car tire, burnt trees and a utility pole may be key in finding how the Maui wildfire spread",
      "url": "https://apnews.com/d9e1e84d5cc643d6bb2a2e362fe58ba0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0f3d99ac761488296cefd77a8e26250/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The Biden administration is admitting Israel into a select group of countries whose citizens are allowed to travel to the United States without getting a visa in advance.",
      "publishedAt": "2023-09-27T12:36:55Z",
      "title": "US allows Israeli citizens to travel to US visa-free as Israel joins a select group of countries",
      "url": "https://apnews.com/bc36df8be0a4c6bd85ef39161e81248b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c0ace874ade403ea56eff904fe495d4/3000.jpeg"
    },
    {
      "author": "AMY BETH HANSON",
      "description": "HELENA, Mont. (AP) — A Montana law banning gender-affirming medical care for transgender minors is temporarily blocked, a state judge ruled Wednesday, just four days before it was to take effect.",
      "publishedAt": "2023-09-27T15:41:37Z",
      "title": "Montana judge temporarily blocks enforcement of law to ban gender-affirming medical care for minors",
      "url": "https://apnews.com/b042bea74b3f8e6be27e81572a771a8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ac2566d41ac4b50b9700767a9902702/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union says it will announce on Friday how it plans to expand its strike against Detroit's three automakers.The union says President Shawn Fain will make the announcement at 10 a.m.",
      "publishedAt": "2023-09-27T18:19:30Z",
      "title": "Auto workers union to announce plans on Friday to expand strike in contract dispute with companies",
      "url": "https://apnews.com/7e8d2b5dd74513fd299fa29f541d25d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6315ed6842e442a89d3455c0cce50ae9/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY and ANDREW DALTON",
      "description": "NEW YORK (AP) — TV's late-night hosts planned to return to their evening sketches and monologues by next week, reinstating the flow of topical humor silenced for five months by the newly ended Hollywood’s writers strike.",
      "publishedAt": "2023-09-27T14:09:47Z",
      "title": "Late-night TV shows announce their return after Hollywood writers strike ends",
      "url": "https://apnews.com/28316c5104765576b7259b180e15c05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24caa49a7e824066a5f7d3090f73cac8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}