{
  "articles": [
    {
      "author": "ZEKE MILLER, WILL WEISSERT",
      "description": "President Donald Trump says he’d like to see Arab nations increase the number of Palestinian refugees they are accepting from the Gaza Strip — potentially moving out enough of the population to “clean out” the area to create a virtual clean slate. He told reporters aboard Air Force One on Saturday that he'd discussed his vision on a call with King Abdullah II of Jordan and would speak Sunday with Egypt's president. Trump also said he’s ended his predecessor’s hold on sending 2,000-pound bombs to Israel. That lifts a pressure point meant to reduce civilian casualties during Israel's war with Hamas in Gaza that is now halted by a tenuous ceasefire.",
      "publishedAt": "2025-01-26T00:59:48Z",
      "title": "Trump wants Jordan, Egypt to accept more Palestinian refugees, floats plan to 'just clean out' Gaza",
      "url": "https://apnews.com/article/trump-biden-israel-bomb-gaza-hamas-war-023b36984c6116c128b5e47f117bba2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d566c03/2147483647/strip/true/crop/2336x1314+0+122/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F72%2Fad4536f39f5c690997435d9cd038%2Fa8f189a0753e43048107651fcc849c7d"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "President Donald Trump’s suggestion that Egypt and Jordan take in Palestinians from the war-ravaged Gaza Strip is likely to be met with a hard “no” from the two close U.S. allies and the Palestinians themselves. They fear Israel would never allow them to return. Trump floated the idea on Saturday, saying he would urge the leaders of the two Arab countries to take in Gaza’s now largely homeless population, so that “we just clean out that whole thing.” He added that resettling Gaza’s population “could be temporary or long term.”",
      "publishedAt": "2025-01-26T09:43:56Z",
      "title": "Trump wants Egypt and Jordan to take in Palestinians from Gaza. Here's why they are likely to refuse",
      "url": "https://apnews.com/article/israel-palestinians-trump-gaza-egypt-jordan-c6bedbd6ca0702c22b80f1bf07cd4326",
      "urlToImage": "https://dims.apnews.com/dims4/default/ade1884/2147483647/strip/true/crop/5780x3251+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Ffa%2F02e932572942f14009027387adb7%2F5f20ba8fa9db4dfea7f0801a3e2b336b"
    },
    {
      "author": "KAREEM CHEHAYEB, ABBY SEWELL",
      "description": "At least three people were killed and more than 40 others injured in southern Lebanon Sunday when Israeli forces opened fire on protesters who had breached roadblocks the Israeli army set up a day before, Lebanon’s health ministry reported. Demonstrators attempted to enter several villages to protest Israel’s failure to withdraw its troops from southern Lebanon by the 60-day deadline stipulated in a ceasefire agreement that halted the Israel-Hezbollah war in late November. Israel has said that it needs to stay longer because the Lebanese army has not deployed to all areas of southern Lebanon to ensure that Hezbollah does not reestablish a military presence in the area. The Lebanese army has said it cannot deploy until Israeli forces withdraw.",
      "publishedAt": "2025-01-26T08:26:24Z",
      "title": "At least 3 killed, 40 injured after Israeli forces fire on protestors in Lebanon",
      "url": "https://apnews.com/article/lebanon-israel-ceasefire-idf-withdrawal-protesters-killed-4e4f3fc42a44762d1df8dbdbbdfcf213",
      "urlToImage": "https://dims.apnews.com/dims4/default/fab6fe1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F4d%2F72fe95cdbf6efd09d5c97947ea8f%2F8bf49306808742a3b1cc662c489244e5"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JOSEPH KRAUSS",
      "description": "Health officials in Gaza say a Palestinian man was killed and seven people were wounded by Israeli fire overnight. They were among crowds who gathered in hopes of returning to the northern Gaza Strip under a fragile week-old ceasefire, the officials said Sunday. Israel on Saturday was to begin allowing Palestinians to return to northern Gaza on foot. Israel put the move on hold until Hamas freed a hostage who Israel said was supposed to have been freed that day. In a separate development, President Donald Trump suggested that most of Gaza’s population should be at least temporarily resettled elsewhere, including in Egypt and Jordan. Both countries and the Palestinians have previously rejected that idea.",
      "publishedAt": "2025-01-26T08:29:20Z",
      "title": "Israeli fire kills 1, wounds 7 as Palestinians are kept out of north Gaza over a ceasefire dispute",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-26-2025-d0f9d113ceec2dababe462967ee8d398",
      "urlToImage": "https://dims.apnews.com/dims4/default/90f2a60/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F13%2F6a1acc7e5968b8aa17ee1d2a11ab%2F2b46194b634d4ffcb5fd3e16a3d600c8"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "The war in Gaza has been devastating for children. According to U.N. agencies, more than 13,000 have been killed, an estimated 25,000 injured, and at least 25,000 hospitalized for malnutrition. As Britain’s deputy U.N. ambassador recently told the Security Council, “Gaza has become the deadliest place in the world to be a child.” James Kariuki added: “The children of Gaza did not choose this war, yet they have paid the ultimate price.” The U.N. Office for the Coordination of Humanitarian Affairs has reported that of the 40,717 Palestinian bodies identified so far in Gaza, one-third – 13,319 – were children. The office says the figures came from Gaza’s Ministry of Health.",
      "publishedAt": "2025-01-25T22:27:00Z",
      "title": "Devastating toll for Gaza's children: Over 13,000 killed and an estimated 25,000 injured, UN says",
      "url": "https://apnews.com/article/un-gaza-war-children-killed-malnutrition-israel-bef00a350a7fbe5a33dfb2c9883803ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/48b8ead/2147483647/strip/true/crop/4536x2552+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F17%2F0d40620ec4aa88f773e26b872c74%2Ff21c4b72e3c7413eadd769d59e619453"
    },
    {
      "author": "ELLIOT SPAGAT, GREGORY BULL, EUGENE GARCIA",
      "description": "President Donald Trump has declared a national emergency on the border with Mexico, saying “America’s sovereignty is under attack.” Active-duty military arrived Thursday in San Diego and El Paso, Texas. It comes at a moment of relative calm after unprecedented turmoil. Arrests for illegal border crossings plummeted more than 80% to about 47,000 in December. That was down from an all-time high of 250,000 the same period a year earlier. Arrests fell by about half when Mexican authorities increased enforcement within their own borders a year ago. And they plummeted by about half again when former President Joe Biden introduced severe asylum restrictions.",
      "publishedAt": "2025-01-25T05:05:32Z",
      "title": "On a San Diego ride-along with Border Patrol, this is what AP saw",
      "url": "https://apnews.com/article/border-patrol-emergency-asylum-trump-3479a25c4989a437c8c934b84dcf2705",
      "urlToImage": "https://dims.apnews.com/dims4/default/a25374c/2147483647/strip/true/crop/5452x3067+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F1b%2Fe1f671d6f8b245f2bdda84189a8c%2F059f312870564f3594b50d65f99d95e7"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "The CIA now believes the virus responsible for the COVID-19 pandemic most likely originated from a laboratory. That's according to an assessment released Saturday pointing the finger at China even while acknowledging the spy agency has “low confidence” in its own conclusion. The finding isn't the result of any new intelligence, and the report was completed at the behest of the Biden administration and former CIA Director William Burns. It was declassified and released Saturday on the orders of President Donald Trump’s pick to lead the agency, John Ratcliffe, who was sworn in Thursday as director.",
      "publishedAt": "2025-01-25T20:41:34Z",
      "title": "CIA believes COVID likely originated from a lab, but has low confidence in the finding",
      "url": "https://apnews.com/article/covid-cia-trump-china-pandemic-lab-leak-9ab7e84c626fed68ca13c8d2e453dde1",
      "urlToImage": "https://dims.apnews.com/dims4/default/714e457/2147483647/strip/true/crop/8819x4961+0+459/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fd9%2Fcbc02a6bca9ef0a2695e5429099d%2Fd3e968cd4d3245028a22127117683c6d"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Some 70 people were killed in an attack on the only functional hospital in the besieged city of El Fasher in Sudan. That's according to the chief of the World Health Organization. WHO Director-General Tedros Adhanom Ghebreyesus offered the figure in a post early Sunday on the social platform X. Officials and others in the capital of North Darfur province had cited a similar figure Saturday, though Ghebreyesus is the first international source to provide a casualty number. He did not identify who launched the attack, though local officials had blamed the rebel Rapid Support Force for the assault. The RSF did not immediately acknowledge the accusation, but have been threatening El Fasher in recent days.",
      "publishedAt": "2025-01-26T04:35:11Z",
      "title": "Sudan: Attack on hospital in Darfur kills at least 70, says WHO chief",
      "url": "https://apnews.com/article/sudan-war-hospital-attack-fasher-53f41de57ca442ed5dd3a8a1312f4052",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3b23b3/2147483647/strip/true/crop/811x456+0+42/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Fee%2F3b42ff58ec25ff6b3615c665e7e4%2F062ef8419d014d5d8c7b2e36cf58fabc"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump hasn’t been shy about sharing his thoughts since taking office. On Saturday night, he added a 20-minute Q&A with reporters aboard Air Force One to the mix. He held forth on everything from the color scheme on the presidential plane to the fate of TikTok and Canada. Trump popped in to the plane’s press cabin while flying from Las Vegas to Miami. He called Air Force One a “special plane” but observed that it hasn’t changed much from his last term. And, yes, he still wants to change the plane’s exterior colors — to “”power blue\" from “baby blue.”",
      "publishedAt": "2025-01-26T04:36:45Z",
      "title": "Trump's Q&A on Air Force One goes from the plane's color scheme to the fate of TikTok and Canada",
      "url": "https://apnews.com/article/trump-air-force-one-tiktok-canada-workers-06489fe4a05a352ce553e7da94a923a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Rain falling on Southern California is expected to aid firefighters mopping up multiple wildfires. But potentially heavy downpours on charred hillsides could bring new troubles such as toxic ash runoff. Los Angeles County crews spent much of the past week removing vegetation, shoring up slopes and reinforcing roads in devastated areas of the Palisades and Eaton fires. The National Weather Service says most of the region is likely to get less than an inch of precipitation. But there is a threat of localized cloudbursts causing mud and debris to flow down hills. Rain is expected to increase throughout Sunday and could last into Tuesday. Flood watches have been issued for some burn areas.",
      "publishedAt": "2025-01-26T05:17:35Z",
      "title": "Southern California rain helps firefighters but creates risk of toxic ash runoff",
      "url": "https://apnews.com/article/california-wildfires-los-angeles-palisades-eaton-rain-93b6a9d46d021ba6200030a55ce1d6c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4de318e/2147483647/strip/true/crop/6000x3375+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Ffd%2Ffa322c97bcf88ef0dc59d400e9c7%2Ff56d769f3fd841a49943887ccd9b78d0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}