{
  "articles": [
    {
      "author": "NAJIB JOBAIN, ISABEL DEBRE and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel said Wednesday that it will allow Egypt to deliver limited quantities of humanitarian aid to the Gaza Strip, the first crack in a 10-day siege on the territory.",
      "publishedAt": "2023-10-18T07:32:01Z",
      "title": "Israel will let Egypt deliver some aid to Gaza, as doctors struggle to treat hospital blast victims",
      "url": "https://apnews.com/d9606e0ead1f8c4e9fd00b602ed14a38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfbfc803943948c29737f8478eec2410/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and JOSEPH KRAUSS",
      "description": "CAIRO (AP) — Within hours after a blast was said to have killed hundreds at a Gaza hospital, protesters hurled stones at Palestinian security forces in the occupied West Bank and at riot police in neighboring Jordan, venting fury at their leaders for failing to stop the carnage.",
      "publishedAt": "2023-10-18T10:02:30Z",
      "title": "Gaza carnage spreads anger across Mideast, alarming US allies and threatening to widen conflict",
      "url": "https://apnews.com/590f24d154fb3cb256ec1707ec78b816",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3aaf12ec59fe4a5ca151e82e8b645d8d/1920.jpeg"
    },
    {
      "author": "JACK JEFFERY and SAMY MAGDY",
      "description": "CAIRO (AP) — As desperate Palestinians in sealed-off Gaza try to find refuge under Israel’s relentless bombardment in retaliation for Hamas' brutal Oct.",
      "publishedAt": "2023-10-18T17:22:36Z",
      "title": "Why Egypt and other Arab countries are unwilling to take in Palestinian refugees from Gaza",
      "url": "https://apnews.com/502c06d004767d4b64848d878b66bd3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3ab4ddcd566454996c380678b55e80e/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republican Rep. Jim Jordan failed again Wednesday on a crucial second ballot to become House speaker, the hard-fighting ally of Donald Trump losing even more GOP colleagues who are refusing to give him the gavel.",
      "publishedAt": "2023-10-18T04:07:03Z",
      "title": "GOP's Jim Jordan fails again to win vote to become House speaker and colleagues seek other options",
      "url": "https://apnews.com/994067b90a874ed46dd6a1766d89a163",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c8c94c6e9264a5aa3aa4eb15f59e84f/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge warned Donald Trump and others at his New York civil fraud trial to keep their voices down Wednesday after the former president threw up his hands in frustration and spoke aloud to his lawyers while a witness was testifying against him.",
      "publishedAt": "2023-10-18T16:57:41Z",
      "title": "Donald Trump told to keep volume down after getting animated at New York civil fraud trial",
      "url": "https://apnews.com/dd10ecf8bdc4cbf8c17990cc4f40ce9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f106d01f5ae94b11a609270ed3e43d31/3000.jpeg"
    },
    {
      "author": "MICHELLE R. SMITH and ALI SWENSON",
      "description": "When 12-year-old Braden Fahey collapsed during football practice and died, it was just the beginning of his parents’ nightmare.Deep in their grief a few months later, Gina and Padrig Fahey received news that shocked them to their core: A favorite photo of their beloved son was plastered on the cover of a book that falsely argues COVID-19 vaccines caused a spike of sudden deaths among healthy young people.",
      "publishedAt": "2023-10-18T15:52:19Z",
      "title": "RFK Jr. spent years stoking fear and mistrust of vaccines. These people were hurt by his work",
      "url": "https://apnews.com/2ccde2df146f57b5e8c26e8494f0a16a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1c6e89b6c2450ea4a727e6a769a7d4/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL, TARA COPP and QASSIM ABDUL-ZAHRA",
      "description": "BEIRUT (AP) — Two drones launched at a base hosting U.S. troops in western Iraq were intercepted Wednesday, a U.S. defense official said.Hours later, an Iraqi militia announced it had launched another drone attack on a second base.",
      "publishedAt": "2023-10-18T13:27:30Z",
      "title": "Drone attack on base hosting US troops intercepted in Iraq, heightening fears of a broader conflict",
      "url": "https://apnews.com/80f6739c3ab34662afba316285914e39",
      "urlToImage": ""
    },
    {
      "author": "KIM CHANDLER and SUDHIN THANAWALA",
      "description": "BIRMINGHAM, Ala. (AP) — Natalee Holloway was beaten to death on a beach in Aruba and her body pushed out to sea after refusing the advances of the chief suspect in the 2005 killing, who admitted to the murder before pleading guilty Wednesday to extorting money from the missing teen’s mother.",
      "publishedAt": "2023-10-18T04:08:54Z",
      "title": "Suspect admits he murdered Natalee Holloway on Aruba in 2005, pleads guilty to extorting her mom",
      "url": "https://apnews.com/1f9335330de758cd7163914b81d0759f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0546ace785d44e33a57deb1e57142000/1920.jpeg"
    },
    {
      "author": "JOHN CARUCCI",
      "description": "NEW YORK (AP) — Michael Connelly has sold more than 85 million books under nearly 40 titles, but there’s another distinction that makes him equally proud: His most famous protagonist, LAPD Det. Harry Bosch, has become the longest running character on streaming television.",
      "publishedAt": "2023-10-18T16:27:17Z",
      "title": "Author Michael Connelly proud that ‘Bosch’ has become longest running streaming character",
      "url": "https://apnews.com/5db1795b4a8c67e014342763e4a3527c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86b276282a084d1abbeea946442ca5ba/1920.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "NEW YORK (AP) — NFL Commissioner Roger Goodell said the league still needs to improve its minority hiring among head coaches.The latest rule change was aimed at increasing opportunities.Owners voted Tuesday to push in-person head coaching interviews back one more week until after all divisional playoff games have been completed to slow down the hiring process.",
      "publishedAt": "2023-10-18T18:43:12Z",
      "title": "NFL Commissioner Roger Goodell says league still needs to improve minority head coach hirings",
      "url": "https://apnews.com/37b18287d0f3b14cd6c39acae3b19354",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2b0550824a14931b0aa7494436c38f4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}