{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A Hezbollah drone attack on an army base in central Israel killed four soldiers and severely wounded seven others Sunday, the military said, in the deadliest strike by the militant group since Israel launched its ground invasion of Lebanon nearly two weeks ago.",
      "publishedAt": "2024-10-13T06:54:05Z",
      "title": "Israel says 4 soldiers killed by Hezbollah drone attack while Israeli strike in Gaza leaves 20 dead",
      "url": "https://apnews.com/a8cd5df3e2bb4ab08405a78251244bb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85dd36ba9ef74f82a612207df9210c13/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu is examining a plan to seal off humanitarian aid to northern Gaza in an attempt to starve out Hamas militants, a plan that, if implemented, could trap without food or water hundreds of thousands of Palestinians unwilling or unable to leave their homes.",
      "publishedAt": "2024-10-13T13:46:33Z",
      "title": "Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside",
      "url": "https://apnews.com/219d7eb9a3050e281ccc032d5a56263c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb132e8f0d734ca19edafb5396f5ddde/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, AAMER MADHANI and DARLENE SUPERVILLE",
      "description": "GREENVILLE, N.C. (AP) — Kamala Harris used an appearance Sunday before a largely Black church audience in battleground North Carolina to call out Donald Trump for spreading misinformation about the government's hurricane response.",
      "publishedAt": "2024-10-13T09:01:07Z",
      "title": "From the pulpit, Harris calls out Trump for hurricane misinformation. Biden surveys Florida's damage",
      "url": "https://apnews.com/84526011bf223902a04f41f59b7651b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60b7432de0d54f8db065614567966ef2/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The indictment charging Donald Trump with hoarding classified documents leveled one jaw-dropping allegation after another, including that he showed off a secret Pentagon attack plan to guests at his golf club and suggested his lawyer mislead the FBI about the presence of the White House records.",
      "publishedAt": "2024-10-14T04:12:04Z",
      "title": "This could have been a year of a federal court reckoning for Trump. Judges had other ideas",
      "url": "https://apnews.com/302f87960dbd84d7be5daedaf03328d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f6ba2041d54d82812e8270940f33a2/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Asian American, Native Hawaiian and Pacific Islander adults are more likely than the overall U.S. population to view legal immigration as an asset to the country's economy and workforce, according to a new poll.",
      "publishedAt": "2024-10-14T04:20:55Z",
      "title": "Most AAPI adults think legal immigrants give the US a major economic boost: AP-NORC/AAPI Data poll",
      "url": "https://apnews.com/3ea9472f4742e15e3979c38c68c1e59c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8406929048a24831abd2e6a7f61b3ac6/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and LAURA BARGFELD",
      "description": "TAMPA, Fla. (AP) — When ankle-deep floodwaters from Hurricane Helene bubbled up through the floors of their home, Kat Robinson-Malone and her husband sent a late-night text message to their neighbors two doors down: “Hey, we're coming.”",
      "publishedAt": "2024-10-13T04:01:54Z",
      "title": "Florida neighbors band together to recover after one-two punch from hurricanes Helene and Milton",
      "url": "https://apnews.com/a39b7a04052e9cd9d0d8598d090ea54b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbbf443d7b0d4110bf93f903717ff8dc/1920.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — China held large-scale military exercises surrounding Taiwan and its outlying islands Monday in what it called a warning against Taiwan independence. China’s Defense Ministry said the drills were a response to Taiwanese President Lai Ching-te’s refusal to concede to Beijing’s demands that Taiwan acknowledge itself as a part of the People’s Republic of China under the rule of the Communist Party.",
      "publishedAt": "2024-10-14T01:15:45Z",
      "title": "China holds large naval and air force exercises around Taiwan as a warning against independence",
      "url": "https://apnews.com/053fbadaf1125be4adfee7a7e6d1ce79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac7a276173cc4fc48d54af7ca9c1ed35/3000.jpeg"
    },
    {
      "author": "YURAS KARMANAU",
      "description": "TALLINN, Estonia (AP) — The last time any of Maria Kolesnikova's family had contact with the imprisoned Belarusian opposition activist was more than 18 months ago. Fellow inmates at the penal colony reported hearing her plead for medical help from inside her tiny and smelly cell.",
      "publishedAt": "2024-10-14T04:09:46Z",
      "title": "Ailing and silenced in prison, Belarus activist symbolizes the nation's repression",
      "url": "https://apnews.com/4c81e46b1ebba8924306c541fb7170db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7224c7ae434343148667e4e1976a67fd/3000.jpeg"
    },
    {
      "author": "BHARATHA MALLAWARACHI",
      "description": "COLOMBO, Sri Lanka (AP) — Sri Lanka closed schools in the capital Colombo and suburbs on Monday as heavy rains triggered floods in many parts of the island nation.Heavy downpours over the weekend have wreaked havoc in many parts of the country, flooding homes, fields and roads.",
      "publishedAt": "2024-10-14T04:35:38Z",
      "title": "Sri Lanka closes schools as floods hammer the capital",
      "url": "https://apnews.com/b9ea36f1ae2371fbd0403a64bf1a363a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b6b81b9bd9546e8aa5aac20bbd15efe/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "As Native Americans across the U.S. come together on Monday for Indigenous Peoples Day to celebrate their history and culture and acknowledge the ongoing challenges they face, many will do so with a focus on the election.",
      "publishedAt": "2024-10-14T04:02:00Z",
      "title": "Indigenous Peoples Day celebrated with an eye on the election",
      "url": "https://apnews.com/fb096986752c2a8f52a805335f2c66ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/200a37bd0c494985ae5dca1a019547ba/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}