{
  "articles": [
    {
      "author": "COLLEEN LONG, MIKE BALSAMO, MARY CLARE JALONICK and MICHAEL R. SISAK",
      "description": "BUTLER, Pa. (AP) — The young man was pacing around the edges of the Donald Trump campaign rally, shouldering a big backpack and peering into the lens of a rangefinder toward the rooftops behind the stage where the former president would stand.",
      "publishedAt": "2024-07-17T21:33:07Z",
      "title": "Multiple failures, multiple investigations: Unraveling the attempted assassination of Donald Trump",
      "url": "https://apnews.com/a1bcbaa4a604e09be8cc22893751895b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224594c93c3e4832a00fd1868c15b39f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, MIKE BALSAMO, MARY CLARE JALONICK and MICHAEL R. SISAK",
      "description": "BUTLER, Pa. (AP) — The young man was pacing around the edges of the Donald Trump campaign rally, shouldering a big backpack and peering into the lens of a rangefinder toward the rooftops behind the stage where the former president would stand.",
      "publishedAt": "2024-07-17T21:33:07Z",
      "title": "Multiple failures, multiple investigations: Unraveling the attempted assassination of Donald Trump",
      "url": "https://apnews.com/a1bcbaa4a604e09be8cc22893751895b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224594c93c3e4832a00fd1868c15b39f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "LAS VEGAS (AP) — President Joe Biden tested positive for COVID-19 while traveling Wednesday in Las Vegas and is experiencing “mild symptoms” including “general malaise” from the infection, the White House said.",
      "publishedAt": "2024-07-17T22:16:09Z",
      "title": "President Joe Biden tests positive for COVID-19 while campaigning in Las Vegas, has 'mild symptoms'",
      "url": "https://apnews.com/ff29bb071f18b993d20dedccbe2c8fbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e0dab66a4c14839b88979daa4e12804/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, AMELIA THOMSON-DEVEAUX and EMILY SWANSON",
      "description": "WASHINGTON (AP) — Nearly two-thirds of Democrats say President Joe Biden should withdraw from the presidential race and let his party nominate a different candidate, according to a new poll, sharply undercutting his post-debate claim that “average Democrats” are still with him even if some “big names” are turning on him.",
      "publishedAt": "2024-07-17T15:05:52Z",
      "title": "Nearly two-thirds of Democrats want Biden to withdraw, new AP-NORC poll finds",
      "url": "https://apnews.com/59eebaca6989985c2bfbf4f72bdfa112",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dde76108f51741858901c912283b71c0/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, WILL WEISSERT and LISA MASCARO",
      "description": "WASHINGTON (AP) — California Rep. Adam Schiff on Wednesday became the highest-profile Democrat to call for President Joe Biden to drop his reelection bid, even as the party pushed ahead with plans for a virtual vote to formally make Biden its nominee in the first week of August.",
      "publishedAt": "2024-07-17T14:33:53Z",
      "title": "Prominent Democrat Schiff calls for Biden to withdraw: Democrats aim to nominate before convention",
      "url": "https://apnews.com/ac84492b500ab3fd972076b592113e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e34bb5ccd09544f788f4dbd50293866e/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and KEVIN FREKING",
      "description": "WASHINGTON (AP) — The Republican chairman of the House Oversight and Accountability Committee issued a subpoena Wednesday to the Secret Service director compelling her to appear before the committee on Monday for what is scheduled to be the first congressional hearing into the attempted assassination of former President Donald Trump.",
      "publishedAt": "2024-07-17T12:39:19Z",
      "title": "House Oversight panel subpoenas Secret Service director to testify on Trump assassination attempt",
      "url": "https://apnews.com/045449b3e8f3ab7326cb779f416f83fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f7a9e9e6da54f0c8ac87c4bfbf2f972/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, CHRISTINE FERNANDO and ALI SWENSON",
      "description": "MILWAUKEE (AP) — Introducing himself to the nation after Donald Trump picked him as his running mate, JD Vance is planning to use his Wednesday night address at the Republican National Convention to share the story of his hardscrabble upbringing and make the case that the GOP ticket best understands the challenges facing many Americans.",
      "publishedAt": "2024-07-17T04:07:37Z",
      "title": "JD Vance will get his political introduction at the RNC as Trump's running mate",
      "url": "https://apnews.com/67880a3003a69938aebd3ac8a586dc65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ee9d9be526c42b9a678c0728900e59a/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. military-built pier to carry humanitarian aid to Gaza will be dismantled and brought home, ending a mission that has been fraught with repeated weather and security problems that limited how much food and other supplies could get to starving Palestinians.",
      "publishedAt": "2024-07-17T18:34:25Z",
      "title": "US military pier for carrying aid to Gaza will be dismantled after weather and security problems",
      "url": "https://apnews.com/76ff45e7ef81ae68a75ac269daaa0dd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6a95fbd7c28421a902329412a577f25/2859.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER and JAIMIE DING",
      "description": "LOS ANGELES (AP) — A former Syrian military official who oversaw a prison where human rights officials say torture and abuse routinely took place has been arrested, authorities said Wednesday.U.S.",
      "publishedAt": "2024-07-17T19:28:29Z",
      "title": "Syrian official who oversaw prison where alleged abuse took place arrested by US officials",
      "url": "https://apnews.com/9ac5579b4b5c75344f13a02fac16e865",
      "urlToImage": ""
    },
    {
      "author": "ANDREW DeMILLO and ED WHITE",
      "description": "LITTLE ROCK, Ark. (AP) — Another wave of severe storms pummeled a wide swath of the United States and Canada, leading to flash floods and water rescues Wednesday in the Ozark Mountains, dropping a tornado that ravaged a community in upstate New York and stranding drivers in high water around Toronto.",
      "publishedAt": "2024-07-17T13:38:15Z",
      "title": "Storms flood the Ozarks and strand drivers in Toronto. New York community is devastated by tornado",
      "url": "https://apnews.com/7e42c3a1e418758313ea8e85800661ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e151d76bb2a4bba9d37e6c9d604ee43/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}