{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is set to meet with European Commission chief Ursula von der Leyen in Scotland to discuss trade. Both sides are seeking an agreement on tariff rates. Trump played golf Saturday at his course in Turnberry and plans to visit another one in Aberdeen, where his family is opening a new Trump course. The meeting Sunday with von der Leyen is expected to be private. Trump mentioned a 50-50 chance of reaching a deal with the EU. The U.S. had threatened a 30% tariff rate on the EU and Trump has set a deadline for Friday. Without a deal, the EU could retaliate with tariffs on American products.",
      "publishedAt": "2025-07-27T04:02:25Z",
      "title": "President Trump to meet EU chief as tariff deadline nears",
      "url": "https://apnews.com/article/trump-scotland-tariffs-europe-8d2fb467d64f7fdfc4797dbebd54e8fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/471d607/2147483647/strip/true/crop/1237x696+0+65/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F59%2F073d29c6cec1078cb5fa0c10ec3c%2F52c9364633d54806838bc6f78375a71d"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump and European Commission President Ursula von der Leyen have announced a sweeping trade deal. It raises tariffs on most European goods to 15%, warding off Trump’s threat of a 30% rate if no deal had been reached by Aug. 1. The tariffs, or import taxes, paid when Americans buy European products could raise prices for U.S. consumers and slow growth in both the U.S. and Europe. But the deal appears to ward off a worse escalation of trade tensions.",
      "publishedAt": "2025-07-27T22:24:57Z",
      "title": "US-EU trade deal wards off escalation but could raise prices and slow growth",
      "url": "https://apnews.com/article/eu-tariffs-united-states-15-prices-growth-31e52a6dda17f3b5d70475e1cd0002ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/a53e51e/2147483647/strip/true/crop/8404x4727+0+438/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F27%2Fcbdf309f4b82921de1f5497979cf%2F51db54589d784555b44a1bd3a58d1d9b"
    },
    {
      "author": null,
      "description": "Michigan authorities say 11 people have been stabbed at a Walmart in Traverse City. Authorities say a suspect is in custody and that investigators believe those hurt Saturday were not specifically targeted. The Grand Traverse County Sheriff's Office says that around 4:45 p.m., a 42-year-old man entered the store and used a folding knife to stab 11 people. The sheriff's office says a deputy arrived within minutes and took the man into custody. It also says that people in the store helped apprehend the suspect and treat victims. Munson Healthcare said six of the victims were in critical condition and five in serious condition.",
      "publishedAt": "2025-07-27T12:09:04Z",
      "title": "A man accused of stabbing 11 people at a Walmart is in Michigan authorities' custody",
      "url": "https://apnews.com/article/walmart-stabbing-michigan-341fb14f1bc715243b3780a3d7eabda0",
      "urlToImage": "https://dims.apnews.com/dims4/default/91d2d9c/2147483647/strip/true/crop/6681x3758+0+348/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F31%2F5097567d01dc15766bae541376a1%2F356cab7c940a42539bc931d4b61f16fe"
    },
    {
      "author": null,
      "description": "The Israeli military has begun a “tactical pause” in fighting in three areas of Gaza to address a worsening humanitarian situation. Starting Sunday, the military will halt activity in Muwasi, Deir al-Balah, and Gaza City from 10 a.m. to 8 p.m. local time daily. Secure routes will also be designated to help aid agencies deliver food and supplies. This decision follows months of warnings about famine due to Israeli aid restrictions. On Saturday, the military said it would resume airdrops into Gaza. These humanitarian steps will occur alongside ongoing military operations against Hamas. Meanwhile, health officials in Gaza said at least 16 people were killed in overnight Israeli strikes.",
      "publishedAt": "2025-07-27T05:06:40Z",
      "title": "Israeli military to pause fighting in 3 Gaza areas to address surging hunger",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-pause-hunger-9752f9dbdbb1b85aac515ffe3e859216",
      "urlToImage": "https://dims.apnews.com/dims4/default/38eae23/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F98%2F0fd352267702ff9e8bf39af68308%2F5c1e2c8211de47518155f24e587f04a3"
    },
    {
      "author": null,
      "description": "A regional passenger train has derailed in southern Germany, killing at least three people and seriously injuring others. The crash happened on Sunday near Riedlingen, about 158 kilometers west of Munich. Federal and local police say the cause of the crash is still under investigation. Storms passed through the area before the crash and investigators were seeking to determine if the rain was a factor. Photos from the scene show parts of the train on its side, with rescuers climbing atop the carriages. It is unclear how many people were injured, but roughly 100 people were onboard when at least two carriages derailed. German Chancellor Friedrich Merz mourned the victims and gave his condolences to their families.",
      "publishedAt": "2025-07-27T17:37:04Z",
      "title": "At least 3 killed and others injured in train derailment in Germany",
      "url": "https://apnews.com/article/germany-train-derailment-38e8960c549b4d1c43e0b7172b18b19a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3f9456/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fcd%2Fad9c1feb732cf83a0f96c4ea4c57%2Fe8f2c0df8aa341ea84697680a2361b1e"
    },
    {
      "author": null,
      "description": "U.S. and Chinese officials are meeting in Stockholm to discuss trade tariffs and a potential summit between their leaders. U.S. Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng are holding talks, marking their third meeting this year. Analysts say they are likely to agree on maintaining current tariff levels while working toward a more lasting trade deal. The U.S. currently taxes Chinese goods at 30%, while China imposes a 10% tariff. The talks may also address issues like China’s industrial overcapacity and fentanyl-related tariffs, with hopes of reaching a deal to be announced when U.S. President Donald Trump and Chinese leader Xi Jinping possibly meet later this year.",
      "publishedAt": "2025-07-28T00:03:52Z",
      "title": "US and China to talk in Stockholm on trade with hopes of Trump-Xi summit",
      "url": "https://apnews.com/article/stockholm-trade-china-us-bessent-he-lifeng-5a0a9e723eb521dc72df00f2ae549a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4ad823/2147483647/strip/true/crop/3004x1690+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F96%2Fff61beec10b17ab888f2643059af%2Fedcee7475727489dbe63eb54abc5ca78"
    },
    {
      "author": null,
      "description": "President Donald Trump has threatened to block a new stadium deal unless Washington’s NFL team reverts its name to a racial slur. Experts say Native American mascots have long been linked to negative mental health outcomes, especially for children. Advocates have been calling for their removal for generations, and researchers say Native mascots reinforce racial bias. The Washington Redskins changed to the Commanders in 2020. Trump's spokesperson says \"He likes to see results on behalf of the American people” and that sports fans would agree with him about restoring the old name. More than 1,500 grade schools across the country still use Native mascots.",
      "publishedAt": "2025-07-27T12:21:31Z",
      "title": "Trump calls for DC to restore old NFL name as experts say Native mascots cause harm",
      "url": "https://apnews.com/article/washington-commanders-trump-73f3f59ad00c34b2ee92cec9b247525c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d8d10a/2147483647/strip/true/crop/4832x2718+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F09%2F341ea5674a703a4698f80dd33bf7%2F73cc7170e1fe4cccaf59263b9683c2b7"
    },
    {
      "author": null,
      "description": "Authorities say passengers had to use an emergency slide to evacuate a smoking American Airlines jet at Denver International Airport. The Federal Aviation Administration says the Boeing 737 MAX 8 reported a “possible landing gear incident” during its departure for Miami on Saturday. Local media aired video of passengers — including some with small children — sliding down the chute. Some tripped at the end and fell onto the runway. One passenger was taken to a medical facility, while five others were evaluated for injuries but didn't need hospitalization. Firefighters extinguished a fire on the aircraft. The FAA says it plans to investigate.",
      "publishedAt": "2025-07-27T14:37:48Z",
      "title": "Smoking jet lands in Denver with apparent landing gear problem",
      "url": "https://apnews.com/article/denver-jet-landing-gear-passengers-evacuate-56401b491b45735cb69410f1dcd8135d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7743339/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Ff9%2F4caeb8927486068f5363eeee8f3a%2F201b0551f6b04e7db2e7c8cd21f4aa27"
    },
    {
      "author": null,
      "description": "Bubba Wallace became the first Black driver to win on Indianapolis Motor Speedway’s 2.5-mile oval, surviving a late rain delay, two overtimes, concerns over running out of fuel and a hard-charging Kyle Larson on Sunday in the Brickyard 400. The third NASCAR Cup victory of Wallace’s career was also his biggest. It snapped a 100-race winless streak that dated to 2022 at Kansas. He also won at Talladega in 2021. It’s his first win at one of NASCAR’s four crown jewel races. And while the final gap was 0.222 seconds, he didn’t reach victory lane without some consternation.",
      "publishedAt": "2025-07-27T22:05:13Z",
      "title": "Bubba Wallace wins Brickyard 400 to become Indy's first Black winner",
      "url": "https://apnews.com/article/bubba-wallace-nascar-brickyard-400-indianapolis-indy-60a2a663f3eb80533541dd32d76851af",
      "urlToImage": "https://dims.apnews.com/dims4/default/f610a7a/2147483647/strip/true/crop/3897x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ffb%2F2f89666aa0f37dbe3bc3d3e5ba0f%2Fff70fb6bff664a6e8a6808582c09275e"
    },
    {
      "author": null,
      "description": "Tom Lehrer, a song satirist who gained a popular following in the 1950s and ’60s lampooning marriage, politics, racism and the Cold War, and then largely abandoned his music career to return to teaching math at Harvard and other universities, has died at 97. His songs included “Poisoning Pigeons in the Park,” “The Old Dope Peddler,” “Be Prepared” in which he mocked the Boy Scouts and “The Vatican Rag,” in which Lehrer poked at the rites and ceremonies of the Roman Catholic Church. But he attacked in such an erudite, even polite, manner that almost no one objected. Longtime friend David Herder said Lehrer died Saturday at his home in Cambridge, Massachusetts.",
      "publishedAt": "2025-07-27T18:25:11Z",
      "title": "Tom Lehrer, song satirist who lampooned marriage, politics and the Cold War, dies at 97",
      "url": "https://apnews.com/article/tom-lehrer-son-satirist-mathematician-dies-9caa7ee01faf4fbfb793d7ba984c179d",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc91758/2147483647/strip/true/crop/1992x1121+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2Fb3%2F82b9fe8e8d27d2ded908bb6e1f67%2F72a397e459774b029c7335fb92132e5d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}