{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Protests over the Israel-Hamas war have spread across U.S. university and college campuses in recent weeks, leading to disruptions and arrests.",
      "publishedAt": "2024-05-13T05:56:39Z",
      "title": "Campus protests over Israel-Hamas war scaled down during US commencement exercises",
      "url": "https://apnews.com/1ea0549aee05acabf0ed33d803963bf9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/079e76e1567342bb92f3b7e82e53a857/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The star prosecution witness in Donald Trump's hush money trial is set to take the stand Monday with testimony that could help shape the outcome of the first criminal case against an American president.",
      "publishedAt": "2024-05-13T04:22:31Z",
      "title": "Trump trial arrives at a pivotal moment: Star witness Michael Cohen is poised to take the stand",
      "url": "https://apnews.com/f96dd7289cf952145cdd6737b29add3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d84050d1cbcc4ee5b1cb2460b66d08bb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel’s leaders commemorated Memorial Day on Monday, a usually somber holiday that this year was almost entirely absorbed by the ongoing war in Gaza. At 11:00 A.M., sirens announced two minutes of silence, and a formation of four fighter planes then flew over Jerusalem and the surrounding areas.",
      "publishedAt": "2024-05-13T10:04:22Z",
      "title": "The Latest | Israel marks memorial day, as hundreds of thousands flee Rafah assault",
      "url": "https://apnews.com/18bde11f5581a7d296d2242b9f204ce9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85e1758415804a31b733dfd9ad4855a3/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken on Sunday delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza, saying Israeli tactics have meant “a horrible loss of life of innocent civilians” but failed to neutralize Hamas leaders and fighters and could drive a lasting insurgency.",
      "publishedAt": "2024-05-12T17:16:48Z",
      "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza",
      "url": "https://apnews.com/6e0f887bd307f707a05190b33708fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8819ca152ff4e69aab5cf2051619a8b/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian troops are locked in intense battles with the advancing Russian army in two border areas, President Volodymyr Zelenskyy said, while the death toll from a Russian apartment building collapse blamed on Ukrainian shelling rose to 15.",
      "publishedAt": "2024-05-13T08:18:17Z",
      "title": "Ukraine's Zelenskyy says his army is locked in 'fierce' border battles amid a Russian assault",
      "url": "https://apnews.com/397dd892f936726bd1acbd45991a18a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3c5b20ed19b4b6b9655383ffaeee5e7/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Students often throw up or wet themselves when gunfire erupts outside their school in northern Port-au-Prince.",
      "publishedAt": "2024-05-13T04:15:23Z",
      "title": "Violence is traumatizing Haitian kids. Now the country's breaking a taboo on mental health services",
      "url": "https://apnews.com/eae1e0bc7c0143a1f58da7d58ff29eed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f03332cf3c444514958bc1930226aca3/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "SAMASTIPUR, India (AP) — Millions of Indians across 96 constituencies began casting their ballots on Monday as the country's gigantic, six-week-long election edges past its halfway mark. Prime Minister Narendra Modi is seeking a third straight term with an eye on winning a supermajority in Parliament.",
      "publishedAt": "2024-05-13T06:00:14Z",
      "title": "India's mammoth election is more than halfway done as millions begin voting in fourth round",
      "url": "https://apnews.com/4b4138016092483f6d4cf413bd44db4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a591ae8dd74e4cd1a7c8971cf18fadac/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "A tiny contingent of Duke University graduates opposed pro-Israel comedian Jerry Seinfeld speaking at their commencement in North Carolina Sunday, with about 30 of the 7,000 students leaving their seats and chanting “free Palestine” amid a mix of boos and cheers.",
      "publishedAt": "2024-05-13T05:08:47Z",
      "title": "Pro-Palestinian protests dwindle on campuses as some US college graduations marked by defiant acts",
      "url": "https://apnews.com/6326e580e2455444aad32b7ebe599025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9095db527b147489aa100f041f8820e/3000.jpeg"
    },
    {
      "author": "FU TING, ALI SWENSON and DIDI TANG",
      "description": "NEW YORK (AP) — It was 7 a.m. on a recent Friday when Wang Gang, a 36-year-old Chinese immigrant, jostled for a day job in New York City's Flushing neighborhood.When a potential employer pulled up near the street corner, home to a Chinese bakery and pharmacy, Wang and dozens of other men swarmed around the car.",
      "publishedAt": "2024-05-13T04:14:11Z",
      "title": "Trump suggests Chinese migrants are in the US to build an 'army.' The migrants tell another story",
      "url": "https://apnews.com/05478af9702aa8cc0264bb52c8ba7bd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a9ee68a13fd49b09a533375cf729413/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "PROVIDENCE, R.I. (AP) — The voice Alexis “Lexi” Bogan had before last summer was exuberant.She loved to belt out Taylor Swift and Zach Bryan ballads in the car. She laughed all the time — even while corralling misbehaving preschoolers or debating politics with friends over a backyard fire pit.",
      "publishedAt": "2024-05-13T09:02:32Z",
      "title": "Illness took away her voice. AI created a replica she carries in her phone",
      "url": "https://apnews.com/a6512c33481072c22182c116d2cbe419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54644b9d2c134c92bcbbd0cb2900c110/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}