{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The White House declared Elon Musk a senior adviser to President Donald Trump. The designation came shortly before a judge declined to block Musk and DOGE from accessing government data systems or laying off workers.",
      "publishedAt": "2025-02-18T07:46:00Z",
      "title": "Live updates: Judge declines to block Musk and DOGE from accessing federal data or laying off workers",
      "url": "https://apnews.com/live/trump-presidency-updates-2-18-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ff45cf/2147483647/strip/true/crop/5694x3203+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd4%2F32e3741dee29740229f850671ead%2Fe23ab55400414e1d9510677b814553fb"
    },
    {
      "author": "DARLENE SUPERVILLE, MICHELLE L. PRICE",
      "description": "President Donald Trump has signed an executive order to study how to expand access to in vitro fertilization and make it more affordable. Tuesday's signing follows up on a campaign pledge that was at odds with some members of his party. Trump also signed another executive order as well as a presidential memorandum at his Florida home and club, Mar-a-Lago. The other executive order outlined the oversight functions of the Office of Management and Budget, while the presidential memorandum called for more transparency from the government. Trump answered questions from reporters after signing the orders. His first joint TV interview with adviser Elon Musk airs later Tuesday on Fox News Channel.",
      "publishedAt": "2025-02-18T16:17:28Z",
      "title": "Trump signs order to study how to expand access to IVF",
      "url": "https://apnews.com/article/trump-executive-order-musk-hannity-143316eda581ac466cd923cdf4568d87",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb5cf87/2147483647/strip/true/crop/2613x1470+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe3%2Fb6f84db18540ad5515dc9530dcef%2F3431098aace84487b3ece39de6d0dfc0"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "The Trump administration is falsely claiming that tens of millions of dead people over 100 years old are receiving improper Social Security payments. Over the past few days, President Donald Trump and billionaire adviser Elon Musk have said on social media and in press briefings that people who are 100, 200 and even 300 years old are improperly getting benefits. Musk called it a “HUGE problem,” as his Department of Government Efficiency digs into federal agencies to root out waste, fraud and abuse. It is true that improper payments have been made, including some to dead people. But the numbers thrown out by Musk and the White House are overstated and misrepresent Social Security data.",
      "publishedAt": "2025-02-19T00:11:18Z",
      "title": "Tens of millions of dead people aren't getting Social Security checks, despite Trump and Musk claims",
      "url": "https://apnews.com/article/social-security-payments-deceased-false-claims-doge-ed2885f5769f368853ac3615b4852cf7",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "DAVID BAUDER",
      "description": "President Donald Trump says his administration will continue to restrict The Associated Press' access to cover presidential events until the news agency goes along with his renaming of the Gulf of Mexico. It was the first time the president has commented on a dispute that began with the White House blocking AP journalists from events because of its decision to continue using Gulf of Mexico, while also noting Trump has renamed the international body of water the Gulf of America. The White House has also broadened its dispute against the AP for other recommendations it has made for word usage, such as the capitalization of Black and not white in racial references.",
      "publishedAt": "2025-02-19T01:08:52Z",
      "title": "Trump says AP will continue to be curtailed at White House until it changes style to Gulf of America",
      "url": "https://apnews.com/article/trump-ap-white-house-press-corps-pool-91535a6384d681fee1cd7e384ea6c627",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b6a3af/2147483647/strip/true/crop/5653x3180+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F27%2Fbe47d2f8c199511b743eed165a8d%2Ffe16199dd191482da4e665c3b2a06c0b"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "Newly installed Health and Human Services Secretary Robert F. Kennedy Jr. told agency employees that a commission formed by President Donald Trump will investigate the childhood vaccine schedule and other issues as a way to examine the rise in chronic diseases. The announcement on Tuesday raises questions about the promise he made during his confirmation hearings to Republican Sen. Bill Cassidy, a Louisiana physician. Cassidy harbored deep misgivings over Kennedy's anti-vaccine advocacy, but said Kennedy had promised not to change the nation’s current vaccination schedule. Cassidy's office did not respond to a request for comment.",
      "publishedAt": "2025-02-18T22:39:32Z",
      "title": "RFK Jr. says panel will examine childhood vaccine schedule",
      "url": "https://apnews.com/article/childhood-vaccines-schedule-kennedy-trump-hhs-4d5e6c52c602f5edbcd837748605e9d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/d907798/2147483647/strip/true/crop/4724x2657+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F55%2F149b9655beba9962480d72eca430%2F7a19564983364fbc857d32eb3c538e11"
    },
    {
      "author": "ELÉONORE HUGHES, MAURICIO SAVARESE",
      "description": "Brazil’s prosecutor-general said that former leader Jair Bolsonaro knew and agreed to a plan to poison his successor and current President Luiz Inácio Lula da Silva, as part of an attempt coup to remain in power. Prosecutor-General Paulo Gonet formally charged Bolsonaro Tuesday for attempting a coup to stay in office after his 2022 election defeat. He said that the plan also aimed at shooting dead Supreme Court Justice Alexandre de Moraes, a foe of the former president.",
      "publishedAt": "2025-02-19T00:00:19Z",
      "title": "Former Brazilian President Bolsonaro agreed to a plan to poison President Lula, prosecutor says",
      "url": "https://apnews.com/article/bolsonaro-charges-formal-accusations-1751e6b6060ccfcc92d0e6d453650e0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/48df8d2/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F35%2Ffc97d7664d72f37ae46507194eee%2Fc0a19e39da5844e3b189eb9f935759da"
    },
    {
      "author": "JOHN WAWROW, MICHAEL CASEY",
      "description": "Aviation experts say investigators will consider the weather conditions, as well as the possibility of human error or an aircraft malfunction as they try to determine why a Delta Air Lines jet burst into flames and flipped upside down as it tried to land in Toronto. The aircraft came down fast Monday, landing so hard that it lost its right wing, then burst into flames. The aircraft slid to a stop, upside down, leaving a trail of black smoke in its wake and passengers scrambling to escape the wreckage. Miraculously, all 80 people on board the flight from Minneapolis to Toronto’s Pearson International Airport survived and all but two of the 21 people injured have been released from hospitals.",
      "publishedAt": "2025-02-18T16:35:47Z",
      "title": "Questions emerge about what may have caused Delta plane to burst into flames and flip over",
      "url": "https://apnews.com/article/toronto-delta-crash-9c37b48b9719cffdbeba920d46e116b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e969e41/2147483647/strip/true/crop/1006x566+0+53/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2Fb7%2F38b4415db910120f17cff741b1aa%2F02c18ec315984af1830fd21266e97bb1"
    },
    {
      "author": "MATTHEW LEE, VLADIMIR ISACHENKOV",
      "description": "Top U.S. and Russian officials had their most extensive high-level engagement since Moscow sent troops into Ukraine almost three years ago. They met for nearly four hours Tuesday in Saudi Arabia as President Donald Trump sought to advance his goal of ending the fighting in Ukraine and mending ties with Moscow. The delegations said the discussions were a good first step. However, the rapprochement may come at a cost to the transatlantic alliance of the U.S. and Europe and significantly damage Washington’s standing with Ukraine as well as with other nations counting on U.S. leadership in NATO and elsewhere for their security and protection.",
      "publishedAt": "2025-02-18T21:05:30Z",
      "title": "A deeper look at the talks between US and Russian officials and what comes next",
      "url": "https://apnews.com/article/us-russia-rubio-lavrov-ukraine-saudi-arabia-94bc4de5ecc86922d6ea4376e38f1cfd",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266af6/2147483647/strip/true/crop/5500x3094+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F7f%2F0c718b498911960324314ad93170%2F72c5f372db4a4f8c94ad30140916b8b6"
    },
    {
      "author": "SAMY MAGDY, NATALIE MELZER",
      "description": "A senior Hamas leader says the militant group will release six living Israeli hostages on Saturday and the bodies of four others on Thursday. The surprise acceleration in releases is apparently in return for Israel allowing long-requested mobile homes and construction equipment into the Gaza Strip. The six are the last living hostages set to be freed under the ceasefire’s first phase. The sides have yet to negotiate the second and more difficult phase, in which Hamas says it will only release dozens more hostages in exchange for a lasting ceasefire and an Israeli withdrawal.",
      "publishedAt": "2025-02-18T13:21:25Z",
      "title": "Hamas says it will free 6 living hostages and hand over 4 bodies, accelerating Gaza releases",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-18-2025-873e5177fea96dbf569ca96980eed29c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d689df3/2147483647/strip/true/crop/5989x3369+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F8a%2F252cfe9371584c74855256f6b708%2F1f0a5a5280404b64aa66dc12af49e58c"
    },
    {
      "author": "ANDREW DALTON",
      "description": "Jurors have found rapper A$AP Rocky not guilty of firing a handgun at a former friend on a Hollywood street in 2021. The Los Angeles jury deliberated for about three hours before clearing the hip-hop star on Tuesday of two felony counts of assault with a semiautomatic firearm. The 36-year-old Rocky could’ve legally gotten up to 24 years in prison with guilty verdicts. He took a major gamble when he turned down a plea deal that could have meant just six months in jail. The singing superstar Rihanna is his longtime partner and the mother of his two toddler sons.",
      "publishedAt": "2025-02-18T22:56:27Z",
      "title": "Hip-hop star A$AP Rocky is found not guilty of firing a handgun and avoids decades in prison",
      "url": "https://apnews.com/article/asap-rocky-rihanna-shooting-verdict-la-trial-203067f305f85afab734f1975723ff04",
      "urlToImage": "https://dims.apnews.com/dims4/default/7cfac0a/2147483647/strip/true/crop/4308x2423+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F40%2F67c266e547592d6cafdf96dd7ef8%2F195e902cca52490885cf540c116fcf9d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}