{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, TIA GOLDENBERG and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel and Hamas have reached an agreement for a four-day halt to the devastating war in Gaza, accompanied by the release of dozens of hostages held by the militant group in return for Palestinians imprisoned by Israel, mediators said Wednesday.",
      "publishedAt": "2023-11-22T06:55:51Z",
      "title": "Truce deal set to free hostages in swap, raising hopes of halting worst Mideast violence in decades",
      "url": "https://apnews.com/d12c1728cbae0ff74a69cc9cc3e8a646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f52228c8fcc476c87e64131a10c949a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A cease-fire agreement between the Hamas militant group and Israel has been confirmed by both parties, along with Washington and Qatar, which helped broker the deal that would bring a temporary halt to the devastating war that is now in its seventh week.",
      "publishedAt": "2023-11-22T08:38:19Z",
      "title": "Live updates | Timing for the Israel-Hamas pause in fighting to be announced in the next 24 hours",
      "url": "https://apnews.com/1f063e9571c6bc9964d7251ea70e8822",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11122c3c17d640fea2a01882252dd635/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel and Hamas have agreed to a four-day halt in their devastating war in exchange for the release of dozens of hostages taken captive by militants on Oct. 7, when Israeli communities were overrun and some 240 people abducted.",
      "publishedAt": "2023-11-22T08:21:14Z",
      "title": "Israel and Hamas have reached a deal on a cease-fire and hostages. What does it look like?",
      "url": "https://apnews.com/af1cfbc9dcaa1485ed7a9efaca7ec2b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a55f68230d349e4ad8391f38c5fc1aa/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As lawmakers in Washington weigh sending billions more in federal support to Kyiv to help fight off Russian aggression, close to half of the U.S.",
      "publishedAt": "2023-11-22T05:04:45Z",
      "title": "Nearly half of Americans think the US is spending too much on Ukraine aid, an AP-NORC poll says",
      "url": "https://apnews.com/2cd1be27f7f635e9a89fdbdb9eedb646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0452aadbcc9a40429d4348ba63411e10/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "The ousted leader of ChatGPT-maker OpenAI is returning to the company that fired him late last week, culminating a days-long power struggle that shocked the tech industry and brought attention to the conflicts around how to safely build artificial intelligence.",
      "publishedAt": "2023-11-22T06:35:59Z",
      "title": "Sam Altman is back as OpenAI CEO just days after being removed, along with a new board",
      "url": "https://apnews.com/31187f7f6eca8ff9d0eef7585aac6ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf2e7a6d4d0042ec9d95035cf5a2052a/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea will partially suspend an inter-Korean agreement Wednesday to restart frontline aerial surveillance of North Korea, after the North said it launched a military spy satellite in violation of United Nations bans, Seoul officials said.",
      "publishedAt": "2023-11-22T05:41:12Z",
      "title": "South Korea partially suspends inter-Korean agreement after North says it put spy satellite in orbit",
      "url": "https://apnews.com/c3aa2c541387616ad153a1562aa018da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb5d2091532f4af487c6bbb14106aa7d/2140.jpeg"
    },
    {
      "author": "DÉBORA REY",
      "description": "BUENOS AIRES, Argentina (AP) — When right-wing populist Javier Milei became Argentina’s president-elect, he dedicated his victory to \"The boss,” the nickname he uses for his enigmatic sister, Karina Milei.",
      "publishedAt": "2023-11-22T05:03:01Z",
      "title": "Meet the influential women behind Argentina’s President-elect Javier Milei",
      "url": "https://apnews.com/5c705d633642a7c88fe0cbd3350cfecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a49a35e441e44cf78faadf667974f8c1/3000.jpeg"
    },
    {
      "author": "AARON MORRISON",
      "description": "STUDIO CITY, California (AP) — Some of the mystery and controversy shrouding a sprawling Los Angeles-area property owned by a national Black Lives Matter nonprofit have dissipated for dozens of families grieving a loved one killed by police.",
      "publishedAt": "2023-11-22T05:14:32Z",
      "title": "At Black Lives Matter house, families are welcomed into space of freedom and healing",
      "url": "https://apnews.com/dc28cf47e3724c31d5791c90555b5b75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7809eb3a36a24d8bb632c5c70da273de/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Just minutes after President John F. Kennedy was fatally shot as his motorcade rolled through downtown Dallas, Associated Press reporter Peggy Simpson rushed to the scene and immediately attached herself to the police officers who had converged on the building from which a sniper's bullets had been fired.",
      "publishedAt": "2023-11-22T05:04:31Z",
      "title": "JFK assassination remembered 60 years later by surviving witnesses to history, including AP reporter",
      "url": "https://apnews.com/822f26b3a850508fb1e6530b86ebf809",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b111fd17a024b34aa7d2db2426050f2/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — A group of Lahaina wildfire survivors is vowing to camp on a popular resort beach until the mayor uses his emergency powers to shut down unpermitted vacation rentals and make the properties available for residents in desperate need of housing.",
      "publishedAt": "2023-11-22T05:31:26Z",
      "title": "Maui wildfire survivors camp on the beach to push mayor to convert vacation rentals into housing",
      "url": "https://apnews.com/5c8bad3615be03b0785e8dc96b3ac546",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fc3ef5cd01d4c20a90073464bd7457b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}