{
  "articles": [
    {
      "author": "ALANNA DURKIN RICHER, JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Monday's opening statements in the first criminal trial of a former American president provided a clear roadmap of how prosecutors will try to make the case that Donald Trump broke the law, and how the defense plans to fight the charges on multiple fronts.",
      "publishedAt": "2024-04-22T20:52:28Z",
      "title": "Key takeaways from the opening statements in Donald Trump's hush money trial",
      "url": "https://apnews.com/ce0e061811e33a6cfa06e02ef3387cd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09dd05680a3044cba5cf4e7dc2006c8d/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and CLAIRE RUSH",
      "description": "WASHINGTON (AP) — The Supreme Court wrestled with major questions about the growing issue of homelessness on Monday as it considered whether cities can punish people for sleeping outside when shelter space is lacking.",
      "publishedAt": "2024-04-22T04:20:28Z",
      "title": "With homelessness on the rise, the Supreme Court weighs bans on sleeping outdoors",
      "url": "https://apnews.com/334d90536535ebb07ccb6d2dc76009c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46cb2a2f3421488abc9c4e4b93770666/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The head of Israeli military intelligence resigned on Monday because of Hamas' Oct.",
      "publishedAt": "2024-04-22T07:20:32Z",
      "title": "Israel's military intelligence chief resigns over failure to prevent Hamas attack on Oct. 7",
      "url": "https://apnews.com/85da1c989f71f8c3bf00d8b45a0ed7f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed2034b24fda4e778c2d8be1046ee261/3000.jpeg"
    },
    {
      "author": "NICK PERRY, MICHELLE L. PRICE and DAVE COLLINS",
      "description": "NEW YORK (AP) — Columbia canceled in-person classes, dozens of protesters were arrested at Yale and the gates to Harvard Yard were closed to the public on Monday as some of the most prestigious U.S.",
      "publishedAt": "2024-04-22T13:54:15Z",
      "title": "Pro-Palestinian protests sweep US college campuses following mass arrests at Columbia",
      "url": "https://apnews.com/56c3d9d0a278c15ed8e4132a75ea9599",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca2ecba7c8741d392f96fab9318e2f5/1920.jpeg"
    },
    {
      "author": "BY SETH BORENSTEIN",
      "description": "WASHINGTON (AP) — Forget about red hot. A new color-coded heat warning system relies on magenta to alert Americans to the most dangerous conditions they may see this summer.The National Weather Service and the Centers for Disease Control and Prevention on Monday — Earth Day — presented a new online heat risk system that combines meteorological and medical risk factors with a seven-day forecast that's simplified and color-coded for a warming world of worsening heat waves.",
      "publishedAt": "2024-04-22T20:20:35Z",
      "title": "When red-hot isn't enough: New government heat risk tool sets magenta as most dangerous level",
      "url": "https://apnews.com/496d5dfad5d3b224b8d1a506a755d42b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b7f1749fcb64760a9792093e5df3912/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "TRAVERSE CITY, Mich. (AP) — The group gathered inside the conference room, mostly women, fell silent as the audio recording began to play.The male voice, clearly agitated, railed against what he thought had been fraud that cost former President Donald Trump reelection four years ago.",
      "publishedAt": "2024-04-22T04:08:33Z",
      "title": "Local election workers fear threats to their safety as November nears. One group is trying to help",
      "url": "https://apnews.com/d2702ae1e1e57c766c3df36f1a7ff763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6276dcb5987746019eaf49a37f0ac8b0/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukrainian commander Oleksiy Tarasenko witnessed a frightening shift last month in Russia's efforts to punch through Kyiv’s defense of the industrial region known as the Donbas.",
      "publishedAt": "2024-04-22T04:16:14Z",
      "title": "Aid approval brings Ukraine closer to replenishing troops struggling to hold front lines",
      "url": "https://apnews.com/5b2cfac8351bff94d8c1ead8704110a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db59f4a23ef34c079c04049bd1b3888f/3000.jpeg"
    },
    {
      "author": "AMY BETH HANSON and MATTHEW BROWN",
      "description": "HELENA, Mont. (AP) — A federal jury on Monday said BNSF Railway contributed to the deaths of two people who were exposed to asbestos decades ago when tainted mining material was shipped through a Montana town where thousands have been sickened.",
      "publishedAt": "2024-04-22T21:02:12Z",
      "title": "Jury: BNSF Railway contributed to 2 deaths in Montana town where asbestos sickened thousands",
      "url": "https://apnews.com/18b38ddf8ca43646b81748c5102f889f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f538381b1f54c9ea64d4d67f3329a1a/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "JERUSALEM (AP) — Satellite photos taken Monday suggest an apparent Israeli retaliatory strike targeting Iran's central city of Isfahan hit a radar system for a Russian-made air defense battery, contradicting repeated denials by officials in Tehran of any damage in the assault.",
      "publishedAt": "2024-04-22T18:05:04Z",
      "title": "Satellite photos suggest Iran air defense radar struck in Isfahan during apparent Israeli attack",
      "url": "https://apnews.com/ce6719d3df8ebf5af08b035427ee215c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/607c9af1e3984e5bb39f48ce7c461380/2009.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "SPRINGFIELD, Mass. (AP) — Caitlin Clark’s early play in WNBA will serve as her tryout for a spot on the U.S. Olympic women’s basketball team.The women's roster for the Paris Games won't be determined before June 1.",
      "publishedAt": "2024-04-22T10:00:24Z",
      "title": "Caitlin Clark's early play in WNBA will be her tryout for a roster spot on US Olympic women's team",
      "url": "https://apnews.com/1169bcc4b2f3db5cf635031fea28bd0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1377fe673105407298cb23bad6b04b93/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}