{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israel airstrike in Gaza killed at least 18 people, all from the same family, on Saturday, hours after mediators expressed optimism for an imminent cease-fire deal between Israel and Hamas after 10 months of war.",
      "publishedAt": "2024-08-17T10:00:23Z",
      "title": "An Israeli airstrike kills 18 members of a family in Gaza as mediators hope for a cease-fire",
      "url": "https://apnews.com/07e5f3d968cb09613609eb1086e26e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/167c0a0bd6434f17ab6de3b01aa28f6f/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT, JILL COLVIN and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has replaced President Joe Biden atop the presidential ticket, but his “finish the job” campaign mantra can still largely apply to her top policy goals.",
      "publishedAt": "2024-08-18T04:01:49Z",
      "title": "Harris and Trump offer worlds-apart contrasts on top issues in presidential race",
      "url": "https://apnews.com/3f80a342c790da64e3de92a4f5760991",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93d0e261eedb4c65b169c8390107b375/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.",
      "publishedAt": "2024-08-18T04:02:26Z",
      "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire",
      "url": "https://apnews.com/5741113478d2ca454d6d6d7a6e7bd50f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8fa63f0463a4752aaf2c81d8c147a9f/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, MICHAEL RUBINKAM and MICHELLE L. PRICE",
      "description": "WILKES-BARRE, Pa. (AP) — Former President Donald Trump on Saturday repeatedly swerved from a message focused on the economy into non sequiturs and personal attacks, including thrice declaring that he was better looking than Vice President Kamala Harris.",
      "publishedAt": "2024-08-17T16:43:08Z",
      "title": "Trump zigzags between economic remarks and personal insults at rally in critical Pennsylvania",
      "url": "https://apnews.com/d1e8098a7588bfd1af685327f18ab3a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2260f597e05441ca9125824ae6ef6d8/2460.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Hurricane Ernesto weakened into a tropical storm late Saturday as it moved away from Bermuda over open waters of the Atlantic after crossing over the tiny British territory early in the day with heavy rains and strong winds.",
      "publishedAt": "2024-08-17T09:06:25Z",
      "title": "Hurricane Ernesto weakens into tropical storm as it moves away from Bermuda over open waters",
      "url": "https://apnews.com/c7dea3a54812e4353ee2dc2bd38b7e49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d67f597ec6e342c6b738a0541a8e68e5/1600.jpeg"
    },
    {
      "author": "JORGE RUEDA and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelans across the world — some with flags and other patriotic paraphernalia — responded to a call from their country’s political opposition Saturday and took to the streets to defend the faction’s claim to victory over President Nicolás Maduro in last month’s disputed presidential election.",
      "publishedAt": "2024-08-17T21:37:18Z",
      "title": "Venezuelans in Caracas and across the world demonstrate to defend opposition’s victory claim",
      "url": "https://apnews.com/e7a587ee841b83bc8049f4caf3575cc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/821dd5a526834dbca7279d56169a1dd4/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Paetongtarn Shinawatra, daughter of the divisive former leader Thaksin Shinawatra, became Thailand's prime minister after receiving a royal letter of endorsement Sunday, two days after she was chosen by Parliament following a court order that removed her predecessor.",
      "publishedAt": "2024-08-18T04:00:18Z",
      "title": "Paetongtarn Shinawatra becomes Thai prime minister after royal signoff",
      "url": "https://apnews.com/78e8d41b40c1bd6a77c0885158da5794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7989472e7914e16a32a3c8f4f08616f/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — India's medical workers began a countrywide strike Saturday to protest the rape and killing of a trainee doctor at a state-run hospital in the eastern West Bengal state.Saturday’s strike was called by the country’s largest group of doctors, the Indian Medical Association, saying all non-essential services at hospitals would be shut down across the country for 24 hours.",
      "publishedAt": "2024-08-17T06:46:13Z",
      "title": "What to know as India's medics and women protest the rape and killing of a doctor",
      "url": "https://apnews.com/80596fc7aa0880133f56ace5d77240b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce8e0af8dcd24f6db148338d45262b38/1920.jpeg"
    },
    {
      "author": "BABA AHMED",
      "description": "BAMAKO, Mali (AP) — When handling the garbage of a city of over 3 million people and equipped with little more than a face mask and gloves, it helps to have a sense of humor. Yacouba Diallo decided to name the two donkeys that pull his cart after his cousins, Keita and Kanté.",
      "publishedAt": "2024-08-18T04:11:35Z",
      "title": "The trash in Mali's capital is piling up. Donkey carts are coming to help",
      "url": "https://apnews.com/140215d44346e9a60556f557b2f41e49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd98a334930148a2b63a5ef37a05d5d7/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — The latest search for the remains of 1921 Tulsa Race Massacre victims has ended with three more sets containing gunshot wounds, investigators said.",
      "publishedAt": "2024-08-17T14:07:00Z",
      "title": "Latest search for 1921 Tulsa Race Massacre victims ends with 3 more found with gunshot wounds",
      "url": "https://apnews.com/4ead29dba7e37e4de1f62c35c1c19ca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c694ce1944c4ba2b5269b02ff928c9f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}