{
  "articles": [
    {
      "author": null,
      "description": "Israeli airstrikes have killed at least 20 people in Gaza. Palestinian health officials reported the strikes hit Gaza City and a nearby refugee camp early Tuesday, with reports of heavy bombing in areas previously spared major fighting. One strike on a refugee camp killed 12 people, including women and children while another hit crowds waiting for aid, killing eight. Israel manwhile pushed on with a new incursion in an area that had largely been spared heavy fighting during the 21-month war. Also, church leaders visiting Gaza described the territory as “almost totally destroyed” and called for urgent humanitarian aid.",
      "publishedAt": "2025-07-22T11:34:08Z",
      "title": "Israeli strikes kill at least 20 in Gaza, health officials say",
      "url": "https://apnews.com/article/israel-hamas-gaza-war-palestinians-07-22-2025-8eb90d73c1b7499d3dbc8b8d95da65cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/d04167c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F71%2F9393498d3349b6fee4b5a16075c0%2Fa94a55104e6e4e2699875e0facc9daff"
    },
    {
      "author": null,
      "description": "Russian forces have attacked three Ukrainian cities overnight, killing a child and wounding at least 24 people. Ukrainian officials reported strikes in Sumy, Odesa and Kramatorsk from Monday evening into Tuesday. In Kramatorsk, a glide bomb hit an apartment building, killing a young boy and injuring five others. The attacks come ahead of planned peace talks Wednesday between Russia and Ukraine, which have shown little progress in ending the war. Meanwhile, Russia said it downed 35 Ukrainian drones overnight.",
      "publishedAt": "2025-07-22T08:25:23Z",
      "title": "Russian attacks in Ukraine kill a child and wound 24 before planned direct peace talks",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-peace-talks-a430896831b7bf527d36bf036c02c460",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ef61df/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F2b%2F9724eab72bbe35a5bab5347cc3c5%2F3680a53fede049c99bc65a8bfd0388b4"
    },
    {
      "author": null,
      "description": "The Trump administration has released records of the FBI’s surveillance of Martin Luther King Jr., despite opposition from the slain Nobel laureate’s family and the civil rights group that he led until his 1968 assassination. The release involves an estimated 200,000 pages of records that had been under a court-imposed seal since 1977. King’s family, including his two living children, Martin III and Bernice, were given advance notice of the release and had their own teams reviewing the records ahead of the public disclosure. The release is part of President Donald Trump’s order to publicly disclose government files on King and the assassinations of President John F. Kennedy and Robert F. Kennedy.",
      "publishedAt": "2025-07-21T19:46:08Z",
      "title": "Trump administration releases FBI records on MLK Jr.",
      "url": "https://apnews.com/article/martin-luther-king-fbi-files-donald-trump-1a58c3f0c9ec8878e487434e0d372b81",
      "urlToImage": "https://dims.apnews.com/dims4/default/155b4fc/2147483647/strip/true/crop/3000x1688+0+164/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2Fa7%2F92f015ce3b22203bfa84d08a1c8b%2F35497b9eabec42fea7f9037f0c8cc8f8"
    },
    {
      "author": null,
      "description": "The long-range Russian drones come in swarms each night, buzzing over Ukraine by the hundreds, terrorizing the population and attacking targets from the industrial east to areas near its western border with Poland. Russia now batters Ukraine with more drones in a single night than it did during some entire months in 2024. Analysts say the barrages are likely to escalate. On July 8, Russia unleashed more than 700 drones — a record. Some experts say that could soon reach 1,000 a day. This comes amid a U.S. ultimatum for Russia to reach a ceasefire by Sept. 2 or face tough sanctions -– a timeframe Moscow is likely to use to inflict as much damage as possible.",
      "publishedAt": "2025-07-22T04:09:03Z",
      "title": "Russia ramps up aerial attacks on Ukraine after boosting its drone production",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-putin-attacks-0a06736dea37114aa0f351d21746912b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1af3169/2147483647/strip/true/crop/6250x3516+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ffa%2F7256e899626e77e3b71384f8f49c%2F8ee975ab475a40e595962e08d4cb19ec"
    },
    {
      "author": null,
      "description": "Iran says 27 inmates remain at large after an Israeli airstrike last month targeted Evin prison in Tehran. Local media reported on Tuesday that 75 prisoners escaped during the strike, but 48 have been recaptured or returned voluntarily. Authorities are working to detain the remaining escapees. The airstrike was part of Israel's 12-day bombardment of Iran, which killed about 1,100 people. Iranian officials say 71 people, including prison staff, soldiers, inmates, and visitors, died in the prison attack, but local media reported a higher death toll of 80. Human rights groups have criticized Israel for targeting the prison, calling it a violation of international principles.",
      "publishedAt": "2025-07-22T09:57:30Z",
      "title": "27 inmates are still at large following an Israeli airstrike during the 12-day war, Iran says",
      "url": "https://apnews.com/article/iran-evin-prison-escaped-prisoners-bf04d959610e8cd5d8ef6e00540161d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A federal judge has sentenced an ex-Kentucky police officer to nearly three years in prison for using excessive force during the 2020 deadly Breonna Taylor raid, declining a U.S. Justice Department recommendation that no prison time be given the defendant. Brett Hankison, who fired 10 shots during the raid but didn’t hit anyone, was the only officer on the scene charged in the Black woman's death. He is the first person sentenced to prison in the case that rocked the city of Louisville and spawned weeks of street protests over police brutality five years ago. U.S. District Judge Grady Jennings sentenced Hankison at a hearing Monday afternoon.",
      "publishedAt": "2025-07-21T18:30:45Z",
      "title": "Federal judge gives ex-officer nearly 3 years in Breonna Taylor raid",
      "url": "https://apnews.com/article/breonna-taylor-raid-hankison-sentence-4da93877da13f506be42cc1c738cab2b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab05a97/2147483647/strip/true/crop/5292x2977+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F78%2Fe753ba26439dd4dde6cce6c3350d%2Fbc1f1766631f4be08adfee2dc309848a"
    },
    {
      "author": null,
      "description": "World markets are mixed after U.S. stock indexes hit new records. Oil prices fell and U.S. futures were little changed. Japan's Nikkei 225 dipped slightly after an initial surge, following the ruling coalition's loss of its upper house majority in Sunday's election. Analysts say political uncertainty is growing despite Prime Minister Shigeru Ishiba's vow to remain in office. Higher tariffs on exports to the United States are looming with the approach of an Aug. 1 deadline for reaching deals with Washington. On Monday, U.S. stocks saw modest gains, with the S&P 500 and Nasdaq reaching record highs. Verizon and Cleveland-Cliffs posted strong performances, while Sarepta Therapeutics faced setbacks.",
      "publishedAt": "2025-07-22T04:50:10Z",
      "title": "World markets are mixed and Japan's shares dip after election leaves Ishiba's future in doubt",
      "url": "https://apnews.com/article/stocks-markets-japan-trump-earnings-41443e3b17bb389ecac11508640084ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/401dba5/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F07%2F775f788b5d660f85815179d287e4%2F488308926ca446c7a2714e386e503db6"
    },
    {
      "author": null,
      "description": "Hundreds of students have protested near the site of the crash of a Bangladesh air force training jet into a school in the nation’s capital, demanding accountability, compensation for victims’ families and the halt of training flights. The protest comes as the death toll from the crash rose to 31, including 25 students and a teacher who died from burn injuries sustained while helping others get out of the burning building. Firefighters are securing the scene of the crash in Dhaka’s densely-populated Uttara neighborhood while an investigation by the military is ongoing. Bangladesh, in shock after the crash involving its air force, is marking Tuesday as a national day of mourning.",
      "publishedAt": "2025-07-22T08:32:10Z",
      "title": "Bangladesh students protest after air force jet crash kills 31",
      "url": "https://apnews.com/article/bangladesh-air-force-crash-school-5ff6ef9505caf294a0780048a23fb0a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/6bbf44e/2147483647/strip/true/crop/7380x4151+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F64%2F320d039da926e393ab34f3a8ad2c%2Fe27b0e991ef1416f887b00862c051c30"
    },
    {
      "author": null,
      "description": "Nonprofits in McDowell County, West Virginia, face severe challenges due to federal funding cuts. Once a thriving coal hub, the county now struggles with poverty, with over one-third of residents living below the poverty line. Many rely on federal programs like Medicaid, SNAP, and housing assistance, which are being reduced under recent policies. Nonprofits, already operating on slim margins, are laying off staff or dipping into reserves to survive. Cuts to rural water and internet programs further strain the community, leaving basic needs unmet. Advocates warn these reductions could devastate the region, where federal support is a critical lifeline.",
      "publishedAt": "2025-07-22T10:08:33Z",
      "title": "McDowell County, West Virginia, birthplace of food stamps, faces a disappearing safety net",
      "url": "https://apnews.com/article/public-funding-west-virginia-bd131eb660e9cba0dc8c5878fab48d3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8553309/2147483647/strip/true/crop/7276x4093+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2Ffa%2Fa6485986c29bbdac1c13e82a8c66%2F8bc064757c954be58b61e00fb5bd792a"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to host Philippine President Ferdinand Marcos Jr. at the White House. The visit Tuesday highlights efforts to strengthen security and economic ties between the two countries as tensions rise in the Indo-Pacific. Their talks are expected to focus on mutual defense as China has become increasingly assertive in the South China Sea, where Manila and Beijing have clashed over hotly contested territory. The leaders also are negotiating a potential tariffs deal. Marcos met with Secretary of State Marco Rubio and Defense Secretary Pete Hegseth on Monday. Both sides emphasized their commitment to regional peace and economic collaboration.",
      "publishedAt": "2025-07-22T04:03:11Z",
      "title": "Trump and Philippine leader plan to talk tariffs and China",
      "url": "https://apnews.com/article/marcos-trump-philippines-china-tariffs-3138d1d7f8368c022ab9242bebb4a2e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb924e5/2147483647/strip/true/crop/8149x4584+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fd7%2F50e244c4ee5ef13ad2cf18e01a96%2F373ad20f45084a899ce3a054e493147c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}