{
  "articles": [
    {
      "author": null,
      "description": "The leaders of four European countries have arrived in Kyiv as calls intensify for Russia to agree to a monthlong cease-fire in the war. The leaders of France, Germany, Poland and the United Kingdom arrived together Saturday at the train station in Kyiv, where they are expected to meet Ukrainian President Volodymyr Zelenskyy. The visit marked the first time the leaders of the four countries have travelled together to Ukraine. Friedrich Merz is making a first visit to Ukraine as Germany’s new Chancellor. Along with President Donald Trump, the European leaders are pushing for Russia to agree to a 30-day ceasefire to allow for peace talks on ending the conflict.",
      "publishedAt": "2025-05-10T06:55:52Z",
      "title": "European leaders arrive in Kyiv amid push for 30-day ceasefire",
      "url": "https://apnews.com/article/russia-ukraine-war-fbd6aa9ddb147fa1b789c30dcf44dab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/d76327f/2147483647/strip/true/crop/3692x2077+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fa2%2F170fcd5dd54fb8e9e533fa9452de%2F5fca82ef6f8d42f9986fbcc4d88b839c"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistan’s army spokesman says India has fired missiles at three air bases inside the country, but most of the missiles have been intercepted. Lt. Gen. Ahmad Sharif said the assets of the Pakistan Air Force are safe. He made this announcement during his televised address, saying some of the Indian missiles have also hit India’s eastern Punjab.",
      "publishedAt": "2025-05-09T23:03:19Z",
      "title": "Pakistan's army spokesman says India has fired missiles at 3 Pakistani air bases",
      "url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2a69bd/2147483647/strip/true/crop/7203x4052+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F5b%2Ff167ac4b2dd36820616fff87a055%2Ff2f652c417164790a65310dc0aed29c6"
    },
    {
      "author": "Paul Wiseman, Didi Tang, Jamey Keaten",
      "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the global economy. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng. Prospects for a major breakthrough appear dim. But there is hope that the two countries will scale back the massive taxes – tariffs – they’ve slapped on each other’s goods, a move that would relieve world financial markets and companies on both sides of the Pacific Ocean that depend on U.S.-China trade.",
      "publishedAt": "2025-05-10T04:15:16Z",
      "title": "US and Chinese officials meet in Geneva to discuss tariffs as the world looks for signs of hope",
      "url": "https://apnews.com/article/china-trump-trade-tariffs-bessent-economy-71a6e410a0e5771c70ac853563a8b75d",
      "urlToImage": "https://dims.apnews.com/dims4/default/18e45de/2147483647/strip/true/crop/7440x4185+0+388/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd3%2F6d65f5826aba92fe309c8898314f%2F39f00ddbfa87492488a621511b32c1d3"
    },
    {
      "author": "Wafaa Shurafa",
      "description": "Health officials say Israeli airstrikes overnight and into Saturday have killed at least 23 Palestinians in Gaza. They include three children and their parents whose tent was bombed in Gaza City. The Israeli bombardment continued as international warnings grow over Israel's plans to control aid distribution in Gaza. Israel’s blockade on the territory of over 2 million people is now in its third month. Charity kitchens are virtually the only source of food left in Gaza, but dozens have shut down in recent days as food supplies run out. Aid groups say more closures are imminent.",
      "publishedAt": "2025-05-10T14:07:05Z",
      "title": "Israeli airstrikes kill 23 in Gaza as outcry over aid blockade grows",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-05-2025-c9b6f26c14577be19adb8903b5ac55f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/90290e1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Ffa%2F22ae25a873d3efab5370c719484d%2F289a3359d677476897bf4ea333477260"
    },
    {
      "author": "Rodrique Ngowi, Claire Rush",
      "description": "A Tufts University student from Turkey has returned to Boston after being released from a Louisiana immigration detention center. Rumeysa Ozturk told reporters at Logan Airport on Saturday that she was grateful for the support she has received and was excited to get back to her studies. Ozturk was held for more than six weeks after she was arrested while walking along a street in a Boston suburb. Her lawyers say she was illegally detained following an op-ed she co-wrote last year that criticized her university's response to Israel and the war in Gaza. U.S. District Judge William Sessions ordered her release pending a final decision on the claims.",
      "publishedAt": "2025-05-11T01:40:20Z",
      "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
      "url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4c839d/2147483647/strip/true/crop/2540x1429+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F92%2F70f137c5733e6ce368417bce9602%2F01d55a366cba43e29982caa802110821"
    },
    {
      "author": "Will Weissert",
      "description": "Top White House aide Stephen Miller says the Trump administration is looking for ways to expand its legal power to deport migrants who are in the United States illegally. To achieve that, he says President Donald Trump’s team is “actively looking at” suspending habeas corpus, the constitutional right for people to legally challenge their detention by the government. Such a move would be aimed at migrants as part of the Republican president’s broader crackdown at the U.S.-Mexico border. The Constitution says habeas corpus, “shall not be suspended, unless when, in cases of rebellion or invasion, the public safety may require it.” Miller is suggesting the U.S. is facing “an invasion” of migrants.",
      "publishedAt": "2025-05-10T17:12:46Z",
      "title": "Trump team mulls suspending habeas corpus to speed deportations. Can it?",
      "url": "https://apnews.com/article/habeas-corpus-trump-migrants-deportations-constitution-28a598363d03bfc9448b5132c72f2b3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4835abb/2147483647/strip/true/crop/4187x2355+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F91%2F3f0a4f22f89e904674ff5ed26ee5%2Fa2f1fc08a9de4e59b17592d6daac951e"
    },
    {
      "author": "Llazar Semini",
      "description": "Albania is heading to the polls as Socialist Prime Minister Edi Rama seeks a fourth term. Rama has promised European Union membership by 2030. Campaigns featured intense rivalry with conservative Sali Berisha and a shift to digital campaigning despite a TikTok ban. Voters abroad are participating in Sunday’s election for the first time. Economic pledges like wage hikes and a tourism boom have blurred party lines. Corruption remains a key issue with candidates from both major parties facing allegations. More than 2,000 candidates from 11 political groups are vying for 140 parliamentary seats. More than 570 international observers aim to ensure a fair and transparent election process.",
      "publishedAt": "2025-05-11T05:05:40Z",
      "title": "Albanian election sees old rivals, new parties and an ambitious promise of European Union membership",
      "url": "https://apnews.com/article/albania-parliament-election-economy-eu-social-platforms-242488dd3e08eeb1e4422969f255bf4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8759ebb/2147483647/strip/true/crop/8009x4505+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Feb%2F9a80693df415acdeb941b6bc7e77%2F37ccdd48c6f94265a3fd4f86e66cb242"
    },
    {
      "author": "Vanessa Gera",
      "description": "As Poland gears up for the May 18 presidential election, a striking political shift is taking shape: the once-unifying cause of support for Ukrainians is turning into a wedge issue on the campaign trail. Praised as a humanitarian model for the way Poland opened its doors to millions of Ukrainians fleeing the war, Polish society is now witnessing growing fatigue. And the candidates have taken note. Anti-Ukrainian rhetoric is now a key theme on the campaign trail, with right-wing candidates accusing Ukrainians of not being grateful enough for the help they have gotten.",
      "publishedAt": "2025-05-11T05:07:41Z",
      "title": "A million Ukrainian refugees are still in Poland. Now presidential candidates vow to put Poles first",
      "url": "https://apnews.com/article/poland-ukrainians-presidential-election-4982cc03f7b5a88c8e21cc340087e7e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/81f2054/2147483647/strip/true/crop/3461x1947+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F9f%2F17665b7da4a7fe77fe0cbe59add1%2Fe8ac95f4b79f4fce8c47b9bc944ee06b"
    },
    {
      "author": null,
      "description": "A passenger bus has skidded off a cliff in Sri Lanka’s tea-growing hill country, killing eight people and injuring more than 30 others. The accident occurred in the early hours of Sunday near the town of Kotmale, about 86 miles east of Colombo, the capital, in a mountainous area of central Sri Lanka, police said. The driver was injured and among those admitted to the hospital for treatment. The bus was operated by a state-run travel company. Deadly bus accidents are common in Sri Lanka, especially in the mountainous regions, often due to reckless driving and poorly maintained and narrow roads.",
      "publishedAt": "2025-05-11T04:22:35Z",
      "title": "Passenger bus skids off a cliff in Sri Lanka, killing 8 people and injuring more than 30 others",
      "url": "https://apnews.com/article/sri-lanka-deadly-bus-accident-mountains-5473095293bbd4891a231629d0d7d76f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jake Coyle",
      "description": "Perhaps as much as ever, all eyes in the movie world will be on the 78th Cannes Film Festival when it gets underway Tuesday in the South of France. That’s not just because of the long list of anticipated films set to premiere at the Cote d’Azur festival and the extensive coterie of stars set to walk the fabled red carpet. As the movies and the Oscar race have grown more international, the global launchpad of Cannes has only become more central to the larger film ecosystem. Recent editions of Cannes have produced a string of Academy Awards contenders, including this year’s best-picture winner, “Anora.”",
      "publishedAt": "2025-05-11T04:06:57Z",
      "title": "Cannes readies for 78th edition with new challenges on the horizon",
      "url": "https://apnews.com/article/cannes-film-festival-2025-what-to-expect-d289e6798571dd31943dc3d6d3a2d556",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5c02db/2147483647/strip/true/crop/3000x1688+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fb1%2F5bbdf08d59b8a6ed2bf6519b0015%2Fbf95d7f5cb8540b8a7165446003928f0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}