{
  "articles": [
    {
      "author": "Jamey Keaten, Stephanie Liechtenstein",
      "description": "Iran's top diplomat has held talks with the U.N. nuclear watchdog in Geneva a day before a second round of negotiations between the U.S. and Iran. Iran’s Foreign Minister Abbas Araghchi met with IAEA chief Rafael Grossi and later planned to hold talks with Oman’s foreign minister. Oman is hosting the U.S.-Iran talks in Geneva on Tuesday. U.S. President Donald Trump initially threatened to take military action over Iran’s bloody crackdown on nationwide protests last month, but then shifted to a pressure campaign to try to get Tehran to make a deal over its nuclear program.",
      "publishedAt": "2026-02-16T10:09:38Z",
      "title": "Iran's top diplomat meets UN nuclear watchdog ahead of US talks",
      "url": "https://apnews.com/article/iran-nuclear-talks-us-geneva-8628f2dbd4c911cb4cda5fb92c1aadef",
      "urlToImage": "https://dims.apnews.com/dims4/default/73c0551/2147483647/strip/true/crop/3200x2132+0+85/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F9a%2F6f1c6cd261a46c891761bca3a91d%2F8710b09f9aa5488eab6317f99f7511da"
    },
    {
      "author": null,
      "description": "The FBI says a glove containing DNA was found about 2 miles from Nancy Guthrie’s home and appears to match those worn by a masked person outside her front door in Tucson the night she vanished. The glove, found in a field near the side of the road, was sent off for DNA testing. The discovery was revealed days after investigators had released surveillance videos of the masked person outside Guthrie’s front door. Guthrie is the mother of “Today” show host Savannah Guthrie and was last seen at her Arizona home on Jan. 31.",
      "publishedAt": "2026-02-15T19:52:22Z",
      "title": "FBI: DNA recovered from glove found near Guthrie home",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-710d3acdef86d1c3935b94f58f763d72",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a2a4ae/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F4c%2Fc7a7d27bf013bbc768c23fed57c7%2Fd63fe040e41049319f17801f1a0aa4fd"
    },
    {
      "author": "Illia Novikov",
      "description": "A Ukrainian delegation is heading to Geneva for another round of U.S.-brokered talks with Russian officials, days before next week’s fourth anniversary of Russia’s full-scale invasion of its neighbor. There was no anticipation of any significant progress on ending the war at the Tuesday-Wednesday meeting in Switzerland. Both sides are sticking to their negotiating positions on key issues despite the United States setting a June deadline to reach a settlement. Ukraine is locked in a war of attrition with Russia’s bigger army on the front line while Ukrainian civilians endure Russian aerial barrages that repeatedly knock out power and smash homes.",
      "publishedAt": "2026-02-16T10:57:24Z",
      "title": "Low expectations for US-brokered talks between Russia and Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-us-geneva-000a60378c5b744de10189e25dc8fc7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/fda0083/2147483647/strip/true/crop/5249x3498+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F92%2F197e92f7a8ecb95804b12a02a70c%2F9830013f91ea4fe29d2c91ee4e900aab"
    },
    {
      "author": "Matthew Lee, Justin Spike",
      "description": "Marco Rubio is backing Viktor Orbán ahead of Hungary’s April election during a visit to Budapest. On Monday, Rubio praised Orbán’s close personal relationship with Donald Trump, saying that bond strengthens U.S.-Hungarian cooperation. Rubio also signed a civilian nuclear deal which covers small modular reactors, U.S. nuclear fuel, and spent fuel storage. Rubio’s trip follows a stop in Slovakia on Sunday. Orbán has invited Trump to Budapest and offered to host a U.S.-Russia-Ukraine peace summit. The long-serving leader has remained friendly with Russia and continues purchasing Russian energy.",
      "publishedAt": "2026-02-16T07:51:31Z",
      "title": "Rubio endorses Orbán's bid for another term ahead of April vote",
      "url": "https://apnews.com/article/rubio-orban-hungary-budapest-552c03d93e7517f954388f130f1f7901",
      "urlToImage": "https://dims.apnews.com/dims4/default/54da156/2147483647/strip/true/crop/5731x3819+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2F58%2F594d14bc27ca2ce1ad8abe8fa4d1%2F0d0870aa493e4020b42cc547ebc80f7d"
    },
    {
      "author": "Kate Brumback",
      "description": "The NAACP and allied groups are asking a judge to limit how the federal government uses voter data seized in an FBI raid near Atlanta. In a motion filed late Sunday, they asked the judge to bar any use beyond the stated criminal investigation. They also asked for a full inventory of what agents took during the Jan. 28 seizure at the Fulton County elections hub and who has accessed it. FBI agents arrived at the elections warehouse with a warrant seeking 2020 Fulton County election records. The Justice Department did not immediately respond to a request for comment Monday.",
      "publishedAt": "2026-02-16T14:04:52Z",
      "title": "NAACP urges judge to protect voter information seized by FBI in Georgia",
      "url": "https://apnews.com/article/fbi-georgia-elections-fulton-county-2020-ballots-e0eb5970169ade6f775e317f7fa12d5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e18d52c/2147483647/strip/true/crop/3500x2332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F97%2F18097cee2507df0cb522540af74a%2Fe6f2db0f84d24f84a941123ce9b6d9f3"
    },
    {
      "author": "Aarón Ibarra, María Verza",
      "description": "The abduction of 10 mine workers in Mexico's Sinaloa state has raised questions again about the government's touted security improvements. In late January, gunmen abducted workers from a Canadian-owned silver and gold mine near Panuco. Authorities have identified five bodies and are working to identify five more. Since September 2024, two Sinaloa Cartel factions have fought across the state. President Claudia Sheinbaum points to lower homicide rates but analysts say episodes like this undermine her message. Security forces add troops and make arrests yet residents say fear, displacement and missing people keep rising.",
      "publishedAt": "2026-02-16T05:07:52Z",
      "title": "Fear grips Mexican towns after abduction of mine workers",
      "url": "https://apnews.com/article/mexico-cartels-sheinbaum-sinaloa-mines-72cfd0a96077ab5b42de4c1bf156c044",
      "urlToImage": "https://dims.apnews.com/dims4/default/8331c2e/2147483647/strip/true/crop/5550x3698+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2Fc9%2F555b52af1374ac61f19a90697adf%2F2f652b3be6bd452cbdfa80d05fae2078"
    },
    {
      "author": "Ben Finley",
      "description": "More than 1,000 immigration agents have left Minnesota’s Twin Cities area and hundreds more will depart in the days ahead as part of the Trump administration’s drawdown of its immigration enforcement surge. That word comes from White House border czar Tom Homan. He tells CBS' “Face the Nation” that a “small” security force will stay for a short period to protect remaining immigration agents and will respond “when our agents are out and they get surrounded by agitators and things got out of control.” He didn't define “small.” The Trump administration announced last week it was drawing down its immigration enforcement surge in Minneapolis and St. Paul.",
      "publishedAt": "2026-02-15T17:35:18Z",
      "title": "Trump's border czar says 'small' security force will remain in Minnesota",
      "url": "https://apnews.com/article/homan-immigration-agents-minnesota-enforcement-operation-drawdown-5a7940eb9b5100d46efc33a97f524da0",
      "urlToImage": "https://dims.apnews.com/dims4/default/725cae7/2147483647/strip/true/crop/5188x3457+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fbb%2F42940b607106d659d721aa04de9e%2F20573de1323e4dfa825488522ef3eac8"
    },
    {
      "author": "Mauricio Savarese",
      "description": "A Rio Carnival samba school has honored Brazilian President Luiz Inácio Lula da Silva with a glowing parade, but his rivals are calling it illegal early campaigning. On Sunday night, Academicos de Niteroi filled Rio de Janeiro's Sambadrome with floats and songs about Lula’s rise from poverty to national power. The school’s organizer says it is a cultural tribute, not campaign material. Analysts say the risk sits with any link to his administration. Brazil's top electoral court has rejected attempts to block the parade but judges say they might review the case if they find that rules were broken.",
      "publishedAt": "2026-02-16T04:10:41Z",
      "title": "Lula celebrated at Rio parade as critics claim early campaign start",
      "url": "https://apnews.com/article/brazil-carnival-lula-tribute-opposition-parade-ae3703e42b4bd52255f20c7fcedfda42",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d189c6/2147483647/strip/true/crop/6344x4227+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F69%2Fc68ec6c51c6688cf1b6b9026f019%2Fc8066538120f4bdb931f9f7e832409e2"
    },
    {
      "author": "The Associated Press",
      "description": "Government offices, the stock market and schools are closed Monday in observance of Presidents Day, but most big retailers are open. When in doubt, call ahead or look up more specific schedules online for stores in your neighborhood. U.S. stock markets and banks are closed Monday but will reopen on Tuesday. National parks are open and free to U.S. residents on Presidents Day. The official designation for the holiday is Washington’s Birthday after first President George Washington, although it has come to be known informally as Presidents Day.",
      "publishedAt": "2026-02-16T12:40:54Z",
      "title": "What's open and closed on Presidents Day",
      "url": "https://apnews.com/article/presidents-day-holiday-stores-open-closed-4f4955a83d4b04a3e49078ebc0b95b50",
      "urlToImage": "https://dims.apnews.com/dims4/default/d771a95/2147483647/strip/true/crop/5716x3809+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fd9%2F4cd2f2cfae485b516fb9a911b2de%2F1aa54d162fba4c0ab42435399ac6ba24"
    },
    {
      "author": "Aamer Madhani",
      "description": "Lawmakers and the White House are offering no signs of compromise in their battle over oversight of federal immigration officers. That impasse has led to a pause in funding for the Department of Homeland Security. A partial government shutdown began Saturday after congressional Democrats and President Donald Trump’s team failed to reach a deal on legislation to fund the department through September. Democrats are demanding changes to how immigration operations are conducted after the fatal shootings of two U.S. citizens by federal officers in Minneapolis last month. Congress on recess until Feb. 23, and both sides appear dug into their positions.",
      "publishedAt": "2026-02-15T18:49:03Z",
      "title": "No clear path to ending the partial government shutdown",
      "url": "https://apnews.com/article/government-shutdown-homeland-security-democrats-ice-bd2b84b6f38f1c916637b205854a3c83",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fe5376/2147483647/strip/true/crop/3725x2482+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fed%2F35f6073fe9bf911382b67745e398%2Fb5735dd5817a4aa4829f08af3cad1527"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}