{
  "articles": [
    {
      "author": "Seth Borenstein",
      "description": "Hundreds of weather forecasters and other federal National Oceanic and Atmospheric Administration employees on probationary status have been fired, lawmakers and weather experts say. Federal workers who were not let go said the Thursday afternoon layoffs included meteorologists who do crucial local forecasts in National Weather Service offices across the country. Cuts at NOAA appeared to be happening in two rounds, one of 500 and one of 800. That’s about 10% of NOAA’s workforce. Congresswoman Grace Meng of New York called the terminations “unconscionable” and said, \"This action will only endanger American lives going forward.”",
      "publishedAt": "2025-02-28T03:21:43Z",
      "title": "Hundreds of weather forecasters fired in latest wave of DOGE cuts",
      "url": "https://apnews.com/article/national-weather-service-layoffs-trump-doge-a65360a1eb2500b7d47c9c966e383f4a",
      "urlToImage": "https://dims.apnews.com/dims4/default/79dcf6b/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fc5%2F37d944929a7794f73099984525e3%2F59f1be55bac94a8b8d5729ad3d00b3fd"
    },
    {
      "author": "Meg Kinnard, Kevin S. Vineys",
      "description": "Civilian federal jobs are being cut by the thousands, as Elon Musk’s Department of Government Efficiency continues to shrink the government workforce at the behest of President Donald Trump. That’s brought a lot of churn and uncertainty in the nation’s capital, where 20% of the country’s more than 2 million civilian — or nonmilitary — federal workers are located. It’s also affecting workers and communities outside the Washington, D.C. area, where about 80% of that workforce is based. Those cuts mean that members of Congress are now facing potential angst among the out-of-work federal employees in their districts across the country. Some of the highest concentrations of federal workers are in places such as Oklahoma, Alaska, Alabama and New Mexico.",
      "publishedAt": "2025-02-27T20:48:14Z",
      "title": "Where are federal jobs affected by DOGE cuts? A look at congressional districts across the US",
      "url": "https://apnews.com/article/doge-federal-job-cuts-congressional-districts-data-5d79e2a7ef2160166b0bee59dfa4e9e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ad665e/2147483647/strip/true/crop/1442x811+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fa7%2F802522fd8fcf73aae6cc52b83786%2F5d3eb399a07e4c729980f7d43f05fa3d"
    },
    {
      "author": "Janie Har",
      "description": "A federal judge in San Francisco finds the mass firings of probationary employees were likely unlawful. Thursday’s decision grants temporary relief to a coalition of labor unions and organizations that has sued to stop the Trump administration’s massive trimming of the federal workforce. U.S. District Judge William Alsup ordered the Office of Personnel Management to inform certain federal agencies that it had no authority to order the firings of probationary employees, including the Department of Defense. Lawyers for the personnel office say individual agencies made the decision to fire employees and that it had no role in ordering the firings.",
      "publishedAt": "2025-02-27T17:26:12Z",
      "title": "Judge finds mass firings of federal probationary workers were likely unlawful",
      "url": "https://apnews.com/article/trump-federal-employees-firings-a85d1aaf1088e050d39dcf7e3664bb9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ff6c88/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F09%2F4c19f031d3565982ab17c2ae81a7%2F4717b5ef5966451d9d72b3e929019e20"
    },
    {
      "author": "Lolita C. Baldor",
      "description": "Five former secretaries of defense are calling on Congress to hold immediate hearings on President Donald Trump’s recent firings of the chairman of the Joint Chiefs of Staff and several other senior military leaders. That's according to a letter obtained by The Associated Press. The five men represent Republican and Democratic administrations over the past three decades. They said the dismissals raised troubling questions about the administration’s desire to politicize the military. Defense Secretary Pete Hegseth has defended the firing of Gen. CQ Brown Jr. as chairman of the Joint Chiefs, saying that other presidents made changes in military personnel and that Trump deserves to pick his own team.",
      "publishedAt": "2025-02-27T22:10:40Z",
      "title": "Former defense chiefs call for hearings on Trump's firing of Pentagon leaders",
      "url": "https://apnews.com/article/pentagon-defense-chiefs-firings-congress-6da5306a912d578f22bb2239f80502e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8560ff/2147483647/strip/true/crop/8115x4565+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fc5%2F0add6135c19ee91e271b4ba0d161%2Fbbe6a549f1ed46a4ae9ef00a36f4313a"
    },
    {
      "author": "Fatima Hussein",
      "description": "The Social Security Administration is preparing to lay off at least 7,000 people from its workforce of 60,000 — and the final reduction in force number could be as high as 50%, according to two people familiar with the agency’s plans who are not authorized to speak publicly. It’s unclear how the layoffs will directly impact benefits of the 72.5 million beneficiaries, including retirees and children who receive retirement and disability benefits. However, advocates and Democratic lawmakers warn that layoffs will reduce the agency’s ability to serve recipients in a timely manner. The layoffs are part of the Trump administration’s intensified efforts to shrink the size of the federal workforce through the Department of Government Efficiency, run by Trump advisor Elon Musk.",
      "publishedAt": "2025-02-27T21:16:00Z",
      "title": "Social Security Administration could cut halve its workforce amid DOGE cuts",
      "url": "https://apnews.com/article/social-security-layoffs-doge-musk-trump-93efbed33957af5ec8ac37744d0592de",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "Susan Montoya Bryan, Brian Melley",
      "description": "A search warrant shows that Oscar-winner Gene Hackman, his wife and one of their dogs had been dead for some time when a maintenance worker discovered their bodies at the couple's Santa Fe, New Mexico, home. The Santa Fe County Sheriff’s Office said Thursday that Hackman was found dead Wednesday in an entryway and his wife, Betsy Arakawa, was found in a bathroom next to a space heater. There was an open prescription bottle and pills scattered on the countertop near Arakawa. Authorities say foul play isn’t suspected. They haven’t disclosed how the couple died and say the investigation is ongoing.",
      "publishedAt": "2025-02-27T09:04:08Z",
      "title": "Oscar winner Gene Hackman and his wife found dead at home in New Mexico",
      "url": "https://apnews.com/article/gene-hackman-found-dead-f6c106e92987aeaaab7b35c1b956a5c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/93e0056/2147483647/strip/true/crop/1442x811+0+114/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fb2%2F11cea85084bf45d329cbdb087020%2F44b3a1d32a7b4c38b85548a13681bd9c"
    },
    {
      "author": "Jim Morris",
      "description": "Projections show Ontario Premier Doug Ford won reelection to lead Canada’s most populous province, giving him the mandate he wanted to fight tariffs threatened by President Donald Trump. He said afterward he would make sure to protect the people of Ontario. The victory of Ford’s Progressive Conservative Party will give him his third term as premier. Prime Minister Justin Trudeau, whose Liberal Party will choose a new leader March 9, congratulated Ford on his victory. Ford said when he called the early election that he needed a four-year mandate to protect Ontario, Canada’s manufacturing and automobile hub. Trump has threatened to implement 25% tariffs on Canadian imports, with a lower 10% levy on energy, beginning Tuesday.",
      "publishedAt": "2025-02-28T03:40:34Z",
      "title": "Doug Ford reelected as Ontario’s premier with mandate to fight Trump tariffs",
      "url": "https://apnews.com/article/ontario-canada-election-doug-ford-d81f6b94cfbd3ad038362432cd8c3c53",
      "urlToImage": "https://dims.apnews.com/dims4/default/7626059/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2Fc1%2F8a7e9081de402a1fca6fa5b782b9%2F33ee1bb2dfe647c99a5d9e860a1a6f27"
    },
    {
      "author": "Yirmiyan Arthur",
      "description": "An international border fence may soon split the village of Longwa in two. In the extreme northeast of India live the Nagas, an indigenous people whose traditional land stretches into Myanmar. People living along the border have long enjoyed easy access to both countries under the Free Movement Regime, which let them roam freely within 16 kilometers of the border without a visa. But in February 2024 the Indian government decided to scrap the system “to ensure the internal security of the coutry and to maintain the demographic structure of India’s North Eastern states bordering Myanmar.” Officials say a fence may one day run along this border, right through the middle of villages like Longwa.",
      "publishedAt": "2025-02-28T03:12:08Z",
      "title": "In northeast India, a border fence could cut through villages, houses and lives",
      "url": "https://apnews.com/article/india-myanmar-border-village-b3cc91d2febcee465b866cd32127318c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6ef381/2147483647/strip/true/crop/5460x3071+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F39%2F2d5ded30143a7f4f9aed6ac1e928%2F033f25c7100c41eea8f5b0cfd07115db"
    },
    {
      "author": "Jill Lawless, Aamer Madhani",
      "description": "British Prime Minister Keir Starmer is using a visit to Washington to press President Donald Trump not to abandon Ukraine as he looks to find a quick endgame to Russia’s bloody invasion of its neighbor. With a mix of flattery and frank talk, the center-left Starmer made the case to the Republican president to remain cautious as he goes about ending the biggest conflict in Europe since World War II. The British premier started the visit by delivering an invitation from King Charles III to come to Scotland for a “historic” state visit — noting it was an “unprecedented” honor since Trump already had been given the royal treatment by Queen Elizabeth II during his first term.",
      "publishedAt": "2025-02-27T05:02:38Z",
      "title": "UK's Starmer says ending Russia's war in Ukraine 'can't be peace that rewards the aggressor'",
      "url": "https://apnews.com/article/trump-starmer-ukraine-28ca602f1df21af5797ba949f36160f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbbf54a/2147483647/strip/true/crop/4577x2575+0+238/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F95%2F9ba1ef5f7fda9484f7fe6011f4c3%2F271236efa51347ee83867b77f15c8724"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa, Natalie Melzer",
      "description": "Egypt says negotiations between Israel and Hamas on the next phase of the Gaza ceasefire have begun in Cairo. Egypt's state information service said officials from Israel, Qatar and the U.S. on Thursday started “intensive discussions” on the second phase of the ceasefire. Earlier in the day, an Israeli official had said its military will not withdraw from a strategic corridor in the Gaza Strip. The pullout was part of the ceasefire and Israel’s refusal could spark a crisis with Hamas and key mediator Egypt at a sensitive moment for the fragile truce. The Israeli official spoke hours after Hamas released the remains of four hostages in exchange for over 600 Palestinian prisoners, the last planned exchange of the ceasefire’s first phase, which ends this weekend.",
      "publishedAt": "2025-02-27T07:02:11Z",
      "title": "Bodies of 4 Israeli hostages identified after Hamas returned them, group says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-02-27-2025-cfcdd8786afe4bc73ae79b3e0e4ccb3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/de3d2a5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2F67%2Fb7964078cf1af0af0562d35c1224%2Ff074955391334d09a68b228ef82b8ce5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}