{
  "articles": [
    {
      "author": null,
      "description": "ROCHESTER HILLS, Mich. (AP) — Nine people were injured, including two young children and their mother, after a shooter opened fire at a splash pad in a Detroit suburb where families gathered to escape the summer heat Saturday.",
      "publishedAt": "2024-06-15T23:59:39Z",
      "title": "Shooting at splash pad in Detroit suburb injures 9, including 2 children. An 8-year-old is critical",
      "url": "https://apnews.com/7d2700a7efdf003e151917d85deb1a35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c944cbe917bf4bb6b639a3db6e4218d0/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military on Sunday announced a “tactical pause” in its offensive in the southern Gaza Strip to allow the deliveries of increased quantities of humanitarian aid.",
      "publishedAt": "2024-06-16T04:01:50Z",
      "title": "Israeli military announces 'tactical pause' in attempt to increase flow of aid into hard-hit Gaza",
      "url": "https://apnews.com/8c111f2dcf783f8671e6dd6f19547b17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdbab80a96e641d689b818c0b242583f/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and JOEY CAPPELLETTI",
      "description": "DETROIT (AP) — Donald Trump blamed immigrants for stealing jobs and government resources as he courted separate groups of Black voters and hardcore conservatives in battleground Michigan on Saturday.",
      "publishedAt": "2024-06-15T11:32:46Z",
      "title": "Trump blasts immigrants for taking jobs as he courts voters at a Black church, MAGA event in Detroit",
      "url": "https://apnews.com/2ddab35eceecb42ee8899f0720715b32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/351d61f62e4f452ba26aaab5189401d7/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump on Saturday night suggested President Joe Biden “should have to take a cognitive test,\" only to confuse who administered the test to him in the next sentence.",
      "publishedAt": "2024-06-16T00:35:03Z",
      "title": "Trump challenges Biden to a cognitive test but confuses the name of the doctor who tested him",
      "url": "https://apnews.com/0d45b6d89ae295b690f5ad12ca0bd38a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d8bcc571c5e477ab352c4b1581b1ae1/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "LOS ANGELES (AP) — Some of Hollywood's brightest stars headlined a glitzy fundraiser for President Joe Biden on Saturday night, helping raise what his reelection campaign said was $28 million and hoping to energize would-be supporters for a November election that they argued was among the most important in the nation's history.",
      "publishedAt": "2024-06-15T04:02:37Z",
      "title": "Clooney and Roberts help Biden raise $28 million at a fundraiser featuring dire warnings about Trump",
      "url": "https://apnews.com/40081471c93faa68de5c4aa30455303b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e51436efa08245069b387cd501383ffa/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Britain put on a display of birthday pageantry Saturday for King Charles III, a military parade that marked the Princess of Wales ’ first appearance at a public event since her cancer diagnosis early this year.",
      "publishedAt": "2024-06-15T09:30:38Z",
      "title": "UK royals unite on palace balcony, with Kate back at her first public event since cancer diagnosis",
      "url": "https://apnews.com/2b3598b61e05207cb35c4df69365eec2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b17a8d9ffe574d3eb77ddb4cc4f27942/1920.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT",
      "description": "INDIANAPOLIS (AP) — Indiana Republicans rejected Sen. Mike Braun’s choice for lieutenant governor on Saturday, instead nominating a podcasting pastor with far-right views to be his running mate.Braun, who is leaving the Senate, endorsed state Rep.",
      "publishedAt": "2024-06-15T04:05:42Z",
      "title": "Indiana Republicans upset Mike Braun’s choice for lieutenant governor, backing far-right pick",
      "url": "https://apnews.com/7396410846c39f2a62e30655050e823a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad84bf6a1de04bcf92c17a47ea4d4b50/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN and AAMER MADHANI",
      "description": "OBBÜRGEN, Switzerland (AP) — Dozens of world leaders converged on a Swiss resort Saturday to discuss how to bring peace to war-ravaged Ukraine, though any hopes of a real breakthrough were muted by the absence of Russia.",
      "publishedAt": "2024-06-15T07:02:32Z",
      "title": "World leaders meet in Switzerland to discuss a Ukraine peace roadmap. Russia is notably absent",
      "url": "https://apnews.com/2a8abeb9e6e2714f6af032593706d9e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd4dc109d8014a08b345f4ce45ab93e6/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "A judge has overturned the conviction of a Missouri woman who was a psychiatric patient when she incriminated herself in a 1980 killing that her attorneys argue was actually committed by a now-discredited police officer.",
      "publishedAt": "2024-06-15T16:43:58Z",
      "title": "Missouri woman's murder conviction tossed after 43 years. Her lawyers say a police officer did it",
      "url": "https://apnews.com/3cb4c9ae74b2e95cb076636d52453228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b15ca1e5ca64c418ed7928f8224266f/2000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES and GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — Thousands of demonstrators took to the streets of Sao Paulo on Saturday as protests sweep across Brazil in opposition to a bill that would further criminalize abortions. If passed, the law would equate the termination of a pregnancy after 22 weeks with homicide.",
      "publishedAt": "2024-06-15T21:50:05Z",
      "title": "Outraged Brazilian women stage protests against bill to equate late abortions with homicide",
      "url": "https://apnews.com/21ee9a590cafdaa11108b54029660ba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/258babab8e684cee975d784f8e40831b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}