{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAM MEDNICK and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel ordered new evacuations in Gaza's southern city of Rafah on Saturday, forcing tens of thousands more people to leave as it prepared to expand its military operation deeper into what is considered Gaza’s last refuge, in defiance of growing pressure from close ally the United States and others.",
      "publishedAt": "2024-05-11T07:02:12Z",
      "title": "Israel orders new evacuations in Gaza's last refuge of Rafah as it expands military offensive",
      "url": "https://apnews.com/7cc8784d8c6eec017ecaef696f492b25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75523ce6da914153bff81f14ef8e1cb5/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Ruby Chen’s son, Itay, was killed in the Hamas attack on Oct. 7. But unlike scores of other families of soldiers killed that day, Chen doesn’t have a grave to visit because his son’s remains are held captive in Gaza.",
      "publishedAt": "2024-05-12T05:36:43Z",
      "title": "With the shock of Oct. 7 still raw, profound sadness and anger grip Israel on its Memorial Day",
      "url": "https://apnews.com/9e5e35ef6352c79ab59e7f3b8a7f7a1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f8d77496b5b45cca2bdb3e447c24549/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, MIKE CATALINI and MEG KINNARD",
      "description": "WILDWOOD, N.J. (AP) — Sandwiched between his appearances in court, Donald Trump headed on Saturday to the Jersey Shore, where he repeatedly blamed President Joe Biden for the criminal charges he’s facing as the presumptive nominees prepare to face off in the November election and called his New York hush money case “a Biden show trial.”",
      "publishedAt": "2024-05-11T04:05:20Z",
      "title": "Trump tells Jersey Shore crowd he's being forced to endure 'Biden show trial' in hush money case",
      "url": "https://apnews.com/59a8073e5a22f7a1e13f1461e9998419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d01c4d29e77a4fb1a67048565a015344/3000.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and EVGENIY MALOLETKA",
      "description": "VOVCHANSK, Ukraine (AP) — Moscow's forces captured five villages in a renewed ground assault in northeastern Ukraine, the Russian Defense Ministry said Saturday, and Associated Press journalists in the city of Vovchansk described multiple buildings destroyed after Russian airstrikes and barrages of Grad rockets.",
      "publishedAt": "2024-05-11T10:09:43Z",
      "title": "Russia says it has captured 5 villages in northeast Ukraine as more than 1,700 civilians flee",
      "url": "https://apnews.com/26184a3898db0aece9f6e9eb3a700e7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/764711a329c54915bae8aeaee54056e5/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN and CLAUDIA LAUER",
      "description": "On the afternoon of May 3, Roger Fortson opened the door of his Florida apartment with a gun in his hand and was immediately shot six times by a sheriff’s deputy responding to a complaint about an argument.",
      "publishedAt": "2024-05-11T21:02:42Z",
      "title": "Experts say gun alone doesn't justify deadly force in fatal shooting of Florida airman",
      "url": "https://apnews.com/5b97a30b51272413346b255235f3ba70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a29db78a464168a281865d3caa4412/3000.jpeg"
    },
    {
      "author": "DÉBORA REY",
      "description": "BUENOS AIRES, Argentina (AP) — When Luana Salva got her first formal job after years of prostitution, she was ecstatic. A quota law in Argentina that promoted the inclusion of transgender people in the work force — unprecedented in Latin America expect in neighboring Uruguay — pulled her from the capital's street corners into the Foreign Ministry last year.",
      "publishedAt": "2024-05-12T04:05:55Z",
      "title": "In progressive Argentina, the LGBTQ+ community says President Milei has turned back the clock",
      "url": "https://apnews.com/d75a798ed804ba02e3d3d7abff3fce11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2ce99925a0b438093e5f15fb4a9041e/3000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — After weeks of preparation, crews are scheduled to conduct a controlled demolition Sunday to break down the largest remaining span of the collapsed Francis Scott Key Bridge in Maryland, which came crashing down under the impact of a massive container ship on March 26.",
      "publishedAt": "2024-05-12T04:17:13Z",
      "title": "Crews prepare for controlled demolition as cleanup continues at bridge collapse site",
      "url": "https://apnews.com/3da84f13a5688af5cc0bdba4c922bd32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c375cddfa5a446959a9dca7458ad5337/2006.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "Small pro-Palestinian protests popped up sporadically Saturday as colleges and universities from North Carolina to California held commencement ceremonies, including dozens of graduating students at Virginia Commonwealth University who walked out on an address by Gov.",
      "publishedAt": "2024-05-11T21:09:51Z",
      "title": "Small pro-Palestinian protests held Saturday as college commencements are held",
      "url": "https://apnews.com/eab2700b77061ba8a78eb2122123eb0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaaa1a9cc64641bfbc5bcf5fad4f87ef/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "MALMO, Sweden (AP) — Swiss singer Nemo won the 68th Eurovision Song Contest early Sunday with “The Code,” an operatic pop-rap ode to the singer’s journey toward embracing a nongender identity.",
      "publishedAt": "2024-05-11T07:38:40Z",
      "title": "Switzerland’s Nemo wins 68th Eurovision Song Contest after event roiled by protests over Gaza war",
      "url": "https://apnews.com/09e31963ed7db607ea137c9333eabf87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/142e12ac6f87422abe48f94c80591786/1920.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "The Cannes Film Festival rarely passes without cacophony but this year’s edition may be more raucous and uneasy than any edition in recent memory.",
      "publishedAt": "2024-05-12T05:34:11Z",
      "title": "A combustible Cannes is set to unfurl with 'Furiosa,' 'Megalopolis' and a #MeToo reckoning",
      "url": "https://apnews.com/0eee7ebe75363e76fba89ca3bfe010b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b668fbe1d0f1493dbbad55d8a7d480f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}