{
  "articles": [
    {
      "author": "ZEKE MILLER, CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "Donald Trump has begun erasing Joe Biden’s legacy after taking office as the nation’s 47th president. He has pardoned nearly all of his supporters who rioted at the U.S. Capitol in 2021 and issued a blizzard of executive orders that signal his desire to remake American institutions. It's an aggressive start for a returning president who feels emboldened and vindicated by his unprecedented political comeback. Four years after being voted out of the White House, Trump has a second chance to launch what he called “a golden era” for the country. He signed orders for increasing border security, freezing new regulations and establishing a task force for reducing the size of the federal government. He also rescinded dozens of directives issued by Joe Biden.",
      "publishedAt": "2025-01-20T05:06:30Z",
      "title": "Trump sets out to erase Biden's legacy after taking office as 47th president",
      "url": "https://apnews.com/article/donald-trump-inauguration-swearing-capitol-b3549ebe5dae74a872502aa79def7a11",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d3deff/2147483647/strip/true/crop/6356x3575+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fdd%2F3b3d769831ada7b580bfd4655e52%2Fdbc63187ee3c411e8199c1e050d904a4"
    },
    {
      "author": "ALANNA DURKIN RICHER, MICHAEL KUNZELMAN",
      "description": "President Donald Trump has pardoned, commuted the prison sentences or vowed to dismiss the cases of all of the 1,500-plus people charged with crimes in the Jan. 6, 2021, attack on the U.S. Capitol. Trump’s action Monday paves the way for the release from prison of people found guilty of violent attacks on police, as well as leaders of far-right extremist groups convicted of failed plots to keep the Republican in power after he lost the 2020 election to former President Joe Biden. The pardons are a culmination of Trump’s yearslong campaign to rewrite the history of the Jan. 6 attack that left more than 100 police officers injured.",
      "publishedAt": "2025-01-21T00:57:15Z",
      "title": "Trump issues sweeping pardon of supporters charged in the Jan. 6, 2021, Capitol attack",
      "url": "https://apnews.com/article/capitol-jan-6-pardons-trump-justice-department-8ce8b2a8f8cb602d5eaf85ac7b969606",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec3e980/2147483647/strip/true/crop/5440x3060+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F3c%2F5f80623162b2ef0bd648e5f064c1%2F524a7057f98e4b028d0d68cb974b7f0b"
    },
    {
      "author": "COLLEEN LONG, BILL BARROW, JILL COLVIN",
      "description": "President Donald Trump has signed a flurry of executive actions on Day 1. He has repealed dozens of former President Joe Biden’s actions, begun his immigration crackdown, withdrawn the U.S. from the Paris climate accords and sought to keep TikTok open in the U.S., among other actions. He has pardoned hundreds of people for their roles in the Jan. 6, 2021, attack on the U.S. Capitol. He is easing regulatory burdens on oil and natural gas production, something he promises will bring down costs of all consumer goods. He is pulling the U.S. out of the World Health Organization and has ordered a comprehensive review of foreign aid spending",
      "publishedAt": "2025-01-20T16:19:14Z",
      "title": "From TikTok to Jan. 6, this is what President Trump did on his first day back in office",
      "url": "https://apnews.com/article/trump-day-1-executive-orders-3a035a0bbd37b5c12630b92c8c8a9625",
      "urlToImage": "https://dims.apnews.com/dims4/default/e93f226/2147483647/strip/true/crop/4479x2519+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F70%2F5f7e23f4ef8e66616922e00aa2c7%2F1891260582d84f2598be01c9cd832936"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump's Inauguration Day speeches were punctuated by several false or misleading claims, many of which he has made before. The Republican vowed to reverse changes made by the outgoing Democratic president, Joe Biden, offering a glimpse of several executive actions to chart a new course for America. But in outlining his agenda, Trump made false claims in areas including immigration, the economy, electric vehicles and the Panama Canal.",
      "publishedAt": "2025-01-20T19:44:43Z",
      "title": "FACT FOCUS: A look at false and misleading claims Trump made at inaugural events",
      "url": "https://apnews.com/article/trump-inauguration-fact-check-b920161868e192d0430df534a42ea5ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/18c77b9/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fb5%2F8f7db6f6525e05e02bb75d93836e%2F4d8be891419b4e42bafcb2a93846bf9d"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "President Donald Trump’s second inauguration seemed normal, but there were concerns about U.S. democracy lingering just beneath the surface. Trump himself made those apparent when he followed his speech that urged unity and optimism with one to supporters vowing to pardon Jan. 6 rioters — and then later he did just that. Trump has also promised to seek revenge against his political opponents. That pledge led to a blitz of last-minute preemptive pardons issued by outgoing President Joe Biden. The ceremony was moved inside the U.S. Capitol due to cold weather. That meant it took place in the very halls Trump supporters stormed on Jan. 6, 2021, as they acted on Trump's election lies and sought to stop Biden from taking office.",
      "publishedAt": "2025-01-21T05:04:08Z",
      "title": "Beneath a veneer of calm, Trump's inauguration holds warning signs for US democracy",
      "url": "https://apnews.com/article/trump-inauguration-biden-democracy-power-00d5651a0ac611c2c6e3b555c4a8ad11",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c6885a/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F96%2F8794c0a8e31c7721fe2e412dde53%2F2676e60414ac4227b3256eef1229f800"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Dignitaries from across Washington and around the world crammed into the U.S. Capitol Rotunda on Monday to watch power transfer peacefully from Democratic former President Joe Biden to his Republican successor, Donald Trump.",
      "publishedAt": "2025-01-20T19:54:53Z",
      "title": "Trump returns to power in historic inauguration: Captured in photos",
      "url": "https://apnews.com/article/trump-inauguration-photo-gallery-088d0354467f5cd21d7cb95ac78bcdcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/488db9c/2147483647/strip/true/crop/7252x4079+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F30%2F6f1edd5570f5b24b7d82e5a35d4c%2Fe331071fcc1141e296e9b610702c4515"
    },
    {
      "author": "ADRIANA GOMEZ LICON, ALEX CONNOR",
      "description": "The crowded scene in the Capitol Rotunda on Inauguration Day featured four of the world’s five wealthiest men, five U.S. presidents, influential sporting figures and two other foreign leaders with prime seats on the dais. Wide photographs of the swearing-in ceremony captured notable figures seated next to Cabinet picks, and a mix of traditional, unprecedented and unorthodox guests with Supreme Court justices, the Chinese vice president and the CEO of the Louis Vuitton empire.",
      "publishedAt": "2025-01-21T00:20:55Z",
      "title": "A guide to the wealthiest and most powerful at Trump's swearing-in",
      "url": "https://apnews.com/article/trump-inauguration-who-stood-where-a689828e986838c1735aeef03f3b32b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee44575/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F17%2Fd770c51d4bfe860d0628a7da356f%2F1.png"
    },
    {
      "author": "JUAN ZAMORANO",
      "description": "U.S. President Donald Trump’s insistence that he wants to have the Panama Canal back under U.S. control is feeding nationalist sentiment and worry in Panama, home to the critical trade route and a country familiar with U.S. military intervention. In the streets of the capital, some Panamanians on Monday saw it as Trump’s way of applying pressure on Panama for something else he wants: better control of migration through the Darien Gap. Others recalled the 1989 U.S. invasion of Panama with concern. Panama President José Raúl Mulino responded forcefully, saying that the canal belongs to his country of 4 million and will remain Panama’s territory.",
      "publishedAt": "2025-01-21T05:16:24Z",
      "title": "Panama, familiar with US intervention, bristles at Trump's comments on canal",
      "url": "https://apnews.com/article/panama-canal-trump-us-invasion-19d1a3723ac0c407f49e8b35aebc14f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8a5717/2147483647/strip/true/crop/6804x3827+0+354/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F8e%2Fc4407bb6368f4b89be763d40d65a%2Fc1a0a59680074993b941af4b146dbf2a"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate has passed a bill that would require federal authorities to detain migrants accused of theft and violent crimes. It's the first measure that President Donald Trump likely will sign into law and gives more weight to his plans to deport millions of migrants. Trump has made a broad crackdown on illegal immigration his top priority. And Congress, with Republicans in control and some Democrats willing to go along, is showing it's ready to follow suit. The Laken Riley Act is named after a Georgia nursing student whose murder by a Venezuelan man last year became a rallying cry for Trump’s White House campaign.",
      "publishedAt": "2025-01-20T23:37:23Z",
      "title": "Senate passes immigrant detention bill that could be the first measure Trump signs into law",
      "url": "https://apnews.com/article/congress-immigration-laken-riley-trump-4011a282775d58d509d953a9830aa367",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b5d210/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F03%2Fb52361995e9edd257612a8128c37%2F5e095d80fdfc4b95b6e7c897e13c3833"
    },
    {
      "author": "ABDEL KAREEM HANA, TIA GOLDENBERG",
      "description": "Palestinians in Gaza are confronting an apocalyptic landscape of devastation after more than 15 months of fighting between Israel and Hamas. Mounds of rubble stretch as far as the eye can see in the tiny coastal enclave where built-up refugee camps are interspersed between cities. Critics say Israel has waged a campaign of scorched earth to destroy the fabric of life in Gaza. Israel says its military has been fighting a complex battle in dense urban areas and that it tries to avoid causing undue harm to civilians.",
      "publishedAt": "2025-01-21T10:32:30Z",
      "title": "Palestinians confront a landscape of destruction in Gaza's 'ghost towns'",
      "url": "https://apnews.com/article/gaza-war-aftermath-destruction-4c148d498f3d67a5d6de2107b6a1c966",
      "urlToImage": "https://dims.apnews.com/dims4/default/9148dfa/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F5b%2Fd55e7e09fec5efa599b3429fc59b%2Fgaz-war-rafah-return-20250121cr-1920x1080.jpg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}