{
  "articles": [
    {
      "author": "MATT BROWN and STEVE PEOPLES",
      "description": "NEW YORK (AP) — Donald Trump says he wants to hold a major campaign event at New York's Madison Square Garden featuring Black hip-hop artists and athletes. His aides speak of making appearances in Chicago, Detroit and Atlanta with leaders of color and realigning American politics by flipping Democratic constituencies.",
      "publishedAt": "2024-04-27T04:05:47Z",
      "title": "Trump promised big plans to flip Black and Latino voters. Many Republicans are waiting to see them",
      "url": "https://apnews.com/d421f0859579a48adfb03bbf305aad78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bbeb88cc87b48f893314b7f368b7aa6/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and DAVID RISING",
      "description": "CAIRO (AP) — Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a possible Israeli ground offensive into the southern Gaza city of Rafah.",
      "publishedAt": "2024-04-27T08:31:14Z",
      "title": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as possible Rafah offensive looms",
      "url": "https://apnews.com/7ea816cac94138492f7dddf2865c1d2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b42568b6d42f4aaf875a870328bb1ceb/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD, NOREEN NASIR and NICK PERRY",
      "description": "NEW YORK (AP) — Students protesting the Israel-Hamas war at at universities across U.S., some of whom have clashed with police in riot gear, dug in Saturday and vowed to keep their demonstrations going, while faculty at several schools condemned university presidents who have called in law enforcement to remove protesters.",
      "publishedAt": "2024-04-27T05:48:46Z",
      "title": "Student anti-war protesters dig in as faculty condemn universities' leadership over calling police",
      "url": "https://apnews.com/2ab919ad849c50c9d177a32c0309bd1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04a99e93452e46fa8a9250e0f5522a98/3000.jpeg"
    },
    {
      "author": "JULIE WATSON and LESLIE AMBRIZ",
      "description": "LOS ANGELES (AP) — On a recent afternoon, Grant Oh zigzagged across the University of Southern California campus as if he was conquering an obstacle course, coming up against police blockade after police blockade on his way to his apartment while officers arrested demonstrators protesting the Israel-Hamas war.",
      "publishedAt": "2024-04-27T05:04:28Z",
      "title": "Class of 2024 reflects on college years marked by COVID-19, protests and life's lost milestones",
      "url": "https://apnews.com/7644fb635d24edd30f8f28312cdf85b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c8c440ba05340be859b6327c78a00ee/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "BEIJING (AP) — U.S. Secretary of State Antony Blinken wrapped up his just-concluded latest visit to China with a stop at a Beijing record store where he bought albums by Taylor Swift and Chinese rocker Dou Wei in a symbolic nod to cross-cultural exchanges and understanding he had been promoting for three days.",
      "publishedAt": "2024-04-27T07:09:46Z",
      "title": "The US and China talk past each other on most issues, but at least they’re still talking",
      "url": "https://apnews.com/d96c2bb65a8ac7f1b223d6cc3cf670af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8522c13d59284ed296ca313d43de2e21/3000.jpeg"
    },
    {
      "author": "JOSH FUNK, MARGERY A. BECK and HEATHER HOLLINGSWORTH",
      "description": "OMAHA, Neb. (AP) — Tornadoes wreaked havoc Friday in the Midwest, causing a building to collapse with dozens of people inside and destroying and damaging hundreds of homes, many around Omaha, Nebraska.",
      "publishedAt": "2024-04-27T04:32:02Z",
      "title": "Tornadoes collapse buildings and level homes in Nebraska and Iowa",
      "url": "https://apnews.com/f12770a52d1644d88c1dea1b92bc9903",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f8d220ab3584beab54ccdb900649b87/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — President Joe Biden had a question.“Is it true?” Biden asked Sen. Alex Padilla, referencing the roughly 25% of U.S. students in kindergarten through high school who are Latino.",
      "publishedAt": "2024-04-27T04:04:53Z",
      "title": "As border debate shifts right, Sen. Alex Padilla emerges as persistent counterforce for immigrants",
      "url": "https://apnews.com/b803a621bbaa6c4e6568de1fb1add721",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b53fce007a847c4ade3c1cd6102675c/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The retrial in New York of Harvey Weinstein — whose moviemaking prowess once wowed Hollywood — won’t be coming to a courtroom anytime soon, if ever, legal experts said on a day when one of two women considered crucial to the case said she wasn't sure she would testify again.",
      "publishedAt": "2024-04-27T04:09:23Z",
      "title": "Retrial of Harvey Weinstein unlikely to occur soon, if ever, experts say",
      "url": "https://apnews.com/f27efa6886759bab8529e9a6a9ea57e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1603ce19062346a19d97310b059c8d93/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — On a recent weeknight at this bar in northeast Portland, fans downed pints and burgers as college women's lacrosse and beach volleyball matches played on big-screen TVs. Memorabilia autographed by female athletes covered the walls, with a painting of U.S.",
      "publishedAt": "2024-04-27T04:25:56Z",
      "title": "Oregon's Sports Bra, a pub for women's sports fans, plans national expansion as interest booms",
      "url": "https://apnews.com/0d064d208eb899609e43d52da7157c08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9e0ceb4e3184ae292281819ea917feb/1920.jpeg"
    },
    {
      "author": "ARNIE STAPLETON",
      "description": "ENGLEWOOD, Colo. (AP) — Marvin Harrison Jr., Joe Alt, Kris Jenkins, Jonah Ellis and Luke McCaffrey have turned the NFL draft into a family affair.The sons of former pro football stars, they've followed their fathers' formidable footsteps into the league.",
      "publishedAt": "2024-04-27T03:40:03Z",
      "title": "Elliss, Jenkins, McCaffrey join Harrison and Alt in following their fathers into the NFL",
      "url": "https://apnews.com/c93d610c46eeff99816ebc5cda1c324a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f3e0104330e4091b7da3d5afc75e132/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}