{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — One of Gaza's last functioning hospitals has been emptying out in recent days as Israel has ordered the evacuation of nearby areas and signaled a possible ground operation in a town that has been largely spared throughout the war, officials said Monday.",
      "publishedAt": "2024-08-26T10:53:31Z",
      "title": "Hospital in central Gaza empties out as Israeli forces draw near",
      "url": "https://apnews.com/6d0101cf3dd45dcc7ecee35e0d716ac3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/970381b482f9416186953803d5393f8e/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — A federal judge in Texas on Monday paused a Biden administration policy that would give spouses of U.S. citizens legal status without having to first leave the country, dealing at least a temporary setback to one of the biggest presidential actions to ease a path to citizenship in years.",
      "publishedAt": "2024-08-27T00:08:49Z",
      "title": "Judge in Texas orders pause on Biden program that offers legal status to spouses of US citizens",
      "url": "https://apnews.com/80df0dafd913a22fd7a9074d31eeab65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0a1614d85b14f2c9550a45081bb840f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith urged a federal appeals court Monday to reinstate the classified documents case against former President Donald Trump, saying a judge's decision that dismissed the prosecution was at odds with longstanding Justice Department practice and must be reversed.",
      "publishedAt": "2024-08-26T19:35:10Z",
      "title": "Special counsel urges appeals court to reinstate classified documents case against Trump",
      "url": "https://apnews.com/411e8e3b4d31923560effdd0d2082af4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af3fd819badb41e8937bb20ca3f9b984/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON and JEFF MARTIN",
      "description": "A former Florida sheriff’s deputy charged with killing a Black U.S. Air Force senior airman who answered his apartment door while holding a gun pointed toward the ground was arrested Monday, officials said.",
      "publishedAt": "2024-08-26T21:19:17Z",
      "title": "Authorities arrest ex-sheriff’s deputy who fatally shot a Black airman at his home",
      "url": "https://apnews.com/850414e0baea006d36f2ed9b2f4a385d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cff7424e864468b94171f3365557192/3000.jpeg"
    },
    {
      "author": null,
      "description": "FALCON HEIGHTS, Minn. (AP) — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.Here's a look at some of the weather events:Midwest sizzles under heat wave",
      "publishedAt": "2024-08-27T04:08:03Z",
      "title": "Wild week of US weather includes heat wave, tropical storm, landslide, flash flood and snow",
      "url": "https://apnews.com/74406ed40b60e8dff405488e0e483fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfcd022d9f3a4c68b90e25fb4dcf83b3/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and CHARLOTTE GRAHAM-McLAY",
      "description": "NUKU'ALOFA, Tonga (AP) — Highlighting seas that are rising at an accelerating rate, especially in the far more vulnerable Pacific island nations, U.N. Secretary-General Antonio Guterres issued yet another climate SOS to the world.",
      "publishedAt": "2024-08-26T23:02:47Z",
      "title": "The worldwide catastrophe of rising seas especially imperils Pacific paradises, Guterres says",
      "url": "https://apnews.com/ed5d2c968432215038e41319b22fc1e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e3d8114ad4d45d2b7aca8085b394ce8/3000.jpeg"
    },
    {
      "author": "FABIANO MAISONNAVE",
      "description": "BRASILIA, Brazil (AP) — The buildings in Brazil's modernist capital, Brasilia, have been enveloped in smoky air the past two days. The central part of the country is just the latest region affected by smoke from fires in the Amazon rainforest, Cerrado savannah, the Pantanal wetland and the state of Sao Paulo.",
      "publishedAt": "2024-08-26T21:37:28Z",
      "title": "In a rare event, fire smoke covers Brazil's capital, prompting federal response",
      "url": "https://apnews.com/794564d078bd3c9f265cc3dd429cab4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a31a43335afc4a258327c0ba2b8b3d4b/1920.jpeg"
    },
    {
      "author": null,
      "description": "KUALA LUMPUR, Malaysia (AP) — Former Malaysian Prime Minister Muhyiddin Yassin was charged Tuesday with sedition over a speech he made that allegedly questioned the integrity of the country's previous king.",
      "publishedAt": "2024-08-27T04:01:09Z",
      "title": "Former Malaysian leader Muhyiddin charged with sedition for allegedly mocking former king",
      "url": "https://apnews.com/d600632640874eb96a9767d0ae3f0ab0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/012d5d297bb940a392a1062c4c6d8766/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN and ANDI JATMIKO",
      "description": "JAKARTA, Indonesia (AP) — When Pope Francis begins his Asia tour next week, one of his early stops will be at Indonesia's iconic Istiqlal mosque.",
      "publishedAt": "2024-08-27T03:38:58Z",
      "title": "Pope will visit the Istiqlal mosque in Indonesia on the first stop of an interfaith Asian trip",
      "url": "https://apnews.com/51f7ae0b6be2883faf805adf90a68e4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9683ab7ec0cb44ada338d0c3d77cce42/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — The 4-year-old boy struggled to balance while walking through the living room. His mother’s eyes attentively followed his every move. Then a seizure knocked him to the ground, the dull thud of his small body echoing through the home.",
      "publishedAt": "2024-08-27T04:06:52Z",
      "title": "Brazilian moms are leading the charge to secure medical marijuana for sick kids",
      "url": "https://apnews.com/d50fb583aa401bbed2af4aef5ec851b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b67c6d9ba72496dafa931e7fe0ff2e5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}