{
  "articles": [
    {
      "author": "WALTER BERRY",
      "description": "PHOENIX (AP) — Phoenix sizzled through its 31st consecutive day of at least 110 degrees Fahrenheit (43.3 Celsius) and other parts of the country grappled Sunday with record temperatures after a week that saw significant portions of the U.S.",
      "publishedAt": "2023-07-30T23:33:58Z",
      "title": "July keeps sizzling as Phoenix hits another 110-degree day and wildfires spread in California",
      "url": "https://apnews.com/c4e7ff29fef6fcf9c95b8b9c82f6f72b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62af7b2b46a94628a79582e0e6715423/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — At a moment of growing legal peril, Donald Trump ramped up his calls for his GOP rivals to drop out of the 2024 presidential race as he threatened to go after Republican members of Congress who fail to focus on investigating Democratic President Joe Biden.",
      "publishedAt": "2023-07-30T03:13:59Z",
      "title": "Facing legal peril, Trump calls on GOP to rally around him and focus on investigating Biden",
      "url": "https://apnews.com/c22cda6a5f6783b5f6a1123b724ebaff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac4ffa91570f46abad0b231dbf26c028/2717.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "At 24, Alberto Rodriguez has grandparents younger than Joe Biden. But he's more interested in the 80-year-old president's accomplishments than his age.",
      "publishedAt": "2023-07-30T12:39:39Z",
      "title": "Joe Biden, America's oldest sitting president, needs young voters to win again. Will his age matter?",
      "url": "https://apnews.com/152d11d3090518a2e5eee63b9a596673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09899f06a8c54d998ef8efb34c059dd4/3000.jpeg"
    },
    {
      "author": "ALEX VEIGA",
      "description": "LOS ANGELES (AP) — When viewed through a wide lens, renters across the U.S. finally appear to be getting some relief, thanks in part to the biggest apartment construction boom in decades.Median rent rose just 0.5% in June, year over year, after falling in May for the first time since the pandemic hit the U.S.",
      "publishedAt": "2023-07-30T12:00:21Z",
      "title": "Some renters may get relief from biggest apartment construction boom in decades, but not all",
      "url": "https://apnews.com/b7d3612fcd14170e4fd802a3904317d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1405a6b99df24365a26d60a99927ba02/3000.jpeg"
    },
    {
      "author": "ANWARULLAH KHAN and RIAZ KHAN",
      "description": "KHAR, Pakistan (AP) — A suicide bomber blew himself up at a political rally in a former stronghold of militants in northwest Pakistan bordering Afghanistan on Sunday, killing at least 44 people and wounding nearly 200 in an attack that a senior leader said was meant to weaken Pakistani Islamists.",
      "publishedAt": "2023-07-30T12:47:37Z",
      "title": "Suicide bomber at political rally in northwest Pakistan kills at least 44 people, wounds nearly 200",
      "url": "https://apnews.com/b655861c854ff086f118f18b69861ca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f579cd02ce1c4607a061c3728746fb95/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Ukraine brought the war far from the front line into the heart of Russia again Sunday in drone penetrations that Russian authorities said damaged two office buildings a few miles (kilometers) from the Kremlin and a pig breeding complex on the countries' border.",
      "publishedAt": "2023-07-30T03:49:03Z",
      "title": "Ukraine again reported bringing war deep into Russia with attacks on Moscow and border region",
      "url": "https://apnews.com/4801c01e9f07ac882ab28d33666bf8d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f743e754f59481e86a322a347047446/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Thousands of people backing the coup in Niger marched through the streets of the capital denouncing France, the country's former colonial power, waving Russian flags, and setting a door at the French Embassy ablaze on Sunday before the army broke up the crowd.",
      "publishedAt": "2023-07-30T09:18:32Z",
      "title": "French embassy in Niger is attacked as protesters waving Russian flags march through capital",
      "url": "https://apnews.com/88ccaa2f004db44601e59475199c5fbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e0abb5bafe84c5688ab720c7b7cdc4d/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — Six straight days of 12-hour driving. Single digit paychecks. The complaints come from workers in vastly different industries: UPS delivery drivers and Hollywood actors and writers.",
      "publishedAt": "2023-07-30T04:02:51Z",
      "title": "Customers want instant gratification. Workers say it’s pushing them to the brink",
      "url": "https://apnews.com/c3b94e32c347d5b5f61e695bcf436b46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578422a221734616b8213a2d5877fb40/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — As Denver neared triple-digit temperatures, Ben Gallegos sat shirtless on his porch swatting flies off his legs and spritzing himself with a misting fan to try to get through the heat.",
      "publishedAt": "2023-07-30T14:45:35Z",
      "title": "Record heat waves illuminate plight of poorest Americans who suffer without air conditioning",
      "url": "https://apnews.com/f897e336d6d99ee2a53024f42ad7b8b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f287750f41746b4bd59af12ccb6843c/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — A week later, the “Barbenheimer” boom has not abated.Seven days after Greta Gerwig’s “Barbie” and Christopher Nolan’s “Oppenheimer” conspired to set box office records, the two films held unusually strongly in theaters.",
      "publishedAt": "2023-07-30T16:44:00Z",
      "title": "The ‘Barbie’ bonanza continues at the box office, ‘Oppenheimer’ holds the No. 2 spot",
      "url": "https://apnews.com/3a82b8887c11fe44896117ec4dec1531",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eba9fb841a9c4f03bd46ba52117a0344/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}