{
  "articles": [
    {
      "author": null,
      "description": "A hospital strike in southern Gaza has killed at least eight people, including four journalists. The attack happened on Monday. Among the victims was Mariam Dagga, a freelancer for the Associated Press. She had been covering the Gaza war, focusing on doctors at Nasser Hospital. Al Jazeera confirmed that its journalist Mohammed Salam was also killed in the strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed, and photographer Hatem Khaled was wounded. The incident highlights the dangers journalists face while reporting in conflict zones.",
      "publishedAt": "2025-08-25T09:13:38Z",
      "title": "Multiple journalists killed by Israeli strikes on Gaza hospital",
      "url": "https://apnews.com/article/mideast-wars-gaza-journalists-killed-5c33e999ee88effd89566a993b31d9cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Gaza’s health ministry says an Israeli airstrike has hit the fourth floor of southern Gaza’s main hospital, killing at least eight people. The ministry says the victims on the fourth floor of Nasser Hospital were killed Monday in a double-tap strike with one missile hitting first, then another moments later as rescue crews arrived. Khan Younis’ Nasser Hospital has withstood raids and bombardment throughout 22 months of war, with officials at the largest medical facility in southern Gaza citing critical shortages of supplies and staff. Israel’s military did not immediately respond to questions about the strike.",
      "publishedAt": "2025-08-25T08:00:57Z",
      "title": "Israeli airstrike on Gaza hospital kills 8, health ministry says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-25-2025-300f739d8dfe203766f3b1ec59c54bd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7544ff2/2147483647/strip/true/crop/4679x2632+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F1f%2F427236b30ea9601510ee9472976d%2F158e854ef0f4486e89c04067927cd509"
    },
    {
      "author": null,
      "description": "Kilmar Abrego Garcia has surrendered to immigration authorities in Baltimore and faces possible efforts by the Trump administration to deport him to Uganda. The Maryland construction worker became the face of President Donald Trump’s immigration policies when he was wrongfully deported in March to a notorious prison in his native El Salvador. Abrego Garcia was returned to the U.S. in June, but only to face human smuggling charges that his lawyers call preposterous. A judge in Tennessee determined that Abrego Garcia wasn’t a danger or flight risk. He was released from jail on Friday. The Trump administration has said it will try to deport him before his trial.",
      "publishedAt": "2025-08-25T11:50:19Z",
      "title": "Kilmar Abrego Garcia surrenders to ICE in Baltimore, faces possible deportation to Uganda",
      "url": "https://apnews.com/article/abrego-garcia-deportation-uganda-ice-2bad172b72c4871bc20bfa221b49b8bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d50e202/2147483647/strip/true/crop/3759x2114+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F09%2F2289d355afa645eb7bc7e87d6285%2Ff2e8193498eb45c189b736a9184a4e29"
    },
    {
      "author": null,
      "description": "President Donald Trump says Chicago will likely be the next target of his efforts to address crime, homelessness and illegal immigration. On Friday, Trump mentioned that Chicago could receive similar treatment to Washington, D.C., where 2,000 troops have been deployed. He also indicated plans to assist New York. Trump has often described some of the nation’s largest cities as dangerous. On Friday, he singled out Chicago, calling it a “mess” and claiming residents are “screaming for us to come.” City officials and advocates, meanwhile, slammed Trump's threats and emphasized drops in violent crime in Chicago.",
      "publishedAt": "2025-08-22T19:37:46Z",
      "title": "Trump threatens to target Chicago next in crime and homelessness crackdown",
      "url": "https://apnews.com/article/trump-crime-crackdown-dc-chicago-new-york-d5c658a7350a954ae1ab4bc80c920ac9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b03557e/2147483647/strip/true/crop/3793x2134+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F00%2F086adf040c3fd57eb674dc7abe8a%2F87638f77dea24b28aa13ed8bb26fe320"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump’s special envoy Keith Kellogg says officials are “working very, very hard” on efforts to end the three-year war between Russia and Ukraine. Kellogg said in Kyiv on Monday that officials are “hoping to get to a position where, in the near term, we have, with a lack of a better term, security guarantees” that address Ukraine’s fears of another invasion by Russia in the future. A lack of progress in talks is fueling doubts about whether a peace settlement could be on the horizon.",
      "publishedAt": "2025-08-25T11:38:14Z",
      "title": "Trump envoy says officials working hard on ending Russia-Ukraine war",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-norway-kellogg-08940b28d8c97ae3eb547e3eae74572e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f00191d/2147483647/strip/true/crop/5657x3182+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F0f%2Fdc718b8e0c5cc3e58735d9d127e8%2F75fa9a4d58574a8090d78bddf5a9270b"
    },
    {
      "author": null,
      "description": "A humanitarian group says Libya’s coast guard fired upon its vessel as it searched for a migrant boat in distress in the Mediterranean Sea. The nonprofit SOS Mediterranee released details of the confrontation Monday. It said the Libyan coast guard shot at the vessel in international waters for 20 minutes on Sunday afternoon. No casualties were reported, although the group said the vessel had significant damage. The attack appeared to be one of the most violent involving a European rescue ship and the Libyan coast guard, which receives support from the European Union. A coast guard spokesman didn’t respond to a request for comment.",
      "publishedAt": "2025-08-25T12:27:28Z",
      "title": "Humanitarian group says Libya's coast guard fired on its vessel in the Mediterranean",
      "url": "https://apnews.com/article/libya-migration-mediterranean-a51cd83d8f2c3d1e99c2cc06c26f3a1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Keurig Dr Pepper says it will buy Peet’s Coffee owner JDE Peet’s in an $18 billion (15.7 billion euro) deal. When the acquisition is complete, the company plans to split into two separate companies, one focused on coffee and the other focused on beverages including Dr Pepper, Canada Dry, 7Up and energy drinks. The coffee business will have about $16 billion in combined sales and the beverage business about $11 billion. In addition to Peet’s, Amsterdam-based JDE Peet’s brands include L’OR, Jacobs, Douwe Egberts, Kenco, Pilao, OldTown, Super and Moccona.",
      "publishedAt": "2025-08-25T08:55:07Z",
      "title": "Dr Pepper buys Peet's for $18 billion and will split into separate coffee and cold drink sellers",
      "url": "https://apnews.com/article/keurig-dr-pepper-peets-acquisition-coffee-904c356a8eb57a6b256b7f45a0f59d8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/07c7df2/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fc0%2Fa28b99a1a17b68af990adfa23b17%2Fbce7cf6f5a3547818e2a833511288bf2"
    },
    {
      "author": "Michael R. Sisak",
      "description": "Former Mexican cartel kingpin Ismael “El Mayo” Zambada has pleaded guilty to federal charges related to his role in the violent drug trade that for years flooded the U.S. with cocaine, heroin and other illicit substances. The longtime leader in the Sinaloa cartel entered his plea Monday in a Brooklyn federal court. Prosecutors have said they won’t seek the death penalty against the 77-year-old Zambada. He was arrested in Texas last year. Prosecutors say that under the leadership of Zambada and Joaquín “El Chapo” Guzmán, the Sinaloa cartel evolved from a regional player into the world’s largest drug trafficking organization.",
      "publishedAt": "2025-08-25T04:00:51Z",
      "title": "Mexican drug lord Ismael 'El Mayo' Zambada pleads guilty",
      "url": "https://apnews.com/article/mexican-sinaloa-cartel-leader-el-mayo-zambada-276e976380207177f8eb9e4373a49a6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/67259ce/2147483647/strip/true/crop/1944x1094+0+101/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F61%2F2423ddd0cd7394910405c61d7284%2F888215a5d57744558fcab774af246cff"
    },
    {
      "author": "Andrew Dalton",
      "description": "Lil Nas X has been charged with four felonies, including three counts of battery on a police officer. Authorities say he charged at officers who confronted him for walking naked down a Los Angeles street last week. Prosecutors on Monday also charged him with resisting an executive officer. He is set to be arraigned later Monday. Police found the musician whose legal name is Montero Lamar Hill walking naked on busy Ventura Boulevard early Friday. Suspecting a possible overdose, they took him to a hospital before arresting him. Known for hits like “Old Town Road,” Lil Nas X remains in jail. His representatives haven't responded to requests for comment.",
      "publishedAt": "2025-08-25T17:42:15Z",
      "title": "Lil Nas X charged with attacking police officers as he walked naked on Los Angeles street",
      "url": "https://apnews.com/article/lil-nas-x-lapd-felony-charges-780ef8560cd075102257a5404f882b8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4942e59/2147483647/strip/true/crop/3813x2145+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fbd%2F9ec771842b0639fb6220af6e5e17%2F3beb1bdd284b4ea4a28c90fda7a40640"
    },
    {
      "author": null,
      "description": "There are some tennis players, such as Frances Tiafoe or Madison Keys or Ben Shelton, who can’t wait for the US Open to come around each year, with its boisterous crowds, its bold-faced names in the stands, its music at changeovers, its buzz. To them, the louder the better. Sometimes, though, it all can get out of control, as happened during a match that ended after midnight. There was a delay of more than five minutes while spectators booed and shouted — egged on by 2021 champion Daniil Medvedev, who was angered by chair umpire Greg Allensworth’s ruling after a photographer interrupted play by going on court.",
      "publishedAt": "2025-08-25T15:24:08Z",
      "title": "US Open players adjust to the crowds, commutes and chaos",
      "url": "https://apnews.com/article/us-open-2025-tennis-chaos-medvedev-5c2b51dc8d7275154bdbae5db074dae1",
      "urlToImage": "https://dims.apnews.com/dims4/default/91aefa9/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2F42%2F420248397ff0d322770be9aa11ec%2Fac2abfd83eaf4c9e98b2ceff24c9386e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}