{
  "articles": [
    {
      "author": "Chris Megerian, Aamer Madhani",
      "description": "A president’s address to Congress — even without the formal gloss of a State of the Union address — is typically a time for a call to national unity and predictable claims about the country being strong. But that wasn’t President Donald Trump’s plan. His speech on Tuesday night was relentlessly partisan, boasting about his election victory and criticizing Democrats for failing to recognize his accomplishments. The hard edge reflected Trump’s bulldozer approach to his second term, brushing aside opposition and demanding loyalty throughout the federal government.",
      "publishedAt": "2025-03-05T04:36:02Z",
      "title": "Key takeaways from Trump's speech to Congress",
      "url": "https://apnews.com/article/trump-address-congress-takeaways-partisan-divide-b25327f1c728190102c2a7ade61cb498",
      "urlToImage": "https://dims.apnews.com/dims4/default/82ff69e/2147483647/strip/true/crop/5212x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fd8%2Fc44aa89b08c95b1c4a02ab1e6dea%2F8878b3cd52bd4eeba31bf2154fce10f3"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump's one-hour and 40-minute address to Congress highlighted many of his initiatives, from an immigration crackdown to tariffs and energy policy. But many of his comments Tuesday night included false and misleading information about those efforts. Trump overstated numbers around his immigration crackdown and misrepresented economic figures, repeating several false claims he has made in the past. He also distorted an initiative from his predecessor on electric vehicles and took credit for Army recruitment trends that began before he entered office.",
      "publishedAt": "2025-03-04T12:02:48Z",
      "title": "FACT FOCUS: A look at false and misleading claims made by Trump during his address to Congress",
      "url": "https://apnews.com/article/fact-check-misinformation-trump-ukraine-3bea1df50167ac0a91f8c419b58c4b97",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad45570/2147483647/strip/true/crop/2355x1325+0+123/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Fd8%2F61c61c927e9bec45e52d5b861dbe%2Fe5c3c41e517c417c9142b9ffd3a68b6d"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump vowed to keep up his campaign of “swift and unrelenting action” in reorienting the nation’s economy, immigration and foreign policy in an unyielding address before Congress that left Democratic legislators to register their dissent with stone faces, placards calling out “lies,” and one legislator’s ejection.",
      "publishedAt": "2025-03-05T07:45:00Z",
      "title": "Live updates: Trump promises to reshape America in his address to Congress",
      "url": "https://apnews.com/live/trump-presidency-updates-3-5-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/80645bd/2147483647/strip/true/crop/5625x3164+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F94%2Fb8dee1f21685910723b2c5208171%2F00a642f5461e4393946ccc6ab84b7000"
    },
    {
      "author": "Joey Cappelletti",
      "description": "First-term Sen. Elissa Slotkin of Michigan accused President Donald Trump of driving up costs while pushing a giveaway to his billionaire friends. Slotkin delivered the Democratic response to Trump’s joint congressional address. Slotkin gave the rebuttal Tuesday night after just two months serving in the U.S. Senate. She won the battleground state's open Senate seat over Republican Mike Rogers in November while Trump carried the state in the presidential race. Slotkin told Americans that Trump’s policies would make them pay “in every part of your life.” Her speech comes as the Democratic party struggles to find a unified message against Trump.",
      "publishedAt": "2025-03-04T05:16:25Z",
      "title": "Michigan's Elissa Slotkin assails Trump's policies in Democratic response",
      "url": "https://apnews.com/article/trump-slotkin-democratic-response-fae53aacdc4796b2118ba5269fdd86de",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7bb7c7/2147483647/strip/true/crop/5553x3124+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2Ff9%2F9e390362f5e11fa5c1196d489b43%2Fd558e6b2d16244d5ab59c476a71b993b"
    },
    {
      "author": null,
      "description": "House Speaker Mike Johnson has instructed the House Sergeant of Arms to remove Rep. Al Green, D-Texas, for disturbing Trump’s speech.",
      "publishedAt": "2025-03-05T02:33:19Z",
      "title": "Rep. Al Green removed from House chamber during Trump's speech to Congress",
      "url": "https://apnews.com/video/al-green-gets-ejected-000001956426dd23abfffd3f55cb0000",
      "urlToImage": "https://dims.apnews.com/dims4/default/d26e1ca/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fd3%2F87766cb7418986c9e138c4be27c5%2Fyoutube-thumbnails-2025-03-04t215318-733.png"
    },
    {
      "author": "Ben Finley, Stephen Groves",
      "description": "A handful of veterans speaking to The Associated Press are divided over the Trump administration's proposed cuts to the Department of Veterans Affairs. Stephen Watson is a former Marine who lives in Jesup, Georgia. Watson says everyone, including veterans, needs to share in the sacrifice to bring the nation's spending under control. But former Marine Gregg Bafundo, of Tonasket, Washington, disagrees. Bafundo says President Donald Trump's cuts are only about “hurting people and breaking things.” The Republican administration's plans to cut $2 billion in VA contracts are currently on pause. That's because of concerns that critical health services for veterans would be harmed.",
      "publishedAt": "2025-03-05T12:02:39Z",
      "title": "Veterans are speaking out on Musk's plans to cut the VA's budget",
      "url": "https://apnews.com/article/veterans-doge-va-trump-cuts-marines-opinions-370be785e1117ab0d82a58c95c639420",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec7a960/2147483647/strip/true/crop/5687x3199+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F80%2F5405a5eddac6690075f91f0c876e%2Ffbfbd592a5724e8bb44aacc1639a16da"
    },
    {
      "author": "Rebecca Santana, Tim Sullivan",
      "description": "Mayors from Boston, Chicago, Denver and New York are set to testify in Congress as Republicans take aim at “sanctuary cities” policies. Those policies generally mean that cities have limited cooperation with Immigration and Customs Enforcement. Republicans say those policies impede the Trump administration’s mass deportation agenda by protecting people who are in the country illegally and making it harder for immigration enforcement to do its job. But some cities and states say cooperating with ICE means victims and witnesses who are in the U.S. illegally won’t come forward. And, to varying degrees, officials argue that they want their localities to be welcoming places for immigrants.",
      "publishedAt": "2025-03-05T13:06:30Z",
      "title": "Mayors from sanctuary cities to testify before Congress",
      "url": "https://apnews.com/article/sanctuary-cities-congress-mayors-trump-immigration-80d73ae19a4798f8548010dd472a2b49",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c13362/2147483647/strip/true/crop/7300x4106+31+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F27%2Ffe7fcad34ef6b032a443d8752179%2F41aac1ac93f640729085db47ab97f41b"
    },
    {
      "author": "Lorne Cook, Raf Casert",
      "description": "European Union leaders plan to hold emergency talks to agree ways to quickly increase their military budgets after the Trump administration signaled Europe must take care of its own security and also suspended assistance to Ukraine. In just over a month, President Donald Trump has overturned old certainties about U.S. reliability as a security partner, as he embraces Russia and withdraws American support for Ukraine. On Monday, Trump ordered a pause to U.S. military supplies to Ukraine as he sought to press President Volodymyr Zelenskyy to engage in negotiations to end the war with Russia. That brings fresh urgency to an EU summit in Brussels on Thursday.",
      "publishedAt": "2025-03-05T15:46:44Z",
      "title": "EU leaders to hold emergency Ukraine talks, seeking to adapt to new security demands without the US",
      "url": "https://apnews.com/article/eu-ukraine-security-weapons-industry-funds-russia-e4bd69d9a0961aac41e360536c1241ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/f843116/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Fa1%2Fe2f647693a7c4a8c51de77879fe9%2Fb0ee48b6bdab498786ce25db40300b49"
    },
    {
      "author": "Josh Boak, Rob Gillies",
      "description": "Commerce Secretary Howard Lutnick said there might be carveouts coming to the 25% tariffs placed on Canada and Mexico by President Donald Trump. It's a sudden backing away after Tuesday’s tax hike hurt the stock market, worried consumers and started a trade war. In a Wednesday interview with Bloomberg Television, Lutnick said that Trump would update his tariff plans with an afternoon announcements, possibly sparing sectors such as autos from the import taxes.",
      "publishedAt": "2025-03-05T14:00:52Z",
      "title": "Trump administration signals that the tariffs against Canada and Mexico may soon have exemptions",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-lutnick-2b269614084027a4894aa14f3dc16227",
      "urlToImage": "https://dims.apnews.com/dims4/default/48ad772/2147483647/strip/true/crop/6834x3844+0+356/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F5d%2Fe1ed99eccd7c87f070165de5b097%2Fea9d7970e09447939fcd69884171d1a7"
    },
    {
      "author": "Zeke Miller, Michelle L. Price",
      "description": "President Donald Trump has vowed to keep up his campaign of “swift and unrelenting action” in reorienting the nation’s economy, immigration and foreign policy in his address to Congress. Trump delivered an unyielding address Tuesday night to Congress and the nation. Democratic legislators registered their dissent with stone faces, placards calling out \"lies,” and one legislator’s ejection. Trump’s prime-time speech added up to a defiant sales pitch for the policies he promised during his Republican campaign and leaned into during his first weeks back in office. Trump pledges to keep delivering sweeping changes to the country, rescuing it from what he described as destruction and mistakes left by his predecessor while repeatedly needling Democrats.",
      "publishedAt": "2025-03-04T05:11:24Z",
      "title": "President Trump promises to keep up ‘swift and unrelenting action’ in speech to Congress",
      "url": "https://apnews.com/article/trump-speech-congress-immigration-tariffs-guests-93f6107ede260854f90c65c4bde60de8",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb65b0a/2147483647/strip/true/crop/8396x4723+0+437/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fa5%2Fbbdc9e468d533cc8e172018594dd%2Fe3d32f6bd0c54342af2b5e8ebf93a38c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}