{
  "articles": [
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "FORT LAUDERDALE, Fla. (AP) — Republican senators pushed back on Sunday against criticism from Democrats that Tulsi Gabbard, Donald Trump's pick to lead U.S.",
      "publishedAt": "2024-11-24T18:39:22Z",
      "title": "Republicans push back against Democrats' claims that Trump intelligence pick Gabbard is compromised",
      "url": "https://apnews.com/0f661dd39bd16e248b16c049e6aa26c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73d4931d221343a9ba8904c65ec008be/3000.jpeg"
    },
    {
      "author": null,
      "description": "WINDSOR, Calif. (AP) — Another round of wintry weather could complicate travel leading up to the Thanksgiving holiday, according to forecasts across the U.S., while California and Washington state continue to recover from storm damage and power outages.",
      "publishedAt": "2024-11-24T08:16:07Z",
      "title": "Forecasts warn of possible winter storms across US during Thanksgiving week",
      "url": "https://apnews.com/4f28a830a98f04d012c9d03aa77073ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95f691472aa64203be5b9a842bca9f1e/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Hezbollah fired about 250 rockets and other projectiles into Israel on Sunday, wounding seven people in one of the militant group's heaviest barrages in months, in response to deadly Israeli strikes in Beirut while negotiators pressed on with cease-fire efforts to halt the all-out war.",
      "publishedAt": "2024-11-24T11:32:43Z",
      "title": "Hezbollah fires about 250 rockets and other projectiles into Israel in heaviest barrage in weeks",
      "url": "https://apnews.com/c91698370339e689edb6423abb3ed392",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b16d40e730b54abcb1450257e9993976/1920.jpeg"
    },
    {
      "author": null,
      "description": "MONTEVIDEO, Uruguay (AP) — Left-wing politician Yamandú Orsi is poised to become the next president of Uruguay after his main challenger in the runoff conceded defeat Sunday and even the outgoing leader of the South American country congratulated him.",
      "publishedAt": "2024-11-25T03:07:51Z",
      "title": "Who is Yamandú Orsi, the next president of Uruguay?",
      "url": "https://apnews.com/d3481a8bb23c49dc777cbdeb0db6aa5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f176a151db164c548c8ca3e5083bdcb1/1920.jpeg"
    },
    {
      "author": "STEPHEN McGRATH",
      "description": "BUCHAREST, Romania (AP) — A little-known, far-right populist took the lead in Romania’s presidential election Sunday, electoral data showed, and will likely face leftist Prime Minister Marcel Ciolacu in a runoff in two weeks, an outcome that rocked the country's political landscape.",
      "publishedAt": "2024-11-24T05:02:40Z",
      "title": "Far-right populist surprises in Romanian presidential election appearing set to enter runoff",
      "url": "https://apnews.com/a6e3bd3f26272c4a9ab9337789f09da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/407bf20c96ed49009c3cb307ff4ba3e5/1920.jpeg"
    },
    {
      "author": "KENYA HUNTER",
      "description": "ATLANTA (AP) — As she checked into a recent flight to Mexico for vacation, Teja Smith chuckled at the idea of joining another Women’s March on Washington.",
      "publishedAt": "2024-11-24T12:57:36Z",
      "title": "After Trump's win, Black women are rethinking their role as America's reliable political organizers",
      "url": "https://apnews.com/0c646e888c999b03d1798e1aa1331937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e026c36fe0d4d499bba68c3a777798c/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Donald Trump has big plans for the economy — and a big debt problem that will be a hurdle to delivering on them.",
      "publishedAt": "2024-11-24T12:41:18Z",
      "title": "The rising price of paying the national debt is a risk for Trump's promises on growth and inflation",
      "url": "https://apnews.com/895ec1551122a0e1babf24b657f650bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4192e087704795a738260c492ad1f8/3000.jpeg"
    },
    {
      "author": null,
      "description": "LA PAZ, Bolivia (AP) — A landslide caused by heavy rains after a prolonged drought in La Paz, the capital of Bolivia, flooded dozens of homes early Sunday, local authorities said.",
      "publishedAt": "2024-11-24T21:38:33Z",
      "title": "Heavy rains in Bolivia send mud crashing into the capital, leaving 1 missing and destroying homes",
      "url": "https://apnews.com/5ae0961573f4585173624bdacf076799",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/806f6787f6e84775a848dc24adf96598/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — More than 30 pilot whales that stranded themselves on a beach in New Zealand were safely returned to the ocean after conservation workers and residents helped to refloat them by lifting them on sheets.",
      "publishedAt": "2024-11-25T04:24:47Z",
      "title": "New Zealanders help to save about 30 whales after a pod strands on a beach",
      "url": "https://apnews.com/59c0647c10210185a124aea44e978ede",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49996633289e4af3b30e98794f7fcdba/3000.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "Alabama and Mississippi tumbled out of the top 10 of The Associated Press Top 25 poll Sunday and Miami and SMU moved in following a chaotic weekend in the SEC and across college football in general.",
      "publishedAt": "2024-11-24T19:01:20Z",
      "title": "AP Top 25: Alabama, Mississippi out of top 10 and Miami, SMU are in; Oregon remains unanimous No. 1",
      "url": "https://apnews.com/265b814654284e61cc3738fbc591f19c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36879b6003124b11a36fd2a3fd61ebf2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}