{
  "articles": [
    {
      "author": null,
      "description": "Two staff members of the Israeli embassy were shot and killed Wednesday evening while leaving an event at a Jewish museum in the nation’s capital, and the suspect and yelled “free, free Palestine” after he was arrested, police said. The two victims, a man and a woman, were leaving an event at the Capital Jewish Museum when the 30-year-old suspect approached a group of four people and opened fire, Metropolitan Police Chief Pamela Smith said. The suspect was observed pacing outside the museum before the shooting, walked into the museum after the shooting and was detained by event security, Smith said.",
      "publishedAt": "2025-05-22T03:39:04Z",
      "title": "Two staff members of Israeli embassy killed in shooting in Washington DC",
      "url": "https://apnews.com/article/israel-embassy-jewish-museum-shooting-10307b3b1a2a337e76730736b12ebbcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/702896e/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F1c%2F397aa52d82bd737fb422396e806c%2Fb880a32f53804a4d865aeb0120f97f9b"
    },
    {
      "author": null,
      "description": "Two staff members of the Israeli Embassy in Washington were fatally shot while leaving an event at a Jewish museum, and the suspect yelled, “Free, free Palestine” after he was arrested. That's according to Washington police and federal authorities. The attack occurred Wednesday evening. The violence was seen by officials in Israel and the U.S. as the latest in a growing wave of antisemitism as Israel ramps up its offensive in the Gaza Strip, and as food security experts have warned that Gaza risks falling into famine unless Israel’s blockade ends. The suspect has been identified as Elias Rodriguez, a 30-year-old from Chicago.",
      "publishedAt": "2025-05-22T06:50:14Z",
      "title": "Here's what we know about the DC shooting where 2 staff members of the Israeli Embassy were killed",
      "url": "https://apnews.com/article/israel-embassy-jewish-museum-shooting-9e77d16a88d634b0dde5b2455c96dddf",
      "urlToImage": "https://dims.apnews.com/dims4/default/61f29d3/2147483647/strip/true/crop/2656x1494+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F26%2F1c4c5aeea5ec94d4e685b5a1061c%2F887cabb71fa74fb5823af55ca227cb5f"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam",
      "description": "House Republicans stayed up all night to pass their multitrillion-dollar tax breaks package. Speaker Mike Johnson defied the skeptics within his ranks and muscled President Donald Trump’s priority bill to approval Thursday. Last-minute concessions and a stern warning from Trump appeared to win over the hold outs to salvage what he calls the “big, beautiful bill.” The outcome caps an intense time on Capitol Hill, with days of private negotiations and public committee hearings. Democrats, without the votes to stop Trump’s package, tried to stall it. The Congressional Budget Office says the tax provisions would add $3.8 trillion to federal deficits.",
      "publishedAt": "2025-05-22T04:02:29Z",
      "title": "House Republicans pass Trump's big bill after all-night session",
      "url": "https://apnews.com/article/congress-tax-cuts-trump-f2c60ae5c7c1313de69446f9ac7176e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/97cb024/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F9f%2F2ccb7214ec15b1e4fd8f46da7c53%2Ff646881b6d944609a00c09accb0a7ef3"
    },
    {
      "author": "Lindsay Whitehurst, Michael Casey, Tim Sullivan, Rebecca Santana",
      "description": "A federal judge says the White House violated a court order on deportations to third countries with a flight linked to the chaotic nation of South Sudan. The Trump administration says it expelled eight immigrants convicted of violent crimes in the United States but refused to reveal where they would end up. Judge Brian E. Murphy in Boston said the eight migrants aboard the plane were not given a meaningful opportunity to object that the deportation could put them in danger. He ordered a new set of interviews with the migrants, either back in the U.S. or abroad. Before Wednesday's hearing, administration officials accused “activist judges” of advocating the release of dangerous criminals.",
      "publishedAt": "2025-05-21T13:09:44Z",
      "title": "Judge says US violated order on deportations to third countries",
      "url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-a09612dbd055c5d1d88902c415bdf3e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb1b0b6/2147483647/strip/true/crop/5608x3155+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F7d%2F8af24457b16d9785e7e208d842ad%2F5ef8b4863aad48bdada6dd5f80a8242c"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s top diplomat has warned that his country would take “special measures in defense of our nuclear facilities” if Israel continues to threaten Tehran's atomic sites, raising the stakes further ahead of a new round of talks with the United States. The comments Thursday by Foreign Minister Abbas Araghchi offered no specifics on what Tehran would do, but already, international inspectors have seen their access limited to Iran’s program. That’s even as Tehran enriches uranium to 60% purity, a short, technical step away from weapons-grade levels of 90%. The U.S. and Iran are due to meet Friday in Rome.",
      "publishedAt": "2025-05-22T11:44:57Z",
      "title": "Iran's top diplomat warns Israel over threatening nuclear sites",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-israel-hamas-war-tensions-e3a56cb2f47bb065f8b3861297a6ff3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a7f7e47/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Fa4%2Ff1707f8a7e3d223b76cfacd73381%2Fedcf1e7846e147f79a993e8cc0dfb103"
    },
    {
      "author": "Joshua Goodman, Gisela Salomon",
      "description": "A spate of arrests at immigration courts across the United States this week has rattled people showing up for hearings and may signal a coordinated attempt at deportations under fast-track authority that President Donald Trump sharply expanded soon after taking office. Among those arrested was a 28-year-old Colombian man who The Associated Press witnessed getting arrested by five plainclothes federal agents in the hallways of Miami immigration court minutes after his case was dismissed.",
      "publishedAt": "2025-05-22T04:07:59Z",
      "title": "Spate of ICE arrests at immigration courts nationwide",
      "url": "https://apnews.com/article/immigration-courts-arrests-trump-ice-deportations-fa96435d4ec021cc8ff636b23d80d848",
      "urlToImage": "https://dims.apnews.com/dims4/default/3bcb11e/2147483647/strip/true/crop/4062x2285+0+212/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F8c%2F91fb2ea637486ad8d5f1180d7336%2F62f627c287bd43c890b2c6be05fce316"
    },
    {
      "author": "Kim Tong-hyung, Hyung-Jin Kim",
      "description": "North Korea says a new 5,000-ton destroyer key to its naval advancement was damaged during its launching ceremony attended by leader Kim Jong Un. State media reported the ship slid off the ramp and became stuck after the flatcar failed to move alongside it, throwing off its balance and crushing parts of the ship’s bottom. The accident at Wednesday’s ceremony at the northeastern port of Chongjin was an embarrassing setback for Kim, who has emphasized naval advancement as key to his nuclear-armed military. The report said Kim blamed military officials, scientists and shipyard operators for the accident. The damaged vessel was likely in the same class as the country’s first destroyer unveiled in April.",
      "publishedAt": "2025-05-22T01:45:43Z",
      "title": "North Korea's second naval destroyer is damaged in a failed launch at a ceremony attended by Kim",
      "url": "https://apnews.com/article/north-korea-kim-jong-un-destroyer-damaged-nuclear-9f66685ad8f34d5bef027750a0678370",
      "urlToImage": "https://dims.apnews.com/dims4/default/df5ec5e/2147483647/strip/true/crop/4170x2346+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fdb%2F19825cfacc2085739e9a30614928%2Fc95178bca0a8474db916da92ea6380e4"
    },
    {
      "author": "Maria Sherman",
      "description": "Rapper Kid Cudi is the latest celebrity being called to testify in Sean “Diddy” Combs′ sex trafficking trial. The popular melodic rapper is expected to tell the jury about his brief relationship 14 years ago with Combs’ ex-girlfriend, the R&B singer Cassie. She testified that the relationship sent Combs into a rage, and he beat her when he learned of it. Prosecutors contend that Combs arranged to have Cudi’s convertible firebombed. The Cleveland born-and-raised, Grammy-award-winning rapper has long been celebrated for his alternative hip-hop. His game-changing single “Day ‘n’ Nite (Nightmare)\" is easily one of the most influential rap records of the last two decades.",
      "publishedAt": "2025-05-22T04:01:11Z",
      "title": "Who is Kid Cudi, the rapper testifying at Sean ‘Diddy’ Combs' trial?",
      "url": "https://apnews.com/article/kid-cudi-sean-diddy-combs-trial-explainer-5460cdd7dd8d1737e7a13cb6cdb447b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9189e8/2147483647/strip/true/crop/5568x3132+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F9c%2F9e548ffb20a9d335a87fbdcc2b50%2Fcea8fa815f83468a989d01ae5244b58e"
    },
    {
      "author": "Kristin Hall",
      "description": "Whether its No Mow May or Let It Bloom June or Leave The Leaves, homeowners are finding more ways to adopt a low mow lifestyle instead of keeping up with short, manicured lawns. Supporters say the taller grass and flowers provide a habitat for pollinators and insects during crucial spring months, while also improving water retention in the soil. The No Mow May trend also has its detractors who say its a temporary help if done only once a year and invasive weeds are likely to take over if not pruned back. In Nashville, homeowner Brandon Griffith said he was just tired of mowing when he stopped and waited to see what came up in his yard. Now his wild yard is full of insects, lizards, birds and butterflies, along with flowers and grasses.",
      "publishedAt": "2025-05-22T04:05:00Z",
      "title": "Manicured lawns are out, wild lawns are in. A low mow lifestyle can help bees and conserve water",
      "url": "https://apnews.com/article/no-mow-may-lawns-pollinators-3025eb0c6c2a127da649a02bbcf06d22",
      "urlToImage": "https://dims.apnews.com/dims4/default/883362b/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2Fba%2Fe8bf01d01010e796bb9b3697fc9a%2F3d52818299a1484eb377c0dff640b71e"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States will hold talks Friday in Rome, their fifth round of negotiations over Tehran’s rapidly advancing nuclear program. The talks follow previously negotiations in both Rome and in Muscat, Oman. President Donald Trump has imposed new sanctions on Iran as part of his “maximum pressure” campaign targeting the country. He has repeatedly suggested military action against Iran remained a possibility, while emphasizing he still believed a new deal could be reached by writing a letter to Iran’s 86-year-old Supreme Leader Ayatollah Ali Khamenei to jump start these talks. Khamenei has warned Iran would respond to any attack with an attack of its own.",
      "publishedAt": "2025-05-22T07:50:32Z",
      "title": "What to know about the Iran-US nuclear negotiations",
      "url": "https://apnews.com/article/iran-nuclear-program-us-negotiations-explained-085748abe53152378e017e25b956359f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f44456/2147483647/strip/true/crop/2003x1127+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F69%2F4e406b57d244762cf70b57bc8069%2F74fba308637d42debd5ae604d7e06e7e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}