{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes on multiple homes in the northern Gaza Strip overnight and into Sunday left at least 87 people dead or missing, the territory's Health Ministry said.",
      "publishedAt": "2024-10-20T09:48:04Z",
      "title": "Israeli strikes on northern Gaza leave at least 87 dead or missing, Palestinian officials say",
      "url": "https://apnews.com/42ea48ce0f6a31d53a25dc50f16796bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c90ac378f9264cb2adf5ee1adc77b68c/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, MIKE BALSAMO, ERIC TUCKER and TARA COPP",
      "description": "WASHINGTON (AP) — The United States is investigating an unauthorized release of classified documents that assess Israel's plans to attack Iran, three U.S.",
      "publishedAt": "2024-10-20T00:11:32Z",
      "title": "The US is investigating an unauthorized release of classified documents on Israel's attack plans",
      "url": "https://apnews.com/e7e23d09a2f1fc14498e64b38d74576f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0a06d036df4bd69b3bd2004af1acf4/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB and FATMA KHALED",
      "description": "The world’s final glimpse of Hamas’ leader was rough and raw, showing him wounded and cornered as he sat in a bombed-out Palestinian home and faced down the Israeli drone filming him, hurling a stick at it.",
      "publishedAt": "2024-10-19T12:53:57Z",
      "title": "In Israeli footage of the last minutes of Hamas leader's life, some see a symbol of defiance",
      "url": "https://apnews.com/3ef0667312dfe514f8f7f3125a4ac872",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e3c3492adbc4b0fafaff7aaa9a3cbbf/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and CHARLOTTE KRAMON",
      "description": "ATLANTA (AP) — Vice President Kamala Harris said Saturday that Republican former President Donald Trump was “cruel” for how he talked about the grieving family of a Georgia mother who died after waiting 20 hours for a hospital to treat her complications from an abortion pill, as she put combating restrictions on reproductive care at the center of her pitch to voters.",
      "publishedAt": "2024-10-19T13:49:19Z",
      "title": "Harris says Trump is 'cruel' as she spotlights abortion restrictions in Georgia during early voting",
      "url": "https://apnews.com/bce7d9172df6a83cf40a35e00ddb1604",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a3ab49c4e8b44ed8ff4920dab8d9e10/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and WILL WEISSERT",
      "description": "LATROBE, Pa. (AP) — Donald Trump's campaign suggested he would begin previewing his closing argument Saturday night with Election Day barely two weeks away.",
      "publishedAt": "2024-10-20T00:24:33Z",
      "title": "Trump kicks off a Pennsylvania rally by talking about Arnold Palmer's genitalia",
      "url": "https://apnews.com/2bea9620c523e531a55259200215284e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cf523051bd44e48aab23375b48569a7/2915.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "SAVANNAH, Ga. (AP) — Authorities said at least seven people were killed Saturday when part of a ferry dock collapsed on Georgia's Sapelo Island, where crowds had gathered for a fall celebration by the island's tiny Gullah-Geechee community of Black slave descendants.",
      "publishedAt": "2024-10-19T23:15:25Z",
      "title": "At least 7 dead after ferry dock gangway collapses on Georgia's Sapelo Island",
      "url": "https://apnews.com/66ea381cb0f9fd697fc51fc7aa853038",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d8e1b2a3850499f9e11994ad3155683/3000.jpeg"
    },
    {
      "author": "TOM WITHERS",
      "description": "CLEVELAND (AP) — Juan Soto was supposed to the difference maker, the one who pushed the New York Yankees back to the top.They're one step away.Soto hit a three-run homer with two outs in the 10th inning and the Yankees advanced to their 41st World Series — and first in 15 years — by beating the Cleveland Guardians 5-2 in Game 5 of the AL Championship Series on Saturday night.",
      "publishedAt": "2024-10-20T03:56:16Z",
      "title": "Juan Soto's 3-run homer in 10th sends Yankees past Guardians 5-2 and into World Series for 41st time",
      "url": "https://apnews.com/14996d2b9c28869202e8651f52f3e330",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7d73773aab2482f8bbf33702e82b119/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "CLEVELAND (AP) — Hollywood stars Julia Roberts and Zendaya bookended Saturday’s inductions into the Rock &amp; Roll Hall of Fame, giving a little stardust to an eclectic lineup that included pop icon Cher, heavy metal’s Ozzy Osbourne, hip-hop soul queen Mary J.",
      "publishedAt": "2024-10-19T04:07:49Z",
      "title": "Rock & Roll Hall of Fame turns up starpower to induct Cher, Foreigner, Mary J. Blige, Ozzy and more",
      "url": "https://apnews.com/631f31bd3ef6d72bd58c532ed380c031",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f459cbc2dd534f71a4badb2beb5fc5cf/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Manhattan’s famed luxury store row Fifth Avenue is in line for a major makeover.New York City officials unveiled a plan this week to transform a central portion of the thoroughfare between Bryant Park and Central Park into a more pedestrian-centered boulevard.",
      "publishedAt": "2024-10-19T19:20:52Z",
      "title": "NYC officials envision turning Fifth Avenue into a grand boulevard",
      "url": "https://apnews.com/c1154ff4268cb7237c34efea652ddef2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaf5107853564378a3b7da65d856b58f/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Over the past four years, judges at Washington’s federal courthouse have punished hundreds of rioters who stormed the U.S. Capitol in an unprecedented assault on the nation's democracy.",
      "publishedAt": "2024-10-19T04:05:36Z",
      "title": "Judges punishing Jan. 6 rioters say they fear more political violence as Election Day nears",
      "url": "https://apnews.com/ebb54ab9badccfcb2b1bc2fa0de5bf21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5f09b51fb24ed8a0e8f109aeed557d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}