{
  "articles": [
    {
      "author": "CHRIS MEGERIAN and WILL WEISSERT",
      "description": "REDFORD TOWNSHIP, Mich. (AP) — It was the perfect place to welcome the endorsement of the national firefighters union — a gleaming new firehouse in a blue-collar town just outside of Detroit in the key battleground state of Michigan.",
      "publishedAt": "2024-10-04T04:05:18Z",
      "title": "In Michigan, Harris doesn't get planned firefighters endorsement amid shifting labor loyalties",
      "url": "https://apnews.com/98eee32bc975ed5bc284d3e0785e5d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42b774f63ddb4a9f99f075a914814ef1/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — After 1,080 days as president, Joe Biden on Friday decided to pop in and take questions in the White House briefing room for the first time, striding in with a grin after a strong monthly jobs report and the temporary settlement of a strike by ports workers.",
      "publishedAt": "2024-10-04T20:46:32Z",
      "title": "Biden talks election, economy and Middle East in surprise news briefing",
      "url": "https://apnews.com/0093866898d9f9067ff0676672cba9d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90a83f6fa4df43d187790b748c40b037/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "EVANS, Ga. (AP) — After making up privately, Donald Trump and Georgia Gov. Brian Kemp used the aftermath of Hurricane Helene to put their détente on public display, with the former president praising a fellow Republican he blistered just months ago and promising to treat the state well if he returns to the White House.",
      "publishedAt": "2024-10-04T19:30:45Z",
      "title": "Trump and Georgia Gov. Kemp use hurricane recovery to make first 2024 appearance together",
      "url": "https://apnews.com/75ed7f49ffd1a9b07ba82e18abecaa47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21f2fd2aeca84857bdc02cd50ae979ed/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Israel carried out another series of punishing airstrikes Friday, hitting suburban Beirut and cutting off the main border crossing between Lebanon and Syria for tens of thousands of people fleeing the Israeli bombardment of the Hezbollah militant group.",
      "publishedAt": "2024-10-04T06:51:52Z",
      "title": "Israeli airstrikes rock southern suburbs of Beirut and cut off a key crossing into Syria",
      "url": "https://apnews.com/5f2e512d5334b6f7fd7f5a46400e6979",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21bd3a15510e41e590c39019cb5399b3/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ASHEVILLE, N.C. (AP) — The weary and worn residents of Julianne Johnson's neighborhood in Asheville have been getting by without electricity since Hurricane Helene tore through the Southeast last week and upended their lives.",
      "publishedAt": "2024-10-04T04:11:07Z",
      "title": "When will the power return? Weary Carolinas residents long for relief after Helene's fury",
      "url": "https://apnews.com/1a2255b9d1dd5cd9554a76b45c7a695c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/573899bb8c1a44f7bcc01b215bda21bc/1920.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS, JEFF AMY and BRITTANY PETERSON",
      "description": "ASHEVILLE, N.C. (AP) — Nearly a week after Hurricane Helene brought devastation to western North Carolina, a shiny stainless steel tanker truck in downtown Asheville attracted residents carrying 5-gallon containers, milk jugs and buckets to fill with what has become a desperately scare resource — drinking water.",
      "publishedAt": "2024-10-04T17:59:26Z",
      "title": "A week after Helene hit, thousands still without water struggle to find enough",
      "url": "https://apnews.com/737bd51b1351315dc28522e36c425f18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/573899bb8c1a44f7bcc01b215bda21bc/1920.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "PARIS (AP) — A French judge in the trial of dozens of men accused of raping an unconscious woman whose now former husband had repeatedly drugged her so that he and others could assault her decided on Friday to allow the public to see some of the video recordings of the alleged rapes.",
      "publishedAt": "2024-10-04T19:31:56Z",
      "title": "A French judge in a shocking rape case allows the public to see some of the video evidence",
      "url": "https://apnews.com/79c8973223e572e0f83bc06aba03ed05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d971290ebbc4fce99507c27a5c80741/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — America’s employers added a surprisingly strong 254,000 jobs in September, easing concerns about a weakening labor market and suggesting that the pace of hiring is still solid enough to support a growing economy.",
      "publishedAt": "2024-10-04T04:01:26Z",
      "title": "US adds a robust 254,000 jobs and unemployment dips to 4.1% in sign of still-sturdy labor market",
      "url": "https://apnews.com/87447d5187b37bb0f5cf996e25bad808",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ecc692773d44c0abcac95a32be88c24/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Supreme Court left in place Friday two Biden administration environmental regulations aimed at reducing industry emissions of planet-warming methane and toxic mercury.",
      "publishedAt": "2024-10-04T15:37:28Z",
      "title": "Supreme Court leaves in place two Biden environmental regulations",
      "url": "https://apnews.com/af42c5f91ce0c56f2f54b5ea01d3a247",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd2adeab0cbe4ca39abd76a240b59d45/3000.jpeg"
    },
    {
      "author": "MARK LEWIS",
      "description": "STAVANGER, Norway (AP) — Wars, a refugee crisis, famine and artificial intelligence could all be recognized when Nobel Prize announcements begin next week under a shroud of violence.The prize week coincides with the Oct.",
      "publishedAt": "2024-10-04T07:40:50Z",
      "title": "The Nobel Prizes will be announced against a backdrop of wars, famine and artificial intelligence",
      "url": "https://apnews.com/c72eac3761a1169356b5c8d32dbe177e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f339b43ee1e04d47b963ec815173bf6d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}