{
  "articles": [
    {
      "author": "NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel's ground offensive expanded to every part of the Gaza Strip, its military said Sunday, as it ordered more evacuations and vowed to hit south Gaza with “no less strength” than the fight that has reduced large parts of north Gaza to a moonscape.",
      "publishedAt": "2023-12-03T08:21:49Z",
      "title": "Israel expands Gaza ground offensive, vows to hit the south with 'no less strength' than the north",
      "url": "https://apnews.com/1b93089ec82d10ce89df802d51acc108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d00240bf24714421b1295062b1f6fea9/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Ballistics missiles fired by Yemen's Houthi rebels struck three commercial ships Sunday in the Red Sea, while a U.S. warship shot down three drones in self-defense during the hourslong assault, the U.S.",
      "publishedAt": "2023-12-03T15:59:06Z",
      "title": "3 commercial ships hit by missiles in Houthi attack in Red Sea, US warship downs 3 drones",
      "url": "https://apnews.com/716770f0a780160e9abed98d3c48fbde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0db69f6ccba4d1d8a6daa8f05c8c3ed/1500.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and ERIC TUCKER",
      "description": "MIAMI (AP) — A former American diplomat who served as U.S. ambassador to Bolivia has been arrested in a long-running FBI counterintelligence investigation, accused of secretly serving as an agent of Cuba’s government, The Associated Press has learned.",
      "publishedAt": "2023-12-03T23:52:13Z",
      "title": "Former US ambassador arrested in Florida, accused of serving as an agent of Cuba, AP source says",
      "url": "https://apnews.com/af9d80a4f268099364dff249dd74b3ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d94784a570f7404f9b6d74a37fb0aabe/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JORGE RUEDA",
      "description": "CARACAS, Venezuela (AP) — Venezuelans on Sunday approved a referendum called by the government of President Nicolás Maduro to claim sovereignty over an oil- and mineral-rich piece of neighboring Guyana, the country’s electoral authority announced.",
      "publishedAt": "2023-12-03T05:01:26Z",
      "title": "Venezuelans approve a referendum to claim sovereignty over a swathe of neighboring Guyana",
      "url": "https://apnews.com/90a4f0f962a83620903987a68a7d39b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2840cbd7d807485f8c21dbb48bf6c59d/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — George Santos is gone from the House, but his name is certain to pop up in key congressional races across New York next year. Democrats are targeting five seats held by first-term Republicans and looking to associate them with their former colleague in the state's congressional delegation as often as they can.",
      "publishedAt": "2023-12-03T13:07:21Z",
      "title": "Republicans had New Yorkers lead the way in expelling Santos. Will it help them keep the majority?",
      "url": "https://apnews.com/8de3f2fcef3496fd98d02237272d9a6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8505861b48574254855d03feb3f5fe91/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "The final season of the four-team College Football Playoff turned out to be the most controversial with an unprecedented snub.Michigan, Washington, Texas and Alabama were selected Sunday and Florida State became the first unbeaten Power Five conference champion to be excluded from the field.",
      "publishedAt": "2023-12-03T13:00:33Z",
      "title": "Michigan vs. Alabama, Washington vs. Texas in College Football Playoff; unbeaten Florida St left out",
      "url": "https://apnews.com/8b9db687b7cf159779930298d2f1a388",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e85c54055d3d41c4915dfb6fae4301a4/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEATTLE (AP) — Alaska Airlines agreed to buy Hawaiian Airlines in a $1.9 billion deal announced Sunday, potentially putting it on track for a clash with a Biden administration wary of higher airfares.",
      "publishedAt": "2023-12-03T20:22:31Z",
      "title": "Alaska Air to buy Hawaiian Airlines in a $1.9 billion deal that may attract regulator scrutiny",
      "url": "https://apnews.com/a4305e792b1dfb3bb07d8c975138d7f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1bacf768ca14f52b60ffbc7a5c3cffe/1308.jpeg"
    },
    {
      "author": "ELAINE GANLEY and SYLVIE CORBET",
      "description": "PARIS (AP) — France's anti-terrorism prosecutor said Sunday he has opened an investigation into the fatal stabbing of a 23-year-old German-Filipino tourist near the Eiffel Tower in Paris, allegedly by a man who had been under surveillance for suspected Islamic radicalization.",
      "publishedAt": "2023-12-03T13:43:35Z",
      "title": "France's anti-terrorism prosecutor opened an investigation into the killing of a tourist in Paris",
      "url": "https://apnews.com/c8aaace7f5abc11190fad38d687c2b69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e6bc11eabff43ce99e54aa715648da4/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and JOSH BOAK",
      "description": "DUBAI, United Arab Emirates (AP) — Filling in for President Joe Biden, Vice President Kamala Harris flew to the Middle East to tackle a pair of challenges that have flummoxed White Houses for decades: climate change and the Israeli-Palestinian conflict.",
      "publishedAt": "2023-12-03T18:27:34Z",
      "title": "Harris dashed to Dubai to tackle climate change and war. Each carries high political risks at home",
      "url": "https://apnews.com/7e0ab8e40007f269f3e28eb1d2843e21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfe98864c25d4222bfb67312a7e5e9ce/1920.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — The newest group of Kennedy Center honorees, including comedian Billy Crystal and actor Queen Latifah, were feted Sunday night at a star-studded event commemorating their lifetime achievement in arts and entertainment.",
      "publishedAt": "2023-12-03T12:36:10Z",
      "title": "Kennedy Center Honors fetes new inductees, including Queen Latifah, Billy Crystal and Dionne Warwick",
      "url": "https://apnews.com/97ecec2a716c9953af2a45275964fc15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad8ff776fadc4204856a25371f459bfb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}