{
  "articles": [
    {
      "author": "JOSEPH WILSON, MELANIE LIDMAN and JOSEPH KRAUSS",
      "description": "TEL AVIV, Israel (AP) — Norway, Ireland and Spain said Wednesday they would recognize a Palestinian state, a historic but largely symbolic move that further deepens Israel’s isolation more than seven months into its grinding war against Hamas in Gaza.",
      "publishedAt": "2024-05-22T06:42:14Z",
      "title": "Norway, Ireland and Spain say they will recognize a Palestinian state, deepening Israel's isolation",
      "url": "https://apnews.com/ddfd774a23d39f77f5977b9c89c43dbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ae52532e0d64a6f8a40abd6e91887ee/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Chaim Otmazgin had tended to dozens of shot, burned or mutilated bodies before he reached the home that would put him at the center of a global clash.Working in a kibbutz that was ravaged by Hamas’ Oct.",
      "publishedAt": "2024-05-22T04:02:32Z",
      "title": "How 2 debunked accounts of sexual violence on Oct. 7 fueled a global dispute over Israel-Hamas war",
      "url": "https://apnews.com/ca7905bf9520b1e646f86d72cdf03244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/220ab346edef4b9686324ec0fa93fb6c/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "Nikki Haley said Wednesday that she will be voting for Donald Trump in the general election, a notable show of support given their intense and often personal rivalry during the Republican primary calendar.",
      "publishedAt": "2024-05-22T20:56:02Z",
      "title": "Nikki Haley says she will vote for Donald Trump following their disputes during Republican primary",
      "url": "https://apnews.com/72cd80b03d0cd6f69601a0c6166194a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91e16815dfb04e7ebcb1f71e2d59e71c/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER and ERIC TUCKER",
      "description": "FORT PIERCE, Fla. (AP) — A lawyer for Donald Trump's personal valet took aim at the conduct of prosecutors in the classified documents case in a heated hearing Wednesday, the first since a judge indefinitely postponed the trial.",
      "publishedAt": "2024-05-22T04:22:41Z",
      "title": "Heated hearing in classified documents case as lawyer for Trump co-defendant challenges prosecutors",
      "url": "https://apnews.com/632d6e0f6c8000138bc7c9d47529e20c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb0eb5762e6c4a429491da300a487553/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — The Senate on Wednesday confirmed the 200th federal judge of President Joe Biden's tenure, about a month earlier than when Donald Trump hit that mark in his term, though Trump still holds the edge when it comes to the most impactful confirmations — those to the Supreme Court and the country's 13 appellate courts.",
      "publishedAt": "2024-05-22T15:46:56Z",
      "title": "Senate confirms 200th federal judge under Biden as Democrats surpass Trump's pace",
      "url": "https://apnews.com/63b764d071d9c084b6669eabab527240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6568d98a938d48f68f593d75f8a6a842/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and JOHN LEICESTER",
      "description": "President Emmanuel Macron arrived Thursday in riot-hit New Caledonia, having crossed the globe by plane in a high-profile show of support for the French Pacific archipelago wracked by deadly unrest and where Indigenous people have long sought independence from France.",
      "publishedAt": "2024-05-22T12:27:44Z",
      "title": "In riot-hit New Caledonia, French President Macron says priority is return to calm amid unrest",
      "url": "https://apnews.com/4ab593152d9c91c9bdcd2f91d8911f97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fc00c72df9343168103ca7d1bf655fd/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "At 17, Israel McKenzie was so burdened by obesity that he stopped going to high school in person and was embarrassed to speak to people at his restaurant job.“I was in a really dark place,” says McKenzie, whose weight had climbed to 335 pounds on his 6-foot-1 frame, despite repeated efforts to diet and exercise.",
      "publishedAt": "2024-05-22T15:03:31Z",
      "title": "Use of Wegovy and other weight-loss drugs soars among kids and young adults",
      "url": "https://apnews.com/24047516e0c3b4f678c3e91f4ed6face",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa4d8412223c4ad99521870f56e49286/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — Crews moved methodically Wednesday through a small Iowa town devastated by a powerful tornado, searching through mounds of debris to be sure no victims remained buried in the rubble, but authorities would not say how many were killed or injured in the storm.",
      "publishedAt": "2024-05-22T04:39:47Z",
      "title": "Authorities searching for survivors after tornado slams Iowa; at least 1 dead",
      "url": "https://apnews.com/26c73e14ab481ef77a1b0606a2b10adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9560c318aa25425e8aa9155d863f5a1a/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and BILL BARROW",
      "description": "WASHINGTON (AP) — In his bid to become North Carolina’s first Black governor, Republican Mark Robinson assails government safety net spending as a “plantation of welfare and victimhood\" that has mired generations of Black people in “dependency” and poverty.",
      "publishedAt": "2024-05-22T11:03:27Z",
      "title": "GOP candidate for NC governor blasts public spending as his family nonprofit rakes in taxpayer funds",
      "url": "https://apnews.com/388251303ac98c6edbf52e5b3c43d554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f356b3b2e2349a5ac258267e1d029a0/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "For the first time, the number of Americans who use marijuana just about every day has surpassed the number who drink that often, a shift some 40 years in the making as recreational pot use became more mainstream and legal in nearly half of U.S.",
      "publishedAt": "2024-05-22T13:00:28Z",
      "title": "Daily marijuana use outpaces daily drinking in the US, a new study says",
      "url": "https://apnews.com/b91c2c5957fdb2d48e6616c3baa14c13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14c5cb6b4fe7471f868e7c4f9da0a73b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}