{
  "articles": [
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON, JILL COLVIN and ZEKE MILLER",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump chose Rep. Matt Gaetz of Florida to serve as his attorney general on Wednesday, bypassing more experienced options in favor of a loyalist who has built a national reputation as a disruptor and whom Trump has tasked with dramatically overhauling the Justice Department.",
      "publishedAt": "2024-11-13T16:50:04Z",
      "title": "Trump picks Matt Gaetz for attorney general, Marco Rubio for secretary of state",
      "url": "https://apnews.com/0c65537ce9cd79194f1bcf60aad88f92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d299f174a5a8485bab1c0433827655cc/2739.jpeg"
    },
    {
      "author": "WILL WEISSERT, LISA MASCARO and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump made a victor’s return to Washington on Wednesday, visiting the White House for a nearly two-hour meeting with President Joe Biden and committing to a straightforward transition of power despite actively working to disrupt the same process four years ago.",
      "publishedAt": "2024-11-13T05:02:28Z",
      "title": "Trump returns to Washington vowing a smooth transition -- something he didn't ensure four years ago",
      "url": "https://apnews.com/24753cdd48514c68a832a6a1c255337c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eebad0afdde4cb8a8fb0711a18c37d6/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republicans have elected South Dakota Sen. John Thune as the next Senate majority leader, completing a momentous shift in their leadership that elevates a top deputy of Mitch McConnell into a key position as President-elect Donald Trump returns to the White House.",
      "publishedAt": "2024-11-13T05:08:41Z",
      "title": "Republican John Thune of South Dakota is elected the next Senate majority leader",
      "url": "https://apnews.com/c3c1c451a420729136ae641a14d9d5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4541e74f1d674248a8e636bd580c7fc2/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson won the House Republican nomination Wednesday to stay on the job, on track to keep the gavel after a morning endorsement from President-elect Donald Trump ahead of a full House vote in the new year.",
      "publishedAt": "2024-11-13T05:18:52Z",
      "title": "Speaker Mike Johnson wins GOP nomination to remain in job, faces full House vote in new year",
      "url": "https://apnews.com/29989249dcf533292ab5b2a22bf054a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0adecd20d76488783e8f0e963a6b2f7/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and TOM KRISHER",
      "description": "In picking billionaire Elon Musk to be “our cost cutter” for the U.S. government, President-elect Donald Trump won't be the first American president to empower a business tycoon to look for ways to dramatically cut federal regulations.",
      "publishedAt": "2024-11-13T22:24:14Z",
      "title": "Elon Musk says he and Trump have 'mandate to delete' regulations. Ethics laws could limit Musk role",
      "url": "https://apnews.com/80fa8b213b46460b1a0e369dc07a6404",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cea23ec95da4675a63d0661090a1f50/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden will hold talks Saturday with China's Xi Jinping on the sidelines of an international summit in Peru, a face-to-face meeting that comes as Beijing braces for Donald Trump's return to the White House.",
      "publishedAt": "2024-11-13T17:32:57Z",
      "title": "Biden and Xi will meet in Peru as US-China relations tested again by Trump's return",
      "url": "https://apnews.com/e861b2be6cce1ff8863c1f46aaf2efa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0991b77b26ab4077bf6fe2315053a5ec/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A man who worked for the U.S. government has been charged with leaking classified information assessing Israel's earlier plans to attack Iran, according to court papers filed Wednesday.",
      "publishedAt": "2024-11-13T13:28:29Z",
      "title": "US government worker charged with leaking classified documents on Israel's plans to strike Iran",
      "url": "https://apnews.com/af303d8e786839e7431b203b3cf40be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15d0a89efdf9474ea37d6715e6be847a/3000.jpeg"
    },
    {
      "author": "TOM NOUVIAN",
      "description": "PARIS (AP) — Protests erupted in Paris on Wednesday against a controversial gala organized by far-right figures in support of Israel. The event, intended to raise funds for the Israeli military, included Israeli Finance Minister Bezalel Smotrich among its invited guests.",
      "publishedAt": "2024-11-13T22:43:56Z",
      "title": "Protests erupt in Paris over pro-Israel gala organized by far-right figures",
      "url": "https://apnews.com/c7d2fef2ad4aedea2fdd3d844e48fd6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ea0058303a34332bf952faf98937148/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BERLIN (AP) — German Chancellor Olaf Scholz said Wednesday that he will ask for a vote of confidence on Dec. 16, paving the way for early parliamentary elections in February.",
      "publishedAt": "2024-11-13T12:41:43Z",
      "title": "German Chancellor Olaf Scholz says he'll ask for a vote of confidence in December",
      "url": "https://apnews.com/f3bf4635504f8df49b18f633da5d3d16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0a4155960734492bc8a7a764dbe12bf/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — Social media site Bluesky has gained 1 million new users in the week since the U.S.",
      "publishedAt": "2024-11-13T19:52:20Z",
      "title": "Bluesky has added 1 million users since the US election as people seek alternatives to X",
      "url": "https://apnews.com/d78de194e0e85f803652b70b161a963b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd643f90672a4a509a1e5ace8b978a57/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}