{
  "articles": [
    {
      "author": "MICHAEL BALSAMO, JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — As the investigation into a masked gunman who stalked and killed the head of one of the largest U.S.",
      "publishedAt": "2024-12-06T06:03:25Z",
      "title": "Hunt for the gunman who killed UnitedHealthcare's CEO heads into third day as new clues emerge",
      "url": "https://apnews.com/48590215ba756741bbaadeeb6255d135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/227f3de3c5e244c5a9b554504aa4fd75/1920.jpeg"
    },
    {
      "author": "ADAM GELLER, CATHY BUSSEWITZ and MICHAEL LIEDTKE",
      "description": "NEW YORK (AP) — He’s one of the most famous and widely admired corporate leaders in the world. But it’s the haters that companies like Mark Zuckerberg’s Meta worry about.In an era when online anger and social tensions are increasingly directed at the businesses consumers count on, Meta last year spent $24.4 million on guards, alarms and other measures to keep Zuckerberg and the company’s former chief operating officer safe.",
      "publishedAt": "2024-12-06T05:08:14Z",
      "title": "Slaying of UnitedHealthcare CEO spotlights complex challenge companies face in protecting top brass",
      "url": "https://apnews.com/a9400196d019daa3fe70698e807c606d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69774448a64f4347b8d52b132c1d2f3a/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Syrian insurgents entered two central towns early Friday just north of the central city of Homs, bringing them closer Syria’s third largest city, an opposition war monitor and pro-government media both reported.",
      "publishedAt": "2024-12-06T09:15:32Z",
      "title": "Syrian insurgents enter 2 central towns, bringing them close to the city of Homs",
      "url": "https://apnews.com/08d18aa519dd9883eb291f5a534a02f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbee0896665444d5a953e011a348d5f3/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and FATMA KHALED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The 12-year-old Palestinian boy was lying in a hospital bed in central Gaza, wracked with leukemia, malnourished and whimpering in pain despite the morphine doctors were giving him, when Rosalia Bollen, a UNICEF official, said she saw him in late October.",
      "publishedAt": "2024-12-06T07:13:40Z",
      "title": "Ailing kids wait months for Israeli permission to leave Gaza for treatment. Some die in the meantime",
      "url": "https://apnews.com/7ad6294bd10970e57b35e6e26bc6fa7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acf33620b95e4475b78e127b64065637/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "ISTANBUL (AP) — A Hamas official said Thursday that international mediators have resumed negotiating with the militant group and Israel over a ceasefire in Gaza, and that he was hopeful a deal to end the 14-month war was within reach.",
      "publishedAt": "2024-12-05T19:33:12Z",
      "title": "Hamas official says Gaza ceasefire talks have resumed after weekslong hiatus",
      "url": "https://apnews.com/d09bb192b298adb3fa76d0e819721fdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8f35b6496d94a27b381660b6cd2e681/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s governing party chief expressed support Friday for suspending the constitutional powers of President Yoon Suk Yeol for imposing martial law this week, in a bombshell reversal that makes Yoon’s impeachment more likely.",
      "publishedAt": "2024-12-06T00:44:31Z",
      "title": "South Korea's governing party head supports suspending Yoon's powers, making impeachment more likely",
      "url": "https://apnews.com/bfea0520c0361294f96edd6602ac8534",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff8879086df143008b9c0ed742e17874/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is weighing whether to issue sweeping pardons for officials and allies who the White House fears could be unjustly targeted by President-elect Donald Trump’s administration, a preemptive move that would be a novel and risky use of the president’s extraordinary constitutional power.",
      "publishedAt": "2024-12-06T03:08:31Z",
      "title": "Biden is considering preemptive pardons for officials and allies before Trump takes office",
      "url": "https://apnews.com/f36ead0eb92ea30e47cbfddfaf326f20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21d47b97e4f44034a776c376ee81eece/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Thursday he has selected former Sen. David Perdue of Georgia to serve as his ambassador to China, leaning on a former business executive turned politician to serve as the administration's envoy to America's most potent economic and military adversary.",
      "publishedAt": "2024-12-06T02:57:22Z",
      "title": "Trump names former Sen. David Perdue of Georgia to be ambassador to China",
      "url": "https://apnews.com/c481302fb42d7b6fc9d90dda23b45258",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/482a65e8df244458865904337afd7786/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "GREENVALE, N.Y. (AP) — Not yet even in office, Donald Trump said Thursday he's already accomplished more than President Joe Biden did in his entire term, an outsized claim by the president-elect just a month out from the election.",
      "publishedAt": "2024-12-05T18:31:21Z",
      "title": "Trump talks up his transition and election victory as he receives Fox Nation award",
      "url": "https://apnews.com/f99629d40359b65f0d37c5db190671d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ab5377a0eb49c3a75ff311e32160ae/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Gela Gogishvili and Haoyang Xu led a happy life as a gay couple in Russia, even as President Vladimir Putin’s government took an increasingly anti-LGBTQ+ stance.",
      "publishedAt": "2024-12-06T05:04:06Z",
      "title": "Russia's LGBTQ+ community is living in fear following new laws and court rulings, activists say",
      "url": "https://apnews.com/aef5650c6fdadbe1ac13e0d0b9f93f3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12ef2390549c4b6285c9f631706d3da1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}