{
  "articles": [
    {
      "author": "MARÍA VERZA and MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Polls closed in a national vote Sunday that will likely give Mexico its first female president, but the heat, violence and polarization continued right through election day.",
      "publishedAt": "2024-06-02T04:05:32Z",
      "title": "Mexico awaits results in an election likely to choose the country’s first female president",
      "url": "https://apnews.com/d7fef5c7ac964072401ba6d9809dd7d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f57d3201634c3191e54542155811e9/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israel is looking into an alternative local governing body for Gaza, the defense minister said Sunday, proposing a future beyond Hamas but giving no idea who those challengers might be.",
      "publishedAt": "2024-06-02T18:19:33Z",
      "title": "Israel seeks a 'governing alternative' to Hamas in Gaza. It's been tried and failed before",
      "url": "https://apnews.com/d32b0e8c46c6cd333e14841a585bbac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c72b886e48f04a0aa9ca45d6a969e0bd/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES, Argentina (AP) — At the base of the sacred Western Wall in Jerusalem’s Old City, President Javier Milei of Argentina appeared to be in a spiritual trance.With head and hands pressed against the ancient stone, he prayed with the Orthodox rabbi who introduced him to Judaism three years ago.",
      "publishedAt": "2024-06-03T04:10:23Z",
      "title": "President Milei's surprising devotion to Judaism and Israel provokes tension in Argentina and beyond",
      "url": "https://apnews.com/d8831369a6bc8a96205d4080d2b2045b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/545e074dd9854cd1932c0bbce2936737/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, WILL WEISSERT and MEG KINNARD",
      "description": "Donald Trump has joined the popular video-sharing app TikTok, a platform he once tried to ban while in the White House, and posted from a UFC fight two days after he became the first former president and presumptive major party nominee in U.S.",
      "publishedAt": "2024-06-02T15:24:40Z",
      "title": "Trump joins TikTok and calls it 'an honor.' As president he once tried to ban the video-sharing app",
      "url": "https://apnews.com/df3fdbc5634940bc57efa1c733a87a11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d03fdaea11374e26a0bd615924540189/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE, CLAUDIA LAUER, MICHAEL KUNZELMAN and COLLEEN LONG",
      "description": "WILMINGTON, Del. (AP) — Jury selection is to begin Monday in the federal gun case against President Joe Biden's son after a deal with prosecutors fell apart that would have avoided the spectacle of a trial so close to the 2024 election.",
      "publishedAt": "2024-06-03T04:11:45Z",
      "title": "Jury selection is beginning in gun case against President Joe Biden's son",
      "url": "https://apnews.com/e2cc8b5d459ad80e5bd7b05c5e9105c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6d08a63538c466fb0763ba6e78687ec/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Ukrainian President Volodymyr Zelenskyy was in the Philippines on Monday in a rare Asian trip to urge regional leaders to attend a Swiss-organized global peace summit on the war in Ukraine that he accuses Russia, with China’s help, of trying to undermine.",
      "publishedAt": "2024-06-03T01:28:47Z",
      "title": "Zelenskyy in Philippines to promote peace summit he says China and Russia are trying to undermine",
      "url": "https://apnews.com/713a05c244d01f1258e3bb4f67ec3b5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a306d7fba46438687af07c595e38714/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — The world’s largest election could also be one of its most consequential. India has close to 970 million voters among its more than 1.4 billion people, and its general election pits Prime Minister Narendra Modi, an avowed Hindu nationalist, against a broad alliance of opposition parties that are struggling to play catch up.",
      "publishedAt": "2024-06-03T05:18:40Z",
      "title": "India's election concludes with the votes being counted Tuesday. Here's what to know",
      "url": "https://apnews.com/510eea0717dec60c10ddc510d82b1ccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b90a0242171141cca4999998d5e5fb9d/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG and TIAN MACLEOD JI",
      "description": "HONG KONG (AP) — As the 35th anniversary of Beijing’s Tiananmen Square crackdown neared, Rowena He, a prominent scholar of that bloody chapter of modern China's history, was busy flying between the United States, Britain and Canada to give a series of talks.",
      "publishedAt": "2024-06-03T02:15:29Z",
      "title": "After crackdown on Hong Kong, overseas communities carry the torch to keep Tiananmen memories alive",
      "url": "https://apnews.com/0154eafea41ddcbc957a37b2df3811e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8abaa0e03284254b71ad5d0459dc290/3000.jpeg"
    },
    {
      "author": "TRÂN NGUYỄN AND THOMAS PEIPERT",
      "description": "SACRAMENTO, Calif. (AP) — California firefighters made significant progress Sunday to tame a wind-driven wildfire that scorched thousands of acres 60 miles (97 kilometers) east of San Francisco, burned down a home and forced residents to flee the area near the central California city of Tracy.",
      "publishedAt": "2024-06-02T03:08:46Z",
      "title": "California firefighters continue battling wind-driven wildfire east of San Francisco",
      "url": "https://apnews.com/c125ea03f228b8df65d4e66729477189",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79d78a3e86284edbafbc1ccb28606900/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — The Washington Post said Sunday that its executive editor, Sally Buzbee, has stepped down after three years at the top of one of journalism's most storied brands.She will be replaced by Matt Murray, former editor in chief of The Wall Street Journal, through this fall's presidential election.",
      "publishedAt": "2024-06-03T01:28:57Z",
      "title": "Sally Buzbee steps down as executive editor of The Washington Post",
      "url": "https://apnews.com/705e69a42fe8022ce46205bb06932fb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42bb81d883f4490c98dee085cdee642f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}