{
  "articles": [
    {
      "author": "MELANIE LIDMAN, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "TEL AVIV, Israel (AP) — Hezbollah hurled dozens of projectiles into Israel early Wednesday, including a missile aimed at Tel Aviv that was the militant group's deepest strike yet and marked a further escalation after Israeli strikes on Lebanon killed hundreds of people.",
      "publishedAt": "2024-09-25T06:28:45Z",
      "title": "Hezbollah fires a missile at Tel Aviv in deepest strike yet after Israeli bombardment of Lebanon",
      "url": "https://apnews.com/62cb173728d341c845bff9859addc7a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b386fdfab0244e0c8c802a3fec7283f9/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "It has been a devastating week for Hezbollah and the people of Lebanon.Bombs hidden in the group's pagers and walkie-talkies killed dozens of people and wounded thousands — many of them Hezbollah members.",
      "publishedAt": "2024-09-25T04:06:43Z",
      "title": "Israel has landed heavy blows on Hezbollah. The victory it seeks could prove elusive",
      "url": "https://apnews.com/cce53839bbcf0a9a36af45ed2fa7dbb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa6770bd09a44f159f1603eb10f55d7b/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — From the dais of the U.N. General Assembly just a year ago, Israeli Prime Minister Benjamin Netanyahu triumphantly hailed a new peace he said would sweep through the Middle East.",
      "publishedAt": "2024-09-25T08:51:41Z",
      "title": "Netanyahu will address the UN as Israel, bogged down by one war, barrels toward another",
      "url": "https://apnews.com/e761de05e4c4a7f54bfd27e8795bceb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00b0d5309d0341b988c4c2beda0c4c3e/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Derided by Donald Trump as a “communist,” Kamala Harris is playing up her street cred as a capitalist.Attacked by Harris as a rich kid who got $400 million from his father on a “silver platter,” Trump is leaning into his raw populism.",
      "publishedAt": "2024-09-25T09:06:10Z",
      "title": "In dueling speeches, Harris is to make her capitalist pitch while Trump pushes deeper into populism",
      "url": "https://apnews.com/bda4bfe7cb02c1c5c2f6232bf05ad670",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47641043cbb44d2e92e8dc2c840c01a2/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Multiple Secret Service failures ahead of the July rally for former President Donald Trump where a gunman opened fire were “foreseeable, preventable, and directly related to the events resulting in the assassination attempt that day,” according to a bipartisan Senate investigation released Wednesday.",
      "publishedAt": "2024-09-25T09:03:31Z",
      "title": "Secret Service failures before Trump rally shooting were 'preventable,' Senate panel finds",
      "url": "https://apnews.com/50af5692ca1489771144ac399d491e5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90bdcdb9dcf74500bd695cd260585e24/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and LUIS ALBERTO CRUZ",
      "description": "Tropical Storm Helene was rapidly strengthening in the Caribbean Sea and expected to become a hurricane Wednesday while moving north along Mexico's coast toward the U.S., prompting residents to evacuate, schools to close and officials to declare emergencies in Florida and Georgia.",
      "publishedAt": "2024-09-25T04:45:17Z",
      "title": "Tropical Storm Helene strengthens as hurricane warnings cover parts of Florida and Mexico",
      "url": "https://apnews.com/a953d0a51d219226f7d76178af2d3f4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/916e006061924a2782ec76ac28e3cdb2/1592.jpeg"
    },
    {
      "author": "SAMYA KULLAB and LORNE COOK",
      "description": "KYIV, Ukraine (AP) — The victory plan that President Volodymyr Zelenskyy will present to the White House this week asks the Biden administration to do something it has not achieved in the two and a half years since Russia invaded Ukraine: act quickly to support Kyiv’s campaign.",
      "publishedAt": "2024-09-25T04:09:50Z",
      "title": "Zelenskyy's victory plan sets Ukraine's terms in a desperate war against Russia",
      "url": "https://apnews.com/d5e0d1aa9bf7d17e13609c2564d26489",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42314674f05849d982f79f5b4c03328b/3000.jpeg"
    },
    {
      "author": "BERENICE GARCIA, URIEL J. GARCÍA, JUAN LOZANO, JAKOB MAURER, ALEJANDRO SERRANO and ELLIOT SPAGAT",
      "description": "As midnight nears, the lights of El Paso, Texas, and Ciudad Juárez, Mexico, fill the sky on the silent banks of the Rio Grande. A few months ago, hundreds of asylum-seeking families, including crying toddlers, waited for an opening to crawl through razor wire from Juarez into El Paso.",
      "publishedAt": "2024-09-25T10:06:07Z",
      "title": "One day along the Texas-Mexico border shows that realities shift more rapidly than rhetoric",
      "url": "https://apnews.com/a378073ed4e565570b4d4aa20f3a9ff8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63c1f96d4a774c3aa0414bcaa87320d8/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Ohio Sen. JD Vance, the Republican vice presidential candidate, is less popular among voters than his Democratic rival, Minnesota Gov. Tim Walz, according to a new survey from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-09-25T04:01:58Z",
      "title": "What polls show about Tim Walz and JD Vance before Tuesday's VP debate",
      "url": "https://apnews.com/97a3dc3b00741b02bcea85b51e735c12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ba226aca3f8444f83ff67b073484f31/2197.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "OAKLAND, Calif. (AP) — The Athletics had long ago carved out a Jekyll-and-Hyde legacy as one of Major League Baseball's most successful — and sad-sack — franchises. Under their belts: nine World Series titles and 19 seasons of futility punctuated by 100 or more losses.",
      "publishedAt": "2024-09-25T04:04:06Z",
      "title": "As an era ends, the city that was home to the Oakland A's comes to grips with their departure",
      "url": "https://apnews.com/9c3667e53de52b28209a9bed640f2196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da2ee2de34004337b464ea12a55b2f84/2998.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}