{
  "articles": [
    {
      "author": "SAM MCNEIL",
      "description": "UMM AL-FAHM, Israel (AP) — Israel’s yearlong crackdown against Palestinian citizens who speak out against the war in Gaza is prompting many to self-censor out of fear of being jailed and further marginalized in society, while some still find ways to dissent — carefully.",
      "publishedAt": "2024-11-24T05:18:36Z",
      "title": "Israel cracks down on Palestinian citizens who speak out against the war in Gaza",
      "url": "https://apnews.com/849cc9250534b5bae98cea89e6f4d35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07bb4526562b4a69890753279e1aa6c5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JON GAMBRELL",
      "description": "TEL AVIV, Israel (AP) — Israel said Sunday that the body of an Israeli-Moldovan rabbi who went missing in the United Arab Emirates has been found after he was killed in what it described as a “heinous antisemitic terror incident.”",
      "publishedAt": "2024-11-24T07:17:16Z",
      "title": "Israel says rabbi who went missing in the UAE was killed",
      "url": "https://apnews.com/98953265dcba8329803ae87d70462117",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c4a7a8fd48a4a988a6fe62ae99689d2/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and BASSEM MROUE",
      "description": "BEIRUT, Lebanon (AP) — Israeli airstrikes Saturday in central Beirut killed at least 20 people, officials said, as the once-rare attacks on the heart of Lebanon's capital continued without warning while diplomats scrambled to broker a cease-fire.",
      "publishedAt": "2024-11-23T08:51:22Z",
      "title": "Israeli strikes in central Beirut kill at least 20 as diplomats push for a cease-fire",
      "url": "https://apnews.com/60f383ef1f42ff9928770a77d27ec4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c31c0067397425787556d3f98953cb0/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — As a former and potentially future president, Donald Trump hailed what would become Project 2025 as a road map for “exactly what our movement will do” with another crack at the White House.",
      "publishedAt": "2024-11-23T22:22:16Z",
      "title": "After Trump's Project 2025 denials, he is tapping its authors and influencers for key roles",
      "url": "https://apnews.com/843f5ff20131ccba5f056e7ccc5baf23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7f97bc6c48a426cb5263cdd653f6c53/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Working-class voters helped Republicans make steady election gains this year and expanded a coalition that increasingly includes rank-and-file union members, a political shift spotlighting one of President-elect Donald Trump’s latest Cabinet picks: a GOP congresswoman, who has drawn labor support, to be his labor secretary.",
      "publishedAt": "2024-11-23T21:36:35Z",
      "title": "Trump's Republican Party is increasingly winning union voters. It's a shift seen in his labor pick",
      "url": "https://apnews.com/1bff41e4caef610dbf38ead24d292e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23610259b35845fbad6e31ae56a89126/3000.jpeg"
    },
    {
      "author": "GODOFREDO A. VASQUEZ",
      "description": "WINDSOR, Calif. (AP) — Forecasters through the U.S. issued warnings that another round of winter weather could complicate travel leading up to the Thanksgiving holiday, while California and Washington state continue to recover from storm damage and power outages.",
      "publishedAt": "2024-11-24T08:16:07Z",
      "title": "Forecasts warn of possible winter storms across US during Thanksgiving week",
      "url": "https://apnews.com/4f28a830a98f04d012c9d03aa77073ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95f691472aa64203be5b9a842bca9f1e/1920.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Pakistan Sunday suspended mobile and internet services “in areas with security concerns” as supporters of imprisoned former premier Imran Khan geared up for a protest in the capital.",
      "publishedAt": "2024-11-24T06:13:03Z",
      "title": "Pakistan partially stops mobile and internet services ahead of pro-Imran Khan protest",
      "url": "https://apnews.com/415227ef93b710798dedbc6c9f8ac2a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d00b9dc603746f4b5403a014fd42e72/3000.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "BAKU, Azerbaijan (AP) — In the wee hours Sunday at the United Nations climate talks, countries from around the world reached an agreement on how rich countries can cough up the funds to support poor countries in the face of climate change.",
      "publishedAt": "2024-11-23T23:50:02Z",
      "title": "Here's what to know about the new funding deal that countries agreed to at UN climate talks",
      "url": "https://apnews.com/52d39dd252ffcc4d4b8d1a9a68e375e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/020359426d364864ba54864b2e1b74f9/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and KIM TONG-HYUNG",
      "description": "SADO, Japan (AP) — Japanese officials on Sunday paid tribute to workers at the country's Sado Island Gold Mines but offered no apology over Japan’s brutal wartime use of Korean forced laborers, highlighting lingering tensions between the neighbors over the issue.",
      "publishedAt": "2024-11-24T00:47:51Z",
      "title": "Japan holds Sado mines memorial despite South Korean boycott amid lingering historical tensions",
      "url": "https://apnews.com/96a2e4952c4d801a3c35ee1b24588e2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0212a44ff99949aaa64ed8db53ec799d/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Chuck Woolery, the affable, smooth-talking game show host of “Wheel of Fortune,” “Love Connection” and “Scrabble” who later became a right-wing podcaster, skewering liberals and accusing the government of lying about COVID-19, has died.",
      "publishedAt": "2024-11-24T06:07:47Z",
      "title": "Chuck Woolery, smooth-talking game show host of 'Love Connection' and 'Scrabble,' dies at 83",
      "url": "https://apnews.com/508f37c136ccbc4c8ad48a4fd582674b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b828b222fb540edafc0bb1b58d6f8b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}