{
  "articles": [
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — WikiLeaks founder Julian Assange will plead guilty to a felony charge in a deal with the U.S. Justice Department that will free him from prison and resolve a long-running legal saga that spanned multiple continents and centered on the publication of a trove of classified documents, according to court papers filed late Monday.",
      "publishedAt": "2024-06-24T23:21:32Z",
      "title": "WikiLeaks founder Julian Assange will plead guilty in deal with US and be freed from prison",
      "url": "https://apnews.com/d329ba4614dbfa77b5eb968d07fd9bd0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/218d6e8425554ab8b4e5f02a440aecf4/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The viability of a U.S.-backed proposal to wind down the 8-month-long war in Gaza has been cast into doubt after Israeli Prime Minister Benjamin Netanyahu said he would only be willing to agree to a “partial” cease-fire deal that would not end the war, comments that sparked an uproar from families of hostages held by Hamas.",
      "publishedAt": "2024-06-24T07:30:44Z",
      "title": "Netanyahu says he won't agree to a deal that ends the war in Gaza, testing the latest truce proposal",
      "url": "https://apnews.com/f5de2ed8288ac3cdb02c4e9e2fbaeda1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eeebd934d26439f80c06a5cc164ba68/3000.jpeg"
    },
    {
      "author": "BY ABBY SEWELL AND MELANIE LIDMAN",
      "description": "BEIRUT (AP) — The prospect of a full-scale war between Israel and Lebanon’s Hezbollah militant group terrifies people on both sides of the border, but some see it as an inevitable fallout from Israel’s ongoing war against Hamas in Gaza, particularly as cease-fire negotiations have faltered.",
      "publishedAt": "2024-06-24T18:18:04Z",
      "title": "With another setback for cease-fire talks, worries of full-scale war for Israel and Lebanon escalate",
      "url": "https://apnews.com/260c308e5e6f85d30d8ebd0352c6bcb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30160f4cbbe2403c84467953b95aff48/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — In the coming days, the Supreme Court will confront a perfect storm mostly of its own making: a trio of decisions stemming directly from the Jan.",
      "publishedAt": "2024-06-24T10:12:43Z",
      "title": "Is Trump shielded from criminal charges as an ex-president? A nation awaits word from Supreme Court",
      "url": "https://apnews.com/acebc079bdaa6257bfd70a90a71a2ca0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e96f562df245e1a1f5271421833359/2028.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — After months of casting President Joe Biden as a shell of a man incapable of putting two sentences together, Donald Trump has changed his tune days before their first debate.",
      "publishedAt": "2024-06-24T22:00:16Z",
      "title": "Trump has spent months painting Biden as incompetent. Now he's changing his tone before the debate",
      "url": "https://apnews.com/6f9c53ba306286a1763438a7030c8a2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/727e103d24d349ad83f478fd43cc8797/3000.jpeg"
    },
    {
      "author": "SARA CLINE and KEVIN McGILL",
      "description": "BATON ROUGE, La. (AP) — Civil liberties groups filed a lawsuit Monday to block Louisiana’s new law that requires the Ten Commandments to be displayed in every public school classroom, a measure they contend is unconstitutional.",
      "publishedAt": "2024-06-24T19:24:40Z",
      "title": "Lawsuit challenges new Louisiana law requiring classrooms to display the Ten Commandments",
      "url": "https://apnews.com/a1255c8383d06fc04c3bafe899b67816",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d5d352cbc44e7393438f309413ec0c/1920.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS",
      "description": "ST. LOUIS (AP) — Hundreds of Iowa residents have needed rescue from record-setting flooding that has swamped parts of the state, covering buildings up to their rooftops, shutting down major roads, and disrupting basic services like electricity and drinking water.",
      "publishedAt": "2024-06-24T17:30:01Z",
      "title": "What’s causing the devastating flooding in the Midwest?",
      "url": "https://apnews.com/88b6eafd1252d9a5a473d3c867a4603b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d35e75449962404ea0036e7d2268fcea/2231.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "FORT PIERCE, Fla. (AP) — A federal prosecutor in the classified documents case of Donald Trump clashed with the judge Monday as he faced skeptical questioning over a request to bar the former president from making threatening comments about law enforcement agents involved in the investigation.",
      "publishedAt": "2024-06-24T04:10:36Z",
      "title": "Prosecutor in classified documents case clashes with judge over request to restrict Trump's speech",
      "url": "https://apnews.com/1d800e05b549de0d027f94aa93726742",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84536b07d4a0423284dcbbbdcef41ab9/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER and SHARON JOHNSON",
      "description": "The first weekend of summer brought a tragic yet familiar pattern for American cities wracked by gun violence as mass shootings left dozens dead or wounded at a party in Alabama, an entertainment district in Ohio and a grocery store in Arkansas.",
      "publishedAt": "2024-06-24T15:29:33Z",
      "title": "Mass shootings across the US mark the first weekend of summer",
      "url": "https://apnews.com/b004331ee7d3da95bce6646547f8d43f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01c4f4ab4e8a4c688c29ea7657f44cc9/2750.jpeg"
    },
    {
      "author": null,
      "description": "BOSTON (AP) — Big record companies are suing artificial intelligence song-generators Suno and Udio for copyright infringement, alleging that the AI music startups are exploiting the recorded works of artists from Chuck Berry to Mariah Carey.",
      "publishedAt": "2024-06-24T18:16:36Z",
      "title": "Music record labels sue AI song-generators Suno and Udio for copyright infringement",
      "url": "https://apnews.com/37a398d326ebb53105538f0d1088233e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ea9ab008c4d45a7bab3788ee3591d40/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}