{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — A new round of Israeli airstrikes in Yemen on Thursday targeted the Houthi rebel-held capital and multiple ports, while the World Health Organization's director-general said the bombardment occurred nearby as he prepared to board a flight in Sanaa, with a crew member injured.",
      "publishedAt": "2024-12-26T06:34:41Z",
      "title": "Israel strikes Houthi rebels in Yemen's capital while the WHO chief says he was meters away",
      "url": "https://apnews.com/2e8c33648410c2da94ae7d0d73c0b1a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/089c2de45b9d4733bb16f9a6dc0c2aa1/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "HOMS, Syria (AP) — Syria's new security forces checked IDs and searched cars in the central city of Homs on Thursday, a day after protests by members of the Alawite minority erupted in gunfire and stirred fears that the country's fragile peace could break down.",
      "publishedAt": "2024-12-26T20:22:20Z",
      "title": "An uneasy calm settles over Syrian city of Homs after outbreak of sectarian violence",
      "url": "https://apnews.com/6c8d534d9f93da13dc8629f2f2c49aae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33f612630ebd41e1b485c9f2f444a369/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — A lead organization monitoring for food crises around the world withdrew a new report this week warning of imminent famine in north Gaza under what it called Israel's “near-total blockade,” after the U.S.",
      "publishedAt": "2024-12-26T17:34:59Z",
      "title": "The US says it pushed retraction of a famine warning for north Gaza. Aid groups express concern.",
      "url": "https://apnews.com/89b4a0d3ab684669ee4456566b406621",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dacfd70f28d746d2ae7964266acbe3fb/3000.jpeg"
    },
    {
      "author": null,
      "description": "DALLAS (AP) — Some flights were delayed or canceled in Texas on Thursday after a line of thunderstorms started moving across parts of the state in a system the National Weather Service predicted could bring high winds, hail and possible tornadoes.",
      "publishedAt": "2024-12-26T17:17:01Z",
      "title": "Powerful thunderstorms rumble across Texas, delaying holiday travel",
      "url": "https://apnews.com/07d0bafd6019c152986c8557fedffb22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bc80d8b5a0d41e8bf4e22bbcc1bb4a8/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — Republicans plan to move quickly in their effort to overhaul the nation’s voting procedures, seeing an opportunity with control of the White House and both chambers of Congress to push through long-sought changes that include voter ID and proof-of-citizenship requirements.",
      "publishedAt": "2024-12-26T12:46:25Z",
      "title": "Trump has pressed for voting changes. GOP majorities in Congress will try to make that happen",
      "url": "https://apnews.com/88342cf09d01b0555851aa3d64c45432",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/785239cd44f143828e1abec71c44038e/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER and LINLEY SANDERS",
      "description": "NEW YORK (AP) — As a Democrat who immersed himself in political news during the presidential campaign, Ziad Aunallah has much in common with many Americans since the election. He's tuned out.“People are mentally exhausted,” said Aunallah, 45, of San Diego.",
      "publishedAt": "2024-12-26T12:04:03Z",
      "title": "Americans are exhausted by political news. TV ratings and a new AP-NORC poll show they're tuning out",
      "url": "https://apnews.com/b67aebae1a0853a1a3170ac588100bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9fe661021624496a95e368cfc41cfd0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Aviation experts said Thursday that Russian air defense fire was likely responsible for the Azerbaijani plane crash the day before that killed 38 people and left all 29 survivors injured.",
      "publishedAt": "2024-12-26T09:43:12Z",
      "title": "Aviation experts say Russia's air defense fire likely caused Azerbaijan plane crash as nation mourns",
      "url": "https://apnews.com/872800d95273ee96e0950192a32e5228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/709a8f6855d245c784b6819f41598f10/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — North Korean troops are suffering heavy losses in the fighting in Russia's Kursk region and facing logistical difficulties as a result of Ukrainian attacks, Ukraine’s military intelligence said Thursday.",
      "publishedAt": "2024-12-26T16:24:17Z",
      "title": "Ukraine's military intelligence says North Korean troops are suffering heavy battlefield losses",
      "url": "https://apnews.com/fe2506b30c4289a19a41c332f3dbe49c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1f1d760eb8b4bbf9a5d4c366caa2e08/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Former U.S. Sen. Bob Menendez asked a federal judge on Thursday to delay his end-of-January sentencing on bribery charges and acting as an agent of the Egyptian government, saying his family would suffer a “tremendous emotional toll” if the New Jersey Democrat were sentenced during his wife’s trial.",
      "publishedAt": "2024-12-26T21:36:02Z",
      "title": "Ex-Sen. Bob Menendez, citing 'emotional toll,' seeks sentencing delay in wake of wife's trial",
      "url": "https://apnews.com/a6510ebd0180e4c8e53bd5c68f136823",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31440dee51544a9ab723df622eb1c3b3/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — What a wonderful year 2024 has been for investors.U.S. stocks ripped higher and carried the S&amp;P 500 to records as the economy kept growing and the Federal Reserve began cutting interest rates.",
      "publishedAt": "2024-12-26T12:00:53Z",
      "title": "How the stock market defied expectations again this year, by the numbers",
      "url": "https://apnews.com/5e8bddd4ca301d66480249b41b4836ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/710b6934cba74e9cb05a43fcda569aaa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}