{
  "articles": [
    {
      "author": null,
      "description": "The Kremlin said Thursday that a meeting in the coming days between Russian President Vladimir Putin and U.S. President Donald Trump has been agreed on. Putin’s foreign affairs adviser Yuri Ushakov said the two sides are working on setting it up, and that a venue for the meeting has been agreed on and will be announced later. A meeting between Putin and Trump would be their first since Trump returned to office this year. It would be a significant milestone in the more than 3-year-old war, though there’s no promise such a meeting would lead to the end of the fighting, since Russia and Ukraine remain far apart on their demands.",
      "publishedAt": "2025-08-07T06:10:18Z",
      "title": "Trump to meet Putin in coming days, Kremlin says",
      "url": "https://apnews.com/article/russia-ukraine-war-poll-trump-sanctions-deadline-7cefb2df66f494f58a16b684a2c76687",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a361c5/2147483647/strip/true/crop/4855x2731+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fd5%2F260b87d9e56efa7800fe7a2ce542%2Fc28e4655812a47e688e3620581ea22a4"
    },
    {
      "author": null,
      "description": "President Donald Trump has started imposing higher import taxes on goods from over 60 countries, including the European Union, Japan and South Korea. These tariffs, which began Thursday, are part of Trump's strategy to reduce the trade deficit and encourage foreign investment in the U.S. However, the economic impact is already visible, with signs of stalled hiring, rising inflation and declining home values. Despite the uncertainty, Trump remains optimistic about economic growth, while many experts warn of potential long-term damage.",
      "publishedAt": "2025-08-07T04:02:21Z",
      "title": "Trump's broad tariffs go into effect, just as economic pain is surfacing",
      "url": "https://apnews.com/article/trump-tariffs-into-effect-economy-warning-signs-eafe20de9abad312573b320fd4b5fb33",
      "urlToImage": "https://dims.apnews.com/dims4/default/76528ac/2147483647/strip/true/crop/5491x3089+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fac%2F0a927050c5e8025388db521beb7e%2Fd73c8af454fd41b49a98072c44f6691a"
    },
    {
      "author": null,
      "description": "President Donald Trump's new tariff rates on U.S. imports from dozens of countries have taken effect, the latest chapter in his effort to reshape global trade. Many questions remain. Trump has threatened tariffs of up to 200% on imports of pharmaceuticals. He slapped 100% tariffs on computer chips and the materials used to make them. India's exports may be subject to a 50% import tax. There's still no agreement on what tariffs might apply to products shipped from China. Whatever the details, factory and trade data shows the uncertainty is clouding the outlook for the world's economy as a rush to beat the tariffs tapers off.",
      "publishedAt": "2025-08-07T05:31:18Z",
      "title": "New US tariffs cloud outlook for exporters in Asia and beyond",
      "url": "https://apnews.com/article/asia-tariffs-trump-china-trade-78d11d9d8ab4eb66898e12fdbd5aa9b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c40dd3/2147483647/strip/true/crop/5749x3234+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2F9b%2F211fcd0972e2c24acd90b9d6f959%2Fc4631db85ec447bda44460857eeb0061"
    },
    {
      "author": null,
      "description": "Israel has routed its enemies across the region but has yet to return all its hostages from the Gaza Strip. Hamas has been decimated militarily but has kept up insurgent attacks. Gaza is in ruins and experts say it is sliding into famine, and long-running ceasefire talks seem to have broken down. Both Israel and Hamas have embraced visions for how the war should end, but mediators from two American administrations, Egypt and Qatar have yet to bridge the gaps. There are at least two other scenarios in which the war goes on indefinitely, at an unimaginable cost to Gaza’s 2 million Palestinians and the families of Israeli hostages.",
      "publishedAt": "2025-08-07T08:57:56Z",
      "title": "Israel weighs options in Gaza: 4 scenarios",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-scenarios-b94815793c820bac093583cac6629de3",
      "urlToImage": "https://dims.apnews.com/dims4/default/2517a01/2147483647/strip/true/crop/3509x1974+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2Fc1%2F0e499417ddf76f45fe0d28e21450%2F6a80974a88234b3f93a108aadfd7d707"
    },
    {
      "author": null,
      "description": "An undisclosed “technology issue” delayed more than 1,000 United Airlines flights across the U.S. United Airlines said in a statement Wednesday that flights on major routes were held at their departure airports because of a technology issue. The airline on Wednesday night said the underlying issue had been resolved but some delays remained. An alert on the Federal Aviation Administration website Wednesday says all United Airlines flights destined for Chicago were halted at their departing airports. The agency says Denver, Newark, Houston, and San Francisco airports were also impacted by halted flights.",
      "publishedAt": "2025-08-07T01:56:23Z",
      "title": "United Airlines grounds flights nationwide due to tech issues",
      "url": "https://apnews.com/article/united-airlines-flights-grounded-08d0e4c76d2c7bc6e38cd767fcec3dc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/7071470/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F52%2Fba430fee001fa762577de083bb75%2Fff8878159e984e36a1146ae3f3c7a91e"
    },
    {
      "author": null,
      "description": "A spokesperson says parts of the Fort Stewart in southeast Georgia were locked down after an active shooter was reported on the sprawling Army post. Lt. Col. Angel Tomko told The Associated Press on Wednesday that an active shooter had been confirmed. Fort Stewart, located southwest of Savannah, is the largest Army post east of the Mississippi River. It’s home to thousands of soldiers and family members.",
      "publishedAt": "2025-08-06T15:52:12Z",
      "title": "Army base in Georgia is on lockdown after report of an active shooter, spokesperson tells AP",
      "url": "https://apnews.com/article/georgia-army-post-lockdown-shooter-0b3b2cda384d1f33d107d988e6088d92",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The shooting of five U.S. Army soldiers at a base in Georgia is the latest in a growing list of violent incidents at American military installations over the years. Some shootings have been isolated incidents between service members. But others have been attacks on bases or mass-casualty events. A 2009 shooting at Ford Hood in Texas by an Army pyschiatrist left 13 people dead. It was the deadliest attack on a domestic military installation in U.S. history. Wednesday's shooting in Georgia occurred at Fort Stewart. Authorities said the shooter has been taken into custody. The conditions of the victims were not immediately released.",
      "publishedAt": "2025-08-06T18:35:11Z",
      "title": "Shooting of 5 soldiers in Georgia is the latest in a series of incidents at US military bases",
      "url": "https://apnews.com/article/military-bases-shootings-56b98c620ac5b12f9f9876a59da664ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a4ec8c/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F9d%2F5e3e9a192c25b74529b8faef2991%2Fe715613dc7894458972d1292e3d368aa"
    },
    {
      "author": null,
      "description": "President Donald Trump has repeatedly delivered for the conservative Christians who form the bedrock of his Republican support. While Trump has made overtures to other religious groups, his Christian supporters have been among his most high-profile surrogates and appointees. Trump has established faith-focused entities with numerous influential Christian appointees and has energized supporters with assaults on cultural and academic targets long seen as liberal bastions. Trump's administration and his appointees on the Supreme Court have expanded areas for religious exemptions and expression. Supporters are pleased. Critics say Trump is eroding the separation of church and state and privileging certain expressions of Christianity over other religious views.",
      "publishedAt": "2025-08-07T11:02:14Z",
      "title": "Trump delivers for conservative Christians",
      "url": "https://apnews.com/article/trump-evangelicals-christian-conservatives-religious-freedom-1532250eb2fe620e4341b1b033123276",
      "urlToImage": "https://dims.apnews.com/dims4/default/9caddab/2147483647/strip/true/crop/5509x3099+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F5a%2F05ddc98b036408c2c6115411d0bd%2F118f96797c8f45ca8673a43bced6aa65"
    },
    {
      "author": null,
      "description": "South Korean investigators on Thursday requested a court warrant to arrest the wife of jailed former President Yoon Suk Yeol, a day after questioning her over suspicions including bribery, stock manipulation, and political influence-peddling. Yoon, for the second time in a week, resisted a law enforcement attempt to compel him for questioning over his wife, forcing prison officials to abandon their efforts after an hourlong struggle due to concerns of injury, the investigators said. The detention warrant for Yoon expires Thursday.",
      "publishedAt": "2025-08-07T06:44:56Z",
      "title": "South Korean investigators seek arrest of wife of jailed ex-President Yoon",
      "url": "https://apnews.com/article/south-korea-yoon-suk-yeol-kim-keon-hee-arrest-warrant-9d891933590fc60061820a24ca6e8a9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/65ea806/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F06%2F4f9d5cbff262ff66bc5eb632eea5%2F2a15eabc0108477da47dad0a36771960"
    },
    {
      "author": null,
      "description": "Hundreds of Harvard researchers have fallen victim to the freeze on funding by the Trump administration. The halt in federal funding has meant some of the world’s most prominent researchers exploring everything from opioid addiction to how diseases like cancer progress are laying off young researchers and shelving years or even decades of research. Some research might be lost forever. The funding cuts are part of a monthslong battle that the Trump administration has waged against some the country’s top universities. It has taken a particular hard and aggressive line against Harvard, freezing funding after the university rejected a series of demands from a federal antisemitism task force.",
      "publishedAt": "2025-08-07T04:03:00Z",
      "title": "Trump froze Harvard's funding. Scientists say research could be set back years",
      "url": "https://apnews.com/article/harvard-trump-nih-funding-cuts-32c1ae9dc542897496974a85aaa07b85",
      "urlToImage": "https://dims.apnews.com/dims4/default/632faef/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F12%2F3ffc54ddb3ef59b6ada70044de4d%2F07b2a4e35d7b4a00b8c2f67c6e758b25"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}