{
  "articles": [
    {
      "author": "Darlene Superville, Collin Binkley",
      "description": "The Trump administration is asking federal agencies to cancel remaining contracts with Harvard University worth about $100 million. That's according to a senior administration official Tuesday. The official spoke on condition of anonymity to describe internal deliberations. The government already has canceled more than $2.6 billion in federal research grants for the Ivy League school, which has pushed back on the administration’s demands for changes to several of its policies. Cuts to contracts could take away millions more from Harvard’s budget.",
      "publishedAt": "2025-05-27T12:26:10Z",
      "title": "Trump administration moves to cut federal contracts for Harvard",
      "url": "https://apnews.com/article/trump-harvard-federal-contracts-51d2d2618e1f0f5de39cb649644e1dae",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d9c912/2147483647/strip/true/crop/3900x2194+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fc8%2Fda3b618f95b4afa54cfce0190350%2Fa895c6b374d541ed9cbbf325f4bbd36a"
    },
    {
      "author": "Rebecca Santana, Lindsay Whitehurst",
      "description": "The Trump administration is asking the Supreme Court to halt a judge’s order allowing migrants to challenge their deportations to South Sudan. The emergency appeal Tuesday came after a judge found the White House violated a court order with a deportation flight to the chaotic African nation carrying people from other countries who had been convicted of crimes in the U.S. Judge Brian E. Murphy in Boston found that the White House had “unquestionably” violated his earlier order that people must be given a chance to raise objections before being sent to another country that would put them in danger, even if they’ve otherwise exhausted their legal appeals.",
      "publishedAt": "2025-05-27T16:27:20Z",
      "title": "Judge accuses Trump administration of 'manufacturing' chaos in migrant deportation case",
      "url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-26547035c21e45339cffec1450dffa35",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb1b0b6/2147483647/strip/true/crop/5608x3155+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F7d%2F8af24457b16d9785e7e208d842ad%2F5ef8b4863aad48bdada6dd5f80a8242c"
    },
    {
      "author": "Mohammed Jahjouh",
      "description": "Chaos has erupted on the second day of aid operations by a new U.S.-backed group in Gaza. Palestinians overwhelmed a center distributing food on Tuesday, breaking through fences. An AP journalist heard tank and gunfire from nearby Israeli troops and saw a military helicopter firing flares. The Israeli military said its troops fired warning shots in the area outside the center to bring the situation under control. At least three injured Palestinians were seen being brought from the scene. The distribution hub outside Rafah had been opened the day before by the Gaza Humanitarian Foundation, which has been slated by Israel to take over aid operations despite opposition from the U.N. and other humanitarian organizations.",
      "publishedAt": "2025-05-27T15:33:18Z",
      "title": "Israeli gunfire heard as Palestinians crowd aid center in Gaza",
      "url": "https://apnews.com/article/gaza-israel-palestinians-tank-fire-807f54962c1315d5eaa589bcfb91fe06",
      "urlToImage": "https://dims.apnews.com/dims4/default/96f4170/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fa4%2F8442b593b81f64882ab9e0807ccf%2F0446ea58d6e249ccb2acacf228f47e8b"
    },
    {
      "author": "David Mchugh, Paul Wiseman",
      "description": "European and US officials are wrestling over a trade deal. President Trump says if there's no agreement by July 9, he'll impose a crushing 50% tariff or import tax on goods coming in from Europe. Europe has said it's fully committed to the talks and Trump has delayed his deadline from this coming Sunday. But what does he want, and what can Europe offer?",
      "publishedAt": "2025-05-27T18:39:43Z",
      "title": "The US and EU are in a showdown over trade. What does Trump want and what can Europe offer?",
      "url": "https://apnews.com/article/trade-eu-trump-tariffs-a2e5b6c72ab61fef0b2ed4324fad1c55",
      "urlToImage": "https://dims.apnews.com/dims4/default/f16ce26/2147483647/strip/true/crop/3156x1775+0+164/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F1d%2F5d5fe6fc8d2ac50c816e5c031030%2F27fc90339abf4968a319746e720ee801"
    },
    {
      "author": "Mike Stobbe",
      "description": "U.S. Health Secretary Robert F. Kennedy Jr. says COVID-19 vaccines are no longer recommended for healthy children and pregnant women. In a 58-second video posted on the social media site X, Kennedy said he removed COVID-19 shots from Centers for Disease Control and Prevention’s recommendations for those groups. No one from the CDC was in the video. U.S. health officials, following recommendations by infectious disease experts, have been urging annual COVID-19 boosters for all Americans ages 6 months and older. A CDC scientific advisory panel is set to meets in June and will consider recommending vaccination for high-risk groups but still giving lower-risk people the choice in getting a shot. But Kennedy decided not to wait.",
      "publishedAt": "2025-05-27T16:42:12Z",
      "title": "COVID vaccines are no longer recommended for healthy children and pregnant women, Kennedy says",
      "url": "https://apnews.com/article/covid-vaccine-pregnant-women-children-70c358cad726e57d680234c3ecdec926",
      "urlToImage": "https://dims.apnews.com/dims4/default/13da36d/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F35%2F204e0e68376dfab301a4982659c6%2F299c55912acd49899b3855a146f3f02a"
    },
    {
      "author": null,
      "description": "The White House says President Donald Trump is set to pardon reality TV stars Julie and Todd Chrisley, the couple famous for “Chrisley Knows Best,” which followed their tightly knit family and extravagant lifestyle. A jury in 2022 found them guilty of conspiring to defraud community banks out of more than $30 million in fraudulent loans. The Chrisleys were also found guilty of tax evasion by hiding their earnings. In a social media post Tuesday, the White House said Trump called the Chrisley family and said “he will be granting full pardons,” adding, “Trump Knows Best!”",
      "publishedAt": "2025-05-27T21:36:33Z",
      "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley",
      "url": "https://apnews.com/article/trump-pardon-julie-todd-chrisley-reality-tv-2f79831f142de44b36922ebdbc959f04",
      "urlToImage": "https://dims.apnews.com/dims4/default/576d25a/2147483647/strip/true/crop/5384x3029+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F4d%2F830049a0506b1f1cae823eba109c%2F35a8df1871924d22bd08017fd89cd83b"
    },
    {
      "author": "Jon Super",
      "description": "British police are holding a 53-year-old man over a collision that turned a joyous soccer celebration in Liverpool to tragedy and sent more than two dozen people to hospitals. The city's mayor says four people are in very serious condition. Police said they are not treating Monday evening's incident as terrorism and are not looking for other suspects. Detectives on Tuesday were piecing together how a minivan plowed into crowds. It happened after the players of Liverpool Football Club celebrated the Premier League championship with an open-topped bus parade. The North West Ambulance Service said a total of 47 people were injured, of whom 27 were taken to local hospitals.",
      "publishedAt": "2025-05-27T07:57:09Z",
      "title": "4 Liverpool fans seriously hurt when car plowed into a crowd. The suspect acted alone, police say",
      "url": "https://apnews.com/article/liverpool-ramming-police-injuries-soccer-58475cf48441048e87f89df7aba6bb45",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b700e4/2147483647/strip/true/crop/7837x4408+0+408/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F7c%2F30eb50e509da81abe77c95eae26f%2F4969bf20afbf411e9760f594a03d225f"
    },
    {
      "author": null,
      "description": "At least five people have died and 19 were injured in a chemical plant explosion in eastern China, state broadcaster CCTV reported. Authorities say there are still six people missing following Tuesday's explosion at the Gaomi Youdao Chemical Co., which is located in an industrial park in the city of Weifang. It manufactures pesticides as well as chemicals for medical use. The blast was powerful enough to knock out the windows at a storage warehouse more than two miles away from the factory, according to a video shared by a local resident, who declined to give his name out of concern for retaliation.",
      "publishedAt": "2025-05-27T09:02:01Z",
      "title": "At least 5 dead and 19 injured in chemical plant explosion in China, CCTV reports",
      "url": "https://apnews.com/article/china-chemical-plant-explosion-c6cf0f35f996654221e9fb8de7d9fcee",
      "urlToImage": "https://dims.apnews.com/dims4/default/4bdeb9c/2147483647/strip/true/crop/1961x1103+0+102/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F62%2F044d56e2735297fb96385b0661c8%2Ff55e23d7c1744f649a0df20ea92e0b4d"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A former top aid to Sean “Diddy” Combs has testified at his sex trafficking trial that the music mogul threatened her with death on her first day on the job. She also says he later kidnapped her to help him kill fellow rapper Kid Cudi. The testimony on Tuesday from Capricorn Clark, the former global brand director for Bad Boy Entertainment, launched the third week of testimony in the trial on a violent note. Prosecutors are trying to prove Combs led a racketeering conspiracy for 20 years that relied on beefy security employees and others to ensure he got what he wanted. Combs has pleaded not guilty.",
      "publishedAt": "2025-05-27T15:29:55Z",
      "title": "Ex-aide to Sean 'Diddy' Combs testifies that he kidnapped her to help kill Kid Cudi",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-e6d14af365fd2bfe8c1ab0ab7b1f8011",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4647be/2147483647/strip/true/crop/1753x986+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F65%2F54a13cb40ffdb216bd6ed466ed07%2Fab10451bb17d49dba8de0d66346e85fb"
    },
    {
      "author": null,
      "description": "Ukrainian officials say that a massive Russian drone-and-missile attack targeted the country for a second consecutive night, killing at least twelve people and injuring dozens. The attack early on Sunday came on the third day of a planned prisoner swap between Russia and Ukraine, the only tangible outcome from peace talks in Istanbul earlier this month which have so far failed to produce a ceasefire. Ukraine’s President Volodymyr Zelenskyy and Russia’s defense ministry said each side brought home 307 more soldiers on Saturday, a day after each released a total of 390 combatants and civilians. Further releases were expected on Sunday.",
      "publishedAt": "2025-05-25T05:24:51Z",
      "title": "A massive Russian drone-and-missile attack on Ukraine kills at least 12",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-dbefc3d0a83826c865908aa29dd40f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ef8ea2/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fd9%2Fd3ab0a5e78158586ab83c2e6968d%2Faff05b9e9af543d78d9f71004eb1165b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}