{
  "articles": [
    {
      "author": "BECKY BOHRER and MATTHEW DALY",
      "description": "JUNEAU, Alaska (AP) — In an aggressive move that angered Republicans, the Biden administration canceled the seven remaining oil and gas leases in Alaska's Arctic National Wildlife Refuge on Wednesday, overturning sales held in the Trump administration's waning days, and proposed stronger protections against development on vast swaths of the National Petroleum Reserve-Alaska.",
      "publishedAt": "2023-09-06T19:02:09Z",
      "title": "Biden administration cancels remaining oil and gas leases in Alaska's Arctic Refuge",
      "url": "https://apnews.com/318dcc3f2d5b104a800bf3ba48e764b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7233bbcd857b4456b65937ba5dac3268/1500.jpeg"
    },
    {
      "author": "MSTYSLAV CHERNOV",
      "description": "KOSTIANTYNIVKA, Ukraine (AP) — The Russian missile that struck Wednesday in eastern Ukraine turned an outdoor market into a fiery, blackened ruin where weeping civilians looked for loved ones among the mangled, burned bodies scattered across the ground.",
      "publishedAt": "2023-09-06T16:35:58Z",
      "title": "Russian missile turns Ukrainian market into fiery, blackened ruin strewn with bodies",
      "url": "https://apnews.com/6c1545768d77d927a5cda148fc197e3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64f8d023154743f6acdd33df3fa234ca/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Ahead of India’s hosting of the G20 summit of leading economies, its prime minister invited 125 mostly developing countries to a virtual meeting in January to signal New Delhi’s intention to be their champion on the world stage.",
      "publishedAt": "2023-09-07T04:11:21Z",
      "title": "India's rising geopolitical clout will be tested as it hosts the G20 summit",
      "url": "https://apnews.com/4a611acfd1ee724d623520781a37bd02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b2b337ba4224fd6978e52797bbb326d/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ and MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Mexico’s Supreme Court threw out all federal criminal penalties for abortion Wednesday, ruling that national laws prohibiting the procedure are unconstitutional and violate women’s rights in a sweeping decision that extended Latin American’s trend of widening abortion access.",
      "publishedAt": "2023-09-06T20:11:16Z",
      "title": "Mexico decriminalizes abortion, extending Latin American trend of widening access to procedure",
      "url": "https://apnews.com/d87f6edbdf68c2e6c8f5700b3afd15de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e39e811ebabd419792518317df9cb860/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — A liberal group on Wednesday filed a lawsuit to bar former President Donald Trump from the primary ballot in Colorado, arguing he is ineligible to run for the White House again under a rarely used clause in the U.S.",
      "publishedAt": "2023-09-06T16:28:22Z",
      "title": "Lawsuit contends Constitution's 'insurrection' clause bars Trump from running again for president",
      "url": "https://apnews.com/19ca3f17881e8818302cb1260e7c2aed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5484c4bba4bc43cb978d5dbefd0353da/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Federal prosecutors plan to seek a grand jury indictment of President Joe Biden’s son Hunter before the end of the month, according to court documents filed Wednesday.",
      "publishedAt": "2023-09-06T20:00:36Z",
      "title": "Prosecutors seeking new indictment for Hunter Biden before end of September",
      "url": "https://apnews.com/1dc4471d64475e1c1f617238f6e0e5ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acd81aedc754c7592c2b3bfe3f16ab8/2344.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — Texas must move a large floating barrier that Gov. Greg Abbott placed on the river between the U.S.",
      "publishedAt": "2023-09-06T20:56:43Z",
      "title": "A judge orders Texas to move a floating barrier that's used to deter migrants between US and Mexico",
      "url": "https://apnews.com/d2a98fd0d9d9c65be1dcdd42a3a150f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fb9515c894742a1b77a97bc45d6b028/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A Greek shipper has pleaded guilty to a charge over it smuggling sanctioned Iranian crude oil and agreed to pay a $2.4 million fine, U.S. federal court papers seen Thursday by The Associated Press show.",
      "publishedAt": "2023-09-07T00:44:13Z",
      "title": "Greek shipper pleads guilty to smuggling Iranian crude oil and will pay $2.4 million fine",
      "url": "https://apnews.com/a9a4bf6b6616a8502c4eb052bcfef5aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aee54a2b5b3a46938fb182cb45b14e86/2046.jpeg"
    },
    {
      "author": "WESLEY SANTOS and DIANE JEANTET",
      "description": "MUCUM, Brazil (AP) — Flooding from a cyclone in southern Brazil washed away houses, trapped motorists in vehicles and swamped streets in several cities, killing at least 31 people and leaving 2,300 homeless, authorities said Wednesday.",
      "publishedAt": "2023-09-06T13:47:16Z",
      "title": "Flooding in southern Brazil leaves at least 31 dead and 2,300 homeless",
      "url": "https://apnews.com/97d946798a4ba1d3ef0269bfcdf3c70c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d19f93b10a5c4409b842c53786cbce8e/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — President Joe Biden has refused to approve some of the conditions that lawyers for the defendants in the Sept.",
      "publishedAt": "2023-09-07T00:54:54Z",
      "title": "Biden refuses to grant some of the conditions that 9/11 defendants were seeking in plea negotiations",
      "url": "https://apnews.com/46c4c665f89505de4effa42b9329bd6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a026c68ce904e6d87fd7b8868f3b689/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}