{
  "articles": [
    {
      "author": null,
      "description": "A federal judge in New Hampshire says he will certify a class action lawsuit including all children who will be affected by President Donald Trump’s executive order ending birthright citizenship and issue a preliminary injunction blocking it. The judge announced his decision Thursday after an hour-long hearing and said a written order will follow. He says the order will include a seven-day stay to allow for appeal. Plaintiffs originally sought to include parents as plaintiffs.",
      "publishedAt": "2025-07-10T04:01:25Z",
      "title": "New Hampshire judge to pause Trump’s birthright citizenship order",
      "url": "https://apnews.com/article/birthright-citizenship-classaction-lawsuit-055227e3f219fd890c78cd21c89fd5d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e08f48/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F11%2F023b54efde6b27cd04e746ad9429%2Fad15bb51227c47edb926cda9a4d1f7e1"
    },
    {
      "author": null,
      "description": "A federal judge in New Hampshire has blocked President Donald Trump’s executive order ending birthright citizenship. The ruling, issued Thursday, prohibits the order from taking effect nationwide but allows a seven-day stay for appeal. Birthright citizenship, rooted in the 14th Amendment, grants U.S. citizenship to anyone born on American soil, regardless of their parents' legal status. Trump’s order, signed in January, challenges this principle, calling it a “magnet for illegal immigration.” Legal battles over the order are ongoing, with experts predicting the case will reach the U.S. Supreme Court. The issue could have significant implications for immigration and constitutional law.",
      "publishedAt": "2025-06-27T22:08:52Z",
      "title": "What's next for President Donald Trump's birthright citizenship order in the courts",
      "url": "https://apnews.com/article/birthright-citizenship-trump-supreme-court-next-steps-11ce3a0dfe3a30c0ee1b67b92a322f01",
      "urlToImage": "https://dims.apnews.com/dims4/default/9893ca4/2147483647/strip/true/crop/5852x3292+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fb7%2F4dd8767c4a1b8b29e8ea4bab7079%2F0fb8f52ab1c54ed9a86eb37a79b4996c"
    },
    {
      "author": null,
      "description": "Several hundred people have gathered for a worship ceremony at a high school stadium in Texas. The vigil was held Wednesday evening to remember of the at least 120 people who died in the catastrophic flash floods over the July Fourth holiday. More than 160 are still believed to be missing in hard-hit Kerr County. People in the crowd clutched one another and brushed away tears during the vigil. Search crews and volunteers are continuing to scour miles along the Guadalupe River for the people still missing. The floods are now the deadliest from inland flooding in the U.S. since 1976.",
      "publishedAt": "2025-07-10T04:06:59Z",
      "title": "Hundreds gather at Texas vigil following deadly floods",
      "url": "https://apnews.com/article/texas-floods-worship-ceremony-dead-missing-39afd477993c6220d0ce8c080cea0828",
      "urlToImage": "https://dims.apnews.com/dims4/default/d68995b/2147483647/strip/true/crop/5595x3147+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Faa%2F76838ea47c9996d1b02db06cfdb6%2F802f091d658043249f88c93c62d4568a"
    },
    {
      "author": null,
      "description": "A retired nurse, her son and a family friend say they were lucky to survive last week's flash floods in Texas that killed more than 100 people, including many summer campers. Jane Towler says she got a call at around 4 a.m. last Friday from a friend in a neighboring cabin telling her the Guadalupe River was rising quickly and to get to safety. Towler ran next door to warn her son, their family friend and the woman's young daughter. Videos Towler shot show how quickly the cottage filled with water and how they had to flee to the attic and then the roof, where they waited out the night amid lightning, shouts and widespread destruction.",
      "publishedAt": "2025-07-10T19:53:33Z",
      "title": "Photos and video captured Texas flood survivors' terrifying ordeal as water filled their cottage",
      "url": "https://apnews.com/article/texas-flood-survivors-video-434cea2164368a9f1dee74636961d1da",
      "urlToImage": "https://dims.apnews.com/dims4/default/af0aae6/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F9d%2F803b9cafd421c2bcfdeb215646bc%2F6b82ba781cd84e5ba7ba479faf1cd647"
    },
    {
      "author": null,
      "description": "The Los Angeles Fire Department says 31 workers have been safely removed from an industrial tunnel after part of the structure collapsed. The workers were up to 6 miles from the tunnel’s only entrance Wednesday. Some workers scrambled over a tall mound of loose soil to reach coworkers. They were shuttled to the entrance and hoisted out. Paramedics were evaluating 27 of the workers and officials say none had major injuries. A Los Angeles County Sanitation Districts spokesperson says authorities are still investigating the cause of the cave-in at the nearly $700 million project.",
      "publishedAt": "2025-07-10T04:40:33Z",
      "title": "Wilmington tunnel collapse: 31 construction workers reach safety",
      "url": "https://apnews.com/article/tunnel-collapse-los-angeles-2dfef5cb607394c6a71e3b84436fde12",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c1ee5d/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fb5%2F925938b2796433c01bf936499302%2F629c5b24962e4e6fbd17bf91bcdd7882"
    },
    {
      "author": null,
      "description": "The Trump administration says it will restrict immigrants in the country illegally from enrolling in Head Start, a federally funded preschool program. The move is part of a broad effort to limit access to federal benefits for immigrants who lack legal status. People in the country illegally are largely ineligible for federal public benefits such as food stamps, student loans and financial aid for higher education. But for decades they have been able to access some community-level programs such as Head Start and community health centers. The changes were announced Thursday by the Health and Human Services department.",
      "publishedAt": "2025-07-10T22:44:31Z",
      "title": "Trump to cut off Head Start for immigrants in US illegally",
      "url": "https://apnews.com/article/trump-head-start-immigrants-rfk-d10a3b8fa77d37e6e54106ef1db45888",
      "urlToImage": "https://dims.apnews.com/dims4/default/a002afc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fee%2Fe834438f67e725a9a76f0eeb10fa%2Faf4dbc0889eb4029ac2a2d4852473eff"
    },
    {
      "author": null,
      "description": "Palestinian activist Mahmoud Khalil, whose role in campus protests against Israel led to his detention for over three months in immigration jail, is now seeking $20 million in damages from the Trump administration. His lawyers filed a claim Thursday, alleging false imprisonment and malicious prosecution after his March arrest by federal agents. Khalil, a legal U.S. resident, said he suffered severe anguish in jail, and continues to fear for his safety. The government has accused him of leading protests aligned with Hamas, but has not provided any evidence of a link to the terror group.",
      "publishedAt": "2025-07-10T17:30:32Z",
      "title": "Columbia protester Mahmoud Khalil files $20M claim against Trump administration",
      "url": "https://apnews.com/article/mahmoud-khalil-ice-release-trump-columbia-protests-570f7af32010c16b1a00dd7e78f4c687",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a854db/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F0b%2F1707ee42dc801ea05ef3c0cc72fb%2F2842eafedc8b44c78b115a81aad738b8"
    },
    {
      "author": null,
      "description": "Amanda Anisimova has upset No. 1-ranked Aryna Sabalenka 6-4, 4-6, 6-4 at Wimbledon to reach the first Grand Slam final of her career a little more than a year after taking a break from tennis because of burnout. Thursday’s match was the second major semifinal of the 13th-seeded Anisimova’s career. The American lost at that stage at the 2019 French Open at age 17. She took time off from the tour in May 2023 and said she had been struggling with her mental health for nearly a year. Anisimova will face either Iga Swiatek or Belinda Bencic on Saturday for the trophy.",
      "publishedAt": "2025-07-10T15:19:13Z",
      "title": "Anisimova upsets Sabalenka at Wimbledon, into 1st Slam final",
      "url": "https://apnews.com/article/wimbledon-women-sabalenka-anisimova-swiatek-bencic-00b68fdc5afc9287c6dd285bc7d888be",
      "urlToImage": "https://dims.apnews.com/dims4/default/2216d9e/2147483647/strip/true/crop/5103x2870+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F36%2F9e10f7ac201b095741fdcc4f6ce8%2F4b058e50f087455db6f90d61385349be"
    },
    {
      "author": null,
      "description": "Stock indexes closed higher on Wall Street, enough to nudge the S&P 500 and the Nasdaq composite to more records. The S&P 500 rose 0.3% Thursday, and the Nasdaq edged up 0.1%. It was the second all-time high in a row for the Nasdaq. The Dow Jones Industrial Average added 0.4%. Delta Air Lines led a rally in airline stocks after issuing a solid outlook for the rest of 2025. Delta soared 12%, and United Airlines climbed 14.3%. Cereal maker WK Kellogg jumped 30.6% after agreeing to be acquired by Nutella maker Ferrero Group. Copper prices rose.",
      "publishedAt": "2025-07-10T04:37:20Z",
      "title": "Wall Street closes higher and edges to more records",
      "url": "https://apnews.com/article/financial-markets-tech-rally-6c4b36029125cb5dd0ee2eedbd0a238a",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c0da15/2147483647/strip/true/crop/6995x3935+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fb7%2F43fa222a29e91455801a234e086d%2Fa627db1e00d14a96963864b102a9957f"
    },
    {
      "author": null,
      "description": "Italian confectioner Ferrero, known for brands like Nutella and Kinder, is buying the century-old U.S. cereal company WK Kellogg in a deal valued at approximately $3.1 billion. Kellogg was founded in Battle Creek, Michigan, in 1906. It makes Froot Loops, Special K, Frosted Flakes and Rice Krispies. Kellogg has been struggling with falling U.S. cereal consumption as consumers opt for protein bars and other products. But industry watchers say its large distribution network and relations with grocers are appealing to Ferrero. The deal still needs the approval of WK Kellogg's shareholders.",
      "publishedAt": "2025-07-10T13:08:04Z",
      "title": "Ferrero plans to buy century-old cereal maker WK Kellogg for $3 billion",
      "url": "https://apnews.com/article/kellogg-ferrero-cereal-chocolate-fruit-loops-a148780f0abe5ee39f1c5450204e41e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/77cbd46/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F44%2Ff054fd9d9eda9918e2ca65463aee%2F3b933c6a93964d22bf3b771826d1dc70"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}