{
  "articles": [
    {
      "author": "ZEKE MILLER, COLLEEN LONG and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Lawmakers turned a Tuesday hearing on President Joe Biden’s handling of classified documents into a proxy battle between the Democratic president and Republican front-runner Donald Trump, as a newly-released transcript of Biden’s testimony last fall showed that he repeatedly insisted he never meant to retain classified information after he left the vice presidency.",
      "publishedAt": "2024-03-12T04:09:12Z",
      "title": "Congressional hearing on the Biden classified documents probe turns into a proxy campaign battle",
      "url": "https://apnews.com/122526da6d89d7bf4d6ccfc54590312b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a37b56bc5b431e887d1dc2fcad14e3/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and MENELAOS HADJICOSTIS",
      "description": "RAFAH, Gaza Strip (AP) — An aid ship loaded with some 200 tons of food set sail for Gaza on Tuesday in a pilot program for the opening of a sea corridor to the territory, where the five-month-old Israel-Hamas war has driven hundreds of thousands of Palestinians to the brink of starvation.",
      "publishedAt": "2024-03-12T07:12:04Z",
      "title": "An aid ship sets sail to Gaza, where hundreds of thousands face starvation 5 months into war",
      "url": "https://apnews.com/d2ba829df1df1092cf421fc591af9063",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2823329272bb46529cf291f2c8e5bf52/1920.jpeg"
    },
    {
      "author": "MOHAMMED JAHJOUH and SAMY MAGDY",
      "description": "MUWASI, Gaza Strip (AP) — It was a somber scene as Randa Baker and her family sat on the ground in their tent in southern Gaza at sunset Monday for their meal breaking their first day of fasting in the Muslim holy month of Ramadan.",
      "publishedAt": "2024-03-12T03:41:56Z",
      "title": "A Gaza family uprooted by war and grieving their losses shares a somber Ramadan meal in a tent",
      "url": "https://apnews.com/4a0a2043e7d6b5f9a70a70ba089d973b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd912aae917d48f8ab0c6a429da1e0ce/1920.jpeg"
    },
    {
      "author": "MICHAEL WEISSENSTEIN",
      "description": "Haiti’s prime minister has said he will resign, bowing to international pressure to save his homeland gripped by violence and controlled by heavily armed gangsters.",
      "publishedAt": "2024-03-10T05:11:37Z",
      "title": "Why is Haiti so chaotic? Leaders used street gangs to gain power. Then the gangs got stronger",
      "url": "https://apnews.com/142c57f868c5f8b0cdf01627b3f5350b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8c76e172a3247fab9acc0953283de78/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Joe Biden and Donald Trump hope to clinch their parties' presidential nominations with dominant victories in a slate of state primaries on Tuesday as the 2024 fight for the White House moves into a new phase.",
      "publishedAt": "2024-03-12T04:05:50Z",
      "title": "Biden and Trump could clinch nominations in Tuesday's contests, ushering in general election",
      "url": "https://apnews.com/15bb0084ad656903ffef14cfae822abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/106c5589330a4caa93df31a5b09f72f0/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — For more than half a century, Ohio was one of the most important states to watch during presidential election years, a place where both parties competed vigorously for support from voters who were often genuinely undecided.",
      "publishedAt": "2024-03-12T04:17:59Z",
      "title": "Purple Ohio? Parties in the former bellwether state take lessons from 2023 abortion, marijuana votes",
      "url": "https://apnews.com/873f34413637043dc6b1ff6edb83d181",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03df2db3d6bc47de9336f4f6e936cdac/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ and HANNA ARHIROVA",
      "description": "Ukrainian long-range drones smashed into two oil facilities deep inside Russia on Tuesday, officials said, while an armed incursion claimed by Ukraine-based Russian opponents of the Kremlin unnerved a border region just days before Russia’s presidential election.",
      "publishedAt": "2024-03-12T09:47:03Z",
      "title": "Russia reports Ukrainian drone strikes on targets deep inside its territory and a border incursion",
      "url": "https://apnews.com/27e3f102dfb361e39b979f030db17f8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f3f20f064f5451eb02e428573d15a2f/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Consumer prices in the United States picked up last month, a sign that inflation remains a persistent challenge for the Federal Reserve and for President Joe Biden’s re-election campaign, both of which are counting on a steady easing of price pressures this year.",
      "publishedAt": "2024-03-12T04:01:21Z",
      "title": "US inflation up again in February in latest sign that price pressures remain elevated",
      "url": "https://apnews.com/4ac316b6a435ef44c370ce7686da67c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1ea46e4b26a4656be36e3e138869ecc/2250.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — The scandal over Kate, Princess of Wales’ family snapshot — dubbed “photogate” — is a new chapter in the thorny relationship between the media and Britain’s royal family.",
      "publishedAt": "2024-03-12T15:46:16Z",
      "title": "Kate's 'photogate' scandal shows that relations between royals and the press rarely run smoothly",
      "url": "https://apnews.com/2470c605dcc9766748bab82d8683e02b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59f0e505a3834b64a95ab3d802dc14c6/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "MECHANICSBURG, Pa. (AP) — Jody Mikhail was a sophomore at Pennsylvania's Cumberland Valley High School when a poster for a new girls’ wrestling club caught her eye. So Mikhail, a senior now, tried the sport.",
      "publishedAt": "2024-03-12T14:12:45Z",
      "title": "Girls are falling in love with wrestling, the nation's fastest-growing high school sport",
      "url": "https://apnews.com/c1e18531cf36831e158282ea08ca9775",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bd2f33cd8fd4532bf784f6a96a90057/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}