{
  "articles": [
    {
      "author": "MATTHEW LEE",
      "description": "AQABA, Jordan (AP) — U.S. Secretary of State Antony Blinken said Saturday that American officials have been in direct contact with the Syrian rebel group that spearheaded the overthrow of President Bashar Assad’s government but is designated a foreign terrorist organization by the United States and others.",
      "publishedAt": "2024-12-14T15:44:36Z",
      "title": "US officials have been in direct contact with the Syrian rebel group that ousted Assad, Blinken says",
      "url": "https://apnews.com/5fcff887a74dc9ec36e483c0b601a8c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c80120ebebd8449abc6b4843f95c512f/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS and MIKE HOUSEHOLDER",
      "description": "DEARBORN, Mich. (AP) — Nizam Abazid is gleefully planning his first trip in decades to Syria, where he grew up. Rama Alhoussaini was only 6 years old when her family moved to the U.S., but she's excited about the prospect of introducing her three kids to relatives they've never met in person.",
      "publishedAt": "2024-12-14T05:05:04Z",
      "title": "The Detroit area's many Syrians are celebrating Assad's overthrow and planning long-delayed visits",
      "url": "https://apnews.com/6c3777579a708024e703fca3458623e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/452b89fda41842b3aa7da1d941225a2b/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s parliament on Saturday impeached President Yoon Suk Yeol over his stunning and short-lived martial law decree, a move that ended days of political paralysis but set up an intense debate over Yoon's fate, as jubilant crowds roared to celebrate another defiant moment in the country's resilient democracy.",
      "publishedAt": "2024-12-14T01:44:38Z",
      "title": "South Korea’s parliament votes to impeach President Yoon Suk Yeol over his martial law order",
      "url": "https://apnews.com/6432768aafc8b55be26215667e3c19d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/130fbc178f03497d8d45e30feee10412/3000.jpeg"
    },
    {
      "author": "TARA COPP and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President-elect Donald Trump will huddle with allies and a Republican cause célèbre at Saturday's Army-Navy football game, a chance to take in one of most stories rivalries in college sports while spotlighting his emerging national security team.",
      "publishedAt": "2024-12-14T14:16:38Z",
      "title": "Trump will attend the Army-Navy game alongside key allies, nominees and Daniel Penny",
      "url": "https://apnews.com/85da138b3ac130b211afc414bf43514a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd0cea137fce4696b98884a0da6c0ce8/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian drone strikes on southern Russia killed a 9-year-old boy and set fire to a major oil terminal, officials said Saturday, the day after Moscow launched a massive aerial attack on its neighbor that Ukrainian President Volodymyr Zelenskyy said was one of the heaviest bombardments of the country’s energy sector in the nearly three-year war.",
      "publishedAt": "2024-12-14T14:09:05Z",
      "title": "Ukrainian drones strike Russia as Kyiv reels from consecutive massive air attacks",
      "url": "https://apnews.com/b4968f78072239d0d114423337cefd88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a72f7631ab94235b5dbd254d7b4a704/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "TOMS RIVER, N.J. (AP) — Gov. Phil Murphy has asked the Biden administration to put more resources into an investigation of mysterious drone sightings that have been reported in New Jersey and nearby states.",
      "publishedAt": "2024-12-13T18:59:08Z",
      "title": "New Jersey governor wants more federal resources for probe into drone sightings",
      "url": "https://apnews.com/82f3d8bc816350dbfc0953e5de6063e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbc4b8b657f243b993e1aeb622d887d6/1920.jpeg"
    },
    {
      "author": "THOMAS ADAMSON",
      "description": "PARIS (AP) — The reopening of Notre Dame was a solemn celebration of cultural and spiritual renewal.",
      "publishedAt": "2024-12-14T07:04:15Z",
      "title": "Notre Dame reopening spectacle caps a stellar year for luxury house LVMH",
      "url": "https://apnews.com/0d8076d36ed655136666b74d2ee681ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7193085022594e72b4ea6e6eb382d75e/3000.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE",
      "description": "TBILISI, Georgia (AP) — Former soccer player Mikheil Kavelashvili became president of Georgia on Saturday, as the ruling party tightened its grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ruler Russia.",
      "publishedAt": "2024-12-14T05:23:30Z",
      "title": "Ex-soccer player Kavelashvili becomes Georgia's president in a blow to country's EU aspirations",
      "url": "https://apnews.com/3a7f5018879c77b6c596d312a163b79c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96617625cb954cef879905b0ef9d4770/1920.jpeg"
    },
    {
      "author": "MELISSA RAYWORTH",
      "description": "Last year, when Lauren Haydel began her first sober holiday season, she wondered how difficult it would be to avoid alcohol at family parties and celebrations with friends. She owns a boutique, Fleurty Girl, in New Orleans’ French Quarter, a neighborhood synonymous with drinking.",
      "publishedAt": "2024-12-14T05:12:44Z",
      "title": "Stay sober and have a jolly holiday season with these expert tips",
      "url": "https://apnews.com/c1a18cbf0090b5049224c3f5d578590b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1c3b7d3a17b4546853935b9642583fb/2100.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "A federal appeals court on Friday left in place a mid-January deadline in a federal law requiring TikTok to be sold or face a ban in the United States, rejecting a request made by the company to halt enforcement until the Supreme Court reviews its challenge of the statute.",
      "publishedAt": "2024-12-14T00:55:15Z",
      "title": "Court denies TikTok's request to halt enforcement of potential US ban until Supreme Court review",
      "url": "https://apnews.com/504a7b4a13184ab171415d3800017fa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/212fa50df473435fa576c5dbcd465c0f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}