{
  "articles": [
    {
      "author": "Amir-hussein Radjy",
      "description": "A month after Iran launched a crackdown on nationwide protests, widespread arrests are roiling the country. Reports of raids on homes and workplaces have come from major cities and rural towns alike, revealing a dragnet that has touched large swaths of Iranian society. University students, doctors, lawyers, teachers, actors, athletes and filmmakers have been swept up. Activists say those who are arrested are often held incommunicado for days or weeks and prevented from contacting family members or lawyers. The U.S.-based Human Rights Activists News Agency has put the number of arrests at more than 50,000 and the number of the deaths at more than 7,000.",
      "publishedAt": "2026-02-14T05:02:12Z",
      "title": "Widespread arrests roil Iran in aftermath of crushed protests",
      "url": "https://apnews.com/article/iran-protests-crackdown-arrests-9de7c65d17920dc43568d3f025fed2cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/25d79ce/2147483647/strip/true/crop/2675x1782+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fbe%2F967ebde839fe2a4118b354461a3c%2F1cc824a8e62d4bc8985971019d78d007"
    },
    {
      "author": null,
      "description": "U.S. Secretary of State Marco Rubio on Saturday emphasized the United States’ desire to preserve the trans-Atlantic alliance, declaring that it “will always be a child of Europe” at a conference where a rift with Washington’s European allies opened up a year ago. Rubio told the Munich Security Conference that the “euphoria” of the Western victory in the Cold War led to a dangerous delusion of triumph that is now threatening the very institutions that broke both the Nazi regime and the Soviet Union.",
      "publishedAt": "2026-02-14T08:41:32Z",
      "title": "Rubio expresses desire to maintain trans-Atlantic relations despite increasing rift",
      "url": "https://apnews.com/article/munich-security-conference-rubio-4a26cfa8ebb54643be98405e896433d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/d37bdf6/2147483647/strip/true/crop/7000x4664+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F28%2F5da9209d42a3d6f6c97dbf294da9%2Ffd3a682ac55f496594d53bc06e1ac1f1"
    },
    {
      "author": null,
      "description": "A Russian drone strike on the city of Odesa killed an elderly woman ahead of fresh U.S.-brokered peace talks. Ukrainian officials said Saturday a Russian drone hit a residential building in Odesa and killed an older woman. On Friday, Russian officials said a Ukrainian missile strike in Belgorod killed two people and wounded five. Meanwhile, another round of discussions between envoys from Russia and Ukraine will take place next on Tuesday and Wednesday in Geneva. The talks come as fighting grinds on along the front line, with Russia bombing Ukrainian cities and the power grid and Ukraine launching long-range drone attacks inside Russia.",
      "publishedAt": "2026-02-14T08:26:14Z",
      "title": "A Russian drone strike kills 1 in Odesa ahead of US-brokered peace talks in Geneva",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-drones-geneva-71097ecf70019070b7b83dd3bebe21cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The Swiss Foreign Ministry says Iran and the United States will hold a second round of talks over Tehran’s nuclear program this week. Oman — which welcomed a first round of indirect talks on Feb. 6 — will host the talks in Geneva. The ministry did not specify which days. U.S. President Donald Trump has warned Iran against any failure to reach an agreement, and has repeatedly threatened to use force to compel Tehran to agree to limit its nuclear program. Iran has insisted the program is for peaceful purposes. However, its officials increasingly threaten to pursue a weapon.",
      "publishedAt": "2026-02-14T19:32:18Z",
      "title": "US, Iran to hold new round of nuclear talks in Geneva this week, Swiss government says",
      "url": "https://apnews.com/article/iran-nuclear-talks-washington-geneva-bae109cfba67b4062dc8592d131fa112",
      "urlToImage": "https://dims.apnews.com/dims4/default/0946b36/2147483647/strip/true/crop/1280x853+0+42/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F9e%2F4c6060689844c6ba55ee2994a597%2Febdb60b21e73467396752d2567a74804"
    },
    {
      "author": "Sam Mednick, Samy Magdy",
      "description": "Doctors Without Borders says it has suspended some operations at one of Gaza's largest functioning hospitals after patients and staff said they witnessed armed, masked men in parts of the compound. The aid group said it suspended all noncritical medical operations at Nasser Hospital due to “security breaches” which posed “serious security threats to our teams and patients.” It was a rare announcement by an international organization about the presence of armed men in or near medical facilities in Gaza since the war began. Israel has struck hospitals on repeated occasions, accusing Hamas of operating in or around them.",
      "publishedAt": "2026-02-14T13:28:36Z",
      "title": "MSF suspends some work in Gaza due to presence of armed men at Nasser Hospital",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-02-14-2026-fce5aeb2f708e9461795db7edd783de6",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec37f56/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F02%2F6a2fc10189820e7767b256f80d9b%2F88b9b68048cd42f1aa672cbf7cb6502d"
    },
    {
      "author": "Jill Lawless",
      "description": "Five European countries say tests confirm Russian opposition leader Alexei Navalny was poisoned with a lethal toxin found in poison frogs, and they blame the Russian state. On Saturday, the U.K., France, Germany, Sweden, and the Netherlands said labs analyzed samples from Navalny and found epibatidine. They described it as a toxin found in poison dart frogs in South America. Navalny died two years ago. The five countries say the evidence points to Russia. They say only the Russian state has the means and motive to carry out the attack. They also say Russia shows disregard for international law.",
      "publishedAt": "2026-02-14T13:00:28Z",
      "title": "European nations say Alexei Navalny was poisoned, and blame the Russian state",
      "url": "https://apnews.com/article/russia-navalny-poisoned-europe-4d92cd67f29d37b74b0d4842ea686b03",
      "urlToImage": "https://dims.apnews.com/dims4/default/c23d3d2/2147483647/strip/true/crop/4704x3134+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F8b%2F62669d76c3a30793962497672a50%2F4b63ee2b84b047ff839694d9dcfccddb"
    },
    {
      "author": "Jim Morris, Rob Gillies",
      "description": "Canadian Prime Minister Mark Carney and the country’s opposition leaders paid tribute to the victims of one of the worst mass shootings in the country’s history at a vigil in the devastated northern British Columbia town. Carney and Conservative Opposition leader Pierre Poilievre joined hands during the community vigil. Carney named each of the six people killed at the school and said the mother and brother of the shooter who were killed also “deserve to be mourned.” British Columbia Premier David Eby said the students of the school won’t ever have to return to the building if they don’t want to. School shootings are rare in Canada, which has strict gun-control laws.",
      "publishedAt": "2026-02-14T02:58:44Z",
      "title": "Prime Minister Carney and Canada's main opposition leader hold hands during school shooting vigil",
      "url": "https://apnews.com/article/canada-school-shooting-vigil-carney-7d2d2ec8e302befe808f822432ed9a03",
      "urlToImage": "https://dims.apnews.com/dims4/default/e44ed51/2147483647/strip/true/crop/7337x4889+0+102/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F9e%2Feac3da4c09052e44de277f442dd1%2F056853ffbabc41dea8cb919071ef42a5"
    },
    {
      "author": null,
      "description": "The U.S. military says it has carried out another deadly strike on a vessel accused of trafficking drugs in the Caribbean Sea. U.S. Southern Command said Friday on social media that the boat “was transiting along known narco-trafficking routes in the Caribbean and was engaged in narco-trafficking operations.” It said the strike killed three people. A video linked to the post shows a boat moving through the water before exploding in flames. Friday’s attack raises the death toll from the Trump administration’s strikes on alleged drug boats to 133 people in at least 38 attacks carried out since early September in the Caribbean Sea and eastern Pacific Ocean.",
      "publishedAt": "2026-02-14T01:16:30Z",
      "title": "US military strikes another alleged drug boat in Caribbean",
      "url": "https://apnews.com/article/military-strikes-cartels-drug-boats-caribbean-cadab97919b92939ad069a05b567c00c",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f9ead9/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F1e%2F867fe0e8649ef905c1b27399cad9%2F77f75c663a1842faa73dba7255844b50"
    },
    {
      "author": "Rio Yamat, Ap Airlines, Travel Writer",
      "description": "A shutdown of the U.S. Department of Homeland Security has gone into effect. That includes the Transportation Security Administration, whose officers are responsible for screening passengers and bags at airports. Experts say mass flight cancellations like those seen during the 2025 shutdown are less likely this time because air traffic controllers are still getting paid. But TSA officers are required to stay on the job without pay during the Homeland Security shutdown that started on Saturday. Experts warn of long security lines if the shutdown drags on and more officers take unscheduled absences. Travel and airline industry groups warn the shutdown threatens to disrupt air travel as the busy spring break travel period approaches.",
      "publishedAt": "2026-02-14T05:05:37Z",
      "title": "What to know about US airports and security lines during DHS shutdown",
      "url": "https://apnews.com/article/dhs-shutdown-tsa-travel-airports-delays-ff8b225c6ff8d57172fd301a550057b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/9fc00b8/2147483647/strip/true/crop/4444x2961+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F5c%2F2f60f4213fb2d6cd384b791526b9%2Fa98091f4e86f44e6964144dabd32bd47"
    },
    {
      "author": "Jack Brook",
      "description": "The Trump administration announced this week that its immigration crackdown in Minnesota is ending. Minneapolis will now need to decide how to manage the makeshift memorial sites for two U.S. citizens killed by federal agents. Flowers, handwritten signs and artwork have amassed around the sites where Renee Good and Alex Pretti were fatally shot last month. A spokesperson for Minneapolis Mayor Jacob Frey says it was “too early” for the city to comment on the future of the memorial sites. It took the city five years to determine plans for a permanent memorial site for George Floyd after he was murdered by a police officer in 2020.",
      "publishedAt": "2026-02-14T05:04:13Z",
      "title": "Memorials remain in Minneapolis to 2 people killed by federal officers",
      "url": "https://apnews.com/article/minneapolis-renee-good-alex-pretti-memorial-114fc6189d63adb8cc06d275929652eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/b86d2b3/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Fbd%2Fd0bb06c697a5af750b933b9ce8c8%2F34badf691e7b4b86aecf7c5b187730dd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}