{
  "articles": [
    {
      "author": "TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — The Israeli government formally declared war and gave the green light for “significant military steps” to retaliate against Hamas for its surprise attack, as the military labored into Monday to crush fighters still in southern towns and intensified its bombardment of the Gaza Strip.",
      "publishedAt": "2023-10-08T04:17:32Z",
      "title": "Israel declares war, bombards Gaza and battles to dislodge Hamas fighters after surprise attack",
      "url": "https://apnews.com/ca7903976387cfc1e1011ce9ea805a71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3324d2deae794ef1ace6fcdb3b14f9e6/1920.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Men dug through rubble with their bare hands and shovels in western Afghanistan Sunday in desperate attempts to pull victims from the wreckage left by powerful earthquakes that killed at least 2,000 people.",
      "publishedAt": "2023-10-08T08:41:41Z",
      "title": "Desperate people dig out dead and injured from Afghanistan earthquakes that killed at least 2,000",
      "url": "https://apnews.com/155c12cd085d7aa8ee1fef5882e120f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/976b40aaf3004f0480faa2f05cf6f11f/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump is again testing the power of his endorsement.With an early morning social media post on Friday, Trump inserted himself into the chaotic race to replace Kevin McCarthy as House speaker by backing Ohio Rep.",
      "publishedAt": "2023-10-07T04:47:17Z",
      "title": "Trump is inserting himself into the messy race to become the next House speaker. Will it matter?",
      "url": "https://apnews.com/77b4f760ff5653344b982fbabeac6ec7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2104e3e52b54577ab6240b928583e1c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The ad sounds like something out of the GOP 2024 playbook, trumpeting a senator’s work with Republicans to crack down on the flow of fentanyl and other illegal drugs into the U.S., getting tough on Chinese interests helping smugglers, and noting how he \"wrote a bill signed by Donald Trump to increase funding for Border Patrol.”",
      "publishedAt": "2023-10-07T04:59:52Z",
      "title": "Biden faces more criticism about the US-Mexico border, one of his biggest problems heading into 2024",
      "url": "https://apnews.com/646f656dbfecf268f0cb182c74ad47ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a0bf698d9042b2982932e779f5e0af/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — The area around the Maui town largely destroyed by wildfire two months ago began welcoming back travelers on Sunday after the mayor and Hawaii’s governor pushed ahead to restart tourism to boost the economy despite opposition from some Lahaina residents.",
      "publishedAt": "2023-10-08T04:05:58Z",
      "title": "Tourism resumes in West Maui near Lahaina as hotels and timeshare properties welcome visitors",
      "url": "https://apnews.com/d66e6528b8c61203a3110214869314ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/547957f8772142b6aced5d091f25dbd8/3000.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom rejected a bill on Sunday that would have made free condoms available all public high school students, arguing it was too expensive for a state with a budget deficit of more than $30 billion.",
      "publishedAt": "2023-10-08T23:04:05Z",
      "title": "California governor vetoes bill to make free condoms available for high school students, citing cost",
      "url": "https://apnews.com/bb3f8678b662face00eed64595d0ca77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33d7982b788d4d769b7b4d56d8e3abc0/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Union workers at Mack Trucks have voted down a tentative five-year contract agreement reached with the company and plan to strike at 7 a.m. Monday, the United Auto Workers union says.",
      "publishedAt": "2023-10-09T01:39:32Z",
      "title": "Workers at Mack Trucks reject tentative contract deal and will go on strike early Monday",
      "url": "https://apnews.com/31028457605436f0c142617b1b5cf838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91c8d9aed49c46dda73dc86d123cb816/3000.jpeg"
    },
    {
      "author": "MAE ANDERSON",
      "description": "NEW YORK (AP) — The Lexington Candy Shop in New York City has served burgers, fries and shakes to hungry patrons for decades. Last remodeled in 1948, the diner is the definition of old-fashioned.But that hasn't stopped it from getting a wave of new fans.",
      "publishedAt": "2023-10-08T12:06:38Z",
      "title": "From Coke floats to Cronuts, going viral can have a lasting effect on a small business",
      "url": "https://apnews.com/807765e8dd50c01c168c308965a5336e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10b0c916af4b41e1a23213cf1d81d32c/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "CHICAGO (AP) — Alexander watches Paw Patrol with fervor, bowls his baby brother over with hugs and does everything with gusto.What the 3-year-old West Chicago toddler can’t do yet is speak more than a few words.",
      "publishedAt": "2023-10-08T04:09:57Z",
      "title": "A workforce crisis is damaging families' access to therapies for babies with developmental delays",
      "url": "https://apnews.com/fdf1c65ef0b3c928326385e498ff72f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff2440a921dd49ae8643fc5a80391c36/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — “The Exorcist: Believer” drove out all foes at the box office, but its numbers didn't entirely make heads spin. Facing competition from no major new releases, the latest resurrection of the demonic franchise brought in $27.2 million in North America in its opening weekend for Universal Pictures and Blumhouse Productions, according to studio estimates Sunday.",
      "publishedAt": "2023-10-08T18:04:30Z",
      "title": "'The Exorcist: Believer' takes possession of box office with $27.2 million opening",
      "url": "https://apnews.com/7e754bc5886a1ed2e0cd66311a4d45ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3979f1f0e6c47cb9a55b449fae8e8f5/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}