{
  "articles": [
    {
      "author": "GRAHAM LEE BREWER",
      "description": "NORMAN, Okla. (AP) — President Joe Biden said he will formally apologize on Friday for the country’s role in forcing Indigenous children for over 150 years into boarding schools, where many were physically, emotionally and sexually abused, and more than 950 died.",
      "publishedAt": "2024-10-24T18:38:21Z",
      "title": "President Biden to apologize for 150-year Indian boarding school policy",
      "url": "https://apnews.com/701872132d7f191973d54cd05286ef75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2be15a715f91489fb8065ece510dc0d3/2000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, FARNOUSH AMIRI and FATMA KHALED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a school where displaced people were sheltering in the central Gaza Strip killed at least 17 people on Thursday, nearly all women and children, Palestinian medical officials said.",
      "publishedAt": "2024-10-24T10:28:17Z",
      "title": "Israeli strike on Gaza shelter kills 17 as Blinken says cease-fire talks will resume",
      "url": "https://apnews.com/ab2b634abca70923712a655cd097a421",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb11aa5c09324a3ab104ade0585ae3e7/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA and DEE-ANN DURBIN",
      "description": "A California-based produce company was the source of fresh onions linked to a deadly E. coli food poisoning outbreak at McDonald’s, officials with the restaurant chain said Thursday.",
      "publishedAt": "2024-10-24T20:40:24Z",
      "title": "McDonald's says onions from California-based produce company linked to deadly E. coli outbreak",
      "url": "https://apnews.com/2bc3fc2d4198d9a5bad52c0028316165",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbb750edea63475a9bcfc3334fdca8e5/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO, JAIMIE DING and CHRISTOPHER WEBER",
      "description": "LOS ANGELES (AP) — Prosecutors will recommend Erik and Lyle Menendez be resentenced for the 1989 killings of their parents in the family’s Beverly Hills home, providing the brothers with a chance at freedom after 34 years behind bars.",
      "publishedAt": "2024-10-24T17:07:03Z",
      "title": "Prosecutors seek resentencing for Erik and Lyle Menendez in 1989 killings of their parents",
      "url": "https://apnews.com/cdd1a0158856b9f5709b07cf469229ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c393e4507f64c8bb2f0b4422bc19f7f/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — The most far-reaching of Ohio’s laws restricting abortion was struck down on Thursday by a county judge who said last year’s voter-approved amendment enshrining reproductive rights renders the so-called heartbeat law unconstitutional.",
      "publishedAt": "2024-10-24T20:50:42Z",
      "title": "County judge strikes down Ohio abortion ban, citing voter-approved reproductive rights amendment",
      "url": "https://apnews.com/e83ad0f1af11ded06d73d900bb240a04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dad623a83fd046b291a79fea03a6d424/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "Washington (AP) — Vice President Kamala Harris is enlisting some of her most high-profile surrogates in the closing days of the campaign, hoping those names will help energize her supporters to vote early in the 2024 election.",
      "publishedAt": "2024-10-24T19:28:09Z",
      "title": "Harris leaning on some of the biggest names in Democratic politics to close out campaign",
      "url": "https://apnews.com/1ef1c592180db8fcbe0d0480248f9fe6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08307dfc84e64d8fac8cebf5fe92eeb1/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The last time Donald Trump ran for president, the lawyers most directly involved in his efforts to overturn the election wound up sanctioned, criminally prosecuted or even sued for millions of dollars.",
      "publishedAt": "2024-10-24T04:08:59Z",
      "title": "The RNC is rebuilding its legal operation after Trump allies' failed effort to undo the 2020 race",
      "url": "https://apnews.com/13d24822cc4899e5934a07661fe649e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5188ae37741a4996bfcc60323ee699fb/2717.jpeg"
    },
    {
      "author": "DAN MERICA and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump said Thursday that if he wins the White House, he will fire special counsel Jack Smith “within two seconds” of taking office.",
      "publishedAt": "2024-10-24T16:37:58Z",
      "title": "Trump says if he takes office, he'll fire special counsel Jack Smith 'within 2 seconds'",
      "url": "https://apnews.com/b0d3d24286fbe0c461a901a33ec78d62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/181b141ec7e145e199535b0371a06ceb/3000.jpeg"
    },
    {
      "author": "ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina's police raided the Buenos Aires hotel where ex-One Direction singer Liam Payne stayed before dying last week after falling from a third-floor balcony, a government official said Thursday.",
      "publishedAt": "2024-10-24T18:43:26Z",
      "title": "Argentine police raid the Buenos Aires hotel where One Direction’s Liam Payne died",
      "url": "https://apnews.com/0446b9bae8582c414b464a986a80055a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68d65882863943a2820db24768d34443/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — An international conference for Lebanon in Paris on Thursday raised $1 billion in pledges for humanitarian aid and military support to help the country where war between Hezbollah militants and Israel has displaced a million people, killed over 2,500, and deepened an economic crisis, French organizers said.",
      "publishedAt": "2024-10-24T04:15:58Z",
      "title": "The Paris conference for Lebanon raises $1 billion in pledges for humanitarian and military support",
      "url": "https://apnews.com/30a97f88d2ec8dc138385d18a31dbb69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7489d2f670ed4a0fb67a5ea3f1ccbff6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}