{
  "articles": [
    {
      "author": null,
      "description": "A divided Supreme Court has ruled that individual judges lack the authority to grant nationwide injunctions, but the decision leaves unclear the fate of President Donald Trump’s restrictions on birthright citizenship. The outcome Friday was a victory for Trump, who has complained about individual judges throwing up obstacles to his agenda. But a conservative majority left open the possibility that the birthright citizenship changes could remain blocked nationwide. The Republican president’s order would deny citizenship to U.S.-born children of people who are in the country illegally.",
      "publishedAt": "2025-06-27T14:18:32Z",
      "title": "Supreme Court leaves fate of Trump birthright citizenship order unclear",
      "url": "https://apnews.com/article/supreme-court-trump-birthright-citizenship-immigration-9da9e11d83f2fd3cbf95e6a733651daf",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": null,
      "description": "The Supreme Court has ruled that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks. The justices Friday reversed lower-court rulings in favor of the Montgomery County school system in suburban Washington. The high court ruled that the schools likely could not require elementary school children to sit through lessons involving the books if parents expressed religious objections to the material. The decision was not a final ruling in the case, but the justices strongly suggested that the parents will win in the end. The court ruled that policies like the one at issue in the case are subjected to the strictest level of review, nearly always dooming them.",
      "publishedAt": "2025-06-27T14:53:33Z",
      "title": "Supreme Court says Maryland parents can pull kids from LGBTQ book lessons",
      "url": "https://apnews.com/article/supreme-court-lgbtq-books-religion-maryland-schools-c0b0fb4b96531636fcb98b08aabc3cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b9e9ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fb4%2F28aba2883a2a7268895fa56644b4%2Fee48c15dd5604f6281a7266388de25da"
    },
    {
      "author": null,
      "description": "The Supreme Court has upheld a Texas law aimed at blocking kids from seeing pornography online. The high court handed down the ruling Friday. More than a dozen states have passed similar age verification laws as smartphones and other devices make it easier to access online porn, including hardcore obscene material. An industry trade group challenged the Texas law after the adult-content site Pornhub shut down in several states. The group said the law puts an unfair burden on adults by requiring them to submit personal information that could be vulnerable to hacking or tracking. Texas says modern age checks are safe and important for protecting children.",
      "publishedAt": "2025-06-27T15:17:35Z",
      "title": "Supreme Court upholds Texas law aimed at blocking kids from seeing porn",
      "url": "https://apnews.com/article/supreme-court-porn-age-verification-texas-12a73197796fe8c4bef0d888259543cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/0286a76/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F6a%2F5e969b9a35314316fae4bc715651%2F52f3a60b8f2a440e84f318d4ed38ac3e"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump says the U.S. has signed an agreement with China on trade and expects to soon have a deal with India. Commerce Secretary Howard Lutnick told Bloomberg TV that the deal was signed earlier this week, but he gave no details. He said Trump is “the dealmaker” and wanted to “close these deals himself.” China has not announced any agreements, but it has said it was speeding up approvals of exports of rare earths, materials used in high-tech products such as electric vehicles. The deal mentioned by Trump followed meetings in London where officials said they had set a framework for resolving trade disputes.",
      "publishedAt": "2025-06-27T06:04:51Z",
      "title": "Trump says US has signed a deal with China on trade, without giving details",
      "url": "https://apnews.com/article/china-trade-earths-tariffs-trump-463ae8d6ccba15b56c7d4d31d3fc42a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/3343bf3/2147483647/strip/true/crop/3943x2218+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F6f%2Fb6f769108f2aab05f77edb1e49cb%2Fecf14e435f3d4343b20a557e7e101371"
    },
    {
      "author": null,
      "description": "Iran's top diplomat says new nuclear talks with the U.S. are unlikely soon, citing complications from recent American military strikes. Foreign Minister Abbas Araghchi left open the possibility that his country would again enter talks on its nuclear program during an interview on Iranian state television broadcast late Thursday. But he suggested it would not be anytime soon. On Sunday, the U.S. bombed three key Iranian nuclear facilities. Araghchi acknowledged that “the level of damage is high.\" Iran retaliated Monday by firing missiles at a U.S. base in Qatar, though no casualties were reported.",
      "publishedAt": "2025-06-27T09:09:05Z",
      "title": "Iran's top diplomat says nuclear talks with the US complicated by strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-27-2025-e30d8ae4e3c6d13e4cfb562c35dd744b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4a9119/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2Fed%2F52fd7537c58e8503bfa62c51d777%2F45ee2cf35a2647498d757c325a46800d"
    },
    {
      "author": null,
      "description": "President Donald Trump's unconventional approach to clemency has spread hope among federal prisoners and formerly incarcerated people around the United States, prompting a wave of petitions carefully crafted to capture his attention. Like other presidents, Trump has drawn criticism for granting pardons and commutations to political allies. But legal scholars say the Republican president also has cast aside the traditional criteria and a clemency process historically overseen by nonpolitical Justice Department personnel. Trump has pardoned and commuted the sentences of more than 1,600 people since January. Administration officials say Trump decides on clemency requests after they’re vetted by the White House Counsel’s Office, the White House pardon czar and the Justice Department.",
      "publishedAt": "2025-06-27T11:04:44Z",
      "title": "Pardon applications are being carefully crafted with Trump in mind",
      "url": "https://apnews.com/article/trump-pardons-clemency-felons-campaign-donors-c13bb01491b3d5956ff48572983302fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/de050d9/2147483647/strip/true/crop/3031x1705+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F50%2Fb86a81f0dda7039b0ac74dfeaf1d%2F55f021f7977845e5b07075b159a9bf64"
    },
    {
      "author": null,
      "description": "A defense lawyer says in his closing argument that the government “badly exaggerated” its evidence against music mogul Sean “Diddy” Combs, turning the swinger lifestyle, drugs and threesomes into a racketeering conspiracy. The lawyer, Marc Agnifilo, was expected to spend several hours Friday trying to convince the New York jury to exonerate his 55-year-old client of charges including sex trafficking and racketeering conspiracy. A prosecutor on Thursday had labeled Combs as a serial sex trafficker who manipulated his girlfriends over a 20-year period to participate in sexual performances with male escorts that Combs filmed.",
      "publishedAt": "2025-06-27T14:28:37Z",
      "title": "Sean 'Diddy' Combs’ lawyer mocks sex trafficking case in closing, says charges 'badly exaggerated'",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-closings-4fcd417c10b276d0c4efca95c4e5d65d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3a62e9/2147483647/strip/true/crop/2396x1348+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F2c%2Fab7c01fca4b716c9e1dfebac6abd%2F937ad5043233412b9f312a2b5541d372"
    },
    {
      "author": null,
      "description": "Federal prosecutors have told a judge in Maryland the government plans to initiate deportation proceedings against Kilmar Abrego Garcia and to deport him to a country that is not his native El Salvador upon his release from a Tennessee jail. But the prosecutors Thursday also said that they would comply with all court orders and that their plans are not imminent. Attorneys for Abrego Garcia earlier asked the federal judge to order his return to Maryland when he is released from jail in Tennessee, an arrangement that would prevent likely attempts by immigration officials to quickly deport Abrego Garcia.",
      "publishedAt": "2025-06-26T17:36:06Z",
      "title": "Abrego Garcia's lawyers ask for him to go to Maryland to prevent deportation",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-maryland-tennessee-charges-deportation-c96844906793b35a80f9bbb4afa07e94",
      "urlToImage": "https://dims.apnews.com/dims4/default/1aa78ce/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F79%2F8fa7b9d7e8cd7f9955b65943098b%2F6eec930538d44fc78ef6fcfd51b346b2"
    },
    {
      "author": null,
      "description": "Global shares are mostly higher as the week winds down with the Israel-Iran ceasefire still in place and news that China and the U.S. have made progress on a trade deal. Officials gave no details about the deal that President Donald Trump said was signed earlier in the week. On Thursday, the S&P 500 ended just 0.05% below its all-time closing high set in February. The Dow Jones Industrial Average rallied 0.9%, and the Nasdaq gained 1%. Upbeat reports on the U.S. economy, including jobless claims and orders for long-lasting manufactured goods, also supported investor sentiment.",
      "publishedAt": "2025-06-27T04:12:21Z",
      "title": "Global shares are mostly higher after US stocks rise to the brink of a record",
      "url": "https://apnews.com/article/stocks-markets-china-tariffs-rates-53ddd3e8d11be4d09419418b4f141382",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1f395e/2147483647/strip/true/crop/3462x1947+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fb3%2F8e6a764391e5c2060c8399337387%2F35a2272fca56413d92bcd4c6c4a79a46"
    },
    {
      "author": null,
      "description": "The sky itself is no limit for billionaire Jeff Bezos and fiancée Lauren Sánchez. They have traveled into space, and expectations are just about as high for their wedding in Venice. The team of the world’s fourth-richest man has kept details under wraps. Still, whispers point to events spread across the lagoon city, adding complexity and cost. On Thursday, dozens of private jets touched down at Venice’s airport as yachts pulled into the city’s famed waterways. Aboard were athletes, celebrities, influencers and business leaders, converging to revel in extravagance that is as much a testament to the couple’s love as to their extraordinary wealth. The nuptials have also become a lightning rod for protests.",
      "publishedAt": "2025-06-27T04:05:23Z",
      "title": "Jeff Bezos' wedding brings celebrities and glitterati to Venice",
      "url": "https://apnews.com/article/venice-bezos-sanchez-wedding-amazon-cd8a6472407ce2f4c1d9e111db9beab9",
      "urlToImage": "https://dims.apnews.com/dims4/default/29e9e1b/2147483647/strip/true/crop/2934x1650+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F40%2F0a04d31cf305d2cbcef4c0ce6dc0%2Fcb10d01ac42740f4924caf45fa6d3b44"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}