{
  "articles": [
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and TERRY SPENCER",
      "description": "FORT PIERCE, Fla. (AP) — A federal judge on Thursday rejected one bid by Donald Trump to throw out out his classified documents criminal case, and appeared skeptical during hours of arguments of a separate effort to scuttle the prosecution ahead of trial.",
      "publishedAt": "2024-03-14T04:09:00Z",
      "title": "Judge rejects bid by Donald Trump to throw out classified documents case on constitutional grounds",
      "url": "https://apnews.com/200d4c73d7c7dd75d9c9d878b77d05ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "PONTIAC, Mich. (AP) — The father of a Michigan school shooter was found guilty of involuntary manslaughter Thursday, a second conviction against the teen’s parents who were accused of failing to secure a gun at home and doing nothing to address acute signs of his mental turmoil.",
      "publishedAt": "2024-03-14T05:09:08Z",
      "title": "James Crumbley, who bought gun used by son to kill 4 students, guilty of manslaughter in Michigan",
      "url": "https://apnews.com/d13192e4057ec00836e4ce99c17bd375",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c06e15bc52ac48bc91ed64032ece1d66/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and AARON KESSLER",
      "description": "WASHINGTON (AP) — For Republicans eager to regain the Senate majority this year, Ohio offers a prime opportunity to pick up a critical seat.But ahead of Tuesday's primary election, there's mounting anxiety inside the GOP that Bernie Moreno may emerge with the nomination.",
      "publishedAt": "2024-03-14T23:30:45Z",
      "title": "Trump-backed Senate candidate faces GOP worries that he could be linked to adult website profile",
      "url": "https://apnews.com/09e34f6331708c192c89d7c1727c2458",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfc7fadd685849deae3655017a42ec42/2223.jpeg"
    },
    {
      "author": null,
      "description": "MADISON, Ind. (AP) — The Indiana State Police said there are “many significant injuries” after a tornado tore through the community of Winchester on Thursday, part of a storm system that also unleashed suspected twisters that damaged homes and businesses in parts of Ohio and Kentucky.",
      "publishedAt": "2024-03-14T21:35:40Z",
      "title": "Police say 'many significant injuries' after tornado tears through Indiana community",
      "url": "https://apnews.com/bc0b02faf7a67cb307fae34fa7dda597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2db5cbfd239421cadffa902e519b9dc/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO and MICHELLE CHAPMAN",
      "description": "Former Treasury Secretary Steven Mnuchin said Thursday that he will put together an investor group to buy TikTok after the House passed a bill that would ban the popular video app in the U.S.",
      "publishedAt": "2024-03-14T13:05:09Z",
      "title": "Former Treasury Secretary Steve Mnuchin says he's putting together investor group to buy TikTok",
      "url": "https://apnews.com/ffdf37776e63a09bb6966d741df7093b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c132bd4a62f94ddf912df7fd06970e80/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — New York prosecutors said Thursday they are open to delaying the start of Donald Trump's hush-money criminal trial by a month “in an abundance of caution” to give the former president's lawyers time to review evidence they only recently obtained from a previous federal investigation into the matter.",
      "publishedAt": "2024-03-14T19:26:57Z",
      "title": "Prosecutors say they're open to delaying Donald Trump's March 25 hush-money trial for a month",
      "url": "https://apnews.com/0ad15520f3f9779425d1cb6077e8c11c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d72ddf41bc64d0598b26373d43d50d3/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Voters headed to the polls in Russia on Friday for a three-day presidential election that is all but certain to extend President Vladimir Putin’s rule by six more years after he stifled dissent.",
      "publishedAt": "2024-03-14T20:08:48Z",
      "title": "Russians are voting in an election that holds little suspense after Putin crushed dissent",
      "url": "https://apnews.com/227e65cb2a3f2c4cfdb58a9525fbe884",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/816123b8e9684063a0356ea398d32de9/3000.jpeg"
    },
    {
      "author": "BERT WILKINSON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A plan to create a transitional presidential council is moving forward after a majority of Haitian parties and coalitions submitted the names of those charged with finding new leaders for the country, Caribbean officials said Thursday.",
      "publishedAt": "2024-03-14T17:34:42Z",
      "title": "A plan to find new leadership for Haiti is moving forward, Caribbean officials say",
      "url": "https://apnews.com/442ae5ac6eeab904ceaaa23e7672e6f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffc6e7ce4afc4ece8c5d269f1b66e59d/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — A major deadline under the half-century-old War Powers Resolution came this week for President Joe Biden to obtain Congress' approval to keep waging his military campaign against Yemen's Houthis, in line with its sole authority under the U.S.",
      "publishedAt": "2024-03-14T18:50:27Z",
      "title": "Middle East conflicts revive clash between the president and Congress over war powers",
      "url": "https://apnews.com/c9cfce9a874fbc520ddcc4ef182bf63a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31f5747452d24997a17423aa31dcecbd/3000.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "Stanford has fired men's basketball coach Jerod Haase after he finished his eighth season at the school without a single NCAA Tournament appearance.Athletic director Bernard Muir announced the decision on Thursday night, shortly after the Cardinal finished a second straight losing season with a 79-62 loss to No.",
      "publishedAt": "2024-03-15T03:26:04Z",
      "title": "Stanford fires men's basketball coach Jerod Haase after 8 seasons",
      "url": "https://apnews.com/5c89db132017a2231e30065c1507d9bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6556706d94e7406188cebe4276b17107/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}