{
  "articles": [
    {
      "author": "ZEKE MILLER, WILL WEISSERT and JILL COLVIN",
      "description": "WEST PALM BEACH, Fla. (AP) — Donald Trump spent his first day as president-elect receiving congratulatory phone calls from his defeated opponent, world leaders and President Joe Biden as he began the process of turning his election victory into a government.",
      "publishedAt": "2024-11-06T20:58:12Z",
      "title": "Trump receives congratulations and an invitation to the White House as Biden nudges on transition",
      "url": "https://apnews.com/f33e3d9f1647ee62709046993ffa082a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/191427a8518a4877965e40abc3361f7f/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, DARLENE SUPERVILLE and MATT BROWN",
      "description": "WASHINGTON (AP) — Faced with a sweeping rejection by American voters, Kamala Harris conceded the presidential election to Donald Trump on Wednesday and encouraged supporters to continue fighting for their vision of the country.",
      "publishedAt": "2024-11-06T17:12:57Z",
      "title": "Harris says nation must accept election results while urging supporters to keep fighting",
      "url": "https://apnews.com/ddeae9fb378530159201ef4196cba9b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcef89f168e0474fa2ca6b52494eeaf1/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The U.S. House majority hung in the balance Wednesday, teetering between Republican control that would usher in a new era of unified GOP governance in Washington or a flip to Democrats as a last line of resistance to a Trump second-term White House agenda.",
      "publishedAt": "2024-11-06T23:54:45Z",
      "title": "Control of the US House hangs in the balance with enormous implications for Trump's agenda",
      "url": "https://apnews.com/9a38fb935f94ac1e3f5cdcef621a39ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8a1c393652249eb9dfcc6059f3d3528/1920.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE and JOCELYN NOVECK",
      "description": "Voters had the chance this election to break the highest glass ceiling in American politics by electing Kamala Harris the nation’s first female president.",
      "publishedAt": "2024-11-06T19:33:47Z",
      "title": "With Trump's win, some women wonder: Will the US ever see a female president?",
      "url": "https://apnews.com/ab67e88970af6677c27238a509516981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9c0d0f7a274bf1b16d0e4f656f7d60/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and GEOFF MULVIHILL",
      "description": "WASHINGTON (AP) — Abortion rights advocates prevailed on seven ballot measures across the U.S.",
      "publishedAt": "2024-11-06T18:37:42Z",
      "title": "Abortion rights amendment's passage triggers new legal battle in Missouri",
      "url": "https://apnews.com/b258954f7600442dc25221685eef37d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/267db5b68a774cbe89e865a013824716/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The head of the U.N. agency for Palestinian refugees urged the world Wednesday to save it from an Israeli ban that would have “disastrous consequences” for millions of people caught up in the war in Gaza.",
      "publishedAt": "2024-11-06T23:14:47Z",
      "title": "UN agency for Palestinian refugees urges world to save it from Israeli ban",
      "url": "https://apnews.com/5fb2257786dab44046c1e8db4af9e68c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/789fd352de5a4fc28761a1841f06e148/3000.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Cuba was left reeling Thursday after a fierce Category 3 hurricane ripped across the island and knocked out the country’s power grid.",
      "publishedAt": "2024-11-07T04:15:52Z",
      "title": "Cuba left reeling after Category 3 hurricane ravages island and knocks out power grid",
      "url": "https://apnews.com/fc83c4db8e13b9da1a3fa7ec5b6f3319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfb2004980bd4e5dab61353f1c8f7e1d/1920.jpeg"
    },
    {
      "author": "MARCIO J. SANCHEZ, CHRISTOPHER WEBER and STEFANIE DAZIO",
      "description": "CAMARILLO, Calif. (AP) — California was lashed by powerful winds Wednesday that fed a fast-moving wildfire, which destroyed dozens of homes and forced thousands of residents to flee as forecasters warned of the potential for “extreme and life-threatening” blazes.",
      "publishedAt": "2024-11-06T16:13:20Z",
      "title": "Thousands ordered to evacuate as powerful wind-fed wildfire burns homes in Southern California",
      "url": "https://apnews.com/36ff3257749a0e5bbc870863a9da68a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05fa638672344516821e742f0edb77df/1920.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "CHICAGO (AP) — For the second year in a row, Earth will almost certainly be the hottest it's ever been. And for the first time, the globe this year reached more than 1.5 degrees Celsius (2.7 degrees Fahrenheit) of warming compared to the pre-industrial average, the European climate agency Copernicus said Thursday.",
      "publishedAt": "2024-11-07T03:04:27Z",
      "title": "European climate agency says this will likely be the hottest year on record -- again",
      "url": "https://apnews.com/92c46dfd01133f14c437c5d2bf5a5f8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a8fea1aa29c4712a64f3619f915dac2/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — A military judge has ruled that plea agreements struck by alleged Sept. 11 mastermind Khalid Sheikh Mohammed and two co-defendants are valid, voiding an order by Defense Secretary Lloyd Austin to throw out the deals, a government official said Wednesday.",
      "publishedAt": "2024-11-07T01:25:14Z",
      "title": "Plea deals revived for alleged 9/11 mastermind Khalid Sheikh Mohammed and others",
      "url": "https://apnews.com/073c3455e27ecbfd0f7dd524ccffdef3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4a55b837a094879af8c14b034243602/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}