{
  "articles": [
    {
      "author": "Mary Clare Jalonick, Kevin Freking, Lisa Mascaro",
      "description": "Senate Democrats are poised to block legislation that would fund the Department of Homeland Security and several other agencies on Thursday. That would bring the government a step closer to a partial shutdown if Republicans and the White House do not agree to new restrictions on President Donald Trump’s surge of immigration enforcement. As the country reels from the deaths of two protesters at the hands of federal agents in Minneapolis, irate Senate Democrats laid out a list of demands Wednesday, including that officers take off their masks and identify themselves and obtain warrants for arrest.",
      "publishedAt": "2026-01-29T05:34:50Z",
      "title": "Democrats poised to trigger government shutdown over ICE reform",
      "url": "https://apnews.com/article/senate-democrats-budget-shutdown-trump-homeland-security-5e6788e433e51399c8aa4399035aee22",
      "urlToImage": "https://dims.apnews.com/dims4/default/90bdea3/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F45%2F5ebc78b72f468d7ec4d555217983%2Ff5b38bc5ffad4dae83a13d12f5dc2880"
    },
    {
      "author": null,
      "description": "Venezuela's legislature has approved opening the nation's oil sector to privatization. This decision reverses a key principle of the socialist movement that has ruled for over two decades. The National Assembly approved the energy industry law overhaul on Thursday. This move comes less than a month after the U.S. military seized then-President Nicolás Maduro in Venezuela’s capital. The bill now awaits the signature of acting President Delcy Rodríguez. She proposed the changes after U.S. President Donald Trump announced plans to take control of Venezuela’s oil exports and attract foreign investment to revitalize the industry.",
      "publishedAt": "2026-01-29T21:04:46Z",
      "title": "Venezuelan lawmakers approve easing state control of oil industry",
      "url": "https://apnews.com/article/venezuela-oil-reform-delcy-rodriguez-5784394afdc3ee0017d2f41427253fd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e41b2b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2F44%2Faead700e78fb423304d9d8edccdc%2Ff5143b1d863f494fbf7e91337c7abe8b"
    },
    {
      "author": null,
      "description": "President Donald Trump’s border czar Tom Homan says immigration enforcement will reduce the number of officers in Minnesota. Homan suggested during a news conference Thursday that a drawdown would happen only after ‘cooperation’ from state officials. Trump sent Homan to Minnesota in the wake of the Saturday fatal shooting of a protester at the hands of a federal immigration officer. Homan doubled down on the need for local jails to alert Immigration and Customs Enforcement to people in their custody who ICE can remove from the country.",
      "publishedAt": "2026-01-29T14:08:50Z",
      "title": "Homan: Drawdown in Minnesota but only after ‘cooperation’",
      "url": "https://apnews.com/article/homan-minneapolis-immigration-enforcement-0d559bf53b630d7cc525fd3219f430ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The Justice Department has charged a man who squirted apple cider vinegar on Democratic U.S. Rep. Ilhan Omar at an event in Minneapolis. The man arrested for Tuesday’s attack, Anthony Kazmierczak, faces charge of forcibly assaulting, opposing, impeding and intimidating Omar. That's according to court papers filed in federal court. An affidavit says suthorities determined the substance was water and apple cider vinegar. Kazmierczak has a criminal history and has made online posts supportive of President Donald Trump, a Republican. It's unclear if Kazmierczak has an attorney.",
      "publishedAt": "2026-01-29T18:14:42Z",
      "title": "Man who squirted vinegar on Rep. Ilhan Omar is charged",
      "url": "https://apnews.com/article/ihan-omar-vinegar-attack-minneapolis-385a30eaf6acc40d6ba5c6c45c09304d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3812629/2147483647/strip/true/crop/4457x2970+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F00%2F70f02d66366af660c76330c6a6a0%2F1dd379f5be2a4b2bb85299c3a55753dd"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump has held his first Cabinet meeting of 2026, focusing on the economy, housing, energy, health initiatives and drug prices. He painted a positive picture of his administration's accomplishments, but some claims were exaggerated. Trump mentioned $18 trillion in investments, but evidence suggests this figure is inflated. The White House website lists a lower number, $9.6 trillion, which includes commitments from the Biden era. On housing, claims of a sharp rise in home sales are overstated. The National Association of Realtors reported only a 1.4% increase in December. Additionally, Trump's statements on California wildfires and water supply were inaccurate.",
      "publishedAt": "2026-01-29T22:47:35Z",
      "title": "False and misleading claims from Trump's Cabinet meeting",
      "url": "https://apnews.com/article/fact-check-trump-cabinet-economy-housing-energy-health-california-f4b4fb985300724a7e717863626e5506",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f59d5d/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F54%2Fea5199d6a58fc2e2818a1e958c0e%2F0975fbc5cb054e38a19d9d8feecf5ab1"
    },
    {
      "author": "John O'connor",
      "description": "A former Illinois sheriff’s deputy has been sentenced to 20 years in prison for fatally shooting Sonya Massey, a Black women who dialed 911 asking for help. Sean Grayson was convicted of second-degree murder in October. He was sentenced on Thursday. The white former deputy killed Massey, who was Black, on July 6, 2024. The 36-year-old single mother had called the police saying she feared there was a prowler outside her Springfield home. Grayson shot her in the face. Grayson can shorten his sentence by half with good behavior. He has been incarcerated since he was charged in Massey’s killing.",
      "publishedAt": "2026-01-29T05:05:36Z",
      "title": "Ex-Illinois deputy sentenced to 20 years in Sonya Massey’s death",
      "url": "https://apnews.com/article/sonya-massey-grayson-murder-sentence-b4af388a9e7133449e861033a741d2ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/3cb1613/2147483647/strip/true/crop/7555x5034+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F4a%2Fdd0e32931240e9297500313d4600%2F09b3e62bb2754c368a85e91afdccb629"
    },
    {
      "author": "Sophie Bates, Jeff Martin, Russ Bynum",
      "description": "The situation for some of the most vulnerable people trapped in homes in Tennessee and Mississippi without electricity is reaching a breaking point. Officials say it could be days before power is restored across the South and more subfreezing temperatures are expected by Friday. The growing misery and anxiety comes amid what Mississippi officials say is the state’s worst winter storm in more than 30 years. Roughly 298,000 homes and businesses remained without power Wednesday night. The vast majority of them are in Tennessee and Mississippi, where many are unaccustomed to and ill-equipped for freeing temperatures. At least 70 people have died across the U.S. in states afflicted by the dangerous cold.",
      "publishedAt": "2026-01-29T06:14:42Z",
      "title": "Ongoing frigid temperatures in US South pose danger to those lacking electricity",
      "url": "https://apnews.com/article/frigid-temperatures-power-outages-mississippi-tennessee-4dc03f84a5f6c2ae8b8c8de39995e8ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/25a0c7b/2147483647/strip/true/crop/2529x1685+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Ff5%2F5f4c99f97d1c6d3ca33ff6e09e4c%2F84bf3db1531948f9af16a63b87701811"
    },
    {
      "author": "Michael R. Sisak",
      "description": "Authorities say a man claiming to be an FBI agent showed up to a federal jail in New York City and told officers he had a court order to release Luigi Mangione. The man was arrested and charged with impersonating an FBI agent in a foiled bid to free Mangione from the Metropolitan Detention Center, where he is held while awaiting state and federal murder trials in the killing of UnitedHealthcare CEO Brian Thompson. A criminal complaint filed against Mark Anderson did not did not identify the person attempted to free but a law enforcement official confirmed it was Mangione. The official was not authorized to speak publicly and did so on condition of anonymity.",
      "publishedAt": "2026-01-29T20:14:41Z",
      "title": "A man impersonating FBI agent attempts to free Luigi Mangione",
      "url": "https://apnews.com/article/luigi-mangione-jail-release-arrest-brooklyn-dc5ec1c87b636bfe99352ef3299acdf2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4a09af/2147483647/strip/true/crop/4888x3257+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2Fa3%2Ff0d310e44fea2314f402fedbf571%2F0e02ce17bc4b48579a0ba4e313c39847"
    },
    {
      "author": "Alma Solís",
      "description": "Panama’s Supreme Court has ruled that the concession held by a subsidiary of Hong Kong’s CK Hutchison Holdings to operate ports at either end of the Panama Canal was unconstitutional, an outcome that advances a U.S. aim to block any influence by China over the strategic waterway. The court’s ruling late Thursday followed an audit by Panama’s comptroller, which alleged irregularities in the 25-year extension of the concession granted in 2021. The Trump administration made blocking China’s influence over the Panama Canal one of its priorities in the hemisphere. Panama was U.S. Secretary of State Marco Rubio’s first overseas stop as the United States’ top diplomat.",
      "publishedAt": "2026-01-30T03:04:38Z",
      "title": "Hong Kong company’s concession for Panama Canal ports ruled unconstitutional",
      "url": "https://apnews.com/article/panama-canal-ports-us-china-b5fe3cdcc1fce45dbf1b0843a620830a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a937e93/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F46%2Fd5a985b05ab815cb8b27bdf8281e%2F8cac9ad32a9743abb9eb3d056be6b0c7"
    },
    {
      "author": "Darlene Superville",
      "description": "Melania Trump is capping her first year after becoming first lady again with the global release of a documentary about the 20 days before she and President Donald Trump returned to the White House. The Kennedy Center in Washington has scheduled a screening for the movie, “Melania,” on Thursday, one day before its release in theaters worldwide. The Trumps are expected to walk the red carpet. Melania Trump says the film will offer rare insight into her life as she juggled her private businesses and planned her family's return to the White House in the run-up to the 2025 inauguration.",
      "publishedAt": "2026-01-29T05:08:59Z",
      "title": "Melania Trump's documentary premieres at the Kennedy Center",
      "url": "https://apnews.com/article/melania-trump-documentary-premiere-kennedy-center-6e6b899671f91a00ca46f059f1c4fc94",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f183a0/2147483647/strip/true/crop/6808x4536+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F9e%2Fd8a000047b101511841b663adf2a%2F76f80882b8e24ba3af115b88d4e25647"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}