{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.",
      "publishedAt": "2024-08-11T07:15:02Z",
      "title": "Israel widens evacuation orders in southern Gaza. Hamas wants plans for a deal instead of more talks",
      "url": "https://apnews.com/18b0a73f930e3cc472a4207168b09ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a94c0722e85744c9997b2a69bc0d39a4/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — U.S. Defense Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area, the Defense Department said Sunday.",
      "publishedAt": "2024-08-12T00:55:48Z",
      "title": "Pentagon chief orders submarine to the Middle East, tells aircraft carrier to hasten its transit",
      "url": "https://apnews.com/43e2574e746af59993f54e4ef250a640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/979ecb25979d4b0fa42ce19211f7c049/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "SAINT-DENIS, France (AP) — Setting out to prove that topping Paris isn’t mission impossible, Los Angeles rolled out a skydiving Tom Cruise, Grammy winner Billie Eilish and other stars on Sunday as it took over Olympic hosting duties from the French capital, which closed out its 2024 Games just as they started — with joy and panache.",
      "publishedAt": "2024-08-11T19:03:12Z",
      "title": "Paris closes the Olympics, and Los Angeles turns to Tom Cruise for its 2028 mission",
      "url": "https://apnews.com/b1786f8e9ae6c5e2b709cf0b2cf6bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00c4114b3974bd8a643659cdc216961/3000.jpeg"
    },
    {
      "author": "JAIMIE DING and ANDREW DALTON",
      "description": "LOS ANGELES (AP) — It's Los Angeles' turn for the torch. Mayor Karen Bass accepted the Olympic flag at the Paris closing ceremony Sunday, before handing it off to a key representative of LA's local business — Tom Cruise — who in a pre-recorded trek via motorcycle, plane and parachute kicked off the countdown to 2028.",
      "publishedAt": "2024-08-12T04:11:30Z",
      "title": "From Paris to Los Angeles: How the city is preparing for the 2028 Olympics",
      "url": "https://apnews.com/59e0f1e3a66464b28024f431b193dc00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e122b977156a4f74aab9fdb64029fa2b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — At the top of his first speech as her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-12T04:04:41Z",
      "title": "Harris is pushing joy. Trump paints a darker picture. Will mismatched moods matter?",
      "url": "https://apnews.com/ff1818feee5c8661decaa9d48f6927af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f1aeb0a6b4e4ba6afb40da7764733de/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has repeatedly taunted her opponent's seeming reluctance to debate, telling a series of raucous audiences about Donald Trump's criticisms of her: “As the saying goes, if you’ve got something to say, say it to my face.”",
      "publishedAt": "2024-08-12T04:01:42Z",
      "title": "From Biden to Gabbard, here's what Harris' past debates show before a faceoff with Trump",
      "url": "https://apnews.com/09741696abe9d4217e51d94ac0af553e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db0d2301a76459c940a7813e7ecf326/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Days after Ukraine began a surprise military incursion into Russia’s Kursk border region, President Volodymyr Zelenskyy has broken the government’s silence on it by indirectly acknowledging the ongoing military actions to “push the war out into the aggressor’s territory.”",
      "publishedAt": "2024-08-11T07:00:19Z",
      "title": "Ukraine's president acknowledges military incursion onto Russian soil",
      "url": "https://apnews.com/256adcd7e5ad8beef792a08fc0f0fe8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a54c306508a4b8790b0bbcf5a9d026b/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "Jannatul Prome hopes to leave Bangladesh to study more or possibly find a job after she finishes her university degree, frustrated by a system that she says doesn't reward merit and offers little opportunity for young people.",
      "publishedAt": "2024-08-12T04:10:24Z",
      "title": "How a young generation in Bangladesh forced out the leader who ruled for much of their lives",
      "url": "https://apnews.com/2723012c6177c2feafd1e81c20c68309",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7e13fbf7bf944b3a28ed8072bc8267c/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Arianne Risso worked every day to help her patients battle cancer. That made it all the more heart wrenching when her life — along with that of seven other doctors — ended abruptly after a plane tumbled from the sky in Brazil.",
      "publishedAt": "2024-08-12T04:12:26Z",
      "title": "Their job was saving lives. They lost their own in Brazil’s horrifying plane crash",
      "url": "https://apnews.com/18a4b96070740eaa8955ecf20ea829ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30990f91e43b4ed892a91aeea60990f6/984.jpeg"
    },
    {
      "author": "BRITTANY PETERSON",
      "description": "In the days after wildfire ripped through a rural neighborhood in the Maui mountain town of Kula, residents were determined to do what they could to prevent a repeat. With donated hoses and some impromptu training, some even learned how to open a standpipe to attack flames themselves if needed.",
      "publishedAt": "2024-08-12T05:02:01Z",
      "title": "After fire struck Maui's Upcountry, residents of one town looked to themselves to prep for next one",
      "url": "https://apnews.com/69689be066f24da84ac53914e4de2683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df0ff84103be4fd485f3eea7f437f16d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}