{
  "articles": [
    {
      "author": "FATIMA HUSSEIN",
      "description": "U.S. Treasury nominee Scott Bessent is facing sharp questions from both Democrats and Republicans on tax policy, tariffs, China, Russia sanctions and the future of an IRS tax filing system that Republicans have called to be cut. Bessent sat in front of the Senate Finance Committee on Thursday for his confirmation hearing. He told lawmakers that President-elect Donald Trump has an opportunity to unleash “a new economic golden age.” Bessent pledged to maintain a free IRS tax filing system at least for the 2025 tax season, while studying whether it should continue after that. Republican lawmakers have branded that program a waste of money and want it cut.",
      "publishedAt": "2025-01-16T04:06:23Z",
      "title": "Treasury nominee calls for stronger Russia sanctions and Fed independence at confirmation panel",
      "url": "https://apnews.com/article/bessent-trump-inauguration-treasury-finance-0da57f77f3a2010744cb157dd3d976a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8df08e/2147483647/strip/true/crop/4968x2795+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F33%2Fa208997dbb810793a8177cd2c070%2F481dd2034f93441c95c6a718b200daa4"
    },
    {
      "author": "MATTHEW BROWN, JENNIFER McDERMOTT, JACK DURA",
      "description": "President-elect Donald Trump’s nominee for interior secretary told a Senate panel Thursday that the U.S. can leverage development of fossil fuels and other energy sources to promote world peace and lower costs. Former North Dakota Gov. Doug Burgum voiced concerns about incentives for renewable energy under the Biden administration during the the hearing. Democratic lawmakers challenged the Republican’s claims about national security and raised concerns about fossil fuels that are driving global warming. The Interior Department oversees a half-billion acres of federal land and vast areas offshore. Those areas produce about one-quarter of U.S. oil annually.",
      "publishedAt": "2025-01-16T05:07:13Z",
      "title": "Doug Burgum, Trump’s pick for public lands boss, backs US 'energy dominance'",
      "url": "https://apnews.com/article/burgum-trump-interior-secretary-hearing-d6f7303bb2ee395b073dec0d798e608b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad86ff7/2147483647/strip/true/crop/5648x3177+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fdc%2F1c7ee3930ac1c6cd6d9752012bd4%2F7170cd453bfd49beb5fbd91c8507ee77"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Joe Biden in his Wednesday farewell speech to the nation warned that American democracy was sliding into an “oligarchy” of tech billionaires. But even before Biden’s speech, the rising wealth gap in the United States — as well as in China — raised concerns about whether the world’s two largest economies were becoming oligarchies.",
      "publishedAt": "2025-01-16T18:11:13Z",
      "title": "What is an oligarchy? Biden warns the US risks centralizing power",
      "url": "https://apnews.com/article/oligarchy-biden-zuckerburg-bezos-musk-altman-a44e281c6dbf2fd6cd174f13cdcdc1c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4d0038/2147483647/strip/true/crop/8230x4629+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fb4%2Fe5025aa090e9b8e300987dd01a19%2Ff85c3c2715b74a7883632fa4376cc654"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "Donald Trump has given voters a hefty list of promises, and many of them come due right away. On many major issues, Trump promises to deliver on Day 1. The Republican said during his presidential campaign he'll issue first-day pardons for some of the rioters who attacked the Capitol on Jan. 6, 2021. Trump says he'll launch the largest deportation in U.S. history, declare a national emergency to spur the approval of energy projects and end birthright citizenship. But there's only so much Trump can do without Congress, and some of his Day 1 vows are bound to fall short.",
      "publishedAt": "2025-01-16T19:21:50Z",
      "title": "Trump offered a bountiful batch of campaign promises that come due on Day 1",
      "url": "https://apnews.com/article/trump-day-1-promises-9c842ada3c54e2219445f1598db2c8d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/c4492f1/2147483647/strip/true/crop/2491x1401+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2Fc7%2F304722fa80ec2987d3ae70b7b5a9%2F5d792d47296748e2b4090ba5be8b1819"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The vast majority of Americans are about to get an extended taste of frigid Siberian weather. Forecasters predict another polar vortex disruption will stretch Arctic air across the top of the globe and make Donald Trump’s second inauguration the coldest in 40 years. After hitting the Rockies, the cold will blast eastward and as far south as the upper Florida peninsula. For as many as 280 million Americans, it will mean a day or two where it’s colder than Anchorage, Alaska. Monday's inauguration will see single-digit wind chills, though it shouldn't be as cold as Ronald Reagan's second inauguration in 1985.",
      "publishedAt": "2025-01-16T18:39:31Z",
      "title": "Get ready for an even bigger chill. Siberian air to make Trump swearing-in coldest in 40 years",
      "url": "https://apnews.com/article/arctic-siberian-cold-chilly-trump-inauguration-7537abf637d19e681e9c517e1e82cb4b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1972020/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F3a%2F67d94f691c614e1aa2020056955c%2F6854796a379b468eafce3fdd0a70c769"
    },
    {
      "author": "JAIMIE DING",
      "description": "An 84-year-old man who was killed in the California wildfires had immigrated to the U.S. from China in 1989, and loved his Altadena home and the California fresh air. Zhi-feng Zhao's remains were discovered last week by his son, Shaw Zhao, who flew from Portland, Oregon, to Los Angeles to see his father, and was worried to see the neighborhood was in an evacuation zone. Zhao said he had trouble getting to his father's house and had to walk an hour on foot. There was little left of the house, but he saw a coyote sniffing around and was horrified to see his father's remains. Zhi-feng Zhao was among at least 25 people killed in one of the most destructive natural disasters in Southern California’s history,",
      "publishedAt": "2025-01-16T20:30:12Z",
      "title": "Looking for his father, a worried son went to fire evacuation zone but found death and devastation",
      "url": "https://apnews.com/article/california-wildfires-victim-zhao-altadena-a59f2cf70d1b0f6736b4819031b3727c",
      "urlToImage": "https://dims.apnews.com/dims4/default/6904878/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F08%2F57bf4d73ca6ac77421b67fded47e%2F5cd15fad6b764048b497b83e7e5726b7"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA, SAMY MAGDY",
      "description": "Prime Minister Benjamin Netanyahu said Thursday that a “last minute crisis” with Hamas was holding up Israeli approval of a long-awaited agreement to pause the fighting in the Gaza Strip and release dozens of hostages. Israeli airstrikes meanwhile killed dozens of people across the war-ravaged territory. Netanyahu’s office said his Cabinet won’t meet to approve the agreement until Hamas backs down, accusing it of reneging on parts of the agreement in an attempt to gain further concessions. U.S. President Joe Biden and key mediator Qatar announced the deal on Wednesday, which is aimed at releasing scores of hostages held in Gaza and winding down a 15-month war that has destabilized the Middle East and sparked worldwide protests.",
      "publishedAt": "2025-01-16T08:43:40Z",
      "title": "Israel PM Netanyahu says Cabinet won't meet over Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd11b00/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F59%2F59296f6b288a051cf8c9c7dcfe0e%2F146026970d744e6bae6cfc5ea3be8137"
    },
    {
      "author": "VICTORIA EASTWOOD, SAMY MAGDY",
      "description": "Egypt’s chief diplomat is calling on Israel and Hamas to implement a Gaza ceasefire plan “without any delay.” The message by Foreign Minister Badr Abdelatty raises pressure on Israeli Prime Minister Benjamin Netanyahu to accept the deal. Abdelatty spoke to The Associated Press at a sensitive time. A day after U.S. President Joe Biden and other international mediators announced the ceasefire agreement, Netanyahu insisted Thursday there still was no deal. Abdelatty declined to comment on Netanyahu’s claims that Hamas has “reneged” on certain pledges in the agreement. He said “we have a deal” and that it was time to move forward.",
      "publishedAt": "2025-01-16T21:16:04Z",
      "title": "AP Exclusive: Egypt's chief diplomat urges Israel and Hamas to enact ceasefire 'without any delay'",
      "url": "https://apnews.com/article/ceasefire-egypt-gaza-hamas-israel-eu-war-3e434d5612f62ee5b188acf74f65f1fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7cb79e/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fb2%2Fdbf26d9373db9e1b37b3a9bae45b%2F2ca2db62997542b685c1b09dc637a348"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Palestinians in the Gaza Strip are eager to leave miserable tent camps and return to their homes if a long-awaited ceasefire agreement halts the Israel-Hamas war. But many will find there is nothing left and no way to rebuild. Israel’s bombardment and ground operations have transformed entire neighborhoods in several cities into charred wastelands. Blackened shells of buildings and mounds of rubble stretch away in all directions. Major roads have been plowed up. Critical water and electricity infrastructure is in ruins. Most hospitals no longer function. And it’s unclear when — or even if — much of it will be rebuilt.",
      "publishedAt": "2025-01-16T18:55:29Z",
      "title": "Palestinians in Gaza are eager to return home in a ceasefire but many will find nothing left",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-damage-reconstruction-d120f8a0dc8b728c0d8332046a524a92",
      "urlToImage": "https://dims.apnews.com/dims4/default/7571bb6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F32%2F05f9cb8f630e54f05f090223470c%2F0ef35a78895445338d5b4a2dd521213a"
    },
    {
      "author": "LINDSEY BAHR, JILL COLVIN",
      "description": "Donald Trump wants to make Hollywood “bigger, better and stronger” and has chosen Mel Gibson, Jon Voight and Sylvester Stallone to help. On Wednesday, the President-elect wrote on his social media site that the three actors would be his eyes and ears to the moviemaking town as special ambassadors. “It will again be, like The United States of America itself, The Golden Age of Hollywood!” Trump wrote. U.S. film and television production has been hampered in recent years, with setbacks from the COVID-19 pandemic, the Hollywood guild strikes of 2023 and, in the past week, the ongoing wildfires in the Los Angeles area.",
      "publishedAt": "2025-01-16T19:36:59Z",
      "title": "Donald Trump vows to help ‘troubled’ Hollywood with Mel Gibson, Jon Voight and Sylvester Stallone",
      "url": "https://apnews.com/article/trump-hollywood-ambassadors-b3cd35a950fc6465c32551624feea332",
      "urlToImage": "https://dims.apnews.com/dims4/default/336a1cd/2147483647/strip/true/crop/5348x3008+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F2d%2F5ef6234f76883bd8fbf1504ad26f%2F9e0724fae85e473fb9dc23381d5b48e2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}