{
  "articles": [
    {
      "author": "Jack Brook, Steve Karnowski, Rebecca Santana",
      "description": "Democratic officials and protesters on the streets are demanding that federal immigration officers leave Minnesota after a Border Patrol agent fatally shot a man in Minneapolis. Saturday's shooting drew hundreds of demonstrators into the frigid cold in a city already shaken by another killing weeks earlier. Minneapolis Police Chief Brian O’Hara says information about what led up to the latest shooting is limited. The man has been identified by his parents as Alex Pretti. He was a 37-year-old intensive care unit nurse. The Minnesota National Guard assisted local police in monitoring the crowds.",
      "publishedAt": "2026-01-25T05:01:38Z",
      "title": "After fatal shooting in Minneapolis, protesters and Democrats demand federal agents leave",
      "url": "https://apnews.com/article/shooting-minneapolis-protests-ice-immigration-0af10ec433181aa9300deea26d1cc8c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe606de/2147483647/strip/true/crop/3600x2399+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F41%2F2c6f8d9d7985877a890a256ec7d0%2F53e02021b11b43ec95470f1f7b790c3b"
    },
    {
      "author": "Kate Brumback, Julie Walker",
      "description": "A massive winter storm continues to hit large parts of the country, dumping snow, sleet and freezing rain. Frigid temperatures, power outages, and treacherous road conditions were widespread. The National Weather Service says the storm is expected to continue through Monday. Heavy snow is forecast from the Ohio Valley to the Northeast, while ice threatens the Lower Mississippi Valley to the Southeast. The number of customers without power was approaching 800,000, according to poweroutage.us, and the number was rising. More than 10,000 flights have been canceled. President Donald Trump approved emergency declarations for at least a dozen states by Saturday.",
      "publishedAt": "2026-01-25T13:52:15Z",
      "title": "Massive winter storm continues to bring cold, ice and dangerous conditions",
      "url": "https://apnews.com/article/winter-storm-snow-ice-power-outages-7ea143995026e68db42ed1b4aec396cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/c14e684/2147483647/strip/true/crop/3500x2332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F14%2F31da8af2fe83347d24574c052bb2%2F8b24fe3695154c5c860f4ec8fd344147"
    },
    {
      "author": "Rio Yamat",
      "description": "A massive winter storm set the stage for a brutal travel day Sunday, with airlines warning of widespread cancellations and delays at some of the nation’s busiest airports. More than 14,100 flights have been canceled across the U.S. since Saturday, according to flight tracking site FlightAware. Over 10,000 of those were scheduled for Sunday. Aviation analytics company Cirium says their data shows that Sunday will be the highest cancellation event since the pandemic — with over 29% of all U.S. departing flights axed.",
      "publishedAt": "2026-01-25T10:53:31Z",
      "title": "Massive winter storm threatens widespread US flight disruptions",
      "url": "https://apnews.com/article/flight-cancellations-winter-storm-871ea9cf98ec399bce4dccf0cffa2c01",
      "urlToImage": "https://dims.apnews.com/dims4/default/123c7dc/2147483647/strip/true/crop/5537x3689+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F0a%2Fa67428c926f64986ac5b3d7a307a%2F96cf00c0e17a4aac9e794d0ab823f6c1"
    },
    {
      "author": "Katie Tam",
      "description": "American rock climber Alex Honnold has ascended the Taipei 101 skyscraper without any ropes or protective equipment. Cheers erupted from a street-level crowd as he reached the top of the spire of the 1,667-foot tower about 90 minutes after he started on Sunday. Wearing a red short-sleeve shirt, he waved his arms back and forth over his head. Honnold's free solo climb of the iconic building in Taiwan's capital was being broadcast live on Netflix. The ascent was delayed for 24 hours due to rain.",
      "publishedAt": "2026-01-25T01:43:55Z",
      "title": "American rock climber ascends Taipei 101 without any ropes",
      "url": "https://apnews.com/article/alex-honnold-taipei-101-solo-climb-netflix-cfe8960237290086cdee581075056fbf",
      "urlToImage": "https://dims.apnews.com/dims4/default/074eb36/2147483647/strip/true/crop/5728x3817+136+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2Fca%2F66ad3acd419e8a6cf81cc05b161c%2Fap26025092978764.jpg"
    },
    {
      "author": null,
      "description": "Improved weather has helped rescuers in Java, Indonesia, recover more bodies after a landslide killed over two dozen villagers. The landslide on Saturday buried 34 houses in Pasir Langu village. Seventy-two people remain missing, feared buried under mud and debris. About 230 residents have been evacuated to shelters. A 250-member search team collected victims' remains in 14 body bags, bringing the total found to 25. Loose ground prevents heavy equipment from being used. Indonesian Vice President Gibran Rakabuming Raka visited the area and urged local authorities to address land conversion in disaster-prone areas to prevent similar incidents.",
      "publishedAt": "2026-01-25T07:29:01Z",
      "title": "Indonesian rescuers search for dozens missing after deadly landslide",
      "url": "https://apnews.com/article/indonesia-west-java-landslide-d453d653fdd6f05ab7ebe85979c2a61b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2d7be0/2147483647/strip/true/crop/2048x1365+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Fa1%2Ffc43c43eb3899669fdf3d1e8b345%2Fa7d370c233f1485283d9f529d6c96eb6"
    },
    {
      "author": "Laurie Kellman",
      "description": "European leaders are finding a way to speak with one voice against President Donald Trump and they're increasingly willing to say “no” to his demands. Trump's insistence on U.S. control over Greenland has sparked strong opposition from European leaders. During a showdown in Davos, Switzerland, last week, the prime ministers of Britain and Norway issued sharp warnings against Trump's threats. That European unity marks a shift from appeasing Trump to defying him, and Denmark's prime minister emphasized the importance of standing together. Trump's transactional approach to diplomacy has created a disconnect with European leaders.",
      "publishedAt": "2026-01-25T12:34:39Z",
      "title": "European leaders learn to say 'no' to Donald Trump",
      "url": "https://apnews.com/article/trump-european-leaders-nato-greenland-diplomacy-b01f2d1e73e6a44fb3bc1d757aeb5110",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f372b0/2147483647/strip/true/crop/5512x3673+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F1b%2F3565a4fa515ad3caf7b8571ad464%2F74af19d45c014355ab48f974bdd50a7e"
    },
    {
      "author": "Elena Becatoros",
      "description": "Authorities in Iran have unveiled a new mural in a central Tehran square with a direct warning to the United States to not attempt a military strike on the country. The painted image of several damaged aircraft on the flight deck of an aircraft carrier bears a slogan: “If you sow the wind, you will reap the whirlwind.” The unveiling of the mural in Enghelab Square comes as USS Abraham Lincoln aircraft carrier and accompanying warships move towards the region. U.S. President Donald Trump has said the ships were being moved “just in case” he decides to take action.",
      "publishedAt": "2026-01-25T13:28:55Z",
      "title": "Iran unveils mural in the capital to send anti-US message",
      "url": "https://apnews.com/article/iran-trump-mural-protests-military-4b2ceb8aff9dc448036341e86023b6c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Peter Smith, Tiffany Stanley",
      "description": "American religious history is rife with protest movements. Yet political protests inside a house of worship are unusual. That is a striking aspect of a new case against anti-ICE protesters in St. Paul, Minnesota. The group disrupted a service last Sunday at Cities Church, a Southern Baptist congregation. One of its pastors works for U.S. Immigration and Customs Enforcement. Three protesters have been arrested. They are charged under a federal law criminalizing any conspiracy against someone’s constitutional rights, in this case attending a worship service.",
      "publishedAt": "2026-01-25T13:33:51Z",
      "title": "Protests inside churches are unusual in the US",
      "url": "https://apnews.com/article/immigration-enforcement-church-protest-history-58817d7033c6b83867131f4cee87256a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f584f9d/2147483647/strip/true/crop/8003x5333+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2Fcc%2F5582b3202c29bd071d16845b81a1%2F6bd3b3ea6ea14d4d8d1629b1dd61d84a"
    },
    {
      "author": "Matt O'Brien, Linley Sanders",
      "description": "A new Gallup poll finds that American workers have adopted artificial intelligence into their work lives at a remarkable pace over the past few years. Some 12% of employed adults say they use AI daily in their job, while nearly half say they've used it at least a few times a year. That compares with 21% who were using AI at least occasionally a few years ago. The findings point to the impact of the widespread commercial boom that ChatGPT sparked for generative AI tools that can write emails and computer code, summarize long documents or help answer questions. The Gallup Workforce survey of more than 22,000 U.S. workers was conducted last fall.",
      "publishedAt": "2026-01-25T13:01:24Z",
      "title": "AI use at work has increased, Gallup poll finds",
      "url": "https://apnews.com/article/ai-workplace-gemini-chatgpt-poll-4934bc61d039508db32bc49f85d63d99",
      "urlToImage": "https://dims.apnews.com/dims4/default/efee3cd/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F1e%2Fcb187cd236c87be45e706f94e81d%2Fbda6b9e6dbca49ceaa6353a58d43b3dc"
    },
    {
      "author": "R.J. Rico, Emilie Megnien",
      "description": "Millions of people rely on wearable devices to monitor how well they're sleeping. Sleep trackers don’t necessarily measure sleep directly but instead infer states of slumber from signals like heart rate and movement. Experts say it's therefore important to understand what the devices can and cannot measure. A University of Michigan math professor who researches the science behind sleep wearables says the algorithms used by major brands are highly accurate in determining when someone is asleep and somewhat helpful for estimating sleep stages. But a neurologist at the Morehouse School of Medicine says some wearers become fixated on their sleep scores. There's even a medical term for an unhealthy obsession with ideal sleep: orthosomnia.",
      "publishedAt": "2026-01-25T13:30:48Z",
      "title": "How to use a sleep tracker without losing sleep over your score",
      "url": "https://apnews.com/article/sleep-tracking-wearables-accuracy-oura-fitbit-aff24259c88bf48e5ebcd425a329a9da",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae32f33/2147483647/strip/true/crop/2908x1938+274+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fb6%2F7eb72f3e32203d406b162144aa25%2Fda006bd9b01243d68b55e854c39424cf"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}