{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Vice President Kamala Harris and Minnesota Gov. Tim Walz will spend their first full day as running mates on Wednesday rallying Democrats across the Midwest, a politically divided region that is crucial to their effort to win the White House in less than three months.",
      "publishedAt": "2024-08-07T04:11:52Z",
      "title": "Harris' pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions",
      "url": "https://apnews.com/d66fad315f34ec68a50c81b118b18480",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f19daafd337402cab54ceb374bd55c4/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, BILL BARROW and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Kamala Harris’ whirlwind process to select Minnesota Gov. Tim Walz as her running mate can be summed up in a word: weird.",
      "publishedAt": "2024-08-07T04:06:19Z",
      "title": "Picking a running mate: Inside the 16 days between Kamala Harris' launch and her choice of Tim Walz",
      "url": "https://apnews.com/a64a91ae84953e880c8d086316d07c54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2583aac165442a49945e00042255d56/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM, JEFFREY COLLINS and JOHN MINCHILLO",
      "description": "CHARLESTON, S.C. (AP) — Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.",
      "publishedAt": "2024-08-07T04:14:07Z",
      "title": "Tropical Storm Debby swirls over Atlantic, expected to again douse the Carolinas before moving north",
      "url": "https://apnews.com/3d3e634978b9a03790c4e998b20505c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06e9f2f0ebf84c1ea2111729a5dbc883/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Hamas on Tuesday named Yahya Sinwar, its top official in Gaza who masterminded the Oct. 7 attacks in Israel, as its new leader in a dramatic sign of the power of the Palestinian militant group's hardline wing after his predecessor was killed in a presumed Israeli strike in Iran.",
      "publishedAt": "2024-08-06T18:10:43Z",
      "title": "Hamas names Yahya Sinwar, mastermind of the Oct. 7 attacks, as its new leader in show of defiance",
      "url": "https://apnews.com/916e41c5201d0e88a8caab32c457af5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd3f70e13358443eaad48e78205977f4/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A Pakistani man alleged to have ties to Iran has been charged in a plot to carry out political assassinations on U.S. soil, including potentially of former President Donald Trump.",
      "publishedAt": "2024-08-06T18:35:38Z",
      "title": "Pakistani man with ties to Iran is charged in plot to carry out political assassinations on US soil",
      "url": "https://apnews.com/5a3abe0895ae7c2be14f89fc4e49bc53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c10ea79d2d94f6691273af3941d56f9/2258.jpeg"
    },
    {
      "author": "JULHAS ALAM and SHEIKH SAALIQ",
      "description": "DHAKA, Bangladesh (AP) — Nobel laureate Muhammad Yunus will head Bangladesh's interim government after longtime Prime Minister Sheikh Hasina fled the country amid a mass uprising that left hundreds of people dead and pushed the South Asian nation to the brink of chaos.",
      "publishedAt": "2024-08-06T04:25:51Z",
      "title": "Nobel laureate Yunus will head Bangladesh's interim government after unrest ousted Hasina",
      "url": "https://apnews.com/bca66e8251f86deb3fe28c913d0a1444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0412490f1ad44e4bc11b8ecb3dc5aaa/1920.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — St. Louis County Prosecuting Attorney Wesley Bell has defeated U.S. Rep. Cori Bush in a Democratic primary in St. Louis, marking the second time this year that one of the party’s incumbents has been ousted in an expensive contest that reflected deep divisions over the war in Gaza.",
      "publishedAt": "2024-08-06T04:06:31Z",
      "title": "Wesley Bell defeats ‘Squad’ member Cori Bush. A pro-Israel group spent $8.5 million to help oust her",
      "url": "https://apnews.com/f507703334e182528489ca078bc5ce70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e35383e1e59740299885988d50e233af/3000.jpeg"
    },
    {
      "author": "TARA COPP and AARON KESSLER",
      "description": "WASHINGTON (AP) — A gear crack that led to a fatal crash of a V-22 Osprey last year may have been started by weak spots in a metal used to manufacture that part, according to documents obtained by The Associated Press.",
      "publishedAt": "2024-08-06T23:01:49Z",
      "title": "Weak spots in metal may have led to fatal Osprey crash off Japan, documents obtained by AP reveal",
      "url": "https://apnews.com/d0402b8696e9f1da7d0af4bd368c92f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90bfb9ca19894a50802e53a0e9dfb582/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — When a deadly wildfire tore through Lahaina on Maui last August, the wall of flames scorched the 151-year-old banyan tree along the historic town's Front Street.",
      "publishedAt": "2024-08-07T04:20:51Z",
      "title": "How Lahaina's more than 150-year-old banyan tree is coming back to life after devastating fire",
      "url": "https://apnews.com/ccb63884e93fa09a3855e87163ec66fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b11497394e5a416a82df5abd64197aec/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "PARIS (AP) — Olympic open water swimmers received the go-ahead to train in long-polluted Seine River on Wednesday after Paris organizers determined it was safe to dive in.",
      "publishedAt": "2024-08-07T03:09:01Z",
      "title": "Open water swimmers cleared to train in Seine River ahead of 10-kilometer marathon event",
      "url": "https://apnews.com/7ff3a8a91288702c1011bc1c846005d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38f6f2b5506244d1a221dd6678f72c37/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}