{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Biden and Harris join campaign staff call to say they will fight for reelection after debate flop, AP sources say.",
      "publishedAt": "2024-07-03T17:34:08Z",
      "title": "Biden and Harris join campaign staff call to say they will fight for reelection after debate flop, AP sources say",
      "url": "https://apnews.com/a615e924ec717f4b92d93be17e2a2a45",
      "urlToImage": ""
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — President Joe Biden's disastrous debate performance has reverberated across the Democratic Party, forcing lawmakers to grapple with a crisis that could upend the presidential election and change the course of American history.",
      "publishedAt": "2024-07-03T04:08:38Z",
      "title": "Democrats in Congress are torn between backing Biden for president and sounding the alarm",
      "url": "https://apnews.com/aa619e71e1e09868abe22d19fc48e351",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae05868543424073a94c4445cbc04eec/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden and Vice President Kamala Harris made a surprise appearance Wednesday on a Democratic National Committee call, reiterating to staffers that they are in this fight for reelection together, according to three people familiar with the matter who were given anonymity to discuss the private conversation.",
      "publishedAt": "2024-07-03T16:45:30Z",
      "title": "Biden and Harris join campaign call to say they will keep fighting after debate flop, AP sources say",
      "url": "https://apnews.com/7794155c12bc78c084e4b964545e2b7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb293139b0ff452c9ebc43d3d40d780a/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump likes to be the one in the spotlight.But in the days since President Joe Biden's disastrous debate performance, the presumptive Republican nominee has kept a low profile, leaving the focus on the drama engulfing the Democratic Party as he and his campaign revel in a series of legal and political victories heading into the Republican National Convention this month.",
      "publishedAt": "2024-07-03T11:17:07Z",
      "title": "Trump revels in legal and political wins while Biden's campaign reels from their debate",
      "url": "https://apnews.com/86bfc24cc618906fa9b46ab029e65789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43099fdb35c04a1a85750b809350f21d/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel has approved the largest seizure of land in the occupied West Bank in over three decades, a settlement tracking group said Wednesday, a move that is likely to worsen already soaring tensions linked to the war in Gaza.",
      "publishedAt": "2024-07-03T11:07:01Z",
      "title": "Israel turbocharges West Bank settlement expansion with largest land grab in decades",
      "url": "https://apnews.com/033deab379a16efdf9989de8d6eaf0f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2ff8c13d1e8430989ab3f365ba9ed78/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "WASHINGTON (AP) — Scientists have revealed fossils of a giant salamanderlike beast with sharp fangs that ruled waters before the first dinosaurs arrived.",
      "publishedAt": "2024-07-03T15:03:45Z",
      "title": "Fossils show huge salamanderlike predator with sharp fangs existed before the dinosaurs",
      "url": "https://apnews.com/bf56d8dfbd2e48908a87b32254f04b8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22d37a765ac244b6814a98d7b3fe880d/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS and JOHN HANNA",
      "description": "ST. LOUIS (AP) — Early last week, floodwater in rural Minnesota pushed debris against a more than century-old dam and then carved a path around it, eroding so much of the riverbank that most of a house fell into the river.",
      "publishedAt": "2024-07-03T15:14:57Z",
      "title": "Worsening floods and deterioration pose threats to US dam safety",
      "url": "https://apnews.com/1e40fa79a59b4e307d944beb258b91be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da67f24f451044ce814a93c8ac7a9ed4/1920.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE and KRUTIKA PATHI",
      "description": "LUCKNOW, India (AP) — More than 120 people died Tuesday in a stampede after a large religious gathering in northern India, one of the deadliest such accidents in recent years.",
      "publishedAt": "2024-07-03T08:58:19Z",
      "title": "How did a religious gathering in India turn into a deadly stampede?",
      "url": "https://apnews.com/cd902854cbc673cbfbd3408963c34792",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a7dfe38df944a98b356c971819c3559/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "Violence and mass shootings often surge in the summer months, especially around the Fourth of July, historically one of the deadliest days of the year.A flurry of shootings around the holiday a year ago left more than a dozen people dead and over 60 wounded.",
      "publishedAt": "2024-07-03T12:01:20Z",
      "title": "Why mass shootings and violence increase in the summer",
      "url": "https://apnews.com/d5919ea324df5dbc732baf227123f849",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abd45ad762104a07b61d78233a5598d0/2668.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "To save the imperiled spotted owl from potential extinction, U.S. wildlife officials are embracing a contentious plan to deploy trained shooters into dense West Coast forests to kill almost a half-million barred owls that are crowding out their cousins.",
      "publishedAt": "2024-07-03T12:46:33Z",
      "title": "To save spotted owls, US officials plan to kill hundreds of thousands of another owl species",
      "url": "https://apnews.com/9081f926f3ebd27ac3ddc2ceaf332ca2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/113e7669030f4a09b5ca3ca835eb7d56/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}