{
  "articles": [
    {
      "author": "Sam Mednick",
      "description": "Israel has identified the remains of Eliyahu Margalit, a 76-year-old hostage handed over by Hamas. Margalit was abducted on October 7, 2023, during Hamas' attack on Israel. Israel’s Prime Minister’s office said Saturday his family has been notified. This marks the 10th returned hostage body since a ceasefire began over a week ago. Hamas has handed over an 11th body, but it wasn't a hostage. The ceasefire agreement includes the return of all hostages’ bodies, totaling 28. Meanwhile, aid into Gaza remains limited, with only 339 trucks offloaded since the ceasefire began, despite an agreement allowing 600 trucks daily. The humanitarian situation in Gaza remains dire.",
      "publishedAt": "2025-10-18T06:38:10Z",
      "title": "Israel identifies the remains of another hostage",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-18-2025-4d13aaceec91c360449dd5fa737b192b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1c82a4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F1d%2Fb10f04968b2ee66aacce923989e7%2Fa7aef0b7232e42aaaf3791541c41d02d"
    },
    {
      "author": "Kevin Freking",
      "description": "The federal government shutdown is approaching the second longest on record and there's no end in sight. Some lawmakers predict it could surpass the 35-day shutdown from President Donald Trump’s first term. The nation’s 1.3 million active-duty service members have gotten a temporary reprieve. But hundreds of thousands of federal civilian employees are being furloughed and facing financial stress. The travel economy is taking a big hit with tourist sites such as Smithsonian museums in the nation's capital closed. There have been air controller shortages in some cities and flight delays. The longer the shutdown lasts, the more it could be a drag on the economy.",
      "publishedAt": "2025-10-18T12:30:14Z",
      "title": "What the government shutdown means for workers and the economy",
      "url": "https://apnews.com/article/shutdown-trump-furloughs-firings-economy-federal-workers-efced4c32282087c8c53aeab535230a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8def0ae/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F9c%2Fc256e9d193b8485846ed77cc1f00%2F1af57ec6a1bb4856b090a6a9dac677de"
    },
    {
      "author": "Jon Gambrell",
      "description": "The British military says a ship caught fire in the Gulf of Aden off Yemen after being struck by a projectile. Saturday's incident comes as Yemen’s Houthi rebels have been attacking ships through the Red Sea corridor. However, the rebels did not immediately claim the attack, though it can take them hours or even days to do so. The maritime security firm Ambrey described the ship as a tanker that was “en route from Sohar, Oman, to Djibouti.” It said radio traffic suggested the crew was preparing to abandon ship and a search-and-rescue effort was underway.",
      "publishedAt": "2025-10-18T11:42:10Z",
      "title": "British military says ship ablaze after being struck off the coast of Yemen in the Gulf of Aden",
      "url": "https://apnews.com/article/yemen-ship-gulf-of-aden-houthis-25543875a66516c99ec937952542972f",
      "urlToImage": "https://dims.apnews.com/dims4/default/708d3f7/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F7f%2Fdb0bc2bf09066e1a96e8d358b060%2Fbfbffc951a894697859af0b5ede78751"
    },
    {
      "author": "Mike Catalini, Adriana Gomez Licon",
      "description": "Jack Ciattarelli has been endorsed by Donald Trump in next month's New Jersey governor's election and is a strong supporter of the Republican president and his agenda. But the former business owner and state legislator is also diverging Trump on the key issue of immigration. Ciattarelli says he'd back a “pathway to recognition” for some people who are living in New Jersey illegally. Ciattarelli is hoping to make inroads with Latino voters. It's an important group of voters in the November election against Democrat Mikie Sherrill, a four-term congresswoman.",
      "publishedAt": "2025-10-18T13:51:38Z",
      "title": "GOP nominee for NJ governor puts some distance from Trump on immigration",
      "url": "https://apnews.com/article/new-jersey-governor-immigration-ciattarelli-trump-sherrill-4802fd86c36b7d9d0e804efd6368ed05",
      "urlToImage": "https://dims.apnews.com/dims4/default/571b4d9/2147483647/strip/true/crop/4529x2548+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F4b%2F6bf94fba70b23eb9c46f0ba7eb08%2Ffd1bae4d4c78478e8acf6d98fef3a4a3"
    },
    {
      "author": "Lisa Mascaro, Safiyah Riddle, Kevin Freking",
      "description": "Protesting the direction of the country under President Donald Trump, people will gather Saturday in the nation’s capital and communities across the U.S. They're holding “No Kings” demonstrations, or what the president’s Republican Party is calling “Hate America” rallies. This is the third mass mobilization since Trump’s return to the White House and it's expected to be the largest. It comes against the backdrop of a government shutdown that not only has closed federal programs and services, but is testing the core balance of power as organizers warn of a slide toward American authoritarianism. Trump himself is away from Washington at his Mar-a-Lago home in Florida.",
      "publishedAt": "2025-10-18T04:07:29Z",
      "title": "'No Kings' protests against Trump being held nationwide",
      "url": "https://apnews.com/article/no-kings-rallies-demonstrations-trump-4baa5de2fab057a0e6ab726f5d7747fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e2c690/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F43%2Fa76d86eb93e9af1bac59d3e28d2a%2F69611828b2c74b688fd7a14a0a4c59f3"
    },
    {
      "author": "Danica Kirka",
      "description": "Prince Andrew has been banished from the royal whirl after emails emerged this week showing that he had remained in contact with the convicted sex offender Jeffrey Epstein longer than he previously admitted. The House of Windsor has finally moved to insulate the monarchy from years of tawdry headlines about Andrew’s dodgy friends and suspicious business deals. Buckingham Palace on Friday released a statement from Andrew saying that he had agreed to give up use of his last remaining royal titles so that continued allegations about him “don’t distract from the work of His Majesty.”",
      "publishedAt": "2025-10-18T10:10:44Z",
      "title": "Prince Andrew gives up royal titles over Epstein scandal",
      "url": "https://apnews.com/article/prince-andrew-charles-epstein-chinese-spy-91c4bec9a5cf3de8fcb16f9c1fe52e60",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c10ed5/2147483647/strip/true/crop/4362x2454+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F98%2F0a656dbfde560f18415cad80fbc1%2Fb0a3680f9ace40a4862f2a2a508030d0"
    },
    {
      "author": "Mark Thiessen, Gene Johnson",
      "description": "Damage to remote Alaska villages hammered by flooding last weekend is so extreme that many of the more than 2,000 people displaced won’t be able to return to their homes for at least 18 months. That's what Gov. Mike Dunleavy said in a request to the White House for a major disaster declaration. In one of the hardest hit villages, Kipnuk, an initial assessment showed that 121 or homes — or 90% of the total — have been destroyed, Dunleavy wrote. In Kwigillingok, where three dozen homes floated away, slightly more than one-third of the residences are uninhabitable.",
      "publishedAt": "2025-10-17T20:04:00Z",
      "title": "Alaska villages face 18-month recovery after devastating flooding",
      "url": "https://apnews.com/article/alaska-typhoon-flooding-7e6e6b72c5587c3a00b82982ffab56bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/dead5a8/2147483647/strip/true/crop/4499x2531+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fc7%2F4c47167e8aac06763fdc92c8b5f5%2F5eacb55022044e188b4f11b9b36c3028"
    },
    {
      "author": "Christina Larson",
      "description": "Hospitals and doctors' offices are inviting singers and musicians to help patients manage their pain, as music's ability to reduce pain is gaining attention. No one is suggesting that a catchy song can completely eliminate serious pain. But several recent studies have suggested that listening to music can either reduce the perception of pain or enhance a person’s ability to tolerate it. The key is letting patients choose the music and encouraging active listening. Scientists say one aspect of music's power is simple distraction, but it's more than that. It changes the perception and experience of pain, and the isolation and anxiety.",
      "publishedAt": "2025-10-18T13:04:05Z",
      "title": "How listening to music may help ease pain from surgery or illness",
      "url": "https://apnews.com/article/music-pain-research-healing-surgery-medicine-495a90c22ca196da0e95ffe515fb4cbd",
      "urlToImage": "https://dims.apnews.com/dims4/default/c81193f/2147483647/strip/true/crop/5712x3213+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Fe1%2F8fab66df874c53b82f89d72d79fc%2F3fdc97399bde496685ee3ba93c237b67"
    },
    {
      "author": null,
      "description": "Local authorities say a passenger bus crash in northeastern Brazil has left 15 people dead. The vehicle crashed into a sand embankment and flipped on its side. The bus carried 30 passengers, and the number of injured passengers taken to nearby hospitals has not yet been confirmed. The bus departed from Bahia state and crashed in Saloá, Pernambuco. Police say the driver lost control, crossed into the opposite lane, hit rocks, and then crashed into the embankment. The cause of the crash is under investigation. The driver suffered minor injuries and tested negative for alcohol.",
      "publishedAt": "2025-10-18T16:21:22Z",
      "title": "Passenger bus crash in northeastern Brazil leaves 15 dead",
      "url": "https://apnews.com/article/brazil-bus-crash-bahia-dead-injured-a80f6830b03ab4426ed6b67f9ea2f52b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Greg Beacham",
      "description": "During the Los Angeles Dodgers’ October rampage to the NL pennant, the defending World Series champions have actually been the dark eminence that many baseball people have long feared they would become. The Dodgers are 9-1 in the postseason, with near-flawless starting pitching and a deep, resilient lineup producing key hits and electrifying highlights. They swept the Milwaukee Brewers out of the NL Championship Series with a 5-1 victory featuring an iconic three-homer, 10-strikeout performance by Shohei Ohtani. Naysayers think the Dodgers' success is bad for baseball, but the players and coaches wearing the uniform simply don't care.",
      "publishedAt": "2025-10-18T10:00:08Z",
      "title": "The champion Dodgers are dominating October again. There's much more behind their success than money",
      "url": "https://apnews.com/article/dodgers-world-series-shohei-ohtani-e2d09450d49cb9f3cc9ef652c7544d14",
      "urlToImage": "https://dims.apnews.com/dims4/default/70959eb/2147483647/strip/true/crop/5904x3321+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F73%2Fd6234d3b5faabfcbfceeeb0e2181%2Fe90bbda5b17b4c0c96999a317f3a56d8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}