{
  "articles": [
    {
      "author": null,
      "description": "MINNEAPOLIS (AP) — A juror was dismissed Monday after reporting that a woman dropped a bag of $120,000 in cash at her home and offered her more money if she would vote to acquit seven people charged with stealing more than $40 million from a program meant to feed children during the pandemic.",
      "publishedAt": "2024-06-03T17:24:15Z",
      "title": "Fraud trial juror reports getting bag of $120,000 and promise of more if she'll acquit",
      "url": "https://apnews.com/73610b59bb60bf33f2aa06063bb592d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e58551b2feb474dbc4e1b329e005895/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, COLLEEN LONG and RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — A jury was seated Monday in the federal gun case against President Joe Biden’s son Hunter, after prospective panelists were questioned about their thoughts on gun rights and drug addiction while the first lady watched from the front row of the courtroom.",
      "publishedAt": "2024-06-03T04:11:45Z",
      "title": "Jury is chosen in Hunter Biden's federal firearms case and opening statements are set for Tuesday",
      "url": "https://apnews.com/e2cc8b5d459ad80e5bd7b05c5e9105c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/456dc39add9b4b4c938642515a3f13a0/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, STEPHEN GROVES and COLLEEN LONG",
      "description": "WASHINGTON (AP) — The White House is telling lawmakers that President Joe Biden is preparing to sign off on an executive order that would shut down asylum requests at the U.S.-Mexico border once the average number of daily encounters hits 2,500 at ports of entry, with the border reopening only once that number declines to 1,500, according to several people familiar with the discussions.",
      "publishedAt": "2024-06-03T16:59:03Z",
      "title": "Biden prepares an order that would shut down asylum if a daily average of 2,500 migrants arrive",
      "url": "https://apnews.com/7cd0b0f28e298036ad1fc6b0c78961e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/384d9274cc40449b9f25f38d166498e2/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump has had plenty to say since his hush money trial conviction last week.He’s claimed the case was rigged, incorrectly linked President Joe Biden to the state prosecution, called the star witness against him a “sleazebag\" and said the judge was a “devil\" and “highly conflicted.”",
      "publishedAt": "2024-06-03T17:28:01Z",
      "title": "How Trump's deny-everything strategy could hurt him at sentencing",
      "url": "https://apnews.com/66dbfa66613aaae29a3959e619b7593c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eb394b5f7e74b4aabc5b1ab32bc3623/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Dr. Anthony Fauci, the top U.S. infectious disease expert until leaving the government in 2022, was back before Congress on Monday, calling “simply preposterous” Republican allegations that he'd tried to cover up origins of the COVID-19 pandemic.",
      "publishedAt": "2024-06-03T14:43:53Z",
      "title": "Fauci pushes back partisan attacks in fiery House hearing over COVID origins and controversies",
      "url": "https://apnews.com/a66625482f25824476ee315484790230",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45ab5c3677074c85ac330939633e3882/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — The struggling Washington Post found itself in some turmoil on Monday following the abrupt departure of the newspaper's executive editor and a hastily announced restructuring plan aimed at stopping an exodus of readers over the past few years.",
      "publishedAt": "2024-06-03T20:25:46Z",
      "title": "With its top editor abruptly gone, The Washington Post grapples with a hastily announced restructure",
      "url": "https://apnews.com/223384f126106f0a3e89ec09a8869a3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5af592cd77b2425db205e56946fbb712/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — A person found guilty of a sex crime against a child in Louisiana could soon be ordered to undergo surgical castration, in addition to prison time.Louisiana lawmakers gave final approval to the bill Monday that would allow judges the option to sentence someone to surgical castration after the person has been convicted of certain aggravated sex crimes — including rape, incest and molestation — against a child younger than 13.",
      "publishedAt": "2024-06-03T19:34:01Z",
      "title": "Louisiana lawmakers approve surgical castration option for those guilty of sex crimes against kids",
      "url": "https://apnews.com/234cdd9da804382d90dec409756dc445",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/023fdbe95fae408bb0898cce5b94b84a/2000.jpeg"
    },
    {
      "author": null,
      "description": "MINNEAPOLIS (AP) — A juror was dismissed Monday after reporting that a woman dropped a bag of $120,000 in cash at her home and offered her more money if she would vote to acquit seven people charged with stealing more than $40 million from a program meant to feed children during the pandemic.",
      "publishedAt": "2024-06-03T17:24:15Z",
      "title": "Fraud trial juror reports getting bag of $120,000 and promise of more if she'll acquit",
      "url": "https://apnews.com/73610b59bb60bf33f2aa06063bb592d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e58551b2feb474dbc4e1b329e005895/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — At the start of its devastating offensive on the Gaza Strip, Israel set an ambitious goal: destroy Hamas. At the time, the Biden administration committed to the objective, giving Israel considerable stocks of weaponry and voicing its support.",
      "publishedAt": "2024-06-03T18:45:59Z",
      "title": "Biden says Hamas is sufficiently depleted. Israel leaders disagree, casting doubts over cease-fire",
      "url": "https://apnews.com/796948b31c7aa8ed90c51edb41738eef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a65e438c3e9841fd922f7f4ae7aa921a/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The cease-fire proposal announced by President Joe Biden has placed Prime Minister Benjamin Netanyahu at a crossroads, with either path likely to shape the legacy of Israel’s longest-serving and deeply divisive leader.",
      "publishedAt": "2024-06-03T16:12:56Z",
      "title": "Proposed Gaza cease-fire puts Netanyahu at a crossroads that could shape his legacy",
      "url": "https://apnews.com/ca984e5fc518f4f5f0fbd041b5c39ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7edaa14abbe54a07aad699f2aeaba654/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}