{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — Tens of thousands of grieving and angry Israelis surged into the streets Sunday night after six more hostages were found dead in Gaza, chanting “Now! Now!” as they demanded that Prime Minister Benjamin Netanyahu reach a cease-fire with Hamas to bring the remaining captives home.",
      "publishedAt": "2024-09-01T03:11:35Z",
      "title": "Israelis erupt in protest to demand a cease-fire after 6 more hostages die in Gaza",
      "url": "https://apnews.com/29496f50a9b1740bd3905035ffd23052",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30bacf43f25f492d9b90c2d65368f7ed/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Residents of Beirut's southern suburbs have been scrambling to make contingency plans since an Israeli airstrike on an apartment building in a busy neighborhood killed a top Hezbollah commander and touched off fears of a full-scale war.",
      "publishedAt": "2024-09-02T04:16:25Z",
      "title": "Some Lebanese who fear war is coming have an unusual backup plan: Moving to Syria",
      "url": "https://apnews.com/70eeb35e16e813e79c2fd9129415dd78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8f95025c7a14cf98c6d8ba193d33090/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russia launched a barrage of drones, cruise and ballistic missiles at Kyiv, Ukraine's air force said early Monday. Several series of explosions rocked the Ukrainian capital in the early hours of Monday, sending residents into bomb shelters.",
      "publishedAt": "2024-09-02T04:14:53Z",
      "title": "Russia launches a barrage of drones, cruise and ballistic missiles at Kyiv, Ukraine's military says",
      "url": "https://apnews.com/cbdd990b82cae466f15f756f79f2564c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3c719e2d9e846d49f0bb503e5983e10/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris and President Joe Biden are co-headlining a campaign event Monday in the marquee battleground state of Pennsylvania as Harris balances presenting herself as “a new way forward” while remaining intensely loyal to Biden and the policies he has pushed.",
      "publishedAt": "2024-09-02T04:14:45Z",
      "title": "Harris looks to Biden for a boost in Pennsylvania as the two are set to attend a Labor Day parade",
      "url": "https://apnews.com/afd4b7fbd9d747e307a8fb5c1f60d5fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d56c7a6cd8d41809f8ef68e05da1c6c/3000.jpeg"
    },
    {
      "author": "BY OLIVIA DIAZ and BRIAN WITTE",
      "description": "WASHINGTON (AP) — Worries of being uprooted from their jobs have returned for Laura Dodson and other federal workers, who have long been the economic backbone of the nation's capital and its suburbs.",
      "publishedAt": "2024-09-02T04:13:00Z",
      "title": "Federal workers around nation's capital worry over Trump's plans to send some of them elsewhere",
      "url": "https://apnews.com/675c08a888cd27d0a75b01134114460a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f84c7840f05240bb9690e6cdd1c9ea3c/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — A far-right party won a state election for the first time in post-World War II Germany in the country’s east on Sunday, and looked set to finish a very close second to mainstream conservatives in a second vote.",
      "publishedAt": "2024-09-01T06:57:03Z",
      "title": "A German far-right party wins its first state election and is very close in a second",
      "url": "https://apnews.com/97413b8e75871eb35c5e2d8b05e885f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2556ef6b9e6a4f2dbdcd547adeaea8e8/2528.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Donald Trump's campaign issued a statement Sunday from the Gold Star military families who invited him to Arlington National Cemetery as they defended the Republican presidential nominee and insisted that Vice President Kamala Harris is the candidate politicizing fallen U.S.",
      "publishedAt": "2024-09-01T16:33:25Z",
      "title": "Trump issues statement from Gold Star families defending Arlington Cemetery visit and ripping Harris",
      "url": "https://apnews.com/0ef2d4d0d0a1bbecdf77adbc4970a8fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8563e8b71149bab76526d9939ea41d/3000.jpeg"
    },
    {
      "author": "JOHN ROGERS",
      "description": "LOS ANGELES (AP) — Linda Deutsch, a special correspondent for The Associated Press who for nearly 50 years wrote glittering first drafts of history from many of the nation’s most significant criminal and civil trials — Charles Manson, O.J.",
      "publishedAt": "2024-09-02T01:34:59Z",
      "title": "Linda Deutsch, AP trial writer who had front row to courtroom history, dies at 80",
      "url": "https://apnews.com/40b73ccda0b811ed90553c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/affc3541e63d4a5abec7c883f5a89e8d/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — This is pretty much all anyone needs to know about defending champion Coco Gauff's 6-3, 4-6, 6-3 loss to Emma Navarro in the U.S.",
      "publishedAt": "2024-09-01T20:20:41Z",
      "title": "Coco Gauff loses at the U.S. Open to Emma Navarro, ending her title defense with 19 double-faults",
      "url": "https://apnews.com/0286357f22f9031f60c1c2b66e6c912c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4101f6ee27494daf8eb5565d1e61cb75/3000.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "ESPN has gone off the air on a major carrier for the second straight year during the U.S. Open tennis tournament and in the midst of the first full weekend of college football.Disney Entertainment channels went dark on DirecTV Sunday night after the sides were unable to reach a new carriage agreement.",
      "publishedAt": "2024-09-02T01:37:04Z",
      "title": "ESPN networks, ABC and Disney channels go dark on DirecTV on a busy night for sports",
      "url": "https://apnews.com/94bb717f4b1a7f302e73102f23713308",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c96cfef1e264b7bb322bab138b6de14/1889.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}