{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — She's already broken barriers, and now Kamala Harris could shatter several more after President Joe Biden abruptly ended his reelection bid and endorsed her.Biden announced Sunday that he was stepping aside after a disastrous debate performance catalyzed fears that the 81-year-old was too frail for a second term.",
      "publishedAt": "2024-07-21T19:20:50Z",
      "title": "Harris could become first Black woman, first person of South Asian descent to be president",
      "url": "https://apnews.com/96df4c46fab767269056511037776b15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b00168909a4b49a0ae77e30a423cb787/3000.jpeg"
    },
    {
      "author": "BY LISA MASCARO and STEVE PEOPLES",
      "description": "WASHINGTON (AP) — Democrats quickly rallied around Vice President Kamala Harris as their likely presidential nominee Sunday after President Joe Biden 's ground-shaking decision to bow out of the 2024 race, a volatile fast-moving political situation just months before the November election.",
      "publishedAt": "2024-07-21T22:26:44Z",
      "title": "Democrats are rallying around Harris as she vows to 'earn and win' party nomination for president",
      "url": "https://apnews.com/2fb8b1bc88b99e919872e63efdd8c275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea3097c9100240bfad63cf9e8288540f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, SEUNG MIN KIM, ZEKE MILLER and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — At 1:45 p.m. Sunday, President Joe Biden’s senior staff was notified that he was stepping away from the 2024 race.",
      "publishedAt": "2024-07-21T23:18:32Z",
      "title": "Biden's decision to drop out crystalized Sunday. His staff knew one minute before the public did",
      "url": "https://apnews.com/be10da43b9447ef1230c178b15c4760a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31cbe8c808e644fca74b0cd0c6d2d86b/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Sitting in the Oval Office behind the iconic Resolute desk in 2022, an animated President Joe Biden described the challenge of leading a psychologically traumatized nation.",
      "publishedAt": "2024-07-21T19:50:43Z",
      "title": "Biden's legacy: Far-reaching accomplishments that didn't translate into political support",
      "url": "https://apnews.com/5aee4f47ecb317d4f6ef2a2148eba1d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dde32eb91d14997817d14172e06bb9e/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — With President Joe Biden ending his reelection bid and endorsing Vice President Kamala Harris, Democrats now must navigate a shift that is unprecedented this late in an election year.",
      "publishedAt": "2024-07-21T18:28:56Z",
      "title": "What happens next: Joe Biden wants to pass the baton to Kamala Harris. Here's how that might work",
      "url": "https://apnews.com/c8b82fa105953e8f485c769580f7da49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a408bbea5f34738b9941c420b8a281f/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and AAMER MADHANI",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu heads to Washington on Monday, leaving behind a brutal war to make a politically precarious speech before Congress at a time of great uncertainty following Joe Biden’s withdrawal from the presidential race.",
      "publishedAt": "2024-07-21T20:48:50Z",
      "title": "Israel's Netanyahu walks political tightrope on Washington trip following Biden's exit from race",
      "url": "https://apnews.com/9e207697206c7d4f31e4ca07e19c5565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0179ecc96d87421cb879f755d1471a19/2666.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "REHOBOTH BEACH, Del. (AP) — The Secret Service has acknowledged it denied some requests by Republican presidential nominee Donald Trump's campaign for increased security at his events in the years before the assassination attempt on him at a recent rally.",
      "publishedAt": "2024-07-21T12:59:48Z",
      "title": "The Secret Service acknowledges denying some past requests by Trump's campaign for tighter security",
      "url": "https://apnews.com/731d3b76c9900e167523ecfb2ec9a904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fafdbe880d864a328888dcc49e2bdf32/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO and HALELUYA HADERO",
      "description": "NEW YORK (AP) — An owner of a consumer insights research firm couldn't pay her employees, make Friday's deadline to sign a contract for a new business or send key research to a key client. A psychiatrist, who runs a virtual mental health practice in Maryland, saw his business hobbled as some of his virtual assistants and therapists couldn't either make phone calls or log on to their computers.",
      "publishedAt": "2024-07-21T16:16:21Z",
      "title": "Small businesses grapple with global tech outages created by CrowdStrike",
      "url": "https://apnews.com/ad1e4f964d1560d50d08564cce9513d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fc8333b59c148e6a02b0f724603dde2/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "TROON, Scotland (AP) — Xander Schauffele went from the most nerve-wracking putt of his career to the coolest walk toward an 18th green he ever imagined.He won a nail-biter at the PGA Championship in May.",
      "publishedAt": "2024-07-21T17:24:22Z",
      "title": "Xander the Great! Schauffele wins the British Open for his 2nd major this year",
      "url": "https://apnews.com/746d88621b9237c02247a1c0b961ad41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d394bcb59a8407098f9f316ed6ee34b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Joe Biden announced Sunday that he is dropping his reelection bid against Donald Trump, in a social media post that sent political shockwaves around the country and threw an element of turmoil into the election just months before voters go to the polls.",
      "publishedAt": "2024-07-20T12:56:47Z",
      "title": "2024 Election Latest: Biden ends reelection bid, endorses VP Harris for Democratic nomination",
      "url": "https://apnews.com/6199a91e89634fd9921f78c21d7b2e5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c913df0b8f240c680a857f7f2665112/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}