{
  "articles": [
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Hospitals in Gaza said Israeli strikes killed at least 12 Palestinians early Saturday, one of the highest tolls since an October agreement aimed at stopping the fighting. The strikes hit northern and southern Gaza, including an apartment in Gaza City and a tent in Khan Younis, officials at the Nasser and Shifa Hospitals said. The casualties included two women and six children from two different families. Israel’s military did not immediately respond to questions about the strikes. The strikes came a day before a border crossing is set to open in Gaza’s southernmost city, a reminder that the death poll is still rising even as a ceasefire agreement inches forward.",
      "publishedAt": "2026-01-31T06:39:21Z",
      "title": "As ceasefire advances and Rafah nears reopening, hospitals say 12 killed in Israeli strikes in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-strikes-88fcbfdbe8ea6265fa3765b7a407a5a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d20166/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F13%2Fa4ec45ffc1cc32a2bb94b43d7d7a%2Ff9b4463ab55947688db996f59f120eed"
    },
    {
      "author": "Joey Cappelletti, Stephen Groves",
      "description": "President Donald Trump acted quickly to negotiate with Democratic senators on a deal to avert a government shutdown. It was a big change from his stance during last year's record-long standoff, when he refused to budge for weeks during a shutdown. Trump’s urgency reflects a changed political landscape and mounting pressure on the Republican administration. Republicans are still dealing with the fallout from two recent fatal shootings by federal agent shootings in Minneapolis and from the 43-day shutdown last year. Some Republicans are frustrated by Trump's deal with Democrats and are raising the possible of a prolonged shutdown fight when the House returns Monday to vote.",
      "publishedAt": "2026-01-31T14:14:42Z",
      "title": "Trump's dealmaking with Democrats signals change from last shutdown",
      "url": "https://apnews.com/article/government-shutdown-republican-trump-ice-homeland-security-1eb2706ef2c4f91a69a083d23e30ba95",
      "urlToImage": "https://dims.apnews.com/dims4/default/99828de/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F9d%2Ff4ead7a534c5d93600a5f3b1c88c%2F37e21969fa5f4106ba36150585b0ed0a"
    },
    {
      "author": "Meg Kinnard, Kevin Freking",
      "description": "The partial government shutdown is a lot different from the record-long shutdown in the fall. That's mostly because the shutdown that began Saturday may not last long. When the House returns on Monday, lawmakers will try to pass legislation quickly that would end the shutdown. Congress has passed half this year’s funding bills, and that means several important federal agencies and programs continue to operate. Nutrition assistance programs should be unaffected. But funding is lapsing, at least temporarily, for the Pentagon and agencies such as the departments of Homeland Security and Transportation. Essential functions will continue, but workers could go without pay if the impasse drags on.",
      "publishedAt": "2026-01-31T13:14:31Z",
      "title": "Partial government shutdown: Here's what to know",
      "url": "https://apnews.com/article/government-shutdown-homeland-security-pentagon-transportation-2dd3464f56295ff79f136c1c5c24a532",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4f3919/2147483647/strip/true/crop/5198x3464+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Ff4%2Fb6f4906cdd6a11260017c52dfce8%2F410633206f1c4ed5963d5cc82569d9f5"
    },
    {
      "author": "Jack Brook, Jim Mustian, Michael Biesecker",
      "description": "Nurses in Minneapolis doubted federal immigration officers' claims about a Mexican immigrant's severe injuries. ICE agents said Alberto Castañeda Mondragón ran headfirst into a wall while handcuffed. But hospital staff found his injuries inconsistent with that account. The seemingly implausible explanation from ICE is just one example of recent encounters that have undermined the agency’s credibility at Minneapolis hospitals and contributed to mounting friction between medical staff and immigration officers. Workers at the Hennepin County facility say ICE officers have restrained patients in defiance of hospital rules and stayed at their sides for days. The agents have also lingered around the campus and pressed people for proof of citizenship.",
      "publishedAt": "2026-01-31T05:16:52Z",
      "title": "ICE presence at hospitals triggers friction with workers",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospitals-32cd5ca61d495e155d43b7cfd5e563b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d7da3a/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F09%2F8787ac778cb99321148ac51a4f23%2F6937c13d78d24bc3accae6bc3a1858c5"
    },
    {
      "author": "Susie Blann",
      "description": "Emergency power cuts swept across several Ukrainian cities as well as neighboring Moldova, officials said, following a commitment from the Kremlin to U.S. President Donald Trump to pause strikes on Kyiv as Ukraine continues to battle one of its bleakest winters in years. Ukraine’s Energy Minister, Denys Shmyhal, said that the outages had been caused by a technical malfunction affecting several power lines. The shortages follow weeks of Russian strikes against Ukraine’s already struggling energy grid, which have already triggered long stretches of severe power shortages. Moscow has sought to deny Ukrainian civilians heat, light and running water over the course of the war, in a strategy that Ukrainian officials describe as “weaponizing winter.”",
      "publishedAt": "2026-01-31T13:44:47Z",
      "title": "Emergency power cuts hit Ukrainian cities and Moldova",
      "url": "https://apnews.com/article/russia-ukraine-war-energy-ceasefire-blackout-winter-c4c3799925b83c2772bc49ca05d63140",
      "urlToImage": "https://dims.apnews.com/dims4/default/1020fdc/2147483647/strip/true/crop/4373x2914+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fad%2Fdb2546eb1fa833af27ad77a0d1d9%2F9b7140adf0e44d738f8c318f7c1f44b5"
    },
    {
      "author": "Kristin Hall, Sophie Bates",
      "description": "A powerful storm threatening howling winds, flooding and heavy snow is bearing down on the East Coast. Its forecast path includes some coastal communities in the Carolinas more accustomed to hurricanes than blizzard conditions. Temperatures have plummeted for tens of thousands in the Southeast still without power. Forecasters say the subfreezing weather will persist in the East into February. Heavy weekend snow is forecast in the Carolinas, Virginia and northeast Georgia. Parts of North Carolina could see as much as a foot.",
      "publishedAt": "2026-01-31T05:02:21Z",
      "title": "East Coast braces for heavy snow and near-hurricane force winds",
      "url": "https://apnews.com/article/winter-storm-east-coast-snow-floods-ff62eb61d9738850de04f19d5650e910",
      "urlToImage": "https://dims.apnews.com/dims4/default/de180c7/2147483647/strip/true/crop/7951x5298+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F69%2F7f07adba3ccd11ede6ca9cc7871c%2F02c9a79a1a5b49b2b0b17fc31decc987"
    },
    {
      "author": "Michael Casey, Rodrique Ngowi, Patrick Whittle",
      "description": "The U.S. Coast Guard has announced that the search for survivors on a commercial fishing vessel that sank off the coast of Massachusetts with seven aboard has been suspended. The Coast Guard launched a search and rescue mission early Friday after receiving an alert from the 72-foot Lily Jean about 25 miles off Cape Ann. Rescuers located a debris field near where the alert was sent along with a body in the water. On Saturday, after consultation between search and rescue mission coordinators and on-scene commanders, the Coast Guard announced that all reasonable search efforts for the missing crewmembers had been exhausted.",
      "publishedAt": "2026-01-30T19:22:22Z",
      "title": "Coast Guard suspends search for missing from fishing vessel that sank off Massachusetts",
      "url": "https://apnews.com/article/missing-fishing-boat-vessel-massachusetts-5d77c6b45520f1171648868251a0aec5",
      "urlToImage": "https://dims.apnews.com/dims4/default/3f3cdda/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F6f%2F11e97a95dc07026f887ac2fabeb7%2F93d92d064ce548238a9420ce1860f3c1"
    },
    {
      "author": "Mike Schneider",
      "description": "North Carolina and South Carolina have become two hot spots for growth in the United States. North Carolina was the top destination for domestic migrants in the U.S., attracting 84,000 people from other states last year. South Carolina had the highest overall growth rate at 1.5%. Florida, previously a top choice for domestic residents, fell to eighth place as more people chose to move elsewhere. Texas saw a year-to-year decrease in domestic migration, with 67,300 new domestic residents. North Carolina's appeal includes its location, job opportunities and diverse landscapes. Despite changes in domestic migration, Texas and Florida still had the highest number of new residents overall.",
      "publishedAt": "2026-01-31T12:34:54Z",
      "title": "The Carolinas emerge as new population boom states",
      "url": "https://apnews.com/article/florida-texas-north-carolina-south-census-migration-bb9209a3620dafb8c7d248da59d9cd12",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a588e1/2147483647/strip/true/crop/1227x818+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fb5%2F22b1ea73dc7cc78762e00da800b6%2F651062a37abb4ef99f6f35181be02ba0"
    },
    {
      "author": "Tim Reynolds",
      "description": "Paul George of the Philadelphia 76ers has been suspended for 25 games for violating the NBA's anti-drug program. The league announced the suspension on Saturday but did not disclose the substance involved. This is George's first violation, according to the agreement between the NBA and the Players Association. The suspension will cost him approximately $11.7 million of his salary. George is expected to return on March 25 when Philadelphia faces Chicago. The 76ers are currently sixth in the Eastern Conference. George has averaged 16 points in 27 games this season, ranking third on the team.",
      "publishedAt": "2026-01-31T16:53:52Z",
      "title": "NBA suspends Paul George 25 games for violating anti-drug policy",
      "url": "https://apnews.com/article/nba-paul-george-suspension-6366e5e85bede589970ada95a9e73709",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c45066/2147483647/strip/true/crop/2765x1842+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F7b%2Ff0e70839c013e974bd8b62879713%2F90343da829e64b6785af9dcb02551daa"
    },
    {
      "author": "John Pye",
      "description": "Elena Rybakina has won the Australian Open title with a 6-4, 4-6, 6-4 victory over top-ranked Aryna Sabalenka that avenged her loss in the championship decider here in 2023. Three years ago she won the first set but lost the final in three. This time, after breaking in the first game and taking the first set, she rallied after losing the second set and going down 3-0 in the third. She won five straight games and then closed out with an ace on her first championship point.",
      "publishedAt": "2026-01-31T11:06:36Z",
      "title": "Elena Rybakina wins Australian Open by beating No. 1 Aryna Sabalenka for her 2nd Grand Slam title",
      "url": "https://apnews.com/article/sabalenka-rybakina-australian-womens-final-tennis-411b9678d3188a86d4819914cd2b583e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df1fda1/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F52%2F1093e9ecd29050cff197ef469d90%2Fd498f970adc74d3483d6d623560e8cb2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}