{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israel demonstrated its military dominance over adversary Iran in its apparent precision strikes that hit near military and nuclear targets deep in the heart of the country, meeting little significant challenge from Iran's defenses and providing the world with new insights into both militaries' capabilities.",
      "publishedAt": "2024-04-20T04:40:01Z",
      "title": "Israel and Iran's apparent strikes and counterstrikes give new insights into both militaries",
      "url": "https://apnews.com/fdc927f764375fabf88041f5a63f3e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0afb8bf42903465c9eee0cafae235ac4/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House is preparing in a rare Saturday session to approve $95 billion in foreign aid for Ukraine, Israel and other U.S.",
      "publishedAt": "2024-04-20T04:50:16Z",
      "title": "The House is on the brink of approving aid for Ukraine and Israel after months of struggle",
      "url": "https://apnews.com/a8910452e623413bf1da1e491d1d94ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec18f0be2a854f50a4fa92adb8f19ae0/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — After its midnight deadline, the Senate voted early Saturday to reauthorize a key U.S. surveillance law after divisions over whether the FBI should be restricted from using the program to search for Americans’ data nearly forced the statute to lapse.",
      "publishedAt": "2024-04-20T04:47:16Z",
      "title": "Senate passes reauthorization of key US surveillance program after midnight deadline",
      "url": "https://apnews.com/81e991c9f82e77b2fe13f8a3e0e25349",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfe855f61039478c93033cc058878295/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — An Israeli airstrike on a house in Gaza’s southernmost city killed at least nine people, six of them children, hospital authorities said Saturday, as Israel pursued its nearly seven-month offensive in the besieged Palestinian territory.",
      "publishedAt": "2024-04-20T09:33:08Z",
      "title": "Israeli airstrike in southern Gaza city of Rafah kills at least 9 Palestinians, including 6 children",
      "url": "https://apnews.com/05df312cfce4dc546837b2499fdbae02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7257b5deb37454a93dd253169c18a0d/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — A man who doused himself in an accelerant and set himself on fire outside the courthouse where former President Donald Trump is on trial has died, police said.",
      "publishedAt": "2024-04-19T20:29:35Z",
      "title": "Man who set himself on fire outside Trump trial dies of injuries, police say",
      "url": "https://apnews.com/ab7601b86e423d79702b1dda84c5623e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed99061b217f4db283225a81acac9461/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He seems \"selfish and self-serving,” said one woman.The way he carries himself in public \"leaves something to be desired,\" said another.His “negative rhetoric and bias,\" said another man, is what is “most harmful.\"",
      "publishedAt": "2024-04-20T04:05:26Z",
      "title": "Trump forced to listen silently to people insulting him as he trades a cocoon of adulation for court",
      "url": "https://apnews.com/b4fe05a61ed566a587523d1120b46a76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76a1c4537f9d40eba1af485d15eaca3e/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KHARKIV, Ukraine (AP) — A 79-year-old woman makes the sign of the cross and, gripping her cane, leaves her home in a quaint village in northeast Ukraine. Torn screens, shattered glass and scorched trees litter the yard of Olha Faichuk's apartment building in Lukiantsi, north of the city of Kharkiv.",
      "publishedAt": "2024-04-20T05:57:04Z",
      "title": "As Russia edges toward a possible offensive on Kharkiv, some residents flee. Others refuse to leave",
      "url": "https://apnews.com/751d368a403127f2cc0e6e6e5fd43d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/922a1853aeb34bf7acc6b26e8e50be4a/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "CONCORD, Calif. (AP) — A year before I-Ting Quinn's son was old enough for kindergarten, she and her husband had the option to enroll him in “transitional kindergarten,” a program offered for free by California elementary schools for some 4-year-olds.",
      "publishedAt": "2024-04-20T04:39:48Z",
      "title": "California is rolling out free preschool. That hasn't solved challenges around child care",
      "url": "https://apnews.com/b30a4aa930e28228d3046543bdb6e242",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acb6ec7b818a4be48a8ae8cfea63b3a6/3000.jpeg"
    },
    {
      "author": "KRISTIN M. HALL and TOM KRISHER",
      "description": "CHATTANOOGA, Tenn. (AP) — Employees at a Volkswagen factory in Chattanooga, Tennessee, overwhelmingly voted to join the United Auto Workers union Friday in a historic first test of the UAW’s renewed effort to organize nonunion factories.",
      "publishedAt": "2024-04-19T14:03:30Z",
      "title": "Tennessee Volkswagen employees overwhelmingly vote to join United Auto Workers union",
      "url": "https://apnews.com/51544590d8a06efddfa2f6ac7db00fbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f12ff2331c174ffe917eed91a632557c/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — To casual sports fans and people outside northern Utah, it may look like an NHL team fell into Salt Lake City’s lap in the span of two weeks.",
      "publishedAt": "2024-04-20T04:06:44Z",
      "title": "New NHL team marks coming-of-age moment for Salt Lake City as a pro sports hub",
      "url": "https://apnews.com/d5d778f38f081fc27d6de80ff42324d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c25156b86d9f4d169c901c7f21e30a27/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}