{
  "articles": [
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "Senators are launching a budget “vote-a-rama” in a crucial, if dreaded, step toward President Donald Trump's agenda. They are staying late Thursday to debate a $340 billion package Trump’s team says it needs for mass deportations and security measures that top the Republican agenda. It's a sight to see: Senators will be voting in rapid-fashion for hours on one amendment after another diving into intricate policy details, largely from Democrats trying to halt the package. Even if the Senate package is approved, it still needs to be merged with one from the House, which is preparing Trump's “big, beautiful bill” that includes some $4.5 trillion in tax cuts and up to $2 trillion less spending.",
      "publishedAt": "2025-02-20T23:27:03Z",
      "title": "Senate ready to stay up all night to pass GOP budget",
      "url": "https://apnews.com/article/senate-budget-trump-tax-cuts-deportations-48f6565ccb0fd6002734dbb5c3c3ffb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f00250a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F2b%2F9760a09a886139353ec60ab80ebf%2Ffbc94327fe4c40e5b5f54cef989edf41"
    },
    {
      "author": "The Associated Press",
      "description": "U.S. District Judge Christopher Cooper decided Thursday he could not grant a motion from unions representing the workers to stop the layoffs, though he acknowledged chaos caused by Trump's blitz of second-term executive actions.",
      "publishedAt": "2025-02-21T07:51:00Z",
      "title": "Live updates: Federal judge allows Trump's mass firings of federal workers to continue",
      "url": "https://apnews.com/live/trump-presidency-updates-2-21-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/c5442ff/2147483647/strip/true/crop/3919x2204+0+206/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F58%2F690d75317926190943d04199d668%2F76e2ffeb77de45debfae1f079586e106"
    },
    {
      "author": "Martha Bellisle, Claire Rush",
      "description": "The termination letters that ended the careers of thousands of U.S. Forest Service employees mean fewer people and less resources will be available to help prevent and fight wildfires. This raises the specter of even more destructive blazes across the American West this year. Workers who maintained trails, removed combustible debris from forests and secured funding for wildfire mitigation projects say the loss of such positions could impact public safety. Concerns are particularly high in a region where drier and hotter conditions linked to climate change have increased the intensity of wildfires.",
      "publishedAt": "2025-02-21T05:04:23Z",
      "title": "How Trump's mass layoffs raise the risk of wildfires in the US West, according to fired workers",
      "url": "https://apnews.com/article/fired-federal-workers-wildfires-season-trump-west-d915e8ea272b7265912d7eafdbf7420a",
      "urlToImage": "https://dims.apnews.com/dims4/default/8eee82c/2147483647/strip/true/crop/5683x3197+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2Fe2%2F7be9097592804b656508b1a54a5c%2Fea94c8b1a68d493bb6d038aebf6cf702"
    },
    {
      "author": "Christopher Rugaber, Paul Wiseman",
      "description": "An idea first proposed on social media has bubbled up to the White House and received President Donald Trump’s enthusiastic endorsement: Take some of the savings from billionaire Elon Musk’s drive to cut government spending and return it to taxpayers. If Musk’s target of $2 trillion in spending cuts is achieved by next year, supporters of the idea say that about one-fifth of those funds could be distributed to taxpaying households in checks of about $5,000. But before you start planning for a windfall, budget experts say such huge savings — nearly one-third of the federal government’s annual spending — are highly unlikely.",
      "publishedAt": "2025-02-20T21:49:10Z",
      "title": "Could Trump really return DOGE savings to taxpayers?",
      "url": "https://apnews.com/article/trrump-doge-checks-inflation-7fb8b5b004faecc213c325fcbafc7ee9",
      "urlToImage": "https://dims.apnews.com/dims4/default/29ffc1e/2147483647/strip/true/crop/5754x3237+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F16%2F21f1a4e7810a1e71dd8822875058%2F1880b583787e4c13a6504341af1af3ee"
    },
    {
      "author": "Bruce Schreiner",
      "description": "The scramble to fill Mitch McConnell’s Senate seat in Kentucky began as soon as the Republican revealed he won’t seek reelection in 2026. Former state Attorney General Daniel Cameron jumped into the campaign Thursday. He's looking for a political comeback after losing his bid for governor in 2023. Elsewhere in the GOP, U.S. Rep. Andy Barr says he'll announce his plans soon. And businessman Nate Morris has signaled his interest in the race. The prize is a Senate seat that will be open for the first time in more than 40 years. McConnell is retiring when his current term ends.",
      "publishedAt": "2025-02-21T05:00:41Z",
      "title": "Mitch McConnell's retirement sets off scramble among Kentucky GOP for his replacement",
      "url": "https://apnews.com/article/mcconnell-senate-seat-kentucky-gop-primary-replacement-1c40ba923cf0116434b50b74ba40022b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7076529/2147483647/strip/true/crop/4056x2282+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F6f%2F7a0690dd858cde8e21782c40f568%2Fc0ff353d5e2348c1b168b0b556a446aa"
    },
    {
      "author": "Amanda Seitz, Brian Slodysko",
      "description": "Dr. Mehmet Oz holds millions of dollars worth of shares in health insurance, fertility, pharmaceutical and vitamin companies. That's according to a newly released government ethics report on the celebrity heart surgeon nominated by President Donald Trump to lead the Centers for Medicare and Medicaid Services. The disclosure shows that the former talk show host has amassed a net worth estimated between $98 million and $332 million. The disclosure lists asset values in ranges, but does not give precise dollar figures. His filings show the 64-year-old’s wealth has swelled, in part, from for-profit health care companies that he would wield significant power over as head of CMS.",
      "publishedAt": "2025-02-20T22:18:57Z",
      "title": "Dr. Mehmet Oz holds millions from companies that he'd wield power over if confirmed, report shows",
      "url": "https://apnews.com/article/mehmet-oz-ethics-medicare-medicaid-financial-disclosure-68464b4021a8216436f0a4e98b6a2f88",
      "urlToImage": "https://dims.apnews.com/dims4/default/37b84ca/2147483647/strip/true/crop/2781x1564+0+145/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fa6%2Fd827b91538b6504b06ad9c289288%2F4e86ae10bc1b40b78fb078d87384ecec"
    },
    {
      "author": "Heather Hollingsworth, Collin Binkley, Annie Ma",
      "description": "As President Donald Trump reshaped the Education Department, parents say investigations and mediations into kids' disability rights cases ground to a halt. Standing up for children with disabilities has been a primary role of the department, which enforces the Individuals with Disabilities Education Act. Historically, most complaints to the department have involved disability discrimination. The freeze on pending cases and Trump’s calls to dismantle the department altogether left many parents worrying about the federal government’s commitment to disabled students. After The Associated Press asked the Education Department for comment on this reporting, a spokesperson said the department ended the pause on reviews of disability complaints Thursday.",
      "publishedAt": "2025-02-20T22:20:45Z",
      "title": "Education Department stalled cases for kids with disabilities, IEPs under Trump",
      "url": "https://apnews.com/article/education-department-iep-disability-civil-rights-trump-85a6687d9ef1f5236f2637924d66a560",
      "urlToImage": "https://dims.apnews.com/dims4/default/15405a1/2147483647/strip/true/crop/4917x2766+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F30%2F00d85808e236e1828df32e30c018%2F58ac1ce311cf4ae5b01415a71311e400"
    },
    {
      "author": "Areej Hazboun",
      "description": "Israeli Prime Minister Benjamin Netanyahu has vowed revenge for what he described as a “cruel and malicious violation” of the ceasefire agreement after a body that Hamas released as part of the deal was found to not be that of an Israeli mother of two young boys, as the militants had promised. Hamas said it would “conduct a thorough review” of the information regarding the body, and suggested a possible mix-up of remains might have occurred due to Israeli bombing of the area where the Israeli hostages were being held, where other Palestinians were also present. The incident raised questions about the future of the fragile ceasefire. But in the short term, there were indications the deal’s next step, Saturday's release of six living hostages, would proceed as planned.",
      "publishedAt": "2025-02-21T09:40:25Z",
      "title": "Netanyahu decries release of wrong body as a ceasefire violation. Hamas pledges to investigate",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-21-2025-e8f2f233b4c07a23f06040a808081642",
      "urlToImage": "https://dims.apnews.com/dims4/default/62c641f/2147483647/strip/true/crop/5457x3070+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F0a%2F540657b6f11d42903e28b9fac0d9%2F4c92992dc9e24aa08582a72774757573"
    },
    {
      "author": "Illia Novikov",
      "description": "President Donald Trump’s envoy to Ukraine and Russia says he's held “extensive and positive discussions” with Ukraine’s President Volodymyr Zelenskyy about the three-year war. He praised the Ukrainian leader as an “embattled and courageous leader of a nation at war.” Retired U.S. Lt. Gen. Keith Kellogg — who traveled to Kyiv on Wednesday and whose planned news conference with Zelenskyy on Thursday was changed at the last minute to a simple photo opportunity — struck a positive tone Friday after saying it was “a long and intense day” of talks with Ukraine’s senior leadership. His comments marked a departure from rebukes of Zelenskyy by Trump and other senior U.S. officials that appeared to reflect an abrupt deterioration of relations.",
      "publishedAt": "2025-02-21T15:17:20Z",
      "title": "US envoy praises Zelenskyy after Trump's censure of the Ukrainian leader",
      "url": "https://apnews.com/article/russia-ukraine-zelenskyy-trump-0bc41d62c4fdfa00b4358f9043ee9991",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d40117/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F04%2Ff8deb40d015c5ac7ff5c30c21a89%2F4d50ccc049954677b4feac983759bc32"
    },
    {
      "author": "Ellen Knickmeyer",
      "description": "Court orders have had only limited effect in the Trump administration’s dismantling of the U.S. Agency for International Development. USAID staffers also assert that some stationed abroad have been left in precarious situations. A federal judge is due to decide Friday whether to allow the administration to move forward with plans to place all but a small fraction of USAID staffers on leave. Affidavits from USAID staffers and spouses accuse the Trump administration of stalling medical evacuations for some two dozen women in high-risk pregnancies abroad. The administration says it is taking all required care of staffers.",
      "publishedAt": "2025-02-21T16:40:57Z",
      "title": "Trump administration stalling medical evacuation for USAID staffers, spouses in peril, suits charge",
      "url": "https://apnews.com/article/trump-usaid-foreign-aid-staffing-cuts-lawsuits-d1ec029b4d14c37c25abc5dc07066471",
      "urlToImage": "https://dims.apnews.com/dims4/default/f790d9b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Ffa%2F642d1dd8550ad27199bdad25bf98%2F0715fb2837ee4e1e82437a7f951e8c9a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}