{
  "articles": [
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — A 15-year-old student opened fire inside a study hall at a small Christian school in Wisconsin, killing a teacher and teenager and prompting a swarm of police officers responding to a second grader's 911 call.",
      "publishedAt": "2024-12-17T05:17:11Z",
      "title": "15-year-old girl fatally shoots teacher and teenager at a Christian school in Wisconsin",
      "url": "https://apnews.com/a8e1ee353d7fdab2b86dfb355938d871",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fae855d2105749f1815fd6552c23c7db/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Two people were killed and others were injured Monday in a shooting at a private Christian school in Madison, Wisconsin.",
      "publishedAt": "2024-12-16T20:18:05Z",
      "title": "Things to know about the shooting at a Christian school in Wisconsin",
      "url": "https://apnews.com/3df4f40327e70aa863c4b5b36fd0a04b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ace3ce7eb469412b89b01df44c9d8155/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A senior Russian general was killed Tuesday by a bomb hidden in a scooter outside his apartment building in Moscow, a day after Ukraine’s security service leveled criminal charges against him. A Ukrainian official said the service carried out the attack.",
      "publishedAt": "2024-12-17T06:35:48Z",
      "title": "A Russian general was killed by a bomb in Moscow. Ukraine official says secret service was behind it",
      "url": "https://apnews.com/9656bce946a9f552454df9debe5fbd18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11b938498f5d4b26a55486944d2864a0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike in Gaza killed at least eight people from the same family, most of them women and children, Palestinian medics said Tuesday. The strike late Monday hit a house in Gaza City’s central neighborhood of Daraj, according to the Health Ministry’s ambulance and emergency service.",
      "publishedAt": "2024-12-17T07:37:54Z",
      "title": "Middle East latest: Israeli strike in Gaza kills at least 8 from the same family, Palestinians say",
      "url": "https://apnews.com/3df6c0a90a0d58efc30e4b5f7143c96f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebe5822a350a47eab30b9d9aab48b2a4/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "After months of deadlock, Israel and Hamas appear to be moving closer toward a ceasefire to end their 14-month war.",
      "publishedAt": "2024-12-16T22:13:45Z",
      "title": "Negotiators say Israel and Hamas are inching toward a ceasefire deal. This is what it may look like",
      "url": "https://apnews.com/264087c7a547031a9433ecbbdcd920d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0e10fe5ddd24e558b9fa141f197f322/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A judge Monday refused to throw out President-elect Donald Trump’s hush money conviction because of the U.S.",
      "publishedAt": "2024-12-17T00:16:36Z",
      "title": "Judge rejects Trump’s bid to toss hush money conviction because of Supreme Court immunity ruling",
      "url": "https://apnews.com/908465ed0b7f2005c72226b5b2546260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38871df356fe4eceba6c2dd3cb88250a/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ADRIANA GOMEZ LICON",
      "description": "President-elect Donald Trump on Monday held a wide-ranging news conference in which he said he would preserve access to the polio vaccine but equivocated on other vaccines, pledged to look at bringing down the costs of pharmaceuticals and expressed doubts that his daughter-in-law might be Florida's next senator.",
      "publishedAt": "2024-12-16T18:44:08Z",
      "title": "Trump says he's a 'believer' in polio vaccine, and other news conference takeaways",
      "url": "https://apnews.com/d2eecc2a57652976a0835cdd1d1a50f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a06b00ed46374aa19dc6fe1cc33bca50/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — A powerful magnitude 7.3 earthquake struck just off the coast of Vanuatu on Tuesday, causing widespread destruction in the South Pacific island nation as the injured began arriving at a hospital and unconfirmed reports of casualties emerged.",
      "publishedAt": "2024-12-17T02:42:06Z",
      "title": "Magnitude 7.3 earthquake causes widespread damage in Pacific island nation of Vanuatu",
      "url": "https://apnews.com/3e4cc1e02bc0ec62d5931b00286688ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d13de2887c64a82aee2f58e5932a45a/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s acting leader vowed Tuesday to convey to the world that things are back to normal following parliament’s impeachment of conservative President Yoon Suk Yeol, as rival parties squabble the appointments of court justices who will determine whether to unseat or reinstate Yoon.",
      "publishedAt": "2024-12-17T06:02:53Z",
      "title": "Battle erupts over South Korean court that will determine the fate of impeached Yoon",
      "url": "https://apnews.com/2917db5da7c461ef3eb732e17f938114",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71c618b3a9f34a55ab2b73ab3ae32862/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — The chairs stay occupied at 12 Pell. Client after client, they come through the tiny barbershop on a narrow side street in Manhattan’s Chinatown. They come for the cuts, sure.",
      "publishedAt": "2024-12-17T05:08:48Z",
      "title": "Younger Asian Americans navigate something new to their generation: Taking up space",
      "url": "https://apnews.com/3e042c230d94f01b5ce67f44eb917555",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a6cdfe5af2e46a7b20955204b895ea1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}