{
  "articles": [
    {
      "author": "NOAH TRISTER, TARA COPP and AAMER MADHANI",
      "description": "LANDOVER, Md. (AP) — President-elect Donald Trump huddled with allies and a Republican cause célèbre at Saturday's Army-Navy football game, taking in one of the most storied rivalries in college sports while spotlighting his emerging national security team.",
      "publishedAt": "2024-12-14T14:16:38Z",
      "title": "Trump gets warm welcome as he watches Army-Navy game alongside key allies, nominees and Daniel Penny",
      "url": "https://apnews.com/85da138b3ac130b211afc414bf43514a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4562d4be94e04e2884ae68dfc36bb377/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — ABC News has agreed to pay $15 million toward Donald Trump’s presidential library to settle a defamation lawsuit over anchor George Stephanopoulos' inaccurate on-air assertion that the president-elect had been found civilly liable for raping writer E.",
      "publishedAt": "2024-12-14T20:52:54Z",
      "title": "ABC agrees to give $15 million to Donald Trump's presidential library to settle defamation lawsuit",
      "url": "https://apnews.com/04aea8663310af39ae2a85f4c1a56d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07511248e1bb437b83cf5bdeea5c0081/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "WASHINGTON (AP) — Senate Republican leader Mitch McConnell, a childhood polio survivor, said any of President-elect Donald Trump’s nominees seeking confirmation should “steer clear” of efforts to discredit the polio vaccine.",
      "publishedAt": "2024-12-14T21:53:51Z",
      "title": "Trump nominees should ‘steer clear’ of undermining polio vaccine, McConnell says",
      "url": "https://apnews.com/f7b7ffbc4ea2b274df658c85374a7a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/397cee81268841d4bef8466f7dccd11d/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition leader on Sunday urged the Constitutional Court to rule swiftly on a bid to remove President Yoon Suk Yeol from office, a day after parliament voted to impeach him over a short-lived attempt to impose martial law.",
      "publishedAt": "2024-12-15T02:35:44Z",
      "title": "South Korea’s opposition chief urges top court to act swiftly on impeachment",
      "url": "https://apnews.com/ca583315453be30766372702120f94e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e50da849fcb44ce6b0aae2c91fb06d40/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "AQABA, Jordan (AP) — American officials have been in direct contact with the terrorist-designated rebel group that led the overthrow of Syrian President Bashar Assad, U.S.",
      "publishedAt": "2024-12-14T15:44:36Z",
      "title": "US officials have been in direct contact with the Syrian rebel group that ousted Assad, Blinken says",
      "url": "https://apnews.com/5fcff887a74dc9ec36e483c0b601a8c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca6e13cf5ad4f2ca1b2c7e0854c251f/1920.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI and KEN MILLER",
      "description": "A large number of mysterious drones have been reported flying over parts of New Jersey and the East Coast in recent weeks, sparking speculation and concern over who sent them and why.",
      "publishedAt": "2024-12-14T18:21:17Z",
      "title": "Mystery drone sightings keep happening in New Jersey. Here's what we know (and don't know)",
      "url": "https://apnews.com/e6f565f5d51d9d47ad140e7e7d131842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e8e598ddc64153a160fe9c93854ec2/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — A major ice storm created treacherous driving conditions across Iowa and eastern Nebraska this weekend and prompted temporary closures of Interstate 80 after numerous cars and trucks slid off the road.",
      "publishedAt": "2024-12-14T17:48:12Z",
      "title": "Storms encase Iowa and eastern Nebraska in ice and generate first tornado warning in San Francisco",
      "url": "https://apnews.com/fc5493b70887cb3c25d97190ffbf66b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/708e9049eb9f4c8cae537de61f83f1fe/1026.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE",
      "description": "TBILISI, Georgia (AP) — Former soccer player Mikheil Kavelashvili became president of Georgia on Saturday, as the ruling party tightened its grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ruler Russia.",
      "publishedAt": "2024-12-14T05:23:30Z",
      "title": "Ex-soccer player Kavelashvili becomes Georgia's president in a blow to country's EU aspirations",
      "url": "https://apnews.com/3a7f5018879c77b6c596d312a163b79c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ec49d5d35694016a73b253ba8c44f36/1920.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "A woman who accused rappers Jay-Z and Sean “Diddy” Combs of sexually assaulting her when she was 13 at an awards show after-party has acknowledged certain inconsistencies in her story, while her lawyer said he will continue to vet her claims.",
      "publishedAt": "2024-12-14T06:50:53Z",
      "title": "Woman accusing Jay-Z and Sean 'Diddy' Combs of sexual assault acknowledges inconsistencies",
      "url": "https://apnews.com/667e3c5f2abca341975741e536969d71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fab4810123c4472fa528d7ef863b9682/3000.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — Travis Hunter turned every play into prime time — on both sides of the ball — and ultimately took home the Heisman Trophy.Now he’s got a leg up on his celebrity coach at Colorado.",
      "publishedAt": "2024-12-15T01:57:47Z",
      "title": "Colorado two-way star Travis Hunter wins Heisman Trophy as college football's top player",
      "url": "https://apnews.com/c76c411ca04108018eefb18beaa649fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2cd5029ed2b4af4a9e62409333c876a/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}