{
  "articles": [
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Thursday he will nominate former Florida Attorney General Pam Bondi to lead the Justice Department, turning to a longtime ally after his first choice, Matt Gaetz, withdrew his name from consideration amid scrutiny over sex trafficking allegations.",
      "publishedAt": "2024-11-21T17:33:02Z",
      "title": "Trump chooses loyalist Pam Bondi for attorney general pick after Matt Gaetz withdraws",
      "url": "https://apnews.com/248b46ba0c882dd46d661568e8bd3bd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9016ead6cd24b2d81389cd2afd57a3e/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "MARTIN, Tenn. (AP) — Losing a Cabinet nominee to the confirmation process isn't unheard of for incoming presidents — including for Donald Trump when he was elected the first time.Matt Gaetz's decision to pull his name Thursday from consideration for attorney general — amid continued fallout over a federal sex trafficking investigation — represents the first indication of resistance that the president-elect could face from his own party, including picks facing allegations of sexual misconduct or other questions.",
      "publishedAt": "2024-11-22T05:00:57Z",
      "title": "Gaetz's withdrawal highlights how incoming presidents often lose Cabinet nominees",
      "url": "https://apnews.com/1c7daf57241bee1ae49dc817a0afba1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed1a122471b046f6b0f4b09413957416/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE (AP) — The world’s top war-crimes court issued arrest warrants Thursday for Israeli Prime Minister Benjamin Netanyahu, his former defense minister and Hamas’ military chief, accusing them of crimes against humanity in connection with the 13-month war in Gaza.",
      "publishedAt": "2024-11-21T12:02:05Z",
      "title": "Top war-crimes court issues arrest warrants for Netanyahu and others in Israel-Hamas fighting",
      "url": "https://apnews.com/73c854d072e0a1a41b19b2cb2cdd07fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92bbbfc2f9894339bb404337ba8bdc2f/1920.jpeg"
    },
    {
      "author": "BY WAFAA SHURAFA and FATMA KHALED",
      "description": "DEIR AL-BALAH, The Gaza Strip (AP) — Yasmin Eid coughs and covers her face, cooking a small pot of lentils over a fire fed with twigs and scrap paper in the tent she shares with her husband and four young daughters in the Gaza Strip.",
      "publishedAt": "2024-11-22T05:09:49Z",
      "title": "Many in Gaza are eating just once a day, as hunger spreads amid aid issues",
      "url": "https://apnews.com/9500a5d59f31c7dd4722115fe5dba83e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73383c07a13e45fc99e5b2100398db16/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The new ballistic missile fired by Russia struck a military-industrial facility in the central Ukrainian city of Dnipro, but its real mission was delivering a deadly new message to NATO.",
      "publishedAt": "2024-11-21T20:32:30Z",
      "title": "Putin touts Russia's new missile and delivers a menacing warning to NATO",
      "url": "https://apnews.com/d50183ccfc28b10c71e93f3e68159a61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e4fb696d6340bcaaaba612b0e860b5/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Russia has supplied air defense missile systems to North Korea in exchange for sending its troops to support Russia's war efforts against Ukraine, a top South Korean official said Friday.",
      "publishedAt": "2024-11-22T07:06:03Z",
      "title": "South Korea says Russia supplied air defense missiles to North Korea in return for its troops",
      "url": "https://apnews.com/1efc0e29d5d6225fb85891ef6c822e4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7efa7d03ae8418e9f0a55e27ad031ef/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI and DAVID RISING",
      "description": "VANG VIENG, Laos (AP) — A second Australian teenager who fell critically ill after drinking tainted alcohol in Laos has died in a hospital in Bangkok, her family said Friday, bringing the death toll in the mass poisoning of foreign tourists to six.",
      "publishedAt": "2024-11-22T07:34:52Z",
      "title": "Second Australian teen dies in tainted alcohol case in Laos that has killed 6 tourists",
      "url": "https://apnews.com/764c8679b557f84472e0ab1647f0695e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22b8df5a85534a738c2b3f523381fb2e/1920.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Police indicted Brazil’s former president Jair Bolsonaro and 36 others for allegedly attempting a coup to keep the right-wing leader in office after his defeat in the 2022 election.",
      "publishedAt": "2024-11-22T05:08:11Z",
      "title": "Brazilian police indict Bolsonaro for alleged attempted coup, threatening his political career",
      "url": "https://apnews.com/83440d5a5dda43dc23bbcd58a2e52fde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/788c33b7cf5d4bc888f84b6efd334233/3000.jpeg"
    },
    {
      "author": "GODOFREDO A. VÁSQUEZ, JANIE HAR and CHRISTOPHER WEBER",
      "description": "FORESTVILLE, Calif. (AP) — A major storm moving through Northern California on Thursday dropped heavy snow and record rain, flooding some areas, after killing two people and knocking out power to hundreds of thousands in the Pacific Northwest.",
      "publishedAt": "2024-11-21T06:12:06Z",
      "title": "Storm dumps record rain and heavy snow on Northern California. Many in Seattle still without power",
      "url": "https://apnews.com/8d3f42726c42c64355a47e3f25de27d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77bd75bc372048de87339f6d23f31bc7/1920.jpeg"
    },
    {
      "author": "SIBI ARASU, MELINA WALLING, SETH BORENSTEIN and MICHAEL PHILLIS",
      "description": "BAKU, Azerbaijan (AP) — Countries at the United Nations climate summit amped up the pressure on themselves Friday by entering the last scheduled day of talks with no visible progress on their chief goals.",
      "publishedAt": "2024-11-22T05:51:40Z",
      "title": "Countries at UN climate summit under pressure with no finance deal entering final day",
      "url": "https://apnews.com/c0c88a55939837b6898df5cfbc640cfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b3a6dc970bd4990986ab30874716504/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}