{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Caitlin Clark of Iowa is the AP Player of the Year in women's college basketball for the second straight season.",
      "publishedAt": "2024-04-04T16:25:20Z",
      "title": "Caitlin Clark of Iowa is the AP Player of the Year in women's college basketball for the second straight season",
      "url": "https://apnews.com/12055165c3635e8110406230b143f1ba",
      "urlToImage": ""
    },
    {
      "author": "ERIKA KINETZ and SOLOMIIA HERA",
      "description": "DOVHENKE, Ukraine (AP) — The smell in the car is sick and sweet, the overpowering scent of corpses that have lain too long in muck and ruin, the ones the dogs didn’t devour. Oleksii Yukov, a 38-year-old martial arts instructor who leads a team of volunteer body collectors in Ukraine, doesn’t notice.",
      "publishedAt": "2024-04-04T08:16:27Z",
      "title": "The true toll of the war in Ukraine is measured in bodies. This man brings them home, one at a time",
      "url": "https://apnews.com/43bfc0848fdaa9b36d63abfa8c24f885",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00c7905e99e74251b6e52f4fddf4ac40/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "World Central Kitchen demanded an independent investigation into the Israeli strikes that killed seven of its staff in Gaza, as Israel faces growing isolation over the deaths of six foreign aid workers and a Palestinian driver helping deliver desperately needed food to isolated and starving residents.",
      "publishedAt": "2024-04-04T06:22:53Z",
      "title": "The Latest | Food aid charity demands independent investigation of Israeli strikes",
      "url": "https://apnews.com/e4455d35a27b7f511a7016d34edc0760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffc355b39d9c4abdac9d631933fe2c42/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — More than 600 British jurists, including three retired judges from the U.K. Supreme Court, are calling on the government to suspend arms sales to Israel, piling pressure on Prime Minister Rishi Sunak after the deaths of three U.K.",
      "publishedAt": "2024-04-04T11:15:24Z",
      "title": "Senior UK jurists have joined calls to stop arms sales to Israel. Other allies face similar pressure",
      "url": "https://apnews.com/19430d222e6a2f61ffd264e9e494bf63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f8eb41d7be64f16b80ef066bc65b564/3000.jpeg"
    },
    {
      "author": "JOHNSON LAI and KANIS LEUNG",
      "description": "HUALIEN, Taiwan (AP) — Rescuers searched Thursday for missing people and worked to reach hundreds stranded when Taiwan's strongest earthquake in 25 years sent boulders and mud tumbling down mountainsides, blocking roads.",
      "publishedAt": "2024-04-04T03:17:52Z",
      "title": "Rescuers in Taiwan search for those missing or stranded after major earthquake kills 10",
      "url": "https://apnews.com/f7e6df36441dc3cde69038e0744aa01d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e961e4a1f4574d5fbbf09400898ccd96/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Video and photos of suspects in a mass shooting show them apparently being brutalized by Russian security forces — without any rebuke from authorities.",
      "publishedAt": "2024-04-04T05:16:34Z",
      "title": "In the aftermath of the Moscow concert hall attack, is a harsher era under Putin in the works?",
      "url": "https://apnews.com/a59085c6fe690ea55d43d132ea628eb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5785d560a19f44dd984a4d1ae163b4e2/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "McALESTER, Okla. (AP) — A man convicted of shooting and killing two people in Oklahoma City more than two decades ago was executed Thursday morning. Michael Dewayne Smith received a lethal injection at the Oklahoma State Penitentiary in McAlester and was pronounced dead at 10:20 a.m., Oklahoma Department of Corrections spokesperson Lance West said.",
      "publishedAt": "2024-04-04T04:00:45Z",
      "title": "Oklahoma executes man convicted of double slaying in 2002",
      "url": "https://apnews.com/d1bb3ebd47beca135caef86e3fabf3c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45b3d4301c624a09842ba6a56c897879/3000.jpeg"
    },
    {
      "author": "DAN GELSTON",
      "description": "PHILADELPHIA (AP) — He surveyed the Arizona crowd that had paid to catch a wrestling glimpse of the planet's mightiest heavyweight, as measured in both box-office heft and ink-stained muscles. Then The Rock let the abuse fly.",
      "publishedAt": "2024-04-04T14:51:06Z",
      "title": "In the coliseum of American over-the-topness, WrestleMania stands alone",
      "url": "https://apnews.com/d7316f82a66bc805f624ab2e0f38e1b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7982fc93645e43138f17031da2348cd4/2000.jpeg"
    },
    {
      "author": "DEEPA BHARATH, DAVID CRARY and MARIAM FAM",
      "description": "Throughout history, solar eclipses have had profound impact on adherents of various religions around the world. They were viewed as messages from God or spiritual forces, inducing emotions ranging from dread to wonder.",
      "publishedAt": "2024-04-04T12:17:13Z",
      "title": "Awe and dread: How religions have responded to total solar eclipses over the centuries",
      "url": "https://apnews.com/c2a30776d76766e663822678f3d05914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b26390943dec4ca2a09aa9c5019e6e34/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — The maker of a drug for Lou Gehrig’s disease that recently failed in a large study said Thursday it will pull the medicine from the market, acknowledging it didn't help patients with the deadly neurological condition.",
      "publishedAt": "2024-04-04T14:06:16Z",
      "title": "ALS drug will be pulled from US market after study showed patients didn't benefit",
      "url": "https://apnews.com/5fca44189f7e33f7645cb8d019197442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bfc6ac2e73249e2b57453c6d674e8a9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}