{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB, MOHAMMAD ZAATARI and SAMY MAGDY",
      "description": "QANA, Lebanon (AP) — Israeli strikes have killed at least 15 people in the southern Lebanese town of Qana, which has long been associated with civilian deaths after Israeli strikes during previous conflicts with Hezbollah.",
      "publishedAt": "2024-10-16T06:10:50Z",
      "title": "Israeli strikes kill at least 15 in Qana, a Lebanese town with a dark history of civilian deaths",
      "url": "https://apnews.com/f18b2e0f5e05eb11a3c2ee29c16ed867",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecc601796e4c4f6c9f804662b6eca25a/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and MATT BROWN",
      "description": "GRAND RAPIDS, Mich. (AP) — Vice President Kamala Harris rallies in Michigan’s union halls, standing alongside the state’s most powerful labor leader, while former President Donald Trump fires back from rural steel factories, urging middle-class workers to trust him as the true champion of their interests.",
      "publishedAt": "2024-10-16T04:05:23Z",
      "title": "Unions face a moment of truth in Michigan in this year's presidential race",
      "url": "https://apnews.com/4faf892e9b91ae7cd1a6ffecaceb8d7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80c8fe5f07834a39b6bbfddc279eb335/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A judge has blocked a new rule that requires Georgia Election Day ballots to be counted by hand after the close of voting. The ruling came a day after the same judge ruled that county election officials must certify election results by the deadline set in law.",
      "publishedAt": "2024-10-15T14:00:11Z",
      "title": "Georgia judge blocks ballot counting rule and says county officials must certify election results",
      "url": "https://apnews.com/03f6bc623d9f6aeeb3f9dc47823d03f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b8b38df5b74c358a875bd159af0fad/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy was set to at least partially unveil a plan to win the war against Russia to his country's Parliament on Wednesday after weeks of dropping hints about the blueprint to lukewarm Western allies, including U.S.",
      "publishedAt": "2024-10-16T04:03:35Z",
      "title": "Zelenskyy to unveil 'victory plan' to Ukrainian lawmakers after presenting it to Western allies",
      "url": "https://apnews.com/f3525550f6986f590777193a7385c0c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b504584b4992440897baef6caf18f3f9/3000.jpeg"
    },
    {
      "author": "LLAZAR SEMINI",
      "description": "SHENGJIN, Albania (AP) — An Italian navy ship on Wednesday docked at the Albanian port of Shengjin to bring the first group of 16 migrants intercepted in international waters to be processed there.",
      "publishedAt": "2024-10-16T06:15:04Z",
      "title": "First Italian ship with 16 intercepted migrants docks at Albanian port to process asylum request",
      "url": "https://apnews.com/3dd82dfd6414f8cee84b74ca15fa0b31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8eec4f81106c41b3b8248ba426f8b0a7/1920.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — More than 90 people have been killed and 50 others injured after a gasoline tanker overturned in Nigeria and sparked an explosion as dozens of people rushed to the vehicle to scoop up the fuel, police said Wednesday.",
      "publishedAt": "2024-10-16T09:21:36Z",
      "title": "At least 90 people killed and 50 injured after a gasoline tanker explodes in Nigeria, police say",
      "url": "https://apnews.com/7af046fdb8016e79d14744666013fbf2",
      "urlToImage": ""
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Cellphone chats have become death sentences in the continuing, bloody factional war inside Mexico's Sinaloa drug cartel.",
      "publishedAt": "2024-10-16T04:03:59Z",
      "title": "In the heartland of Mexico's Sinaloa cartel, the old ways have changed and violence rages",
      "url": "https://apnews.com/b18bbd3abb4ba528444fef3598bdf05a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b48f3bd66134eccbbef7b472f0cc9e8/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER, MORIAH BALINGIT and MICHAEL MELIA",
      "description": "Tens of thousands of students in the Southeast are dealing with school disruptions after Hurricane Helene wreaked havoc so severe — on homes, campuses and municipal power and water systems — that some districts have no idea when they will reopen.",
      "publishedAt": "2024-10-16T04:10:38Z",
      "title": "Many schools are still closed weeks after Hurricane Helene. Teachers worry about long-term impact",
      "url": "https://apnews.com/0375767ce9ff4754dd95dd29423fc788",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0c0def79c8649a891ad6c4fda805652/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON and CLAIRE SAVAGE",
      "description": "NEW YORK (AP) — Just how much of a setback was the COVID-19 pandemic for U.S. working women? Although women who lost or left their jobs at the height of the crisis have largely returned to the workforce, a recent finding points to the price many paid for stepping back: In 2023, the gender wage gap between men and women working full-time widened year-over-year for the first time in 20 years, according to an annual report from the U.S.",
      "publishedAt": "2024-10-16T10:00:26Z",
      "title": "What's behind the widening gender wage gap in the US?",
      "url": "https://apnews.com/dce2d7cf2c004dfe5322fffaf5fdbbcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a03519be3ff14630814d76be293c8284/3000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "AMSTERDAM (AP) — The annex where the young Jewish diarist Anne Frank hid from Nazi occupiers during World War II is heading to New York.A full-scale replica of the rooms that form the heart of the Anne Frank House museum on one of Amsterdam's historic canals is being built in the Netherlands and will be shipped across the Atlantic for a show titled “ Anne Frank The Exhibition ” at the Center for Jewish History in Manhattan.",
      "publishedAt": "2024-10-16T04:18:11Z",
      "title": "A full-scale replica of Anne Frank's hidden annex is heading to New York for an exhibition",
      "url": "https://apnews.com/8d093b71a48dcb84983a4ecf9d497747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ee92cef035148189395513a90062550/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}