{
  "articles": [
    {
      "author": "Josh Funk",
      "description": "Warren Buffett has shocked an arena full of his shareholders by announcing that he wants to retire at the end of the year. Buffett said he will recommend to Berkshire Hathaway’s board that Greg Abel should become CEO at the end of the year. Previously the 94-year-old investor has always said he had no plans to retire. But Abel has been his designated successor for years, and Abel has already been managing all of Berkshire's non-insurance businesses.",
      "publishedAt": "2025-05-03T12:55:19Z",
      "title": "Warren Buffett says he wants to retire from Berkshire Hathaway at end of year",
      "url": "https://apnews.com/article/warren-buffett-berkshire-hathaway-shareholders-annual-meeting-a421061233f99859673fb131ce020d4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3915b4e/2147483647/strip/true/crop/2237x1258+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F18%2F7540d4d8dd95aff54dedf5718b1e%2F9435d146cce44a59ad84beb0a939cf42"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australians are voting in Australia’s general election as Prime Minister Anthony Albanese and his rival Peter Dutton ended campaigning along the east coast. Both Albanese and Dutton began Saturday in the electorally-crucial city of Melbourne. Albanese returned home to Sydney and Dutton to his hometown of Brisbane to vote. Albanese’s center-left Labor Party is seeking a second three-year term. Dutton wants to become the first opposition leader to oust a first-term government since 1931, when Australians were reeling from the Great Depression. The election is taking place against a backdrop of what both sides of politics describe as a cost of living crisis.",
      "publishedAt": "2025-05-02T22:04:34Z",
      "title": "Australians vote in election with high prices and shortage of housing major issues",
      "url": "https://apnews.com/article/australia-election-albanese-dutton-251063e866513dfa48b773fb4d6b0d29",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6d926d/2147483647/strip/true/crop/3229x1816+0+168/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fb2%2Fb393301a1742a069b09a89840dcf%2Ff6ef0e95342d4a8780460d5808631de5"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "A new mission statement for the Justice Department unit that upholds voting rights shows it's being redirected toward prioritizing President Donald Trump's executive order on elections. Trump has continued to insist that widespread fraud cost him the 2020 presidential election. Repeated audits, investigations and court cases show otherwise. The mission statement is silent on the voting section's normal mission of protecting the right to vote and people from being disenfranchised by gerrymandering. Instead it says the section will combat fraud and ensure that only U.S. citizens vote, even though voting by noncitizens is already illegal and has been shown to be extremely rare.",
      "publishedAt": "2025-05-03T12:27:40Z",
      "title": "Justice Department will prioritize Trump's elections order, memo says",
      "url": "https://apnews.com/article/trump-justice-department-voting-rights-elections-fraud-0717d58a10daa11b3957d277a7ca8e0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f51003d/2147483647/strip/true/crop/5110x2874+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Ff3%2Ffaea117ba9a7517b8e37f64647f2%2Fc731c69d87464b2c854c1e9b5f8f510e"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistan has test fired a ballistic missile as tensions with India spike over last month's deadly attack on tourists in the disputed Kashmir region. The surface-to-surface missile has a range of about 280 miles, the Pakistani military said. Saturday's launch of the Abdali Weapon System was aimed at ensuring the “operational readiness of troops and validating key technical parameters,” according to a statement from the military. There was no immediate comment about the launch from India, which blames Pakistan for the April 22 gun massacre that killed 26 people in the resort town of Pahalgam. Pakistan denies the charge.",
      "publishedAt": "2025-05-03T08:21:05Z",
      "title": "Pakistan test fires ballistic missile as tensions with India spike",
      "url": "https://apnews.com/article/pakistan-india-ballistic-missile-kashmir-tensions-70ad575139eeef3673c0c99cbed30302",
      "urlToImage": "https://dims.apnews.com/dims4/default/055ad38/2147483647/strip/true/crop/6384x3591+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Ffb%2F165e80b8f7e94187b72ae22cfb9a%2F3085fefe176143e7b329c054267b08d8"
    },
    {
      "author": "Hanna Arhirova, Elise Morton",
      "description": "Ukraine and Russia are at odds over competing ceasefire proposals. Moscow has accused Ukrainian President Volodymyr Zelenskyy of threatening the safety of dignitaries attending Victory Day celebrations after he dismissed Russia’s unilateral 72-hour ceasefire. Zelenskyy instead renewed calls for a more substantial 30-day pause in hostilities, as was initially proposed by the U.S. He said the proposed ceasefire could start anytime as a meaningful step toward ending the three-year war. He said that Ukraine cannot provide security assurances to foreign officials planning to visit Russia around May 9 Victory Day, warning that Moscow could stage provocations and later attempt to blame Ukraine.",
      "publishedAt": "2025-05-03T07:24:19Z",
      "title": "Russia and Ukraine clash over ceasefire proposals as fighting rages",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-kharkiv-4396be6394f46a6320cac4bf82be2941",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6f720b/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F8a%2Ff964c0354c0fc89a107b67da90ae%2F68cd7d548a32432ca38395e4ca477840"
    },
    {
      "author": "Nicole Winfield, Jill Colvin",
      "description": "President Donald Trump has posted an artificial intelligence-generated image of himself dressed as pope. The social media post comes as the mourning of Pope Francis continues and the papal conclave is set to begin in a few days. The image is raising eyebrows on social media, at the Vatican, from a group representing Catholic bishops in New York and from Italians. Catholics are in the period of official mourning after Francis' death. Catholic cardinals are due to open the solemn conclave to elect his successor on Wednesday. The death of a pope and election of another is a matter of utmost solemnity for Catholics",
      "publishedAt": "2025-05-03T17:38:29Z",
      "title": "Trump draws criticism with AI image of himself as the pope",
      "url": "https://apnews.com/article/trump-pope-francis-conclave-ai-image-bishops-9d88286886c350c4465f7c2afb7a5e41",
      "urlToImage": "https://dims.apnews.com/dims4/default/53247ad/2147483647/strip/true/crop/3911x2200+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F33%2Fd3b153cd6acfd8416776c628da4f%2F2476823162114b2ea4d0a9a75056f92b"
    },
    {
      "author": "Mohammed Jahjouh, Sarah El Deeb",
      "description": "Malnutrition and hunger are prevelant in the Gaza strip as Israel’s blockade enters its third month. Shortage of food and supplies has driven the territory toward starvation. Supplies to treat and pervent malnutrition are depeleted and quickly running out as documented cases of malnutrition rise. Some 3,600 children were admitted and treated for acute malnutrition in the past month_ a figure that is likely rising. Parents are running out of options of what to feed their children and where to take fhem to get help. Images of emaciated children are becoming more frequent and hungry children at community kitchens are fighting for food, alongside adults.",
      "publishedAt": "2025-05-03T17:16:25Z",
      "title": "Mothers struggle to feed their children in Gaza",
      "url": "https://apnews.com/article/gaza-israel-palestinians-malnutrition-children-f94af55885aadaee7e95b2492fc432e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5869b9a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F8b%2Febdbdb6e9fca1cf859b141fe965c%2F7038c0a7e067409cba5735f2a98dca06"
    },
    {
      "author": "Eileen Ng",
      "description": "Singapore’s long-ruling People’s Action Party has secured another general election landslide, extending its 66-year unbroken rule. Its improved performance on Saturday is a huge boost for Prime Minister Lawrence Wong, who came to power in 2024. The PAP won 87 out of a total 97 Parliamentary seats, with the remaining retained by he opposition Workers Party. The PAP’s popular vote rose to 65.6%, up from a near-record low of 61% in 2020 polls. Analysts said Wong’s appeal for a resounding mandate to steer trade-reliant Singapore through economic turbulence following U.S. President Donald Trump’s tariff hikes has hit home.",
      "publishedAt": "2025-05-03T00:05:03Z",
      "title": "Singapore's long-ruling party wins another landslide in election boost for new prime minister",
      "url": "https://apnews.com/article/singapore-election-lawrence-wong-56abe5205c784c575fd5550b979c461f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a9db75/2147483647/strip/true/crop/7793x4384+0+406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fd3%2Ffcd07b2beb623e4db0b0c7c1af21%2F930e676f0e6c422f9d3e791b158d0994"
    },
    {
      "author": "Will Graves",
      "description": "The fan who fell from a 21-foot-high wall onto the warning track at PNC Park during a Pittsburgh Pirates game is awake and alert. The organizer of a GoFundMe page for Kavan Markwood, the 20-year-old who slipped off a railing and onto the field during the seventh inning Wednesday, said Markwood is improving. Jennifer Phillips, who is organizing the fundraiser, says Markwood has made significant progress since being admitted to the trauma center at Allegheny General Hospital in critical condition. The team's internal investigation into the incident says Markwood did not purchase any alcohol, but that one of the people who attended the game with him did legally buy a handful of alcoholic beverages.",
      "publishedAt": "2025-05-03T22:48:29Z",
      "title": "The 20-year-old man who fell to the warning track at a Pirates game is awake",
      "url": "https://apnews.com/article/pittsburgh-pirates-fan-falls-53f36d51a945a33adcc0372c8e421b9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/865461e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F6b%2F73b878b03ff42613fa2ae73c3366%2Feee39439f77e480f943542f13f245404"
    },
    {
      "author": "Beth Harris",
      "description": "Rain is making for a soggy 151st Kentucky Derby, with the Churchill Downs dirt strip listed as sloppy and horse racing fans protecting their fancy hats and clothing with clear plastic ponchos. A field of 19 3-year-olds was set to run 1 1/4 miles for a $3.1 million prize and the garland of red roses shortly after 7 p.m. ET Saturday. Rain fell on and off throughout the day and the 60-degree (15-Celsius) temperature made it feel cool for the horses and humans. That didn’t stop fans from betting, drinking, eating, smoking and shopping for souvenirs. It was the first Derby run on a sloppy track since 2019, when Country House won via disqualification.",
      "publishedAt": "2025-05-03T21:51:28Z",
      "title": "Rainy day makes for a soggy 151st Kentucky Derby",
      "url": "https://apnews.com/article/kentucky-derby-churchill-downs-6f1267fe0d38d2817d7685b4eaeb0e79",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0931a5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F6d%2Fa0b25a922aa3cbdd15e340ec3678%2Fe4ce52456bb14f1b9d04d97fcff9f0d6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}