{
  "articles": [
    {
      "author": "SAMY MAGDY",
      "description": "Israel says it has begun preparations for the departure of large numbers of Palestinians from the Gaza Strip in line with President Donald Trump’s plan for the territory. Officials meanwhile said Egypt has launched an diplomatic blitz behind the scenes to try and head off the plan. The Palestinians and much of the international community have rejected Trump’s proposal, fearing Israel will never allow the refugees to return and that it would destabilize the region. Egypt has warned that such a plan could undermine its historic peace treaty with Israel. Israeli leaders have welcomed Trump’s proposal but rights groups say the forcible relocation of a civilian population would amount to “ethnic cleansing.”",
      "publishedAt": "2025-02-06T09:42:49Z",
      "title": "Israel begins preparations for Gaza exodus as Egypt lobbies against Trump plan",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-egypt-trump-displacement-bc1c43f80655190824a5de4eb1d310cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/69b494b/2147483647/strip/true/crop/8229x4629+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F8b%2F8c6ea6acae0c8a347059673df9fa%2F9ecb1af51bba45cca887d106d21c88fe"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump's comments that the U.S. should take long-term control of war-shattered Gaza and that the area's residents should be permanently resettled have been contradicted by top people in his administration. Secretary of State Marco Rubio said Wednesday that the area’s residents would only be relocated on an interim basis as the U.S. rebuilds Gaza. White House press secretary Karoline Leavitt says U.S. taxpayers won’t finance rebuilding Gaza and insisted that Trump had “made it clear” that the people of Gaza would be moved out of the area only temporarily.",
      "publishedAt": "2025-02-06T01:08:57Z",
      "title": "In their own words: What Trump said about Gaza and how top administration officials contradicted him",
      "url": "https://apnews.com/article/trump-rubio-leavitt-gaza-permanent-temporary-funding-53d3c737d24dd8ea290e0e7962546575",
      "urlToImage": "https://dims.apnews.com/dims4/default/f65ec3e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F02%2F6dd641b6daaf0771be15c4a13286%2Fa993841eb8c0462cbce98ba5668386f3"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "The group Arab Americans for Trump is renaming itself Arab Americans for Peace after President Donald Trump said the U.S. would “take over” the Gaza Strip. The group's chairman, Bishara Bahbah, told The Associated Press on Wednesday it's “completely opposed to the idea of the transfer of Palestinians from anywhere in Historic Palestine.” The group helped facilitate meetings between Arab American community leaders and Trump’s allies ahead of the 2024 presidential election. The name change came after Trump held a Tuesday press conference alongside Israeli Prime Minister Benjamin Netanyahu and proposed the U.S. take “ownership” in redeveloping Gaza into “the Riviera of the Middle East.”",
      "publishedAt": "2025-02-05T16:59:23Z",
      "title": "Pro-Trump Arab American group changes its name after the president's Gaza 'Riviera' comments",
      "url": "https://apnews.com/article/arab-americans-trump-gaza-name-peace-479f6777cac7bac52fb098daa0821cb5",
      "urlToImage": "https://dims.apnews.com/dims4/default/a19a77c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F79%2F6d79cc612da3a83e8ad482484f57%2Ffcb9c681068644c198d5f752c918876e"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "An American-Israeli hostage freed from Hamas captivity was forced to lie down at all times in a small room for weeks. That's according his brother, Lee Siegel. For most of Keith Siegel's ordeal, there was little electricity or running water. Hostages are returning after 15 months in captivity as part of a ceasefire deal between Israel and Hamas and with their freedom, the first details of their ordeals are emerging. Their conditions are shining a light on the roughly 75 captives who remain in Gaza and are driving the families of the freed captives to pledge to keep up their public campaign until everyone is free.",
      "publishedAt": "2025-02-06T08:32:35Z",
      "title": "'What can I do to bring the others home?' Hostages freed from Hamas captivity vow all must return",
      "url": "https://apnews.com/article/israel-freed-hostages-hamas-gaza-ceasefire-d2cc2f109b96b210f2613bd98fc2b806",
      "urlToImage": "https://dims.apnews.com/dims4/default/affd4e0/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F87%2F46fa691be794d9b03affc412dc37%2F5625e60bd3ab4d1eb63643ff2e8409a0"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JULIA FRANKEL",
      "description": "Stunned Palestinians rejected President Donald Trump's proposal to expel them from the Gaza Strip so that the U.S. could take over the territory and rebuild it for others. Many saw the comments as an effort to erase them from their homeland, a continuation of the “Nakba,” or “Catastrophe,\" their name for the expulsion and displacement of hundreds of thousands of Palestinians from what is now Israel during the 1948 war. Palestinians displaced during the Israel-Hamas war have shown a powerful determination to return to their homes, with hundreds of thousands during the current ceasefire flooding back to neighborhoods devastated by Israeli bombardment and offensives.",
      "publishedAt": "2025-02-05T17:42:24Z",
      "title": "'I won't leave. Put that in your brain.' Palestinians reject Trump's call to expel them from Gaza",
      "url": "https://apnews.com/article/gaza-trump-nakba-israel-netanyahu-f8d1a4f840d4c440cfddb03987fa53cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/4840ad5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F4f%2F33b8ff158ef327b4e25da2a54925%2F561a3006781c4b72877d5363a0a05e63"
    },
    {
      "author": null,
      "description": "India’s Parliament has been disrupted as opposition lawmakers protested the alleged mistreatment of 104 Indian immigrants deported by the United States. A U.S. military plane on Wednesday carrying 104 deported Indian migrants arrived in a northern Indian city, the first such flight to the country as part of a crackdown ordered by the Trump administration. The lawmakers and media reports the deported immigrants’ arms and legs were shackled while on the aircraft. Parliament’s proceedings were adjourned on Thursday as the lawmakers chanted slogans and sought a discussion about the deportation.",
      "publishedAt": "2025-02-06T08:45:35Z",
      "title": "Opposition lawmakers protest alleged mistreatment of Indian deportees by US",
      "url": "https://apnews.com/article/indian-illegal-immigration-protest-parliament-deportation-trump-90ae7999040196e3ce25dd3fa8e29137",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f78ad1/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F6d%2Fe5f47a5e104a82578e994210392a%2F541c754683c14d67b661e4456873c850"
    },
    {
      "author": "ALEKSANDAR FURTULA, SERGEI GRITS, STEFANIE DAZIO",
      "description": "Swedish police say the shooter who killed 10 people in the country’s worst mass shooting was connected to the adult education center where he opened fire with at least one rifle-like weapon. Authorities said the gunman, who has not yet been officially identified, may have attended school there. He was later found dead with a large amount of unused ammunition and three guns next to his body. At least five people were seriously wounded in the violence at an adult education center west of Stockholm on Tuesday. Investigators had not uncovered a definitive motive behind the bloodshed by Thursday.",
      "publishedAt": "2025-02-06T08:44:48Z",
      "title": "Sweden mass shooting: Police is seeking gunman's motive",
      "url": "https://apnews.com/article/sweden-shooting-adult-education-center-4f8d316aff439b29200ede6456373f43",
      "urlToImage": "https://dims.apnews.com/dims4/default/d99d9db/2147483647/strip/true/crop/7433x4181+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F23%2F575c782cae75ad138477055e9bce%2F316de8bee57c4f6fa87cbae1d1bac5c3"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "A flurry of naval drills surrounding the Philippines involving the United States and its partners has prompted complaints from Beijing, which claims the entire South China Sea for itself and accuses Manila of colluding with others to destabilize the region. The U.S. 7th Fleet based in Japan said forces from Australia, Japan, the Philippines, and the U.S. conducted a “multilateral Maritime Cooperative Activity” within the Philippines’ Exclusive Economic Zone on Wednesday. It said the drills were taking place within the Philippines' exclusive economic zone and more exercises were planned for later this week in the Philippines Sea, which China does not claim.",
      "publishedAt": "2025-02-06T08:37:34Z",
      "title": "A flurry of international naval drills around the Philippines prompts complaints from Beijing",
      "url": "https://apnews.com/article/south-china-sea-us-philippines-navy-france-japan-c090de061b32e720c575e9f36786811f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a4c519/2147483647/strip/true/crop/1600x900+0+83/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F40%2Fe82773e2148218f2b14fb4116d08%2Ff1341f450784416bb9b438298807cd37"
    },
    {
      "author": "CHRIS MEGERIAN, COLLIN BINKLEY, BYRON TAU",
      "description": "The deadline for federal workers to receive financial incentives to quit is approaching. More than 2 million employees have until Thursday at 11:59 p.m. EST to decide what to do. Administration officials have been increasing their pressure on workers to leave, saying that furloughs or layoffs could come next. They also said that workers would have fewer civil service protections and higher scrutiny if they remain. The attempt to downsize the federal workforce has been spearheaded by Elon Musk, and it's part of President Donald Trump's effort to overhaul Washington. Democrats and unions have warned against accepting the deal, saying workers could be stiffed.",
      "publishedAt": "2025-02-06T05:02:40Z",
      "title": "Is it real or is it a trick? Federal workers debate legitimacy of buyout offer as deadline nears",
      "url": "https://apnews.com/article/buyout-offer-deadline-trump-federal-workers-ce854b19c41b90cd657f75cf09511e96",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad5835d/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F41%2Fcd50c4d3a03a9665ef5c4d941aa3%2Fae847ce1a1704b84b1dfd0696bf28f68"
    },
    {
      "author": "GENE JOHNSON, MIKE CATALINI",
      "description": "A federal judge who already questioned the constitutionality of President Donald Trump’s birthright citizenship executive order is set to hear arguments over a longer-term pause of the directive. Trump's executive order aims to end citizenship for children born to parents not legally in the country. U.S. District Judge John Coughenour in Seattle has scheduled a hearing involving lawyers from the Trump administration; four states suing to stop the order; and an immigrant rights organization, which is challenging it on behalf of a proposed class of expectant parents. The latest proceeding comes just a day after a Maryland federal judge issued a nationwide pause in a separate but similar case.",
      "publishedAt": "2025-02-06T05:17:48Z",
      "title": "What to know about the court cases over President Trump's birthright citizenship order",
      "url": "https://apnews.com/article/birthright-citizenship-court-case-immigration-49e46d49b9e5d9f7caf14e8c5322c8b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/1fd2635/2147483647/strip/true/crop/4596x2585+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F30%2Fd7d64cdba820038ec16e29f4f894%2F6f9e5ac3313d410f87b55d84f1058fd9"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}