{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump’s special envoy Steve Witkoff says the U.S. is cutting short Gaza ceasefire talks and bringing home its negotiating team from Qatar for consultations after the latest response from Hamas “shows a lack of desire to reach a ceasefire in Gaza.” Witkoff said Thursday, “While the mediators have made a great effort, Hamas does not appear to be coordinated or acting in good faith.\" Witkoff says the United States will now \"consider alternative options to bring the hostages home and try to create a more stable environment for the people of Gaza.” Witkoff adds it's “a shame that Hamas has acted in this selfish way” and the U.S. is “resolute” in seeking an end to the conflict in Gaza.",
      "publishedAt": "2025-07-24T17:11:40Z",
      "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks",
      "url": "https://apnews.com/article/mideast-wars-trump-witkoff-gaza-ceasefire-4d713a205d5d33e664b7c5853c6f5a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Justice Department officials will meet with Ghislaine Maxwell, the imprisoned girlfriend of financier and convicted sex offender Jeffrey Epstein. That's according to a person familiar with the matter. The person tells The Associated Press the meeting is Thursday in Florida, where Maxwell is held. The meeting is part of a Justice Department effort to cast itself as transparent following backlash from parts of President Donald Trump’s base over an earlier refusal to release additional Epstein records. A Justice Department spokesman hasn't returned a message seeking comment. A lawyer for Maxwell says she'll \"always testify truthfully.” Maxwell was convicted of helping Epstein sexually abuse underage girls. Epstein died in a New York jail awaiting trial.",
      "publishedAt": "2025-07-24T15:03:01Z",
      "title": "Justice Department will meet with Epstein's girlfriend Maxwell",
      "url": "https://apnews.com/article/epstein-maxwell-trump-sex-offender-b828f96be4a438edfe8051511be8c5da",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "The revelation that Attorney General Pam Bondi told President Donald Trump that his name was in the Jeffrey Epstein files has focused fresh attention on the president’s relationship with the wealthy financier and the Justice Department’s announcement this month that it would not be releasing any additional documents from the case. But at least some of the information in the briefing to Trump, which The Wall Street Journal said took place in May, should not have been a surprise. His association with Epstein is well-established and his name was included in records that his own Justice Department released back in February. Trump has never been accused of wrongdoing in connection with Epstein.",
      "publishedAt": "2025-07-24T15:21:19Z",
      "title": "Trump's friendship with Jeffrey Epstein is well-known and documented",
      "url": "https://apnews.com/article/trump-epstein-justice-department-bondi-e7a5e41ba4fa3a88736cc384078c3215",
      "urlToImage": "https://dims.apnews.com/dims4/default/d142b6d/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Ff4%2Ff39325e1523f193116962481afc2%2F8c7d29d49e864bf282d06ee283727f61"
    },
    {
      "author": null,
      "description": "Hulk Hogan, the mustachioed, headscarf-wearing icon in the world of professional wrestling, has died at the age of 71, Florida police and WWE said Thursday. Hogan's real name was Terry Bollea. He was perhaps the biggest star in WWE’s long history. He was the main draw for the first WrestleMania in 1985 and was a fixture for years, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon. Hogan was also a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, “Hogan Knows Best.”",
      "publishedAt": "2025-07-24T16:17:46Z",
      "title": "Hulk Hogan, icon in professional wrestling, dies at age 71",
      "url": "https://apnews.com/article/hulk-hogan-obit-wrestling-professional-wwe-fame-cc767794b616e155079b9f374c769ad0",
      "urlToImage": "https://dims.apnews.com/dims4/default/61b72f6/2147483647/strip/true/crop/4192x2358+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F55%2F75be87e57d96eeb77199c2598843%2F6ec384639a8e4b2cb08d499b90e48c8a"
    },
    {
      "author": null,
      "description": "Local officials in Russia say the wreckage of a plane that crashed while carrying 49 passengers has been found in the country's Far Eastern Amur region. Russian news agencies said an initial aerial inspection suggested there were no survivors. The flight was traveling from Blagoveshchensk, near the Russian-Chinese border, to the town of Tynda on Thursday when it disappeared from radar. A regional governor says 43 passengers, including five children, were on board, as well as six crew members.",
      "publishedAt": "2025-07-24T06:49:41Z",
      "title": "Russian plane crashes in Far Eastern Amur region with 49 on board",
      "url": "https://apnews.com/article/russia-plane-disappears-far-east-amur-819e5bd46dfa440246f37b4d4976eb23",
      "urlToImage": "https://dims.apnews.com/dims4/default/796f590/2147483647/strip/true/crop/3000x1688+0+1406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F40%2Fec63021cd0084a8509f78dac7019%2F1d94ca8374b248339a22949c9eb9e783"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to visit the Federal Reserve as his allies scrutinize its expensive building renovations. It's a highly personal and confrontational escalation of Trump's campaign to pressure the central bank to slash interest rates. Trump administration officials have used concerns about the Washington building overhaul to cast doubt on Fed Chairman Jerome Powell’s decision making. The Trump administration officials are scheduled to inspect the site Thursday. The White House says the Republican president will also be visiting. Trump has criticized Powell for months because the chair has kept the short-term interest rate the Fed controls at 4.3%. Powell says the Fed wants to see how the economy responds to Trump’s tariffs.",
      "publishedAt": "2025-07-24T03:19:07Z",
      "title": "Trump will visit Fed as he pressures Powell to cut interest rates",
      "url": "https://apnews.com/article/trump-federal-reserve-jerome-powell-145b0189a8c7acaab9fcfb097dc376c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/129ff31/2147483647/strip/true/crop/4023x2263+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F10%2Fc22b2cb1f18413027585e87a1985%2F0c8619e9d4e94da9a2bf8b448f5ba158"
    },
    {
      "author": null,
      "description": "A replica Oval Office on display near the White House has been made over to look exactly like President Donald Trump’s Oval Office. But it isn’t the gilded version that the Republican is currently using. Instead, it's a mirror image of the Oval Office from Trump's first term. The replica initially looked like Democrat Joe Biden’s office when the White House Historical Association opened “The People’s House\" educational center last fall. It takes time to get copies made of every item in the real Oval Office. It will be fully revamped next year to mirror Trump's second-term office. Visitors starting Thursday will experience it as it was in Trump's first term.",
      "publishedAt": "2025-07-24T15:16:40Z",
      "title": "A replica Oval Office near the White House just got a Trump makeover",
      "url": "https://apnews.com/article/trump-oval-office-replica-exhibit-historical-biden-1a918d2c892cf5338eab2a41c96e55f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/7eb5d46/2147483647/strip/true/crop/7910x4449+0+412/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Ff6%2F7db8ec9951e118cedf3ca4da0195%2F13bda2d5e4b24c08b72b0a112fc98cb6"
    },
    {
      "author": null,
      "description": "A federal judge says a man charged with trying to assassinate President Donald Trump last year in South Florida can represent himself during his trial. U.S. District Judge Aileen Cannon on Thursday signed off on Ryan Routh’s request to represent himself during his trial. But she said court-appointed attorneys need to remain as standby counsel. The federal public defenders had asked to be taken off the case, saying Routh had refused repeated attempts to meet with them. Routh is scheduled to stand trial in September, a year after prosecutors say a U.S. Secret Service agent thwarted his attempt to shoot Trump as he played golf.",
      "publishedAt": "2025-07-24T04:05:37Z",
      "title": "Man accused of attempting to assassinate Trump can represent himself at trial, judge says",
      "url": "https://apnews.com/article/trump-shooting-attempt-florida-644c71bc607e4ebad5115f2a490b314c",
      "urlToImage": "https://dims.apnews.com/dims4/default/9dcc61d/2147483647/strip/true/crop/562x316+0+29/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F90%2F04ed571281197f4914829eaec343%2Fffab5bc0d2d943e597a1ca3b12af5885"
    },
    {
      "author": null,
      "description": "Democratic Gov. Tony Evers of Wisconsin will not seek a third term in 2026, creating the first open race for governor in the battleground state in 16 years. Evers announced his decision Thursday. The race will be the highest profile one next year in Wisconsin, as Democrats also try to win control of the Legislature under friendlier boundary lines. Democrats are also targeting two Republican-held congressional seats. Evers’ tenure as governor has been marked by his often contentious relationship with the Legislature, which Republicans have controlled since 2011.",
      "publishedAt": "2025-07-24T17:05:05Z",
      "title": "Wisconsin's Democratic governor, Tony Evers, won’t seek reelection in the battleground state",
      "url": "https://apnews.com/article/wisconsin-gov-tony-evers-reelection-78b32ffc51dff53512fd7499f21e9878",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1194a3/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F69%2Ffb4b0a16bb2b655e8afbd6693688%2Fea2d7a96679245f6bfcf9a3e62dd160d"
    },
    {
      "author": null,
      "description": "Millions of people living in mobile home parks don't enjoy the same drinking water protections that Americans are accustomed to. A review by The Associated Press found nearly 70% of mobile home parks that run their own water systems violated safe drinking water rules over a recent five-year stretch. That's a higher rate than utilities that supply water for cities and towns. And it's impossible to know the full extent of the problem. That's because the parks commonly aren’t identified in the Environmental Protection Agency’s national database of drinking water violations. Almost 17 million people in the U.S. live in mobile homes.",
      "publishedAt": "2025-07-24T13:03:26Z",
      "title": "Safe tap water isn’t a given for millions in US mobile home parks",
      "url": "https://apnews.com/article/mobile-homes-water-drinking-safety-health-12adbeeb1d880644b0fc85957b083fcd",
      "urlToImage": "https://dims.apnews.com/dims4/default/050099f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F97%2F31cb5f205d521acd1aa69960f77c%2Ff2cd7e3e96cd42e6b486187b52c5c1d5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}