{
  "articles": [
    {
      "author": "NATALIE MELZER and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Israel is already in a “multi-front war” with Iran and its proxies, Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting Sunday, as the United States and allies prepared to defend Israel from an expected counterstrike and prevent an even more destructive regional conflict.",
      "publishedAt": "2024-08-04T05:44:53Z",
      "title": "US and allies prepare to defend Israel as Netanyahu says it's already in 'multi-front war' with Iran",
      "url": "https://apnews.com/5b480a3b22538edec9fa05908f28303f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b18adba444ee4e1c9d02ec5256d45a75/1920.jpeg"
    },
    {
      "author": "AMIR VAHDAT",
      "description": "TEHRAN, Iran (AP) — Jordan’s foreign minister met Iran’s acting foreign minister in Tehran on Sunday as the United States and its Arab allies try to prevent a wider war after the back-to-back killings of top Iran-allied militants sparked vows of revenge against Israel.",
      "publishedAt": "2024-08-04T10:07:42Z",
      "title": "Jordan's top diplomat makes rare visit to Iran as fears of a wider regional war soar",
      "url": "https://apnews.com/732e70e991115364141d7a16e0cc7475",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2422a8879c74c4f8d2c570c7ffa2e06/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Nearly 100 people were killed and hundreds more injured Sunday as renewed anti-government protests swept across Bangladesh, with protesters calling for the prime minister to resign and the prime minister accusing them of “sabotage” and cutting off mobile internet in a bid to quell the unrest.",
      "publishedAt": "2024-08-04T09:48:56Z",
      "title": "Renewed anti-government protests leave nearly 100 dead, hundreds more injured in Bangladesh",
      "url": "https://apnews.com/1496d6471792cbc11f39c3bacee813f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25eec79bc303448a941437695d076044/1920.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — Tropical Storm Debby strengthened rapidly Sunday and was expected to become a hurricane as it moved through the Gulf of Mexico toward Florida, bringing with it the threat of devastating floods to the southeast Atlantic coast later in the week.",
      "publishedAt": "2024-08-04T15:14:58Z",
      "title": "Tropical Storm Debby barrels toward Florida, with potential record-setting rains further north",
      "url": "https://apnews.com/4307498f4276fa9d96b96c763567a9a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68750a8ce76d49a3adbecae7ad7e9f8c/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris' campaign on Sunday was launching “Republicans for Harris” as she looks to win over Republican voters put off by Donald Trump's candidacy.",
      "publishedAt": "2024-08-04T11:05:54Z",
      "title": "VP's campaign launches 'Republicans for Harris' in push to win over GOP voters put off by Trump",
      "url": "https://apnews.com/8b67604df273c0e198b1d46eb4755d50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f361775658f4c0aae0e0642a4289bc7/3000.jpeg"
    },
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "ATLANTA (AP) — Donald Trump picked a new fight Saturday with Georgia's Republican governor as he campaigned in the key swing state where he's looking to avenge his narrow 2020 loss — a defeat he continues to blame on GOP officials for not giving into his false theories of election fraud.",
      "publishedAt": "2024-08-03T04:06:03Z",
      "title": "Trump again tears into Georgia's Republican governor on the same day he campaigns in the state",
      "url": "https://apnews.com/b21c25bbbfafdd0343c8812f6c3d7c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dd2bf54fd9c4b06acf334b3142dab1d/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — They have combed the ashes for mementos, worried about where they would sleep, questioned their faith and tried to find a way to grieve amid the great, unsettling devastation.",
      "publishedAt": "2024-08-04T04:05:57Z",
      "title": "'We're going to survive and it's going to come back': A year after Maui wildfire, survivors press on",
      "url": "https://apnews.com/6170a7a96e0944dbe7444c0783912656",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbe6134b08b34dba808b8b111864f91f/3000.jpeg"
    },
    {
      "author": "GABRIELA AOUN ANGUEIRA and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Josephine Fraser worried her young family's next home would be a tent.Fraser and her partner, their two sons and their dog had moved nine times in as many months, from one hotel room to another, since the deadliest U.S.",
      "publishedAt": "2024-08-04T04:45:44Z",
      "title": "A year after Maui wildfire, chronic housing shortage and pricey vacation rentals complicate recovery",
      "url": "https://apnews.com/b4d68e3e22eb68693c6e173dd1642b93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fff9e5e82e83439484fe14c833fc93b2/3000.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — U.K. Prime Minister Keir Starmer strongly condemned an attack Sunday on a hotel housing asylum seekers, describing it as “far-right thuggery\" as more violence broke out in several towns and cities across the country in the wake of a stabbing rampage at a dance class that left three girls dead and many more wounded.",
      "publishedAt": "2024-08-04T09:13:18Z",
      "title": "UK leader Starmer condemns attack on asylum-seeker hotel as far-right violence spreads",
      "url": "https://apnews.com/2de808d796f81f719950acb4ea6f0af5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6c8a62daa2d473e9510505341f73056/1920.jpeg"
    },
    {
      "author": "NOREEN NASIR",
      "description": "PARIS (AP) — Overcome with emotion, Algerian boxer Imane Khelif left the ring in tears after a resounding victory this weekend.",
      "publishedAt": "2024-08-04T15:17:18Z",
      "title": "For female athletes of color, scrutiny around gender rules and identity is part of a long trend",
      "url": "https://apnews.com/49b79a6b7ae76afaebb00319732d6486",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c72cdff2f05840fa9a8262db674f52e1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}