{
  "articles": [
    {
      "author": "MICHAEL KUNZELMAN, ERIC TUCKER and NOMAAN MERCHANT",
      "description": "WASHINGTON (AP) — Donald Trump arrived Thursday at the federal courthouse in Washington to surrender on charges that he plotted to overturn his 2020 defeat in the election, with the former president set to face a judge mere blocks from the U.S.",
      "publishedAt": "2023-08-03T04:04:52Z",
      "title": "Trump arrives at DC courthouse to face charges he tried to overturn the 2020 presidential election",
      "url": "https://apnews.com/a79f2d3683c7591058635c9b3d870070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18ec19f1ea834cf3bb1c74be07a6162d/1920.jpeg"
    },
    {
      "author": null,
      "description": "Follow along for live updates as Donald Trump appears in federal court Thursday after being indicted by the Justice Department for his efforts to overturn the results of the 2020 presidential election.",
      "publishedAt": "2023-08-03T16:05:18Z",
      "title": "Trump chats with lawyers in courtroom ahead of hearing in 2020 election case. Follow live updates",
      "url": "https://apnews.com/e64fbee9c47b310b1c8edb5265d12b07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff6c6714c30941f6a40eb0119f354ba8/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — The U.S. military is considering putting armed personnel on commercial ships traveling through the Strait of Hormuz, in what would be an unheard of action aimed at stopping Iran from seizing and harassing civilian vessels, five American officials told The Associated Press on Thursday.",
      "publishedAt": "2023-08-03T16:43:05Z",
      "title": "US military may put armed troops on commercial ships in Strait of Hormuz to stop Iran seizures",
      "url": "https://apnews.com/57295a81dc45c9e0755bd6a83ece86d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d164794f44ed47e5982a4a30b98e04aa/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Six white former law enforcement officers in Mississippi who called themselves the “Goon Squad” have pleaded guilty to a racist assault on two Black men who were brutalized during a home raid that ended with an officer shooting one man in the mouth, federal prosecutors say.",
      "publishedAt": "2023-08-03T17:41:07Z",
      "title": "Ex-Mississippi officers plead guilty to racist assault on 2 Black men during raid",
      "url": "https://apnews.com/2c2154e67cc6cd3b9a28cb16686f2a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d8efd45e221443aa79bad2f522dbb72/3000.jpeg"
    },
    {
      "author": "PETER SMITH and MICHAEL RUBINKAM",
      "description": "PITTSBURGH (AP) — The man who killed 11 congregants at a Pittsburgh synagogue was formally sentenced to death Thursday, one day after a jury determined that capital punishment was appropriate for the perpetrator of the deadliest attack on Jews in U.S.",
      "publishedAt": "2023-08-03T14:54:42Z",
      "title": "Pittsburgh synagogue gunman has been sentenced to die in the nation’s deadliest antisemitic attack",
      "url": "https://apnews.com/ccb447356b2cfe855875c329fb00f505",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa359830569f484da2308cdccc6a01bf/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "PARKLAND, Fla. (AP) — Ballistics experts will fire up to 139 shots at Marjory Stoneman Douglas High School on Friday during a reenactment of the 2018 Parkland massacre organized as part of a lawsuit that accuses a sheriff’s deputy of failing in his duty to protect the victims.",
      "publishedAt": "2023-08-03T05:13:54Z",
      "title": "The Parkland school massacre will be reenacted, with gunfire, in lawsuit against sheriff's deputy",
      "url": "https://apnews.com/88011ab4bace76ab6ea5fab01211b348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d21e66be86a346279e0527079d67cce9/3000.jpeg"
    },
    {
      "author": null,
      "description": "DUBAI, United Arab Emirates (AP) — Saudi Arabia said Thursday it will extend its unilateral production cut of 1 million barrels of oil a day through the end of September in its effort to boost flagging energy prices, a move that could push U.S.",
      "publishedAt": "2023-08-03T15:14:42Z",
      "title": "Saudi Arabia extends cut of 1 million barrels of oil a day, potentially boosting prices at the pump",
      "url": "https://apnews.com/23c6b522ba9ba0e0a9e10211f991f714",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3d3b6fc74014fdf827bb83fcfba36e6/3000.jpeg"
    },
    {
      "author": "JULIE WATSON and LOLITA C. BALDOR",
      "description": "SAN DIEGO (AP) — Two U.S. Navy sailors have been arrested and accused of providing sensitive military information to China — including details on wartime exercises, naval operations and critical technical material, federal officials said Thursday.",
      "publishedAt": "2023-08-03T16:56:48Z",
      "title": "2 US Navy sailors arrested on charges tied to national security and China",
      "url": "https://apnews.com/b81514864f8cab253b4d29caa3594a72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f355497234e458e957e1dab1e09d8ba/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Mindy Scheier was working in fashion before her son, Oliver, was born with muscular dystrophy. As he grew, and she watched him struggle to get dressed, her eyes were opened to her industry's limitations for people with disabilities.",
      "publishedAt": "2023-08-03T12:26:38Z",
      "title": "Clothes for kids with disabilities get better, but teens see a lack of fashionable options",
      "url": "https://apnews.com/d6391eea8be94942aadfeb6d4825b8a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33be347bf38048b5829f381a592e732d/3000.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Lizzo said Thursday that she's “not the villain” that three of her former backup dancers falsely accuse her of being in a sexual harassment lawsuit.",
      "publishedAt": "2023-08-03T13:34:28Z",
      "title": "Lizzo says she's 'not the villain' after her former dancers claim sex harassment",
      "url": "https://apnews.com/e7a302d3ec927c6bffdbff14387829ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9374172194641ba89485ed3033c89b0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}