{
  "articles": [
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — It'll likely take years before the U.S. government's massive antitrust lawsuit against Apple is resolved — but the iPhone maker's troubles with European regulators offer a glimpse of what changes American customers may see down the line.",
      "publishedAt": "2024-03-21T18:04:46Z",
      "title": "How Europe's regulatory battle with Apple could signal what’s to come for American consumers",
      "url": "https://apnews.com/9a1d1cd341b4f00ededb5b56d707374a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9acfbd9f26fd47c697dab5c39254a633/1920.jpeg"
    },
    {
      "author": "GENE JOHNSON and MARK THIESSEN",
      "description": "Police on Thursday arrested two white supremacist gang members — an Idaho prison inmate and the accomplice who helped him escape — following an attack on corrections officers at a Boise hospital, and investigators are looking into whether they killed two people while on the run.",
      "publishedAt": "2024-03-21T05:03:40Z",
      "title": "Police track down escaped Idaho prison gang member and accomplice, say pair may have killed 2 on run",
      "url": "https://apnews.com/5d4eb764853ca05d2721145bc435367a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8bfe217ac5f4a1ca4811aa8ffe44599/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United States called for a vote Friday on a newly revised and tougher U.N. resolution declaring that “an immediate and sustained cease-fire” in the Israel-Hamas war in Gaza is “imperative” to protect civilians and enable humanitarian aid to be delivered to more than 2 million hungry Palestinians.",
      "publishedAt": "2024-03-21T22:13:54Z",
      "title": "US calls for vote Friday on UN resolution declaring that immediate Gaza cease-fire is `imperative'",
      "url": "https://apnews.com/cce778b676cb52210dcc46630bd94060",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7baa3f51b4884e209d117476dcc361aa/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "A top Southern Baptist administrative body has selected its first permanent leader in nearly two-and-a-half years, a time when it has navigated a tumult of controversies ranging from a sexual abuse scandal to financial struggles — to its own stumbling efforts to find a new president.",
      "publishedAt": "2024-03-21T21:12:52Z",
      "title": "Southern Baptists pick a California seminary president to lead its troubled administrative body",
      "url": "https://apnews.com/66cdafcf88ed7b3487da6fa32788e2ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/febf66e1bb0e48e28f754942137fdb87/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and ERIK VERDUZCO",
      "description": "SANDERSON, Texas (AP) — During the nine hours that Texas was allowed to arrest and deport people who illegally enter the U.S., Sheriff Thaddeus Cleveland never changed his tactics with migrants in his remote border county.",
      "publishedAt": "2024-03-21T22:16:00Z",
      "title": "Law enforcement officials in Texas wonder how they will enforce migrant arrest law",
      "url": "https://apnews.com/8fcb8ed6a6b85070a551ef3c55255062",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4391f635c943423dbc5c08df6e57e326/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Lawmakers introduced a $1.2 trillion spending package Thursday that sets the stage for avoiding a partial government shutdown for several key federal agencies this weekend and allows Congress, nearly six months into the budget year, to complete its work funding the government through September.",
      "publishedAt": "2024-03-21T14:10:33Z",
      "title": "Congress unveils $1.2 trillion plan to avert federal shutdown and bring budget fight to a close",
      "url": "https://apnews.com/3b4e61cf5eaaf0f7fbeeddbacdf57212",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04c6b20b275c46e38dc0531d3378ded7/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "HOUSTON (AP) — “Are you better off today than you were four years ago?\" Rarely have voters' answers to that question been so complicated.Former President Donald Trump asked the time-tested question of his supporters in all-caps Monday on his Truth Social platform.",
      "publishedAt": "2024-03-21T23:01:44Z",
      "title": "Biden and Trump ask voters if they're 'better off' than they were 4 years ago. It's complicated",
      "url": "https://apnews.com/597f4f2f2b2e32d8933802e37ef66913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec06fc156261415f855d305b6715900d/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "BOSTON (AP) — A federal appeals court on Thursday ordered the judge who oversaw Boston Marathon bomber Dzhokhar Tsarnaev's trial to investigate the defense's claims of juror bias and determine whether his death sentence should stand.",
      "publishedAt": "2024-03-21T21:48:17Z",
      "title": "Appeals court orders judge to probe claims of juror bias in Boston Marathon bomber's case",
      "url": "https://apnews.com/4cf3031d41cb0ab1bd1cad2bd3ad107a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8fad80002584d1eadb2878640ac673a/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — No criminal charges will be filed against the Oklahoma teens involved in a high school bathroom fight with Nex Benedict, the nonbinary 16-year-old whose death following the altercation was ruled a suicide, the county district attorney said Thursday.",
      "publishedAt": "2024-03-21T22:40:19Z",
      "title": "No charges to be filed in fight involving Oklahoma nonbinary teen Nex Benedict, prosecutor says",
      "url": "https://apnews.com/0667b5a694c2773d6ea76face0a22ef1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65905b23760549059d176c1f533a32fc/1600.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Latest on the first full day of the NCAA Tournament:Gohlke lifts Oakland over Kentucky\r\nJack Gohlke took the first star turn of the NCAA Tournament, pushing Oakland past mighty Kentucky.",
      "publishedAt": "2024-03-21T15:25:52Z",
      "title": "NCAA Tournament Latest: Gohlke lifts Oakland over Kentucky",
      "url": "https://apnews.com/05c86b8077f7ad8bd8186dd70d713a41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab5dbc3cfd2045bab885109f9f24667f/2859.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}