{
  "articles": [
    {
      "author": "RANDALL CHASE, MICHAEL KUNZELMAN, COLLEEN LONG and CLAUDIA LAUER",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden's daughter Naomi testified Friday in his federal gun trial about visiting her father at a California rehab center and said he seemed to be improving around the time of the gun purchase in 2018.",
      "publishedAt": "2024-06-07T04:07:30Z",
      "title": "Defense calls Hunter Biden's daughter Naomi in federal gun trial after prosecution rests case",
      "url": "https://apnews.com/8fc5b9e6960c1115c714e12c6e1217ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba7f69dde7c747ecb0da5669e1ac4eff/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, SYLVIE CORBET and ZEKE MILLER",
      "description": "PARIS (AP) — U.S. President Joe Biden on Friday for the first time publicly apologized to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.",
      "publishedAt": "2024-06-07T07:36:54Z",
      "title": "Biden apologizes to Zelenskyy for monthslong congressional holdup to weapons that let Russia advance",
      "url": "https://apnews.com/a77546e23fa571eb7f6509d4e14b89b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2eefcad30e84200b4985b9878dca0ee/2652.jpeg"
    },
    {
      "author": null,
      "description": "ST. PETERSBURG, Russia (AP) — President Vladimir Putin said Friday that he sees no current threat to Russia’s sovereignty that would warrant the use of nuclear weapons but again warned that Moscow could send arms to countries or groups to strike Western targets.",
      "publishedAt": "2024-06-07T12:53:29Z",
      "title": "Putin says he sees no threat warranting use of nuclear arms but warns Russia could arm Western foes",
      "url": "https://apnews.com/2a8aca4544abbc7327adf944d72d6f4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcb957a9e9a64c1798e8c31bda4717e1/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "POINTE DU HOC, France (AP) — President Joe Biden on Friday looked to summon Americans to defend democracy from threats at home and abroad — and cast an implicit contrast with Donald Trump — by drawing on the heroism of Army Rangers who scaled the seaside cliffs of Pointe du Hoc in the D-Day invasion 80 years ago.",
      "publishedAt": "2024-06-07T04:09:24Z",
      "title": "Biden looks to Pointe du Hoc to inspire the push for democracy abroad and at home",
      "url": "https://apnews.com/bc97ae35237e222caee55033ddb3588f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad4b626a420e473699663854e85f2ca7/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. military-built pier designed to carry badly needed aid into Gaza by boat has been reconnected to the beach in the besieged territory after a section broke apart in storms and rough seas, and food and other supplies will begin to flow soon, U.S.",
      "publishedAt": "2024-06-07T13:37:03Z",
      "title": "US-built pier in Gaza is reconnected after repairs, and aid will flow soon, US Central Command says",
      "url": "https://apnews.com/3db724ef590b4d056e81a1bac1b9c13f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddcc4908796d4c349c37dda52229392d/2859.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Justice Ketanji Brown Jackson collected nearly $900,000 last year for her upcoming memoir, one of four Supreme Court justices who reported sizable income from book deals.",
      "publishedAt": "2024-06-07T16:47:21Z",
      "title": "Justice Jackson reports a $900,000 book advance and tickets from Beyoncé",
      "url": "https://apnews.com/d0873c92792f6c0791c9269fe05ed937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a2a336e5d204364b68b8a0d884c84c2/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — For one shining moment this week, the country's ongoing political crises were swept away by the comedic power of one cherubic and wildly exuberant 6-year-old. Rep. John Rose, R-Tenn., was giving an impassioned defense of former President Donald Trump when his young son Guy went into action.",
      "publishedAt": "2024-06-07T16:21:41Z",
      "title": "Kids are upstaging their political parents — by acting like kids",
      "url": "https://apnews.com/e678bb910e4580a4770e9592e31ce8e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16370ab55af24a44824d3636e8dab61a/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Conspiracy theorist Alex Jones is seeking court permission to convert his personal bankruptcy reorganization to a liquidation, which would lead to a sell-off of a large portion of his assets to help pay some of the $1.5 billion he owes relatives of victims of the Sandy Hook Elementary School shooting.",
      "publishedAt": "2024-06-07T15:25:12Z",
      "title": "Alex Jones seeks permission to convert his personal bankruptcy into a liquidation",
      "url": "https://apnews.com/47355b70a1ceb704f96cec27865846a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f2c86c6950346ceba04754de98b0cce/2204.jpeg"
    },
    {
      "author": "KAITLYN HUAMANI",
      "description": "LOS ANGELES (AP) — After 41 years and over 8,000 episodes, Pat Sajak’s final turn as the renowned host of “Wheel of Fortune” will air on Friday.In a farewell message released ahead of Friday's episode airing, Sajak thanked the viewers of the beloved game show for granting him the “incredible privilege to be invited into millions of homes, night after night, year after year, decade after decade.”",
      "publishedAt": "2024-06-07T04:02:18Z",
      "title": "After 41 years, Pat Sajak makes his final spin as host of ‘Wheel of Fortune’",
      "url": "https://apnews.com/c64f40809bc993f4d4eb221dc37ff841",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5beb412bb444a7aa4e98fb181448ecb/1799.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "PARIS (AP) — Carlos Alcaraz reached his first French Open final by beating Jannik Sinner 2-6, 6-3, 3-6, 6-4, 6-3 on Friday, making the 21-year-old from Spain the youngest man to reach a Grand Slam title match on three surfaces.",
      "publishedAt": "2024-06-07T16:53:16Z",
      "title": "Carlos Alcaraz reaches his first French Open final by beating Jannik Sinner in 5 sets over 4 hours",
      "url": "https://apnews.com/0c77a203371b1ccdfd6a146b75c2f0c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa74eba7e395411eb1188484e4aa1b18/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}