{
  "articles": [
    {
      "author": "ERIC TUCKER, DASHA LITVINOVA and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The United States and Russia completed their biggest prisoner swap in post-Soviet history on Thursday, with Moscow releasing journalist Evan Gershkovich and fellow American Paul Whelan, along with dissidents including Vladimir Kara-Murza, in a multinational deal that set two dozen people free.",
      "publishedAt": "2024-08-01T13:29:35Z",
      "title": "3 newly freed Americans are back on US soil after a landmark prisoner exchange with Russia",
      "url": "https://apnews.com/d803e266cb4e60135ec5d668d684529f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/168cbc138f164d60bdb5033d8b4c9713/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The U.S. and Russia on Thursday completed their largest prisoner swap in post-Soviet history, a deal involving 24 people, many months of negotiations and concessions from other European countries who released Russians in their custody as part of the exchange.",
      "publishedAt": "2024-08-01T20:53:45Z",
      "title": "Things to know about the largest US-Russia prisoner swap in post-Soviet history",
      "url": "https://apnews.com/354df585ad321ecdbea4c0f2c557f0aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a92387e17a5a4d47a94980c781fd0669/1920.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The United States and Russia completed a 24-person prisoner swap on Thursday, the largest in post-Soviet history, with Moscow releasing Wall Street Journal reporter Evan Gershkovich and fellow American Paul Whelan in a multinational deal that set some two dozen people free, according to officials in Turkey, where the exchange took place.",
      "publishedAt": "2024-08-01T15:34:10Z",
      "title": "Prisoner Swap Latest: Freed Americans return to US soil and emotional welcome",
      "url": "https://apnews.com/fa753e373ee1fb47464373324a142a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67eaa6368092400d8d0fac21597ca1f7/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO, GABRIELA SÁ PESSOA and E. EDUARDO CASTILLO",
      "description": "CARACAS, Venezuela (AP) — The stakes grew higher for Venezuela's electoral authority to show proof backing its decision to declare President Nicolás Maduro the winner of the country's presidential election after the United States on Thursday recognized opposition candidate Edmundo González as the victor, discrediting the official results of the vote.",
      "publishedAt": "2024-08-01T18:37:17Z",
      "title": "US recognizes opposition candidate González as the winner of Venezuela's presidential election",
      "url": "https://apnews.com/fa5780b54ffd166b4e20513d5b457512",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7d4035c40944d4b4121a859e96177b/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MATT BROWN",
      "description": "NEW YORK (AP) — Donald Trump has found tremendous success from the very first moment he stepped onto the presidential stage by stoking racial animus.",
      "publishedAt": "2024-08-01T23:18:53Z",
      "title": "Trump is making his 2024 campaign about Harris' race, whether Republicans want him to or not",
      "url": "https://apnews.com/8d3c811ec6369aadef00e25e29ec0fab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7d91701b34342e187f5e1a13552f385/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Hezbollah’s leader warned Thursday that the conflict with Israel has entered a “new phase,” as he addressed mourners at the funeral of a commander from the group who was killed by an Israeli airstrike this week in Beirut.",
      "publishedAt": "2024-08-01T06:00:33Z",
      "title": "Hezbollah leader says war with Israel has entered 'new phase' after killings of top militant figures",
      "url": "https://apnews.com/ce985bc74dbfd524fe7ed2aed55e68db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1e2ba38927545198a52aa2dd2373941/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July. The announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.",
      "publishedAt": "2024-08-01T08:40:43Z",
      "title": "Israel says it has confirmed that chief of Hamas' military wing was killed in a July strike in Gaza",
      "url": "https://apnews.com/9524d7d5c8f7321f4d8c931fde664556",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/986085d272094fd99bdf5607fa8682c5/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and BRIAN MELLEY",
      "description": "LONDON (AP) — British Prime Minister Keir Starmer condemned the “tiny mindless minority” behind unrest that has plagued several cities after a horrific stabbing at a children’s dance class and vowed to put a stop to it as the 17-year-old suspect was named Thursday in part to counter misinformation blamed as one cause of the fiery clashes.",
      "publishedAt": "2024-08-01T08:19:13Z",
      "title": "British prime minister announces policing plan to deal with violence after fatal stabbing of girls",
      "url": "https://apnews.com/666c445e26aa0359f26805b4a10c071a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab45d2838c7841438ffecfab4db0941d/1920.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "NANTERRE, France (AP) — It wasn't the medal Katie Ledecky would've preferred.Still, it was good enough for the record books.On a night when Canadian phenom Summer McIntosh romped to another victory and Kate Douglass claimed a gold for the Americans, Ledecky collected the 13th medal of her stellar career to become the most decorated woman in swimming history Thursday.",
      "publishedAt": "2024-08-01T18:52:22Z",
      "title": "Ledecky wins record 13th medal with a silver. Summer McIntosh and Kate Douglass strike gold",
      "url": "https://apnews.com/f474fde41ca255b892c3ff5b73c54f6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d40079621e2f4c9b96ed5c99e7e2a876/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Simone Biles huddled with Sunisa Lee. She looked to her husband Jonathan Owens in the stands.",
      "publishedAt": "2024-08-01T18:44:14Z",
      "title": "Simone Biles makes history with second all-around Olympic gymnastics title, 8 years after her first",
      "url": "https://apnews.com/ee448ffdf28570d3b99da0fa4cbec640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cecb4524df4341c5a2df8bd1f80ea7a5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}