{
  "articles": [
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu on Monday pushed back against a new wave of pressure to reach a cease-fire deal in Gaza after hundreds of thousands of Israelis protested and went on strike and U.S.",
      "publishedAt": "2024-09-02T06:49:47Z",
      "title": "Netanyahu pushes back against new pressure over Gaza and hostages: 'No one will preach to me'",
      "url": "https://apnews.com/f8a8c85f8947631a7f3039e087dd3904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fdd2f74dcbc458ebe6072fcf40b10db/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israelis were plunged into grief and anger this weekend after the military said six hostages were killed by their captors in Gaza just as troops were closing in on their location.",
      "publishedAt": "2024-09-03T04:03:29Z",
      "title": "Could mass protests in Israel over the hostages persuade Netanyahu to agree to a cease-fire deal?",
      "url": "https://apnews.com/d041f4fc2519597a15be95ad837e0df8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5eb0c293e164e73adc4d3f3675139f7/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — As Iran threatens to attack Israel over the assassination of a Hamas leader in the Iranian capital, its long-vaunted missile program offers one of the few ways for Tehran to strike back directly, but questions loom over just how much of a danger it poses.",
      "publishedAt": "2024-09-03T05:35:42Z",
      "title": "As Iran threatens Israel, the danger of Tehran's long-vaunted missile program remains in question",
      "url": "https://apnews.com/edccddf7a871b78cd5528e265e1e7317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7469ae137c534bfaa62306d23d9ebd9b/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis arrived in Indonesia on Tuesday at the start of the longest trip of his pontificate, hoping to encourage its Catholic community and celebrate the tradition of interfaith harmony in a country with the world’s largest Muslim population.",
      "publishedAt": "2024-09-03T01:08:07Z",
      "title": "Pope opens Asia odyssey with stop in Indonesia to rally Catholics, hail religious freedom tradition",
      "url": "https://apnews.com/05c710ad993231bd8840c75f959f2b05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01ac745304fb49ba81dcdc32f957abfc/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and AMELIA THOMSON-DEVEAUX",
      "description": "LA CROSSE, Wis. (AP) — After a summer of historic tumult, the path to the presidency for both Kamala Harris and Donald Trump this fall is becoming much clearer.",
      "publishedAt": "2024-09-03T04:03:35Z",
      "title": "The presidential campaigns brace for an intense sprint to Election Day",
      "url": "https://apnews.com/151f82b59473d29a448ef1cea9afe471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12f081cd09104c19a3c99ce684de21c4/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, ERIN B. LOGAN and WILL WEISSERT",
      "description": "PITTSBURGH (AP) — Vice President Kamala Harris used a joint campaign appearance with President Joe Biden in the critical swing state of Pennsylvania on Monday to say that U.S.",
      "publishedAt": "2024-09-02T04:14:45Z",
      "title": "Harris opposes US Steel's sale to a Japanese firm during joint Pennsylvania event with Biden",
      "url": "https://apnews.com/afd4b7fbd9d747e307a8fb5c1f60d5fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39e15743d47c4fd5b1c78de980ace9d5/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JORGE RUEDA",
      "description": "CARACAS, Venezuela (AP) — A Venezuelan judge on Monday issued an arrest warrant for the opposition’s former presidential candidate Edmundo González as part of a criminal investigation into the results of the highly anticipated July election that both the ruling party and its opponents claim to have won.",
      "publishedAt": "2024-09-02T22:31:27Z",
      "title": "Venezuelan judge issues arrest warrant for opposition's former presidential candidate",
      "url": "https://apnews.com/d34272422cddb42c1dde9166539a85d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0e8c9a951554dbb8fc5065ff7087a02/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A bus crashed into a group of students and their parents at a school in eastern China early Tuesday, killing 11 people and injuring 13, police said.The students and parents were at the gate of a middle school in Tai’an city in the eastern province of Shandong just before 7:30 a.m., the Dongping county police department said in a posting on social media.",
      "publishedAt": "2024-09-03T03:42:26Z",
      "title": "Bus crashes into students and parents in eastern China, killing 11 and injuring 13, police say",
      "url": "https://apnews.com/8c940fa9441ca65bdc55f8203a3a74b5",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "MANILA, Philippines (AP) — A fierce storm was blowing out of the northern Philippines Tuesday after leaving at least 14 people dead in landslides, floods and swollen rivers, disaster-response officials said.",
      "publishedAt": "2024-09-03T00:54:18Z",
      "title": "Fierce storm blows out of northern Philippines after leaving 14 dead in landslides and floods",
      "url": "https://apnews.com/95604282315e6adade30a5a465a31562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2b19ed3ce7e43668d08a71aacc63974/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Jessica Pegula is back in the quarterfinals at the U.S. Open after a 6-4, 6-2 victory over Diana Shnaider on Monday, her seventh trip to that round at a Grand Slam tournament.",
      "publishedAt": "2024-09-02T18:22:01Z",
      "title": "US Open: Jessica Pegula's 7th Grand Slam quarterfinal will be against No. 1 Iga Swiatek",
      "url": "https://apnews.com/1ef3c2516d59022773a2fcca5170ea63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfb2f8c29866417a97c04e6133b92145/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}