{
  "articles": [
    {
      "author": "Ellen Knickmeyer, Lindsay Whitehurst",
      "description": "A federal judge says the Trump administration has kept withholding foreign aid despite a court order and must at least temporarily restore the funding to programs worldwide. But the U.S. District Judge declined Thursday to find Trump administration officials in contempt of his order. The ruling comes in a lawsuit by the nonprofit groups challenging the Trump administration’s month-old cutoff of foreign assistance through the U.S. Agency for International Development and State Department, which shut down $60 billion in annual aid and development programs overseas almost overnight. Administration officials have defended the nonpayment, saying they could lawfully stop or terminate payments under thousands of contracts without violating the judge’s order.",
      "publishedAt": "2025-02-20T23:55:45Z",
      "title": "Trump is still withholding foreign aid despite court order, judge says",
      "url": "https://apnews.com/article/trump-usaid-foreign-aid-freeze-judge-f995a8ccf69fc62826f69442196e94ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/66f5795/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F24%2Fa8552cd4788e0b7c3ad5128c5ff3%2F16dc73603e4d48a4aa3dbf80cda63b40"
    },
    {
      "author": "Adriana Gomez Licon",
      "description": "Billionaire Elon Musk has created a buzz waving a chainsaw in the air at a conservative gathering outside Washington. He showed openness to auditing the Federal Reserve and accused Democrats of “treason.” The Tesla CEO has become President Donald Trump’s close adviser. He spoke Thursday about his crusade to cut government spending and downsize the federal workforce with the administration’s Department of Government Efficiency. Before speaking at the Conservative Political Action Conference, he met with Argentine President Javier Milei, who has been frequently praised by Musk. Milei popularized the power tool while campaigning in 2023 and proposing slashing public spending.",
      "publishedAt": "2025-02-21T00:31:59Z",
      "title": "Musk waves a chainsaw and charms conservatives at CPAC",
      "url": "https://apnews.com/article/musk-chainsaw-trump-doge-6568e9e0cfc42ad6cdcfd58a409eb312",
      "urlToImage": "https://dims.apnews.com/dims4/default/601e1af/2147483647/strip/true/crop/5649x3178+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F73%2Fece4f1bc583409fca8f1f4d89557%2F9e7716ef37fc4a21b783c0a97fd0d944"
    },
    {
      "author": "Ashraf Khalil",
      "description": "The moment that local officials in our nation’s capital have been dreading for months is finally here. President Donald Trump, one month into his second term, has publicly returned to one of his longtime talking points: a federal takeover of the District of Columbia. It would take some doing, though — including, literally, an act of Congress. It's the latest in the blizzard of initiatives that have surfaced since Trump took office Jan. 20. Whether it was just a reminder that the president possesses the power to set off alarms with an off-the-cuff remark or will direct his administration to try and make it happen remains to be seen.",
      "publishedAt": "2025-02-20T22:13:00Z",
      "title": "Why a full federal takeover of DC would require an act of Congress",
      "url": "https://apnews.com/article/district-of-columbia-trump-takeover-3b58c1efabf17db271dce582d9a09c6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f1561d/2147483647/strip/true/crop/5450x3066+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F8d%2F77b9b203a99bb4e6f89f68247032%2Ff05708ace50944138e1956676b6cc74a"
    },
    {
      "author": "Christopher Rugaber, Paul Wiseman",
      "description": "An idea first proposed on social media has bubbled up to the White House and received President Donald Trump’s enthusiastic endorsement: Take some of the savings from billionaire Elon Musk’s drive to cut government spending and return it to taxpayers. If Musk’s target of $2 trillion in spending cuts is achieved by next year, supporters of the idea say that about one-fifth of those funds could be distributed to taxpaying households in checks of about $5,000. But before you start planning for a windfall, budget experts say such huge savings — nearly one-third of the federal government’s annual spending — are highly unlikely.",
      "publishedAt": "2025-02-20T21:49:10Z",
      "title": "Could Trump really return DOGE savings to taxpayers?",
      "url": "https://apnews.com/article/trrump-doge-checks-inflation-7fb8b5b004faecc213c325fcbafc7ee9",
      "urlToImage": "https://dims.apnews.com/dims4/default/29ffc1e/2147483647/strip/true/crop/5754x3237+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F16%2F21f1a4e7810a1e71dd8822875058%2F1880b583787e4c13a6504341af1af3ee"
    },
    {
      "author": "Heather Hollingsworth, Collin Binkley, Annie Ma",
      "description": "As President Donald Trump reshaped the Education Department, parents say investigations and mediations into kids' disability rights cases ground to a halt. Standing up for children with disabilities has been a primary role of the department, which enforces the Individuals with Disabilities Education Act. Historically, most complaints to the department have involved disability discrimination. The freeze on pending cases and Trump’s calls to dismantle the department altogether left many parents worrying about the federal government’s commitment to disabled students. After The Associated Press asked the Education Department for comment on this reporting, a spokesperson said the department ended the pause on reviews of disability complaints Thursday.",
      "publishedAt": "2025-02-20T22:20:45Z",
      "title": "Education Department stalled cases for kids with disabilities, IEPs under Trump",
      "url": "https://apnews.com/article/education-department-iep-disability-civil-rights-trump-85a6687d9ef1f5236f2637924d66a560",
      "urlToImage": "https://dims.apnews.com/dims4/default/15405a1/2147483647/strip/true/crop/4917x2766+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F30%2F00d85808e236e1828df32e30c018%2F58ac1ce311cf4ae5b01415a71311e400"
    },
    {
      "author": "Steve Peoples, Joey Cappelletti",
      "description": "Pete Buttigieg is quietly contemplating his future from a small city in northern Michigan while talking to Democratic Party officials, labor leaders and top strategists. Some believe Buttigieg is the party’s next savior. The 43-year-old former mayor of South Bend, Indiana, and recently retired U.S. transportation secretary has yet to decide if that’s a responsibility he wants. Buttigieg must decide soon whether he wants to return to the national spotlight as a candidate in Michigan’s 2026 Senate race or focus on a much more consequential role as his party’s next presidential nominee two years later. Prominent allies believe Buttigieg cannot feasibly run for the Senate and the presidency.",
      "publishedAt": "2025-02-20T14:07:45Z",
      "title": "Buttigieg weighs a decision with huge implications for Democrats: Run for Senate or president?",
      "url": "https://apnews.com/article/buttigieg-democrats-michigan-senate-president-2026-2028-9be5c4c8e91437d6202b58c853bd8a08",
      "urlToImage": "https://dims.apnews.com/dims4/default/5cb028a/2147483647/strip/true/crop/4952x2786+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2Ffe%2F44ecce01a628a853f6707ee33f1f%2F8c2f06243dd74659ade7467802859702"
    },
    {
      "author": "Megan Janetsky, Javier Córdoba",
      "description": "A U.S. flight carrying 135 deportees, half of them minors from various countries, is set to land in Costa Rica, making the country the latest Latin American nation to serve as a stopover as U.S. President Donald Trump’s administration steps up deportations. It’s part of a deal the Trump administration struck with Costa Rica during Secretary of State Marco Rubio’s visit earlier this month. Similar agreements have been reached with other Latin American nations. But the concept of using third countries as deportation layovers has already fueled sharp human rights criticisms.",
      "publishedAt": "2025-02-20T19:01:58Z",
      "title": "Facing pressure from Trump, Costa Rica and Honduras join Panama as stopovers for foreign deportees",
      "url": "https://apnews.com/article/costa-rica-panama-mass-deportations-trump-migration-detention-85e70a0e4e053ea01b77b0e4d55c8fea",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce832f2/2147483647/strip/true/crop/6016x3384+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fc1%2F85d363d92cdc4db6a48917992245%2Ff5f4f6bf0e954791a625868622c9f1f5"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa, Melanie Lidman",
      "description": "The Israeli military says the remains of two child hostages have been identified but another body released by Hamas was not the boys’ mother. Hamas militants had turned over four bodies Thursday under the tenuous ceasefire that has paused over 15 months of war. Israeli confirmed one body was that of Oded Lifshitz, who was 83 when he was abducted during the Hamas attack that started the war in 2023. The military said later the remains of Ariel and Kfir Bibas had been identified and the family notified. But the military said the additional body was not that of their mother Shiri Bibas nor any other hostage. It called the failure to return four hostages Thursday a violation of the utmost severity of the ceasefire agreement.",
      "publishedAt": "2025-02-20T05:18:28Z",
      "title": "Remains of Shiri Bibas not returned by Hamas, Israel says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-20-2025-4c2ffabae1771cff1a9542fddfaf7d07",
      "urlToImage": "https://dims.apnews.com/dims4/default/e526e05/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fdf%2F7ef062f6e65bcc5184c27f453333%2F78404add511541239e870f47a5f88383"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "Senators are launching a budget “vote-a-rama” in a crucial, if dreaded, step toward President Donald Trump's agenda. They are staying late Thursday to debate a $340 billion package Trump’s team says it needs for mass deportations and security measures that top the Republican agenda. It's a sight to see: Senators will be voting in rapid-fashion for hours on one amendment after another diving into intricate policy details, largely from Democrats trying to halt the package. Even if the Senate package is approved, it still needs to be merged with one from the House, which is preparing Trump's “big, beautiful bill” that includes some $4.5 trillion in tax cuts and up to $2 trillion less spending.",
      "publishedAt": "2025-02-20T23:27:03Z",
      "title": "Senate ready to stay up all night to pass GOP budget",
      "url": "https://apnews.com/article/senate-budget-trump-tax-cuts-deportations-48f6565ccb0fd6002734dbb5c3c3ffb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f00250a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F2b%2F9760a09a886139353ec60ab80ebf%2Ffbc94327fe4c40e5b5f54cef989edf41"
    },
    {
      "author": "Eric Tucker",
      "description": "The Senate is set to vote on whether to confirm Kash Patel as FBI director. Thursday's vote that would place Patel atop the nation’s premier federal law enforcement agency despite concerns from Democrats over his qualifications and the prospect he would do President Donald Trump’s bidding. Patel’s nomination has now advanced in a 51-47 party-line vote, putting him on track for confirmation in the Republican-controlled Senate in the afternoon. To deny Patel's the job, more than three Republican senators would have to defy Trump’s will and vote “no,” and that's seen as unlikely.",
      "publishedAt": "2025-02-20T05:01:40Z",
      "title": "Senate pushes toward confirmation of Kash Patel as Trump's FBI director",
      "url": "https://apnews.com/article/trump-patel-fbi-justice-department-518329110ea230e2989095bfcbe34c59",
      "urlToImage": "https://dims.apnews.com/dims4/default/817e2b2/2147483647/strip/true/crop/5798x3261+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F39%2F462a8fd9031d0ba12315ae77bb72%2Fad175c9d34e349699c1c0224784ea5e4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}