{
  "articles": [
    {
      "author": null,
      "description": "UK police have arrested Andrew Mountbatten-Windsor, the former Prince Andrew, on suspicion of misconduct in public office. On Thursday, Thames Valley Police said they opened an investigation after assessing reports about his alleged contact with Jeffrey Epstein. Police did not name him, which follows U.K. practice, but they confirmed they arrested a man in his 60s. Police say they want to protect the integrity of the investigation. They also said the case drawed strong public interest and they planned to share updates at the right time. Pictures online also appeared to show police cars and officers outside his home.",
      "publishedAt": "2026-02-19T10:21:46Z",
      "title": "UK police arrest Andrew Mountbatten-Windsor for misconduct in public office",
      "url": "https://apnews.com/article/britain-epstein-andrew-former-prince-arrested-fb0b9e738bf7ede10651914ee3f3583d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a1374d/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F2c%2Ffb3ef81145cb9ee829890253e2be%2Fap26035407432236.jpg"
    },
    {
      "author": "Olga R. Rodriguez, Julie Watson",
      "description": "Crews have pushed through mountainous wilderness in California near Lake Tahoe during a snowstorm to rescue six backcountry skiers who survived an avalanche but were trapped by its snow and ice. Nine others from their tour group remain missing. The Nevada County Sheriff's Office says two of the six were taken to a hospital for treatment. The sheriff’s office says there were 15 skiers on the trip — not 16 as initially believed. Extreme weather conditions in the Northern California mountains slowed the rescue effort. It took crews several hours to reach the skiers and take them to safety, where they were evaluated by the Truckee Fire Department.",
      "publishedAt": "2026-02-18T07:13:40Z",
      "title": "A California avalanche hits 16 backcountry skiers. 6 survivors located and 9 are missing",
      "url": "https://apnews.com/article/california-avalanche-backcountry-skiers-rescue-missing-f7b4a89c38af634e39a152a874db17f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0985967/2147483647/strip/true/crop/1105x736+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fe5%2F8782f1d55bd764c87f978c7e1f1f%2Fb41d651afd5548d28cb86c303a1d8f7e"
    },
    {
      "author": "Tammy Webber",
      "description": "Experts say a weekslong “snow drought” in Norther California's Sierra Nevada helped set the stage for Tuesday's deadly avalanche, after several feet of new snow fell on an earlier layer that had hardened. The new snow didn't bond to the earlier layer before the avalanche near Lake Tahoe killed at least eight backcountry skiers, said San Jose State University meteorology professor Craig Clements. Six skiers survived and rescuers were searching for another who was still missing. The group was on a three-day backcountry trek when they were trapped by the avalanche as a winter storm pummeled the West Coast.",
      "publishedAt": "2026-02-19T04:46:37Z",
      "title": "Snow drought set stage for California avalanche that trapped skiers",
      "url": "https://apnews.com/article/avalanche-lake-tahoe-sierra-nevada-california-skiers-f8afce1e77b4174189ced70c22374014",
      "urlToImage": "https://dims.apnews.com/dims4/default/4237f6d/2147483647/strip/true/crop/1667x1111+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F50%2F99b8cafc934e51f5c0c4a6a7c9ab%2Fb7773b759d094b09bacfc8c8cbb11006"
    },
    {
      "author": "Joey Cappelletti, Steven Sloan",
      "description": "Governors are arriving in Washington for an annual gathering that has traditionally been a show of bipartisanship. But President Donald Trump has disrupted norms by not inviting all governors to meetings at the White House. Maryland Gov. Wes Moore, a Democrat, joined Oklahoma Gov. Kevin Stitt and Utah Gov. Spencer Cox, both Republicans, in opening this year’s National Governors Association on a panel where they emphasized bipartisanship regardless of Trump's actions. The break with tradition reflects Trump’s broader approach in his second term. He has taken a confrontational stance toward some state leaders, withholding federal funds from states that draw his ire and deploying federal troops to cities over the objections of local officials.",
      "publishedAt": "2026-02-19T05:15:03Z",
      "title": "Governors arrive in Washington eager to push past Trump's partisan grip",
      "url": "https://apnews.com/article/governors-trump-meeting-counterweight-washington-5e078af4172aba3ea3c734c910e4e0c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e3c136/2147483647/strip/true/crop/4000x2665+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F3c%2Fd5ac0fe471e76600e6164aa1a682%2Faf7588c62a4e440b85dac0f139acb8ba"
    },
    {
      "author": "Ryan J. Foley, Jim Mustian",
      "description": "The federal prosecutor’s office in Minnesota has been gutted by a wave of career officials resigning or retiring over objections to Trump administration directives. Because of the turmoil, 12-time convicted felon Cory Allen McKay caught a break. He was scheduled to stand trial next month on methamphetamine trafficking charges that could have locked him up for 25 years. Instead, he walked free after the prosecutor on his case retired. The diminished U.S. Attorney's Office has been forced to dismiss some cases, kill others before charges are filed and seek plea agreements and delays. Local officials worry the office will be unable to bring charges against some of the state’s most serious offenders.",
      "publishedAt": "2026-02-19T05:08:03Z",
      "title": "Defendants catch a break from exodus of prosecutors in Minnesota",
      "url": "https://apnews.com/article/minnesota-prosecutors-office-defendant-free-142f82b163a8b0d646ba6079251d32be",
      "urlToImage": "https://dims.apnews.com/dims4/default/c99d897/2147483647/strip/true/crop/3900x2599+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fdd%2F3df03bab0c0b3be07726d4487449%2Fae55ffbd7e174ff0868197e6074e0070"
    },
    {
      "author": "Kim Tong-hyung",
      "description": "Former South Korean President Yoon Suk Yeol has been sentenced to life in prison for his brief imposition of martial law to suppress the opposition. The Seoul Central District Court on Thursday found Yoon guilty of mobilizing military and police forces in an illegal attempt to seize the liberal-led National Assembly, arrest politicians and establish unchecked power for a considerable time. Yoon is likely to appeal the verdict. Yoon fell from office after an ill-advised attempt to overcome an opposition-controlled legislature by declaring martial law and sending troops to surround the legislature on Dec. 3, 2024. A special prosecutor had requested the death penalty, saying Yoon deserved harsh punishment for the threat his actions posed to the country’s democracy.",
      "publishedAt": "2026-02-19T05:05:52Z",
      "title": "Former South Korean President Yoon receives life sentence for imposing martial law",
      "url": "https://apnews.com/article/south-korea-yoon-suk-yeol-martial-law-verdict-rebellion-5d5f5c3a82590dc805b41b905f5bbca1",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d27e92/2147483647/strip/true/crop/4301x2866+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Ffe%2F00211c8977bf32bc43c389799d2f%2F0573cf88758d461091d585fb2cb7c74f"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Asian shares are mostly higher after U.S. stocks advanced, led by computer chip giant Nvidia. Markets in Greater China were closed for Lunar New Year holidays, while some others reopened for trading. U.S. futures edged lower early Thursday and oil prices rose. On Wednesday, the S&P 500 rose 0.6% and the Dow Jones Industrial Average added 0.3%. The Nasdaq composite gained 0.8%. Nvidia was the strongest force lifting the market after Meta Platforms announced a deal to use millions of its chips in AI data centers. Treasury yields climbed following several reports on the U.S. economy that were stronger than economists expected.",
      "publishedAt": "2026-02-19T04:24:14Z",
      "title": "Asian shares track Nvidia-led rally on Wall St",
      "url": "https://apnews.com/article/stocks-markets-iran-ai-trump-9105f5156c294507738154a714dcd13d",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc6ecd8/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F81%2F51aa6093ab01ca759f4b83ee56e7%2Fc2da790a1702407bb7754d7749bc8883"
    },
    {
      "author": "Steve Karnowski",
      "description": "A federal judge will hear arguments Thursday on whether he should extend an order that protects Minnesota refugees who are lawfully in the U.S. from being arrested and deported. U.S. District Judge John Tunheim blocked the government from targeting these refugees last month via a program it dubbed Operation PARRIS. He says the plaintiffs in the case are likely to prevail on their claims “that their arrest and detention, and the policy that purports to justify them, are unlawful.” But his temporary restraining order will expire Feb. 25 unless he grants a more permanent preliminary injunction.",
      "publishedAt": "2026-02-19T05:05:49Z",
      "title": "Federal judge to decide on extending protections for refugees in Minnesota",
      "url": "https://apnews.com/article/minnesota-immigration-crackdown-refugee-lawsuit-87e5e89ee4f68189638f9e77acfb2994",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6c8d1a/2147483647/strip/true/crop/3905x2602+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fd2%2F7a31fabf3f9c593e596476e8b92d%2Fba2dc64e461b40f09d84f8570cc39121"
    },
    {
      "author": "Ed White",
      "description": "Authorities trying to solve the disappearance of Nancy Guthrie say they might tap DNA genealogy databases. It's the same step that police took to unravel a series of murders in California and the fatal stabbings of four college students in Idaho. The strategy could pay off: If unknown DNA evidence can be connected to someone in a genealogical database, it could lead investigators to a suspect in Guthrie’s apparent kidnapping in Arizona. A law enforcement database didn't turn up any matches to DNA found in gloves a few miles from Guthrie's home.",
      "publishedAt": "2026-02-19T04:50:02Z",
      "title": "Police in Nancy Guthrie case consider running DNA through genealogical sites",
      "url": "https://apnews.com/article/nancy-guthrie-savannah-guthrie-missing-mom-10ee20a0186bd8859c9b0a90f1d5c7da",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f36798/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F6f%2F1ff9ba9e0d16ea7f830733766876%2F22b9478a3bf94dd2826c85c0c1b2ab38"
    },
    {
      "author": "Jamey Keaten, Samy Magdy",
      "description": "U.N.-backed investigators say Sudan’s Rapid Support Forces have carried out a campaign in el-Fasher that shows hallmarks of genocide against non-Arab communities. The fact-finding mission says the group inflicted mass killings and starvation-like siege conditions that targeted the Zaghawa and Fur people. U.N. officials say thousands of civilians were killed and many others disappeared after the city fell to RSF fighters in late October. The team's report describes executions, rape, torture, abductions and selective targeting of women and girls. It said the violence looks planned, not chaotic. It calls for accountability and stronger civilian protection as the war spreads.",
      "publishedAt": "2026-02-19T07:06:36Z",
      "title": "UN experts say violence in Sudan bears 'hallmarks of genocide'",
      "url": "https://apnews.com/article/rsf-sudan-genocide-un-85b79539f9e4b18e25dd6ef82d5b53ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c9865c/2147483647/strip/true/crop/6720x4478+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F57%2F1e27e14b6aa765c44aff229cab02%2F8d00ea96760447d9991dc4bd939fa270"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}