{
  "articles": [
    {
      "author": "DAVID SHARP, ROBERT BUMSTED, HOLLY RAMER and MICHAEL BALSAMO",
      "description": "LEWISTON, Maine (AP) — Authorities carried out a multistate search on land and water Thursday for a U.S. Army reservist who they say killed 18 people and wounded 13 in a mass shooting at a bowling alley and bar that sent panicked patrons scrambling under tables and behind bowling pins and gripped the entire state of Maine in fear.",
      "publishedAt": "2023-10-26T00:24:51Z",
      "title": "A suspect in the fatal shooting of 18 in Maine is still at large. Residents are sheltering in place",
      "url": "https://apnews.com/49da6d06a8b5a15d3b619b3927bc33ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd29aa1dbab0473d9496394e723f8070/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE, LINDSAY WHITEHURST and MARC LEVY",
      "description": "PORTLAND, Maine (AP) — Barely four years before a gunman's deadly rampage in Maine, a state that is staunchly protective of gun rights, the governor signed a law aimed at preventing a mass shooting like the one Wednesday night that claimed at least 18 lives.",
      "publishedAt": "2023-10-26T17:54:41Z",
      "title": "Maine passed a law to try to prevent mass shootings. Some say more is needed after Lewiston killings",
      "url": "https://apnews.com/c0ea366da50bd9d9dd4fb1aac256c049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2774c3f8a9554ccab6e5f53dfb41c0fb/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, KAREEM CHEHAYEB and AMY TEIBEL",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops and tanks briefly raided northern Gaza overnight, the military said Thursday, engaging with Hamas fighters and targeting anti-tank weapons in order to “prepare the battlefield” before an expected ground invasion.",
      "publishedAt": "2023-10-26T05:41:33Z",
      "title": "Israeli troops briefly raid northern Gaza to 'prepare' for an expected full-scale incursion",
      "url": "https://apnews.com/2964c54724e0e80382dd29756b3427bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8cb885ccd848ef9ea40bd0de3cae09/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — How many Palestinians have been killed in the Gaza Strip since the war between Israel and Hamas started?With Israel besieging and bombing territory at a scale never seen before, arriving at a precise answer isn't easy.",
      "publishedAt": "2023-10-26T18:41:05Z",
      "title": "EXPLAINER: What is Gaza's Ministry of Health and how does it calculate the war's death toll?",
      "url": "https://apnews.com/59470820308b31f1faf73c703400b033",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44d38772fce54c088ee30b7df14c1025/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "The new leader of one of the chambers of Congress that will certify the winner of next year's presidential election helped spearhead the attempt to overturn the last one, raising alarms that Republicans could try to subvert the will of the voters if they remain in power despite safeguards enacted after the 2021 attack on the U.S.",
      "publishedAt": "2023-10-26T04:04:21Z",
      "title": "New US House speaker tried to help overturn the 2020 election, raising concerns about the next one",
      "url": "https://apnews.com/8cd7c5a9e6ae69635bbb4624cc78e5c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f05679f2bcbd46299375087703fcfcb0/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "ACAPULCO, Mexico (AP) — Otis' stunning transformation into a monster hurricane killed at least 27 people as it devastated Acapulco, officials said Thursday. President Andrés Manuel López Obrador went by road after the hurricane hit the iconic city on Mexico's Pacific coast, where at least four people remained missing.",
      "publishedAt": "2023-10-26T05:15:46Z",
      "title": "Otis' stunning turn to monster Pacific hurricane kills at least 27 in Acapulco",
      "url": "https://apnews.com/17b4b34147a2fe5acbe980a0b5b06aa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KRAMATORSK, Ukraine (AP) — In a city where damaged buildings are everywhere, a destroyed pizzeria stands out as a painful reminder of lives and livelihoods dashed in an instant.",
      "publishedAt": "2023-10-26T04:09:39Z",
      "title": "Business owners in a Ukrainian front-line city adapt even as 'a missile can come at any moment'",
      "url": "https://apnews.com/31db3fb8c8d628f6803e1ddbc8c504b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a739300794445ab9215f746d79cdf7d/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Muslim and Jewish civil rights groups say they’ve seen large increases in reports of harassment, bias and sometimes physical assaults against members of their communities since the Oct.",
      "publishedAt": "2023-10-26T04:16:29Z",
      "title": "An increase in harassment against Jewish and Muslim Americans has been reported since Hamas attacks",
      "url": "https://apnews.com/f5a3e969f5a213625c224f8ac25538e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d1edeab6738401cbe34ab3aff1fdad6/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union said Wednesday it has reached a tentative contract agreement with Ford that could be a breakthrough toward ending the nearly 6-week-old strikes against Detroit automakers.",
      "publishedAt": "2023-10-25T17:24:17Z",
      "title": "Autoworkers reach a deal with Ford, a breakthrough toward ending strikes against Detroit automakers",
      "url": "https://apnews.com/08a81503d72e44d4efa40549f684d5a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b36d130cce04d7096f85c64efc63152/1920.jpeg"
    },
    {
      "author": "SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — An Ohio woman has been indicted on murder charges in the deaths of at least four men in the capital city of Columbus, the Ohio Attorney General said Wednesday, though investigators believe there are more victims.",
      "publishedAt": "2023-10-26T14:10:24Z",
      "title": "Ohio woman indicted on murder charges in deaths of at least four men, attorney general says",
      "url": "https://apnews.com/99c8b760a225caa90c9cff733f22b7b5",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}