{
  "articles": [
    {
      "author": null,
      "description": "U.S. President Donald Trump’s special envoy to Ukraine, retired Lt. Gen. Keith Kellogg, arrived in Kyiv on Monday. Discussions will focus on defense, security, and U.S.-Ukraine cooperation. Trump has expressed frustration with Russian President Vladimir Putin over continued attacks on Ukraine, calling Putin’s actions “crazy.” The U.S. is sending Patriot missiles to help Ukraine counter Russia’s intensified aerial strikes. June saw record civilian casualties, with Russia launching significantly more attacks than last year. Meanwhile, NATO’s Secretary-General is in Washington for talks, and Sen. Lindsey Graham claims the conflict is at a turning point, with increased U.S. support for Ukraine expected soon.",
      "publishedAt": "2025-07-14T07:46:13Z",
      "title": "Trump envoy Kellogg in Kyiv as US pledges Patriot missiles to Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-patriot-missiles-kellogg-ca8cda9b417737188c471390bc312a5d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2fb7a1/2147483647/strip/true/crop/2000x1125+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Fdf%2F694c113fd6314a5ad38a86f82f33%2F49b58a5408744bb096a24f5bb7eec466"
    },
    {
      "author": null,
      "description": "The voters in early presidential nominating states are used to seeing contenders months or even years before most of the country. But the political jockeying in 2025 for the 2028 presidential contest appears to be playing out earlier, with more frequency and with less pretense than ever before. While the first presidential primary votes won’t be cast for another two and a half years, three Democratic presidential prospects are scheduled to campaign in South Carolina for 10 days this month. Nearly a half dozen others have made recent pilgrimages to South Carolina, New Hampshire and Iowa. This week, both Kentucy Gov. Andy Beshear and Rep. Ro Khanna will be in South Carolina.",
      "publishedAt": "2025-07-14T04:03:02Z",
      "title": "Newsom, other Democrats are lining up for 2028 presidential race",
      "url": "https://apnews.com/article/democrats-president-2028-newsom-beshear-khanna-south-carolina-004ca304aeecf186391b5439b51b3836",
      "urlToImage": "https://dims.apnews.com/dims4/default/346f53d/2147483647/strip/true/crop/3877x2181+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Fe2%2Fbaafb6948e3cb6adc143c8751d7a%2F7b01f83ff892474c9a93294c3c69b3a0"
    },
    {
      "author": null,
      "description": "NATO Secretary General Mark Rutte is set to meet President Donald Trump this week on the heels of the U.S. leader announcing plans to sell NATO allies weaponry that it can then pass on to Ukraine. NATO said Rutte will be in Washington on Monday and Tuesday and would meet with Trump, Secretary of State Marco Rubio, and Defense Secretary Pete Hegseth as well as Congress. The visit also comes as Trump last week teased that he would make a “major statement” on Russia on Monday and as Ukraine is struggling to repel massive and complex air assaults launched by Russian forces.",
      "publishedAt": "2025-07-13T14:04:24Z",
      "title": "Trump to meet NATO leader Rutte after Ukraine weapons sales",
      "url": "https://apnews.com/article/trump-rutte-nato-putin-ukraine-524abe34764e4bb5838bbc90fc992520",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f3bd8a/2147483647/strip/true/crop/4339x2441+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F99%2F1da809154681f70606c1709908e8%2F88efd82867e543d0bfca2fb7f0e00322"
    },
    {
      "author": null,
      "description": "Clashes between Druze militias and Sunni Bedouin clans in Syria's Sweida province have killed more than 30 people and injured nearly 100. The interior ministry said Monday that military forces will deploy to restore order. The Syrian Observatory for Human Rights reported 37 deaths and said the violence began after kidnappings and robberies escalated tensions between Druze and Sunni Bedouin groups. The ministry called the situation a dangerous escalation fueled by the absence of effective governance. Sweida is home to Syria’s Druze minority and has seen unrest since the fall of former leader Bashar Assad, with Druze factions divided over integrating with the new government.",
      "publishedAt": "2025-07-14T05:57:27Z",
      "title": "More than 30 killed in Syria clashes",
      "url": "https://apnews.com/article/syria-clashes-druze-bedouins-sweida-be7e45ae4adc631b758d2bebfb06e0a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/078129e/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F11%2F5456f56b106939a8bf14f9a8903d%2Ffdd71330901640218e8869c200b46795"
    },
    {
      "author": null,
      "description": "European trade ministers are meeting in Brussels after U.S. President Donald Trump announced 30% tariffs on the European Union. The tarrfois againt the EU, America’s largest trading partner, could disrupt economies and raise prices on goods like French cheese and German electronics. Brussels has delayed retaliatory tariffs, initially set for Monday, to allow time for negotiations until August 1. European leaders emphasize unity but are preparing countermeasures if talks fail. Meanwhile, the EU is strengthening ties with Asian and South American nations, seeking to diversify its economic partnerships amid ongoing tensions with the U.S.",
      "publishedAt": "2025-07-14T07:11:28Z",
      "title": "European trade ministers meet to forge strategy after Trump's surprise 30% tariffs",
      "url": "https://apnews.com/article/europe-us-trump-tariffs-trade-be679cb7642c167baabdce2c50392d0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e06c2b/2147483647/strip/true/crop/5270x2964+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F8f%2F7ecc6d4c49ac99b89618b9f6b474%2Fb806c76b4de24e56b2f3868ce66d06dc"
    },
    {
      "author": null,
      "description": "Shares are mixed in Asia after the S&P 500 and the Nasdaq composite edged away from the records they set last week. Chinese shares advanced after the government reported that exports rose last month as a truce in a tariffs war prompted a surge in orders ahead of an August deadline for reaching a new trade deal with Washington. An announcement by U.S. President Donald Trump that he plans 30% tariffs on goods from Mexico and the European Union had scant immediate impact, as analysts said they expected progress toward trade deals before an Aug. 1 deadline. On Friday, the S&P 500 fell 0.3% and the Dow industrials gave back 0.6%. The Nasdaq composite slipped 0.2%.",
      "publishedAt": "2025-07-14T06:53:46Z",
      "title": "Asian shares are mixed after S&P 500 and Nasdaq composite pull back from their all-time highs",
      "url": "https://apnews.com/article/stocks-markets-tariffs-trump-mexico-76c405f979a719cd89b682110ac856a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f47976c/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2Fad%2F3ed5c10a896f2e31172ad5b5a40b%2Fd242fc91b88f4517b07a74c12180ad3e"
    },
    {
      "author": null,
      "description": "Authorities are reporting multiple deaths in a fire at an assisted living facility in Fall River, Massachusetts, where people were hanging out of windows screaming for help. The fire broke out Sunday night at the Gabriel House facility, which houses about 70 residents. Firefighters arrived to find heavy smoke, flames, and occupants trapped inside. Many residents were rescued, but several were pronounced dead at the scene. Others were taken to hospitals with varying injuries. Five firefighters sustained non-life-threatening injuries. Officials say the cause of the fire is under investigation. The local fire chief called the incident a devastating tragedy for the community and affected families.",
      "publishedAt": "2025-07-14T10:31:14Z",
      "title": "Multiple deaths in fire at Massachusetts assisted living facility",
      "url": "https://apnews.com/article/fatal-fire-assisted-living-massachusetts-deef7610ac6b12cccd4fcc5b8088669f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Two women were killed in a shooting at a Kentucky church in an incident that began after a state trooper was shot and wounded, authorities said. The suspect was also killed Sunday. In a news conference, Lexington Police Chief Lawrence Weathers says it began after the trooper pulled over a vehicle near the airport. After shooting the trooper, the suspect carjacked a vehicle and fled to the church where they began shooting at people there. The suspect was later killed by Lexington police.",
      "publishedAt": "2025-07-13T18:48:21Z",
      "title": "Multiple people hurt in Kentucky church shooting; suspect killed, police say",
      "url": "https://apnews.com/article/kentucky-church-shooting-suspect-dead-c31e1c1c050ba96416fbd2082e4866d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A year after the assassination attempt against President Donald Trump during a Butler, Pennsylvania campaign rally, and the results from various investigations into the shooting are still coming. The Senate Committee on Homeland Security & Governmental Affairs in a report released Sunday said the Secret Service denied “multiple requests for additional staff, assets, and resources to protect President Trump” during the campaign. Another report by the Government Accountability Office criticized the Secret Service’s practices for sharing threat information, saying they had “siloed information sharing practices.” One rallygoer was killed and two others wounded when a gunman opened fire from a nearby roof. A bullet grazed Trump's ear.",
      "publishedAt": "2025-07-13T11:05:56Z",
      "title": "After Trump assassination attempt, questions remain for Secret Service",
      "url": "https://apnews.com/article/trump-butler-assassination-attempt-anniversary-crooks-d18804b0e1382003bbb91449638c721c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d4ab58/2147483647/strip/true/crop/5613x3157+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F93%2F6335f22e13f52f2f0537fc5a3df4%2Ff6f41b3f6d4e4d3ebfdc161ca0766cad"
    },
    {
      "author": null,
      "description": "Debate over President Donald Trump’s sweeping budget-and-policy package is over on Capitol Hill. Now the argument goes national. The new law already is shaping the 2026 midterm battle for control of the House of Representatives in dozens of competitive districts coast to coast. The outcome will set the tone for Trump’s final two years in the Oval Office. Democrats need a net gain of three House seats to break the GOP’s chokehold on Washington and reestablish a power center to counter Trump. Both parties have launched an effort to define the complex bill for voters across the competitive districts.",
      "publishedAt": "2025-07-13T12:15:51Z",
      "title": "Trump's big bill launches the battle for House control as midterms loom",
      "url": "https://apnews.com/article/trump-big-bill-midterm-election-republican-23652b22f1d760f5e3254ad4c3b642e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/2dc8c2f/2147483647/strip/true/crop/2300x1294+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F94%2F45aa404f971f90cb720bc4cf9a92%2F917a64ca9bb84855b995fa3f11ef5076"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}