{
  "articles": [
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Eddie Izzard is returning to a New York stage this winter for an ambitious version of “Hamlet.” It's ambitious because the actor-comedian will be the only one on stage.",
      "publishedAt": "2023-11-28T14:07:42Z",
      "title": "Eddie Izzard returns to New York for a version of Shakespeare's 'Hamlet' with just one actor onstage",
      "url": "https://apnews.com/f6647c3c0804cdbed729c1b4f992663e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/434ca06fa17f4fe3b86450ba8b028025/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Hamas and Israel released more hostages and prisoners under terms of a fragile cease-fire that held for a fifth day Tuesday as international mediators in Qatar worked to extend the truce.",
      "publishedAt": "2023-11-28T07:54:01Z",
      "title": "With deadline looming, diplomats seek to extend Gaza truce; more hostages, prisoners are freed",
      "url": "https://apnews.com/a909a0a0c9c76ce80d1ff3e94bbe2ec4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8f66cfada4a448d9af6edc0a7c9eae4/1920.jpeg"
    },
    {
      "author": "TIM REYNOLDS and SCHUYLER DIXON",
      "description": "Dallas Mavericks owner Mark Cuban is working on a deal to sell a majority stake in the NBA franchise to the family that runs the Las Vegas Sands casino company, a person with knowledge of the talks said Tuesday night.",
      "publishedAt": "2023-11-29T01:23:44Z",
      "title": "Mark Cuban working on $3.5B sale of Dallas Mavericks to Sands casino family, AP source says",
      "url": "https://apnews.com/28b58fc35f5c4159b5a4b61c749186b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/416b45d7aff840f3b1fa534d8522c2ed/3000.jpeg"
    },
    {
      "author": "BILL BARROW and ANDREW DeMILLO",
      "description": "ATLANTA (AP) — Rosalynn Carter was remembered Tuesday as a former U.S. first lady who leveraged her fierce intellect and political power to put her deep Christian faith into action by always helping others, especially those who needed it most.",
      "publishedAt": "2023-11-28T10:18:56Z",
      "title": "Rosalynn Carter honored by family, friends, first ladies and presidents, including husband Jimmy",
      "url": "https://apnews.com/def25a63701d39a1516da25015e48683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce121c731f07439c8d6d28ca5a1e7c04/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — As authorities in Vermont push forward with their investigation of the weekend shooting of three college students of Palestinian descent, they are weighing whether to treat the violence as a hate crime.",
      "publishedAt": "2023-11-28T18:22:36Z",
      "title": "Was the Vermont shooting of 3 men of Palestinian descent a hate crime? Under state law it might be",
      "url": "https://apnews.com/03e051f7a7f5634ee220803bdbe4886c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff6a7d70b554818a129629cada020fc/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis has decided to punish one of his highest-ranking critics, Cardinal Raymond Burke, by revoking his right to a subsidized Vatican apartment and salary in the second such radical action against a conservative American prelate this month, according to two people briefed on the measures.",
      "publishedAt": "2023-11-28T15:01:52Z",
      "title": "Pope punishes leading critic Cardinal Burke in second action against conservative American prelates",
      "url": "https://apnews.com/163f2d3522a80fa5f908421cc812cfc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cc6d953267d416ca71810a3896fdeed/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Computer-generated writers ... writing computer-generated stories? Sports Illustrated is the latest media company to see its reputation damaged by being less than forthcoming — if not outright dishonest — about who or what is writing its stories at the dawn of the artificial intelligence age.",
      "publishedAt": "2023-11-28T22:44:29Z",
      "title": "Sports Illustrated is the latest media company damaged by an AI experiment gone wrong",
      "url": "https://apnews.com/479cc3869c0638df5bbb26d4b1e4f18f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8c67751fda54211b4465d2a08ecdb0d/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden offered Tuesday to testify publicly before Congress, striking a defiant note in response to a subpoena from Republicans and setting up a potential high-stakes face-off even as a separate special counsel probe unfolds and his father, President Joe Biden, campaigns for reelection.",
      "publishedAt": "2023-11-28T13:43:42Z",
      "title": "Hunter Biden tells Congress he'd testify publicly, setting up a potential high-stakes face-off",
      "url": "https://apnews.com/55f869ddca927941ee3b1659bed2214c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13d2e323bb59456a90b75aaadf14e1f4/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JANIE HAR and MICHAEL CASEY",
      "description": "PORTLAND, Ore. (AP) — Tossing tent poles, blankets and a duffel bag into a shopping cart and three wagons, Will Taylor spent a summer morning helping friends tear down what had been their home and that of about a dozen others.",
      "publishedAt": "2023-11-28T05:09:35Z",
      "title": "Cities crack down on homeless encampments. Advocates say that’s not the answer",
      "url": "https://apnews.com/08ff74489ba00cfa927fe1cf54c0d401",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9a81228b2d424c8dfe17a6ded14bf7/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — The rescue mission was expected to last only a few days. Instead, it took 17 days to reach 41 construction workers who were trapped when a landslide collapsed a mountain tunnel in northern India earlier this month.",
      "publishedAt": "2023-11-28T18:26:23Z",
      "title": "Why it took 17 days for rescuers in India to get to 41 workers trapped in a mountain tunnel",
      "url": "https://apnews.com/314db578600d3fda09ef798d6ccef2f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eac479e81144e398d39f13e6ec8b171/2819.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}