{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The U.N. agency for Palestinian refugees said Sunday it is halting aid deliveries through the main cargo crossing into Gaza because of the threat of armed gangs who have looted recent convoys.",
      "publishedAt": "2024-12-01T07:41:27Z",
      "title": "UN says it is halting aid deliveries through main Gaza crossing because the route is too dangerous",
      "url": "https://apnews.com/6118019c9bc11204026b686206be8f6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e6ddace297842aaa8ec88fbdf3e1794/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "President-elect Donald Trump’s stunning announcement on Saturday night that he will nominate Kash Patel as FBI director sets the stage for a fresh round of turbulence at a law enforcement agency tasked with protecting the homeland and investigating federal crimes.",
      "publishedAt": "2024-12-01T05:03:41Z",
      "title": "Trump says he'll nominate Kash Patel as FBI director to remake the agency. Here's what happens next",
      "url": "https://apnews.com/6b2678baba229362d25b468ed2f61f87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/127e79ff6d864cdbadfdc611a3c13b5c/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump on Saturday threatened 100% tariffs against a bloc of nine nations if they act to undermine the U.S. dollar.His threat was directed at countries in the so-called BRIC alliance, which consists of Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "publishedAt": "2024-11-30T19:08:33Z",
      "title": "Trump threatens 100% tariff on the BRIC bloc of nations if they act to undermine US dollar",
      "url": "https://apnews.com/8572985f41754fe008b98f38180945c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e0e569c9bd4adab91f022e56758035/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The Syrian military rushed in reinforcements Sunday to push back insurgents from advancing farther into the northern Hama countryside after they seized Aleppo and surrounding strategic locations in an adjacent province in a surprise offensive.",
      "publishedAt": "2024-12-01T10:20:09Z",
      "title": "Syria sends in reinforcements to halt insurgents from advancing after seizing Aleppo",
      "url": "https://apnews.com/a8d7ddd45d3cb6b7aa943957b2ac6d9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0533145b068d4453a497fee6f9984428/3000.jpeg"
    },
    {
      "author": "MARK BANCHEREAU",
      "description": "THIAROYE-SUR-MER, Senegal (AP) — Biram Senghor regularly goes to pay his respects at a military cemetery in Thiaroye, a fishing village near Senegal’s capital Dakar, bowing in front of a different grave each time.",
      "publishedAt": "2024-12-01T04:24:03Z",
      "title": "Senegal demands answers as the West African country commemorates a French colonial massacre",
      "url": "https://apnews.com/76db7190dcbc12349ff0d6ade82309b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/176b06afb6f24dfd91d0d913fa5a2529/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE, RICK CALLAHAN and CAROLYN THOMPSON",
      "description": "BUFFALO, N.Y. (AP) — The first big snowfall of the season blanketed parts of New York, Pennsylvania and Michigan during the hectic U.S. holiday travel and shopping weekend, with numbing cold and heavy snow forecast to persist through the early part of the week and cause hazards in the Great Lakes, Plains and Midwest regions.",
      "publishedAt": "2024-12-01T05:45:28Z",
      "title": "Storm blankets parts of the US during busy holiday travel weekend with more snow and cold forecast",
      "url": "https://apnews.com/e38431108b6441a859f9664388b321d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04366a08b5324cdb8c75522a7e6a027f/1920.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE (AP) — The top United Nations court will take up the largest case in its history on Monday, when it opens two weeks of hearings into what countries worldwide are legally required to do to combat climate change and help vulnerable nations fight its devastating impact.",
      "publishedAt": "2024-12-01T04:10:00Z",
      "title": "A landmark climate change case will open at the top UN court as island nations fear rising seas",
      "url": "https://apnews.com/35d35cb3c8a49b980ce458d27cb24844",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbc10f978c4644bda7be4b038fcf083c/3000.jpeg"
    },
    {
      "author": "MARIA CHENG and MARIA VERZA",
      "description": "MEXICO CITY (AP) — It’s been called the closest the world has ever come to a vaccine against the AIDS virus.The twice-yearly shot was 100% effective in preventing HIV infections in a study of women, and results published Wednesday show it worked nearly as well in men.",
      "publishedAt": "2024-12-01T06:00:19Z",
      "title": "A twice-yearly shot could help end AIDS. But will it get to everyone who needs it?",
      "url": "https://apnews.com/02606f7d7892f0baf55bd0a0ff2ba3de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/919991e5b30b4429bb671bd3a6bae775/3000.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — In the long and storied history of New York City basketball, nobody wore it quite like Lou Carnesecca.The excitable St. John’s coach whose outlandish sweaters became an emblem of his team’s rousing Final Four run in 1985, died at 99 on Saturday, just a few weeks shy of his 100th birthday.",
      "publishedAt": "2024-12-01T05:04:31Z",
      "title": "Lou Carnesecca, Hall of Fame coach who led St. John's for 24 seasons, dies at 99",
      "url": "https://apnews.com/d7ed263ad4c9b5abe960a4ed4e88e13c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bb98265d10e4a7ab1e5d7f13a7d7683/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — For years, Pat Verhaeghe didn’t think highly of Donald Trump as a leader.Then Verhaeghe began seeing more of Trump’s campaign speeches online and his appearances at sporting events.",
      "publishedAt": "2024-11-30T18:11:42Z",
      "title": "Young men swung to the right for Trump after a campaign dominated by masculine appeals",
      "url": "https://apnews.com/ff30e38698a41132cf90345fffabe579",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/550e418aec0c4f8482ea919e673da874/2584.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}