{
  "articles": [
    {
      "author": null,
      "description": "Up all night, House Republicans voted pre-dawn to advance President Donald Trump’s tax and spending cuts package. The House is now starting a round of debates ahead of a final vote expected later Thursday morning. GOP leaders worked almost around the clock trying to persuade skeptical holdouts. Trump worked the phones as Republicans race to send the bill to his desk by the Fourth of July deadline. Speaker Mike Johnson had recalled lawmakers to Washington, eager to seize on the momentum of the 887-page bill's passage the day before in the Senate. Some GOP lawmakers are criticizing the legislation as straying from the party's fiscal goals. Johnson expects votes later Thursday morning.",
      "publishedAt": "2025-07-03T07:54:06Z",
      "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
      "url": "https://apnews.com/article/trump-big-beautiful-gop-taxes-ced365c347de9320eef2ccb8df16dda2",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f62811/2147483647/strip/true/crop/5803x3264+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F17%2F034bb11eaf5781d2c79435146a61%2F2a4fdc853eb544efaf189d0d42a565c6"
    },
    {
      "author": null,
      "description": "Republicans in Congress have muscled President Donald Trump’s tax and spending bill to passage. At nearly 900 pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations. The House approved the bill on Thursday, the final step necessary to get the bill to Trump's desk by the GOP’s self-imposed deadline of July 4th. The bill would make permanent many of the tax breaks passed in Trump's first term while also adding new ones, such as new tax deductions for tips, overtime, seniors and interest payments on auto loans.",
      "publishedAt": "2025-07-03T18:47:48Z",
      "title": "What's in Trump's big bill that passed Congress",
      "url": "https://apnews.com/article/what-is-republican-trump-tax-bill-f65be44e1050431a601320197322551b",
      "urlToImage": "https://dims.apnews.com/dims4/default/640fa02/2147483647/strip/true/crop/5876x3305+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F4f%2F9b40c7c90634883fa7b2cbb22d9f%2F4848db0607744a889293d7af549eb407"
    },
    {
      "author": null,
      "description": "President Donald Trump will be in Iowa to kick off a year of patriotic festivities leading up to next year's 250th anniversary of American independence. Organizers see the coming year of festivities, which start Thursday, as a way to help unite a polarized country and bridge partisan divides. But a recent Gallup poll showed the widest partisan split in patriotism in over two decades, with only about a third of Democrats saying they are proud to be American compared with about 9 in 10 Republicans. As a candidate, Trump proposed a “Great American State Fair” in Iowa, but it will take place next year in Washington instead.",
      "publishedAt": "2025-07-03T04:14:55Z",
      "title": "Trump marks celebration of America's 250th anniversary in Iowa",
      "url": "https://apnews.com/article/trump-america-250th-birthday-iowa-e6fb5df832cdba107ae4e9c62f2577e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/58d5f27/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F64%2F7c2f3c6202990b7d13194425ed3e%2F0a75ac31cfcb4be9b3cee59ae4183412"
    },
    {
      "author": null,
      "description": "The Supreme Court has agreed to review a case on transgender students' participation in school sports. The justices said Thursday they will review lower court-rulings in favor of transgender athletes in Idaho and West Virginia. The case highlights a broader national debate over transgender rights, with more than two dozen states enacting laws restricting transgender women and girls from participating in certain sports. Some of these laws have been blocked in court. The issue has become a focal point in legislative and legal battles over the inclusion of transgender individuals in public life.",
      "publishedAt": "2025-07-03T13:35:54Z",
      "title": "Supreme Court will hear case about transgender students and sports teams",
      "url": "https://apnews.com/article/supreme-court-transgender-athletes-title-ix-schools-3871f87d332fb229c07ad16aa3d3cca8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8868f37/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F07%2Fa48a09ac70eef1694b1a491f3df0%2F84c6d33ec30649c9b58b1f99950582a1"
    },
    {
      "author": null,
      "description": "Airstrikes and shootings in Gaza have killed 94 Palestinians overnight, according to Gaza’s Health Ministry on Thursday. Among the dead, 45 were attempting to get humanitarian aid. Dozens of people were killed in airstrikes that pounded tents and a school sheltering displaced people in the Strip Wednesday night and Thursday morning. The ministry states over 57,000 Palestinians have died since the war began on October 7, 2023, with more than half being women and children. The deaths come as Israel and Hamas inch closer to a possible ceasefire that would end the 21-month war.",
      "publishedAt": "2025-07-03T07:21:20Z",
      "title": "82 Palestinians killed in Gaza, including 38 waiting for aid, authorities say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-03-2025-7bed9df1b8a5278631ae844c18ace2b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2149152/2147483647/strip/true/crop/6659x3746+0+347/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa2%2F9c2dc746eea5f6d3df4211a62da2%2Fca0d521c42e64d86a1a2c52a88c0abde"
    },
    {
      "author": null,
      "description": "Famed Mexican boxer Julio César Chávez Jr. has been arrested for entering US illegally and will be deported to Mexico, where he faces organized crime charges, federal officials said Thursday. The arrest in Studio City, California, on Wednesday comes only days after the former middleweight champion fought in a match against Jake Paul in Anaheim, California. The Department of Homeland Security said Immigration and Customs Enforcement officers detained Chávez for overstaying a tourist visa. They said he also has an active arrest warrant in Mexico for involvement in organized crime and trafficking firearms, ammunition, and explosives and is believed to be an affiliate of the Sinaloa Cartel.",
      "publishedAt": "2025-07-03T18:54:25Z",
      "title": "ICE arrested Mexican boxer Julio César Chávez Jr. pending deportation",
      "url": "https://apnews.com/article/mexican-boxer-julio-cesar-chavez-arrested-deportation-e8f600abb9c7e5adfe60de8739fd12df",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b9fb42/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F73%2Fba004cedffa73ea13e7c85f69cd0%2Fad2448e99eca45d2bd604beb01c196e2"
    },
    {
      "author": null,
      "description": "The denial of bail for Sean “Diddy” Combs was an early signal by the judge that the music mogul won't be heading home soon. A defense lawyer said Wednesday after a jury acquitted him of sex trafficking charges that would have carried a mandatory 15 years behind bars that Combs has been working to be a better person. He was convicted of two lesser prostitution-related charges. Attorney Marc Agnifilo says he participated in a “batterer’s program” and has been a model prisoner since his September arrest. Judge Arun Subramanian cited his violence in rejecting bail and indicated he won't accept defense requests that he serve less than two years in prison.",
      "publishedAt": "2025-07-03T21:22:00Z",
      "title": "What the judge in Sean 'Diddy' Combs' case will consider at his sentencing",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-d9e733518a69da0e8ba360aa88b49198",
      "urlToImage": "https://dims.apnews.com/dims4/default/87e076c/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F6a%2F146b14d6374b1e3f8b9f8617798d%2F89b0f0471e064ee081bb254c5a0aa1d2"
    },
    {
      "author": null,
      "description": "The first group of immigrants has arrived at a new detention center deep in the Florida Everglades that officials have dubbed “Alligator Alcatraz.” Florida Republican Attorney General James Uthmeier said on social media Wednesday that “hundreds” of immigration detainees were to arrive at the center. Republican Gov. Ron DeSantis says the facility will have a capacity of about 3,000 detainees when fully operational. The center was built in eight days and features more than 200 security cameras, 28,000-plus feet of barbed wire and 400 security personnel. And the area features alligators, pythons and other dangerous wildlife.",
      "publishedAt": "2025-07-03T16:19:34Z",
      "title": "First immigration detainees arrive at Florida center in the Everglades",
      "url": "https://apnews.com/article/alligator-alcatraz-immigration-detainees-florida-56670910db4c88800d9df42ac3ce7f91",
      "urlToImage": "https://dims.apnews.com/dims4/default/57fe7f5/2147483647/strip/true/crop/3109x1749+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fee%2F60d4f5800e1763f0d60d8b02b717%2F566a4ef9fc4947eeb742172d69230479"
    },
    {
      "author": null,
      "description": "Bryan Kohberger has admitted guilt in the slayings of four students at the University of Idaho. But the public still doesn't know what motivated Kohberger to commit the knife attacks and how he chose his victims in 2022. More details could emerge when Kohberger returns to court for his life prison sentence on July 23. Some answers could also be in the hundreds of documents filed by prosecutors and defense lawyers that have been sealed and out of public view since his arrest more than two years ago.",
      "publishedAt": "2025-07-03T21:38:10Z",
      "title": "Guilty plea doesn't end quest for more details in Idaho college student slayings",
      "url": "https://apnews.com/article/bryan-kohberger-idaho-student-killings-fc03e31c8a35deb0718ae15e2887481a",
      "urlToImage": "https://dims.apnews.com/dims4/default/571583a/2147483647/strip/true/crop/6000x3375+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fb3%2F8f6e3eede38612e6fd9becc5b28c%2F6d3955aeb8b74941a66179ff3e5753e2"
    },
    {
      "author": null,
      "description": "Michael Madsen, whose menacing characters in “Reservoir Dogs” and “Kill Bill” made him a standout in Quentin Tarantino’s films, has died. He was 66. Madsen’s manager says the actor was found unresponsive in his home in Malibu, California on Thursday and was declared dead from what appeared to be cardiac arrest. Madsen’s career spanned more than 300 credits stretching back to the early 1980s, many in low budget films. But his most memorable screen moment may have been the sadistic torture of a captured police officer in 1992’s “Reservoir Dogs.” He would become a Tarantino regular, appearing in the “Kill Bill” films and “The Hateful Eight.”",
      "publishedAt": "2025-07-03T17:59:12Z",
      "title": "Michael Madsen dies at 66",
      "url": "https://apnews.com/article/michael-madsen-dead-f0ae75abae8fd3576676352f7eba084d",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdd3d10/2147483647/strip/true/crop/4678x2631+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F0c%2F0ecedc1d3f9fb626385508ecfc98%2F034e5d8a770a42fbaae28d4d5cebbe49"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}