{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "A senior Kremlin official says clinching a deal to end the war between Russia and Ukraine “is far too complex to be done quickly.” Kremlin spokesman Dmitry Peskov's comments Wednesday came as the U.S. labors to bring momentum to peace efforts and expresses frustration over the slow progress. Officials, meanwhile, said that a nighttime Russian drone attack on Ukraine’s second-largest city of Kharkiv wounded at least 45 civilians. The United Nations reported that the number of Ukrainian civilian casualties in the more than three-year war has surged in recent weeks. Peskov said Russian President Vladimir Putin backs calls for a ceasefire “but before it’s done, it’s necessary to answer a few questions and sort out a few nuances.”",
      "publishedAt": "2025-04-30T10:30:34Z",
      "title": "Kremlin says a deal to end the war with Ukraine can't be achieved quickly",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-peace-ce025ba11929ceff0c90f94c25a47624",
      "urlToImage": "https://dims.apnews.com/dims4/default/aff8e3f/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F14%2F45e929300d98393b7d3f97682a3a%2F240d0dc0732f4098adde9846f11fd779"
    },
    {
      "author": "Jon Gambrell",
      "description": "The British military has launched airstrikes with the United States targeting Yemen’s Houthi rebels. The strikes Tuesday night marked their first attack in Washington's new intense campaign targeting the Iranian-backed group. The U.K. Defense Ministry on Wednesday described the site attacked as “a cluster of buildings\" used by the “Houthis to manufacture drones of the type used to attack ships in the Red Sea and Gulf of Aden.” The ministry said that the site was located about 15 miles or 25 kilometers south of Sanaa. The Houthis acknowledged strikes around Sanaa overnight. The U.S. military’s Central Command didn't acknowledge the strike.",
      "publishedAt": "2025-04-30T02:38:12Z",
      "title": "UK military joins US in Yemen airstrike",
      "url": "https://apnews.com/article/yemen-houthis-us-uk-airstrikes-israel-hamas-war-9ab021aac8f01694fa98619e3ffe92ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb4da0c/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F3e%2F24b447739d4dc847ce185d31fd14%2F2019fecef2e74f339b016cbb3cf80f01"
    },
    {
      "author": "Mark Sherman",
      "description": "Chief Justice John Roberts appears to hold the key vote over whether the Supreme Court will allow the nation’s first publicly funded religious charter school, in Oklahoma. Roberts was the only justice whose vote seemed in doubt after the court heard more than two hours of arguments Wednesday in a major culture-war clash involving the separation of church and state. Four other conservative justices seemed firmly on the side of the St. Isidore of Seville Catholic Virtual School and the state charter school board that approved it. The three liberal justices seemed just as likely to vote to affirm an Oklahoma Supreme Court ruling that held that the taxpayer-funded school would entangle church and state in violation of the First Amendment.",
      "publishedAt": "2025-04-30T11:09:27Z",
      "title": "Supreme Court hears arguments over Oklahoma publicly funded religious school",
      "url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd0245d/2147483647/strip/true/crop/5721x3218+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Ffe%2Ff4621d1bf84d8a95cdd6efbf1a3a%2Ff9810f81014541e79a38cf0885d04992"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump has gotten worrisome news about how the U.S. economy is battening down for potential fallout from his tariffs. And the Republican president is trying to blame Democrat Joe Biden, who left office months ago. The government reported Wednesday the U.S. economy shrank at an annual rate of 0.3% during the first three months of the year. Behind the decline was a surge in imports as companies tried to front-run Trump's sweeping tariffs on autos, steel, aluminum and almost every country. After stocks sold off Wednesday morning, Trump said it's not his stock market, it's Biden's. A former Biden aide says Trump has taken the U.S. economy from strong, stable growth to negative GDP.",
      "publishedAt": "2025-04-30T15:53:30Z",
      "title": "Trump tries blaming Biden on the economy after weak GDP report",
      "url": "https://apnews.com/article/trump-economy-tariffs-gdp-7494825851dcef94ec81475124f9326f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fbdee6/2147483647/strip/true/crop/5068x2851+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F86%2Fd2acfbada58dfbc75615a58b96e6%2F7ca9eb7f8c7043c7ace099d71d47d142"
    },
    {
      "author": "Mary Clare Jalonick",
      "description": "Senate Republicans have narrowly voted down a Democratic resolution that would have blocked global tariffs announced by Donald Trump earlier this month, giving the president a modest win Wednesday as lawmakers in both parties have remained skeptical of his trade agenda. Trump announced the far-reaching tariffs on nearly all U.S. trading partners April 2 and then reversed himself a few days later after a market meltdown, suspending the import taxes for 90 days. Amid the uncertainty for both U.S. consumers and businesses, the Commerce Department said Wednesday that the U.S. economy shrank 0.3% from January through March.",
      "publishedAt": "2025-04-30T21:28:34Z",
      "title": "Senate votes down resolution that would block Trump's global tariffs",
      "url": "https://apnews.com/article/trump-tariffs-economy-7f81370d120d9529a354d2a4db32a7e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/dad1a78/2147483647/strip/true/crop/3658x2058+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F43%2F5b2cb3f0b453b034af1c9af3157e%2F8341429fd05c483c8d702ce2ed94f8a0"
    },
    {
      "author": null,
      "description": "A judge has ordered the release of a Palestinian man who led protests against the war in Gaza as a student at Columbia University and was arrested by immigration officials during an interview about finalizing his U.S. citizenship. U.S. District Judge Geoffrey Crawford in Burlington, Vermont, issued his ruling Wednesday following a hearing on Mohsen Mahdawi. Mahdawi, a legal permanent resident for 10 years, was arrested by Immigration and Customs Enforcement agents on April 14. Mahdawi’s lawyers say he was detained in retaliation for his speech advocating for Palestinian human rights.",
      "publishedAt": "2025-04-30T14:38:13Z",
      "title": "Vermont judge orders release of a Palestinian man arrested at his US citizenship interview",
      "url": "https://apnews.com/article/mohsen-mahdawi-columbia-student-palestinian-release-dd95ffff78464df1b485d5912f1b3fcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/052570b/2147483647/strip/true/crop/4674x2629+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F5b%2Fea88521274d6626d197409c5c534%2Ffaa986172b064cfc8c9d5c7ade9a82c2"
    },
    {
      "author": "Sean Murphy, Marc Levy",
      "description": "At least two people have died as slow-moving thunderstorms flooded roads across parts of Oklahoma and Texas. Authorities in Oklahoma say the two people died after their vehicles were caught in floodwaters. The National Weather Service says heavy rains and severe thunderstorms mean a heightened risk of flash flooding across the south-central U.S. through early Thursday. Residents in Pennsylvania and Ohio were picking up from another powerful storm that at its worst left more than half a million customers without power. Officials reported at least three deaths from Tuesday night’s storm in Pennsylvania.",
      "publishedAt": "2025-04-30T13:40:35Z",
      "title": "2 dead as slow-moving storms flood roads across Oklahoma and Texas",
      "url": "https://apnews.com/article/severe-weather-pennsylvania-electrocuted-a92cf8d973f8992b6672b1fed75424d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/010bb8d/2147483647/strip/true/crop/2048x1152+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F41%2F73e9e939066e24961706e2423116%2F70f6d0bdd4d74346a6c6dd1660dc22de"
    },
    {
      "author": "Michael R. Blood",
      "description": "Former Vice President Kamala Harris is heading to San Francisco, where she's expected to use a high-profile speech to deliver a sharp-edged critique of President Donald Trump's administration. Wednesday night's speech is being billed as Harris' most extensive public remarks since leaving office in January, after her defeat in the presidential election. Harris is expected to criticize the Republican president's economic policies and discuss America's place in global leadership. The speech comes when Harris has not ruled out a run for California governor or another try at the White House. Harris will be speaking to Emerge America, which recruits Democratic women to run for office.",
      "publishedAt": "2025-04-30T11:17:45Z",
      "title": "Harris speech about Trump: How to watch and what to expect",
      "url": "https://apnews.com/article/kamala-harris-speech-california-trump-democrats-governor-7f3fe64bfb93fcd39a5d06c39b2935f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f223253/2147483647/strip/true/crop/7530x4236+0+393/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F09%2Fa8c6db0e054cb3b672431ff91fbd%2Fba99a441501247b487e4a839a4243f54"
    },
    {
      "author": "Eric Tucker",
      "description": "U.S. officials say Kuwait has released 10 more American detainees in an apparent goodwill gesture. It brings to nearly two dozen the total number freed from Kuwait in the past two months. Taken together, the pardons of 23 Americans since March — done as a goodwill gesture by a U.S. ally — amounted to the largest release of U.S. citizens by a single foreign country in years. Ten others were released on March 12, weeks after a visit to Kuwait by Adam Boehler, who is serving as the Trump administration’s envoy for hostage affairs. The releases weren't done as part of a swap and the U.S. wasn't asked to give up anything in return.",
      "publishedAt": "2025-04-30T19:00:11Z",
      "title": "Kuwait frees 10 more Americans in second release in as many months",
      "url": "https://apnews.com/article/kuwait-detainees-released-us-state-department-fc35eb4fb08f8e18e0d7b0c5991cd191",
      "urlToImage": "https://dims.apnews.com/dims4/default/b21d11f/2147483647/strip/true/crop/4452x2504+0+114/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F42%2F4dc8f43204b42c2d1aa624f6c9b6%2F0219b454beba4b71937467a2c87093cc"
    },
    {
      "author": "Jennifer Peltz",
      "description": "A former TV production assistant is back on the witness stand at Harvey Weinstein’s retrial. Miriam Haley resumed testifying Wednesday about the weeks leading up to the July 2006 date when he's accused of forcing oral sex on her. Haley is the first of the ex-Hollywood honcho’s accusers to testify at the retrial. It's happening because New York’s highest court overturned Weinstein’s 2020 conviction. Weinstein’s retrial includes charges based on allegations from Haley and another accuser from the original trial, and a new charge based on an allegation from a former model. The 73-year-old former studio boss has pleaded not guilty and denies sexually assaulting anyone.",
      "publishedAt": "2025-04-30T15:02:30Z",
      "title": "First accuser resumes testimony at Harvey Weinstein's #MeToo retrial",
      "url": "https://apnews.com/article/harvey-weinstein-retrial-miriam-haley-metoo-a4df6e32641aaa20ccabf730d77c81b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0d53bc/2147483647/strip/true/crop/4297x2417+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fd2%2F5758e39d13870e575d3a91ec3df7%2F03d2f0fdc4bc4e66a3a5263241c90dc0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}