{
  "articles": [
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House voted Wednesday to hold Attorney General Merrick Garland in contempt of Congress for refusing to turn over audio of President Joe Biden’s interview in his classified documents case, Republicans' latest and strongest rebuke of the Justice Department as partisan conflict over the rule of law animates the 2024 presidential campaign.",
      "publishedAt": "2024-06-12T13:09:33Z",
      "title": "House votes to hold Attorney General Merrick Garland in contempt for withholding Biden audio",
      "url": "https://apnews.com/20f5e8f48cfd8390eb695d13079ca306",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85cf31df29544c95b0f10e50bb4f01d9/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, COLLEEN LONG, ZEKE MILLER and AAMER MADHANI",
      "description": "BRINDISI, Italy (AP) — President Joe Biden and President Volodymyr Zelenskyy will sign a bilateral security agreement between the U.S. and Ukraine on Thursday when they meet on the sidelines of the Group of Seven summit in Italy.",
      "publishedAt": "2024-06-12T13:09:35Z",
      "title": "Biden and Zelenskyy will sign a security deal, as G7 leaders agree to use Russian cash to help Kyiv",
      "url": "https://apnews.com/a43439b8386a20d1af9faec19f94bf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2345fca5f60e444f9fbee4ef64c71318/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ERIC TUCKER",
      "description": "PHOENIX (AP) — Republicans are responding to Hunter Biden's conviction on federal gun charges with some version of, “That’s it?”",
      "publishedAt": "2024-06-12T13:16:00Z",
      "title": "Republicans stick to attacking criminal justice system, echoing Trump, after Hunter Biden conviction",
      "url": "https://apnews.com/eb7fe08832905f14dd8c5bd48ef9c716",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f27c4e09a944b04be91f5088d22606f/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials said Wednesday that inflation has fallen further toward their target level in recent months but signaled that they expect to cut their benchmark interest rate just once this year.",
      "publishedAt": "2024-06-12T07:00:22Z",
      "title": "Federal Reserve sees some progress on inflation but envisions just one rate cut this year",
      "url": "https://apnews.com/4384e6b128915458aba2d178bf31ee1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57337cf365a94ce4a7e6ce52fd3c0bd4/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and JACK JEFFERY",
      "description": "BEIRUT (AP) — U.S. Secretary of State Antony Blinken said Wednesday that mediators would keep trying to close an elusive cease-fire deal for Gaza after Hamas proposed changes to a U.S.-backed plan, some of which he said were “workable” and some not.",
      "publishedAt": "2024-06-12T08:41:07Z",
      "title": "Blinken says some of Hamas' proposed changes to a cease-fire plan in Gaza are workable and some not",
      "url": "https://apnews.com/5cf89b426dc799e27f4ca166ea539cd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9280d0d85a244fec9be1a65059b0545b/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — A coalition of immigrant advocacy groups sued the Biden administration on Wednesday over President Joe Biden’s recent directive that effectively halts asylum claims at the southern border, saying it differs little from a similar move by the Trump administration that was blocked by the courts.",
      "publishedAt": "2024-06-12T21:08:10Z",
      "title": "President Joe Biden faces first lawsuit over new asylum crackdown at the border",
      "url": "https://apnews.com/50d007832d87078bf74971aefe7d4e14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a92ecefe41ab481a9d64f082264700ef/3000.jpeg"
    },
    {
      "author": "PETER SMITH and HOLLY MEYER",
      "description": "INDIANAPOLIS (AP) — Southern Baptists narrowly rejected a proposal Wednesday to enshrine a ban on churches with women pastors in their constitution after opponents argued it was unnecessary because the denomination already has a way of ousting such churches.",
      "publishedAt": "2024-06-12T11:50:07Z",
      "title": "Southern Baptists narrowly reject formal ban on churches with any women pastors",
      "url": "https://apnews.com/34edfd1578e609c3acb187ab90f0255e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6603a6ce567743ab9aff352811f40fb0/3000.jpeg"
    },
    {
      "author": "JEFF AMY and KATE BRUMBACK",
      "description": "ATLANTA (AP) — As police responded to reports of multiple people shot at a downtown Atlanta food court, Joseph Grier was on the sidewalk outside, rambling to reporters about his mental health, criminal record and banking history.",
      "publishedAt": "2024-06-12T15:25:05Z",
      "title": "He rambled to reporters after a downtown Atlanta shooting. Then, police say, he hijacked a bus",
      "url": "https://apnews.com/1ad742892bdd7936bb4ea9bc7d360760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a590988c14470b9c06420eff710e3a/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — The Oklahoma Supreme Court on Wednesday dismissed a lawsuit by survivors of the 1921 Tulsa Race Massacre, dampening the hope of advocates for racial justice that the city would make financial amends for one of the worst single acts of violence against Black people in U.S.",
      "publishedAt": "2024-06-12T17:48:45Z",
      "title": "Oklahoma Supreme Court dismisses lawsuit of last Tulsa Race Massacre survivors seeking reparations",
      "url": "https://apnews.com/b7a4c83514ce79640a8490d49efb9006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca6fd8da3e454dd9a3593a86bab5fde4/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "The NBA has never confirmed the worst-kept secret in basketball, that Jerry West is the player whose silhouette is depicted in the league’s logo.There’s probably a reason for that: West never wanted to be the logo.",
      "publishedAt": "2024-06-12T13:57:50Z",
      "title": "Jerry West, a 3-time Hall of Fame selection and the inspiration for the NBA logo, dies at 86",
      "url": "https://apnews.com/033c08e78eb9749f4cc275c54ff31d97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93f446b0e7c24ec6b270aec2b1ee56f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}