{
  "articles": [
    {
      "author": "ERIC TUCKER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — A U.N. court's order that Israel halt its offensive in the southern Gaza city of Rafah has deepened a disconnect with the United States over a military operation that faces mounting international condemnation but that American officials describe, at least for now, as limited and targeted.",
      "publishedAt": "2024-05-25T04:04:21Z",
      "title": "UN court order demanding that Israel halt its Gaza offensive further isolates the US position",
      "url": "https://apnews.com/403a7c44b248b828559253206140eae5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d637017d6a341a7923e10980868f936/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, LEE KEATH and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Egypt said Friday it has agreed to send United Nations humanitarian aid trucks through Israel’s main crossing into Gaza, but it was unclear if they will be able to enter the territory as fighting raged in the southern city of Rafah amid Israel’s escalating offensive there.",
      "publishedAt": "2024-05-24T07:58:40Z",
      "title": "Egypt agrees to send aid trucks through Israeli crossing to Gaza but impact is unclear",
      "url": "https://apnews.com/16eb31044551df186a934dc66e3948aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02c397279f8d4e3fbcec4661687f3054/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO and JIM SALTER",
      "description": "The local director of a mission group in Haiti and a missionary couple from the U.S. were attacked and fatally shot by gang members after leaving a youth group activity at a church, a family member told The Associated Press.",
      "publishedAt": "2024-05-25T04:08:45Z",
      "title": "What we know about the young missionaries and religious leader killed in Haiti",
      "url": "https://apnews.com/d3e5e74d47d7b85453b432277abcbe21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86231329c90d4e94975d5020a917164f/2000.jpeg"
    },
    {
      "author": "RICHARD LARDNER and BILL BARROW",
      "description": "OPELIKA, Ala. (AP) — On the second floor of a single-family home in a sprawling suburban development, a three-member production crew sat behind banks of computer monitors and guided the conservative Right Side Broadcasting Network’s coverage of a recent Donald Trump rally.",
      "publishedAt": "2024-05-25T04:03:13Z",
      "title": "Trump TV: Internet broadcaster beams the ex-president's message directly to his MAGA faithful",
      "url": "https://apnews.com/b8aedd9c94d5a0615edc5faa197674be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caad387b76a64ce999a45d553bb76e30/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — Families in Uvalde took more legal action Friday on the second anniversary of the Robb Elementary School attack, suing Meta Platforms, which owns Instagram, and the maker of the video game Call of Duty over claims the companies bear responsibility for products used by the teenage gunman.",
      "publishedAt": "2024-05-24T17:08:53Z",
      "title": "Uvalde families sue Meta and Call of Duty maker on second anniversary of school attack",
      "url": "https://apnews.com/a20e7fefa9d66058a8ff6611fa808df8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e54aebe0e7e4463a8af82cadc78bfdb/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — Forecasters are warning of another day of heightened risk of dangerous tornadoes in the Midwest on Saturday and telling people in south Texas they may experience triple-digit temperatures — and that's with four weeks to go before summer starts.",
      "publishedAt": "2024-05-25T14:10:16Z",
      "title": "Forecasters warn Oklahoma may see tornadoes; Texas could bake in triple-digit temperatures",
      "url": "https://apnews.com/9918414160c0e892ce468b598e33b922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4e9b25f4818448e909bbf2ffbdb9f11/1920.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "The 77th Cannes Film Festival is drawing to a close Saturday with the presentation of its top award, the Palme d'Or, along with an honorary tribute for George Lucas.",
      "publishedAt": "2024-05-25T05:16:18Z",
      "title": "'The Substance,' 'Emilia Perez' win early in Cannes awards",
      "url": "https://apnews.com/53443a0e2526459b933f589ed0f498b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b9dbaa3148e4d0e9f2c2907879be1df/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Millions of Indians voted Saturday in the next-to-last round of a grueling national election with a combined opposition trying to rattle Prime Minister Narendra Modi’s campaign for a third-consecutive term for himself and his Hindu nationalist party.",
      "publishedAt": "2024-05-25T03:28:40Z",
      "title": "Millions vote in India's grueling election with Prime Minister Modi's party likely to win third term",
      "url": "https://apnews.com/540927f81662ec429a3957235a5635cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/810ce2f1644843ee8673f90ceda12d22/1920.jpeg"
    },
    {
      "author": "ADRIAN SAINZ and JONATHAN MATTISE",
      "description": "MEMPHIS, Tenn. (AP) — The catalyst behind the failed gambit to sell off the iconic Graceland property in Memphis is a mystery.The self-styled investment company also is under fire from a lawsuit alleging fraud, an aggressive attorney general and a community of Elvis Presley loyalists who consider the home-turned-museum of the the king of rock n’ roll to be sacred ground.",
      "publishedAt": "2024-05-25T04:01:29Z",
      "title": "Failed Graceland sale by a mystery entity highlights attempts to take assets of older or dead people",
      "url": "https://apnews.com/4c5d2dda1c189997319d331794e8f8d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65850baa36714ddd96abdd84576bf15c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Federal prosecutors on Friday asked the judge overseeing the classified documents case against Donald Trump to bar the former president from public statements that “pose a significant, imminent, and foreseeable danger to law enforcement agents” participating in the prosecution.",
      "publishedAt": "2024-05-25T00:41:20Z",
      "title": "Prosecutors seek to bar Trump from statements endangering law enforcement in classified records case",
      "url": "https://apnews.com/d52b7468d93712dd86cbb8fe304d4b64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adfc78b82b274c65bf25959e63293b67/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}