{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Palestinians in besieged Gaza crowded into hospitals and schools on Monday, seeking shelter and running low on food and water. More than a million people have fled their homes ahead of an expected Israeli ground invasion aimed at destroying Hamas after its fighters rampaged through southern Israel.",
      "publishedAt": "2023-10-16T03:24:13Z",
      "title": "Gaza's crowded hospitals near breaking point as Israeli ground invasion looms",
      "url": "https://apnews.com/781b3c63af4ae6e51c313a68f314e66d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a69ef17b15ea49c790f39eab5c5241ec/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — A 71-year-old Illinois man accused of fatally stabbing a 6-year-old boy and seriously wounding a 32-year-old woman was charged with a hate crime Sunday. Police allege he singled out the victims because of their Islamic faith and as a response to the war between Israel and Hamas.",
      "publishedAt": "2023-10-15T20:33:01Z",
      "title": "Muslim boy killed and woman wounded in Illinois hate crime motivated by Israeli-Hamas war",
      "url": "https://apnews.com/5135dea218326d6e639a996564d9369e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b191c991d5ac4566bf4e3d0fb3fc78f7/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Federal prosecutors and lawyers for Donald Trump will argue in court Monday over a proposed gag order aimed at reining in the former president's diatribes against likely witnesses and others in his 2020 election interference case in Washington.",
      "publishedAt": "2023-10-16T04:26:49Z",
      "title": "Judge Chutkan will hear arguments over a proposed gag order in Trump's US election interference case",
      "url": "https://apnews.com/b5f59c6688504c952df5f70029228f9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1083ea7bbdb94003b7c90ab1abe165a5/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, FARNOUSH AMIRI and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Rep. Jim Jordan has such a reputation as a political brawler that former House Speaker John Boehner once said he'd never met someone \"who spent more time tearing things apart.”",
      "publishedAt": "2023-10-16T04:07:03Z",
      "title": "Jim Jordan's rapid rise has been cheered by Trump and the far right. Could it soon make him speaker?",
      "url": "https://apnews.com/0f759a46f63aa9daf9e6939e45799329",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ede1e8ca750454b821d3d5c1c78d544/1920.jpeg"
    },
    {
      "author": "VANESSA GERA and MONIKA SCISLOWSKA",
      "description": "WARSAW, Poland (AP) — The majority of voters in Poland's general election supported opposition parties that promised to repair the nation's constitutional order and its relationship with allies, including the European Union and Ukraine, according to projections Monday.",
      "publishedAt": "2023-10-16T06:52:11Z",
      "title": "Poles vote in huge numbers for centrist opposition after 8 years of nationalist rule",
      "url": "https://apnews.com/29eb9108f6e9c242e9bb3a2f803b5a63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6da9e2653ad8450eaab7e78f10c8c095/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GONZALO SOLANO",
      "description": "QUITO, Ecuador (AP) — Daniel Noboa has managed to do what his father failed at five times: Getting elected as Ecuador’s president.And he did it Sunday on his first attempt, winning a runoff election against a leftist lawyer on the resume of a 35-year-old who belongs to the South American country’s elite, which means some schooling in the U.S., some entrepreneurial work, some dabbling in politics.",
      "publishedAt": "2023-10-16T05:00:39Z",
      "title": "Daniel Noboa, political neophyte and heir to fortune, wins presidency in violence-wracked Ecuador",
      "url": "https://apnews.com/549b7ca192e4e995cdfab96a39939381",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95b3c9d2fb0e47ac95938216e2d1ec40/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "SUAMICO, Wis. (AP) — Kim Pytleski could barely sleep the night before. She replayed the PowerPoint slides in her head, packed her notebook and took a deep breath.The clerk from a rural Wisconsin county north of Green Bay was preparing for a public meeting to explain the election process to residents.",
      "publishedAt": "2023-10-16T04:13:43Z",
      "title": "Few Republicans have confidence in elections. It's a long road for one group trying to change that",
      "url": "https://apnews.com/ab1809a325b22e86437722dc6d7e607f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a436946290f4ebf99505cc1bdc2d698/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "PHILADELPHIA (AP) — Major U.S. pharmacy chain Rite Aid said Sunday that it has filed for bankruptcy and obtained $3.45 billion in fresh financing as it carries out a restructuring plan while coping with falling sales and opioid-related lawsuits.",
      "publishedAt": "2023-10-16T04:58:50Z",
      "title": "Major US pharmacy chain Rite Aid files for bankruptcy",
      "url": "https://apnews.com/f80c3d231946d675b03e4e797f627fa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0bce0f27e3d48cdb9dcada16ac05b3a/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Russian President Vladimir Putin is expected to meet this week with Chinese leaders in Beijing on a visit that underscores China’s support for Moscow during its war in Ukraine.",
      "publishedAt": "2023-10-16T01:56:43Z",
      "title": "Putin's visit to Beijing underscores China’s economic and diplomatic support for Russia",
      "url": "https://apnews.com/139930a92289b7d34ce840bdfe531259",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f31beb1759504bf8a2824df0dc561464/3000.jpeg"
    },
    {
      "author": "JARI TANNER",
      "description": "HELSINKI (AP) — Martti Ahtisaari, the former president of Finland and global peace broker who was awarded the Nobel Peace Prize in 2008 for his work to resolve international conflicts, died Monday. He was 86.",
      "publishedAt": "2023-10-16T07:38:53Z",
      "title": "Martti Ahtisaari, former Finnish president and Nobel Peace Prize winner, dies at 86",
      "url": "https://apnews.com/1404e4d2cc0a42fb919b75999c257861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db5cf65fd6284a508d52b5fa392cbf74/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}