{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military withdrew from Gaza’s largest hospital early Monday after a two-week raid that engulfed the facility and surrounding districts in fighting.",
      "publishedAt": "2024-04-01T05:55:21Z",
      "title": "Israeli troops withdraw from Shifa Hospital, Gaza's largest, after 2-week raid",
      "url": "https://apnews.com/e75cf75aa88a9133774a883d987115c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7014449d9984edeb168b248b1e0d4eb/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ALBERT AJI",
      "description": "DAMASCUS, Syria (AP) — An Israeli airstrike has destroyed the consular section of Iran's embassy in Damascus, killing or wounding everyone inside, Syrian state media said Monday.The Iranian Arabic-language state television Al-Alam and pan-Arab television station Al-Mayadeen, which has reporters in Syria, said the strike killed Iranian military adviser Gen.",
      "publishedAt": "2024-04-01T16:14:18Z",
      "title": "Syria says an Israeli airstrike has destroyed Iran's consulate building in Damascus, with deaths",
      "url": "https://apnews.com/edca34c52d38c8bc57281e4ebf33b240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a177dbf6eb74701b25bf9cc68269bc8/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and JILL COLVIN",
      "description": "WASHINGTON (AP) — The video shared by former President Donald Trump features horror movie music and footage of migrants purportedly entering the U.S.",
      "publishedAt": "2024-04-01T04:04:30Z",
      "title": "Why Trump's alarmist message on immigration may be resonating beyond his base",
      "url": "https://apnews.com/327c08045edcc200f850d893de6a79d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa48b52b5d93495db28859fed3e86f27/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "PHILADELPHIA (AP) — Jazmin Evans had been waiting for a new kidney for four years when her hospital revealed shocking news: She should have been put on the transplant list in 2015 instead of 2019 — and a racially biased organ test was to blame.",
      "publishedAt": "2024-04-01T06:00:18Z",
      "title": "A biased test kept thousands of Black people from getting a kidney transplant. It's finally changing",
      "url": "https://apnews.com/d4fabf2f3a47aab2fe8e18b2a5432135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2c68ddcc058451786d42b9044abeab0/1619.jpeg"
    },
    {
      "author": "LEA SKENE and TASSANEE VEJPONGSA",
      "description": "BALTIMORE (AP) — The U.S. Coast Guard has opened a temporary, alternate channel for vessels involved in the clearing of debris at the site of the collapsed Francis Scott Key Bridge in Baltimore, part of a phased approach to opening the main channel leading to the vital port, officials said.",
      "publishedAt": "2024-04-01T12:47:13Z",
      "title": "A channel has opened for vessels clearing wreckage at the Baltimore bridge collapse site",
      "url": "https://apnews.com/74e78dc0fbc42ae2780c58719d024952",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69677de0298041dba5d99b0044de9347/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Trillions of evolution’s bizarro wonders, red-eyed periodical cicadas that have pumps in their heads and jet-like muscles in their rears, are about to emerge in numbers not seen in decades and possibly centuries.",
      "publishedAt": "2024-04-01T13:52:34Z",
      "title": "Invaders from underground are coming in cicada-geddon. It's the biggest bug emergence in centuries",
      "url": "https://apnews.com/e57f708cdcf144a20fe8f694e95b5d44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e20a9c7d7ba47e2b0b59055bedf9832/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "CHARLESTON, S.C. (AP) — For maybe the last time, Alex Murdaugh, in a prison jumpsuit instead of the suit he used to wear, shuffled into a courtroom Monday in South Carolina and was sentenced to 40 years in federal prison.",
      "publishedAt": "2024-04-01T04:08:38Z",
      "title": "Alex Murdaugh gets 40 years in federal prison for stealing from clients and his law firm",
      "url": "https://apnews.com/9e7ea455e0400bab01074adf0a949fd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ea3c06237a342248a9c180223094235/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Gunmen attacked a group of people in Ecuador ’s coastal city of Guayaquil killing nine and injuring 10 others, police said Sunday, the latest in a string of violent incidents in the South American country.",
      "publishedAt": "2024-03-31T17:42:15Z",
      "title": "Gunmen in Ecuador kill 9, injure 10 others in attack in coastal city of Guayaquil as violence surges",
      "url": "https://apnews.com/82895468cbeafd6246a59840a35741cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/959dadd55e154201b1f4c7ced91749b5/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — In September, Hyundai and Kia issued a recall of 3.4 million of its vehicles in the United States with an ominous warning: The vehicles should be parked outdoors and away from buildings because they risked catching fire, whether the engines were on or off.",
      "publishedAt": "2024-04-01T10:01:18Z",
      "title": "Millions of recalled Hyundai and Kia vehicles with a dangerous defect remain on the road",
      "url": "https://apnews.com/ae2e71914fc229d70a4cceb089e465ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc03e34e606b44b2a07185d4a995facb/3000.jpeg"
    },
    {
      "author": "JOHN MARSHALL",
      "description": "The 2024 version of March Madness has apexed with a trio of streak busters in the desert.N.C.",
      "publishedAt": "2024-04-01T10:01:16Z",
      "title": "Tall Final Four task: Beating reigning champion UConn will not be an easy task in the desert",
      "url": "https://apnews.com/910f19b92d7545b2800ee8cc4950ad1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2293c66727e246be903b24217de120d9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}