{
  "articles": [
    {
      "author": "JACK JEFFERY",
      "description": "DUMA, West Bank (AP) — Charred homes and cars dotting this hilltop village surrounded by olive groves are a searing reminder of Palestinians' vulnerability to rising violence from Israeli settlers.",
      "publishedAt": "2024-05-10T04:21:48Z",
      "title": "A West Bank village feels helpless after Israeli settlers attack with fire and bullets",
      "url": "https://apnews.com/71180e5579e4dde464672568e9669fe2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1518054c8fe478d8c42cd40776efa42/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER and JULIA FRANKEL",
      "description": "WASHINGTON (AP) — President Joe Biden and Israeli Prime Minister Benjamin Netanyahu have long managed a complicated relationship, but they're running out of space to maneuver as their views on the Gaza war diverge and their political futures hang in the balance.",
      "publishedAt": "2024-05-09T22:13:06Z",
      "title": "The Biden-Netanyahu relationship is strained like never before. Can the two leaders move forward?",
      "url": "https://apnews.com/67020b529db3dfe960654545766f52c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e21d61531f8a4566a9ad4c8f91877be8/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, JENNIFER PELTZ, MICHAEL R. SISAK and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The third week of testimony in Donald Trump’s hush money trial draws to a close Friday after jurors heard the dramatic, if not downright seamy, account of porn actor Stormy Daniels, while prosecutors gear up for their most crucial witness: Michael Cohen, Trump's former attorney.",
      "publishedAt": "2024-05-10T04:09:22Z",
      "title": "Third week of testimony in Trump's hush money trial draws to a close, with Michael Cohen yet to come",
      "url": "https://apnews.com/ddef05884265e4d6217b55a89304b878",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b6ee762256644f49573e52afc8de6da/1920.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "CHARLESTON, W.Va. (AP) — For Derrick Evans, being part of the mob that stormed the U.S. Capitol wasn’t enough. The former West Virginia lawmaker wants to make his path to the halls of Congress permanent.",
      "publishedAt": "2024-05-10T04:15:11Z",
      "title": "One man was a Capitol Police officer. The other rioted on Jan. 6. They're both running for Congress",
      "url": "https://apnews.com/7659d9493956919c83adf474259ab303",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a446ae8783e440f081b2f4358388d5bc/3000.jpeg"
    },
    {
      "author": "STEPHEN SMITH and MIKE SCHNEIDER",
      "description": "FORT WALTON BEACH, Fla. (AP) — A Florida sheriff released body camera video Thursday showing a deputy outside an apartment door and firing immediately when it was opened by a Black man carrying a handgun pointed downward, a killing the family denounced as “unjustifiable.”",
      "publishedAt": "2024-05-09T12:38:11Z",
      "title": "Body camera video shows fatal shooting of Black airman by Florida deputy in apartment doorway",
      "url": "https://apnews.com/c747bffae2690dd8fa0908f4b95821b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc0e13f945534cb3b535c013fdb4251e/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN",
      "description": "SHREVEPORT, La. (AP) — Mona Hardin has been waiting five long years for any resolution to the federal investigation into her son’s deadly arrest by Louisiana State Police troopers, an anguish only compounded by the fact that nearly every other major civil rights case during that time has passed her by.",
      "publishedAt": "2024-05-10T05:05:52Z",
      "title": "'Where's Ronald Greene's justice?': 5 years on, feds still silent on Black motorist's deadly arrest",
      "url": "https://apnews.com/4446d9b069803545247c610882951763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8464d99301e04b6e9e98bdc5b2a123ff/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and TRISHA AHMED",
      "description": "MINNEAPOLIS (AP) — On college campuses across the country, a rallying cry of pro-Palestinian protesters has been “ Disclose, divest!",
      "publishedAt": "2024-05-10T04:07:40Z",
      "title": "Pro-Palestinian protesters demand endowment transparency. But its proving not to be simple",
      "url": "https://apnews.com/616b5d9d78e90bd478d6b5e2ee50164c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b921d4e14902465aaa0bde7249c3b5b0/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The Vodou faithful sing, their voices rising above the gunfire erupting miles away as frantic drumbeats drown out their troubles.They pause to swig rum out of small brown bottles, twirling in unison as they sing in Haitian Creole: “We don’t care if they hate us, because they can’t bury us.”",
      "publishedAt": "2024-05-10T04:11:03Z",
      "title": "Shunned for centuries, Vodou grows powerful as Haitians seek solace from unrelenting gang violence",
      "url": "https://apnews.com/2ddd4922f6fdd071525e92879ede2f33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6c72e1af7bb484ca7488128e85c38a7/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — A newly released ad promoting Apple's new iPad Pro has struck quite a nerve online.The ad, which was released by the tech giant Tuesday, shows a hydraulic press crushing just about every creative instrument artists and consumers have used over the years — from a piano and record player, to piles of paint, books, cameras and relics of arcade games.",
      "publishedAt": "2024-05-09T17:46:20Z",
      "title": "Technology crushing human creativity? Apple's new iPad ad has struck a nerve online",
      "url": "https://apnews.com/12e7fbd335feb4875d94c31b87379359",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dae61a77ffa42eabb36b850341d7bff/2432.jpeg"
    },
    {
      "author": "MICHAEL MAROT",
      "description": "INDIANAPOLIS (AP) — Caitlin Clark walked into her new home arena Thursday night with No. 22 shirts and jerseys peppered from floor to ceiling.She left as a first-time WNBA winner.A late-arriving but louder-than-usual crowd roared during her official introduction to Fever fans and again when Clark made her first basket, a layup with 7:00 left in the first quarter.",
      "publishedAt": "2024-05-09T10:00:24Z",
      "title": "Raucous crowd roars its approval for Caitlin Clark in her home debut with Fever, an 83-80 win",
      "url": "https://apnews.com/be9143942b47524a9a5fd6ca97d207b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/815d59426a814072a33fedbc962cdde8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}