{
  "articles": [
    {
      "author": "STEFANIE DAZIO, ETHAN SWOPE, JAKE OFFENHARTZ and JOSEPH B. FREDERICK",
      "description": "LOS ANGELES (AP) — Dueling groups of protesters clashed overnight at the University of California, Los Angeles, shoving, kicking and beating each other with sticks after pro-Israel demonstrators tried to pull down barricades surrounding a pro-Palestinian encampment.",
      "publishedAt": "2024-05-01T05:49:21Z",
      "title": "UCLA cancels classes after violence erupts on campus over the war in Gaza",
      "url": "https://apnews.com/c6e5549532c85f13493daa22d0d143ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e13885770c9a4138bcc3d0b3e18ed85b/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC and NICK PERRY",
      "description": "BOSTON (AP) — Boston College students held a protest rally against the Israel-Hamas war last week. Bullhorns were banned, lest the noise disturb studying for finals.",
      "publishedAt": "2024-05-01T15:22:08Z",
      "title": "Student protests take over some campuses. At others, attention is elsewhere",
      "url": "https://apnews.com/1290da721bdb26950ba857719b7441e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8907cd734a4248a08c7512f56aa4dfa7/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, SAMY MAGDY and SAM MEDNICK",
      "description": "JERUSALEM (AP) — U.S. Secretary of State Antony Blinken met with Israeli leaders Wednesday in his push for a cease-fire deal between Israel and Hamas, saying “the time is now” for an agreement that would free hostages and bring a pause in the nearly seven months of war in Gaza.",
      "publishedAt": "2024-05-01T07:17:43Z",
      "title": "Blinken urges Israel and Hamas to move ahead with a cease-fire deal and says 'the time is now'",
      "url": "https://apnews.com/7cbf7c696989cdc3a22383c823fb2e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d72f73f2e74acc932224a6ea256156/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, SCOTT BAUER and MICHELLE L. PRICE",
      "description": "WAUKESHA, Wis. (AP) — Donald Trump on Wednesday is using a one-day break from his hush money trial to rally voters in the battleground states of Wisconsin and Michigan, a day after he was held in contempt of court and threatened with jail time for violating a gag order.",
      "publishedAt": "2024-05-01T04:06:27Z",
      "title": "Trump returns to his campaign facing a warning of jail time if he violates a trial gag order",
      "url": "https://apnews.com/f3d448782edc81e10274cf99175f3844",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c3338903f2a4d9a81a23e877f5b4c2f/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republican Rep. Marjorie Taylor Greene said Wednesday she would call a vote next week on ousting House Speaker Mike Johnson, forcing her colleagues to choose sides in a difficult showdown after Democratic leaders announced they would provide the votes to save the Republican speaker's job.",
      "publishedAt": "2024-05-01T13:56:30Z",
      "title": "Rep. Marjorie Taylor Greene vows to force a vote next week on ousting House Speaker Mike Johnson",
      "url": "https://apnews.com/28861ef534f9f1ce950a2389af8a4ced",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09472cb9422846acbfcc7af44bbffd16/1920.jpeg"
    },
    {
      "author": "DAVID FISCHER and STEPHANY MATAT",
      "description": "BOCA RATON, Fla. (AP) — Florida's ban on most abortions after six weeks of pregnancy, before many women even know they are pregnant, went into effect Wednesday, and some doctors are concerned that women in the state will no longer have access to needed health care.",
      "publishedAt": "2024-05-01T04:21:29Z",
      "title": "Florida's 6-week abortion ban takes effect as doctors worry women will lose access to health care",
      "url": "https://apnews.com/9509a806453e1eab50d118aaecffa2f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/026d643f154f4f8390c1a117d6e6d9aa/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — United Methodist delegates repealed their church’s longstanding ban on LGBTQ clergy with no debate on Wednesday, removing a rule forbidding “self-avowed practicing homosexuals” from being ordained or appointed as ministers.",
      "publishedAt": "2024-05-01T14:01:30Z",
      "title": "United Methodists repeal longstanding ban on LGBTQ clergy",
      "url": "https://apnews.com/acabe18fe22b6838e3005ad8895534fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4570295c05d04bc292c1279860a96127/3000.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE",
      "description": "TBILISI, Georgia (AP) — Georgia's parliament on Wednesday moved a step closer to passing a law that critics fear will stifle media freedom and endanger the country's European Union membership bid, as tens of thousands of protesters thronged surrounding streets.",
      "publishedAt": "2024-05-01T08:48:14Z",
      "title": "Georgia moves closer to passing so-called 'Russian law' targeting media. Protesters gather again",
      "url": "https://apnews.com/0136e0b01eb73c44a43bd0fe6c4ef447",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdb669c21a76436093138ecf3a922eb2/1920.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — Utah public schools have been rushing to prepare students and teachers as the state starts cracking down Wednesday on any school found not enforcing new bathroom restrictions for transgender people.",
      "publishedAt": "2024-05-01T17:48:02Z",
      "title": "Rollout of transgender bathroom law sows confusion among Utah public school families",
      "url": "https://apnews.com/e6090bf29be27b8120dd8b8ebaebcb45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f2db38571c4cfd9bab481c2241cc53/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Even as many Americans say they learn about the 2024 election campaign from national news outlets, a disquieting poll reveals some serious trust issues.",
      "publishedAt": "2024-05-01T10:36:32Z",
      "title": "News organizations have trust issues as they gear up to cover another election, a poll finds",
      "url": "https://apnews.com/18235eaef4fdfbdc9c1f7e8693744b21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e67c22f2f2e4fb49e3726dbafdaf8e3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}