{
  "articles": [
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH",
      "description": "Israel says it has received three hostages freed by Hamas after they were handed over to the Red Cross in the Gaza Strip. The military said in a statement that the three were with its forces. They will be taken to Israel for medical treatment and to be reunited with relatives.",
      "publishedAt": "2025-02-15T04:47:59Z",
      "title": "Israel has received 3 hostages released by Hamas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-15-2025-22a2d731961eb766e6c7914cb84e3990",
      "urlToImage": "https://dims.apnews.com/dims4/default/704d037/2147483647/strip/true/crop/3573x2010+28+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2Fe8%2Fe6e6e325df655988b43ad84f1fd2%2Fff9d8183ed5c4d65b0997e7d78dd5cec"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "After nearly 500 days in captivity in Gaza, with little access to media, recently freed hostages have many questions. Now home in Israel, they are confronting a flood of information about loved ones and destroyed communities, and are still figuring out their place in a changed world. Their families are grappling with how to fill them in on what they missed without potentially deepening their trauma. One hostage forced to speak at a staged Hamas ceremony before his release told a crowd of masked militants and journalists that he was looking forward to seeing his wife and two teenage daughters. It wasn't until he arrived back in Israel that he learned the crushing reality: all three had been killed during the Oct. 7 attack.",
      "publishedAt": "2025-02-14T13:46:23Z",
      "title": "Hostages freed from Gaza discover personal lives shattered by Hamas",
      "url": "https://apnews.com/article/israel-hostages-gaza-hamas-ceasefire-af820b4bd1d62de94e2022b521db268c",
      "urlToImage": "https://dims.apnews.com/dims4/default/affd4e0/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F87%2F46fa691be794d9b03affc412dc37%2F5625e60bd3ab4d1eb63643ff2e8409a0"
    },
    {
      "author": "MELANIE LIDMAN, JULIA FRANKEL",
      "description": "Hamas-led militants have freed three more hostages from the Gaza Strip after more than 16 months in captivity. Those released are Sagui Dekel Chen, Iair Horn and Alexander (Sasha) Troufanov — all Israeli civilians with dual nationality taken from Kibbutz Nir Oz during Hamas’ deadly attack on Oct. 7, 2023. Their release Saturday came roughly four weeks into a ceasefire between Israel and Hamas. It is part of a long and uncertain process aimed at eventually ending the war. In the ceasefire’s first phase, 33 hostages in Gaza are supposed to be released in exchange for almost 2,000 Palestinian prisoners held by Israel.",
      "publishedAt": "2025-01-19T13:44:59Z",
      "title": "Israel-Hamas war: Who are the hostages released as part of the Gaza ceasefire?",
      "url": "https://apnews.com/article/israel-gaza-hamas-hostages-ceasefire-709efbcf93714a562640133d836bb31c",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a1b67e/2147483647/strip/true/crop/2000x1125+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Fea%2Ffc554793795c310a76f9b27b8a5a%2F6edb5430bac642b1aba75a74aa20c7aa"
    },
    {
      "author": "GISELA SALOMON",
      "description": "Since President Donald Trump took office, immigrants in the U.S. illegally have changed their travel patterns and try to stay home, out of fear they could be deported. That includes avoiding going to the homes of advocates who help them to prepare for the worst-case scenario in which they are separated from their children. Trump has terminated programs that had allowed immigrants a legal entrance to the U.S. and has said all immigrants without authorization should leave. A South Florida advocate says she has gone into at least 15 houses in the past few weeks to fill out paperwork to become a legal guardian of immigrant parents’ children.",
      "publishedAt": "2025-02-15T05:01:38Z",
      "title": "Florida immigrants fear they could be separated from their children",
      "url": "https://apnews.com/article/legal-guardians-immigration-trump-families-separation-fears-8b7a31b6084507c5c969235ce7577170",
      "urlToImage": "https://dims.apnews.com/dims4/default/3bec109/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2Fc0%2F739dae43334935f1aaf04f450d10%2F8121654bba4b4da6966039939bef217c"
    },
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE, MARK SCOLFORO",
      "description": "A traffic stop in Vermont has cracked open a cultlike group called Zizians linked to six deaths in three states. Officials have offered few details about their cross-country investigation, but police and court records, interviews and online postings point to a small group of young computer scientists portrayed as highly intelligent and increasingly violent. Their goals aren’t clear, but online writings span topics from radical veganism and gender identity to artificial intelligence. The dead include Border Patrol Agent David Maland, two members of the group, the parents of another member and a California landlord who tried to evict some of them.",
      "publishedAt": "2025-02-15T05:03:30Z",
      "title": "How a traffic stop in Vermont cracked open a cultlike group linked to deaths in multiple states",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-youngblut-lasota-zizians-6541ebcefc2806efd105d7db99a24aaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/edfd14f/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fc1%2Fa48e011416b25ac3d0b11cf97f5d%2F75895b07e3cd4b8cb837536b5c48a8ac"
    },
    {
      "author": null,
      "description": "Russian media say a U.S. citizen was detained after cannabis-laced marmalade was found in his luggage. The arrest comes days after a Moscow-Washington prisoner swap that the White House called a diplomatic thaw and a step toward ending the fighting in Ukraine. Russian police said the 28-year-old American had attempted to smuggle a “significant amount” of drugs into the country. The Interfax news agency said he was detained at Moscow’s Vnukovo airport after flying in from Istanbul last Friday. Mash, a Russian Telegram channel with links to the security services, said the U.S. citizen, identified only as K. Byers, faced up to seven years in prison if convicted. There was no immediate comment from the U.S. State Department.",
      "publishedAt": "2025-02-14T18:15:48Z",
      "title": "Russia detains another US citizen on drugs charges days after swap, reports say",
      "url": "https://apnews.com/article/russia-american-arrested-marijuana-prisoner-swap-488faacfe1e65adfcb732de569de04a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/201b115/2147483647/strip/true/crop/4421x2487+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fa5%2F1e25ad36a1a4e776016d7f14fff2%2F827101bf6e9648989553984b889c408e"
    },
    {
      "author": "PHILIPP JENNE",
      "description": "European leaders trying to make sense of a tough new line from Washington on issues including democracy and Ukraine’s future are set to express their reactions as the Munich Security Conference enters a second day. The Trump administration has upended trans-Atlantic conventions that emerged after World War II. German Chancellor Olaf Scholz and Ukrainian President Volodymyr Zelenskyy were to speak Saturday. On Friday, U.S. Vice President JD Vance all but scolded European allies over democracy and raised questions about the U.S. commitment to help Ukraine’s defense against Russian forces.",
      "publishedAt": "2025-02-15T08:06:51Z",
      "title": "Europeans to respond to US at security conference as Trump administration upends norms",
      "url": "https://apnews.com/article/germany-munich-vance-election-zelenskyy-scholz-ukraine-4e48e115b504f9e3609b3457b48f9db0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7eba67/2147483647/strip/true/crop/5500x3094+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F34%2F953e5e26bcc7c372d1405ef98bf1%2Fbcf2858e8a3a44edb32ff782fafc4568"
    },
    {
      "author": "JILL COLVIN, BRIAN WITTE, MIKE HOUSEHOLDER, MICHELLE L. PRICE",
      "description": "Federal workers were responding with anger and confusion Friday as they grappled with the Trump administration’s latest effort to shrink the size of the federal workforce by ordering agencies to lay off probationary employees who have yet to qualify for civil service protections. Many of those workers say they had already accepted the administration’s deferred resignation offer, under which they were supposed to be paid until Sept. 30 if they agreed to quit, raising questions about how many others who signed will nonetheless be fired.",
      "publishedAt": "2025-02-14T22:34:14Z",
      "title": "Trump's job cuts: Anger, chaos and confusion take hold as federal workers face mass layoffs",
      "url": "https://apnews.com/article/trump-firing-probation-workforce-buyouts-layoffs-doge-159a6de411622c2eb651016b1e99da37",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03d34b/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fef%2Fb447c386aed921b95de41bf9d695%2Fcbf9c83827c049c99de488ebc7fc15ad"
    },
    {
      "author": "DAVID BAUDER",
      "description": "The Trump administration blocked The Associated Press from traveling with President Trump on Air Force One and also from covering an Oval Office event. It's part of an ongoing terminology dispute over the Gulf of Mexico. The administration criticized AP's “commitment to misinformation” in not adopting Trump's name change to “Gulf of America” in all of its copy. AP says the administration is flouting the First Amendment in punishing the news outlet for not saying what it wants. AP has advised the thousands of news outlets that use its service that it would continue to use Gulf of Mexico as its style but would note Trump's change of name as well.",
      "publishedAt": "2025-02-14T23:44:36Z",
      "title": "AP journalists barred from Air Force One over style dispute",
      "url": "https://apnews.com/article/trump-ap-news-ban-air-force-one-b90b8b842d63aef9960ccffb4a657dc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e5d9d7/2147483647/strip/true/crop/6499x3656+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fb9%2F430ce8a2675d51f92a8cd5077c33%2F1ee1a620aacd4c739d350dc94b0374f0"
    },
    {
      "author": "GARY FIELDS, TIM SULLIVAN, JOSH FUNK",
      "description": "Investigators say the crew of the Army helicopter that collided in midair with an American Airlines jet near Washington, D.C.’s Ronald Reagan National Airport may have had inaccurate altitude readings in the moments before the crash, and also may not have heard key instructions from air traffic controllers to move behind the plane.National Transportation Safety Board Chairwoman Jennifer Homendy says the recording from the Black Hawk helicopter cockpit suggests the crew may have missed the key instruction just before the Jan. 29 collision, in which all 67 aboard the two aircraft were killed.",
      "publishedAt": "2025-02-14T19:46:27Z",
      "title": "Helicopter crew in collision with plane may not have heard key instruction from tower, NTSB says",
      "url": "https://apnews.com/article/washington-national-airport-aircraft-crash-ntsb-3dec2686beb43ada10ce392c857751cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/a45afbf/2147483647/strip/true/crop/8259x4646+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F75%2Fe97a984f17a3f32cec60725f1003%2Fe27b6fd2417b4b1a8d11a21dd3822bdc"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}