{
  "articles": [
    {
      "author": "LAURIE KELLMAN",
      "description": "The Jordan River is a winding, 200-plus-mile run on the eastern flank of Israel and the occupied West Bank. The sea is the glittering Mediterranean to its west.But a phrase about the space in between, “from the river to the sea,” has become a battle cry with new power to roil Jews and pro-Palestinian activists in the aftermath of Hamas' deadly rampage across southern Israel Oct.",
      "publishedAt": "2023-11-10T15:31:55Z",
      "title": "'From the river to the sea': Why these 6 words spark fury and passion over the Israel-Hamas war",
      "url": "https://apnews.com/d7abbd756f481fe50b6fa5c0b907cd49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fa032c36e7447d59abd0df2f6f5c4f8/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, ALAN SUDERMAN and CHRIS MEGERIAN",
      "description": "ELLWOOD CITY, Pa. (AP) — When a healthcare startup dreamed of building a network of rural hospitals several years ago, it turned to Jim Biden.",
      "publishedAt": "2023-11-11T05:16:26Z",
      "title": "Jim Biden's last name has helped open doors. It’s also made him a Republican target",
      "url": "https://apnews.com/7a64c5e577787308090f9503ec80adb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76a5f342c7094ffba90d035c301142c8/1560.jpeg"
    },
    {
      "author": "BY BILL BARROW",
      "description": "ATLANTA (AP) — A political novice and one of the world’s wealthiest millennials, Vivek Ramaswamy has waged a whirlwind presidential campaign mirroring his meteoric rise as a biotech entrepreneur. On everything from deporting people born in the United States to ending aid to Israel and Ukraine, he consistently displays the bravado of a populist, self-declared outsider.",
      "publishedAt": "2023-11-11T05:20:30Z",
      "title": "Vivek Ramaswamy's approach in business and politics is the same: Confidence, no matter the scenario",
      "url": "https://apnews.com/7425976d01a02019092e3577fdf0be98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfe8de1bd750456383b8a4e1ba154569/3000.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "MOULAY BRAHIM, Morocco (AP) — When a historic earthquake struck Morocco in September, Ahmed Aazab tightly hugged his wife and four children as their home’s brick walls tumbled around them.",
      "publishedAt": "2023-11-11T06:00:34Z",
      "title": "Morocco debates how to rebuild from September quake that killed thousands",
      "url": "https://apnews.com/d1ae25b7448cf4fa6a2ef0a60a7ce9b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dc73b41dc66465f926c395205fb9402/3000.jpeg"
    },
    {
      "author": "R.J. RICO",
      "description": "ATLANTA (AP) — Along a busy Atlanta residential road, a 68-year-old Vietnam War-era Army veteran has found what he calls a \"match made in heaven.” Harold Tilson Jr. found himself homeless earlier this year but for the past few months has been living in transitional housing run by the nonprofit Veterans Empowerment Organization, or VEO.",
      "publishedAt": "2023-11-11T05:06:09Z",
      "title": "Nonprofits making progress in tackling homelessness among veterans, but challenges remain",
      "url": "https://apnews.com/f3678eae4f03f5be8054181caff9f0af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3880b1ed27e144309a8b08cb768b6621/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Texas college student Jade Emerson found herself entranced as she worked on a podcast about Lady Bird Johnson, listening to hour upon hour of the former first lady recounting everything from her childhood memories to advising her husband in the White House.",
      "publishedAt": "2023-11-11T05:07:52Z",
      "title": "Projects featuring Lady Bird Johnson's voice offer new looks at the late first lady",
      "url": "https://apnews.com/a64fe45b6b510c3c65a2cd24eafd4d51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53a90348f8a7428083ff0707dfb377a4/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and DIDI TANG",
      "description": "WASHINGTON (AP) — When President Joe Biden meets Chinese leader Xi Jinping on Wednesday, there will be no such thing as a small detail.How they greet?",
      "publishedAt": "2023-11-11T05:08:58Z",
      "title": "Biden and Xi are to meet next week. There is no detail too small to sweat",
      "url": "https://apnews.com/171051514458fbce3b83ed959c80b8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5c63e93d96b4de1be3f8f95fd277248/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — The Biden administration’s plan to build new barriers along the U.S.-Mexico border in South Texas calls for a “movable” design that frustrates both environmentalists and advocates of stronger border enforcement.",
      "publishedAt": "2023-11-11T05:01:46Z",
      "title": "Biden's movable wall is criticized by environmentalists and those who want more border security",
      "url": "https://apnews.com/93b5ce59d615d9f9b1cdff8356fc307d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2415022e1504435af0afc8b39d6e85c/3000.jpeg"
    },
    {
      "author": "CIARÁN GILES and JOSEPH WILSON",
      "description": "MADRID (AP) — Spain's acting Prime Minister Pedro Sánchez ’s chances of forming a new coalition minority government following an inconclusive election in July were greatly boosted this week after reaching an agreement with a tiny party he surely hoped he would never have to rely on.",
      "publishedAt": "2023-11-11T06:19:40Z",
      "title": "Why Spain's acting leader is offering a politically explosive amnesty for Catalan separatists",
      "url": "https://apnews.com/a1b04f2f6e7467c4b301ec7b03f9d41b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e57a25dce494c409953e14083abaa2c/2973.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "STATE COLLEGE, Pa. (AP) — The Big Ten Conference banned Jim Harbaugh from coaching at Michigan's three remaining regular-season games on Friday, escalating an extraordinary confrontation with college football's winningest program over a sign-stealing scheme that has rocked the sport.",
      "publishedAt": "2023-11-10T21:02:41Z",
      "title": "Coach Jim Harbaugh banned from 3 games over sign-stealing allegations. Michigan asks judge for stay",
      "url": "https://apnews.com/2b8c5413d953414d88e9b65579cfcf44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01a400a3340d4b7ea3d697c22108df8d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}