{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Justice Samuel Alito rejects calls to step aside from Supreme Court cases on Trump and Jan. 6.",
      "publishedAt": "2024-05-29T17:27:13Z",
      "title": "Justice Samuel Alito rejects calls to step aside from Supreme Court cases on Trump and Jan. 6",
      "url": "https://apnews.com/5ee9605477ff227c1f0a7fe0a12d2df7",
      "urlToImage": ""
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Jury deliberations began Wednesday in Donald Trump’s hush money trial, placing the outcome of the history-making case in the hands of a dozen New Yorkers who have vowed to be fair and impartial in the face of their unprecedented task.",
      "publishedAt": "2024-05-29T04:04:18Z",
      "title": "Jury deliberations begin in Donald Trump’s hush money criminal case",
      "url": "https://apnews.com/390f045e9e8a37f069e82576edd7a842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ed3823080f045bfab68cc3a95b828fc/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "NEW YORK (AP) — Presumptive Republican nominee Donald Trump has been sitting for hours a day in a Manhattan courtroom, where his hush-money trial is nearing its end.",
      "publishedAt": "2024-05-29T04:07:56Z",
      "title": "Rallies and debates used to define campaigns. Now they're about juries and trials",
      "url": "https://apnews.com/f7982bf9c92129e4027db07e2f061371",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce77f163ac6c4b6b8ceaf5dd65823f29/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Justice Samuel Alito is rejecting calls to step aside from Supreme Court cases involving former President Donald Trump and Jan.",
      "publishedAt": "2024-05-29T17:33:34Z",
      "title": "Alito rejects calls to step aside from Supreme Court cases because of flag controversies",
      "url": "https://apnews.com/e53c1d1fef7b81f9dc87fa31b1622c4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aa2b1e651614f8ab11d06e356ed7d0a/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel’s military said Wednesday it had seized control of a strategic corridor that runs along the length of Gaza’s border with Egypt, an objective Israel had said was necessary in its bid to destroy Hamas as part of the ongoing war, now in its eighth month.",
      "publishedAt": "2024-05-29T14:47:37Z",
      "title": "Israel's military says it's taken control of a strategic corridor along Gaza's border with Egypt",
      "url": "https://apnews.com/7952f779552f41ef6fb44c3b662f5c48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c458cfcc5e649deb4fd04b3d070a9f7/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — After the International Criminal Court’s top prosecutor sought arrest warrants for Israeli Prime Minister Benjamin Netanyahu, his defense minister and top Hamas officials, the Israeli leader accused him of being one of “the great antisemites in modern times.”",
      "publishedAt": "2024-05-29T04:02:18Z",
      "title": "Netanyahu frequently makes claims of antisemitism. Critics say he's deflecting from his own problems",
      "url": "https://apnews.com/05ebd71bec931a62f58e7d5f9e93fa19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd8320921274bcabf944abde78436d1/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "PHILADELPHIA (AP) — President Joe Biden and Vice President Kamala Harris are stepping up their reelection pitch to Black voters, a key part of their 2020 winning coalition that has shown signs of fraying.",
      "publishedAt": "2024-05-29T09:03:59Z",
      "title": "Biden and Harris will launch a Black voter outreach effort as they see signs of diminished support",
      "url": "https://apnews.com/0c4a7343c017f57a38c847bfc9b1316f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68334248c1d4495bad84176bfcb65437/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and VADIM GHIRDA",
      "description": "CHISINAU, Moldova (AP) — U.S. Secretary of State Antony Blinken on Wednesday pledged $135 million in aid to Moldova for energy security and to counter Russian disinformation as the Western-leaning nation struggles to blunt Moscow’s push for influence that has been buoyed by recent successes in its war in neighboring Ukraine.",
      "publishedAt": "2024-05-29T15:15:58Z",
      "title": "US pledges $135 million in aid to Western-leaning Moldova to counter Russian influence",
      "url": "https://apnews.com/085dde8dc3ab04e1f6a11ae60cee9d36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/052f1e8df93f4fb3b1a1502f09b53b5a/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "PLAN DE AYALA, Mexico (AP) — At 4:30 a.m., the girls and women begin to appear in the dark streets of this rural village of Tojolabal people in southern Mexico. They walk in silence. Some are headed to grind corn to make their family’s tortillas.",
      "publishedAt": "2024-05-29T04:03:32Z",
      "title": "A woman will likely be Mexico's next president. But in some Indigenous villages, men hold the power",
      "url": "https://apnews.com/8112a9da0bf2ddb564f20bd478da4d62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc031dd258f34331a835b9aaae4fd169/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY, MOGOMOTSI MAGOME and FARAI MUTSAKA",
      "description": "JOHANNESBURG (AP) — South Africans voted Wednesday at schools, community centers, and in large white tents set up in open fields in an election seen as their country’s most important since apartheid ended 30 years ago.",
      "publishedAt": "2024-05-29T00:09:23Z",
      "title": "South Africans vote in what's been framed as their most important election since apartheid ended",
      "url": "https://apnews.com/db201bc1aa21a1d986d50af1674a8e78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb11aa014ee74233b21e8d81b39ba415/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}