{
  "articles": [
    {
      "author": "ERIC TUCKER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Donald Trump was indicted on felony charges Tuesday for working to overturn the results of the 2020 election in the run-up to the violent riot by his supporters at the U.S.",
      "publishedAt": "2023-08-01T21:27:59Z",
      "title": "Trump indicted for efforts to overturn 2020 election and block transfer of power",
      "url": "https://apnews.com/debb59bb7a4d9f93f7e2dace01feccdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02ce669f8fce4858abf0eadb6635e466/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK, BRIAN SLODYSKO and MEG KINNARD",
      "description": "WASHINGTON (AP) — The federal indictment of Donald Trump on Tuesday marks the first time that the former president has been formally held accountable for his efforts to overturn his 2020 election defeat.",
      "publishedAt": "2023-08-02T01:06:13Z",
      "title": "Takeaways from the Trump indictment that alleges a campaign of 'fraud and deceit'",
      "url": "https://apnews.com/4b5fea593f3684241a64650798aa598e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02ce669f8fce4858abf0eadb6635e466/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Donald Trump for years has promoted baseless claims that the 2020 election was stolen from him. In truth, Trump was the one who tried to steal the election, federal prosecutors said Tuesday in a sprawling indictment that paints the former president as desperate to cling to power he knew had been stripped away by voters.",
      "publishedAt": "2023-08-01T23:15:20Z",
      "title": "The election-meddling indictment against Trump is sprawling. Here's a breakdown of the case",
      "url": "https://apnews.com/7efd7577e41f0cbf9c697fa4613f93a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02ce669f8fce4858abf0eadb6635e466/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Fitch Ratings has downgraded the United States government's credit rating, citing rising debt at the federal, state, and local levels and a “steady deterioration in standards of governance” over the past two decades.",
      "publishedAt": "2023-08-01T21:59:59Z",
      "title": "Fitch downgrades US credit rating, citing mounting debt and political divisions",
      "url": "https://apnews.com/68fb6c578190d8361b6639e603714e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2505d6f7d514cf0a43df28a72fe85c2/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — A French military transport plane carrying Europeans from Niger arrived in Paris Wednesday, in the first such evacuation flight since mutinous soldiers ousted the country’s democratically elected president nearly a week ago and shut its borders.",
      "publishedAt": "2023-08-01T05:01:21Z",
      "title": "Niger crisis deepens as European nations evacuate and coup leaders get support from other juntas",
      "url": "https://apnews.com/0b951ec77a89033c84e6f0972cc21b5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dea12c9594ad431992c2b9c8a4b75589/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, HELENA ALVES and BARRY HATTON",
      "description": "VATICAN CITY (AP) — Pope Francis plans to head to Portugal on Wednesday to open the first post-pandemic edition of World Youth Day, hoping to inspire the next generation of Catholics while coping with the church's ongoing clergy sexual abuse scandal.",
      "publishedAt": "2023-08-02T03:35:32Z",
      "title": "Pope Francis can expect to find heat and hope in Portugal, along with fallout from sex abuse scandal",
      "url": "https://apnews.com/4db3ac2405da84abb9beced2b1f8b7c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8525b1abfd0426aae43a34e97c182fb/3000.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Aid efforts for Haitians enduring the gang violence ravaging their nation suffered a new blow with the kidnapping of an American nurse from New Hampshire and her young daughter, who were still missing Tuesday.",
      "publishedAt": "2023-08-01T04:21:00Z",
      "title": "Aid efforts for Haitians suffer new blow with kidnapping of American nurse and daughter",
      "url": "https://apnews.com/88df4a0a616599747b7e1728669b1f47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b60aff0476c649aeb1b87519e4050d09/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and EMMA BURROWS",
      "description": "TALLINN, Estonia (AP) — A drone attacked a skyscraper in central Moscow early Tuesday for the second time in around 48 hours, damaging the building’s facade and further underscoring the Russian capital’s vulnerability.",
      "publishedAt": "2023-08-01T07:36:01Z",
      "title": "Russia accuses Ukraine of striking same Moscow building that was hit by drone days ago",
      "url": "https://apnews.com/0773a8607c3e3c25a47124f4ef4d7b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96e2082bf3f14924b09c14975dd1fdc7/1920.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "Spend enough time with ChatGPT and other artificial intelligence chatbots and it doesn't take long for them to spout falsehoods.",
      "publishedAt": "2023-08-01T08:56:29Z",
      "title": "Chatbots sometimes make things up. Is AI’s hallucination problem fixable?",
      "url": "https://apnews.com/ac4672c5b06e6f91050aa46ee731bcf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/782391250f5244beb50da79c07cda4df/3000.jpeg"
    },
    {
      "author": "KRISTIE RIEKEN",
      "description": "HOUSTON (AP) — Framber Valdez was determined to improve this month after a subpar July where he posted a 7.29 ERA.On the first day of August he certainly did that. Valdez threw the 16th no-hitter in Houston Astros history in a 2-0 victory over the Cleveland Guardians on Tuesday night.",
      "publishedAt": "2023-08-02T02:34:02Z",
      "title": "Framber Valdez throws 16th no-hitter in Astros history in 2-0 victory over Guardians",
      "url": "https://apnews.com/4638017011fd652b15eec587e693620e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2339742930fb467085fd9ddf21604eef/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}