{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday said it will hear arguments next month over the constitutionality of the federal law that could ban TikTok in the United States if its Chinese parent company doesn't sell it.",
      "publishedAt": "2024-12-18T16:16:00Z",
      "title": "Supreme Court will hear arguments over the law that could ban TikTok in the US if it's not sold",
      "url": "https://apnews.com/08d6fffdcd2dde5100fcdf8a452dd5cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af5bd4c467994d769d0d85bce0ea3ce5/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House Ethics Committee has voted in secret to release the long-awaited ethics report into ex-Rep. Matt Gaetz, raising the possibility that the allegations against the Florida Republican who was President-elect Donald Trump's first choice for attorney general could be made public in the coming days.",
      "publishedAt": "2024-12-18T16:47:32Z",
      "title": "House Ethics Committee secretly voted to release Matt Gaetz ethics report, source says",
      "url": "https://apnews.com/4db3ee2d94dbcbfb6ed5e641d455d734",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d331d7fc20f84c479ba9465549f66ef8/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and SYLVIE CORBET",
      "description": "MAMOUDZOU, Mayotte (AP) — Relatives of families struggling after Cyclone Chido ripped through the French island territory of Mayotte expressed helplessness Wednesday, a day before France’s president and another 180 tons of aid were expected to arrive.",
      "publishedAt": "2024-12-18T14:03:03Z",
      "title": "Families scramble to help after deadly cyclone rips through French territory of Mayotte off Africa",
      "url": "https://apnews.com/e073dfc2eda629af0a297e74f2f333fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/774eddc2b1ec4a469d2b72edcd9a76da/1920.jpeg"
    },
    {
      "author": "DEVI SHASTRI and SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Community members in Wisconsin continued to wrestle with grief and called for change in the aftermath of a school shooting that killed a teacher and a student and wounded six others.",
      "publishedAt": "2024-12-18T05:53:37Z",
      "title": "Community members wrestle with grief in aftermath of Wisconsin school shooting",
      "url": "https://apnews.com/f7596d62f72b6b358add8c35f0e2eee4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378f7cf32b794b40965ce1b8fb40e8a6/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "KIRYAT GAT, Israel (AP) — Ilana Gritzewsky is fighting a battle against time to save her boyfriend from Hamas captivity.While there appears to be progress toward a deal to free the remaining captives in phases, Matan Zangauker would likely not be released in the first stage since he is a young man.",
      "publishedAt": "2024-12-18T14:21:03Z",
      "title": "Families of hostages endure uncertainty even as hopes rise for a ceasefire in Gaza",
      "url": "https://apnews.com/9875e2b5b8679b16106a9106bd37003c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85557ba633d345a1b899010ccd970a77/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — The kids seen by Dolores Mejia around suburban Phoenix have been growing heavier in recent years. Their parents, too, she says.Mejia, a 75-year-old retiree, says she's also had her own weight struggles on the scale.",
      "publishedAt": "2024-12-18T12:01:05Z",
      "title": "What Americans think of Robert F. Kennedy Jr. and his health stances",
      "url": "https://apnews.com/797750f5f141161778792e84602b57c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc76c3caaa4c4d8eb3d0547292563f40/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — A person in Louisiana has the first severe illness caused by bird flu in the U.S., health officials said Wednesday.The patient had been in contact with sick and dead birds in backyard flocks, the Centers for Disease Control and Prevention said.",
      "publishedAt": "2024-12-18T16:29:11Z",
      "title": "Health officials say Louisiana patient is first severe bird flu case in US",
      "url": "https://apnews.com/2b4a5f55a05cf8be9b169c15e8b9582d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a54bdc5b064d01b35def7926243701/2579.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's security service said Wednesday it detained a citizen from Uzbekistan in the bombing that killed a senior general as he left his southeastern Moscow apartment — a bold assassination that was claimed by Ukraine's security service.",
      "publishedAt": "2024-12-18T07:20:02Z",
      "title": "Russia says it has detained a suspect in the Moscow bombing that killed a senior general",
      "url": "https://apnews.com/32e504b029d8db0b8d52474d75efc383",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8de49c4127074b6a82b60c9a8a6b0ca8/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — France’s highest court has upheld an appeal court decision which had found former President Nicolas Sarkozy guilty of corruption and influence peddling while he was the country's head of state.",
      "publishedAt": "2024-12-18T13:32:04Z",
      "title": "France’s highest court upholds corruption conviction of former President Nicolas Sarkozy",
      "url": "https://apnews.com/715483927ad6dfc7799ca8a9f28303cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/762f565afb124c19b91c6ffabdc6674f/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "ABUJA, Nigeria (AP) — Several children in southwestern Nigeria were killed Wednesday in a stampede during a holiday fair organized by a school, the local governor said.The stampede occurred at the Islamic High School Basorun in Oyo state, and security forces have been deployed to prevent further deaths, Oyo state Gov.",
      "publishedAt": "2024-12-18T16:07:04Z",
      "title": "Several children killed in a stampede at a fair in Nigeria, official says",
      "url": "https://apnews.com/65ca20abe5f96771b97df60e3a1e11bc",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}