{
  "articles": [
    {
      "author": "HANNA ARHIROVA and DASHA LITVINOVA",
      "description": "KYIV, Ukraine (AP) — Fierce fighting raged Thursday in southeastern Ukraine, where a Western official said Kyiv has launched a major push and Russian President Vladimir Putin said “hostilities have intensified significantly.”",
      "publishedAt": "2023-07-27T08:50:54Z",
      "title": "Putin claims fighting in southeastern Ukraine has intensified, with Kyiv suffering heavy losses",
      "url": "https://apnews.com/12334bbee83b608221dafced4727369e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f19af2efc12d4a3db5321b44a7994a38/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Sometime this summer, if President Vladimir Putin can be believed, Russia moved some of its short-range nuclear weapons into Belarus, closer to Ukraine and onto NATO's doorstep.",
      "publishedAt": "2023-07-27T05:07:12Z",
      "title": "Bluffing or not, Putin’s declared deployment of nuclear weapons to Belarus raises tensions",
      "url": "https://apnews.com/3bc2aefef4ee6b4478c81ae76bebdd4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e24e7f9719504e7883c218b9151e5331/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The U.S. economy surprisingly accelerated to a 2.4% annual growth rate from April through June, showing continued resilience in the face of steadily higher interest rates resulting from the Federal Reserve’s 16-month-long fight to bring down inflation.",
      "publishedAt": "2023-07-27T04:01:24Z",
      "title": "US economy accelerated unexpectedly to a 2.4% growth rate in April-June quarter despite Fed hikes",
      "url": "https://apnews.com/ce011c5f4330bc29d37939730039d1bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ece6b68452b8499198aea408a358d55a/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — The day after Jan. 6, 2021, then-President Donald Trump denounced the rioters who violently stormed the Capitol building, breaking through barricades, battling law enforcement and sending members of Congress — who were set to formally certify his reelection loss — running for their lives.",
      "publishedAt": "2023-07-27T04:04:49Z",
      "title": "Trump once condemned the Jan. 6 rioters. Now he's become one of their biggest supporters",
      "url": "https://apnews.com/51e9133c0d7b1ea71b43fbb73f4a1f83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d27017eca84990b1f18204a633e795/3000.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "More than 1,000 U.S. service personnel are in Niger, which until Wednesday's coup attempt by mutinous soldiers had avoided the military takeovers that destabilized West African neighbors in recent years.",
      "publishedAt": "2023-07-27T11:17:07Z",
      "title": "How the attempted coup in Niger could expand the reach of extremism, and Wagner, in West Africa",
      "url": "https://apnews.com/a229a854e625eb8e15cd2a8c65048bd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/997481104fd14f779a37013559b82865/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden's administration on Thursday announced the first cancer-focused initiative under its advanced health research agency, aiming to help doctors more easily distinguish between cancerous cells and healthy tissue during surgery and improve outcomes for patients.",
      "publishedAt": "2023-07-27T13:01:06Z",
      "title": "Biden announces an advanced cancer research initiative as part of the bipartisan 'moonshot' effort",
      "url": "https://apnews.com/bda0a837d1be31df5655cfb0c90b3876",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57eef6161384457487640c655bc08b97/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and ISAAC SCHARF",
      "description": "JERUSALEM (AP) — Israeli military fire killed a 14-year-old Palestinian boy in the occupied West Bank, Palestinian health officials said Thursday, as an ultranationalist Israeli Cabinet minister visited a sensitive Jerusalem holy site that has been a frequent flashpoint for violence between Israel and the Palestinians.",
      "publishedAt": "2023-07-27T05:26:45Z",
      "title": "Army fire kills a 14-year-old, Palestinians say, as an Israeli minister visits flashpoint holy site",
      "url": "https://apnews.com/3c0495b6671588233e4fce2e45c1cfad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/874f7eb59af64b6bb2c9d4c6bf168db9/3000.jpeg"
    },
    {
      "author": null,
      "description": "MANILA, Philippines (AP) — At least 21 people died and 40 others were rescued after a Philippine passenger boat overturned Thursday when it was lashed by strong winds in Laguna Lake southeast of Manila, police said.",
      "publishedAt": "2023-07-27T10:54:13Z",
      "title": "21 dead and 40 rescued after a wind-tossed boat overturns in the Philippines",
      "url": "https://apnews.com/77151ff2697bbda3e60ac12de9a17c25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae1c4b813c964b51b8fd1c895be802df/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — Prince Harry’s lawsuit accusing the publisher of The Sun tabloid of unlawfully snooping on him can go to trial, but not on claims of phone hacking, a High Court judge ruled Thursday.The Duke of Sussex alleged the publisher of The Sun and the now-defunct News Of The World had hacked his phone and used investigators and deception to unlawfully gather information on him dating back two decades.",
      "publishedAt": "2023-07-27T09:29:46Z",
      "title": "Judge allows Prince Harry's snooping lawsuit against publisher of The Sun tabloid to go to trial",
      "url": "https://apnews.com/4aa019fe8d6bf2d52e545a65da8f19ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e744aef6a264854a139e5b8475fc555/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "SAN FRANCISCO (AP) — Elon Musk may want to send “tweet” back to the birds, but the ubiquitous term for posting on the site he now calls X is here to stay — at least for now.",
      "publishedAt": "2023-07-27T05:04:59Z",
      "title": "Elon Musk wants to turn tweets into 'X's'. But changing language is not quite so simple",
      "url": "https://apnews.com/c1c3871e9bef60aa0a4c1a40129c155a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/703379c570d34d65b45169dd3de82722/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}