{
  "articles": [
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — With control over some of his most prized real estate holdings in jeopardy, former President Donald Trump says he will make a rare, voluntary trip to court in New York on Monday for the start of a civil trial in a lawsuit that already has resulted in a judge ruling that he committed fraud in his business dealings.",
      "publishedAt": "2023-10-02T02:45:44Z",
      "title": "Donald Trump says he'll be in court for a New York trial scrutinizing his business practices",
      "url": "https://apnews.com/eb98c99fe918da139b0d8b6347211afe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff678d37237468da8ff0b7b31fe9b63/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — “How would you be different as speaker, compared to Mr. Boehner?” a reporter asked then-House Majority Leader Kevin McCarthy in September 2015 as the California Republican pursued, and eventually gave up, his first attempt at the speakership.",
      "publishedAt": "2023-10-02T04:02:06Z",
      "title": "Rep. Matt Gaetz is threatening to oust Speaker Kevin McCarthy. It won't be easy",
      "url": "https://apnews.com/eba874f3a76ab8ebe03236514d981810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b36377dc71c84a2c9e136e7451896474/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Some of Europe’s top diplomats gathered Monday in Kyiv in a display of support for Ukraine’s fight against Russia’s invasion as signs emerge of political strain in Europe and the United States over the 19-month-old war.",
      "publishedAt": "2023-10-02T08:16:40Z",
      "title": "Top European diplomats meet in Kyiv to support Ukraine as signs of strain show among allies",
      "url": "https://apnews.com/9fe7150d40e1944ec3c08b04b99df060",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d60ccc807c4586b0973690e1613fa5/2000.jpeg"
    },
    {
      "author": "DAVID KEYTON and MIKE CORDER",
      "description": "STOCKHOLM (AP) — Two scientists won the Nobel Prize in medicine on Monday for discoveries that enabled the development of mRNA vaccines against COVID-19 and could be used in the future to create other shots.",
      "publishedAt": "2023-10-02T07:06:36Z",
      "title": "Nobel in medicine goes to 2 scientists whose work enabled creation of mRNA vaccines against COVID-19",
      "url": "https://apnews.com/71306bd18785477f3a85a69caa6e09c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5e2f617fdbe4a51bac507cdc43a16ec/1920.jpeg"
    },
    {
      "author": "ALFREDO PEÑA",
      "description": "CIUDAD MADERO, Mexico (AP) — The roof of a church collapsed in northern Mexico during Sunday Mass, killing at least 10 people and injuring around 60, authorities said as searchers probed in the wreckage throughout the night and into Monday morning looking for survivors and more victims.",
      "publishedAt": "2023-10-01T22:54:47Z",
      "title": "At least 10 people are dead after church roof collapsed in northern Mexico during Sunday Mass",
      "url": "https://apnews.com/fa4f4a42499533ee8d3517f349ae5d14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d1321f138d4ee78dd1f0843eafefef/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and TRISHA THOMAS",
      "description": "VATICAN CITY (AP) — A few years ago, Pope Francis told the head of the main Vatican-backed Catholic women's organization to be “brave” in pushing for change for women in the Catholic Church. Maria Lia Zervino took his advice and in 2021 wrote Francis a letter, then made it public, saying flat out that the Catholic Church owed a big debt to half of humanity and that women deserved to be at the table where church decisions are made, not as mere “ornaments” but as protagonists.",
      "publishedAt": "2023-10-02T04:07:20Z",
      "title": "Women's voices and votes loom large as pope is to open a Vatican meeting on church's future",
      "url": "https://apnews.com/23a8114eea28c94622d4143f029987d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a227f48dbdd46d292b1d9a527e3109a/3000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD",
      "description": "LOS ANGELES (AP) — California Gov. Gavin Newsom has selected Laphonza Butler, a Democratic strategist and adviser to Kamala Harris’ 2020 presidential campaign, to fill the U.S. Senate seat made vacant by the death of Sen.",
      "publishedAt": "2023-10-02T03:06:21Z",
      "title": "California governor names Laphonza Butler, former Kamala Harris adviser, to Feinstein Senate seat",
      "url": "https://apnews.com/57823d2ff39f2a007640dce8e70045a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5903a788bed49abbec8e87e71c798a4/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY, JOCELYN GECKER and EMILY SWANSON",
      "description": "WASHINGTON (AP) — Americans view college campuses as far friendlier to liberals than to conservatives when it comes to free speech, with adults across the political spectrum seeing less tolerance for those on the right, according to a new poll.",
      "publishedAt": "2023-10-02T04:14:12Z",
      "title": "Few Americans say conservatives can speak freely on college campuses, an AP-NORC/UChicago poll shows",
      "url": "https://apnews.com/0b2811fb35c9c6288b7517da7c9affd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96adaa995b4d4d3c92ae0909016cb558/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "DENVER (AP) — When Kirsten Hawkes, a one-time elite fencer, reached out to her childhood coach for advice about starting her own fencing club, their meeting turned awkward right away. It began, she said, with an unwanted kiss on the lips when the two met at a bar during a fencing tournament in Minneapolis last October.",
      "publishedAt": "2023-10-02T04:02:10Z",
      "title": "Forced kiss claim leads to 'helplessness' for accuser who turned to Olympics abuse-fighting agency",
      "url": "https://apnews.com/0770975926e77c1c0aa681c71bc13704",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6874a16611c4ae69c2f639fbaf6872f/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Late-night talk shows are returning after a five-month absence brought on by the Hollywood writers strike, while actors will begin talks that could end their own long work walk-off.",
      "publishedAt": "2023-10-02T05:09:45Z",
      "title": "Late-night shows return after writers strike as actors resume talks that could end their standoff",
      "url": "https://apnews.com/1ddcaa8c4684375f8e56d2cd2abd62ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bab37ada2fc4c0db41772331996a0f4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}