{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump says he’s directing the opening of a detention center at Guantanamo Bay to hold up to 30,000 migrants who are living illegally in the United States. Trump made the announcement Wednesday right before he signed the Laken Riley Act into law as his administration’s first piece of legislation. The bipartisan measure means that people who are in the United States illegally and are accused of theft and violent crimes would have to be detained and potentially deported even before a conviction.",
      "publishedAt": "2025-01-29T05:17:27Z",
      "title": "Trump directing the opening of Guantanamo Bay detention center to hold migrants in US illegally",
      "url": "https://apnews.com/article/trump-signs-laken-riley-act-immigration-crackdown-30a34248fa984d8d46b809c3e6d8731a",
      "urlToImage": "https://dims.apnews.com/dims4/default/c65993b/2147483647/strip/true/crop/5393x3034+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F76%2F008244ae4399cecc2094a47bfc90%2Fb9189c06bb4f4a78aa63cf6069cd3003"
    },
    {
      "author": "The Associated Press",
      "description": "Robert F. Kennedy Jr’s confirmation hearings began Wednesday before the Senate Finance Committee and will be held Thursday before the  Health, Education, Labor and Pension committee.",
      "publishedAt": "2025-01-29T07:52:00Z",
      "title": "Live updates: Senators press RFK Jr. on past controversial claims during confirmation hearing",
      "url": "https://apnews.com/live/trump-presidency-updates-day-10",
      "urlToImage": "https://dims.apnews.com/dims4/default/513de75/2147483647/strip/true/crop/8191x4607+0+426/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F17%2F45d2c1e973c83ef6ba8c03656031%2F355dc7c7081f4101bbc849d17fdf060d"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "The first bill signed by President Donald Trump is named after a slain Georgia nursing student whose name became a rallying cry during Trump’s White House campaign. The Laken Riley Act will require the detention of unauthorized immigrants accused of theft and violent crimes. The bill won bipartisan support in both the House and Senate. Under the law signed Wednesday, federal officials will be required to detain any migrant arrested or charged with crimes like shoplifting, assaulting a police officer or crimes that injure or kill someone.",
      "publishedAt": "2025-01-24T05:02:19Z",
      "title": "What is the Laken Riley Act? And who voted for it?",
      "url": "https://apnews.com/article/what-is-laken-riley-act-trump-immigration-2667d626139ddf5a16d1533516eab18f",
      "urlToImage": "https://dims.apnews.com/dims4/default/11b9b96/2147483647/strip/true/crop/7447x4189+0+390/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ff7%2F78ac8e1bab6b2560dd3038a50352%2Fe718e5c4274148b3b031bf4960ad03d3"
    },
    {
      "author": "TARA COPP",
      "description": "Defense Secretary Pete Hegseth is pulling the security protections and clearance of retired Joint Chiefs chairman Gen. Mark Milley. He also ordered the Pentagon’s inspector general to review Milley’s actions while serving as the nation’s top uniformed officer to determine if a demotion is warranted, two defense officials confirmed late Tuesday. Milley served as chairman during President Donald Trump’s first term in office. While the relationship initially went well, it soured deeply and fast, as Milley tried to advise and contain the president on a host of issues. Hegseth’s chief of staff Joe Kasper said that the decision to strip Milley of his clearance and detail was taken because “undermining the chain of command is corrosive to our national security.\"",
      "publishedAt": "2025-01-29T09:49:02Z",
      "title": "Defense secretary pulls Trump critic Gen. Milley's security clearance and protective detail",
      "url": "https://apnews.com/article/milley-trump-security-detail-clearance-9bc8ebb7cd7cd2c334d00c97d4c142d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b12138/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F57%2Ffacd4ef8ac64a49c7c19537e34bd%2F469fd128916c4417ad8d3443e5a5db43"
    },
    {
      "author": "CHRISTOPHER L. KELLER, CLAUDIA LAUER, AMY TAXIN, REBECCA BOONE",
      "description": "When disaster strikes, government emergency alert systems offer a simple promise: Residents will get information about nearby dangers and instructions to help them stay safe. As the deadly LA wildfires and other major disasters have shown, alerts rely on a complicated chain of communication between first responders, government administrators, third-party companies and the public. Sometimes, the chain breaks. In this month's wind-driven wildfires in Southern California, evacuation alerts for some neighborhoods came long after homes were aflame. That included the part of Altadena where most of the deaths occurred. County officials have approved an outside review of its role in the Eaton Fire and Palisades Fire alerts at the urging of residents.",
      "publishedAt": "2025-01-29T05:03:44Z",
      "title": "Flawed emergency alert systems lagged when residents needed them most during Los Angeles wildfires",
      "url": "https://apnews.com/article/california-wildfires-emergency-alerts-los-angeles-d78c30c9f73570c31aae9c9154c685ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/96bbc44/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F11%2Ff47a9d253484d5dfc8215911fef5%2F61163a94bbc34bfe8206c05a41379a80"
    },
    {
      "author": "HELEN WIEFFERING",
      "description": "More ships than ever are being abandoned around the world by their owners, according to the United Nations’ labor and maritime organizations, leaving thousands of workers stuck on board without pay or the means to travel home to their families. Cases have doubled in the past three years, impacting more than 3,000 seafarers across some 230 ships, according to an Associated Press analysis of U.N. data. Photos and videos taken on one such ship moored off the coast of Yemen show the faucets spewing cloudy brown water, rust blanketing the deck and only a few rotting pieces of produce in the pantry. “They’re essentially imprisoned on these vessels,” one ship inspector said. “It goes way beyond exploitation.”",
      "publishedAt": "2025-01-29T14:00:19Z",
      "title": "Shipowner abandonment hits record highs",
      "url": "https://apnews.com/article/international-trade-abandoned-seafarers-labor-unpaid-wages-oceans-shipping-82a5481d277c31009c3a68e69da2f348",
      "urlToImage": "https://dims.apnews.com/dims4/default/15458b1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fd6%2Fdd200198c6af992981b69b6f9b63%2F6e68a07bc51e4213b208906c3f04fb72"
    },
    {
      "author": "TARA COPP",
      "description": "The Defense Department intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events in response to President Donald Trump’s ban on diversity, equity and inclusion programs in the federal workplace. The instructions were published Tuesday in a Defense Intelligence Agency memo obtained by The Associated Press and affect 11 annual events, including Black History Month, which begins Saturday, and National Hispanic Heritage Month. An official says the pause was initiated by the agency and appears not to be policy across the Defense Department. A spokesman for the DIA did not immediately respond to a request for comment.",
      "publishedAt": "2025-01-29T21:47:55Z",
      "title": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more",
      "url": "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70",
      "urlToImage": "https://dims.apnews.com/dims4/default/185cda7/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F7d%2F955fa028454c8b93909ae193859f%2F57fe20cfedfd463ba2700c7ef418f8a9"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER",
      "description": "President Donald Trump’s budget office has rescinded an order freezing spending on federal grants, less than two days after it sparked widespread confusion and legal challenges across the country. The White House confirmed that OMB pulled the order Wednesday in a two sentence notice to agencies and departments, but said that Trump’s underlying executive orders targeting federal spending in areas like diversity, equity and inclusion and climate change, remained in place. The Monday evening order from the White House Office of Management and Budget sparked uncertainty over a crucial financial lifeline for states, schools and organizations that rely on trillions of dollars from Washington and left the White House scrambling to explain what would and wouldn’t be subject to a pause in funding.",
      "publishedAt": "2025-01-29T18:23:06Z",
      "title": "Federal grant freeze: Trump White House rescinds order",
      "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-6d41961940585544fa43a3f66550e7be",
      "urlToImage": "https://dims.apnews.com/dims4/default/1cfc8c3/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F30%2F854ac115c92900fed6ddb8f28f44%2Fd68559b199f0408e8718b2b739072174"
    },
    {
      "author": "LAURAN NEERGAARD, MATTHEW PERRONE",
      "description": "Robert F. Kennedy Jr., was pressed to clarify his views on vaccines, abortion and public health priorities in the first of two senate hearings as he tries to make the case to become President Donald Trump’s health secretary. Kennedy is seeking to lead the Department of Health and Human Services, the $1.7 trillion agency that funds medical research, public health outreach, food and drug safety, Medicare and Medicaid. Republicans on the Senate Finance Committee expressed hope Kennedy could help reduce chronic diseases and health care costs. Democrats repeatedly used quotes and transcripts from his books to pin him down on several issues.",
      "publishedAt": "2025-01-29T21:56:04Z",
      "title": "Takeaways from RFK Jr.'s first confirmation hearing",
      "url": "https://apnews.com/article/rfk-trump-health-hhs-vaccine-abortion-b785e44f341691684b4daa711dae8c85",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba74de3/2147483647/strip/true/crop/8165x4593+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F24%2F35457732f366155203e9f5204c19%2F3d690f9b93104b798bb012f874dea316"
    },
    {
      "author": "RAJESH KUMAR SINGH, SHEIKH SAALIQ",
      "description": "Police say at least 30 people were killed and many more injured in a stampede at the world’s largest religious gathering as millions of pilgrims rushed to dip in sacred waters during the Maha Kumbh festival in northern India. Police said 60 others were injured Wednesday. It was a sacred day in the six-week Hindu festival, and authorities expected a record 100 million devotees to engage in a ritual bath at the confluence of the Ganges, the Yamuna and the mythical Saraswati rivers. Hindus believe that a dip there can cleanse them of past sins and end the process of reincarnation.",
      "publishedAt": "2025-01-29T00:31:56Z",
      "title": "Maha Kumbh Mela India: At least 30 people have died, police say",
      "url": "https://apnews.com/article/india-maha-kumbh-hinduism-stampede-da4a3423bf2fd1c06f7c730e65dc1350",
      "urlToImage": "https://dims.apnews.com/dims4/default/63f3917/2147483647/strip/true/crop/8064x4536+0+756/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2Fcb%2Fcee634f13152522e367ccf152745%2F6670ce3dc05740f9b5be920b6d64f695"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}