{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JOE KRAUSS and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Benny Gantz, a popular centrist member of Israel’s three-member War Cabinet, threatened Saturday to resign from the government if it doesn't adopt a new plan in three weeks' time for the war in Gaza, a decision that would leave Prime Minister Benjamin Netanyahu more reliant on far-right allies.",
      "publishedAt": "2024-05-18T15:07:52Z",
      "title": "Member of Israel's War Cabinet says he'll quit the government June 8 unless there's a new war plan",
      "url": "https://apnews.com/3ac9d8e59198d5884d0faa6649a53e4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a436c70825d444f6890512aa17127dde/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "DALLAS (AP) — Former President Donald Trump urged gun owners to vote in the 2024 election as he addressed thousands of members of the National Rifle Association, which officially endorsed him just before Trump took the stage at their annual meeting in Texas on Saturday.",
      "publishedAt": "2024-05-18T04:11:44Z",
      "title": "Trump receives NRA endorsement as he vows to protect gun rights",
      "url": "https://apnews.com/de03ae7672f2b1e213da6acbf25df378",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a2ca82fe2e14cb4b345ef88ff87ed13/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and BILL BARROW",
      "description": "ATLANTA (AP) — President Joe Biden is delivering the commencement address at Morehouse College on Sunday, a key opportunity for an election-year appearance before a Black audience but one that also could directly expose him to the anger that some of these and other students across the country have been expressing over his staunch support for Israel in its war against Hamas militants in Gaza.",
      "publishedAt": "2024-05-19T03:25:39Z",
      "title": "Biden will deliver Morehouse commencement address during a time of tumult on US college campuses",
      "url": "https://apnews.com/e42d08d7431bf9218afa90177efa3f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86c15fc888c940de81f3f27ff5f5f190/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and JOANNA KOZLOWSKA",
      "description": "KYIV, Ukraine (AP) — A divisive mobilization law in Ukraine came into force on Saturday, as Kyiv struggles to boost troop numbers after Russia launched a new offensive that some fear could close in on Ukraine’s second-largest city.",
      "publishedAt": "2024-05-18T10:19:03Z",
      "title": "Ukraine's divisive mobilization law comes into force as a new Russian push strains front-line troops",
      "url": "https://apnews.com/599753d08518b46e22bf38d1360cce86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e98d0e997fba406e98551677dda767d0/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Dressed in black and white, the crowd of angry teenagers squeezed into a narrow street in Haiti’s capital.They stopped in front of a cemetery and hoisted a coffin onto their shoulders, tears rolling down some faces.",
      "publishedAt": "2024-05-19T04:01:51Z",
      "title": "As killings surge, Haitians struggle to bury loved ones and find closure in violent capital",
      "url": "https://apnews.com/3f616868b7bef8f7f40f036198e332a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a7488a3e6e3405aa14a8b7022234455/3000.jpeg"
    },
    {
      "author": "LEKAN OYEKANMI DAVID J. PHILLIP and KEN MILLER",
      "description": "HOUSTON (AP) — As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and scorching temperatures that could pose health risks.",
      "publishedAt": "2024-05-18T04:12:46Z",
      "title": "Hot weather poses new risk as thousands remain without power after deadly Houston storm",
      "url": "https://apnews.com/86643a6d7decd28e971774e03b52e51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbfd9fefab2c4251b79a7a6b8644c7eb/1920.jpeg"
    },
    {
      "author": "SIMINA MISTREANU and KEN MORITSUGU",
      "description": "TAIPEI, Taiwan (AP) — In a campaign ad for Taiwan’s president-elect Lai Ching-te, incumbent President Tsai Ing-wen was shown driving with Lai in the passenger seat, exchanging reflections on their years governing together.",
      "publishedAt": "2024-05-19T01:11:28Z",
      "title": "Taiwan's new president inherits a strong foreign policy position but political gridlock at home",
      "url": "https://apnews.com/3e3e4e330741bebbb004de35e54ebd6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f68d185f2bf4c3aa8fcd94a6fd03374/3000.jpeg"
    },
    {
      "author": "GRANT PECK",
      "description": "BANGKOK (AP) — A powerful ethnic armed group fighting Myanmar’s military government in the country’s western state of Rakhine claimed Saturday to have seized a town near the border with Bangladesh, marking the latest in a series of victories for foes of the country’s military government.",
      "publishedAt": "2024-05-18T20:40:35Z",
      "title": "As ethnic armed group claims to have captured a town in western Myanmar, Muslim Rohingyas flee again",
      "url": "https://apnews.com/5f9ef5e88b0747a12864d9052e325e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b5d048565e24d20840668ea56274c77/2866.jpeg"
    },
    {
      "author": null,
      "description": "RIYADH, Saudi Arabia (AP) — Oleksandr Usyk has been shorter, lighter and older than all of his opponents since he moved up to the heavyweight division.Usyk's heart and skill are enormous, and he overcame a major size disadvantage against Tyson Fury to become the world's first undisputed heavyweight boxing champion in 24 years.",
      "publishedAt": "2024-05-18T23:50:41Z",
      "title": "Usyk beats Fury by split decision to become the first undisputed heavyweight champion in 24 years",
      "url": "https://apnews.com/3539d0cb1203895291c114bf642e95a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c687db8035b24f959e7e8aecac28f816/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "BALTIMORE (AP) — D. Wayne Lukas worked his way to Seize the Grey after his horse won the Preakness Stakes and kept getting interrupted by well-wishers offering congratulations.",
      "publishedAt": "2024-05-18T10:00:23Z",
      "title": "Seize the Grey wins the Preakness for D. Wayne Lukas and ends Mystik Dan’s Triple Crown bid",
      "url": "https://apnews.com/2c27b76792b3b064d30baa07c3466ad3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e38d7aec029f4f299ff83e3b6df21812/2777.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}