{
  "articles": [
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russia launched a massive aerial attack against Ukraine on Friday, firing 93 cruise and ballistic missiles and almost 200 drones, Ukrainian President Volodymyr Zelenskyy said, describing it as one of the heaviest bombardments of the country's energy sector since Russia's full-scale invasion almost three years ago.",
      "publishedAt": "2024-12-13T07:19:59Z",
      "title": "Russia targets Ukrainian infrastructure with a massive attack by cruise missiles and drones",
      "url": "https://apnews.com/801d7ba2438ea021d8568502f803bb3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e24a0a209c24f0599577d2f84e7fcde/2200.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Former House Speaker Nancy Pelosi has been hospitalized after she “sustained an injury” during an official engagement in Luxembourg, according to a spokesman.",
      "publishedAt": "2024-12-13T16:45:57Z",
      "title": "Nancy Pelosi hospitalized after she 'sustained an injury' on official trip to Luxembourg",
      "url": "https://apnews.com/d55392b1dd9ebc2af77795bb46e364ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a4febfee824a449e790ff9e2f5fdb0/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — The incoming administration of President-elect Donald Trump is likely to bring big changes for one of the oldest sectors of the U.S. economy — seafood — and some in the industry believe the returning president will be more responsive to its needs.",
      "publishedAt": "2024-12-13T05:04:55Z",
      "title": "Some in seafood industry see Trump as fishermen's friend, but tariffs could make for pricier fish",
      "url": "https://apnews.com/e34a879b477287dc642d2ab2536e1017",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2593b2437b56455e93cd3b82c224a557/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A nonprofit leader who supports at-risk New Orleans youth. A social worker who fosters animals. A counselor and recovery coach who volunteers at organizations that fight sexual assault and domestic violence.",
      "publishedAt": "2024-12-13T11:32:42Z",
      "title": "A nonprofit leader, a social worker: Here are the stories of the people on Biden's clemency list",
      "url": "https://apnews.com/544db0fcde540b5f56b202e0a4256a57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79c154e8c8cd48208b11e5a71c8f7236/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS and MEG KINNARD",
      "description": "WASHINGTON (AP) — Americans may have recently elected Donald Trump to a second term, but that doesn't mean they have high confidence in his ability to choose well-qualified people for his Cabinet — or effectively manage government spending, the military and the White House, according to a new poll from the AP-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-12-13T12:02:52Z",
      "title": "About 3 in 10 are highly confident in Trump on Cabinet, spending or military oversight: AP-NORC poll",
      "url": "https://apnews.com/be16ac992769e9c4636854eee7999dfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dd0e856e5a44545b825676454c51fd5/3000.jpeg"
    },
    {
      "author": "ALBERT AJI and MATTHEW LEE",
      "description": "DAMASCUS (AP) — Thousands of Syrians gathered Friday in Damascus' historic main mosque for the first Muslim Friday prayers since the ouster of President Bashar Assad, while giant crowds celebrated in the capital's largest square.",
      "publishedAt": "2024-12-13T13:07:49Z",
      "title": "Thousands of Syrians celebrate in central Damascus during first Friday prayers since Assad's fall",
      "url": "https://apnews.com/4667db0171da539e79662d1de23bd921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de19c7493b20467c89bde56efb3a56e8/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French President Emmanuel Macron on Friday named centrist ally François Bayrou as prime minister in an effort to address the country's deep political crisis, after a historic parliamentary vote ousted the previous government last week.",
      "publishedAt": "2024-12-13T11:48:38Z",
      "title": "President Macron names centrist ally Bayrou as France's next prime minister",
      "url": "https://apnews.com/2e7cbdab53426354c440dda59c93ce65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b72b1a46f37c4e5fb497401511db8ecc/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "TEHRAN, Iran (AP) — Iran’s capital and outlying provinces have faced rolling power blackouts for weeks in October and November, with electricity cuts disrupting people’s lives and businesses.",
      "publishedAt": "2024-12-13T05:09:30Z",
      "title": "Rolling blackouts plague Iran and some suspect bitcoin mining may have a role in the outages",
      "url": "https://apnews.com/9ff962e2bc7931e4f4dca79407316df3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/084ba34123594cf8820781a93425927d/2000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — McKinsey &amp; Company consulting firm has agreed to pay $650 million to settle a federal investigation into its work to help opioids manufacturer Purdue Pharma boost the sales of the highly addictive drug OxyContin, according to court papers filed in Virginia on Friday.",
      "publishedAt": "2024-12-13T14:57:58Z",
      "title": "McKinsey & Company agrees to pay $650M for helping Purdue Pharma boost opioid sales",
      "url": "https://apnews.com/d47d1bc1c4e14288927c2aea2369b789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39ada02abc9c40dea9f1cab097caabd7/3000.jpeg"
    },
    {
      "author": "PAT GRAHAM",
      "description": "BEAVER CREEK, Colo. (AP) — Lindsey Vonn will return to World Cup ski racing next weekend for a pair of super-G events in St. Moritz, Switzerland, as she continues her comeback at 40 years old.Vonn teased her return in an Instagram post through her sponsor, Red Bull, on Friday morning.",
      "publishedAt": "2024-12-13T15:34:13Z",
      "title": "Lindsey Vonn to enter World Cup ski races next weekend in Switzerland in her comeback at age 40",
      "url": "https://apnews.com/acdc37bed64444ee601b56f8cf5f965c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/341023d22e85497a86f8633623cd1294/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}