{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — The 2024 election will determine whether Donald Trump returns to the White House. It could also decide if he’ll face time behind bars.",
      "publishedAt": "2023-08-02T21:36:11Z",
      "title": "Should Trump go to jail? The 2024 election could become a referendum on that question",
      "url": "https://apnews.com/8677e1b31bbf3a29ee16fbf115c851a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f80bb8fa388c43c2ab144369c092c023/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Sudan's warring parties have committed extensive war crimes in the ongoing conflict, including deliberate killings of civilians and sexual assault, a leading rights group said Thursday.",
      "publishedAt": "2023-08-03T00:17:03Z",
      "title": "Rights group reports war crimes in Sudan, including deliberate attacks on civilians, sexual assault",
      "url": "https://apnews.com/05129daaa1f9daf73282a840bf328352",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d25dcf450a1745dbb4193d025e808313/3000.jpeg"
    },
    {
      "author": "PETER SMITH and MICHAEL RUBINKAM",
      "description": "PITTSBURGH (AP) — The gunman who stormed a synagogue in the heart of Pittsburgh’s Jewish community and killed 11 worshippers will be sentenced to death for perpetrating the deadliest antisemitic attack in U.S.",
      "publishedAt": "2023-08-02T13:16:17Z",
      "title": "Pittsburgh synagogue gunman will be sentenced to death for the nation’s deadliest antisemitic attack",
      "url": "https://apnews.com/27e3b1a505cacdd674ee9b8a179aa1a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8553bba786034ea39653cc5d35b97c82/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, HELENA ALVES and BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Pope Francis met with survivors of clergy sexual abuse in Portugal on Wednesday and blasted members of the country’s Catholic hierarchy for their response to the long-ignored scandal, which he said had marred the Catholic Church and helped drive the faithful away.",
      "publishedAt": "2023-08-02T03:35:32Z",
      "title": "Pope Francis blasts 'scandal' of clergy sex abuse in Portugal and meets with survivors",
      "url": "https://apnews.com/4db3ac2405da84abb9beced2b1f8b7c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/483fb0c53f664b998aba61c8029ce9c2/1920.jpeg"
    },
    {
      "author": "GENE JOHNSON and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A woman who escaped her kidnapper by punching her way out of a homemade cinder block cell at a home in southern Oregon likely saved other women from a similar fate, authorities said, by alerting them to a man they now suspect in sexual assaults in at least four more states.",
      "publishedAt": "2023-08-03T04:11:45Z",
      "title": "Woman's escape from cinder block cell likely spared others from similar 'nightmare,' FBI says",
      "url": "https://apnews.com/df4798fc7c34b827517b43c902c417e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91fdfcde40634f9199a6eba3fd34fd1c/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The vast majority of over 55 countries that made submissions to the U.N.’s highest judicial body which will give an advisory opinion on the legal consequences of Israel’s occupation of Palestinian territories supported the Palestinians view that Israel is taking over land they seek for an independent state, their U.N.",
      "publishedAt": "2023-08-03T04:15:33Z",
      "title": "Vast majority of submissions to UN body on Israeli occupation favor them, Palestinians say",
      "url": "https://apnews.com/d4b37335dd7964aa870d0f5cca39e7b1",
      "urlToImage": ""
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Niger's new military ruler lashed out at neighboring countries and the international community in a nationally televised speech Wednesday night, and he called on the population to be ready to defend the nation.",
      "publishedAt": "2023-08-02T07:52:19Z",
      "title": "Niger's military ruler warns against foreign meddling, urges population to defend the country",
      "url": "https://apnews.com/ca8ad99410a2f0e04a6a361595e4c768",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc5c0a1ac2314ec8939b4a18fbde38f3/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russian drones on Wednesday hit a Ukrainian port city along the border with Romania, causing significant damage and a huge fire at facilities that are key to Ukrainian grain exports.",
      "publishedAt": "2023-08-02T06:29:59Z",
      "title": "Russian drone strikes hit a Ukrainian port on Romania's border that is key to grain exports",
      "url": "https://apnews.com/8b20147a55f29a0c0bc465b59274357e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5edf72bb0044b3da4381ea4ceb9e9c2/1920.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Rhonda Hicks could have kept working into her 60s. She loved teaching and loved her students in Philadelphia’s public schools. As a Black woman, she took pride in being a role model for many children of color.",
      "publishedAt": "2023-08-02T04:06:06Z",
      "title": "Burnout, low pay and politics are driving away teachers. Turnover is soaring for educators of color",
      "url": "https://apnews.com/b0c39ec0d4320e12f2767a342e503f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e57956186d34032ab590a39b61678b1/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — At least 108 people were treated for heat-related illnesses at the World Scout Jamboree being held in South Korea, which is having one of its hottest summers in years.Most of them have recovered but at least two remain in treatment at an on-site hospital as of Thursday morning, said Choi Chang-haeng, secretary-general of the Jamboree’s organizing committee.",
      "publishedAt": "2023-08-03T02:40:32Z",
      "title": "108 attendees at the World Scout Jamboree treated for heat-related illnesses in South Korea",
      "url": "https://apnews.com/521a32d659ac6a34b7f909951a5f9d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13239d0a69a84a17863c64a19bdfdf0e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}