{
  "articles": [
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is taking an expansive, election-year step to offer relief to potentially hundreds of thousands of immigrants without legal status in the U.S.",
      "publishedAt": "2024-06-18T09:03:20Z",
      "title": "Half a million immigrants could eventually get US citizenship under new plan from Biden",
      "url": "https://apnews.com/69b9212c382d9bb265369b29b62622d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90d7384ade6f45f7bf5c640a6b510541/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Russian President Vladimir Putin thanked North Korea for supporting his actions in Ukraine and said their countries will cooperate closely to overcome U.S.-led sanctions as he headed to Pyongyang on Tuesday for a summit with North Korean leader Kim Jong Un.",
      "publishedAt": "2024-06-18T00:49:07Z",
      "title": "Before his summit with North Korea's Kim, Putin vows they'll beat sanctions together",
      "url": "https://apnews.com/05f0ed66f9978ac1ba34f2d708ad7504",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f047b6b2e34a414a89b445d948f3cb29/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean troops fired warning shots to repel North Korean soldiers who briefly crossed the rivals’ heavily fortified land border Tuesday for the second time this month, the South's military said.",
      "publishedAt": "2024-06-18T03:04:18Z",
      "title": "South Korean soldiers fire warning shots after North Korean troops cross border, apparently in error",
      "url": "https://apnews.com/2aa0eaef30dbc5801d5e787205b577a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65049d068ede48a0869454604fd16012/2000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Amos Hochstein, senior advisor to United States President Joe Biden, met with officials in Beirut on Tuesday in an effort to find a diplomatic solution to head off a larger war. Cross-border attacks by Israel and the Lebanese militant group Hezbollah have been taking place almost daily since the war in Gaza began in October and escalated dramatically a week ago, after Israel killed a high-ranking Hezbollah commander in a strike on south Lebanon.",
      "publishedAt": "2024-06-18T10:34:36Z",
      "title": "The Latest | A top US diplomat visits Beirut after attacks across Israel-Lebanon border intensify",
      "url": "https://apnews.com/696a6282721555c82c7c76a8cbe36840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c67f04d151784b67aaabd2d7f223f2a4/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Whether it’s a grinning Joe Biden as “Dark Brandon” or Donald Trump’s face superimposed onto a scene from HBO’s “Game of Thrones,” both presidential campaigns this year have embraced digital memes, the lingua franca of social media.",
      "publishedAt": "2024-06-18T04:08:47Z",
      "title": "The politics of memes: How Biden and Trump are fighting each other on the internet",
      "url": "https://apnews.com/2e31e2347d1045babf1229fe210dddf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3db20182751a4fbb83a925b01bf82da1/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "PITTSBURGH (AP) — Last week in Parkland, Florida, wrecking equipment began demolishing the building at Marjory Stoneman Douglas High School where a gunman's rampage in 2018 ended with 17 people dead.",
      "publishedAt": "2024-06-18T04:13:28Z",
      "title": "When violence and trauma visit American places, a complex question follows: Demolish, or press on?",
      "url": "https://apnews.com/3193ad66681eaffb4bf35188cfbe83cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38dea8691114427fa5e466e6e037f093/3000.jpeg"
    },
    {
      "author": "CORA LEWIS and LINLEY SANDERS",
      "description": "NEW YORK (AP) — Janille Williams wants to buy a house someday — but first, he has to pay down tens of thousands of dollars in medical debt. “I was hospitalized for a blood infection for three months more than ten years ago, and the bill was for more than $300,000,” said Williams, 38, a Fairbanks, Alaska, resident who works as a retail sales manager for AT&amp;T.",
      "publishedAt": "2024-06-18T04:03:05Z",
      "title": "Majority of Americans favor forgiving medical debt, AP-NORC poll finds",
      "url": "https://apnews.com/cc46b73d93dbf883ce9f9f2e07bbfcaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5750a75b9f49a5a77f14b9b9b70749/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Extreme heat alerts continued for tens of millions of people in the United States on Tuesday as cities including Chicago broke records at the start of a week of sweltering weather.",
      "publishedAt": "2024-06-18T04:25:14Z",
      "title": "Tens of millions in the US are under dangerous heat warnings",
      "url": "https://apnews.com/45df289d7da2107b272a3839f5828e2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202dc979802c414699adfa41339284b3/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Firefighters have increased their containment of a large wildfire that is burning in steep, hard-to-reach areas and threatening critical infrastructure in mountains north of Los Angeles, officials said.",
      "publishedAt": "2024-06-18T11:52:34Z",
      "title": "Firefighters gain ground against Southern California wildfire but face dry, windy weather",
      "url": "https://apnews.com/a50d782de700d079cd55f7be608af2c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0574fcc2e91147e7a2974ee1430161d8/3000.jpeg"
    },
    {
      "author": "KYLE HIGHTOWER",
      "description": "BOSTON (AP) — Jayson Tatum put his hands behind his head, with TD Garden fans standing on their feet cheering around him, and took it all in.Walking to the bench, he wrapped both arms around Celtics coach Joe Mazzulla.",
      "publishedAt": "2024-06-18T03:08:42Z",
      "title": "Celtics win 18th NBA championship with 106-88 Game 5 victory over Dallas Mavericks",
      "url": "https://apnews.com/0cdf7b0fb7bc641a5007c8dff836832a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/981126bad4a34baaad56c8de5864197f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}