{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — House Republicans clashed with Attorney General Merrick Garland on Wednesday, accusing him and the Justice Department of the “weaponization” of the department's work in favor of President Joe Biden 's son Hunter.",
      "publishedAt": "2023-09-20T09:02:56Z",
      "title": "House Republicans clash with Attorney General Garland, accusing him of favoring Hunter Biden",
      "url": "https://apnews.com/df70e290360cde444032f1b75343d941",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba8bb6ef78de47c0a9f8d832b7767e7f/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and AAMER MADHANI",
      "description": "NEW YORK (AP) — President Joe Biden raised “hard issues,” including protecting the “checks and balances” in a democracy, in a Wednesday meeting with Prime Minister Benjamin Netanyahu, pushing the Israeli leader to find a compromise on a judicial overhaul that has set off months of mass protests in Israel and concerns in Washington.",
      "publishedAt": "2023-09-20T04:07:22Z",
      "title": "Biden warns Netanyahu about the health of Israel's democracy and urges compromise on court overhaul",
      "url": "https://apnews.com/c6dab3cc0357f67b2054446f3c6cdc52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1784d791298f4fdebd998d44d19a167a/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "MAQUOKETA, Iowa (AP) — Donald Trump began a fall press Wednesday to lock in thousands of Republican caucusgoers in early-voting Iowa, where the former president faces sky-high expectations in his campaign for a White House comeback.",
      "publishedAt": "2023-09-20T19:17:00Z",
      "title": "Trump launches his fall push in Iowa to lock in his lead before the first Republican caucuses",
      "url": "https://apnews.com/075dad8a101cf106495974c846b1922c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21b7c881a6474228aebbe1eb769bb3fc/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — With no clear strategy, no sure support and not much time left to prevent a government shutdown, Speaker Kevin McCarthy nevertheless vowed on Wednesday he would not give up trying to convince his colleagues to pass a temporary funding bill through the House.",
      "publishedAt": "2023-09-20T16:58:22Z",
      "title": "Speaker McCarthy says there's still time to prevent a government shutdown as others look at options",
      "url": "https://apnews.com/13dea93fc1f7a7667608576bdf9c45e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7784f3cfcd142df9224def4dc230745/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "General Motors and Stellantis announced fresh layoffs Wednesday that they blamed on damage from the United Auto Workers strike, and the labor standoff grew more tense just two days before the union was expected to call for new walkouts.",
      "publishedAt": "2023-09-20T18:13:32Z",
      "title": "Jeep maker Stellantis makes a new contract offer as auto workers prepare to expand their strike",
      "url": "https://apnews.com/dce8eb39a1e36f2cc54a5c1e4210e1f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/265c8c5236004475859ff547138545f8/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is creating the first-ever federal office of gun violence prevention, according to two people familiar with the plans. The office will coordinate efforts across the federal government and will offer help and guidance to states struggling with increasing gun violence, while taking the lead on implementation of the bipartisan gun legislation signed into law last year.",
      "publishedAt": "2023-09-20T19:40:43Z",
      "title": "White House to announce first-ever federal office of gun violence prevention, AP sources say",
      "url": "https://apnews.com/d5c710e2051b220457ce95ac1c8ac1fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61354a3a364d49fabe9da43a8c7df346/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — A growing number of Americans are finding it difficult to afford insurance on their homes, a problem only expected to worsen because insurers and lawmakers have underestimated the impact of climate change, a new report says.",
      "publishedAt": "2023-09-20T04:01:40Z",
      "title": "Homeowners face rising insurance rates as climate change makes wildfires, storms more common",
      "url": "https://apnews.com/9c7129881f12ec478386e4b47c1acbbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea95f295ffa847709a04ee84cb13510b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — The Biden administration announced Wednesday that it is providing $600 million in funding to produce new at-home COVID-19 tests and is restarting a website allowing Americans to again order up to four free tests per household — aiming to prevent possible shortages during a rise in coronavirus cases that has typically come during colder months.",
      "publishedAt": "2023-09-20T19:00:20Z",
      "title": "Biden administration announces $600M to produce COVID tests and will reopen website to order them",
      "url": "https://apnews.com/6de740359e7648a85184dcac47aa96fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ed49de22b64037a921f639c4777054/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "KANSAS CITY NATIONAL SECURITY CAMPUS, Mo. (AP) — In an ultra-sterile room at a secure factory in Kansas City, U.S. government technicians refurbish the nation’s nuclear warheads. The job is exacting: Each warhead has thousands of springs, gears and copper contacts that must work in conjunction to set off a nuclear explosion.",
      "publishedAt": "2023-09-20T04:02:40Z",
      "title": "Inside the delicate art of maintaining America's aging nuclear weapons",
      "url": "https://apnews.com/6b86198def4516cebe496c9f5fbfbb75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78118d2bdef540b8a2e44f3e36bc4867/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The Federal Reserve left its key interest rate unchanged Wednesday for the second time in its past three meetings, a sign that it’s moderating its fight against inflation as price pressures have eased.",
      "publishedAt": "2023-09-20T04:01:21Z",
      "title": "Fed keeps rates unchanged but signals likelihood of another hike this year to fight inflation",
      "url": "https://apnews.com/ee43601f41a86245c0705fe99df89f55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0ba3f049c284b809769bfc61a153c86/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}