{
  "articles": [
    {
      "author": "Jack Brook",
      "description": "Minnesota's governor says federal officers have shot another person in Minneapolis amid the Trump administration’s immigration crackdown.Democratic Gov. Tim Walz said in a social media post that he had been in contact with the White House after the shooting. He called on the President Donald Trump to end the crackdown in his state. The details surrounding the shooting weren’t immediately clear. On Friday, thousands of demonstrators protesting the crackdown on immigrants crowded the city’s streets in frigid weather, calling for federal law enforcement to leave.",
      "publishedAt": "2026-01-24T16:24:21Z",
      "title": "Person shot in Minneapolis amid immigration crackdown, governor says",
      "url": "https://apnews.com/article/immigration-enforcement-minnesota-4d1499fc5962ab880f3816259e04bdbf",
      "urlToImage": "https://dims.apnews.com/dims4/default/96f8940/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F86%2F3e909515d4b63bfb6602e1d579da%2F7d27b2ced72c4d939773d8500aff104d"
    },
    {
      "author": "Emilie Megnien, Jeff Amy, Jamie Stengle",
      "description": "More than 8,000 flights have been canceled across the U.S. as a major storm expected to wreak havoc across much of the country bears down. The storm threatens to knock out power for days and snarl major roadways. Roughly 140 million people were under a winter storm warning from New Mexico to New England. The National Weather Service forecast warns of widespread heavy snow and a band of catastrophic ice stretching from east Texas to North Carolina. The edge of the storm was sending freezing rain and sleet into parts of Texas on Friday night, while snow and sleet were falling in Oklahoma.",
      "publishedAt": "2026-01-24T06:17:53Z",
      "title": "Thousands of flights canceled as major winter storm bears down",
      "url": "https://apnews.com/article/storm-texas-oklahoma-ice-snow-a94c9d155615333a50e174a4d7d54fc1",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4362d3/2147483647/strip/true/crop/3500x2332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F47%2Fe5484277715eb31adddef4f80718%2Fbbcf605b274f4ee2bcb9973af1b70389"
    },
    {
      "author": "Michelle L. Price",
      "description": "President Donald Trump is threatening to impose a 100% tariff on goods imported from Canada if America’s northern neighbor goes ahead with its trade deal with China. Trump said in a social media post that if Canadian Prime Minister Mark Carney “thinks he is going to make Canada a “Drop Off Port” for China to send goods and products into the United States, he is sorely mistaken.” Canada this month negotiated a deal to lower tariffs on Chinese electric vehicles in return for lower import taxes on Canadian farm products. Trump initially had said that agreement was what Carney “should be doing and it’s a good thing for him to sign a trade deal.”",
      "publishedAt": "2026-01-24T14:24:42Z",
      "title": "Trump threatens Canada with 100% tariffs over its new trade deal with China",
      "url": "https://apnews.com/article/trump-canada-carney-china-tariffs-5079e910df071b45d2b16949efb8f11a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c234b3/2147483647/strip/true/crop/7500x4997+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F21%2F1fbbe252637b06cddd1f4cbb341f%2F41fc65f26fe940a6884dff35b4f1dfd4"
    },
    {
      "author": null,
      "description": "Russian attacks on Ukraine killed one person and wounded 18 overnight, as negotiators from Ukraine, Russia and the United States were set to met in Abu Dhabi for a second day of talks aimed at ending Moscow’s nearly four-year invasion. One person died and four were wounded in Kyiv, while 14 were wounded in Kharkiv, Ukrainian officials said Saturday. The UAE-hosted talks mark the first known instance of Trump administration officials meeting with both countries. The White House called the first day productive. Ukrainian President Volodymyr Zelenskyy said a peace deal was “nearly ready,” though territorial disputes remain unresolved.",
      "publishedAt": "2026-01-24T07:21:21Z",
      "title": "Russian attacks on Ukraine kill 1 and wound 18 ahead of second day of peace talks",
      "url": "https://apnews.com/article/russia-ukraine-trump-putin-witkoff-kushner-zelenskyy-a77eadb50780c3d22882c42ea4764a54",
      "urlToImage": "https://dims.apnews.com/dims4/default/c25220f/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F6e%2F0ad818e2d97510ea6855f9045a71%2F2ba21e34cbda4dc1bd74c2f50feb413c"
    },
    {
      "author": "Samy Magdy, Wafaa Shurafa",
      "description": "American officials have met with Prime Minister Benjamin Netanyahu, urging Israel to advance the ceasefire in Gaza. Netanyahu met with President Trump's envoy Steve Witkoff and Jared Kushner. The U.S. is eager to keep the Trump-brokered deal moving, but Netanyahu faces pressure not to progress until Hamas returns the body of the last hostage. Meanwhile, Egypt's foreign minister is pushing for the Rafah border crossing to open. On Saturday, an Israeli strike killed two Palestinian children in Gaza. The children were searching for firewood. The Israeli military said it targeted militants, not children.",
      "publishedAt": "2026-01-24T15:35:18Z",
      "title": "American officials urge Netanyahu to advance Gaza ceasefire deal",
      "url": "https://apnews.com/article/israel-gaza-war-trump-news-01-24-2026-90e36ca7d2e27ca8a21d1727e9e0119f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4fe8cda/2147483647/strip/true/crop/6085x4055+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Ff6%2Ff5281e995887ef21c9eef8ed11cf%2F7750d9a2106942558e0bc15b62bcb0c7"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Iran’s Revolutionary Guard commander warns the US, says his force has its ‘finger on the trigger’",
      "url": "https://apnews.com/article/iran-protests-trump-revolutionary-guard-059ba55b8e169d57f978fc3c52ccd05a",
      "urlToImage": null
    },
    {
      "author": "Brian Slodysko",
      "description": "President Donald Trump’s federal housing finance director, Bill Pulte, quietly granted government-backed lenders the authority to nearly double a $200 billion bond purchase that Trump ordered to try to lower mortgage rates. That’s according to an email obtained by The Associated Press. The move could introduce a new level of risk for the companies. The purchasing rule changes would reverse nearly two decades of bipartisan consensus that limits should be imposed after the government bailed out Fannie Mae and Freddie Mac in the aftermath of the financial crisis of 2008-09. That crisis led to to them being placed into a government conservatorship.",
      "publishedAt": "2026-01-24T13:21:43Z",
      "title": "Pulte OKs more mortgage spending, adding risk for government-backed lenders",
      "url": "https://apnews.com/article/pulte-mortgages-bonds-fannie-mac-freddie-mae-bd96e67f56910cbda81b7b9b3a54516c",
      "urlToImage": "https://dims.apnews.com/dims4/default/43dc9c8/2147483647/strip/true/crop/5866x3909+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F8d%2F1eff5046013c6a2403ff49a3ddc0%2F4b8906cde6da413eb7a2d8a34ebc1ad5"
    },
    {
      "author": "Thomas Beaumont",
      "description": "There's a debate set in Republican-heavy Texas where two Democratic politicians are competing to be their party's Senate nominee. Jasmine Crockett and James Talarico are facing off Saturday afternoon during the Texas AFL-CIO’s political convention. Crockett is a 44-year-old Dallas civil rights lawyer and former public defender who's in her second term in Congress. Talarico is a state representative and former teacher. The primary is March 3. They're running for the seat held by John Cornyn. The four-term Republican senator is facing two challengers in the GOP primary. Democrats are trying to regain a Senate majority, but Texas hasn't elected a Democrat to statewide office in 30-plus year.",
      "publishedAt": "2026-01-24T14:46:18Z",
      "title": "Crockett and Talarico set for Senate debate as Democrats aim for Texas gain",
      "url": "https://apnews.com/article/jasmine-crockett-talarico-texas-senate-debate-cornyn-45f0cc709b8c38d884e07d1b05bf1e54",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8c9b83/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F7d%2F2e667ab1eafbdfd846b4d466851f%2F346d1a2031594972b0da875fb403a41f"
    },
    {
      "author": "Jack Brook",
      "description": "As more than 2,000 federal agents surge in Minneapolis in an immigration crackdown and clash with protesters on the streets, countless residents are also quietly resisting the operation through grassroots networks sheltering and supporting immigrants. Former Trump supporter Feliza Martinez is rallying volunteers to support immigrant children with food, financial support and shelter. Earlier this month, Martinez relocated a family of 10 to a safe house in south Minneapolis after their Ecuadorian mother was detained for illegally entering the country in 2022. Federal agents have pursued her children, and the older siblings fear they will be separated from their 5-month-old U.S. citizen brother.",
      "publishedAt": "2026-01-24T13:26:15Z",
      "title": "Minneapolis volunteers shelter immigrant children sought by ICE",
      "url": "https://apnews.com/article/minneapolis-ice-family-separation-children-8aeb8fa3ecd86f489e21c71f659cc9fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e97cc7/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2F9c%2F67d7d5de9f35d7ef041b6f18d6a9%2F9d4008f71607483cbd051486e67875aa"
    },
    {
      "author": "Rio Yamat, Ap Airlines, Travel Writer",
      "description": "Bad weather can derail even the best-laid travel plans. When that happens, U.S. airlines must provide refunds for canceled flights. If winter weather is expected, airlines might also allow you to postpone your trip without fees. If your flight is canceled, airlines usually rebook for free, but availability can be limited during peak times. You're entitled to a full refund if you choose not to travel or find a different way to get to your destination, but airlines aren’t required to cover lodging or meals for stranded passengers. Booking a backup flight if forecasts look bad is another option because some airlines offer full refunds as long as a passenger cancels within 24 hours of booking.",
      "publishedAt": "2026-01-24T07:49:33Z",
      "title": "What to do if winter weather disrupts your travel plans",
      "url": "https://apnews.com/article/flight-delays-cancellations-winter-weather-travel-eac0c8a540d5cb50ed4cff70eb49072e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a38ad88/2147483647/strip/true/crop/3709x2471+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F3c%2F70068fb8559ab3cd13ef0063edd3%2F48e16d7d5d7c41cbb2e215f8c7345c47"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}