{
  "articles": [
    {
      "author": "JAIMIE DING, CHRISTOPHER WEBER and JULIE WATSON",
      "description": "LOS ANGELES (AP) — Wildfires tore across the Los Angeles area with devastating force Wednesday after setting off a desperate escape from burning homes through flames, ferocious winds and towering clouds of smoke.",
      "publishedAt": "2025-01-08T05:03:07Z",
      "title": "Thousands flee as wildfires burn out of control in and around Los Angeles and homes are destroyed",
      "url": "https://apnews.com/b565a3bd043d6444820f1571b2307bf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa71cb28f7f548f58df874954a72c9d6/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and MARK SHERMAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is asking the Supreme Court to call off Friday's sentencing in his hush money case in New York.",
      "publishedAt": "2025-01-08T13:20:36Z",
      "title": "Trump asks the Supreme Court to block sentencing in his hush money case in New York",
      "url": "https://apnews.com/4e7335283e578d996c8464c4dd2b6a65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/143ae1db918440a58ec7e4f29165d2d5/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "PALM BEACH, Fla. (AP) — President-elect Donald Trump on Tuesday said he would not rule out the use of military force to seize control of the Panama Canal and Greenland, as he declared U.S.",
      "publishedAt": "2025-01-07T17:14:56Z",
      "title": "Trump refuses to rule out use of military force to take control of Greenland and the Panama Canal",
      "url": "https://apnews.com/fa66f8d072eb39c00a8128a8941ede75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31b6feeeac2944628d324e6fcdcd5395/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and BEN FINLEY",
      "description": "NORFOLK, Va. (AP) — A developing winter storm threatens to drop snow, sleet and freezing rain on parts of Texas, Oklahoma and Arkansas as frigid air that escaped the Arctic plunges temperatures to subfreezing levels in some of the southernmost points of the U.S.",
      "publishedAt": "2025-01-08T05:08:04Z",
      "title": "Southern US shivers as new winter storm threatens snow for Texas, Oklahoma and Arkansas",
      "url": "https://apnews.com/d6c60eae12872176d6eb3bc2f8a1e559",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1615cfdad45243eaa5adc1bf36b79134/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU and CHRISTOPHER BODEEN",
      "description": "BEIJING (AP) — Rescuers in the freezing, high-altitude Tibet region in western China searched a second day for any remaining victims of a deadly earthquake that struck near a holy city for Tibetan Buddhists, before shifting their focus to resettling the survivors.",
      "publishedAt": "2025-01-08T04:13:42Z",
      "title": "Tents arrive for survivors of a quake that killed 126 in freezing, high-altitude Tibet",
      "url": "https://apnews.com/59a9f2e80c4ccede1ffcd962eb3e4488",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76f6cf7a008f45519563b646cf87e65a/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — When Luis Har was kidnapped by Hamas-led militants on the warm morning of Oct. 7, 2023, he was forced into Gaza wearing shorts and a T-shirt. As his captivity stretched into weeks and then months, the cold, wet winter set in, bringing along with it a dread he had never endured before.",
      "publishedAt": "2025-01-08T05:08:47Z",
      "title": "Hostages in Gaza endure another winter as their families plead for a ceasefire",
      "url": "https://apnews.com/42b21cff477227a7d65bbc30c0bb83fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77791bf5c9264dffbe9c176046c9ae34/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — President Jimmy Carter will lie in state for a second day Wednesday after his remains arrived in Washington a day earlier as part of state funeral rites.",
      "publishedAt": "2025-01-08T05:05:12Z",
      "title": "Jimmy Carter continues to lie in state at Capitol Rotunda ahead of his state funeral",
      "url": "https://apnews.com/56e1bed46f0ecb8af343c46d7e99a734",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b96cc6c69904d42a24a6fa7897ecfbd/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — The world knew Jimmy Carter as a president and humanitarian, but he also was a woodworker, painter and poet, creating a body of artistic work that reflects deeply personal views of the global community — and himself.",
      "publishedAt": "2025-01-08T05:06:32Z",
      "title": "Jimmy Carter's woodworking, painting and poetry reveal an introspective Renaissance Man",
      "url": "https://apnews.com/9193a8084f6beb8b3a4ebc718a956475",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f19d99bae90140268704fa9d94f168e0/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis on Monday named the first woman to head a major Vatican office, appointing an Italian nun, Sister Simona Brambilla, to become prefect of the department responsible for all the Catholic Church's religious orders.",
      "publishedAt": "2025-01-06T12:22:56Z",
      "title": "Pope Francis has named the first woman to head a major Vatican office, choosing an Italian nun",
      "url": "https://apnews.com/cf2602d26d3ec84a7993f872916b1b89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cad039ea3b784c669165a49d99f045c0/3000.jpeg"
    },
    {
      "author": "GIOVANNA DELL'ORTO",
      "description": "MAPLE GROVE, Minn. (AP) — Ice crystals clung to the eyelashes, parka hood, beanie hat and headscarf of Ruqayah Nasser as she took a break after her first-ever snow tubing runs in a Minnesota park on a subzero (-18 Celsius) January morning.",
      "publishedAt": "2025-01-08T13:18:54Z",
      "title": "Scarves over headscarves, Muslim women’s outdoors group tackles snow tubing in Minnesota",
      "url": "https://apnews.com/7c29def2171de0f41f60936c4568e011",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/375df049a9d949bea4b4e32ee771d210/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}