{
  "articles": [
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Hamas leader Ismail Haniyeh was killed by a predawn airstrike in the Iranian capital Wednesday, Iran and the militant group said, blaming Israel for a shock assassination that risks escalating the conflict even as the U.S.",
      "publishedAt": "2024-07-31T03:09:49Z",
      "title": "Hamas leader Ismail Haniyeh is killed in Iran by an alleged Israeli strike, threatening escalation",
      "url": "https://apnews.com/30968a7acb31cd8b259de9650014b779",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0d893a82cca4eab9ed3b201c9f661f5/2500.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Ismail Haniyeh, Hamas’ top leader in exile who landed on Israel’s hit list after the militant group staged its surprise Oct. 7 attacks, was killed in an airstrike in the Iranian capital early Wednesday.",
      "publishedAt": "2024-07-31T07:42:08Z",
      "title": "Ismail Haniyeh, Hamas leader on Israel's hit list since Oct. 7, is killed in an airstrike at 62",
      "url": "https://apnews.com/2d16ae7ed668b954ac0e7a53eaf92671",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde6d04618b24e52a6a197910b909d6a/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — The U.N. human rights office issued a report Wednesday saying Palestinians detained by Israeli authorities since the Oct.",
      "publishedAt": "2024-07-31T06:11:35Z",
      "title": "UN report says Palestinians detained by Israeli authorities since Oct. 7 faced torture, mistreatment",
      "url": "https://apnews.com/db4555b8ba44e23d445550b10f4c35ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a90ad0be6377466fa0b0e61038906332/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is facing the delicate task of calibrating her policy pitch to American voters, a standard task for any White House hopeful but one that comes with additional challenges this year.",
      "publishedAt": "2024-07-31T04:12:04Z",
      "title": "Harris is calibrating her policy pitch for going to battle with Trump",
      "url": "https://apnews.com/f93611f3e83adf48738bfb7aefc427f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a598aecb953c47f5a223a8d6f0b831c5/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Hundreds of rescue workers searched through mud and debris Wednesday from multiple landslides that have killed at least 151 people in southern India, police said.The landslides occurred after torrential rains triggered torrents of mud and water that swept through tea estates and villages.",
      "publishedAt": "2024-07-31T02:04:59Z",
      "title": "Rescuers search through mud and debris as deaths rise to 151 in landslides in southern India",
      "url": "https://apnews.com/b32045fc9bf86b7500333eeb3311cef7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f420b0b0e06646adbd773314d1a94763/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, GISELA SALOMON and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The Carter Center said it was unable to verify the results of Venezuela's presidential election, blaming authorities for a “complete lack of transparency” in declaring Nicolas Maduro the winner without providing any individual polling tallies.",
      "publishedAt": "2024-07-30T15:04:38Z",
      "title": "Carter Center unable to verify Venezuela election results, blasts officials for lack of transparency",
      "url": "https://apnews.com/3ec88b273cabfee8e5696ff67d24186d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccb6a6988be9435bac989bc0072fac7c/1920.jpeg"
    },
    {
      "author": "MARIAM FAM and SALAR SALIM",
      "description": "DOHUK, Iraq (AP) — The day they came to take her children, the young mother bundled them up against the cold. She asked her nearly 6-year-old son to take care of his younger sister.“Don’t let anyone hit her,” she told the boy.",
      "publishedAt": "2024-07-31T05:44:17Z",
      "title": "She became a mother after Islamic State captivity. A decade on, Yazidi community shuns her children",
      "url": "https://apnews.com/c68c45c2ede0379658d22407cf1b72c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a3834ac511f42359eb144d33f6726c6/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — In the months leading up to elections for the European Parliament, Hungarians were warned that casting a ballot against Prime Minister Viktor Orbán would be a vote for all-out war.",
      "publishedAt": "2024-07-31T04:48:32Z",
      "title": "How Hungary's Orbán uses control of the media to escape scrutiny and keep the public in the dark",
      "url": "https://apnews.com/f6315d7cc252f210c360863de403054e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db2f3195a152460c8b64fe2fa139c4f3/2820.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — A local storm Wednesday interrupted all high-speed train traffic connecting Paris to the southeast of the country as well as Switzerland in both directions, France's rail company said, leaving thousands of travelers stranded amid the Olympics and departures for summer vacation.",
      "publishedAt": "2024-07-31T10:48:25Z",
      "title": "Local storm disrupts high-speed trains from Paris, leaving travelers stranded during Olympics",
      "url": "https://apnews.com/4122456516b7becece372a4019cc313b",
      "urlToImage": ""
    },
    {
      "author": "KATE BRUMBACK and PAT GRAHAM",
      "description": "PARIS (AP) — After days of water-quality concerns caused by heavy rains last week put the swimming portion of the Olympic triathlons in doubt, the women dove into the Seine River early Wednesday, followed by the men a few hours later.",
      "publishedAt": "2024-07-31T02:08:53Z",
      "title": "Olympic triathletes swim in Seine River after days of concerns about water quality",
      "url": "https://apnews.com/358b29063ac00253c072290281043eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9eb891efd7a64e9ab95f359c5f91d0fe/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}