{
  "articles": [
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 39 people were killed by Israeli strikes across northern Gaza on Saturday, as rescue workers scrambled to find survivors beneath the rubble, according to Palestinian and hospital officials.",
      "publishedAt": "2024-06-22T07:56:53Z",
      "title": "At least 39 people killed in Israeli strikes across northern Gaza, officials say",
      "url": "https://apnews.com/39d09eccc39a7f225d573c97e73a2917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dda60e44b1e347d8921797e74e603e87/1920.jpeg"
    },
    {
      "author": "ED WHITE and JOHN HANNA",
      "description": "Floodwaters forced people out of their homes in parts of Iowa, the result of weeks of rain, while much of the United States longed for relief Saturday from yet another round of extraordinary heat.Sirens blared at 2 a.m.",
      "publishedAt": "2024-06-22T16:06:22Z",
      "title": "Flooding forces people from homes in some parts of Iowa while much of US broils again in heat",
      "url": "https://apnews.com/3c96b904f1ccb4725ac856aa450180be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8409ec92d1cd42cdbe47d501401b859a/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Behind the smiles, the balloons and the red-carpet pageantry of President Vladimir Putin's visit to North Korea last week, a strong signal came through: In the spiraling confrontation with the U.S.",
      "publishedAt": "2024-06-23T04:02:41Z",
      "title": "With its new pact with North Korea, Russia raises the stakes with the West over Ukraine",
      "url": "https://apnews.com/556492779b6a32c4cf74b992741d91a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32ec843d9bef4a9fa223625a2ad9baa6/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — A nuclear-powered U.S. aircraft carrier arrived Saturday in South Korea for a three-way exercise involving Japan as they step up military training to cope with North Korean threats, which have escalated following a security pact with Russia.",
      "publishedAt": "2024-06-22T07:52:32Z",
      "title": "US aircraft carrier arrives in South Korea as a show of force against nuclear-armed North Korea",
      "url": "https://apnews.com/26fd868eab68e56b207f4e6b1ecf45c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8f07622722b41fab8ca16d9e0166e88/3000.jpeg"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "RUIDOSO, N.M. (AP) — Federal authorities offered a reward for information about those responsible for igniting a pair of New Mexico wildfires that killed two people and destroyed hundreds of homes in the past week.",
      "publishedAt": "2024-06-22T18:56:40Z",
      "title": "FBI offers reward for information about deadly southern New Mexico wildfires",
      "url": "https://apnews.com/765b87c261012abe4f6dcc73b7814454",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dbe185b4be64cd2b9a86dd6994341fb/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An attack by Yemen's Houthi rebels targeted a commercial ship traveling through the Gulf of Aden but apparently caused no damage, authorities said Saturday, in the latest strike on the shipping lane by the group.",
      "publishedAt": "2024-06-22T04:38:14Z",
      "title": "Yemen's Houthi rebels target ship in the Gulf of Aden as the Eisenhower aircraft carrier heads home",
      "url": "https://apnews.com/ffe35adc91e25379c0c6fd420b413099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05cc162bf78341c9a564bea53a3f6568/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KHARKIV REGION, Ukraine (AP) — Weeks after the decision allowing Ukraine to use U.S.-supplied weapons for limited strikes in Russian territory, the country is having some success in halting Russia’s new push along the northeast front, but military commanders are clamoring for restrictions on long-range missiles to be lifted.",
      "publishedAt": "2024-06-22T14:11:39Z",
      "title": "As U.S.-supplied weapons show impact inside Russia, Ukrainian soldiers hope for deeper strikes",
      "url": "https://apnews.com/7f061044c7b50a1946409eea9e9c399f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1df04d17ec774d918fb2a8a561a4f262/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — Donald Trump told a group of evangelicals they “cannot afford to sit on the sidelines” of the 2024 election, imploring them at one point to “go and vote, Christians, please!\"",
      "publishedAt": "2024-06-22T04:04:03Z",
      "title": "Trump endorses Ten Commandments in schools, implores evangelical Christians to vote in November",
      "url": "https://apnews.com/042cd25750a43a1f9a474e793c86c0a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70c5bf9220be401d82011f737cfb4560/1920.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI, CHRISTINE FERNANDO and LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — Tucked inside the West Virginia Statehouse is a copy of a petition to lawmakers with a simple request: Let the voters decide whether to reinstate legal access to abortion.The request has been ignored by the Republican lawmakers who have supermajority control in the Legislature and banned abortions in the state in 2022, shortly after the U.S.",
      "publishedAt": "2024-06-23T04:14:35Z",
      "title": "Abortion access has won when it's been on the ballot. That’s not an option for half the states",
      "url": "https://apnews.com/9e8ac1f146c674bee965c5528a6e55a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/862e49fcd13f4cf5afe9878c4e0f1a2a/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "EUGENE, Ore. (AP) — Two steps before she reached the finish line, Sha’Carri Richardson started pounding her chest.She knew she had it won. Anyone who doesn’t see her as the sprinter to beat later this summer at the Paris Olympics should probably think again.",
      "publishedAt": "2024-06-23T01:09:42Z",
      "title": "Sha'Carri Richardson sprints onto US Olympic team after winning 100 in 10.71 seconds",
      "url": "https://apnews.com/9fc877483f65ef85fc5c821273470cd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43bfd755777d4f49b187b0485a91c243/2708.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}