{
  "articles": [
    {
      "author": "SETH BORENSTEIN",
      "description": "Climate change will reduce future global income by about 19% in the next 25 years compared to a fictional world that's not warming, with the poorest areas and those least responsible for heating the atmosphere taking the biggest monetary hit, a new study said.",
      "publishedAt": "2024-04-17T15:00:54Z",
      "title": "New study calculates climate change's economic bite will hit about $38 trillion a year by 2049",
      "url": "https://apnews.com/3e21addee3fe328f38b771645e237ff9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b32d8f5771d44595900df59bdeba500a/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The Senate dismissed all impeachment charges against Homeland Security Secretary Alejandro Mayorkas on Wednesday, ending the House Republican push to remove the Cabinet secretary from office over his handling of the the U.S.-Mexico border and shutting down his trial before arguments even began.",
      "publishedAt": "2024-04-17T04:15:19Z",
      "title": "Senate rejects impeachment articles against Mayorkas, ending trial against Cabinet secretary",
      "url": "https://apnews.com/29aa775c0e866f4160f320583f261a72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3974585fb522463cbf877bf0ab35f4b9/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "The U.S. Justice Department has agreed to pay approximately $100 million to settle claims with about 100 people who say they were sexually assaulted by sports doctor Larry Nassar, a source with direct knowledge of the negotiations told The Associated Press on Wednesday.",
      "publishedAt": "2024-04-17T23:00:41Z",
      "title": "Lawyers for Nassar assault survivors have reached $100M deal with Justice Department, AP source says",
      "url": "https://apnews.com/e3a2759d2f33eeafcfb8d5d49cc947f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da5bbc36793b4dfe9ef264efd5d77556/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER, REBECCA BOONE, CLAUDIA LAUER and CHRISTOPHER L. KELLER",
      "description": "HONOLULU (AP) — As wildfires ripped across Maui last August, the head of the emergency management agency dragged his heels about returning to the island amid the unfolding crisis, while a broad communications breakdown left authorities in the dark and residents without emergency alerts, according to a report released Wednesday.",
      "publishedAt": "2024-04-17T04:27:59Z",
      "title": "Communications breakdown left authorities in the dark and residents without alerts amid Maui fire",
      "url": "https://apnews.com/e07c65633a377135e9163a6ec6aebdb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78beb6b3bb61457b990539e916d46d59/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s legal team says it tried serving Stormy Daniels a subpoena as she arrived for an event at a bar in Brooklyn last month, but the porn actor, who is expected to be a witness at the former president's criminal trial, refused to take it and walked away.",
      "publishedAt": "2024-04-17T22:25:43Z",
      "title": "Trump lawyers say Stormy Daniels refused subpoena outside a Brooklyn bar, papers left 'at her feet'",
      "url": "https://apnews.com/d3dce88566bafb714dbb5c1acd3e4a83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7026680d5fd4d4483381eb3aa9877d8/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu said Wednesday his country would be the one to decide whether and how to respond to Iran’s major air assault earlier this week, brushing off calls for restraint from close allies.",
      "publishedAt": "2024-04-17T09:36:42Z",
      "title": "Netanyahu brushes off calls for restraint, saying Israel will decide how to respond to Iran's attack",
      "url": "https://apnews.com/32b1875bcf167b17ed28172f7146eaf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/280ebf81022b473e8654232b8d043ba0/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson has unveiled a long-awaited package of bills that will provide military aid to Ukraine and Israel, replenish U.S.",
      "publishedAt": "2024-04-17T22:50:19Z",
      "title": "What's inside the $95 billion House package focused on aiding Ukraine and Israel",
      "url": "https://apnews.com/9097da3511a7cd9b0e9a7b9ce52141b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c7134d2ab6b446db4d5dfe466601bef/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and WILL WEISSERT",
      "description": "PITTSBURGH (AP) — President Joe Biden promised cheering, unionized steelworkers on Wednesday that his administration would block the acquisition of U.S. Steel by a Japanese company, and he called for a tripling of tariffs on Chinese steel, seeking to use trade policy to win over working-class votes in the battleground state of Pennsylvania.",
      "publishedAt": "2024-04-17T09:02:30Z",
      "title": "Biden vows to shield US steel industry by blocking Japanese merger and seeking new Chinese tariffs",
      "url": "https://apnews.com/0399b0450b67086ca86edc43ac45e5e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d66ea0a98174251a10929c58f4d0cd2/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "An engineer at Boeing said Wednesday that the aircraft company, in rushing to produce as many planes as possible, is taking manufacturing shortcuts that could lead to jetliners breaking apart.",
      "publishedAt": "2024-04-17T04:01:39Z",
      "title": "Boeing put under Senate scrutiny during back-to-back hearings on aircraft maker's safety culture",
      "url": "https://apnews.com/f8354ddddc6372e3337cd74b9ea264e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c352c7059ce4dd39e2a5670ea8b8b3e/1920.jpeg"
    },
    {
      "author": "TOM KRISHER, STAN CHOE and MICHELLE CHAPMAN",
      "description": "DETROIT (AP) — Tesla is asking shareholders to restore a $56 billion pay package for CEO Elon Musk that was rejected by a Delaware judge this year, and to shift the company's corporate home to Texas.",
      "publishedAt": "2024-04-17T11:22:12Z",
      "title": "Tesla asks shareholders to restore $56B Elon Musk pay package that was voided by Delaware judge",
      "url": "https://apnews.com/ef5e30f6b56f7d936f8c882fc1c96875",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f014d8966e4711baf2401ca29e7f70/2961.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}