{
  "articles": [
    {
      "author": "HANNA ARHIROVA and ANTON SHTUKA",
      "description": "KYIV, Ukraine (AP) — Russia fired more than two dozen missiles at Kyiv before dawn on Thursday, attacking the Ukrainian capital for the first time in six weeks and sending panicked residents flooding into the relative safety of the subway system in a scene reminiscent of the first weeks of the war.",
      "publishedAt": "2024-03-21T08:01:50Z",
      "title": "Russia fires 31 missiles at Kyiv in the first attack in weeks as people scramble for cover in subway",
      "url": "https://apnews.com/384e883b85c1e0689a3165830ca440c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/575897cbcf914360b4724bba026b4e0e/1920.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "JERUSALEM (AP) — A 12-year-old boy in east Jerusalem lights the fuse of a long firework and hoists it in the air. Then, just before it explodes and illuminates the night sky with a burst of red, he is shot in the chest by Israeli police and falls to the ground.",
      "publishedAt": "2024-03-21T05:08:46Z",
      "title": "A firework is lit, a boy is shot. Israel’s use of deadly force against Palestinians is scrutinized",
      "url": "https://apnews.com/600690541cc356f7648ff6c3a2091004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8b06a10dd914670b3952ff743dbc01f/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE, LINDSAY WHITEHURST and MIKE BALSAMO",
      "description": "WASHINGTON (AP) — The Justice Department on Thursday announced a sweeping antitrust lawsuit against Apple, accusing the tech giant of engineering an illegal monopoly in smartphones that boxes out competitors and stifles innovation.",
      "publishedAt": "2024-03-21T14:32:47Z",
      "title": "Apple has kept an illegal monopoly over smartphones in US, Justice Department says in antitrust suit",
      "url": "https://apnews.com/822d7e8f5cf53a2636795fcc33ee1fc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7409b273fe0497eaa56ad5f3ed44e6d/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Lawmakers introduced a $1.2 trillion spending package Thursday that sets the stage for avoiding a partial government shutdown for several key federal agencies this weekend and allows Congress, nearly six months into the budget year, to complete its work in funding the government through September.",
      "publishedAt": "2024-03-21T14:10:33Z",
      "title": "Congress unveils $1.2 trillion plan to avert federal shutdown and bring budget fight to a close",
      "url": "https://apnews.com/3b4e61cf5eaaf0f7fbeeddbacdf57212",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e7222fb3d248d0b87ae1d07cd1ed2a/3000.jpeg"
    },
    {
      "author": "PETER SMITH and TIFFANY STANLEY",
      "description": "Since the start of his political career, Donald Trump has played on stereotypes about Jews and politics.He told the Republican Jewish Coalition in 2015 that “you want to control your politicians” and suggested the audience used money to exert control.",
      "publishedAt": "2024-03-21T14:28:37Z",
      "title": "US Jews upset with Trump's latest rhetoric say he doesn't get to tell them how to be Jewish",
      "url": "https://apnews.com/a43bf6f6266d9c6a4b761b82281aa512",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc4baa0fe10f4cf0a08e7e39ab4a63b3/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Doctors in Boston announced Thursday they have transplanted a pig kidney into a 62-year-old patient.Massachusetts General Hospital said it’s the first time a genetically modified pig kidney has been transplanted into a living person.",
      "publishedAt": "2024-03-21T14:04:09Z",
      "title": "US surgeons have transplanted a pig kidney into a patient",
      "url": "https://apnews.com/c7fb54b1b1f1ece3b41b85f105fe4b98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6406e875765e4df681982d1b449138fd/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The General Assembly approved the first United Nations resolution on artificial intelligence Thursday, giving global support to an international effort to ensure the powerful new technology benefits all nations, respects human rights and is “safe, secure and trustworthy.”",
      "publishedAt": "2024-03-21T05:00:14Z",
      "title": "The UN adopts a resolution backing efforts to ensure artificial intelligence is safe",
      "url": "https://apnews.com/8079fe83111cced0f0717fdecefffb4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a8c89d7b42c4e02ad6ebbfe6613ca77/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — Sentencing concludes Thursday with the last two of six white former officers in Mississippi who pleaded guilty to breaking into a home without a warrant and torturing two Black men, an act the judge called “egregious and despicable.”",
      "publishedAt": "2024-03-21T05:08:47Z",
      "title": "Last 2 Mississippi ex-officers to be sentenced for torturing 2 Black men in racist assault",
      "url": "https://apnews.com/6d0fb2b195ec319411a2ee2333b5f5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58d746d62c6c4f3880e1596524bcae9f/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and MARK THIESSEN",
      "description": "Authorities are searching for a white supremacist Idaho prison inmate and an accomplice who fled after the accomplice shot and wounded corrections officers as they were transporting the inmate from a Boise hospital, according to police.",
      "publishedAt": "2024-03-21T05:03:40Z",
      "title": "Escaped white supremacist inmate and accomplice still at large after Idaho hospital ambush",
      "url": "https://apnews.com/5d4eb764853ca05d2721145bc435367a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2894e5c59a4831b87642f2f28b35e5/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE and WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Reddit and its eclectic bazaar of online communities is ready to plumb high-stakes territory — the stock market.The company priced its IPO at $34 a share Wednesday and shares will begin trading Thursday on the New York Stock Exchange under the ticker symbol “RDDT.” The market debut is likely to spur a flurry of commentary on Reddit’s own platform, as well as competing social media outlets.",
      "publishedAt": "2024-03-21T04:01:21Z",
      "title": "Reddit, the self-anointed 'front page of the internet,' set to make its stock market debut",
      "url": "https://apnews.com/77d428f98654dbbb87b242c2f625131d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7de61a75dcc494ca4cda1d276a20e74/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}