{
  "articles": [
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces bombarded Palestinian refugee camps in central Gaza on Tuesday, residents said, in apparent preparation to expand their ground offensive into a third section of the besieged territory.",
      "publishedAt": "2023-12-26T10:14:15Z",
      "title": "Israeli forces bombard central Gaza in apparent move toward expanding ground offensive",
      "url": "https://apnews.com/698c895797ccb057d13fe4f68690c98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2976ee0e534c9fb354bf162c35282c/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The doctors gave Shaimaa Nabahin an impossible choice: lose your left leg or risk death. The 22-year-old had been hospitalized in Gaza for around a week, after her ankle was partially severed in an Israeli airstrike, when doctors told her she was suffering from blood poisoning.",
      "publishedAt": "2023-12-26T05:11:24Z",
      "title": "Lose a limb or risk death? Growing numbers among Gaza's thousands of war-wounded face hard decisions",
      "url": "https://apnews.com/b5a452bbf2a27364aaff68cc71b51fc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e87025fcc484e9e955a3b6435c7434f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden ordered the U.S. military to carry out retaliatory airstrikes against Iranian-backed militia groups after three U.S.",
      "publishedAt": "2023-12-26T03:25:36Z",
      "title": "Biden orders strike on Iranian-aligned group after 3 US troops injured in drone attack in Iraq",
      "url": "https://apnews.com/b4b4480e2cae6e7ad26e88eb625ab397",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be533bd8eb73479eab08133bcce7d37e/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — For holding a sign outside a courthouse reminding jurors of their right to acquit defendants, a retiree faces up to two years in prison. For hanging a banner reading Just Stop Oil off a bridge, an engineer got a three-year prison sentence.",
      "publishedAt": "2023-12-26T05:20:22Z",
      "title": "The right to protest is under threat in Britain, undermining a pillar of democracy",
      "url": "https://apnews.com/616078b918e27d5098890be6f9967b14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f673b1e064e84b36ab034ed8c3f2b106/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A Russian naval ship in Crimea was damaged in an airstrike by Ukrainian forces, Russia’s Defense Ministry said Tuesday.The landing ship Novocherkassk was hit at a base in the city of Feodosia by plane-launched guided missiles, the ministry said, adding that two Ukrainian fighter jets were destroyed by anti-aircraft fire during the attack.",
      "publishedAt": "2023-12-26T07:34:58Z",
      "title": "Russian naval ship in Crimea damaged in airstrike by Ukrainian forces, Russian Defense Ministry says",
      "url": "https://apnews.com/3d558083dcd765d8b9daccc461865b21",
      "urlToImage": ""
    },
    {
      "author": "MSTYSLAV CHERNOV",
      "description": "KHERSON, Ukraine (AP) — Their first battle plan was outdated the moment the dam crumbled. So the Ukrainian special forces officers spent six months adapting their fight to secure a crossing to the other side of the Dnipro River in southern Ukraine.",
      "publishedAt": "2023-12-26T05:21:22Z",
      "title": "Inside Ukraine's covert Center 73, where clandestine missions shape the war behind the frontline",
      "url": "https://apnews.com/9cca826e96ca244a7fea12649ff154ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2975780cdffb47869a8c64a8dc4bb601/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "HASLET, Texas (AP) — Worried about his mother’s health, Jacob Mabil tried for months to persuade her to let him start the process that would take her from a sprawling refugee camp where she had spent almost a decade after fleeing violence in South Sudan.",
      "publishedAt": "2023-12-26T05:11:06Z",
      "title": "Their lives were torn apart by war in Africa. A family hopes a new US program will help them reunite",
      "url": "https://apnews.com/039ebb3a14047497196d2491108f6559",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4b8fd76ed0a4dde9be7fbd99b26f8fe/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — At least 140 people were killed by gunmen who attacked remote villages over two days in north-central Nigeria’s Plateau state, survivors and officials said Tuesday in the latest of such mass killings this year blamed on the West African nation’s farmer-herder crisis.",
      "publishedAt": "2023-12-26T11:10:15Z",
      "title": "At least 140 villagers killed by suspected herders in dayslong attacks in north-central Nigeria",
      "url": "https://apnews.com/9e9e9cf4615f6e31053881e8d2233bca",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian opposition leader Alexei Navalny on Tuesday released a sardonic statement about his transfer to a Arctic prison colony nicknamed the “Polar Wolf,” his first appearance since associates lost contact with him three weeks ago.",
      "publishedAt": "2023-12-26T11:24:18Z",
      "title": "The imprisoned Russian opposition leader Alexei Navalny resurfaces with darkly humorous comments",
      "url": "https://apnews.com/0839d4164ae60a1e4fc10a3fa0d01bcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f453fd0a02d428b98ab3ca003a42566/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "They are snippets in time, unforgettable snapshots that gloriously capture the soaring euphoria and gut-wrenching agony of the games we love, not to mention the randomness of a moment that might've gone unnoticed otherwise.",
      "publishedAt": "2023-12-26T05:02:09Z",
      "title": "AP sports photos of the year capture unforgettable snippets in time from the games we love",
      "url": "https://apnews.com/ee23619fc5ae905ddaaa185dcec180e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9904f52985f04909a6dad1831f15ba67/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}