{
  "articles": [
    {
      "author": "Brian Slodysko, Byron Tau",
      "description": "Twenty-one civil service employees have resigned from Elon Musk’s Department of Government Efficiency, saying they're refusing to use their technical expertise to “dismantle critical public services.” The staffers wrote Tuesday in a joint resignation letter obtained by The AP they “swore to serve the American people\" and uphold their oath to the Constitution across presidential administrations but it has become clear they “can no longer honor those commitments.” The staffers who resigned worked for what was once known as the United States Digital Service. Musk called the story “fake news” and said the staffers would have been fired if they didn't resign.",
      "publishedAt": "2025-02-25T16:02:30Z",
      "title": "DOGE staffers resign en masse to protest Musk's slashing of federal government",
      "url": "https://apnews.com/article/doge-elon-musk-federal-government-resignations-usds-6b7e9b7022e6d89d69305e9510f2a43c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3f5b55/2147483647/strip/true/crop/5827x3278+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2Fe7%2F524363185368c86081c03a0b16eb%2Fe22751441cbe469495e7a3f0da888633"
    },
    {
      "author": "Chris Megerian",
      "description": "The turmoil that enveloped the federal workforce over the last few days is unlikely to cease anytime soon. The Office of Personnel Management is considering how to fulfill Elon Musk’s demand to increase scrutiny of government employees. Musk serves as a top adviser to President Donald Trump, and he's leading efforts to cut spending and lay off workers. He recently demanded that employees explain their recent accomplishments or risk getting fired. Although that stalled on Monday, workers could face similar requests going forward. White House press secretary Karoline Leavitt said agencies would be implementing these goals.",
      "publishedAt": "2025-02-25T18:52:19Z",
      "title": "More Elon Musk inspired demands could roil federal employees",
      "url": "https://apnews.com/article/elon-musk-donald-trump-doge-federal-workers-b23b4752d56d5f969102f94afa5eb4b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/beb30c9/2147483647/strip/true/crop/5992x3371+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F99%2F540f36b52bca3f3a5daadbaa859d%2Fc172277b76dd4aa792869e0587db9b16"
    },
    {
      "author": "Ryan J. Foley",
      "description": "Nearly 40% of the federal contracts that President Donald Trump’s administration claims to have canceled as part of its signature cost-cutting program aren’t expected to save the government any money, the administration’s data shows. The Department of Government Efficiency, run by Elon Musk, published an updated list Monday of nearly 2,300 contracts that agencies terminated in recent weeks across the federal government. Data published on DOGE’s “Wall of Receipts” shows that more than one-third of the contract cancellations, 794 in all, are expected to yield no savings. That’s usually because the total value of the contracts has already been fully obligated, which means the government is required to spend the funds for the goods or services it purchased.",
      "publishedAt": "2025-02-25T05:02:04Z",
      "title": "Nearly 40% of contracts canceled by Musk's DOGE are expected to produce no savings",
      "url": "https://apnews.com/article/doge-federal-contracts-canceled-musk-trump-cuts-a65976a725412934ad686389889db0df",
      "urlToImage": "https://dims.apnews.com/dims4/default/11a6683/2147483647/strip/true/crop/5652x3179+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fe6%2F439a649c9a50ff9359fa4f6cecee%2F1eff1afab62b4509a42b13865bcff8a6"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump wants to pass a “big, beautiful\" budget bill but House Speaker Mike Johnson is facing opposition. Twenty-one employees of Elon Musk's DOGE have resigned.",
      "publishedAt": "2025-02-25T07:41:00Z",
      "title": "Live updates: Speaker Johnson struggles to wrangle support for Trump's 'big, beautiful bill'",
      "url": "https://apnews.com/live/trump-presidency-updates-2-25-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/94d53b1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2Fb7%2F07c7ba4025b29136328b22b5f147%2Fa0f7cdfce1f848d282e0c9a0123724a8"
    },
    {
      "author": "Mark Sherman",
      "description": "The wife of an Oklahoma man whose murder conviction and death penalty were thrown out by the Supreme Court says the decision is “an answered prayer.” Inmate Richard Glossip was found guilty in the killing of a motel owner in 1997 but has steadfastly maintained his innocence and averted multiple attempts by the state to execute him. Glossip’s attorney says the court was right to overturn the conviction because prosecutors hid critical evidence from the defense team. In 2023, state Attorney General Gentner Drummond said boxes of new evidence persuaded him Glossip’s trial was not fair. The justices Tuesday found Glossip’s trial violated his constitutional rights.",
      "publishedAt": "2025-02-25T15:09:11Z",
      "title": "Supreme Court throws out Oklahoma inmate Richard Glossip's murder conviction and death sentence",
      "url": "https://apnews.com/article/supreme-court-oklahoma-execution-glossip-f0a78b99cedfb7d774978a5b8b31aad9",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e26896/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F9b%2Fdeb4c11ac887542144c7a9032f83%2Fb2ceee5eb6864b28b0925da67bda0453"
    },
    {
      "author": "Marcia Dunn",
      "description": "Scientists have finally given the all-clear to Earth from a newly discovered asteroid. NASA and the European Space Agency said Tuesday that after two months of observations, scientists have almost fully ruled out any threat. At one point, the odds of a strike in 2032 were as high as about 3% and topped the world's asteroid-risk lists. But ESA lowered the odds to 0.001%. NASA had it down to 0.0027%. But there's still a 1.7% chance the asteroid could hit the moon in 2032. Discovered in December, the asteroid is about 130 feet to 300 feet across, and swings our way every four years.",
      "publishedAt": "2025-02-25T15:27:18Z",
      "title": "Asteroid 2024 YR4 is no longer a threat to Earth, scientists say",
      "url": "https://apnews.com/article/asteroid-2024-yr4-nasa-esa-cce39c01ab94ac1edae00024dc35169c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d85036b/2147483647/strip/true/crop/3934x2213+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fc8%2F5d268b3d286f1ad6fde052c87294%2Fdd02dbb93a6344b4813b2cb34d6c2d9e"
    },
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Matt Brown",
      "description": "House Speaker Mike Johnson will try against the odds to muscle a Republican budget blueprint to passage this week. It's a step toward delivering President Donald Trump's “big, beautiful bill” with $4.5 trillion in tax breaks and $2 trillion in spending cuts. But the speaker is facing stiff opposition from Democrats — and even some Republicans. Johnson has almost no votes to spare in a bare-bones GOP majority. Votes set for Tuesday evening are in jeopardy, and the outcome is uncertain. Republicans are finding the familiar problem that slashing federal spending is easier said than done, as constituents back home rely on Medicaid and other programs and services.",
      "publishedAt": "2025-02-25T12:04:42Z",
      "title": "Mike Johnson tries to push Trump's agenda forward, but votes in jeopardy",
      "url": "https://apnews.com/article/johnson-trump-republicans-budget-vote-tax-cuts-4cb74ca15f6a74a7344355e4507ab9fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d1eb2f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F1d%2F99f7b9926f1f75505163e7a5a3fb%2Ff84ff65634a048ef807bb8127c4ef7a7"
    },
    {
      "author": "Laurie Kellman",
      "description": "The White House says its officials \"will decide\" which news outlets cover President Donald Trump. That departs from a century of tradition in which a pool of independent news organizations go where the chief executive does and holds him accountable on behalf of regular Americans. White House press secretary Karoline Leavitt said Wednesday that the changes would rotate some traditional outlets from the group and include some streaming services. She cast the change as a modernization of the press pool, saying the move would restore “access back to the American people” who elected Trump.",
      "publishedAt": "2025-02-25T19:07:45Z",
      "title": "White House says it 'will decide' which news outlets cover Trump, rotating some traditional ones",
      "url": "https://apnews.com/article/trump-ap-news-outlets-ban-gulf-mexico-25c77f617418dd3ca2791af90b263a59",
      "urlToImage": "https://dims.apnews.com/dims4/default/a07773e/2147483647/strip/true/crop/5177x2912+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fe5%2F39ad2aece61695b28518c1cb9b6b%2Fb63c5f23e7854d84abde290a07141d74"
    },
    {
      "author": "Nicole Winfield, Trisha Thomas",
      "description": "The Vatican says Pope Francis, who is hospitalized in critical condition with double pneumonia, was well enough to meet with the Vatican secretary of state and his deputy to approve new decrees for saints and call a formal meeting to set the dates for their canonization. The audience, which occurred Monday, signaled that the machinery of the Vatican is still grinding on, even with doctors warning Francis' prognosis is guarded. The Vatican’s Tuesday noon bulletin announced that Francis had approved decrees for two new saints and five people for beatification — a step on the road to becoming a saint. It said Francis had “decided to convene a consistory about the future canonizations.”",
      "publishedAt": "2025-02-25T07:44:59Z",
      "title": "Pope Francis meet with Vatican No. 2 over candidates for sainthood",
      "url": "https://apnews.com/article/vatican-pope-health-83b690c6d47679c37ae10329369fd480",
      "urlToImage": "https://dims.apnews.com/dims4/default/1042635/2147483647/strip/true/crop/4010x2256+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fb5%2F37f2fe2b485cf26fdb7a8e31b95c%2F475464ddb62d4b709fc1b6d665bbb859"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}