{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu has vowed to defeat the Hamas militant group after a deadly incursion into southern Israel but says the war will “take time.” Netanyahu delivered his message in a nationally televised address late Saturday after spending most of the day in meetings with top security officials.",
      "publishedAt": "2023-10-07T03:50:54Z",
      "title": "Israel's Netanyahu vows to defeat Hamas but acknowledges the war will take time",
      "url": "https://apnews.com/11fb98655c256d54ecb5329284fc37d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37611321b93e4acc8592ae3b428ff836/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and MATTHEW LEE",
      "description": "WASHINGTON (AP) — President Joe Biden on Saturday decried the “unconscionable\" assault by Hamas militants and his administration pledged to ensure Israel has “what it needs to defend itself” after the surprise attack that drew worldwide condemnation and anger from Israel's allies.",
      "publishedAt": "2023-10-07T17:23:14Z",
      "title": "Biden decries the 'unconscionable' Hamas attack and warns Israel's enemies not to exploit the crisis",
      "url": "https://apnews.com/0b6abb762dabd46aa826af891591b392",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73a665291c8049188d9d41d2352a317d/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Two 6.3 magnitude earthquakes killed dozens of people in western Afghanistan on Saturday, the country's national disaster authority said.The United Nations gave a preliminary figure of 320 dead, but later said the figure was still being verified.",
      "publishedAt": "2023-10-07T10:43:22Z",
      "title": "Two 6.3-magnitude earthquakes kill dozens and injure many more in western Afghanistan",
      "url": "https://apnews.com/ba6f50c0cd0590f179756077f5f01393",
      "urlToImage": ""
    },
    {
      "author": "STEPHEN GROVES and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump is again testing the power of his endorsement.With an early morning social media post on Friday, Trump inserted himself into the chaotic race to replace Kevin McCarthy as House speaker by backing Ohio Rep.",
      "publishedAt": "2023-10-07T04:47:17Z",
      "title": "Trump is inserting himself into the messy race to become the next House speaker. Will it matter?",
      "url": "https://apnews.com/77b4f760ff5653344b982fbabeac6ec7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2104e3e52b54577ab6240b928583e1c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The ad sounds like something out of the GOP 2024 playbook, trumpeting a senator’s work with Republicans to crack down on the flow of fentanyl and other illegal drugs into the U.S., getting tough on Chinese interests helping smugglers, and noting how he \"wrote a bill signed by Donald Trump to increase funding for Border Patrol.”",
      "publishedAt": "2023-10-07T04:59:52Z",
      "title": "Biden faces more criticism about the US-Mexico border, one of his biggest problems heading into 2024",
      "url": "https://apnews.com/646f656dbfecf268f0cb182c74ad47ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a0bf698d9042b2982932e779f5e0af/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The collapse of Ukraine aid in Congress was months in the making, and exactly what Senate Republican leader Mitch McConnell had feared.",
      "publishedAt": "2023-10-07T12:56:25Z",
      "title": "How $6 billion in Ukraine aid collapsed in a government funding bill despite big support in Congress",
      "url": "https://apnews.com/7e9137b32a7bcebd8fcdd99a4775ff74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f41a8ae1e15c4cc5badc721a9669f9e8/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — A woman approaches a drop box in the dark with what appears to be handfuls of ballots. At a different drop box, someone else is seen making multiple trips to insert ballots. At yet another, the same car stops on at least three separate occasions, with different people stepping out and heading to the box.",
      "publishedAt": "2023-10-07T14:57:05Z",
      "title": "Drop boxes have become key to election conspiracy theories. Two Democrats just fueled those claims",
      "url": "https://apnews.com/af4751d78f87c8f5aeefc5daa2b1f6a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb58f92984404ebaa4eb2a9cd28fd4b5/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Six Colombians arrested as the alleged assassins of a candidate in Ecuador's August presidential election were slain Friday inside a prison in Guayaquil, officials announced, without providing details on what happened.",
      "publishedAt": "2023-10-07T04:14:21Z",
      "title": "Six Colombians held in assassination of Ecuador presidential candidate reported slain inside prison",
      "url": "https://apnews.com/e6582c0848c4f3f1c96eb9770d5ebbae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7af925344a4144aead76a9c7f3fb5d42/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "PENFIELD, Pa. (AP) — In the heart of Pennsylvania elk country, Eric McCarthy and his client, Don Reichel, got up before sunrise to scour the forest floor for so-called “brown gold” — a rack of freshly shed antlers to add to Reichel’s collection back home.",
      "publishedAt": "2023-10-07T04:10:01Z",
      "title": "Witnesses to FBI hunt for Civil War gold describe heavily loaded armored truck, signs of a night dig",
      "url": "https://apnews.com/6b5feca00ebf3e04638a8bbce992809d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b69dfedcfc0f418a94b82834573be600/1920.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — A little too country for rock ‘n’ roll, and a little too rock ‘n’ roll for country, Grammy-winning singer-songwriter Lucinda Williams has always played by her own rules.",
      "publishedAt": "2023-10-07T15:39:00Z",
      "title": "Lucinda Williams talks about writing and performing rock 'n' roll after her stroke",
      "url": "https://apnews.com/04c2fcb9b572e80ff14488b27e707909",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/150c4a4335cf4a38a9bdc539991bc24a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}