{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "ASHEVILLE, N.C. (AP) — Donald Trump made little effort to stay on message Wednesday at a rally in North Carolina that his campaign billed as a big economic address, mixing pledges to slash energy prices and “unleash economic abundance” with familiar off-script tangents on Democratic nominee Kamala Harris’ laugh, the mechanics of wind energy and President Joe Biden’s son.",
      "publishedAt": "2024-08-14T04:08:31Z",
      "title": "Trump’s campaign called it an economic address. He made big promises but mostly veered off topic",
      "url": "https://apnews.com/bc81b98a425e46c32065c02650b2b44c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c4374aebb304c699a32ba3e54b259c1/1920.jpeg"
    },
    {
      "author": "DAN MERICA, NICHOLAS RICCARDI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden, watching tens of thousands of migrants from Central America reach the U.S.-Mexico border just a few months into his administration, tapped his second-in-command to help address the influx — a decision that has exposed Vice President Kamala Harris to one of her biggest political liabilities.",
      "publishedAt": "2024-08-14T04:13:32Z",
      "title": "Presented with rise in border crossings, Kamala Harris chose a long-term approach to the problem",
      "url": "https://apnews.com/46d23ad3b0e8a1780ac0a6a306120b3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/911e244df70841ba9ea2bc91b36677f2/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DOHA, Qatar (AP) — A top Hamas official said the Palestinian militant group is losing faith in the United States’ ability to mediate a cease-fire in Gaza ahead of a new round of talks scheduled for this week amid mounting pressure to bring an end to the 10-month-old war with Israel.",
      "publishedAt": "2024-08-14T15:44:47Z",
      "title": "Top Hamas official says group is losing faith in US as mediator in Gaza cease-fire talks",
      "url": "https://apnews.com/8509c5e68d57c96af99653c8292180b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c00623e5d9a84e6f9bee532e23c220fb/2340.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Hunter Biden asked the U.S. ambassador to Italy for help regarding an energy project a Ukrainian gas company was pursuing while his father was vice president, according to The New York Times.",
      "publishedAt": "2024-08-14T18:05:35Z",
      "title": "Hunter Biden reportedly sought US government help for Ukrainian gas company Burisma",
      "url": "https://apnews.com/1053ec65050e45e6a03905b960a87445",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c881a1007fdc441993a35eb627481f01/3000.jpeg"
    },
    {
      "author": "SEJAL GOVINDARAO",
      "description": "PHOENIX (AP) — An informational pamphlet for Arizona voters who will decide in the fall whether to guarantee a constitutional right to an abortion can refer to a fetus as an “unborn human being,” the state's highest court ruled Wednesday.",
      "publishedAt": "2024-08-14T19:46:57Z",
      "title": "Ruling: Fetus can be referred to as 'unborn human being' in Arizona abortion measure voter pamphlet",
      "url": "https://apnews.com/b0ea37c92692533da109fd74a07b25f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78fcc690ff5f485580afe4507c62a8c6/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "TOA BAJA, Puerto Rico (AP) — Ernesto strengthened into a hurricane Wednesday as it dropped torrential rain on Puerto Rico and left half of all customers in the U.S.",
      "publishedAt": "2024-08-14T10:42:25Z",
      "title": "Ernesto becomes a hurricane after pummeling northeast Caribbean and knocking out power in the region",
      "url": "https://apnews.com/cb633e600fad24430d3d540f8a522974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c5266b97eed43189e62130c232f3334/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — The State Fair of Texas is laying down a new rule before millions of visitors flock through the gates for corn dogs, deep-fried delights and a friendly wave from a five-story cowboy named Big Tex: No guns allowed.",
      "publishedAt": "2024-08-14T22:12:31Z",
      "title": "The State Fair of Texas is banning firearms, drawing threats of legal action from Republican AG",
      "url": "https://apnews.com/da8b22f018f46dd770f65e799a6d3e6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e3ed2d8b7574377999118bf772a9270/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Ukrainian forces pushed on with their major cross-border advance into Russia’s Kursk region for a second week Wednesday, claiming that they took more ground, captured more Russian prisoners and destroyed a bomber in attacks on military airfields.",
      "publishedAt": "2024-08-14T10:14:28Z",
      "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region",
      "url": "https://apnews.com/6f65e2d6b295e898f4a59118a2c0c735",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0ad8e72c5c41a3b5324453821e6f80/1920.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — The ancient ritual meaning of Stonehenge is still a mystery, but researchers are one step closer to understanding how the famous stone circle was created.",
      "publishedAt": "2024-08-14T15:01:54Z",
      "title": "Stonehenge's 'altar stone' originally came from Scotland and not Wales, new research shows",
      "url": "https://apnews.com/7f0896476ac8e2b955224377ff9f661e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1817f5e34866453da3d31daf4adcf10e/2953.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — The World Health Organization declared the mpox outbreaks in Congo and elsewhere in Africa a global emergency on Wednesday, with cases confirmed among children and adults in more than a dozen countries and a new form of the virus spreading.",
      "publishedAt": "2024-08-14T17:30:34Z",
      "title": "WHO declares mpox outbreaks in Africa a global health emergency as a new form of the virus spreads",
      "url": "https://apnews.com/cc9bdf31b49d06bec5efd44fb55d5e42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fbd0ba40dcb4650b5f23979fd2dbca2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}