{
  "articles": [
    {
      "author": null,
      "description": "Officials say a nighttime Russian missile and drone barrage has killed at least 15 people and injured 116 others in Ukraine while they slept in their homes, with the main barrage centering on the capital Kyiv. The Kyiv City Military Administration says 14 people were killed and 99 others were injured in the capital as explosions echoed across the city for hours during the night. The bombardment demolished a nine-story residential building, destroying dozens of apartments. It was one of the deadliest attacks on the Ukrainian capital in recent months and came as two rounds of direct peace talks have failed to make progress on ending the war, now in its fourth year.",
      "publishedAt": "2025-06-17T00:08:16Z",
      "title": "Russian drone and missle attack kills 15 in Ukraine",
      "url": "https://apnews.com/article/russia-drone-attack-kyiv-187fafa3d7324130e5ee7e20e0a3a5dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/e153a25/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F74%2Fe69af76e16d878fe5eeecdda011c%2Fab9672d9f29d456ea7a211afdab29c0b"
    },
    {
      "author": null,
      "description": "Six of the Group of Seven leaders will try to show the wealthy nations’ club still has the clout to shape world events despite the early departure of President Donald Trump. Prime Minister Mark Carney and his counterparts from the U.K., France, Germany, Italy and Japan will be joined Tuesday by Ukrainian President Volodymyr Zelenskyy and NATO chief Mark Rutte to discuss Russia’s relentless war on its neighbor. That's just one of several crises in an increasingly unstable world. Another is a dangerous showdown between Israel and Iran. Trump left the summit in the Canadian Rockies saying it was very important for him to return.",
      "publishedAt": "2025-06-17T04:11:56Z",
      "title": "G7 leaders try to salvage a summit without Trump",
      "url": "https://apnews.com/article/g7-summit-canada-trump-departure-ukraine-6c86a0a8463603c9b1a3e950382af0a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7424e0/2147483647/strip/true/crop/3173x1785+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F97%2Ff2f849068f55b7a9848073d8b0c1%2F891c87358beb40d598fc9e3b0c0f50f9"
    },
    {
      "author": null,
      "description": "Israel’s air campaign on Iran’s capital appeared to broaden on the fourth day of an intensifying conflict as U.S. President Donald Trump posted an ominous message warning residents of the city to evacuate. Earlier, the Israeli military called for the some 330,000 residents of a neighborhood in the city center to evacuate. Israel says its sweeping assault on Iran’s top military leaders, uranium enrichment sites and nuclear scientists, is necessary to prevent its longtime adversary from getting any closer to building an atomic weapon. The strikes have killed at least 224 people since Friday. Iran has retaliated by launching more than 370 missiles and hundreds of drones at Israel. So far, 24 people have been killed in Israel and more than 500 injured.",
      "publishedAt": "2025-06-17T05:03:28Z",
      "title": "Israel strikes Iran and Trump tells capital's residents to evacuate",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-tehran-trump-06-17-2025-3f08988b5e8fd375645967b6e22916f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/01b6e16/2147483647/strip/true/crop/4285x2410+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fb5%2F313bc031e4db86db9caed5f1897a%2Fd674c596204543adbb19beeeb2654b0d"
    },
    {
      "author": null,
      "description": "At least 51 Palestinians were killed and over 200 wounded in the Gaza Strip while waiting for U.N. and commercial trucks to enter the territory with desperately needed food, according to Gaza’s Health Ministry and a local hospital. Palestinian witnesses told The Associated Press that Israeli forces had fired on the crowds. The military said it was looking into reports that its forces had fired toward the crowd, causing several casualties. It did not appear to be related to a new Israeli- and U.S.-supported aid delivery network that rolled out last month and has been marred by controversy and violence.",
      "publishedAt": "2025-06-17T07:33:23Z",
      "title": "At least 51 Palestinians killed while waiting for aid trucks in Gaza, health officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-gaza-aid-06-17-2025-7af5503ea7d2176674fba26d34f6ef74",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": null,
      "description": "Members of Congress are attending emergency security briefings after the killing of a Minnesota state lawmaker. The shooting at the lawmaker's home has raised fresh fears about the safety of members of Congress. The suspect in the attack had dozens of federal lawmakers listed in his writings, besides the state lawmakers and others he allegedly targeted. The shootings come after credible threats to members of Congress have more than doubled in the last decade and after several violent attacks on lawmakers and their families. Senate Democrats say at a briefing Tuesday they plan to ask security officials and Republican leadership about their protection against outside threats.",
      "publishedAt": "2025-06-17T04:26:15Z",
      "title": "Congress holds emergency briefings on security after Minnesota shootings",
      "url": "https://apnews.com/article/minnesota-lawmakers-killed-congress-violence-1e6a061c4265b0136ebb058a2777b85f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f5e8d6c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fd1%2Fca9a1c37493466357e68af0fe3f6%2F8781e5b7258740de91d4f64404fb0fe4"
    },
    {
      "author": null,
      "description": "Prosecutors say the man charged with killing one Minnesota lawmaker and wounding another had dozens of apparent targets, including officials in at least three other states. U.S. Attorney Joseph Thompson says Vance Boelter made it to the homes of two other legislators on the night of the attacks, but one was not home and the suspect left the other house after police arrived. Boelter surrendered to police Sunday. He is accused of posing as a police officer and fatally shooting state Rep. Melissa Hortman and her husband in their home early Saturday. Federal prosecutors have charged Boelter with murder and stalking. He also says faces state murder charges. His attorney declined to comment.",
      "publishedAt": "2025-06-17T04:59:28Z",
      "title": "Minnesota shooting suspect had dozens of potential targets, prosecutors say",
      "url": "https://apnews.com/article/minnesota-lawmakers-shooting-dozens-targeted-d3d7866c09765fac088e6418e49ad811",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e3bf5d/2147483647/strip/true/crop/4896x2754+63+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F42%2Fb332f382c2373c02196890cb783e%2Fa9928dd5586a42aea3515c10d60223d1"
    },
    {
      "author": null,
      "description": "A federal jury in Colorado has found MyPillow founder Mike Lindell defamed a former employee for a leading voting equipment company. Jurors reached the verdict Monday for Lindell, one of the nation’s most prominent election conspiracy theorists. He had called the employee for Dominion Voting Systems, Eric Coomer, a traitor. Lindell’s online media platform also streamed an event where a conservative podcaster accused Coomer of helping rig the 2020 election. During the trial in Denver, Lindell denied making any statements he knew to be false about Coomer. Coomer said his career and life have been destroyed as a result of the statements. Coomer’s lawyers said Lindell either knew the statements were lies, or conveyed them recklessly without knowing if they were true.",
      "publishedAt": "2025-06-16T22:46:48Z",
      "title": "Jury finds MyPillow founder defamed former employee for a leading voting equipment company",
      "url": "https://apnews.com/article/mike-lindell-dominion-voting-defamation-2020-election-af473792a6e395d86ea6ca0f97742c3f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a356aac/2147483647/strip/true/crop/6568x3695+0+447/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F36%2F12f81f7ac1b1b6a19d119bd3ca24%2Fd7772a8ac4bc4fed8ca43eb9d1f34f81"
    },
    {
      "author": null,
      "description": "A judge has dismissed a juror in the sex trafficking trial of Sean “Diddy” Combs after concluding that his conflicting answers about where he lives might indicate he had an agenda or wanted to stay on the jury for a purpose. Judge Arun Subramanian made the ruling on Monday, rejecting arguments by Combs' attorneys that it would disrupt the diversity of the jury to replace the Black man with a white juror. Subramanian had first announced late Friday that he was dismissing the juror, but multiple defense lawyers protested. The judge delayed dismissing the juror until Monday, when the trial entered its sixth week.",
      "publishedAt": "2025-06-16T14:53:17Z",
      "title": "Juror dismissed in Diddy trial despite protests by Combs' lawyers",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-juror-removed-5f4a05fbe191d7a8ad8597ee23432d49",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "The Trump family company says it's launching a mobile phone company, the latest in a string of ventures that have been announced while Donald Trump is in the White House. Eric Trump, one of President Donald Trump’s sons who will run the company, said Monday that the new company would build its own phones and maintain a call center in the U.S. The new business follows several real estate deals for towers and resorts in the Middle East, including a golf development in Qatar announced in April, and a $1.5 billion partnership to build golf courses, hotels and real estate projects in Vietnam.",
      "publishedAt": "2025-06-16T12:44:59Z",
      "title": "Trump family says it's launching a mobile phone company",
      "url": "https://apnews.com/article/trump-mobile-phone-white-house-business-361455bb3c65593bade7d4edfe4da7e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7865735/2147483647/strip/true/crop/3008x1692+0+118/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Ff4%2F4d56348ae948df6afdf7bb1fb394%2Fc6ecb9858c3e4845a06d081010b29d3f"
    },
    {
      "author": null,
      "description": "The U.S. National Hurricane Center says Tropical Storm Erick has formed near southern Mexico. The center said early Tuesday the storm is expected to become a hurricane by Wednesday. The storm was about 450 miles southeast of Punta Maldonado, Mexico, with maximum sustained winds of 40 miles per hour. A hurricane watch has been posted for a stretch of the Pacific coast from Bahia De Huatulco in Oaxaca state to Punta Maldonado. A hurricane watch means hurricane conditions with winds exceeding 74 mph are possible in the area within two days.",
      "publishedAt": "2025-06-17T06:59:25Z",
      "title": "Tropical Storm Erick forms near southern Mexico",
      "url": "https://apnews.com/article/mexico-hurricane-watch-tropical-storm-erick-4554a18fe47e95fea7c23d24ef6a9939",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}