{
  "articles": [
    {
      "author": "JOSEPH KRAUSS and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — The Israeli military pulverized the Gaza Strip with airstrikes, prepared for a possible ground invasion and said Thursday its complete siege of the territory — which has left Palestinians desperate for food, fuel and medicine — would remain in place until Hamas militants free some 150 hostages taken during a grisly weekend incursion.",
      "publishedAt": "2023-10-12T05:11:00Z",
      "title": "As desperation in Gaza grows, Israel pledges to block vital aid until Hamas releases hostages",
      "url": "https://apnews.com/beb1fa2b9e4ede6cf4568dd6c86ff11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4a8bdb1a0d7460abed1015c7ce0ae53/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER and SARAH EL DEEB",
      "description": "Less than a month before Hamas fighters blew through Israel’s high-tech “Iron Wall” and launched an attack that would leave more than 1,200 Israelis dead, they practiced in a very public dress rehearsal.",
      "publishedAt": "2023-10-13T01:46:10Z",
      "title": "Hamas practiced in plain sight, posting video of mock attack weeks before border breach",
      "url": "https://apnews.com/aa0b0f5f3613b6c6882cf37168e8e8ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5646c81456d41569fd8a67ba8b4f896/2880.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — As Israel pounds Gaza with airstrikes, prepares for a possible ground invasion and escalates a war sparked by Hamas' unprecedented assault, its leaders will confront many of the same dilemmas it has grappled with over decades of conflict with the Palestinians.",
      "publishedAt": "2023-10-12T20:40:18Z",
      "title": "In its quest to crush Hamas, Israel will confront the bitter, familiar dilemmas of Mideast wars",
      "url": "https://apnews.com/3e6f08a75643b21e41a498277e84b5b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9743acbb30424d40928fe79c632f7e3d/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ABBY SEWELL",
      "description": "BEIRUT (AP) — Will Lebanon's heavily armed Hezbollah militia join the Israel-Hamas war? The answer could well determine the direction of a battle that is bound to reshape the Middle East.Hezbollah, which like Hamas is supported by Iran, has so far been on the fence about joining the fighting between Israel and the Gaza Strip's Islamic militant rulers.",
      "publishedAt": "2023-10-12T22:08:02Z",
      "title": "As Israel battles Hamas, all eyes are on Hezbollah, the wild card on its northern border",
      "url": "https://apnews.com/423f5f20d691dcd0cc8af1788f11857b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb4fca03202640238dd3325633637d93/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI, STEPHEN GROVES and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republican Steve Scalise ended his bid to become House speaker late Thursday after hardline holdouts refused to back the party’s nominee, throwing the GOP majority into deeper chaos and leaving the chamber still unable to function.",
      "publishedAt": "2023-10-12T04:23:22Z",
      "title": "GOP's Scalise ends his bid to become House speaker as Republican holdouts refuse to back the nominee",
      "url": "https://apnews.com/1492ca6b58604c51186015c23f7efccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/020ee15fb55d4fb9ae730ae25c9fd74d/1920.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — Jurors convicted a Denver-area police officer of homicide Thursday and acquitted another of all charges in the 2019 death of Elijah McClain, a Black man who was put in a neck hold, pinned to the ground and given an overdose of the sedative ketamine by paramedics.",
      "publishedAt": "2023-10-12T22:53:49Z",
      "title": "1 of 2 Colorado officers convicted in Elijah McClain's death after neck hold, ketamine injection",
      "url": "https://apnews.com/0b6005e56557ae251b5479be29723349",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca8ed6481d59404b82b5049d92db8f30/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — Sam Bankman-Fried’s lawyer did little to dent the credibility of the government's key witness in the former crypto mogul's fraud trial Thursday, meandering through a cross-examination of Caroline Ellison that at times left even the judge puzzled and impatient.",
      "publishedAt": "2023-10-12T17:49:10Z",
      "title": "Sam Bankman-Fried's lawyer fails to hurt credibility of the government's star witness at fraud trial",
      "url": "https://apnews.com/7d3ce0397ff02ed52f6b4425f781a625",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/998df033c8c04051a592d77e270e9b46/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez of New Jersey was charged Thursday with conspiring for years to act as an agent of the Egyptian government while he held a powerful role in shaping U.S.",
      "publishedAt": "2023-10-12T16:24:28Z",
      "title": "Sen. Menendez is accused of being an unregistered agent of Egypt's government in updated indictment",
      "url": "https://apnews.com/c1850764b8ce7c613fc50f0e4f495e87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d7ce3cef0c84f48b910a935e9ca6e5c/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "A leading doctors group on Thursday formally withdrew its approval of a 2009 paper on “excited delirium,” a document that critics say has been used to justify excessive force by police.",
      "publishedAt": "2023-10-12T20:08:23Z",
      "title": "A doctors group calls its 'excited delirium' paper outdated and withdraws its approval",
      "url": "https://apnews.com/4760e3cbed181503a2ac747ed5afeef6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5e369af3b3b4661b1b5e572b9d2416a/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Four dozen Antarctic ice shelves have shrunk by at least 30% since 1997 and 28 of those have lost more than half of their ice in that time, reports a new study that surveyed these crucial “gatekeepers’’ between the frozen continent’s massive glaciers and open ocean.",
      "publishedAt": "2023-10-12T18:09:03Z",
      "title": "Scientists count huge melts in many protective Antarctic ice shelves. Trillions of tons of ice lost.",
      "url": "https://apnews.com/1eb755e49cc229b04d4903567a51b6fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32f9c2f0a1fa4773ae5a78cd5f274139/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}