{
  "articles": [
    {
      "author": "ISABEL DEBRE",
      "description": "QUSRA, West Bank (AP) — When Israeli warplanes swooped over the Gaza Strip following Hamas militants’ deadly attack on southern Israel, Palestinians say a different kind of war took hold in the occupied West Bank.",
      "publishedAt": "2023-11-20T05:02:53Z",
      "title": "With the world's eyes on Gaza, attacks are on the rise in the West Bank, which faces its own war",
      "url": "https://apnews.com/c1386ab6a633971cc18b2497169210d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fec2271edd5747acae3535aaf5c536f6/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces pressed their offensive against Hamas in northern Gaza on Monday, battling militants around a hospital where thousands of patients and displaced people have been sheltering for weeks, and where health officials began planning the possible evacuation of dozens of wounded.",
      "publishedAt": "2023-11-20T07:44:40Z",
      "title": "Israel battles Hamas near another Gaza hospital sheltering thousands",
      "url": "https://apnews.com/b566adebfdf002569457ecc949c8c4b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d18b99baee274025b6c799c101163ed1/3000.jpeg"
    },
    {
      "author": "DAVID BILLER and DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — His legions of fans call him “the madman” and “the wig” due to his ferocity and unruly mop of hair. He refers to himself as “the lion.” He thinks sex education is a Marxist plot to destroy the family, views his cloned mastiffs as his “children with four paws” and has suggested people should be allowed to sell their own vital organs.",
      "publishedAt": "2023-11-20T06:45:06Z",
      "title": "The lion, the wig and the warrior. Who is Javier Milei, Argentina's president-elect?",
      "url": "https://apnews.com/82488d49cca5aee10d4b911bde530922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61d2a141ab0b4b2d85ca7383e40755a8/3000.jpeg"
    },
    {
      "author": "COURTNEY BONNELL and MATT O'BRIEN",
      "description": "Microsoft on Monday hired two leading executives from the company that created ChatGPT after one of them was abruptly fired by OpenAI, the startup whose chatbot kicked off the era of generative artificial intelligence.",
      "publishedAt": "2023-11-20T09:27:54Z",
      "title": "Microsoft hires 2 leading executives from company that created ChatGPT",
      "url": "https://apnews.com/a110b173c3eff4a374992017f05cd45a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e7e5ab51dbe4ef380dce65cf732e02e/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A federal appeals court appeared inclined Monday to reimpose at least some restrictions on Donald Trump’s speech in his landmark election subversion case.",
      "publishedAt": "2023-11-20T05:10:37Z",
      "title": "Court seems inclined to keep restricting Trump's trial speech. But gag order could be narrowed",
      "url": "https://apnews.com/f6e37b4193a408a990dd3837609acc8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad47745df62420fbc196f517ea97438/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Liberty and Bell can spread their wings without fear. The two Thanksgiving turkeys played their part Monday in an annual holiday tradition at the White House: a president sparing them from becoming someone's dinner.",
      "publishedAt": "2023-11-20T05:03:18Z",
      "title": "Biden pardons National Thanksgiving Turkeys while marking his 81st birthday with jokes about his age",
      "url": "https://apnews.com/014375a236ba6a5995f6ed3d32c540c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb8f00e3da5d41d7ae6baa41fa6fc7b7/1920.jpeg"
    },
    {
      "author": "TARA COPP and FELIPE DANA",
      "description": "KYIV, Ukraine (AP) — U.S. Defense Secretary Lloyd Austin made an unannounced visit to Kyiv on Monday in a high-profile push to keep money and weapons flowing to Ukraine even as U.S.",
      "publishedAt": "2023-11-20T08:20:31Z",
      "title": "US Defense Secretary Austin meets with Zelenskyy in Kyiv to show steadfast support for Ukraine",
      "url": "https://apnews.com/a168d0cffeebea70fd080c34a104ea47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65ca3e131067480294d5dffb32f50802/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — The Washington chattering class, often unsure what to make of outsiders, dubbed Rosalynn Carter the “Steel Magnolia” when she arrived as first lady.A devout Baptist and mother of four, she was diminutive and outwardly shy, with a soft smile and softer Southern accent.",
      "publishedAt": "2023-11-19T20:29:25Z",
      "title": "Rosalynn Carter: Advocate for Jimmy Carter and many others, always leveraging her love of politics",
      "url": "https://apnews.com/69fadff26354d26bdda94c5d52558a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/674cbce379d34819a1fd8f3820dcb541/2469.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "When Staff Sgt. Buck Aldridge fatally shot Leonard Cure during a roadside struggle after pulling him over for speeding, it wasn’t the first time a traffic stop involving the Camden County sheriff's deputy had spiraled into violence.",
      "publishedAt": "2023-11-20T05:16:17Z",
      "title": "Georgia deputy who shot absolved man had been fired for excessive force. Critics blame the sheriff",
      "url": "https://apnews.com/a59c5ec381f11da36e9f6288d98fd6cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ede256eb369c4baca5fc9c070940dfba/2001.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "KANSAS CITY, Mo. (AP) — Good luck going anywhere these days without hearing or seeing something that has to do with Philadelphia Eagles center Jason Kelce or his younger brother, Travis Kelce, the star tight end of the Super Bowl champion Kansas City Chiefs.",
      "publishedAt": "2023-11-19T17:50:33Z",
      "title": "Kelce Bowl: Chiefs' Travis, Eagles' Jason the center of attention in a Super Bowl rematch",
      "url": "https://apnews.com/6344866ebb6270021d412aefc827e658",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a93ddc35352e404797145ceac7ca3380/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}