{
  "articles": [
    {
      "author": "Ty ONeil",
      "description": "“Today” show host Savannah Guthrie is pleading for the public’s help at “an hour of desperation” in the search for her missing mother. The family’s latest attempts to reach the abductors failed to yield any proof that she's alive or communication with the culprits. The FBI says it's not aware of ongoing communication between the family and the suspected kidnappers. The FBI says it hasn't identified any suspects or persons of interest in the disappearance of 84-year-old Nancy Guthrie. Guthrie says her family in Arizona continues to believe her mother is out there and hearing everyone’s prayers. By Monday evening, a purported ransom deadline apparently set by her mom’s abductors appeared to have passed.",
      "publishedAt": "2026-02-10T13:42:53Z",
      "title": "Savannah Guthrie pleads for help in search for missing mom",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-b765fed6b9669441383b75860263ac99",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bf5e6d/2147483647/strip/true/crop/3405x2269+47+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F91%2F0fbbcbecf1a9148a29f221924c3b%2F70a04c2b49b34cbbb96fb33014034181"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking, Seung Min Kim",
      "description": "Democratic leaders say a proposal from the White House is “incomplete and insufficient” as they are demanding new restrictions on President Donald Trump’s immigration crackdown and threatening a shutdown of the Homeland Security Department. Senate Democratic leader Chuck Schumer and House Democratic leader Hakeem Jeffries said in a statement late Monday that a White House counterproposal to the list of demands they transmitted over the weekend “included neither details nor legislative text” and does not address “the concerns Americans have about ICE’s lawless conduct.” The White House proposal was not released publicly.",
      "publishedAt": "2026-02-10T05:02:02Z",
      "title": "Democrats say White House offer on ICE 'insufficient' as funds deadline looms",
      "url": "https://apnews.com/article/democrats-ice-white-house-homeland-security-funding-84d4b2e5a7123f2b316cca4857b7762a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7be6cd0/2147483647/strip/true/crop/3212x2140+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fc7%2Ffc09ae73a40795864afc9e5627b6%2Fdb72da265c09489893106e222fddc4b8"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iranian security official Ali Larijani is traveling to Oman, the country currently mediating talks between Tehran and the United States over Iran's nuclear program. Larijani will likely deliver Iran's response Tuesday to recent indirect talks held in Muscat. He is expected to meet with Omani Foreign Minister Badr al-Busaidi and Sultan Haitham bin Tariq. The talks are described as \"important,\" though details remain unclear. The U.S. has increased its military presence in the Middle East, including sending the aircraft carrier USS Abraham Lincoln, to pressure Iran into an agreement.",
      "publishedAt": "2026-02-10T02:22:08Z",
      "title": "Top Iran security official to travel to Oman, site of US talks",
      "url": "https://apnews.com/article/iran-oman-us-nuclear-talks-protests-crackdown-50cc3b6261bfd90ebe01da64ba9576d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee0092c/2147483647/strip/true/crop/7259x4837+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fa6%2F58be052657abeb27b367235454a7%2Ff173668a687649b2b5506e358222dc3b"
    },
    {
      "author": "Jill Lawless",
      "description": "Keir Starmer has secured a temporary respite after fallout from the Jeffrey Epstein files threatened his leadership. The British prime minister was saved by a fightback and hesitation among Labour Party rivals about the consequences of a coup. Energy Secretary Ed Miliband said Tuesday that Labour lawmakers decided to unite behind Starmer. The crisis stems from Starmer's decision to appoint Epstein friend Peter Mandelson as U.K. ambassador to Washington. Starmer has apologized and said that Mandelson had lied about his ties to Epstein. Starmer's leadership remains shaky despite firing Mandelson. Many lawmakers are concerned about their reelection chances.",
      "publishedAt": "2026-02-10T13:54:47Z",
      "title": "UK leader Starmer averts a leadership challenge for now but remains damaged by Epstein fallout",
      "url": "https://apnews.com/article/uk-keir-starmer-leadership-crisis-mandelson-epstein-729040b1bc95a74ebbdeb7f19f9d7487",
      "urlToImage": "https://dims.apnews.com/dims4/default/b414b8c/2147483647/strip/true/crop/1954x1302+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Ff6%2F22c9270c77741c54a6bc2e085366%2Fd2ec0a1d2a6f4530b59876ce3cf111c8"
    },
    {
      "author": "Wafaa Shurafa, Edna Tarigan",
      "description": "Two Palestinian men riding bicycles were killed in an Israeli drone strike Tuesday, hospital officials said, as deadly violence continued in Gaza despite an October ceasefire. Gaza health authorities say 586 Palestinians have been killed since the truce took effect, bringing the war’s overall toll to more than 72,000. Israel says its strikes respond to ceasefire violations. Some elements of the agreement have advanced, including the return of all hostages and limited reopening of the Rafah crossing. Plans for an international stabilization force are also emerging, with Indonesia saying it is preparing thousands of troops for humanitarian and reconstruction roles, though the force’s mandate remains unclear.",
      "publishedAt": "2026-02-10T14:03:17Z",
      "title": "Israeli drone strike kills 2 cyclists in Gaza",
      "url": "https://apnews.com/article/gaza-hamas-israel-war-2-10-2026-08acadd177a13e971de88c56b12d456f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3629e1/2147483647/strip/true/crop/5811x3872+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F7f%2F30dce7d754e21af65728b5fde9ff%2F59f6370759c5469a9af98514eaab3d71"
    },
    {
      "author": "Matthew Daly, Seung Min Kim",
      "description": "A White House official says the Trump administration is expected this week to revoke a scientific finding that long has been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change. The Environmental Protection Agency will issue a final rule rescinding a 2009 government declaration known as the endangerment finding. That Obama-era policy determined that carbon dioxide and other greenhouse gases endanger public health and welfare. Legal challenges are certain. The White House official spoke on condition of anonymity because they were not authorized to confirm the details ahead of the official announcement.",
      "publishedAt": "2026-02-10T13:18:14Z",
      "title": "Trump to gut US climate change policy and environmental regulations",
      "url": "https://apnews.com/article/trump-climate-change-rule-repeal-233228a5cf2a71f0ecbcd14281530706",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a8259b/2147483647/strip/true/crop/4583x3054+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F6d%2Fe72ba8d0f95ba0683dade1410d9f%2F6c88cc049333433d8fd8045567bffefc"
    },
    {
      "author": "Rebecca Santana",
      "description": "The heads of agencies enforcing President Donald Trump's immigration agenda are set to testify before Congress. This comes amid scrutiny over the shooting deaths of two protesters in Minneapolis by Homeland Security officers. Todd Lyons of Immigration and Customs Enforcement, Rodney Scott of Customs and Border Protection, and Joseph Edlow of U.S. Citizenship and Immigration Services will appear before the House Committee on Homeland Security. Critics argue ICE and CBP officers use excessive force and violate rights. Lyons, who has led ICE since March, defends his officers' tactics. The administration's mass deportation strategy faces growing criticism and declining public support.",
      "publishedAt": "2026-02-10T12:02:54Z",
      "title": "Trump's immigration chiefs are set to testify in Congress",
      "url": "https://apnews.com/article/immigration-customs-enforcement-border-patrol-trump-congress-1fa0cc0c9297479fcc02b1dc5a706d37",
      "urlToImage": "https://dims.apnews.com/dims4/default/92fefb5/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F63%2F310a95a22bd7e458f4394602dfee%2F4ee27af1affe42aea8264eca07eb06ee"
    },
    {
      "author": "Patrick Whittle, Kimberlee Kruesi",
      "description": "Maine’s Republican Sen. Susan Collins has announced her reelection bid, entering a closely watched race that Democrats have targeted in their effort to retake the Senate majority in Congress in this year’s midterm elections. Collins has defended the seat for decades, casting herself as a reflection of Maine’s independent spirit. However, Collins has faced criticism for not condemning President Donald Trump’s immigration tactics. Democratic Gov. Janet Mills and oyster farmer Graham Platner are top Democratic challengers. Platner recently outraised both Mills and Collins. Collins previously defeated Democrat Sara Gideon in 2020 despite being outspent.",
      "publishedAt": "2026-02-10T14:39:38Z",
      "title": "Susan Collins announces reelection bid for Maine Senate seat",
      "url": "https://apnews.com/article/maine-collins-senate-election-fa5ce2fb3bda41e4ec1c87c3cc72c140",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e1c2aa/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F2a%2F45917092e3f91bfb817d627c50a8%2F22523c2b06d146578ffe9e1c54d03c16"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Asian shares are mostly higher as Japan’s benchmark topped new highs after a historic election win for the nation’s first female prime minister. Tokyo's benchmark Nikkei 225 jumped on Tuesday, having set records the day before with a 3.9% advance after Prime Minister Sanae Takaichi's ruling Liberal Democrats scored a landslide victory in a parliamentary election. Shares slipped in Australia but rose in South Korea and China. U.S. stocks finished higher. The S&P 500, rising 0.5%, pulled closer to its all-time high set two weeks ago. The Dow Jones Industrial Average edged up by less than 0.1%. The Nasdaq gained 0.9%.",
      "publishedAt": "2026-02-10T03:36:21Z",
      "title": "Asian shares climb, led by post-election rally in Japan",
      "url": "https://apnews.com/article/stock-markets-inflation-tariffs-jobs-483d72163e6a4e21c61b8a8b1b2f3821",
      "urlToImage": "https://dims.apnews.com/dims4/default/98b9e5c/2147483647/strip/true/crop/8000x5331+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F8b%2F55e33bb1f38e2c056277b9f4afca%2F0afd8e1d52e048febbda47d7e3cc0549"
    },
    {
      "author": "Steve Douglas",
      "description": "Olympic redemption will have to wait for Mikaela Shiffrin. The American skiing standout was given the ideal platform to win the new team combined event at the Milan Cortina Games after partner Breezy Johnson led the opening downhill leg. Shiffrin raced the slalom leg and finished 15th. That dropped the U.S. to fourth place. Shiffrin has gone seven straight Olympic races without a medal stretching back to Beijing in 2022. Johannes Høsflot Klæbo of Norway powered to his second straight Olympic gold medal and seventh of his career by winning the men’s cross-country sprint. He is one gold off the all-time Winter Olympics record.",
      "publishedAt": "2026-02-10T16:07:16Z",
      "title": "Shiffrin out of the medals again at Winter Olympics as Klæbo wins another gold",
      "url": "https://apnews.com/article/winter-olympics-shiffrin-klaebo-fontana-botn-d284237c724fdfba2ebc0d7f34058fff",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1c2631/2147483647/strip/true/crop/4516x3009+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F4c%2F5c52f58fd2aa0a3db89c55d7291c%2F9440dfe8d770452d889b38e425486232"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}