{
  "articles": [
    {
      "author": "LINLEY SANDERS, LEANNE ITALIE, EUNICE ESOMONUE, HUMERA LODHI, ANNIE NG",
      "description": "Some U.S. adults consider Valentine's Day outdated, according to a new AP-NORC poll — but many more say they love the romance and fun of quality time with partners, friends and extended family.",
      "publishedAt": "2025-02-13T22:11:31.055Z",
      "title": "Many Americans think Valentine's Day is romantic and fun — not outdated or stressful: AP-NORC poll",
      "url": "https://apnews.com/article/valentines-day-poll-survey-ed8022bbc4726c02800e410ea88e5a8a",
      "urlToImage": "https://assets.apnews.com/8c/8b/402b05d54fb5be8d6c5b7549eaa1/social-share-image-1.jpg"
    },
    {
      "author": "GIADA ZAMPANO",
      "description": "Food, music and culture have made the Italian southern city of Naples famous around the globe. But there’s another Neapolitan tradition that fascinates locals and visitors alike: the cornicello, an iconic symbol of prosperity, love and fortune that has become a popular present among lovers on Valentine’s Day. The cornicello is a traditional amulet that in Neapolitan culture represents good luck and protection against the evil eye. Its shape, resembling a small horn, is associated with fertility and strength, while the red, intense color is considered a powerful antidote against negative energies.",
      "publishedAt": "2025-02-14T02:01:32Z",
      "title": "An iconic symbol of love and fortune, the red horn 'cornicello' brings Naples tradition to the world",
      "url": "https://apnews.com/article/italy-naples-red-horns-cornicelli-valentines-day-love-good-luck-4d6cc5d8e05b7d515ea72ab6081e504e",
      "urlToImage": "https://dims.apnews.com/dims4/default/624c698/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F0a%2Ff62516c2160cf3e23b1073568b08%2F82d7f830d43448aab1691eb43aa00f95"
    },
    {
      "author": "MARK THIESSEN",
      "description": "Feel like dissing instead of kissing your former lover this Valentine’s Day? Think your ex is more like a rat than a prince? Animal shelters and zoos around the country are encouraging little cathartic acts of revenge this holiday — and raising money for a cause — with a slew of darkly funny fundraisers. At an Anchorage bird treatment center, you can name a frozen rat for your ex and get a video of it being eaten by a raptor. In Memphis, you can memorialize your former lover's name over a video of an elephant pooping. And many shelters are offering to name a feral cat after your ex — and then neutering it.",
      "publishedAt": "2025-02-13T06:05:58Z",
      "title": "Valentine’s Day: Why people are naming bugs, rats and cats after their exes",
      "url": "https://apnews.com/article/valentines-day-animal-shelters-fundraisers-rats-elephants-40537881d8f5ad65dd971fef11a856f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ffb38e4/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Fd2%2Fa5412753dd5596be15dedc42d767%2F4282badf424f47c8a72bb463f86125f6"
    },
    {
      "author": "ALBERT STUMM",
      "description": "Lovers have always batted their eyes on Valentine’s Day as cherubs circled overhead. Or have they? Historians aren’t sure where the holiday comes from, but many myths claim to to explain its origin. For years, they thought it had something to do an ancient Roman fertility festival held in mid-February called Lupercalia. That coincided with the supposed martyrdom of one of two St. Valentines. But some historians now think the English writer Geoffrey Chaucer was the first to associate the holiday with love in the 14th century. It would be another 400 years or so before cards and heart-shaped boxes came into play.",
      "publishedAt": "2025-02-12T13:53:52Z",
      "title": "Origins of Valentine's Day are murky",
      "url": "https://apnews.com/article/valentines-day-history-2d9a2d67c95ae06322aa9417c62a6baf",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd797c4/2147483647/strip/true/crop/1920x1080+0+99/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F85%2Ffb337fe9c57aa619f04efa45d654%2Fd8251d0e6af343568d1b9a85d452e7a7"
    },
    {
      "author": "CHRISTOPHER KIMBALL",
      "description": "This loaf cake comes together quickly and easily, and boasts a remarkably deep color, intensely rich flavor and a plush, velvety crumb. To achieve the cake’s deep, complex chocolatiness, the cooks at Christopher Kimball’s Milk Street use a generous amount of bittersweet chocolate and unsweetened cocoa powder. Any type of bittersweet chocolate will work, but for best results use one that’s tasty enough to eat out of hand and contains about70 percent cocoa solids. Serve slices with spoonfuls of crème fraîche, which has a subtle tang and creaminess that are fantastic foils for the cake.",
      "publishedAt": "2025-02-10T15:12:38Z",
      "title": "Two types of chocolate in an elegant loaf cake for Valentine's Day",
      "url": "https://apnews.com/article/double-chocolate-loaf-cake-recipe-valentines-milk-street-aa516b7c143321df1fe29165bacdfc38",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a089bf/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F17%2Fb0415fad7c3a8e47b76650f38933%2Fdbed9818ed3b4dfaba044637e8f3845f"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "After nearly 500 days in captivity in Gaza, with little access to media, recently freed hostages have many questions. Now home in Israel, they are confronting a flood of information about loved ones and destroyed communities, and are still figuring out their place in a changed world. Their families are grappling with how to fill them in on what they missed without potentially deepening their trauma. One hostage forced to speak at a staged Hamas ceremony before his release told a crowd of masked militants and journalists that he was looking forward to seeing his wife and two teenage daughters. It wasn't until he arrived back in Israel that he learned the crushing reality: all three had been killed during the Oct. 7 attack.",
      "publishedAt": "2025-02-14T13:46:23Z",
      "title": "Hostages freed from Gaza painfully piece together a changed world",
      "url": "https://apnews.com/article/israel-hostages-gaza-hamas-ceasefire-af820b4bd1d62de94e2022b521db268c",
      "urlToImage": "https://dims.apnews.com/dims4/default/affd4e0/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F87%2F46fa691be794d9b03affc412dc37%2F5625e60bd3ab4d1eb63643ff2e8409a0"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "Indian Prime Minister Narendra Modi and SpaceX CEO Elon Musk met during Modi's visit to the U.S., where he spoke with Trump about trade and tariff concerns. Modi said he and Musk discussed various issues including space, mobility, technology and innovation, but made no direct reference to the billionaire's Starlink satellite internet services. Musk has long wanted Starlink to make an entry into the Indian market. Its launch, however, has been delayed due to regulatory challenges, security concerns and opposition from domestic telecom giants.",
      "publishedAt": "2025-02-14T09:14:01Z",
      "title": "Elon Musk met with Modi during the Indian prime minister's US visit. What does he want from India?",
      "url": "https://apnews.com/article/india-us-modi-musk-187301d9afe2c6d0edb0542466c2a589",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcb19b5/2147483647/strip/true/crop/2200x1238+0+114/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fc4%2F4ff8593c635c219bcba0812e93e3%2Fcd64895d01b44c58a0c9156fcaaeb7d0"
    },
    {
      "author": "ELLEN KNICKMEYER, LINDSAY WHITEHURST",
      "description": "A federal judge has ordered the Trump administration to temporarily lift a funding freeze shutting down U.S. humanitarian aid and development worldwide. Judge Amir Ali's order Thursday gives the Republican administration five days to show it’s complying. The judge cites the financial devastation that the sudden funding cutoff has caused suppliers and nonprofits that help the U.S. carry out aid programs overseas. Contractors, farmers and suppliers in the U.S. and around the world say the Trump administration’s funding freeze has stiffed them on hundreds of millions of dollars. Trump says the U.S. Agency for International Development, or USAID, and much of foreign assistance overall is out of line with his agenda.",
      "publishedAt": "2025-02-14T13:01:35Z",
      "title": "Judge sets a 5-day deadline for the Trump administration to start lifting its USAID funding freeze",
      "url": "https://apnews.com/article/usaid-trump-funding-freeze-musk-lawsuit-67e4c708955a652e5e4d39ce157d6113",
      "urlToImage": "https://dims.apnews.com/dims4/default/d12e960/2147483647/strip/true/crop/5921x3331+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Ffe%2Fe64363a6441b949af6175d0e675a%2F90a36d535b1c4ca5a255f18d6be40c83"
    },
    {
      "author": "FATIMA HUSSEIN, JOSH BOAK",
      "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system. That's after Democratic senators raised red flags about the access provided to Trump aide Elon Musk’s Department of Government Efficiency. The audit will also review the past two years of the system’s transactions as it relates to Musk’s assertion of “alleged fraudulent payments.” That's according to a letter from Treasury’s deputy inspector general obtained Friday by The Associated Press. The audit marks part of the broader effort led by Democratic lawmakers and federal employee unions to provide transparency about DOGE’s activities under President Donald Trump's Republican administration.",
      "publishedAt": "2025-02-14T15:00:34Z",
      "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
      "url": "https://apnews.com/article/treasury-inspector-general-audit-doge-musk-democrats-d1e2710d0b63f54a8c1fe50fe4f23d4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03d34b/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fef%2Fb447c386aed921b95de41bf9d695%2Fcbf9c83827c049c99de488ebc7fc15ad"
    },
    {
      "author": "AAMER MADHANI, EMMA BURROWS, STEFANIE DAZIO",
      "description": "Ukrainian President Volodymyr Zelenskyy says he will only agree to meet in-person with Russian leader Vladimir Putin after a common plan is negotiated with U.S. President Trump. Zelenskyy believes Trump is the key to ending the Russia-Ukraine conflict. Zelenskyy spoke Friday to the Munich Security Conference. Trump this week upended years of steadfast U.S. support for Ukraine. Zelenskyy is expected to meet with U.S. Vice President JD Vance later. Many observers, particularly in Europe, hope Vance will shed at least some light on Trump’s ideas for a negotiated settlement to the war following a phone call between Trump and Putin this week.",
      "publishedAt": "2025-02-14T05:02:03Z",
      "title": "Zelenskyy says he will only agree to meet with Putin after common plan with Trump is negotiated",
      "url": "https://apnews.com/article/vance-rubio-munich-security-conference-ukraine-ab2d7379aaf6ca224cc51e1f9ade9edf",
      "urlToImage": "https://dims.apnews.com/dims4/default/7246768/2147483647/strip/true/crop/7029x3954+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F2b%2F598bf94401f6f913ad781da3f5c1%2Fb95a3f95cc5c402fb8da48d8db41f607"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}