{
  "articles": [
    {
      "author": "ALAN SUDERMAN and GARANCE BURKE",
      "description": "WASHINGTON (AP) — The Kremlin could not have asked for better publicity at a better time when Ben Swann, a self-described independent journalist who promotes conspiracy theories, released a 12-part video series he promised would reveal dark truths about Ukrainian President Volodymyr Zelenskyy.",
      "publishedAt": "2024-10-18T04:11:34Z",
      "title": "Right-wing influencers hyped anti-Ukraine videos made by a TV producer also funded by Russian media",
      "url": "https://apnews.com/9d4281756246b94eda05c478f3dac203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16a84eb3119142a99663f07e3a3c2eef/2351.jpeg"
    },
    {
      "author": "SARAH EL DEEB, FARNOUSH AMIRI, and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Israel said Tuesday that one of its airstrikes outside Beirut earlier this month killed a Hezbollah official widely expected to replace the militant group's longtime leader, who was killed by an Israeli airstrike last month.",
      "publishedAt": "2024-10-22T07:37:31Z",
      "title": "Israel says it killed a Hezbollah official expected to be the group's next leader",
      "url": "https://apnews.com/5a8d5a051e05267007192ac5c8d80efd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e10590b8f329408d99973d7544a3cccb/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Since Israel began bombarding Beirut's southern suburbs as part of its offensive against the Hezbollah militant group, Lebanon's national air carrier has become a local icon simply by continuing to do its job.",
      "publishedAt": "2024-10-22T18:09:52Z",
      "title": "The little airline that could — Lebanon's national carrier braves Israeli airstrikes",
      "url": "https://apnews.com/4abfae7f6165b7b34083e2512272ce54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f1b6e2114514a0b9f323a426234dc4f/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, JILL COLVIN and THOMAS BEAUMONT",
      "description": "MIAMI, Florida (AP) — Donald Trump on Tuesday described Democratic opponent Kamala Harris as “lazy,\" railed against green energy and talked about “extreme\" presidential power during a campaign event promoted as a business economic roundtable aimed at Latino voters.",
      "publishedAt": "2024-10-22T09:02:16Z",
      "title": "Trump airs list of familiar grievances as he and Harris seek Latino votes",
      "url": "https://apnews.com/18e99a491ba6df73f61a8c6cca004fd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6afd0f46376547d59793ee6f1064277f/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and MATT BROWN",
      "description": "WASHINGTON (AP) — Republican presidential nominee Donald Trump on Tuesday called his Democratic opponent Kamala Harris “lazy,\" criticizing the vice president with a word long used to demean Black people in racist terms.",
      "publishedAt": "2024-10-22T20:19:30Z",
      "title": "Trump denigrates Harris as 'lazy,' invoking a racist trope against Black people",
      "url": "https://apnews.com/4c2ded1046e492c5d24c7382245d0f7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c793e1ab3214d87b176547d4c7e0c4a/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "E. coli food poisoning linked to McDonald’s Quarter Pounder hamburgers has sickened at least 49 people in 10 states, including one person who died and 10 who were hospitalized, federal health officials said Tuesday.",
      "publishedAt": "2024-10-22T21:09:48Z",
      "title": "Deadly E. coli outbreak linked to McDonald's Quarter Pounders sickens 49 people in 10 states",
      "url": "https://apnews.com/422c4687cc9218efda03cae73b01f473",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a90ddfe88b1c4a399fb291782cca0907/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Rudy Giuliani must turn over sports memorabilia and other prized possessions to two Georgia election workers who won a $148 million defamation judgment against him, including his New York City apartment, more than two dozen luxury watches and a 1980 Mercedes once owned by movie star Lauren Bacall, a judge ruled Tuesday.",
      "publishedAt": "2024-10-22T20:32:11Z",
      "title": "Rudy Giuliani ordered to turn over NYC apartment, 26 watches to Georgia election workers",
      "url": "https://apnews.com/799b168fe2fa52a3b59aca2034a816f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/280c743f64ce4e21abf33db3e3b4ad99/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "MACON, Ga. (AP) — Sabrina Friday scanned the room at Mother's Nest, an organization in Macon that provides baby supplies, training, food and housing to mothers in need, and she asked how many planned to vote.",
      "publishedAt": "2024-10-22T04:11:35Z",
      "title": "In battleground Georgia, some poor people see no reason to vote. That decision could sway election",
      "url": "https://apnews.com/34209a5bba0b2697eb6fcdd004dca584",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c9b0e439d24614bd9a54e6071a8c4e/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Former Abercrombie &amp; Fitch CEO Mike Jeffries, his romantic partner and a third man were arrested Tuesday on charges of luring men into drug-laced, outlandish and coercive sex parties by dangling the promise of modeling for the retailer's once-defining beefcake ads.",
      "publishedAt": "2024-10-22T13:54:23Z",
      "title": "Former Abercrombie & Fitch chief Mike Jeffries arrested on federal sex trafficking charges",
      "url": "https://apnews.com/f95f6b480dcb41e5365fa9b49f6206bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d49accd83793484d95b276ca0f09fd52/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Women living in states with abortion bans obtained the procedure in the second half of 2023 at about the same rate as before the U.S. Supreme Court overturned Roe v.",
      "publishedAt": "2024-10-22T13:00:30Z",
      "title": "Women in states with bans are getting abortions at similar rates as under Roe, report says",
      "url": "https://apnews.com/663be20ac1a40345ec5c8fe23ab43a60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/177a27ef3def4e8ea1dfeb1258d65faf/2470.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}