{
  "articles": [
    {
      "author": "MARTHA BELLISLE, HALLIE GOLDEN and LISA BAUMANN",
      "description": "ISSAQUAH, Wash. (AP) — A major storm swept across the northwestern U.S., battering the region with strong winds and rain, causing widespread power outages, closing schools and downing trees that killed at least two people.",
      "publishedAt": "2024-11-20T07:01:30Z",
      "title": "'Bomb cyclone' kills 2 and knocks out power to over half a million homes across the northwest US",
      "url": "https://apnews.com/aadbd4863dd989189d31c1c2187b5025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58e2a5af02d04b178afb52ddd338ddbb/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Ethics Committee Republicans voted Wednesday against releasing the panel’s long-running investigation into President-elect Donald Trump’s nominee for attorney general, former Rep.",
      "publishedAt": "2024-11-20T16:58:00Z",
      "title": "Republicans on House Ethics reject for now releasing report on Matt Gaetz",
      "url": "https://apnews.com/5f9c684bb695df143beffbf8f956b09c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22fa7fbd0622419f8beb5678b83e6524/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, ZEKE MILLER and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — As senators prepare to consider President-elect Donald Trump's picks for his Cabinet, they may be doing so without a well-established staple of the confirmation process: an FBI background check.",
      "publishedAt": "2024-11-20T19:42:00Z",
      "title": "Lawmakers are concerned about background checks of Trump's Cabinet picks as red flags surface",
      "url": "https://apnews.com/ac9afcd41d598a62ae34442ecf96a652",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c17eb3ecd29a4957907ad63763376412/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS and MAKIYA SEMINERA",
      "description": "COLUMBIA, S.C. (AP) — A parole board decided unanimously Wednesday that Susan Smith should remain in prison, despite her plea that God has forgiven her for infamously killing her two young sons 30 years ago by rolling her car into a South Carolina lake while they were strapped in their car seats.",
      "publishedAt": "2024-11-20T05:02:59Z",
      "title": "Susan Smith is denied parole 30 years after drowning 2 sons by rolling car into South Carolina lake",
      "url": "https://apnews.com/3c7c12e0cd0a23eee0e42a599b689597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7e96f76cdeb4d3c8298c1b198dc3bb5/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — An Indian businessman who is one of the world’s richest people has been indicted in the U.S. on charges he duped investors by concealing that his company's huge solar energy project on the subcontinent was being facilitated by an alleged bribery scheme.",
      "publishedAt": "2024-11-20T21:10:46Z",
      "title": "US charges billionaire Gautam Adani with defrauding investors, hiding plan to bribe Indian officials",
      "url": "https://apnews.com/9f4c7ff20e7a47ae560c2ad72f4dda44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5e655fdfdcb4efa872f5435179d2543/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. decision to provide Ukraine with antipersonnel land mines expands the use of a weapon that the international community has long condemned because of its danger to innocent civilians.",
      "publishedAt": "2024-11-20T18:43:07Z",
      "title": "The US is sending antipersonnel land mines to Ukraine. Here's what it means",
      "url": "https://apnews.com/76fb21ce12f70aa965d3d7fbccb35c9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/606e7b52322e4c13a6e3db76ce3c60ea/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Brazilian President Luiz Inácio Lula da Silva on Wednesday welcomed China’s President Xi Jinping for a state visit at the Alvorada Palace in Brasilia, the latest sign of deepening ties between the two countries that analysts say may accelerate as Donald Trump returns to the White House in 2025.",
      "publishedAt": "2024-11-20T21:54:12Z",
      "title": "Brazil’s Lula welcomes China's Xi for state visit as ties between countries strengthen",
      "url": "https://apnews.com/b979f2f78530c917b37c47f97f24d96a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23af3d834eee4c2181999b6a515be698/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israeli officials demanded Wednesday the freedom to strike Lebanon's Hezbollah as part of any cease-fire deal, raising a potential complication as a top U.S.",
      "publishedAt": "2024-11-20T15:09:55Z",
      "title": "Israeli officials demand the right to strike Hezbollah under any cease-fire deal for Lebanon",
      "url": "https://apnews.com/1b39fe8499097c2f2579fce50d083263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c9055296b4433b8a2537a5c6fb9a10/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — The former members of One Direction reunited Wednesday for the funeral of bandmate Liam Payne.",
      "publishedAt": "2024-11-20T14:36:56Z",
      "title": "Liam Payne's One Direction bandmates among the mourners at singer's funeral",
      "url": "https://apnews.com/1cb8a70a68ac1405b8fbb4fe3805437b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0b6f7ef902b4081965542d671071e6f/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "NASHVILLE, Tenn. (AP) — President-elect Donald Trump has endorsed a line of guitars, following up on the Bibles, sneakers, watches, photo books and cryptocurrency ventures launched during his third White House campaign.",
      "publishedAt": "2024-11-20T21:14:06Z",
      "title": "Donald Trump's latest branded venture is guitars that cost up to $10,000",
      "url": "https://apnews.com/d585331e2a1f55316c52ad8121ef6826",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/812cc909db894661803d7ecd86747040/2798.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}