{
  "articles": [
    {
      "author": null,
      "description": "Iran’s Supreme Leader Ali Khamenei claimed victory over Israel on Thursday in his first public statement since a ceasefire was declared in the war between the two countries. Khamenei hasn't been seen in public since taking shelter in a secret location after the outbreak of the war June 13 when Israel attacked Iranian nuclear facilities and targeted top military commanders and scientists. In his first comment posted on X he offered his “congratulations on the victory” over Israel.",
      "publishedAt": "2025-06-26T10:25:35Z",
      "title": "Iran’s Supreme Leader makes first public statement since ceasefire declared in Israel-Iran war",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-26-2025-d09bf2282deea3b2edd63f29c867c058",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Many Iranians are still reeling from the 12-day war with Israel and a sudden, U.S.-brokered ceasefire. Now, as they return to their neighborhoods deeply shaken by Israeli air assaults, fears mount over what the country’s theocracy may do next. Human rights advocates have already warned that Iran’s government is ramping up executions of dissidents and political prisoners. Four Iranians recounted to The Associated Press that they believe only a minority in the Islamic Republic still firmly supports its leadership. They said they are concerned the fallout from Israel’s attack will derail any momentum for change in the country’s clerical rule, in place since the 1979 Islamic Revolution.",
      "publishedAt": "2025-06-25T18:18:43Z",
      "title": "Iranians wonder what comes next after 12-day war with Israel",
      "url": "https://apnews.com/article/iran-israel-us-war-nuclear-program-tehran-43365ba495100c55a8d876ba67cf0ccd",
      "urlToImage": "https://dims.apnews.com/dims4/default/09d1a2d/2147483647/strip/true/crop/8244x4637+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fe1%2F4b161b36bb7194b41e27a65069e8%2F0cc4af08cf8041969fadaa32391c6571"
    },
    {
      "author": null,
      "description": "U.S. Health Secretary Robert F. Kennedy Jr. says the country is ending support for the vaccine alliance Gavi. Speaking at a Gavi meeting in Brussels on Wednesday, Kennedy criticized the organization for “ignoring science” and losing public trust. He expressed concerns about Gavi's collaboration with the World Health Organization during the COVID-19 pandemic, accusing them of stifling free speech. Kennedy also questioned Gavi’s vaccine recommendations, including immunizing pregnant women and funding vaccines in poorer countries. Gavi defended its decisions, citing WHO guidance and the role of vaccines in reducing childhood mortality. The U.S. has contributed $8 billion to Gavi since 2001.",
      "publishedAt": "2025-06-26T11:04:40Z",
      "title": "US pulls funding from global vaccines group, saying it has 'ignored the science'",
      "url": "https://apnews.com/article/us-vaccines-gavi-kennedy-6b5342dcf0473ddd4fcda352699dab65",
      "urlToImage": "https://dims.apnews.com/dims4/default/56bf17e/2147483647/strip/true/crop/3434x1932+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F5d%2F2a5244952690d40f741d58da57ed%2F6a23da2754ca4ab8ad06deafa9458b08"
    },
    {
      "author": null,
      "description": "Zohran Mamdani had been a state lawmaker unknown even to most New Yorkers before announcing his run for mayor. But that was before he declared victory in Tuesday's Democratic primary. The 33-year-old former foreclosure prevention counselor has represented a legislative district in Queens since 2020. He’s also a one-time rapper and son of award-winning Hollywood filmmaker Mira Nair, whose credits include “Monsoon Wedding” and “The Namesake.” Mamdani was born in Uganda and became an American citizen shortly after graduating college. He’s seeking to become the city’s first Muslim and Indian American mayor, not to mention its youngest mayor in generations.",
      "publishedAt": "2025-06-25T16:56:09Z",
      "title": "Who is Zohran Mamdani? State lawmaker seeks to become NYC's first Muslim and Indian American mayor",
      "url": "https://apnews.com/article/nyc-mayoral-democratic-primary-zohran-mamdani-f87ea9d5b649cea8335ca7df6399c1f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/484694f/2147483647/strip/true/crop/5031x2830+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2F10%2Ff3581dfec9a97d568259cc290524%2Fd17e586066934a979525af115ba0dccd"
    },
    {
      "author": null,
      "description": "European Union leaders are meeting in Brussels to address key global and regional issues. They will discuss Thursday tougher sanctions on Russia, U.S. trade tariffs, and the Middle East conflicts. Ukrainian President Volodymyr Zelenskyy will join via videoconference as the EU debates further sanctions and a Russian oil price cap. Defense and security dominate the agenda following a NATO summit where leaders pledged increased defense spending. Internal divisions persist, including disagreements over Israel's conduct in Gaza and climate policies. The summit’s conclusions will set the agenda for the bloc for the next four months.",
      "publishedAt": "2025-06-26T04:10:39Z",
      "title": "EU leaders meet to discuss tougher Russia sanctions, US tariffs and Middle East conflicts",
      "url": "https://apnews.com/article/eu-summit-ukraine-tariffs-mideast-fe37c213eb72f7f1589840387db5a7a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf1c8d9/2147483647/strip/true/crop/5270x2964+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F43%2Feec3fe756c592654101ad6b1d6e0%2Fd3aff805ed0a4c01986e379ccff8637a"
    },
    {
      "author": null,
      "description": "Two people have been killed and 17 injured during torrential storms in France. The storms toppled trees, flooded Paris streets and caused parliament’s roof to spring a leak as the prime minister was speaking. Prime Minister François Bayrou pointed out the leak above his head after delivering a speech in the National Assembly as rains beat down outside, quickly inundating Paris boulevards on Wednesday evening. Fire officers patched up the problem with absorbent mats. The storm front broadly swept France after a heat wave. The French civil defense agency said power was also cut to 110,000 homes.",
      "publishedAt": "2025-06-26T08:56:02Z",
      "title": "2 dead and 17 injured during storms in France",
      "url": "https://apnews.com/article/france-storms-parliament-bayrou-ed3f5cd9fac1a683d356effb45fa32a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "An explosion and the stampede that followed at a high school in the Central African Republic have killed at least 29 students and injured over 250. Authorities say the incident happened Wednesday at Barthelemy Boganda High School in the capital, Bangui. The explosion occurred when an electrical transformer malfunctioned as power was being restored. The blast caused a stampede, killing many on the spot, while others died in hospital. The Ministry of Health has confirmed 260 people are receiving treatment. Around 5,000 students were at the school for exams when the tragedy struck.",
      "publishedAt": "2025-06-26T10:44:32Z",
      "title": "An explosion and ensuing stampede kill 29 children in a Central African Republic school",
      "url": "https://apnews.com/article/central-african-republic-school-explosion-bangui-60b9f5152f4493feb2bb2de205455672",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "World shares are mixed and the U.S. dollar has weakened as investors catch their breath following recent bouts of volatility. Traders were turning to U.S. updates on durable goods orders, jobs and consumer spending and what they suggest about how President Donald Trump's higher tariffs are affecting the economy. On Wednesday, the S&P 500 barely budged, staying just 0.8% below its all-time high. The Dow Jones Industrial Average dipped 0.2%, and the Nasdaq composite rose 0.3%. Oil prices have stabilized after plunging by roughly $10 per barrel as worries about potential disruptions to supplies faded with the implementation of a ceasefire in the Israel-Iran war.",
      "publishedAt": "2025-06-26T04:47:38Z",
      "title": "World shares are mixed and dollar weakens",
      "url": "https://apnews.com/article/stocks-markets-trump-tariffs-powell-inflation-caaca074740d9f61a494f426bdc41de0",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ecc326/2147483647/strip/true/crop/1599x899+0+83/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fc9%2F558df6bb3ff7655970a8b486d3fc%2F753f2bf337724e89bfefb4fb067f530f"
    },
    {
      "author": null,
      "description": "The families of hostages held in Gaza have faced a 20-month-long nightmare. As they try to advocate for their loved ones’ fates, they have been confronted with the whims of Israeli and Hamas leaders and the other crises that have engulfed the Middle East. Israel’s war with Iran pushed the hostage crisis and the plight of Palestinian civilians in Gaza to the sidelines. Hostage families again found themselves forced to fight for the spotlight with another regional conflagration. But as that conflict eases, the families are hoping mediators seize the momentum to push for a new ceasefire deal.",
      "publishedAt": "2025-06-26T08:38:59Z",
      "title": "Families of hostages held in Gaza hope ceasefire in Israel-Iran war leads to deal with Hamas",
      "url": "https://apnews.com/article/israel-gaza-hamas-iran-ceasefire-hostages-a54bb1fa663c33f4153a727ec1e396ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd3c8ab/2147483647/strip/true/crop/7670x4314+0+399/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Fc6%2F6ae0196dbfaf4512a5c45232d3ed%2F8e15f3c531394449ab79cf2849ca338d"
    },
    {
      "author": null,
      "description": "Cooper Flagg is headed to the Dallas Mavericks, who may have found their next franchise superstar less than five months after trading one away. The Mavericks took the Duke forward with the No. 1 pick in the draft Wednesday night, selecting the 18-year-old who was the college player of the year in his lone season. Mavericks fans were furious when Dallas traded Luka Doncic to the Los Angeles Lakers on Feb. 1, some immediately threatening to end their support of the team. But the ones who stuck around may quickly love Flagg, who averaged 19.2 points and 7.5 rebounds while leading Duke to the Final Four. Rutgers freshman Dylan Harper was taken by San Antonio with the No. 2 pick.",
      "publishedAt": "2025-06-25T15:09:25Z",
      "title": "Cooper Flagg taken by the Mavericks with the No. 1 pick in NBA draft",
      "url": "https://apnews.com/article/nba-draft-2025-picks-cooper-flagg-315cf506494acafe615e1809531b5be4",
      "urlToImage": "https://dims.apnews.com/dims4/default/79dfa9a/2147483647/strip/true/crop/4800x2700+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F2b%2Fa9fd4d38784a376c64c939cea286%2F39c3c87e72514180b64ce558f3d7f16c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}