{
  "articles": [
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden’s decision to go back on his word and issue a categorical pardon for his son, Hunter, just weeks before his scheduled sentencing on gun and tax convictions was a surprise that wasn't all that surprising.",
      "publishedAt": "2024-12-02T14:17:13Z",
      "title": "Biden's broken promise on pardoning his son Hunter is raising new questions about his legacy",
      "url": "https://apnews.com/d5c8e7fbead7218c9b1e03a290945267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d5ba8a0a09487abb59752d8f2fd932/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family.",
      "publishedAt": "2024-12-02T00:37:34Z",
      "title": "Biden pardons his son Hunter despite previous pledges not to",
      "url": "https://apnews.com/24f3007c2d2f467fa48e21bbc7262525",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88ed9c48f94347cdb1371ed1d92349c5/1920.jpeg"
    },
    {
      "author": "NATALIE MELTZER and SALLY ABOU ALJOUD",
      "description": "JERUSALEM (AP) — Hezbollah fired into a disputed border zone held by Israel on Monday, the militant group's first attack since its ceasefire with Israel took hold last week, after Lebanon accused Israel of violating the truce more than 50 times in recent days.",
      "publishedAt": "2024-12-02T15:38:19Z",
      "title": "Hezbollah fires at an Israeli-held border zone, the group's first strike since a ceasefire began",
      "url": "https://apnews.com/3f334fcb469ac465c7ae2df6922c2c17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5c5877945043ec82f37f2e6048e512/1920.jpeg"
    },
    {
      "author": "CARA ANNA, CAROLYN THOMPSON and JONAH BRONSTEIN",
      "description": "ORCHARD PARK, N.Y. (AP) — Parts of the Great Lakes region saw new snow Monday and faced the prospect of even more this week after U.S. travelers battled harsh weather to get home after Thanksgiving, forecasters said.",
      "publishedAt": "2024-12-02T09:46:17Z",
      "title": "Great Lakes region gets yet more snow after a weekend of snarled Thanksgiving travel",
      "url": "https://apnews.com/2fb107ee1892db8cb9b38f7b30f123a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b0916b259e14553a5bee0f3e8482f4f/1920.jpeg"
    },
    {
      "author": "SUZAN FRASER and KAREEM CHEHAYEB",
      "description": "ANKARA, Turkey (AP) — The recent rapid advance by opposition fighters in Syria shows that Syrian President Bashar Assad must reconcile with his own people and hold dialogue with the opposition, the Turkish foreign minister said Monday.",
      "publishedAt": "2024-12-02T09:18:53Z",
      "title": "Turkey calls for reconciliation between Syria government and opposition to end conflict",
      "url": "https://apnews.com/12341a6c15a772e207a1b5513c11f8fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb9e69e46bc64bc09d913c0a823db4d8/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Travelers heading home after the Thanksgiving holiday set a record on Sunday, as airport officers screened more than 3 million people.The Transportation Security Administration said Monday that it handled 3.09 million travelers, breaking the previous record by about 74,000.",
      "publishedAt": "2024-12-02T15:14:03Z",
      "title": "More than 3 million travelers screened at US airports in a single day. That's a record",
      "url": "https://apnews.com/9b344c4b70c971d2851d184b6e192430",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc0535a281414309bf5c7ad11c386d0f/3000.jpeg"
    },
    {
      "author": null,
      "description": "CONAKRY, Guinea (AP) — At least 56 people, including children, have died after fans at a soccer game in Guinea allegedly clashed over a disputed call by the referee, authorities said Monday.The stampede broke out on Sunday afternoon at the stadium in the city of Nzerekore during the final of a local tournament between the Labe and Nzerekore teams in honor of Guinea’s military leader, Mamadi Doumbouya.",
      "publishedAt": "2024-12-02T06:07:18Z",
      "title": "Guinea stadium stampede kills 56 people following clashes at soccer match, authorities say",
      "url": "https://apnews.com/8663cce728047148546ad4030b1cedf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2be8fc04b034347939198958684e506/1920.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — The president of the International Criminal Court lashed out at the United States and Russia for interfering with its investigations, calling attacks on the court “appalling.”",
      "publishedAt": "2024-12-02T05:09:04Z",
      "title": "Chief of International Criminal Court lashes out at US and Russia over threats and accusations",
      "url": "https://apnews.com/d2b42db2919a4be879bd3df771a4113f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f1cbd23ef614a498edf60924c388460/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — The reopening of Notre Dame this coming weekend is going to be a high-security affair, with a repeat of some measures used during the Paris Olympics and the sealing-off to tourists of the cathedral's island location in the heart of the French capital.",
      "publishedAt": "2024-12-02T12:44:07Z",
      "title": "Stars, heads of state, solemn rituals and high-security celebrations for Notre Dame's reopening",
      "url": "https://apnews.com/efc740d20cf91f5ba1eabf45eecfe8ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58d0f92c3938402ba6bc65af4fea891d/1920.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "She was born on the water — on a boat along the River Bhramaputra in northeastern India on July 3, one of more than 100 million babies to arrive during a convulsive year. Her first tears in this world were frozen in time, available to countless faraway eyes for one simple reason: a photographer was there to bear witness.",
      "publishedAt": "2024-12-02T16:30:14Z",
      "title": "PHOTOS OF THE YEAR: Through photographers' lenses, an epic catalog of humanity in 2024 emerges",
      "url": "https://apnews.com/6e994410e4c7fba7d788cefe58ffb442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a3e4e6fddbd43e39862a7074e7cc5fc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}