{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris will make the “ closing argument ” for her presidential campaign Tuesday from the same site where Donald Trumpfomented the Capitol insurrection, hoping it offers a stark visualization of the alternate futures that voters face if she or Trump takes over the Oval Office.",
      "publishedAt": "2024-10-29T09:04:01Z",
      "title": "Harris reaches for a big moment in her closing argument for 'turning the page' on Trump",
      "url": "https://apnews.com/139a7b390dc30ceab85d9ac56fcc521d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b5520086b05477fa41f2baead1f6396/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a five-story building where displaced Palestinians were sheltering in the northern Gaza Strip killed at least 60 people early Tuesday, more than half of them women and children, Gaza’s Health Ministry said.",
      "publishedAt": "2024-10-29T07:01:11Z",
      "title": "Israeli strike in northern Gaza kills at least 60, officials say",
      "url": "https://apnews.com/befe1b42ef25599539198fa04e089f04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abaa3abbdf9145f7a4a77972efe8923e/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Israel’s attack on Iran likely damaged a base run by the paramilitary Revolutionary Guard that builds ballistic missiles and launches rockets as part of its own space program, satellite images analyzed by The Associated Press on Tuesday showed.",
      "publishedAt": "2024-10-29T12:20:58Z",
      "title": "Satellite photos show Israeli strike likely hit important Iran Revolutionary Guard missile base",
      "url": "https://apnews.com/b9cdb18b252d6dd9014dc4dcb3dd4b2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9274718ef61945da8a2d97e2bff582b6/1559.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "DEARBORN, Mich. (AP) — Bowls of labneh and platters of za’atar bread covered the tables in a Lebanese restaurant near Detroit, yet no one seemed to have much of an appetite.On one side were Kamala Harris ’ top emissaries to the Arab American community.",
      "publishedAt": "2024-10-29T04:23:32Z",
      "title": "Arab American voters make their choice — Harris, Trump or neither — in the election's final days",
      "url": "https://apnews.com/2b698c34863aa1ec5956d9536479d115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bab9999f91fa424b8329a7c0bc905ad0/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — This presidential election, the first since the Jan. 6, 2021, insurrection at the Capitol, will be a stress test of the new systems and guardrails that Congress put in place to ensure America’s long tradition of the peaceful transfer of presidential power.",
      "publishedAt": "2024-10-29T04:18:22Z",
      "title": "The first presidential election since the Jan. 6 attack will test new guardrails from Congress",
      "url": "https://apnews.com/64b1ceeeacff133731ca4af01425a7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dead30909a3f4aba904c6580c4d3fe0e/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — After the 2020 presidential election, thousands of Donald Trump’s most fervent supporters heeded his call to join a “wild” protest of his defeat.",
      "publishedAt": "2024-10-29T04:09:49Z",
      "title": "Election threats persist four years after far-right extremists stormed the US Capitol",
      "url": "https://apnews.com/88457e7bf02a908fa2716047fc370cc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0102bfeb5d5459bbfcb06a5f1533653/2491.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "TALLAHASSEE, Fla. (AP) — A federal judge who recently chastised Florida officials for “trampling” on free speech rights continued to block the head of the state's health department from taking any more steps to threaten TV stations that air commercials for an abortion rights measure on next week’s ballot.",
      "publishedAt": "2024-10-29T15:05:06Z",
      "title": "Judge continues to block Florida officials from threatening TV stations over abortion ads",
      "url": "https://apnews.com/d762c425f6ec193c3edcf6e6e9c93198",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d006f129b7af47c3a74f98814e9b9a69/2423.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Longtime Donald Trump ally Steve Bannon was released from prison early Tuesday, after serving a four-month sentence for defying a subpoena in the congressional investigation into the U.S.",
      "publishedAt": "2024-10-29T04:08:29Z",
      "title": "Trump ally Steve Bannon is released after serving 4 months in prison for contempt of Congress",
      "url": "https://apnews.com/56f2f7a17ae2273a29a0829234f56fae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2720f106f38f42a983aac4be4f26f0e1/3000.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "MEXICO CITY (AP) — The first bite is an assault to the senses. A sugary, citric, fluffy delight.“Pan de muerto” or “bread of the dead” is baked in Mexico every year, from early October to mid-November, amid Day of the Dead celebrations.",
      "publishedAt": "2024-10-29T12:02:38Z",
      "title": "Care for a sweet treat during Mexico's Day of the Dead? Have a bite of 'pan de muerto'",
      "url": "https://apnews.com/fb1b57baaeb7f4b3fb5d74e0ebd4d610",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e597d453ab941349ecc9911fed9f1dc/3000.jpeg"
    },
    {
      "author": "MARK LONG",
      "description": "GAINESVILLE, Fla. (AP) — Walking from his apartment to classes and then to the University of Florida’s basketball facility, Olivier Rioux poses for dozens — sometimes hundreds — of pictures a day.Vertical shots, of course.",
      "publishedAt": "2024-10-29T17:02:54Z",
      "title": "At 7 feet, 9 inches, Olivier Rioux is the world's tallest teen and an intriguing basketball project",
      "url": "https://apnews.com/d1c918fb54100a09a9c7db648c4ef71d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a127e8c9a9d4341ba238bcb249925e1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}