{
  "articles": [
    {
      "author": "Sam Mednick, Samy Magdy",
      "description": "The U.N. food agency says Palestinians in the Gaza Strip have blocked and offloaded dozens of food trucks as desperation mounts following Israel’s monthslong blockade and airstrikes. The World Food Program said Saturday that 77 trucks carrying aid, mostly flour, were stopped by hungry people who took the food before the trucks were able to reach their destination. Hamas meanwhile is reviewing a U.S. proposal for a temporary ceasefire. U.S. President Donald Trump said Friday that negotiators were nearing a deal. A truce would pause the fighting for 60 days and release some of the 58 hostages in exchange for Palestinian prisoners and food aid.",
      "publishedAt": "2025-05-31T12:41:18Z",
      "title": "Hungry Palestinians in Gaza block and offload dozens of UN food trucks",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-31-05-2025-5fdab6573641771c564dfae1bcdeac45",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3811ca/2147483647/strip/true/crop/4860x2734+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fe4%2F22017c303ca41f5a60ec695f97c6%2F86c4c0562e9d48d9987df8774d9432d2"
    },
    {
      "author": null,
      "description": "A Ukrainian official says a Russian missile hit a front-line region in Ukraine, killing a child and injuring another. The Ukrainian air force says Russian troops launched some 109 drones and five missiles across Ukraine overnight and into Saturday. Three of the missiles and 42 drones were destroyed by air defenses, while another 30 drones failed to reach their targets without causing damage. The attack came as uncertainty remains as to whether Kyiv diplomats will attend a new round of peace talks proposed by Moscow for early next week in Istanbul.",
      "publishedAt": "2025-05-31T09:04:53Z",
      "title": "Russian missile strike targets Ukrainian front line region, killing a child",
      "url": "https://apnews.com/article/russian-ukraine-missile-strike-peace-talks-48819d7697a7dff76bc6175503a146d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/44b383d/2147483647/strip/true/crop/7739x4353+0+403/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Fab%2F65ef6ac41229b1dc17d671cb934a%2F14b9f6f7a4734cf1a94795f66120446b"
    },
    {
      "author": "Stephanie Liechtenstein",
      "description": "The U.N. nuclear watchdog says Iran has further increased its stockpile of uranium enriched to near weapons-grade levels. That's according to a confidential report by the International Atomic Energy Agency, which called on Tehran to urgently change course and comply with the agency’s probe. Saturday's report comes at a sensitive time as Tehran and Washington have been holding several rounds of talks over a possible nuclear deal that U.S. President Donald Trump is trying to reach.",
      "publishedAt": "2025-05-31T10:49:43Z",
      "title": "Iran has amassed even more near weapons-grade uranium, IAEA says",
      "url": "https://apnews.com/article/iran-nuclear-iaea-uranium-7f6c9962c1e4199e951559096bcf5cc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb8fc83/2147483647/strip/true/crop/9504x5346+0+495/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2Ff0%2Fc4488c14c58d2e840ec79a247e5c%2F665e2c52fdac4f62874a07f6bfb4c9fc"
    },
    {
      "author": "Charlotte Kramon",
      "description": "Black women are starting to pay more for their hair care because of the Trump administration’s tariffs on goods imported from China. Many Black women have hair types and workplace-favored styles that require careful attention. They can spend hundreds of dollars at salons each month on extensions, weaves, wigs and braids. Most hair, salon tools and packaging is imported from China. Stylists are considering raising their prices while the the U.S. and China negotiate new trade agreements. But many dread what price increases will do for clients who are lower income and already strained by months of inflation on virtually everything else.",
      "publishedAt": "2025-05-31T13:08:46Z",
      "title": "Trump tariffs on Chinese goods drive up prices for Black hair care products",
      "url": "https://apnews.com/article/trump-tariffs-china-black-hair-care-prices-059def14c805112470a9199d7280863a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e00995a/2147483647/strip/true/crop/8221x4624+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F56%2F8dc077a18f7bf3d97ffa6741a2d0%2Ff50df80e1cc44140a38df327f4b19c53"
    },
    {
      "author": "Mead Gruver, Hannah Schoenbaum",
      "description": "The U.S. uranium mining industry is looking to a revival under President Donald Trump. Environmental reviews of mining operations would normally take months or even years. But after Trump declared a “national energy emergency,” it took just 11 days for the U.S. Bureau of Land Management to approve the Velvet-Wood uranium mine's plan for resuming operations in the red-rock desert south of Moab, Utah. More fast approvals could be coming. But U.S. uranium mining has a long way to go to offset imports. About 98% of the uranium used in U.S. power plants currently is imported.",
      "publishedAt": "2025-05-31T12:07:15Z",
      "title": "Quick green light for Utah uranium mine doesn't mean industry revival is assured",
      "url": "https://apnews.com/article/uranium-mining-utah-velvetwood-trump-environment-1d4bfe69756322c9bef5ae9c18027ff0",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a554d9/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Fcb%2Fe9adb36b9f58328c380c1af739b4%2F0e5851886d964d8f80795ace37a25bc0"
    },
    {
      "author": null,
      "description": "At least 151 people have now been confirmed dead after heavy rainfall unleashed flooding in a market town in north-central Nigeria, the local emergency services told The Associated Press on Saturday. More than 3,000 people were displaced in the flooding in the town of Mokwa in Niger state, more than 180 miles (300 kilometers) west of Abuja, the capital of Africa’s most populous nation, Niger state emergency agency spokesman Ibrahim Audu Husseini said. At least 500 households across three communities were affected in the predawn rain Friday, leaving roofs barely visible and residents waist-deep in water, Husseini added.",
      "publishedAt": "2025-05-31T10:36:35Z",
      "title": "Death toll from reaches 151 in north-central Nigeria town submerged in floods, thousands displaced",
      "url": "https://apnews.com/article/nigeria-floods-mokwa-c29db671f8b92972d8800a82adb2cd97",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e0d270/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F39%2Ffffdd38411236f9dfa1d68427993%2F27d1fad4ff2e4d6ba929992c79012ab0"
    },
    {
      "author": "Laura Ungar, Michelle R. Smith",
      "description": "Americans are losing an array of people and programs dedicated to keeping them healthy. State and local health departments responsible for invisible but critical work including inspecting restaurants, monitoring wastewater for new and harmful germs, responding to outbreaks — and a host of other tasks to protect both individuals and communities — are being hollowed out. The Trump administration is cutting health spending on an unprecedented scale, pulling $11 billion of direct federal support and laying off tens of thousands of workers at national health agencies that support local public health work. It wants billions more slashed.",
      "publishedAt": "2025-05-31T13:03:48Z",
      "title": "How huge health funding cuts in Washington 'put lives at risk' in communities",
      "url": "https://apnews.com/article/public-health-measles-rfk-maha-trump-d863f53a5d370413de8d165d5ab96e65",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d56f0f/2147483647/strip/true/crop/4240x2385+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fd0%2F3843f16c33da69777fed12bf3fe1%2F5d30ecf81d054f8095b421a67a52b5e0"
    },
    {
      "author": "Jack Brook",
      "description": "The 10 men who escaped from a New Orleans jail more than two weeks ago by cutting out a hole behind a toilet received help from at least 14 people, many of them friends and family who provided food, cash, transport and shelter according to court documents. Some are held on bonds $1 million or higher. Records reviewed by The Associated Press show how some of the fugitives received aid before and after their escape — including from a number of people named in police reports but not facing charges, such as an apparent former jail employee. Authorities upped the reward to $50,000 for each of the two remaining fugitives.",
      "publishedAt": "2025-05-31T04:05:28Z",
      "title": "Authorities investigate friends and family of New Orleans jailbreak fugitives",
      "url": "https://apnews.com/article/new-orleans-jailbreak-aa0b181660d7a5b5284b8bf73a420d28",
      "urlToImage": "https://dims.apnews.com/dims4/default/eff0b70/2147483647/strip/true/crop/5953x3349+0+800/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fb3%2Fa4a7b55ee11cf256730c041fc440%2F8e563106f3f244ceb94c5165c3333bab"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The third week of Sean “Diddy” Combs' sex trafficking and racketeering trial featured testimony from the second of three women expected to testify that the hip-hop mogul sexually abused them. It was also highlighted by additional testimony about a break-in of rapper Kid Cudi's Los Angeles home and the later destruction of his Porsche with a Molotov cocktail. One of the biggest developments of the week came outside of the courtroom when Casandra “Cassie” Ventura delivered her third child on Wednesday. The jury learned of it through a witness. Cassie, a girlfriend of Combs and the star government witness, testified for four days in the trial's first week. Combs has pleaded not guilty.",
      "publishedAt": "2025-05-31T04:06:42Z",
      "title": "Key moments from the third week of Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-6f628c208c0dac30c89ef546f0bdcc70",
      "urlToImage": "https://dims.apnews.com/dims4/default/04752ea/2147483647/strip/true/crop/3500x1969+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F1b%2Ff77b29dfd4fb41f15c70e43c726f%2F9947473cea9848a8a5e92a20a4d152e7"
    },
    {
      "author": "Michael Marot",
      "description": "The Indiana Pacers will try to take advantage of a second chance to eliminate the New York Knicks in the Eastern Conference finals. Indiana is looking to make the second NBA Finals appearance in franchise history and the first in 25 years. The Pacers still lead the series 3-2 after losing Game 5 on Thursday. Tip is scheduled for 8 p.m. Eastern on Saturday in Indiana and will be televised on TNT. A Pacers win would be the final game broadcast by the network. A Knicks win would send the series back to New York on Monday night for Game 7.",
      "publishedAt": "2025-05-31T17:11:17Z",
      "title": "Pacers look to clinch NBA Finals spot at home against Knicks",
      "url": "https://apnews.com/article/2025-nba-playoffs-pacers-knicks-8dc78973bd50efe2d80c0009f623d520",
      "urlToImage": "https://dims.apnews.com/dims4/default/264a4bf/2147483647/strip/true/crop/4800x2700+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2Fe0%2F1139ab26a6212f673dbc9f7bff15%2Fbc18da0724d043cf97f5b94487a961a7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}