{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The man accused of killing UnitedHealthcare’s CEO struggled with deputies and shouted while being led into court Tuesday as new details emerged about his possible motivation behind the ambush.",
      "publishedAt": "2024-12-10T06:03:24Z",
      "title": "Suspect in the killing of UnitedHealthcare’s CEO struggles, shouts while entering courthouse",
      "url": "https://apnews.com/c68d0328f278d85fcf201ae89f634098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecadcbe85c8f4808bcc92c46d704a384/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "Luigi Nicholas Mangione, the suspect in the fatal shooting of a healthcare executive in New York City, apparently was living a charmed life: the grandson of a wealthy real estate developer, valedictorian of his elite Baltimore prep school and with degrees from one of the nation's top private universities.",
      "publishedAt": "2024-12-10T20:33:13Z",
      "title": "From wealth and success to murder suspect, the life of Luigi Mangione took a hard turn",
      "url": "https://apnews.com/10ee2f70cd843a27940a9cf1a06edf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9890bd8c61424415ac24dd8e98a0600f/3000.jpeg"
    },
    {
      "author": "SARAH BRUMFIELD and MARYCLAIRE DALE",
      "description": "The 26-year-old man charged in last week’s killing of UnitedHealthcare’s CEO appeared in a Pennsylvania courtroom Tuesday, where he was denied bail and his lawyer said he'd fight extradition to New York City, where the attack happened.",
      "publishedAt": "2024-12-04T20:03:08Z",
      "title": "Key details about the man accused of killing UnitedHealthcare's CEO",
      "url": "https://apnews.com/79a9710978fc7adbb23d3fed4ea2f70d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72eefcdb17f548b0b8dc055e5e3fa660/3000.jpeg"
    },
    {
      "author": "JAE C. HONG, ERIC THAYER and CHRISTOPHER WEBER",
      "description": "MALIBU, Calif. (AP) — Evacuation orders and warnings have gone out to 20,000 Southern California residents Tuesday as firefighters battled a wind-driven wildfire in Malibu that burned near celebrities' seaside mansions, horse farms and Pepperdine University, the sheriff's department said.",
      "publishedAt": "2024-12-10T09:05:14Z",
      "title": "Celebrities and coastal residents flee from wind-driven wildfire in Malibu",
      "url": "https://apnews.com/ef9f6ea11815be64feaf2e5e5eb7588c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3491b9cfda934f10befbb77450fc7a1f/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s previous defense minister was stopped from attempting suicide while in detention over last week's martial law, officials said, as police were trying to search President Yoon Suk Yeol’s office Wednesday in their intensifying investigation.",
      "publishedAt": "2024-12-11T00:35:52Z",
      "title": "Ex-defense chief in South Korea tried to kill himself after being arrested over martial law case",
      "url": "https://apnews.com/3210438b8663fe609bfe4cb8b748a114",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5bb4552d5de44fdbd898213c27bafea/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump made another flurry of job announcements on Tuesday, selecting Andrew Ferguson as the next chair of the Federal Trade Commission, Ron Johnson was nominated to be ambassador to Mexico, and Kimberly Guilfoyle to be ambassador to Greece.",
      "publishedAt": "2024-12-10T23:24:37Z",
      "title": "Trump says he'll name Andrew Ferguson head of FTC and Kimberly Guilfoyle as ambassador to Greece",
      "url": "https://apnews.com/695d34974cb09387e0c3ec6757754eac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80f6ca9f7f1548138e889030793ab5a2/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ROB GILLIES",
      "description": "NEW YORK (AP) — President-elect Donald Trump’s recent dinner with Canadian Prime Minister Justin Trudeau and his visit to Paris for the reopening of the Notre Dame Cathedral were not just exercises in policy and diplomacy.",
      "publishedAt": "2024-12-10T21:56:15Z",
      "title": "Donald Trump is returning to the world stage. So is his trolling",
      "url": "https://apnews.com/39ecae6554c7b4350e6a106354672eb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c549ac5b66044213b715b5e4fa1d8c3d/1920.jpeg"
    },
    {
      "author": null,
      "description": "UNITED NATIONS (AP) — Humanitarian aid to North Gaza, where Israel launched a ground offensive on Oct.",
      "publishedAt": "2024-12-11T00:45:24Z",
      "title": "Humanitarian aid to North Gaza mostly blocked for the last 2 months, UN says",
      "url": "https://apnews.com/f529bf77d09e609265179e259b799c6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa1dba3baaed42e884ac72b9c2802e32/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and SANYA MANSOOR",
      "description": "NEW YORK (AP) — After being acquitted of homicide, the military veteran who choked a volatile, mentally ill man on a New York subway told an interviewer he put himself in a “very vulnerable position” but felt compelled to act.",
      "publishedAt": "2024-12-11T00:16:43Z",
      "title": "After acquittal in subway chokehold trial, Daniel Penny says he was vulnerable in the encounter",
      "url": "https://apnews.com/3c69673475d69e02aa80f6d146114554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f71422de96a42cbbd6a6fc57b38eb0d/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Americans should eat more beans, peas and lentils and cut back on red and processed meats and starchy vegetables, all while continuing to limit added sugars, sodium and saturated fat.That's the advice released Tuesday by a panel of nutrition experts charged with counseling the U.S.",
      "publishedAt": "2024-12-10T19:52:22Z",
      "title": "More beans and less red meat: Nutrition experts weigh in on US dietary guidelines",
      "url": "https://apnews.com/d6a9c6f0554f279497acb5714b3032b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3df8e7129495499f9caa13da9978ee91/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}