{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un promised full support for Russia's war in Ukraine, as he met Russian President Vladimir Putin in Pyongyang on Wednesday in a bid to expand their economic and military cooperation and display a united front against Washington.",
      "publishedAt": "2024-06-19T04:14:41Z",
      "title": "North Korea's Kim vows 'full support' for Russia in Ukraine as Putin vows to upgrade ties",
      "url": "https://apnews.com/a6b8d2c12de7ee2ab6716d4747c9850e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1054a87322fd426d95db9af530efb818/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "Willie Mays, the electrifying “Say Hey Kid” whose singular combination of talent, drive and exuberance made him one of baseball’s greatest and most beloved players, has died.",
      "publishedAt": "2024-06-19T01:07:31Z",
      "title": "Willie Mays, Giants’ electrifying ‘Say Hey Kid,’ has died at 93",
      "url": "https://apnews.com/33b31cc2d6382676ed54517d20ea36a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd827c74947a47b3b1b5abaaaf9219fc/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDRÉS LEIGHTON",
      "description": "ROSWELL, N.M. (AP) — Cooler weather — and the chance of rain — could bring some relief this week to firefighters battling blazes in southern New Mexico that killed one person, damaged hundreds of structures and forced thousands to evacuate.",
      "publishedAt": "2024-06-19T05:34:15Z",
      "title": "Cooler temps and rain could help corral blazes that forced thousands to fee New Mexico village",
      "url": "https://apnews.com/7d367792f6ea70d4fdb1248c15e6899d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fd2182203f4d86bf03e3b8c4bb1ca4/1920.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Hundreds of thousands of immigrants had reason to rejoice when President Joe Biden unveiled a highly expansive plan to extend legal status to spouses of U.S. citizens but, inevitably, some were left out.",
      "publishedAt": "2024-06-19T05:06:18Z",
      "title": "Immigrant families rejoice over Biden's expansive move toward citizenship, while some are left out",
      "url": "https://apnews.com/376a0a568c85dac1ff856af2157f677f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7526319ba6684dd89db3c77bbfeea3dc/1920.jpeg"
    },
    {
      "author": "RENATA BRITO",
      "description": "AMBLETEUSE, France (AP) — The rising tide crept above their waists, soaking the babies they hugged tight. Around a dozen Kurds refused to leave the cold waters of the English Channel in a futile attempt to delay the inevitable: French police had just foiled their latest attempt to reach the United Kingdom by boat.",
      "publishedAt": "2024-06-19T04:40:16Z",
      "title": "Strict asylum rules and poor treatment of migrants are pushing people north to the UK",
      "url": "https://apnews.com/0c6042f4baaa68ac2d1bb9a0cc696aa5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/011fc55b4fd840629b71f3e0650e773d/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A bulk carrier sank days after an attack by Yemen's Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second-such ship to be sunk in the rebel campaign.",
      "publishedAt": "2024-06-19T00:45:19Z",
      "title": "Ship attacked by Yemen's Houthi rebels in fatal assault sinks in Red Sea in second-such sinking",
      "url": "https://apnews.com/bfa7d321e55c5bb59b268b82ef3c56ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0dc4f7eea44535a8617f9c882ea469/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — A court in Russia’s far eastern city of Vladivostok on Wednesday sentenced an American soldier arrested earlier this year to three years and nine months in prison on charges of stealing and threats of murder, Russian news reports said.",
      "publishedAt": "2024-06-19T04:11:22Z",
      "title": "Russian court sentences US soldier to nearly 4 years on theft charges",
      "url": "https://apnews.com/fc1866fd060ca1168211641e487860de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a90f98b1731413ca8c1bb2372d2da07/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Maryland this week became the latest state to announce mass pardons for people convicted of marijuana-related crimes as the nation wrestles with how to make amends for the lives disrupted in the decadeslong war on drugs.",
      "publishedAt": "2024-06-19T04:17:30Z",
      "title": "With pardons in Maryland, 2.5 million Americans will have marijuana convictions cleared or forgiven",
      "url": "https://apnews.com/614dcf167f6bc19d80661c4eb11b869c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbf1fbafeec64fe68e94b8abb7a354b0/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER and PATRICK ORSAGOS",
      "description": "TOLEDO, Ohio (AP) — A blast of heat and humidity in the Midwest and Northeast days before the official start of summer put a wet blanket on outdoor activities from festivals to sports camps as officials urged people to take precautions.",
      "publishedAt": "2024-06-19T05:02:56Z",
      "title": "Early blast of heat and humidity leaves millions sweltering across the US",
      "url": "https://apnews.com/f4877dd84b047cdb7f4b5f2ae61da106",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cab5591a3d444ba0b7dd7cc703ab43ff/1920.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "SUNRISE, Fla. (AP) — Matthew Tkachuk took off at full speed from basically center ice, chasing a puck that had sailed over his head and was heading directly toward an empty net.He dove.",
      "publishedAt": "2024-06-18T10:10:18Z",
      "title": "Panthers see another chance at Cup slip away, fall to Oilers 5-3 in Game 5",
      "url": "https://apnews.com/d9cf129935c6fa3973a9e2ba79ca6956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7659018856f64eddbb6de2e35cb570b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}