{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — NRA and former leader Wayne LaPierre are found liable in a lawsuit centered on the organization’s lavish spending.",
      "publishedAt": "2024-02-23T22:34:48Z",
      "title": "NRA and former leader Wayne LaPierre are found liable in a lawsuit centered on the organization’s lavish spending",
      "url": "https://apnews.com/28b6546b3b328e6b7a01191e821873c9",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "ATHENS, Ga. (AP) — Police take suspect into custody after killing of a nursing student whose body was found on the University of Georgia.",
      "publishedAt": "2024-02-23T22:38:20Z",
      "title": "Police take suspect into custody after killing of a nursing student whose body was found on the University of Georgia",
      "url": "https://apnews.com/cf312e9e69cc315d445dc5506cb24e60",
      "urlToImage": ""
    },
    {
      "author": "MICHELLE L. PRICE, JAMES POLLARD, MEG KINNARD and BILL BARROW",
      "description": "COLUMBIA, S.C. (AP) — Former President Donald Trump said Friday that he would “strongly support the availability of IVF\" and called on lawmakers in Alabama to preserve access to the treatment that has become a new flashpoint in the 2024 presidential election.",
      "publishedAt": "2024-02-23T19:45:55Z",
      "title": "Trump says he strongly supports IVF after Alabama court ruling puts new pressure on Republicans",
      "url": "https://apnews.com/8215336740a5963b57bbd970b47bb3a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/390b75c01bf141a19ea5b89bcf3434e2/3000.jpeg"
    },
    {
      "author": null,
      "description": "MONTGOMERY, Ala. (AP) — Lawmakers began scrambling for ways to protect Alabama in vitro fertilization services after multiple providers paused services in the wake of a state Supreme Court ruling that frozen embryos could be considered children under a state law.",
      "publishedAt": "2024-02-23T20:38:41Z",
      "title": "Facing backlash over IVF ruling, Alabama lawmakers look for a fix",
      "url": "https://apnews.com/aec76246aad81bc58cd9e51e422a4521",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a15c2ccc0244d0b9378caa97c513e13/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The National Rifle Association and its former longtime leader were found liable Friday in a lawsuit centered on the organization’s lavish spending.",
      "publishedAt": "2024-02-23T22:42:12Z",
      "title": "National Rifle Association and Wayne LaPierre are found liable in lawsuit over lavish spending",
      "url": "https://apnews.com/d4d9b950ee2cbd63380826eb2bf210e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f271ecc9ab4dd6b723e93c9c3abb3c/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private U.S. spacecraft that touched down on the moon ended up on its side, company officials said Friday.",
      "publishedAt": "2024-02-23T16:37:34Z",
      "title": "Private US spacecraft is on its side on the moon, company says",
      "url": "https://apnews.com/14dfdc76176f9f7a6a68a099c98bbbb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c408bc98585c4f80a6fa0dc55125894c/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and LORNE COOK",
      "description": "WASHINGTON (AP) — The United States and European Union on Friday heaped hundreds of new sanctions on Russia in connection with the second anniversary of its invasion of Ukraine and in retaliation for the death of noted Kremlin critic Alexei Navalny last week in an Arctic penal colony.",
      "publishedAt": "2024-02-23T10:48:23Z",
      "title": "US and EU pile new sanctions on Russia for the Ukraine war's 2nd anniversary and Navalny's death",
      "url": "https://apnews.com/28a5d7faabbcbc5fe3a0de3ec84fd87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f63accfa94594038b3e4680b9cd2ade8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An ally of the late opposition leader Alexei Navalny said Friday that Russian authorities have given his mother a deadline to agree to forgo a public funeral or else they’ll bury him on prison grounds.",
      "publishedAt": "2024-02-23T11:33:16Z",
      "title": "Ally of late Kremlin critic Navalny says authorities threaten to bury him on prison grounds",
      "url": "https://apnews.com/5f95938f29ba478cec19dfdb7d460a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df940f3cb0a040758711054aae72a8aa/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A long-awaited postwar plan by Israel's prime minister shows that his government seeks open-ended control over security and civilian affairs in the Gaza Strip. That was swiftly rejected Friday by Palestinian leaders and runs counter to Washington’s vision for the war-ravaged enclave.",
      "publishedAt": "2024-02-23T12:31:14Z",
      "title": "Netanyahu seeks open-ended control over security and civilian affairs in Gaza in new postwar plan",
      "url": "https://apnews.com/a5da6005cfa6734225af35ca460a75fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49d93824f70f460c896bb63748414a3b/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden told the nation's governors on Friday that he's exploring what executive actions he can take to curb migration across the southern border after a bipartisan deal collapsed in Congress this month.",
      "publishedAt": "2024-02-23T19:43:45Z",
      "title": "Biden tells governors he's eyeing executive action on immigration, seems 'frustrated' with lawyers",
      "url": "https://apnews.com/3b6ef1ee48bc4e33037719286f21c9cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3b5a016ee6b4811be029a40f5b8265e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}