{
  "articles": [
    {
      "author": "JULIA FRANKEL and BASSEM MROUE",
      "description": "JERUSALEM (AP) — The Israeli military on Tuesday warned people to evacuate nearly two dozen Lebanese border communities hours after launching what it said was a limited ground incursion against the Hezbollah militant group.",
      "publishedAt": "2024-10-01T09:41:48Z",
      "title": "Israeli military warns several Lebanese communities near the border to evacuate",
      "url": "https://apnews.com/eb175dff6e46906caea8b9e43dfbd3da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de951bc82ab4793a3d7be69a66781da/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — As a hostage in Gaza, Aviva Siegel found herself begging for food and water. Since her release, she has found herself begging for her husband to be set free from his own ongoing captivity.",
      "publishedAt": "2024-10-01T04:36:39Z",
      "title": "A former hostage fought for her own life in Gaza. A year on, she fights for her husband's freedom",
      "url": "https://apnews.com/d8ecb415268e911cea09518acdaf7ba2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d594d31cb624dda9ca9a94de0bcaf00/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — A strike by dockworkers at 36 ports from Maine to Texas, the first in decades, could snarl supply chains and lead to shortages and higher prices if it stretches on for more than a few weeks.",
      "publishedAt": "2024-10-01T10:43:00Z",
      "title": "Dockworkers go on a strike that could reignite inflation and cause shortages in the holiday season",
      "url": "https://apnews.com/91703e4798dbc9ee82185e983f31a3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f94c2eb7304342981627b3332df816/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "ASHEVILLE, N.C. (AP) — President Joe Biden was set to survey the devastation in the mountains of Western North Carolina on Wednesday, where exhausted emergency workers continued to work around-the-clock to clear roads, restore power and cellphone service, and reach people left stranded by Hurricane Helene.",
      "publishedAt": "2024-10-01T04:10:03Z",
      "title": "Biden plans survey of devastation in North Carolina as Helene's death toll tops 130",
      "url": "https://apnews.com/c5ff143de63e31bd345066221f5e4d24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fa29e5a753f43c7959ce814bcdad269/1920.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — A bus carrying young students with their teachers caught fire in suburban Bangkok on Tuesday, with more than 20 of those on board feared dead, officials and rescuers said.The bus was carrying 44 passengers from central Uthai Thani province for a school trip in Ayutthaya and Nonthaburi provinces, Transport Minister Suriya Jungrungruengkit told reporters at the scene.",
      "publishedAt": "2024-10-01T07:24:30Z",
      "title": "School bus catches fire outside Bangkok and more than 20 are feared dead, officials say",
      "url": "https://apnews.com/658c09c22d5b24963d2a5cec3f3d5694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c06472bf9304182b591c6c290c10735/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Tim Walz and JD Vance will meet for their first and possibly only vice presidential debate Tuesday, in what could be the last debate for both campaigns to argue their case before the election.",
      "publishedAt": "2024-10-01T04:01:50Z",
      "title": "Walz and Vance will meet in their first and possibly only vice presidential debate",
      "url": "https://apnews.com/66ff2e5e45a8dda55b0a2242fc238fdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f21c833bd6740a7a476a98f97417a4a/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA, MEGAN JANETSKY and MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Claudia Sheinbaum will take the oath of office Tuesday as Mexico’s first female president in more than 200 years of independence, promising to protect an expanded social safety net and fight for the poor like her predecessor, but facing pressing problems.",
      "publishedAt": "2024-10-01T04:13:54Z",
      "title": "Claudia Sheinbaum to be sworn in as 1st female president of Mexico, a country with pressing problems",
      "url": "https://apnews.com/7d3599b39a7298df46e7eda34d80afee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91a4b7b8f23f46d0bf2f1146464166fd/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — China is marking the 75th year of Communist Party rule as economic challenges and security threats linger over the massive state. No festivities have been announced for the occasion Tuesday, save for a flag-raising ceremony at Tiananmen Square, with an honor guard marching from the entrance of the sprawling palace that in past centuries was the home of Chinese emperors.",
      "publishedAt": "2024-10-01T00:20:23Z",
      "title": "China marks 75 years of Communist Party rule as economic challenges and security threats linger",
      "url": "https://apnews.com/5f140a2c8db38029ea0c0f2769e9f619",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f5a50e5bf164f02967fb0b194117e62/1920.jpeg"
    },
    {
      "author": "BILL BARROW and CHARLOTTE KRAMON",
      "description": "ATLANTA (AP) — Jimmy Carter is preparing to celebrate his 100th birthday on Tuesday, the first time an American president has lived a full century and the latest milestone in a life that took the son of a Depression-era farmer to the White House and across the world as a Nobel Peace Prize-winning humanitarian and advocate for democracy.",
      "publishedAt": "2024-10-01T04:13:22Z",
      "title": "Jimmy Carter and hometown of Plains celebrate the 39th president's 100th birthday",
      "url": "https://apnews.com/1e540c277dea07bd84242d290b4ebcdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06105e87061e467595360b5050fe5049/2715.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Pete Rose, baseball’s career hits leader and fallen idol who undermined his historic achievements and Hall of Fame dreams by gambling on the game he loved and once embodied, has died.",
      "publishedAt": "2024-09-30T23:48:37Z",
      "title": "Pete Rose, baseball’s banned hits leader, has died at age 83",
      "url": "https://apnews.com/e0f3dfa057fc46629447e04b6540e4c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31e541bf12a64e87983d0ee2b8f8ba44/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}