{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Truckloads of aid idled at Egypt’s border with Gaza as residents and humanitarian groups pleaded Monday for water, food and fuel for dying generators, saying the tiny Palestinian territory sealed off by Israel after last week’s rampage by Hamas was near total collapse.",
      "publishedAt": "2023-10-16T03:24:13Z",
      "title": "With humanitarian aid blocked at Egyptian border, Gaza draws closer to total collapse",
      "url": "https://apnews.com/781b3c63af4ae6e51c313a68f314e66d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd832a26c6204f0392f855a3f503b551/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, COLLEEN LONG and AAMER MADHANI",
      "description": "TEL AVIV, Israel (AP) — President Joe Biden will travel to Israel and on to Jordan Wednesday to meet with both Israeli and Arab leadership, as concerns increase that the raging Israel-Hamas war could expand into a larger regional conflict.",
      "publishedAt": "2023-10-16T23:09:23Z",
      "title": "Biden will head to Israel and Jordan as concerns mount that Israel-Hamas conflict will spread",
      "url": "https://apnews.com/a08b6e4f8fe5edeab4c97753d254f8b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53b647f1b6c8420fb978796010552489/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE, MELISSA PEREZ WINDER and SOPHIA TAREEN",
      "description": "BRIDGEVIEW, Ill. (AP) — Crowds of mourners in a heavily Palestinian Chicago suburb paid respects Monday to a 6-year-old Muslim boy killed in an alleged hate crime, hours after authorities revealed new details about the evidence used to charge the family's landlord with stabbing the child and his mother.",
      "publishedAt": "2023-10-16T16:15:29Z",
      "title": "Mourners in heavily Palestinian Chicago suburb remember Muslim boy killed as kind, energetic",
      "url": "https://apnews.com/9f30f422e47ed8ef36ea6a25a4052341",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b41cbd29203c477a85e0de04edd6841e/1920.jpeg"
    },
    {
      "author": "SYLVAIN PLAZY, RAF CASERT and LORNE COOK",
      "description": "BRUSSELS (AP) — Belgian police early Tuesday hunted for a gunman with suspected extremist motives who killed two Swedes with stunning viciousness before disappearing into the night. He created such fear that authorities shut down a Belgium-Sweden soccer match and held 35,000 fans inside for several hours as a precaution.",
      "publishedAt": "2023-10-16T18:52:26Z",
      "title": "Gunman kills 2 Swedes in Brussels, prompting terror alert and halt of Belgium-Sweden soccer match",
      "url": "https://apnews.com/d023a72119dc73ffca7cc61b7a32a955",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c3362bf14274af386a2bebed225a26d/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — With a push by allies of Donald Trump, far-right firebrand Rep.",
      "publishedAt": "2023-10-16T17:34:30Z",
      "title": "GOP's Jim Jordan is shoring up support and peeling off detractors ahead of a House speaker vote",
      "url": "https://apnews.com/0b92b9a88864dcbc9edcba94aede74f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ede1e8ca750454b821d3d5c1c78d544/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — China's Belt and Road Initiative looks to become smaller and greener after a decade of big projects that boosted trade but left big debts and raised environmental concerns.",
      "publishedAt": "2023-10-17T01:50:23Z",
      "title": "How China's Belt and Road Initiative is changing after a decade of big projects and big debts",
      "url": "https://apnews.com/a4b08290cf94e4f2dffe368a013c5129",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28f948dc4180413998cd5b7dd9319f85/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The federal judge overseeing the 2020 election interference case against Donald Trump in Washington imposed a narrow gag order on him on Monday, barring the Republican former president from making statements targeting prosecutors, possible witnesses and court staff.",
      "publishedAt": "2023-10-16T04:26:49Z",
      "title": "Trump has narrow gag order imposed on him by federal judge overseeing 2020 election subversion case",
      "url": "https://apnews.com/b5f59c6688504c952df5f70029228f9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca0674059278430c8cfa52dcb1c01044/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and MEG KINNARD",
      "description": "WASHINGTON (AP) — Sen. Tim Scott of South Carolina on Monday praised Israeli Prime Minister Benjamin Netanyahu for showing what he called “restraint” after Hamas attacked Israel over a week ago.",
      "publishedAt": "2023-10-16T19:10:41Z",
      "title": "Tim Scott praises 'restraint' of Israel's Netanyahu, says US should move more firepower to region",
      "url": "https://apnews.com/b13c5c1b93fd113b6070e5dcd0dc9225",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89284cf9c5954c9e856ad9fa124c9427/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — A dayslong attempt by Russian forces to storm a strategically important city in eastern Ukraine appears to be running out of steam, Kyiv officials said Monday, as the Kremlin’s war entered its 600th day.",
      "publishedAt": "2023-10-16T11:23:46Z",
      "title": "600 days into the war, Russia's assault on a key eastern Ukraine city appears to be weakening",
      "url": "https://apnews.com/ae6a7dd33a43ae91bd9660aa5ca2b9a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd00628cf286428b90dd455aff5c1362/3000.jpeg"
    },
    {
      "author": "KRISTIE RIEKEN",
      "description": "HOUSTON (AP) — No matter the place or the moment, the Texas Rangers are rolling right now. Jonah Heim homered, Nathan Eovaldi pitched six effective innings and Texas beat Framber Valdez and the Houston Astros 5-4 on Monday for a 2-0 lead in the AL Championship Series.",
      "publishedAt": "2023-10-17T00:03:54Z",
      "title": "Rangers build big early lead off Valdez, hold on for 5-4 win over Astros to take 2-0 lead in ALCS",
      "url": "https://apnews.com/72ab03cd5a6d8af0bafb60d12e458f42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efb489ee90fb4dfea4318a998a23149c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}