{
  "articles": [
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Mexican President Claudia Sheinbaum said Thursday she is confident that a tariff war with the United States can be averted.",
      "publishedAt": "2024-11-28T17:59:18Z",
      "title": "Mexican president says she is confident that a tariff war with the US can be averted",
      "url": "https://apnews.com/aa0bb32d874a785ce7460b36808b53e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a4dd38b75034d8aba11b8a7b2c79f76/1920.jpeg"
    },
    {
      "author": "ARMANDO SOLÍS",
      "description": "URUAPAN, Mexico (AP) — Mexicans are worried that threats by Donald Trump to impose 25% tariffs could affect a wide range of iconic Mexican products and threaten entire regional economies.",
      "publishedAt": "2024-11-28T16:30:10Z",
      "title": "Avocados, tequila and other iconic Mexican products are jeopardized by Trump's tariff threats",
      "url": "https://apnews.com/7729d1b49ccb3f8daefffb29dce5e615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5753723fc84c0096de7de950e7645f/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "HANOUIYEH, Lebanon (AP) — During their 37 years of marriage, Mariam Kourani and her husband ran a butcher shop in southern Lebanon, started a business selling serving containers and opened a small restaurant.",
      "publishedAt": "2024-11-28T19:48:43Z",
      "title": "Displaced families in Lebanon who return home are faced with piles of rubble",
      "url": "https://apnews.com/1e55cd00486ad84ba7df830e7264af68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eab0ec022064c3284f63333cc78233c/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and JULIA FRANKEL",
      "description": "BEIRUT (AP) — Israel on Thursday carried out its first airstrike on Lebanon since a truce with Hezbollah announced this week, saying it targeted the militant group's activity at a rocket storage facility in southern Lebanon that breached the ceasefire.",
      "publishedAt": "2024-11-28T11:09:25Z",
      "title": "Day 2 of the Israel-Hezbollah ceasefire sees Israeli airstrike on Lebanon and scattered attacks",
      "url": "https://apnews.com/0ec22c89f22c471fdb44c26afc4712b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54da58ddc16b41c7a2bfc7402fe0f5a4/1920.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — After weeks of plugging increasingly inviting discounts, retailers in the United States and several other countries are preparing for prime time: Black Friday, the bargain bonanza that still reigns as the unofficial kickoff of the holiday shopping season even if it's lost some luster.",
      "publishedAt": "2024-11-28T12:23:25Z",
      "title": "Why retailers still see Black Friday as the high point of the holiday shopping season",
      "url": "https://apnews.com/c51d6d0435fd3d1c959fbc1fc815fe87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/007edebdc7d74d6ca2ef1eaf7ba47545/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — At least five Democratic members of Congress from Connecticut were targeted by bomb threats on their homes Thursday, the lawmakers or their offices said.Sen. Chris Murphy and Reps.",
      "publishedAt": "2024-11-28T20:34:34Z",
      "title": "Democratic lawmakers from Connecticut report Thanksgiving bomb threats against their homes",
      "url": "https://apnews.com/238ed68ed2c66601a6e0d4378715d6fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76df0370b72e4b498e1155d81907b571/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia conducted a “massive” attack against Ukraine’s energy infrastructure on Thursday, firing nearly 200 missiles and drones and leaving more than a million households without power, Ukrainian officials said.",
      "publishedAt": "2024-11-28T07:12:47Z",
      "title": "Latest 'massive' Russian aerial attack cuts power to 1 million homes in Ukraine",
      "url": "https://apnews.com/4fd663599d47898be34aa858dcc48fdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f46014f6dd94ff0891e757e65ab8fc7/2267.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The Macy's Thanksgiving Day Parade marched, soared and roared into its second century on Thursday despite a drenching rain and a brief disruption from pro-Palestinian demonstrators.",
      "publishedAt": "2024-11-28T05:20:19Z",
      "title": "Macy’s Thanksgiving Day Parade: Big balloons, wet weather and 21 protesters arrested",
      "url": "https://apnews.com/065ada5cb626421d1db6732134f5cbf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d81474da4e6409791b1ba880146f507/1920.jpeg"
    },
    {
      "author": "DAN MERICA and ALI SWENSON",
      "description": "WASHINGTON (AP) — With artificial intelligence at a pivotal moment of development, the federal government is about to transition from one that prioritized AI safeguards to one more focused on eliminating red tape.",
      "publishedAt": "2024-11-28T13:06:56Z",
      "title": "The outlook is uncertain for AI regulations as the US government pivots to full Republican control",
      "url": "https://apnews.com/1d766b1ecbc4e880b61a7dcbb291565d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f90f3c865f94b009a7a5755d00f94e3/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — Mistakes by members of the crew caused a New Zealand navy ship to plow into a reef off the coast of Samoa, where it caught fire and sank, according to the preliminary findings of a military Court of Inquiry released Friday.",
      "publishedAt": "2024-11-29T02:06:02Z",
      "title": "Crew mistakes caused the sinking of a New Zealand navy ship off Samoan coast, inquiry finds",
      "url": "https://apnews.com/dd9cccaa0739ef98f615cc4969a117b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d613c32aea04b93b8127650ab8f7483/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}