{
  "articles": [
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — After Hamas launched the deadly assault on Israel that triggered retaliatory airstrikes on Gaza, FBI Director Christopher Wray said he feared the Middle East violence could embolden individuals or groups to carry out attacks inside the United States.",
      "publishedAt": "2025-01-04T05:09:47Z",
      "title": "New Orleans attack came as officials warned of an escalating threat of international terrorism",
      "url": "https://apnews.com/745d8f70ed0b7b984b0788d4f6c69f18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb4c36bcbadd484f90d122a4c6f36728/2089.jpeg"
    },
    {
      "author": "JASON DEAREN, MICHELLE R. SMITH and AARON KESSLER",
      "description": "While much remains unknown about the man who carried out an attack in New Orleans on New Year’s and another who died in an explosion in Las Vegas the same day, the violence highlights the increased role of people with military experience in ideologically driven attacks, especially those that seek mass casualties.",
      "publishedAt": "2025-01-03T18:57:46Z",
      "title": "New Orleans attack and Vegas explosion highlight extremist violence by active military and veterans",
      "url": "https://apnews.com/a7febd9698219e91d3132a1e4bce3eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed9135e906e142aaad8ed07c69226e8a/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Faced with the never-before-seen dilemma of how, when or even whether to sentence a former and future U.S. president, the judge in President-elect Donald Trump 's hush money case made a dramatic decision that could nevertheless bring the case to a muted end.",
      "publishedAt": "2025-01-04T05:09:04Z",
      "title": "Trump's sentencing is set for Jan. 10. Here's what could happen next",
      "url": "https://apnews.com/1347190de38eeef2efdac482e8144663",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16351d6c50564bedbcf9c42dbaba8f4b/3000.jpeg"
    },
    {
      "author": "RIO YAMAT, TARA COPP, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "LAS VEGAS (AP) — A highly decorated Army soldier who fatally shot himself in a Tesla Cybertruck just before it blew up outside the Trump hotel in Las Vegas left notes saying the New Year's Day explosion was a stunt to serve as a “wake up call” for the country’s ills, investigators said Friday.",
      "publishedAt": "2025-01-03T19:27:19Z",
      "title": "Soldier who blew up Tesla at Trump hotel left note saying blast was to be a 'wake up call' for US",
      "url": "https://apnews.com/6c85af85255753db497f2cd344fb2ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec7590e56a014c96b22168a6ce994aa5/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and MELANIE LIDMAN",
      "description": "BEIRUT (AP) — A fragile ceasefire between Israel and the Lebanese militant group Hezbollah has held up for over a month, even as its terms seem unlikely to be met by the agreed-upon deadline.",
      "publishedAt": "2025-01-04T05:03:56Z",
      "title": "The fragile Israel-Hezbollah truce is holding so far, despite violations",
      "url": "https://apnews.com/7d8e3ecced6305ef0ec922d04d571fb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63e4ab88b1e84b6aa1381b9b644754cb/3000.jpeg"
    },
    {
      "author": null,
      "description": "A major winter storm forecast to produce heavy snow, significant ice and frigid temperatures was set to begin in the central U.S. on Saturday and move east over the next several days, according to the National Weather Service.",
      "publishedAt": "2025-01-04T05:08:24Z",
      "title": "What to know as snow, freezing rain and bitter cold heads through much of the US",
      "url": "https://apnews.com/400452961aa30309a5cf10dfa132c710",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b1930e6b0124b1f8ded3702660db319/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Six days of funeral observances for former President Jimmy Carter begin Saturday in Georgia, where he died on Dec.",
      "publishedAt": "2025-01-04T05:03:10Z",
      "title": "Jimmy Carter's state funeral starts Saturday. Here is what to know",
      "url": "https://apnews.com/b55e0689cf66809997dc6d54849f6e81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c2f858051ff4951be6ed63895dc7997/1920.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "PLAINS, Ga. (AP) — It never got old.No matter how many times one crammed into the modest sanctuary at Maranatha Baptist Church, there was always some wisdom to be gleaned from the measured, Bible-inspired words of Jimmy Carter.",
      "publishedAt": "2025-01-04T04:39:36Z",
      "title": "Sunday school class with Jimmy Carter: What it was like",
      "url": "https://apnews.com/a1a692079be175cf2e882176fc343344",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85aa9c18577948729fe126e428f8c050/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Former Secretary of State Hillary Clinton, Democratic philanthropist George Soros and actor-director Denzel Washington will be awarded the nation's highest civilian honor on Saturday in a White House ceremony.",
      "publishedAt": "2025-01-04T10:04:57Z",
      "title": "Hillary Clinton, George Soros and Denzel Washington will receive the highest US civilian honor",
      "url": "https://apnews.com/4b19a363d3058ac3b8107e2002b93651",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bceb8b9277a5452caa2cd2222e500e4d/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "Twenty years after he was a young, struggling actor in Toronto, Thomas Lo is now the one giving young Asian actors their big breaks. He just had to go to Hong Kong to do it. The Chinese Canadian has been the creative director of one of the island city's biggest TV broadcasting companies for only a few years, but is already making original English-language content to reach viewers around the world.",
      "publishedAt": "2025-01-04T03:06:55Z",
      "title": "How filmmakers and actors in Asia and the Asian diaspora are expanding representation",
      "url": "https://apnews.com/81a837f35f2d2067d64ef064b4bb5146",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fdd16156534401e8c528dd1169eab95/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}