{
  "articles": [
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Campbell is ready to drop the soup — at least from its official name.Campbell Soup Co. announced its intention to change its name at an annual meeting of investors on Tuesday.",
      "publishedAt": "2024-09-11T18:37:35Z",
      "title": "Campbell wants to say goodbye to the 'soup' in its name. It isn't the first to make such a change",
      "url": "https://apnews.com/9ffba2b71c51fb13a153b12ba9178bf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c612c1d0f484b0abf63d2a83c5008d9/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Dick Cheney is a career Republican still vilified by Democrats for his bullish defense of the Iraq War as vice president.",
      "publishedAt": "2024-09-14T12:22:34Z",
      "title": "Dick Cheney was once vilified by Democrats. Now he's backing Harris. Will it matter?",
      "url": "https://apnews.com/224d7be9ee7ebb6dc699bca5339a4458",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4af64e2ace14562a5bff04f86b1426c/2975.jpeg"
    },
    {
      "author": "COLLEEN LONG, MAKIYA SEMINERA and MATT BROWN",
      "description": "WASHINGTON (AP) — While President Joe Biden was hosting a celebration of Black excellence at the White House with lawmakers, advocates and celebrities this past week, Kamala Harris was instead headed off to Pennsylvania.",
      "publishedAt": "2024-09-14T15:44:17Z",
      "title": "Harris is promoting her resume and her goals rather than race as she courts Black voters",
      "url": "https://apnews.com/0544720c6bacaf0484259bdabe83239f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bef26127725740bca01634d74b0ae82f/3000.jpeg"
    },
    {
      "author": null,
      "description": "BISMARCK, N.D. (AP) — A federal judge in North Dakota has temporarily blocked a new Biden administration rule aimed at reducing the venting and flaring of natural gas at oil wells.",
      "publishedAt": "2024-09-14T22:22:27Z",
      "title": "Federal judge temporarily blocks Biden administration rule to limit flaring of gas at oil wells",
      "url": "https://apnews.com/bcfa1a62411613c98fe715ce4f01902a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd2adeab0cbe4ca39abd76a240b59d45/3000.jpeg"
    },
    {
      "author": null,
      "description": "JEFFERSON, Ga. (AP) — Funeral services for a teenage boy remembered for his endearing smile and a math teacher known for her dedication to students were held Saturday, 10 days after both were killed by a gunman who opened fire at a Georgia high school.",
      "publishedAt": "2024-09-14T04:11:41Z",
      "title": "Funerals held for teen boy and math teacher killed in Georgia high school shooting",
      "url": "https://apnews.com/dec5f503746a5960f0e350596282be11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cff3dd25c3a440d8f742fb84abb27ea/3000.jpeg"
    },
    {
      "author": "FRANKLIN BRICENO",
      "description": "LIMA, Peru (AP) — Controversial former Peruvian President Alberto Fujimori was buried Saturday after three days of national mourning in which thousands of supporters lined up outside a museum in Lima to visit the politician's casket.",
      "publishedAt": "2024-09-14T21:55:35Z",
      "title": "Alberto Fujimori, Peru's controversial former president, buried after 3 days of national mourning",
      "url": "https://apnews.com/66e4f0528050beb42b629d1274a792ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d5304714f25459a834a11b1576baf0e/3000.jpeg"
    },
    {
      "author": null,
      "description": "DENVER (AP) — A federal judge has canceled an October trial date and set a change-of-plea hearing in a fraud case involving the owners of a Colorado funeral home where authorities discovered 190 decaying bodies.",
      "publishedAt": "2024-09-14T22:34:59Z",
      "title": "Change-of-plea hearings set in fraud case for owners of funeral home where 190 bodies found",
      "url": "https://apnews.com/e0fd4dc7d3c6003c13f7864a8971c72a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/feedb20ee0284e378b4f7ae4bc7cf4e5/3000.jpeg"
    },
    {
      "author": "ANDREW WILKS and WAFAA SHURAFA",
      "description": "ISTANBUL, Turkey (AP) — A Turkish-American activist who was killed by Israeli fire in the West Bank was laid to rest on Saturday in her hometown in Turkey with thousands lining the streets and anti-Israeli feelings in the country rising from a conflict that threatens to spread across the region.",
      "publishedAt": "2024-09-14T07:31:47Z",
      "title": "An American activist killed by Israeli fire is buried in Turkey as Israel strikes Gaza",
      "url": "https://apnews.com/816a01b4ca23bfd6b22a1a381e1671bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6b66f3a855a474796bc3bce8dc2ddb8/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Disgraced ex-movie mogul Harvey Weinstein faces mounting legal and health troubles some seven years after scores of women came forward with allegations of sexual misconduct against him, helping launch the global #MeToo movement.",
      "publishedAt": "2024-09-14T17:49:07Z",
      "title": "A look at Harvey Weinstein’s health and legal issues as he faces more criminal charges",
      "url": "https://apnews.com/4e6d14096b4c93a957f6c5f454894abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266d4b2f2be046c98652cec62fa8c45b/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "CHALCO, Mexico (AP) — As 56-year-old Juana Salazar Segundo walked through her home in Chalco, a low-income suburb southeast of Mexico City, she recalled how black, reeking water had reached up to her belly button after flooding early last month.",
      "publishedAt": "2024-09-14T04:05:42Z",
      "title": "Residents of Mexico City suburb are anxious after living over a month in black sewage water",
      "url": "https://apnews.com/8ecc2eb4d9fabd5219fe6850de5addf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e331d875eb4a45cb9368250824d904c1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}