{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House Ethics Committee on Monday accused Matt Gaetz of “regularly” paying for sex, including with a 17-year-old girl, and purchasing and using illicit drugs all while the Florida Republican was a member of Congress.",
      "publishedAt": "2024-12-23T14:47:41Z",
      "title": "House Ethics Committee accuses Gaetz of 'regularly' paying for sex, including with 17-year-old girl",
      "url": "https://apnews.com/538cb5387bf95925245bf87fa6b1adcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee006aa6d79d471a8947044757b90f86/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden announced on Monday that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks before President-elect Donald Trump, an outspoken proponent of expanding capital punishment, takes office.",
      "publishedAt": "2024-12-23T10:00:56Z",
      "title": "Biden gives life in prison to 37 of 40 federal death row inmates before Trump can resume executions",
      "url": "https://apnews.com/f67b5e04453cd1aa6383c516bc14f300",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d267045be5a4afe9b3a92dc073a2fba/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The man accused of fatally shooting the CEO of UnitedHealthcare pleaded not guilty on Monday to state murder and terror charges while his attorney complained that comments coming from New York’s mayor would make it tough to receive a fair trial.",
      "publishedAt": "2024-12-23T05:30:42Z",
      "title": "Luigi Mangione pleads not guilty to murder and weapons charges in UnitedHealthcare CEO's death",
      "url": "https://apnews.com/8079a5bbe5f3e0539d09332a7240168d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/281d69b119b9471893d7b0d89e6d2ea2/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and ELAINE KURTENBACH",
      "description": "TOKYO (AP) — Japanese automakers Honda and Nissan have announced plans to work toward a merger that would form the world’s third-largest automaker by sales, as the industry undergoes dramatic changes in its transition away from fossil fuels.",
      "publishedAt": "2024-12-23T07:32:06Z",
      "title": "Nissan and Honda to attempt a merger that would create the world's No. 3 automaker",
      "url": "https://apnews.com/782913451d6487ed177a3517a9ba5be5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8656f0a1347d42239d4cfadaf4b1ed4e/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli airstrikes on the Gaza Strip overnight killed at least 20 people, Palestinian medics said Monday. One of the strikes killed eight people including two kids in a tent camp in the Muwasi area, which Israel designated a humanitarian safe zone but has repeatedly targeted.",
      "publishedAt": "2024-12-23T08:35:17Z",
      "title": "Middle East latest: Israeli airstrikes on Gaza kill at least 20 people, Palestinian medics say",
      "url": "https://apnews.com/d7d28b67bb47c390a7be0ddd925f1c46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2787976db70d44dbbc6768c41cd07403/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WEST PALM BEACH, Fla. (AP) — First it was Canada, then the Panama Canal.",
      "publishedAt": "2024-12-23T15:23:25Z",
      "title": "Trump again calls to buy Greenland after eyeing Canada and the Panama Canal",
      "url": "https://apnews.com/a52858e3075f9b5ad95e78753293fc1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc620e18fff248c69b7eda92e5d06acf/1920.jpeg"
    },
    {
      "author": null,
      "description": "MAGDEBURG, Germany (AP) — Mourners laid flowers near the scene of the deadly Christmas market attack on Monday as investigators puzzled over the motive of the suspect and fears swirled that the rampage could deepen divisions in German society.",
      "publishedAt": "2024-12-23T10:12:07Z",
      "title": "Magdeburg mourns Christmas market attack victims as fears swirl of deeper social divisions",
      "url": "https://apnews.com/9ae2b2ca5cea3cef79fe502ab3f27b63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2068cea9a4874dea914449d50b09c0e0/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Shohei Ohtani is keeping elite company. The Japanese superstar caps 2024 by winning The Associated Press Male Athlete of the Year for the third time, tying him with basketball great Michael Jordan.",
      "publishedAt": "2024-12-23T14:00:44Z",
      "title": "Shohei Ohtani wins 3rd AP Male Athlete of the Year award, tying Michael Jordan for 1 shy of record",
      "url": "https://apnews.com/07c1c5cee5f745bb9ac1ca5efbd86114",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/714d84a76e5d46659345092a7336f540/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis on Tuesday formally inaugurates the 2025 Holy Year, reviving an ancient church tradition encouraging the faithful to make pilgrimages to Rome, amid new security fears following a Christmas market attack in Germany.",
      "publishedAt": "2024-12-23T03:15:04Z",
      "title": "A Holy Year is about to start in Rome. Here's what you need to know",
      "url": "https://apnews.com/c8ee2a3d8008107fa7277bb84e2f87ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/454fae4fb6b94bee8f2316993a360629/1920.jpeg"
    },
    {
      "author": "MARIAM FAM and LUIS ANDRES HENAO",
      "description": "The Rev. Shannon Blosser sees how his son loves church — the music, the singing, the communion. But the United Methodist pastor said his family hasn’t always felt like 11-year-old Noah, who is autistic, has been welcome.",
      "publishedAt": "2024-12-23T13:02:30Z",
      "title": "How faith communities can be welcoming of believers with disabilities this holiday season and beyond",
      "url": "https://apnews.com/ace956cfe18b3812cafb5d42f4cc82fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73040d17d4324ea3a3ca167b80abd855/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}