{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — One of Gaza's last functioning hospitals has been emptying out in recent days as Israel has ordered the evacuation of nearby areas and signaled a possible ground operation in a town that has been largely spared throughout the war, officials said Monday.",
      "publishedAt": "2024-08-26T10:53:31Z",
      "title": "Hospital in central Gaza empties out as Israeli forces draw near",
      "url": "https://apnews.com/6d0101cf3dd45dcc7ecee35e0d716ac3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/970381b482f9416186953803d5393f8e/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Lebanon’s Hezbollah pulled back after an exchange of heavy fire over the weekend that briefly raised fears of an all-out war.",
      "publishedAt": "2024-08-25T09:44:52Z",
      "title": "It looked like Israel and Hezbollah had gone to war, but then they pulled back. Here's what to know",
      "url": "https://apnews.com/d3aeb1826cca2cbcda019f4778947e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/970b1775b2bc47409a1e6f21837d1f93/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "The campaigns of Vice President Kamala Harris and former President Donald Trump are arguing in advance of their high-stakes Sept.",
      "publishedAt": "2024-08-26T15:10:08Z",
      "title": "Harris and Trump squabble over muted mics at upcoming debate",
      "url": "https://apnews.com/83db9853877c5d00e46415ed98f46f25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/915507ec4a4846ab9c91cb601ec9a3b5/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — French President Emmanuel Macron said Monday that the arrest in France of the CEO of the popular messaging app Telegram, Pavel Durov, wasn’t a political move but part of an independent investigation.",
      "publishedAt": "2024-08-26T14:45:18Z",
      "title": "France's Macron says arrest of the head of the Telegram messaging app wasn’t political",
      "url": "https://apnews.com/ae82ffd2197cf5684eb710e1b23650e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecafb659b7f84f0fabd30e82e921dab1/1894.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Ukraine says it has a new long-range weapon to strike deep into Russia without asking permission from allies — a homegrown combination of missile and drone that the defense minister vowed Monday would provide “answers” to a wave of Russian bombings.",
      "publishedAt": "2024-08-26T09:22:41Z",
      "title": "Ukraine counts on new long-range weapon to bypass Western restrictions and hit deep into Russia",
      "url": "https://apnews.com/1f0a1eaf560bb2c1fd70ddd56a39968d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/491c5a25f2514692bfe44f9babe62ecc/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russia battered much of Ukraine on Monday, firing scores of missiles and drones that killed four people, injured more than a dozen and damaged energy facilities in attacks that President Volodymyr Zelensky described as “vile.”",
      "publishedAt": "2024-08-26T06:55:24Z",
      "title": "Russia's deadly overnight barrage of missiles and drones hits over half of Ukraine, officials say",
      "url": "https://apnews.com/25296eee7c9c394d07d806f44a2ec09e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86ad3114a7c34f5d8fa88f4a0f385b1d/1920.jpeg"
    },
    {
      "author": "DAVID KEYTON and DANICA KIRKA",
      "description": "LONDON (AP) — Icelandic police on Monday called off the search for anyone trapped in the previous day's collapse of an ice cave that killed one person and injured another, saying that all members of the tourist expedition had been accounted for.",
      "publishedAt": "2024-08-26T04:46:42Z",
      "title": "Police in Iceland call off search at ice cave collapse that killed 1 man, saying no one is missing",
      "url": "https://apnews.com/8d6a45480717589a4699f75f976e3df3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b9a2f95fe27403da60ce3d808483ff0/1920.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canada’s government on Monday announced it is imposing a 100% tariff on imports of Chinese-made electric vehicles that matches U.S.",
      "publishedAt": "2024-08-26T12:38:47Z",
      "title": "Canada imposes a 100% tariff on imports of Chinese-made electric vehicles, matching the US",
      "url": "https://apnews.com/0cd68ba7533bc6e7111cdd5811c8889c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca20e30f6844f6bb661b160f407c087/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Multiple attacks in Pakistan’s restive southwest have killed at least 38 people, the highest death toll in a 24-hour period blamed on separatists in Baluchistan province in recent years.",
      "publishedAt": "2024-08-26T09:48:12Z",
      "title": "What’s behind the bloodiest recent attacks in Pakistan's Baluchistan province?",
      "url": "https://apnews.com/ec59317765a0aa49a5434097a5e9cb48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf8bc7435fe84f60b0a8b2c1a6e9ba6b/2270.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "Brandi Brown has yet to find a Black church near her Southern California home that feels right for her. So when she wants to talk about God, she relies on someone over a thousand miles (1,600 kilometers) away.",
      "publishedAt": "2024-08-26T04:09:58Z",
      "title": "How women of color with Christian and progressive values are keeping the faith — outside churches",
      "url": "https://apnews.com/875f4d5b1534912403b20aabccbc43c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23edfdccfb474786bcca53103ef6a127/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}