{
  "articles": [
    {
      "author": null,
      "description": "A spokesperson says parts of the Fort Stewart in southeast Georgia were locked down after an active shooter was reported on the sprawling Army post. Lt. Col. Angel Tomko told The Associated Press on Wednesday that an active shooter had been confirmed. Fort Stewart, located southwest of Savannah, is the largest Army post east of the Mississippi River. It’s home to thousands of soldiers and family members.",
      "publishedAt": "2025-08-06T15:52:12Z",
      "title": "Army base in Georgia is on lockdown after report of an active shooter, spokesperson tells AP",
      "url": "https://apnews.com/article/georgia-army-post-lockdown-shooter-0b3b2cda384d1f33d107d988e6088d92",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Local health officials say at least 38 Palestinians were killed overnight and into Wednesday in the Gaza Strip while seeking aid from United Nations convoys and sites run by an Israeli-backed American contractor. The Israeli military said it had fired warning shots when crowds approached its forces. The latest deaths came as Prime Minister Benjamin Netanyahu was expected to announced further military action — and possibly plans for Israel to fully reoccupy Gaza. Experts say Israel’s ongoing military offensive and blockade are already pushing the territory of some 2 million Palestinians into famine.",
      "publishedAt": "2025-08-06T14:22:59Z",
      "title": "Dozens killed seeking aid in Gaza as Israel considers further military action",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-08-06-2025-bcdd6419be65017f97f51ab2e58d5c8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/53916e2/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Ff6%2F220a5289bfb48414d651aee2b422%2Feae90f035eca4514847cdfa30cf6e028"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump's special envoy, Steve Witkoff, has arrived in Moscow. Russian media reported his visit on Wednesday, just days before the White House's deadline for Russia to reach a peace deal with Ukraine. If not, Moscow could face severe economic penalties. Witkoff was seen taking a stroll with Kirill Dmitriev, the Russian president's envoy for investment and economic cooperation. Moscow has not confirmed whether Witkoff will meet with President Vladimir Putin. Trump's deadline for Putin ends on Friday. Washington has threatened severe tariffs and other penalties if the conflict in Ukraine continues.",
      "publishedAt": "2025-08-06T07:04:34Z",
      "title": "Trump's envoy Witkoff arrives in Moscow ahead of Russia-Ukraine peace deadline, Russian media say",
      "url": "https://apnews.com/article/russia-ukraine-war-witkoff-moscow-trump-deadline-118b3cbcfa12d1dd9a75ce20b0b3e61e",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Trump has signed an executive order to place an additional 25% tariff on India for its purchases of Russian oil. That brings the combined tariffs imposed by the United States on India to 50%. The tariffs would go into effect 21 days after the signing of the order Wednesday, meaning that both India and Russia might have time to negotiate with the administration on the import taxes. Trump’s move could reshape India’s economic ambitions. Many American companies have seen India as an alternative to the Chinese manufacturing that Trump had hoped to diminish through the use of tariffs.",
      "publishedAt": "2025-08-06T14:35:16Z",
      "title": "Trump to put additional 25% import taxes on India",
      "url": "https://apnews.com/article/trump-india-russia-oil-tariffs-2db9dc22d7b56624bdceb2e15c134d60",
      "urlToImage": "https://dims.apnews.com/dims4/default/da9c979/2147483647/strip/true/crop/6342x3567+0+330/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2Fc7%2F1ed490edf68ab3a78323fcc22d98%2Fe38f4200ccd74e34bb5aa34e192a5574"
    },
    {
      "author": null,
      "description": "President Donald Trump is expected to celebrate at the White House a commitment by Apple to increase its U.S. investments by an additional $100 billion over the next four years. Apple had previously said it intended to invest $500 billion domestically, a figure it'll now increase to $600 billion. Trump in recent months has criticized the tech company and CEO Tim Cook for efforts to shift iPhone production to India to avoid the tariffs his Republican administration had planned for China. The White House calls Wednesday's announcement with Apple a win for the U.S. manufacturing industry. Apple hasn't commented.",
      "publishedAt": "2025-08-06T14:46:34Z",
      "title": "Trump highlights Apple's plans to invest $100 billion more in US",
      "url": "https://apnews.com/article/trump-apple-100-billion-investment-47d41d07cac5e914adeee7c4c28c0166",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf0e312/2147483647/strip/true/crop/6000x3375+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F13%2F3485fb41c0e909034213f15b217c%2F57fa2e708c3142b99e9322fc70bbcfd8"
    },
    {
      "author": null,
      "description": "Three new studies highlight the severe health impacts of recent wildfires on Maui and in Los Angeles. Researchers found that the August 2023 Maui fire, one of the deadliest in a century, left 1 in 5 people with lung damage and half with symptoms of depression. The fire also nearly doubled suicide and overdose death rates. In Los Angeles, a study found over 400 deaths linked to the fires due to health care disruptions and other factors. Experts say these findings emphasize the broader health risks of extreme climate events. The studies were published Wednesday in two American Medical Association journals.",
      "publishedAt": "2025-08-06T15:02:00Z",
      "title": "New studies show impact of Maui and Los Angeles wildfires on human health",
      "url": "https://apnews.com/article/maui-los-angeles-wildfires-335076cac4f5e92a3a61e4ae734f7918",
      "urlToImage": "https://dims.apnews.com/dims4/default/5224c36/2147483647/strip/true/crop/4200x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F43%2F5aa610e72c9be296989e83eeca9e%2F81f904634197449093427e96875f6903"
    },
    {
      "author": null,
      "description": "New research from a watchdog group reveals ChatGPT can provide harmful advice to teens. The Associated Press reviewed interactions where the chatbot gave detailed plans for drug use, eating disorders, and even suicide notes. The Center for Countering Digital Hate found that testing ChatGPT with harmful prompts led the chatbot to respond in dangerous ways more than half the time. The study highlights the risks as more people, particularly teens, turn to AI for companionship and advice. OpenAI, the maker of ChatGPT, said after viewing the findings that its “work is ongoing” in refining “how models identify and respond appropriately in sensitive situations.”",
      "publishedAt": "2025-08-06T13:01:32Z",
      "title": "Watchdog: ChatGPT gives teens dangerous advice on drugs, alcohol and suicide",
      "url": "https://apnews.com/article/chatgpt-study-harmful-advice-teens-c569cddf28f1f33b36c692428c2191d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/6512377/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F98%2Ff01a0f58cbc04b5bb688f63b9597%2Faf7c1d69e0ef4e23a78b215517c85eff"
    },
    {
      "author": null,
      "description": "Wall Street is holding relatively steady following a mixed set of profit reports from such giants as McDonald’s and The Walt Disney Co. The S&P 500 rose 0.2% Wednesday. The Dow Jones Industrial Average added 18 points, and the Nasdaq composite gained 0.4%. McDonald’s and Shopify rose following their profit reports, while Disney fell after its earnings beat forecasts but its revenue fell short. The mixed trading continues a cooldown for the stock market following several sharp swings. Strong profit reports and hopes for cuts to interest rates have helped offset worries about how tariffs may be hurting the economy.",
      "publishedAt": "2025-08-06T04:28:20Z",
      "title": "Wall Street holds steady following mixed profit reports from McDonald's, Disney and Shopify",
      "url": "https://apnews.com/article/stock-markets-trump-tariffs-economy-5f713c2b951d099b621563e0925eee4b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d005fec/2147483647/strip/true/crop/3822x2150+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2Fcb%2Fbc1b4d314c4fc19d97eb58796e14%2Fde18532928fe451eaea6e8cf2a163e4e"
    },
    {
      "author": null,
      "description": "Jen Pawol is set to become the first woman to umpire a game in Major League Baseball when she works games this weekend between the Miami Marlins and Atlanta Braves. Pawol will work the bases in Saturday’s doubleheader at Truist Park and the plate on Sunday, MLB said Wednesday. Pawol, a 48-year-old from New Jersey, worked spring training games in 2024 and this year. MLB’s move comes 28 years after the gender barrier for game officials was broken in the NBA, 10 years after it ended the NFL and three years after the men’s soccer World Cup employed a female referee.",
      "publishedAt": "2025-08-06T17:06:34Z",
      "title": "Jen Pawol to make history as first woman umpire in Major League Baseball",
      "url": "https://apnews.com/article/mlb-female-umpire-jen-pawol-000cf10d7d458329e89d4fa83f8cefcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a007bb/2147483647/strip/true/crop/2755x1550+0+144/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fe6%2Fcf011ccd303eaa91ef95ccbb4216%2Fdff666da3a144d2891f9e7e886cb1a34"
    },
    {
      "author": null,
      "description": "BAZOURIEH, Lebanon (AP) — On Sept. 17, 2024, thousands of pagers distributed to the Hezbollah group exploded across Lebanon, remotely detonated by Israel and aimed at disrupting the Iran-backed group as it fired almost daily at Israel in solidarity with Palestinians in Gaza.",
      "publishedAt": "2025-08-06T13:44:23Z",
      "title": "Photos of survivors of Israel's pager attack on Hezbollah last year",
      "url": "https://apnews.com/photo-essay/lebanon-israel-hezbollah-pagers-attack-survivors-photos-187318e3f8df72d15e89b8d955f20ba2",
      "urlToImage": "https://dims.apnews.com/dims4/default/abe51c0/2147483647/strip/true/crop/3205x1803+0+167/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F14%2F6428a9877011621f28c3ab29f2b8%2F7a054ee5085e40e1a4759b164a0f7b62"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}