{
  "articles": [
    {
      "author": "Deepti Hajela",
      "description": "Ask someone for their thoughts, could it now cost you a nickel? If you want to call somebody stingy, would you say they’re a quarter-pincher? And if they spend money unwisely, are they now dime wise but pound foolish? Ok, maybe those are some penny-ante concerns in the wake of the U.S. Treasury saying it will stop making shiny new penny coins after the current production run is complete. But it is the end of an era in the United States. While there will still be over a billion pennies in circulation, no new cents will be joining their ranks for the first time in more than two centuries.",
      "publishedAt": "2025-05-23T19:53:30Z",
      "title": "The penny won't be made anymore, but its impact on the culture remains",
      "url": "https://apnews.com/article/no-more-penny-end-production-cent-25527a16976a8c81f91c1a4a4eba473a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8ef37f/2147483647/strip/true/crop/3000x1688+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2Fb0%2Ffec1953df8ad5ac70df1a75e293c%2Febe6676e626a46ffb644ab081b3ef915"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump on Friday threatened to put a 25% tariff on Apple products unless iPhones are manufactured in the United States. The threat delivered over social media could dramatically increase the price of iPhones, potentially hurting sales and the profits of one of America’s leading technology companies. The company now joins Amazon, Walmart and other major companies as being in the White House’s crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by the import taxes being imposed by Trump.",
      "publishedAt": "2025-05-23T11:39:48Z",
      "title": "Trump threatens 25% import tax on Apple unless iPhones are made in the US",
      "url": "https://apnews.com/article/trump-tariff-apple-iphone-tax-170021e8fad22878d0183b5d48971087",
      "urlToImage": "https://dims.apnews.com/dims4/default/060d102/2147483647/strip/true/crop/5383x3028+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F4a%2F263e817a39437ebb480885f4b629%2F2b51e19e1e9649db8f993672e49ba853"
    },
    {
      "author": "Collin Binkley",
      "description": "Harvard University is challenging the Trump administration’s decision to bar the Ivy League school from enrolling foreign students. The school says that's an unconstitutional retaliation for defying the White House’s political demands. Harvard filed a lawsuit Friday in federal court in Boston that says the government's action violates the First Amendment and due process clause. The school says the penalty will mean an “immediate and devastating effect for Harvard and more than 7,000 visa holders.”",
      "publishedAt": "2025-05-23T12:33:43Z",
      "title": "Harvard sues over ban on foreign student enrollment",
      "url": "https://apnews.com/article/harvard-foreign-students-enrollment-trump-lawsuit-94b65866c563e67a7a7a3c79e90144d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/435c5a6/2147483647/strip/true/crop/4116x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F42%2Ff46f197d702f52e131b55bf70a35%2F1674aa3aa7314708ad42721731b58e3a"
    },
    {
      "author": "Julie Watson",
      "description": "The music agency Sound Talent Group says three of its employees died on the private plane that crashed into a San Diego neighborhood on Thursday. The music agency says the dead include Dave Shapiro, the agency’s co-founder. Shapiro is listed as the owner of the plane and has a pilot’s license. Sound Talent Group has represented artists including Hanson, Sum 41 and Vanessa Carlton. The agency didn’t share the names of the other two employees who were killed. The private jet crashed early Thursday into a neighborhood of U.S. Navy-owned housing in San Diego during foggy weather, igniting at least one home and numerous vehicles parked on the street.",
      "publishedAt": "2025-05-22T12:37:03Z",
      "title": "3 people dead after small plane crashes into San Diego neighborhood",
      "url": "https://apnews.com/article/plane-crash-san-diego-5e465454fc0282a81adafc1bfdc142a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7616bde/2147483647/strip/true/crop/4619x2598+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F7d%2F245e1c081dc1ce790684553dacb3%2F0137346332ce469b9dc66cd844192eef"
    },
    {
      "author": "Thomas Adamson, John Leicester",
      "description": "A Paris court has found the ringleader and seven other people guilty in the 2016 robbery of Kim Kardashian. The court on Friday acquitted two of the 10 defendants. The sentences being read out by the court president range from prison terms to fines. The 69-year-old ringleader Aomar Aït Khedache got the stiffest sentence. He given eight years imprisonment but five of those are suspended. Three others who were accused on the most serious charges got seven years, five of them suspended.",
      "publishedAt": "2025-05-23T05:13:18Z",
      "title": "Paris court finds ringleader and 7 others guilty in 2016 robbery of Kim Kardashian",
      "url": "https://apnews.com/article/kim-kardashian-heist-verdict-ff574b4b9427f7908ab32e3ee0008fef",
      "urlToImage": "https://dims.apnews.com/dims4/default/26f4165/2147483647/strip/true/crop/2459x1383+0+128/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fb1%2F10de45c3306bdf907f9376fd0731%2F853d254a40444d6b8125068877046e1c"
    },
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "A senior Ukrainian officials says an exchange of prisoners between Russia and Ukraine from their more than three-year war is underway. The official said the swap was ongoing Friday morning and had not yet finished. He who spoke on condition of anonymity because he was not authorized to speak publicly. Moscow did not immediately confirm the exchange was underway. Ukraine and Russia agreed to the exchange of 1,000 prisoners from each side a week ago in Turkey in their first direct peace talks since the early weeks of Moscow’s 2022 invasion of its neighbor. That meeting lasted only two hours and brought no breakthrough in international diplomatic efforts to stop the fighting.",
      "publishedAt": "2025-05-23T10:32:46Z",
      "title": "Ukrainian official says major prisoner swap with Russia is underway",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-prisoner-swap-8b745966e2f9a484d80ed89fb70d5648",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e8698a/2147483647/strip/true/crop/3811x2144+0+119/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F9c%2Ffbd6560b58bb196ad2d4291a20e0%2F5f8a75af4c0541488debe56ffb388b6d"
    },
    {
      "author": "Collin Binkley, Jocelyn Gecker",
      "description": "For students around the world, an acceptance letter to Harvard University has represented the pinnacle of achievement. The letter offers a spot among the elite at a campus that produces Nobel Prize winners, captains of industry and global leaders. That prestige is now in jeopardy. In its intensifying fight with the White House, Harvard was dealt its heaviest blow yet on Thursday, when the government blocked the Ivy League school from enrolling foreign students. The move threatens to undermine Harvard’s stature, its revenue and its appeal among top scholars around the world. Even more than the government’s $2.6 billion in research cuts, the administration’s action represents an existential threat for Harvard.",
      "publishedAt": "2025-05-23T17:46:11Z",
      "title": "Harvard international students' sanction by Trump administration hurts global allure",
      "url": "https://apnews.com/article/harvard-international-students-trump-2c72d5d0dc83949cfc03f81660419b31",
      "urlToImage": "https://dims.apnews.com/dims4/default/435c5a6/2147483647/strip/true/crop/4116x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F42%2Ff46f197d702f52e131b55bf70a35%2F1674aa3aa7314708ad42721731b58e3a"
    },
    {
      "author": null,
      "description": "Authorities in Germany say an assailant stabbed people at the central railway station in the city of Hamburg, injuring 12 people — six of them critically. Police say a suspect in the Friday attack has been arrested. Hamburg’s fire service said that six people sustained life-threatening injuries, while another three were seriously injured and three had slight injuries. Authorities didn’t give any details of the suspect, or additional details of the attack.",
      "publishedAt": "2025-05-23T17:20:10Z",
      "title": "12 people injured in stabbing at Hamburg train station, authorities say",
      "url": "https://apnews.com/article/stabbing-hamburg-train-station-aa0c9d31a07e6055cf465986cbe578d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d391f2/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F15%2F9e4886f2d483a9d9a5acdf8829a8%2Fe00116d7f5b54b45a1d60592ea5c45b4"
    },
    {
      "author": "Alanna Durkin Richer",
      "description": "The Justice Department has reached a deal with Boeing that will allow the company to avoid criminal prosecution for allegedly misleading U.S. regulators about the 737 Max jetliner before two of the planes crashed and killed 346 people. The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion and, in return, the department will dismiss the criminal case against the aircraft manufacturer. The deal still needs to be finalized. Paul Cassell, an attorney for many of the families in the long-running case, had previously said his clients strongly oppose dropping the criminal case.",
      "publishedAt": "2025-05-23T18:59:22Z",
      "title": "Boeing to pay $1.1B to avoid criminal prosecution in 737 Max case",
      "url": "https://apnews.com/article/boeing-justice-department-max-crashes-9f7250a2e2b400b31e19f2b261f78163",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c4a7de/2147483647/strip/true/crop/5152x2898+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F4d%2F6cdef9f569815e27fc200d596fb6%2F47ba134b01504dbba19c160883966197"
    },
    {
      "author": "The Associated Press",
      "description": "Billy Joel has canceled all his upcoming concerts across North America and England after being diagnosed with fluid buildup in his brain that has affected his “hearing, vision and balance.” Joel revealed on Instagram that he has Normal Pressure Hydrocephalus. It's “a brain disorder that can affect brain-related abilities, including thinking and concentrating, memory, movement and more,” the Cleveland Clinic says. Joel, 76, wrapped up his decadelong residency at Madison Square Garden in July 2024 and continued to tour. His planned summer stops included shows at Yankee Stadium and Citi Field in New York, and MetLife Stadium in East Rutherford, New Jersey. Tickets for all the shows will be refunded.",
      "publishedAt": "2025-05-23T18:13:04Z",
      "title": "Billy Joel stops tour after being diagnosed with a brain disorder",
      "url": "https://apnews.com/article/billy-joel-tour-2025-2813cbc970f48295f62014181ac53eae",
      "urlToImage": "https://dims.apnews.com/dims4/default/f767d19/2147483647/strip/true/crop/3500x1969+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2F96%2F806d5b96a125c91771a9a9016035%2F1ab1713e9e534f25893393f95e27a29d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}