{
  "articles": [
    {
      "author": "KATE PAYNE and BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Jimmy Carter 's long public goodbye began Saturday in Georgia, with the 39th U.S. president’s flag-draped casket rolling through his tiny hometown and past his boyhood farmhouse on its way to Atlanta, where he climbed the political ladder and based his decades of humanitarian work after leaving the White House.",
      "publishedAt": "2025-01-04T15:19:48Z",
      "title": "Jimmy Carter's flag-draped casket is on its way to Atlanta as 39th president's state funeral begins",
      "url": "https://apnews.com/39d9be789f75b477b34fccdc2531238c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54c9e8a3aebc4031a05c772f1f140beb/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — This time was supposed to be different. But while House Speaker Mike Johnson on Friday avoided the dayslong ordeal that his predecessor, Kevin McCarthy, endured to become speaker, his relatively swift victory was hardly a unifying moment.",
      "publishedAt": "2025-01-04T13:29:08Z",
      "title": "House Speaker Mike Johnson held onto his job, but there are signs of trouble ahead",
      "url": "https://apnews.com/be61b59070a468862119799e847ae8d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b2eaa343ad645428177353e0941ae1e/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Inside the Capitol, reminders of the violence are increasingly hard to find.Scars on the walls have been repaired. Windows and doors broken by the rioters have been replaced.",
      "publishedAt": "2025-01-04T13:33:58Z",
      "title": "Reminders of Jan. 6 attack fade in the Capitol as Trump retakes power",
      "url": "https://apnews.com/af6fe32d72b36c880aec0639ba92e869",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9387e016d1374120a867627cdc220f6a/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN, JACK BROOK, STEPHEN SMITH and SARA CLINE",
      "description": "NEW ORLEANS (AP) — The man who rammed a pickup truck into a crowd of New Year's revelers in New Orleans had suspected bomb-making materials at his home and reserved the vehicle used in the deadly attack more than six weeks earlier, law enforcement officials told The Associated Press on Friday.",
      "publishedAt": "2025-01-04T15:27:20Z",
      "title": "New Orleans attacker had suspected bomb materials at home, reserved truck weeks ago, officials say",
      "url": "https://apnews.com/15400d7a4cb29c9cfce212b99cac637b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a19f8a435a947e0a998c611c1248d45/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed at least 21 people, including at least two children, on Saturday in Gaza, hospital staff said, while a new effort at ceasefire talks was underway in Qatar after nearly 15 months of war.",
      "publishedAt": "2025-01-04T14:21:57Z",
      "title": "Israeli airstrikes in Gaza kill at least 21, hospital workers say, as talks underway",
      "url": "https://apnews.com/a6f9f03b1c5922a2e6f223f17d9d27cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3151fa71386475887d9dc131956788b/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and BRIAN WITTE",
      "description": "Road conditions were deteriorating Saturday in the central U.S. as a winter storm brought a mix of snow, ice and plunging temperatures, with forecasts calling for the dreaded combo to spread eastward in the coming days.",
      "publishedAt": "2025-01-04T19:40:46Z",
      "title": "Drivers skid and crash as wintry mix grips central US before moving east",
      "url": "https://apnews.com/8dfabc4c2e17d86a270bdaa350f5e148",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e450cb0c87de4a4584f9afb57a07a613/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — In the East Room of the White House on a particularly frigid Saturday afternoon, President Joe Biden bestowed the Presidential Medal of Freedom to 19 of the most famous names in politics, sports, entertainment, civil rights, LGBTQ+ advocacy and science.",
      "publishedAt": "2025-01-04T10:04:57Z",
      "title": "Hillary Clinton, George Soros and Denzel Washington received the highest US civilian honor",
      "url": "https://apnews.com/4b19a363d3058ac3b8107e2002b93651",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909b188ec080410f9ce8daf05b20fec9/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The congressional joint session to count electoral votes on Monday is expected to be much less eventful than the certification four years ago that was interrupted by a violent mob of supporters of then-President Donald Trump who tried to stop the count and overturn the results of an election he lost to Democrat Joe Biden.",
      "publishedAt": "2025-01-04T13:46:43Z",
      "title": "How Congress will certify Trump's Electoral College victory on Jan. 6",
      "url": "https://apnews.com/36d63d51027cce9c0a73a42c408ca6f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/744d7b1797aa4266bcc16bbe84e21e53/1920.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Austrian Chancellor Karl Nehammer said Saturday he will resign in the coming days after talks on forming a new government failed a second time.The announcement came after the People’s Party and the Social Democrats on Saturday continued coalition talks a day after the liberal Neos party’s surprise withdrawal from discussions.",
      "publishedAt": "2025-01-04T18:41:17Z",
      "title": "Austrian Chancellor Nehammer says he will resign after talks on forming a new government fail",
      "url": "https://apnews.com/2e4ce6802617c2ac7a6d28f4842df38e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f703c074f2174ba282f063bc7af0906c/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "NEW YORK (AP) — Your car is spying on you.That is one takeaway from the fast, detailed data that Tesla collected on the driver of one of its Cybertrucks that exploded in Las Vegas earlier this week.",
      "publishedAt": "2025-01-04T14:00:27Z",
      "title": "Tesla data helped police after Las Vegas truck explosion, but experts have wider privacy concerns",
      "url": "https://apnews.com/789dc864a0c138fd7c36ca8c94b0fbfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/872df8b62c804785916e2e9c94cec65f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}