{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — More than 29,000 Palestinians have been killed in the Gaza Strip since the start of the Israel-Hamas war, the territory's Health Ministry said Monday, marking another grim milestone in the deadliest round of violence in the history of the Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-19T10:23:17Z",
      "title": "Gaza Health Ministry says over 29,000 Palestinians have been killed in Israel-Hamas war",
      "url": "https://apnews.com/81c2d362340b611a98e4b929b4b5d0a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29c4f97eb37b4ae3905fca8c8473fcdd/1920.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The Palestinian foreign minister on Monday accused Israel of apartheid and urged the United Nations' top court to declare that Israel’s occupation of lands sought for a Palestinian state is illegal and must end immediately and unconditionally for any hope for a two-state future to survive.",
      "publishedAt": "2024-02-19T07:35:58Z",
      "title": "Palestinian diplomat accuses Israel of apartheid and asks UN court to declare its occupation illegal",
      "url": "https://apnews.com/ab4b6118247c8c6fd797ebe96f1dd19a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa00048accea457388ae0615c36d0a41/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI and HEATHER HOLLINGSWORTH",
      "description": "BURNSVILLE, Minn. (AP) — A suburban Minneapolis community was in mourning on Monday after authorities said two police officers and a firefighter were killed by a heavily armed man who shot at them from inside a home that was filled with children.",
      "publishedAt": "2024-02-19T05:14:44Z",
      "title": "Minnesota community mourns 2 officers, 1 firefighter killed at the scene of a domestic call",
      "url": "https://apnews.com/76ae1cd7362b4bf3bca4e9598f9a968f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dc9af9a3e7e40d0aef173c2d7c2cc91/1920.jpeg"
    },
    {
      "author": "JACK DURA and STEVE KARNOWSKI",
      "description": "BURNSVILLE, Minn. (AP) — Two police officers and a firefighter who responded to a domestic situation at a suburban Minneapolis home were killed early Sunday during a standoff by a heavily armed man who shot at police from the home where seven children were also inside.",
      "publishedAt": "2024-02-19T16:06:02Z",
      "title": "What we know about the Minnesota shooting that killed 2 officers and a firefighter",
      "url": "https://apnews.com/d0bf1062499b25a818da45c3c9596a28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dc9af9a3e7e40d0aef173c2d7c2cc91/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "At about 2 a.m. last Tuesday, Republican Sen. Ron Johnson of Wisconsin stood on the Senate floor and explained why he opposed sending more aid to help Ukraine fend off the invasion launched in 2022 by Russian President Vladimir Putin.",
      "publishedAt": "2024-02-19T12:05:12Z",
      "title": "Stalled US aid for Ukraine underscores GOP's shift away from confronting Russia",
      "url": "https://apnews.com/fbe56b789e7c37313ec158a00a571be4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fc4301625934d2aa6aa77791424cb10/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The widow of Russian opposition leader Alexei Navalny vowed on Monday to continue his fight against the Kremlin while authorities denied his mother access to a morgue where his body is believed to be held after his death last week in an Arctic penal colony.",
      "publishedAt": "2024-02-19T09:55:09Z",
      "title": "Navalny's widow vows to continue his fight against the Kremlin and punish Putin for his death",
      "url": "https://apnews.com/56d3cf1d114e6be452465d5e312b4fad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4480cf98d1814f17beeafdb5824794aa/1920.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russian forces have completed their takeover of Avdiivka by eliminating the last pocket of resistance at the eastern Ukraine city’s huge coke plant, the Russian military said Monday, after the sheer weight of its troop numbers and greater air and artillery firepower drove out Kyiv’s forces.",
      "publishedAt": "2024-02-19T09:11:50Z",
      "title": "Russia says it has crushed the last pocket of resistance in Avdiivka to complete the city's capture",
      "url": "https://apnews.com/b2e9487c4f96c3ed81f799303c738f58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d40a0ca81b946288169454b1ec36758/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen's Houthi rebels that damaged a Belize-flagged ship traveling through the Bab el-Mandeb Strait that connects the Red Sea and the Gulf of Aden has forced the crew to abandon the ship, authorities said Monday.",
      "publishedAt": "2024-02-19T00:42:12Z",
      "title": "Houthi rebels' attack severely damages a Belize-flagged ship in key strait leading to the Red Sea",
      "url": "https://apnews.com/67cf1acc17f4e17d04075a99688e4da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4cb0423cbef414caf3cdfd2adba7608/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — The latest in a series of wet winter storms gained strength in California early Monday, with forecasters warning of possible flooding, hail, strong winds and even brief tornadoes as the system moves south over the next few days.",
      "publishedAt": "2024-02-19T05:09:26Z",
      "title": "California braces for flooding again as another wet winter storm hits",
      "url": "https://apnews.com/f359d1eccd44b5a7f3a09f0d436d7689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/921b7cc1d70e4026973d59463affcbf5/2937.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican has been trying for years to debunk the idea that its vaunted secret archives are all that secret: It has opened up the files of controversial World War II-era Pope Pius XII to scholars and changed the official name to remove the word “Secret” from its title.",
      "publishedAt": "2024-02-19T09:04:10Z",
      "title": "The keeper of the Vatican’s secrets is retiring. Here’s what he wants you to know",
      "url": "https://apnews.com/c0c31a8e0b7e8d0827467367dd94779f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcd676f87d024f94b60904be40fdc4ab/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}