{
  "articles": [
    {
      "author": "JENNIFER PELTZ and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — With presidential candidates looking on, some 9/11 victims' relatives appealed to them Wednesday for accountability as the U.S.",
      "publishedAt": "2024-09-11T04:08:12Z",
      "title": "9/11 anniversary brings Biden, Harris and Trump together at ground zero",
      "url": "https://apnews.com/52ddad8ed7f62e155644f0ae6eda96ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/417d8cfd607c4a7d90567f2ef5fe3414/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and BILL BARROW",
      "description": "NEW YORK (AP) — Donald Trump emerged Wednesday from a rocky debate against Kamala Harris looking to regain his footing with 54 days until Election Day, the first ballots already going out in Alabama and other states on the cusp of early voting.",
      "publishedAt": "2024-09-11T15:48:04Z",
      "title": "Donald Trump faces his own debate fallout just months after benefitting from Joe Biden's",
      "url": "https://apnews.com/7b35889a2f11caad19bf63baf0c84f57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4355db335fff45fb866a9fd7738b0db9/1920.jpeg"
    },
    {
      "author": "JOHN HANNA and CHRISTINA A. CASSIDY",
      "description": "TOPEKA, Kan. (AP) — State and local election officials from across the country on Wednesday warned that problems with the nation's mail delivery system threaten to disenfranchise voters in the upcoming presidential election, telling the head of the U.S.",
      "publishedAt": "2024-09-11T16:02:47Z",
      "title": "Election officials warn that widespread problems with the US mail system could disrupt voting",
      "url": "https://apnews.com/985dd6e483fb6dc593d83255b11a9d0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c062db24c3984983b3c924320b15f5b3/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson pulled a vote Wednesday on a temporary spending bill that would keep federal agencies and programs funded for six months as it became increasingly clear the measure lacked the support to pass as a potential partial government shutdown looms.",
      "publishedAt": "2024-09-11T16:29:17Z",
      "title": "Speaker Johnson calls off a vote on a bill to avoid a partial government shutdown",
      "url": "https://apnews.com/b2b20d38dbb0fcf3390a97eb1cc29418",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f88acf6a40d4e689602de0786b11b8b/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFAA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes across Gaza overnight and Wednesday hit a U.N.",
      "publishedAt": "2024-09-11T15:22:14Z",
      "title": "Israeli airstrikes hit UN school and homes in Gaza, killing at least 34 people, hospitals say",
      "url": "https://apnews.com/44f93845d6b6cfc9dcc4d0ba37bdd263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ec6cfc2cbbe49cabca4c475e5ed92d0/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "LEESBURG, Va. (AP) — At an impromptu party in the office to celebrate his 50th birthday, a veteran CIA officer got drunk, reached up a colleague’s skirt and forcibly kissed her in front of stunned co-workers, prosecutors alleged in the latest case of sexual misconduct to spill from the spy agency into a public court.",
      "publishedAt": "2024-09-11T14:45:16Z",
      "title": "New CIA workplace assault case emerges as spy agency shields extent of sexual misconduct in ranks",
      "url": "https://apnews.com/b9ad870f695d6f4127205536fafa66d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfd7a1d535484f6fb5da216f8db1c77b/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — The United States and Britain pledged nearly $1.5 billion in additional aid to Ukraine on Wednesday during a visit to Kyiv by their top diplomats as Ukrainian officials renewed their pleas to use Western-provided missiles against targets deeper inside Russia.",
      "publishedAt": "2024-09-11T08:48:11Z",
      "title": "Top US and UK diplomats pledge almost $1.5B in additional aid for Ukraine during visit to Kyiv",
      "url": "https://apnews.com/0584fb5f4cf2b89f9b4eea1358700a91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/966235c6b9c74abfb8166eb03c8d173b/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The post-pandemic spike in U.S. inflation eased further last month as year-over-year price increases reached a three-year low, clearing the way for the Federal Reserve to cut interest rates and likely shaping the economic debate in the final weeks of the presidential race.",
      "publishedAt": "2024-09-11T07:00:20Z",
      "title": "US inflation reaches a 3-year low as Federal Reserve prepares to cut interest rates",
      "url": "https://apnews.com/bb1f4cfeede550c6c82fd78e2ea537a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78de5fe3a6cd4e98b052bb054ffb2b22/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — First came space tourism. Now comes an even bigger thrill for the monied masses: spacewalking.",
      "publishedAt": "2024-09-11T13:22:19Z",
      "title": "Spacewalking is the new domain of the rich as billionaire attempts first private spacewalk",
      "url": "https://apnews.com/7967876919a59dd75080309759e50aaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b12e3af2c2d491d840e62c07b788923/2000.jpeg"
    },
    {
      "author": "TIM REYNOLDS and ALANIS THAMES",
      "description": "MIAMI GARDENS, Fla. (AP) — Miami Dolphins wide receiver Tyreek Hill acknowledged Wednesday that he could have handled himself better in the initial moments of a weekend traffic stop that left him handcuffed and pulled out of his car by police officers near the team's stadium.",
      "publishedAt": "2024-09-11T16:46:33Z",
      "title": "Tyreek Hill says he could have handled his traffic stop better but he still wants the officer fired",
      "url": "https://apnews.com/8d8f5fd2e9235b5df1ec04ab0a26ece7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86ea354e922940419c2abbb62e7c95ec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}