{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — A former Republican attorney general candidate and another supporter of former President Donald Trump have been criminally charged in Michigan in connection with accessing and tampering with voting machines after the 2020 election, according to court records.",
      "publishedAt": "2023-08-01T19:24:14Z",
      "title": "Michigan prosecutors charge Trump allies in felonies involving voting machines, illegal ‘testing’",
      "url": "https://apnews.com/a58c4a58de84d432815ec1be39c19b90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/faee7cbf7966432f9dc023cecdb58595/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — X, the social media platform formerly known as Twitter, has sued a group of researchers — alleging their work highlighting an increase in hate speech on the platform cost the company millions of dollars of advertising revenue.",
      "publishedAt": "2023-08-01T20:14:18Z",
      "title": "X marks the lawsuit: Elon Musk's social media company sues nonprofit highlighting site's hate speech",
      "url": "https://apnews.com/1ca41944fdf58529d1fa280725a510da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f72e07c725a8411f80041ec18e65a454/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — A longtime Mar-a-Lago staffer who spent years fetching luxury cars for wealthy club members is the latest person to be ensnared in former President Donald Trump's ballooning legal troubles.",
      "publishedAt": "2023-08-01T04:01:39Z",
      "title": "Mar-a-Lago property manager is the latest in a line of Trump staffers ensnared in his legal turmoil",
      "url": "https://apnews.com/ef34c1f1c1c24cafbadea4aa7c5c11e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/238e088482644137bea3783d5e0eb39c/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "Spend enough time with ChatGPT and other artificial intelligence chatbots and it doesn't take long for them to spout falsehoods.",
      "publishedAt": "2023-08-01T08:56:29Z",
      "title": "Chatbots sometimes make things up. Is AI’s hallucination problem fixable?",
      "url": "https://apnews.com/ac4672c5b06e6f91050aa46ee731bcf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/782391250f5244beb50da79c07cda4df/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — A French military transport plane carrying Europeans departed Niger on Tuesday in the first such evacuation flight since mutinous soldiers ousted the country’s democratically elected president nearly a week ago and shut its borders.",
      "publishedAt": "2023-08-01T05:01:21Z",
      "title": "Niger crisis deepens as European nations evacuate and coup leaders get support from other juntas",
      "url": "https://apnews.com/0b951ec77a89033c84e6f0972cc21b5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dea12c9594ad431992c2b9c8a4b75589/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and EMMA BURROWS",
      "description": "TALLINN, Estonia (AP) — A drone attacked a skyscraper in central Moscow early Tuesday for the second time in around 48 hours, damaging the building’s facade and further underscoring the Russian capital’s vulnerability.",
      "publishedAt": "2023-08-01T07:36:01Z",
      "title": "Russia accuses Ukraine of striking same Moscow building that was hit by drone days ago",
      "url": "https://apnews.com/0773a8607c3e3c25a47124f4ef4d7b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96e2082bf3f14924b09c14975dd1fdc7/1920.jpeg"
    },
    {
      "author": "EVENS SANON and MICHAEL CASEY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Efforts to help Haitians survive the gang violence ravaging their nation suffered a new blow with the kidnapping of an American nurse from New Hampshire and her young daughter, who remained missing Tuesday.",
      "publishedAt": "2023-08-01T04:21:00Z",
      "title": "Efforts to help Haitians suffer new blow with kidnapping of American nurse and daughter",
      "url": "https://apnews.com/88df4a0a616599747b7e1728669b1f47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b60aff0476c649aeb1b87519e4050d09/1920.jpeg"
    },
    {
      "author": "MIKE CATALNI",
      "description": "TRENTON, N.J. (AP) — Lt. Gov. Sheila Oliver, who rose to become one of New Jersey’s most prominent Black leaders and passionately advocated for revitalizing cities and against gun violence, died Tuesday after a sudden illness.",
      "publishedAt": "2023-08-01T16:36:15Z",
      "title": "Sheila Oliver, New Jersey's lieutenant governor and a prominent Black leader, dies at 71",
      "url": "https://apnews.com/a675170db55ec88f797432c06809f0ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2610789a01944f468df0c7f7bbf1a92d/2800.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "Amazon is adding video telemedicine visits in all 50 states to a virtual clinic it launched last fall, as the e-commerce giant pushes deeper into care delivery.Amazon said Tuesday that customers can visit its virtual clinic around the clock through Amazon’s website or app.",
      "publishedAt": "2023-08-01T12:07:12Z",
      "title": "Amazon adds video telemedicine visits nationwide to its virtual clinic",
      "url": "https://apnews.com/d990181bd389b85e433ddd95d0a7122b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4247ac0055e42adba191cb81a20c714/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "There are now more golden lion tamarins bounding between branches in the Brazilian rainforest than at any time since efforts to save the species started in the 1970s, a new survey reveals.Once on the brink of extinction, with only about 200 animals in the wild, the population has rebounded to around 4,800, according to a study released Tuesday by the Brazilian science and conservation nonprofit Golden Lion Tamarin Association.",
      "publishedAt": "2023-08-01T12:46:56Z",
      "title": "Once nearing extinction, Brazil's golden monkeys have rebounded from yellow fever, scientists say",
      "url": "https://apnews.com/2a9dd25048e5df6da5ab9d5e5e9a5006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edc6eef978634542b7c2161a85ea4244/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}