{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday blocked a nationwide settlement with OxyContin maker Purdue Pharma that would shield members of the Sackler family who own the company from civil lawsuits over the toll of opioids.",
      "publishedAt": "2023-08-10T19:41:52Z",
      "title": "Supreme Court blocks OxyContin maker's bankruptcy deal that would shield Sackler family members",
      "url": "https://apnews.com/bd417e036d9f6db4b2916fdfbdb56252",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/152fe9ac93f44136b811eb846e12be28/3000.jpeg"
    },
    {
      "author": "AUDREY MCAVOY, JENNIFER SINCO KELLEHER and NICK PERRY",
      "description": "WAILUKU, Hawaii (AP) — The search of the wildfire wreckage on the Hawaiian island of Maui on Thursday revealed a wasteland of burned out homes and obliterated communities as firefighters battled the stubborn blaze that has already claimed 36 lives, making it the deadliest in the U.S.",
      "publishedAt": "2023-08-10T05:46:33Z",
      "title": "Maui surveys the burned wreckage caused by the deadliest US wildfire in years",
      "url": "https://apnews.com/f5a7047d407f836f89e90dd7f10faa94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d89f313d434717afdfd281821682a5/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Ukrainian authorities ordered a mandatory evacuation Thursday of nearly 12,000 civilians from 37 towns and villages in the eastern Kharkiv region, where Russian forces reportedly are making a concerted effort to punch through the front line.",
      "publishedAt": "2023-08-10T08:21:23Z",
      "title": "Russia's military push on the eastern front prompts Ukraine to evacuate thousands of civilians",
      "url": "https://apnews.com/e3279d216761cdecdb515d2514bcf493",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6512f7db7307442daa3194569e959bab/2999.jpeg"
    },
    {
      "author": "LISA MASCARO and COLLEEN LONG",
      "description": "WASHINGTON (AP) — The Biden administration on Thursday asked Congress to provide more than $13 billion in emergency defense aid to Ukraine and an additional $8 billion for humanitarian support through the end of the year, another massive infusion of cash as the Russian invasion wears on and Ukraine pushes a counteroffensive against the Kremlin's deeply entrenched forces.",
      "publishedAt": "2023-08-10T15:52:43Z",
      "title": "Biden asks Congress for more than $13B to support Ukraine and $12B for disaster fund",
      "url": "https://apnews.com/d392f9b1adbb9c44249dce1cccdc2d1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3597fe77739f464096505042bcd6e238/2800.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Prosecutors with special counsel Jack Smith's team asked a judge on Thursday to set a Jan. 2 trial date for former President Donald Trump in the case charging him with plotting to overturn his 2020 election loss.",
      "publishedAt": "2023-08-10T17:56:22Z",
      "title": "Prosecutors seek Jan. 2 trial date for Donald Trump in his 2020 election conspiracy case",
      "url": "https://apnews.com/6a16656a79dc708411626dc5b56f5588",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8535c82345b446aba4cd530923c6aaa7/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and MATTHEW LEE",
      "description": "DUBAI, United Arab Emirates (AP) — Iran has transferred five Iranian-Americans from prison to house arrest in exchange for billions of dollars frozen in South Korea, U.S. and Iranian officials said Thursday, in a deal that comes after months of heightened tensions between the two countries.",
      "publishedAt": "2023-08-10T16:29:58Z",
      "title": "Iran transfers 5 Iranian-American prisoners to house arrest in step toward deal for ultimate release",
      "url": "https://apnews.com/7be581f79f66636355600627dda3a5ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af340ba006cb4602a94578cc4df3a460/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and CHINEDU ASADU",
      "description": "NIAMEY, Niger (AP) — Niger’s junta told a top U.S. diplomat that they would kill deposed President Mohamed Bazoum if neighboring countries attempted any military intervention to restore his rule, two Western officials told The Associated Press.",
      "publishedAt": "2023-08-10T08:15:32Z",
      "title": "Western officials: Niger junta warned they'd kill deposed president after any military intervention",
      "url": "https://apnews.com/9032a0e1161551ffcfde4b785f6cf74a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ad4e3065f04452b2ad2dbd92accd14/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Inflation in the United States edged up in July after 12 straight months of declines. But excluding volatile food and energy costs, so-called core inflation matched the smallest monthly rise in nearly two years, a sign that the Federal Reserve’s interest rate hikes have continued to slow price increases.",
      "publishedAt": "2023-08-10T04:01:22Z",
      "title": "From eggs to electronics to used cars, consumer inflation eased its grip on US households in July",
      "url": "https://apnews.com/9ca16040f3824b498a7129e47b65f363",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cce1c6610abf49eba04e657980929e50/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — About 49,500 people took their own lives last year in the U.S., the highest number ever, according to new government data posted Thursday.The Centers for Disease Control and Prevention, which posted the numbers, has not yet calculated a suicide rate for the year, but available data suggests suicides are more common in the U.S.",
      "publishedAt": "2023-08-10T18:09:28Z",
      "title": "US suicides hit an all-time high last year",
      "url": "https://apnews.com/48511d74deb24d933e66cec1b6f2d545",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f006dacc18e24fd7b54ac935a78cf392/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN and MARCIA DUNN",
      "description": "TRUTH OR CONSEQUENCES, N.M. (AP) — Virgin Galactic rocketed to the edge of space with its first tourists Thursday, a former British Olympian who bought his ticket 18 years ago and a mother-daughter duo from the Caribbean.",
      "publishedAt": "2023-08-10T11:20:22Z",
      "title": "Virgin Galactic's first space tourists finally soar, an Olympian and a mother-daughter duo",
      "url": "https://apnews.com/4c0904e4f222bd1aa4194c1a43777dd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c29bb4b08454ac2937b406de7c728d3/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}