{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is promising new steps to tackle homelessness and crime in Washington. And that's leading the city’s mayor to voice concerns about the potential use of the National Guard to patrol the streets in the nation’s capital. Trump says in a social media post that he plans a White House news conference at 10 a.m. Monday to discuss his plans to make the District of Columbia, in his words, “safer and more beautiful than it ever was before.” On Thursday, the Republican president directed an increased federal law enforcement presence in the Democratic-run city for seven days, “with the option to extend as needed.” Federal agencies including the FBI assigned more than 120 officers and agents to assist in Washington.",
      "publishedAt": "2025-08-11T04:02:28Z",
      "title": "Trump is promising new steps to tackle crime in Washington",
      "url": "https://apnews.com/article/trump-washington-crime-national-guard-homelessness-655bc22834223c7dc93115bbcb2b215c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266a77/2147483647/strip/true/crop/5153x2899+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F63%2F8baa7c6be3d31be5eca593125cca%2F6e1d0893946249429e055b72185c5b67"
    },
    {
      "author": null,
      "description": "A federal judge in New York has ruled transcripts of secret grand jury testimony in the sex trafficking case against Jeffrey Epstein's former girlfriend Ghislaine Maxwell won’t be released. Judge Paul A. Engelmayer issued his written ruling on Monday. The judge says releasing the transcripts would risk unraveling the foundations of secrecy upon which the grand jury is premised. Maxwell is serving a 20-year prison term after her conviction on sex trafficking charges for helping procure girls for Jeffrey Epstein to sexually abuse. Maxwell recently was interviewed by the Department of Justice and was moved from a prison in Florida to a prison camp in Texas. Maxwell's attorney says she testified truthfully.",
      "publishedAt": "2025-08-11T13:48:21Z",
      "title": "Judge denies request to unseal transcripts from Maxwell grand jury",
      "url": "https://apnews.com/article/justice-department-epstein-maxwell-f6ddbed5bd3fa026d43a0f510fdee22e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2735e1/2147483647/strip/true/crop/2636x1483+0+137/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2Fd4%2Fceff49ab11941146828e8fe737c3%2Fd11c95bc2dde4d4aac131a2abfc5a6dd"
    },
    {
      "author": null,
      "description": "Local health officials in Gaza say that Israeli forces have killed at least 40 people overnight, including a well-known journalist who Israel said was a militant as well as people who witnesses say were seeking humanitarian aid. The Al Jazeera correspondent and others were killed by an Israeli airstrike as they sheltered outside a Gaza City hospital. Al Jazeera has denied Israeli allegations that Anas al-Sharif was a militant. Hospital officials and witnesses say 12 of those killed by Israeli gunfire were trying to reach an aid distribution site. Meanwhile, Australian Prime Minister Anthony Albanese has announced plans to recognize Palestinian statehood, joining France, Britain, and Canada.",
      "publishedAt": "2025-08-11T13:07:23Z",
      "title": "Israeli strikes hit Gaza as Australia backs Palestinian statehood",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-gaza-08-11-2025-14103d37328c4c9edd562fa0b42e28d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/83a89de/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F43%2Ff9e839563c6a4fb4958d4204fdf4%2F115cd7654b6d4216919a86b55eb23007"
    },
    {
      "author": null,
      "description": "An explosion at a U.S. Steel plant near Pittsburgh has left dozens injured or trapped under the rubble, with emergency workers on site trying to rescue them. An Allegheny County spokesperson says there are no confirmed fatalities from Monday morning's explosion at the Clairton Coke Works. The Allegheny County Emergency Services said it has transported five people. The agency did not provide any more details on those people transported and would only say it was an “active scene.” The plant is a massive industrial facility along the Monongahela River south of Pittsburgh, and is considered the largest coking operation in North America.",
      "publishedAt": "2025-08-11T16:03:42Z",
      "title": "Explosion at US Steel plant in Pennsylvania leaves people trapped",
      "url": "https://apnews.com/article/clairton-steel-pittsburgh-explosion-coke-f6f81a1d33f22741668d4d75dbc8eaf7",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f73f6d/2147483647/strip/true/crop/1058x595+0+406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F27%2F0c78202a7923304268c23172dc8e%2F20c54ea567e14d3b8dcf7c4a9bb1e598"
    },
    {
      "author": null,
      "description": "German Chancellor Friedrich Merz has invited U.S. President Donald Trump, Ukrainian President Volodymyr Zelenskyy, the NATO secretary general and several European leaders to a virtual meeting Wednesday ahead of the Trump-Putin summit later this week. The German chancellery says Monday that the talks would focus on “the current situation in Ukraine with a view to the planned meeting between U.S. President Trump and Russian President Putin.” Europeans and Ukrainians so far are not invited to the summit Friday in Alaska.",
      "publishedAt": "2025-08-11T11:55:32Z",
      "title": "Germany invites Trump, Zelenskyy, EU leaders to virtual meeting before Trump-Putin summit",
      "url": "https://apnews.com/article/europe-ukraine-territory-russia-trump-putin-summit-5d2079bd13561edac7752d338ea7b93c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d78af49/2147483647/strip/true/crop/5562x3129+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F46%2Ff8506fa45c40e7c4bb7e3a8110b8%2F985f3aae889e4e71ac659fab12669f90"
    },
    {
      "author": null,
      "description": "The Milwaukee area is drying out after weekend rain hits unofficial state records. Unofficially, more than 14 inches fell in less than 24 hours in one spot, causing rivers to flood, washing out vehicles, and cutting power to thousands. As of Monday morning, no fatalities have been reported. Road closures are more isolated, and flood warnings continued in Milwaukee, Waukesha and Ozaukee counties. About 3,000 homes remain without power. Forecasters predict more rain Monday night, but not like the weekend deluge. The National Weather Service says four rivers in the Milwaukee area hit record-high levels over the weekend.",
      "publishedAt": "2025-08-11T15:57:16Z",
      "title": "Milwaukee area drying out after weekend rain causes record flooding on multiple rivers",
      "url": "https://apnews.com/article/weather-wisconsin-flooding-rain-8a80cc7bb23be849ca4eeb088fa6165d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0eef99c/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2Fba%2F059085c4b39733d34bec24daac0b%2F4294f218f4ac40a99b68096dc25242b7"
    },
    {
      "author": null,
      "description": "A blistering heatwave gripped southwest France on Monday, sending thermometers soaring to 43 degrees Celsius in parts of the Charente and Aude. In Aude, a patchwork of vineyards and Mediterranean scrubland, hundreds of firefighters remained on the hillsides guarding the edges of a massive blaze that scorched 16,000 hectares last week. Officials say the flames are under control, but warn the fire will not be fully extinguished for weeks. The national weather authority, Meteo-France, placed 12 departments on red alert, France’s highest heat warning, anticipating exceptional heat stretching from the Atlantic coast to the Mediterranean plains. Another 41 departments were under lower-level orange alerts, as was the neighboring microstate of Andorra.",
      "publishedAt": "2025-08-11T08:51:11Z",
      "title": "Southwest France swelters as temperatures hit 43 C",
      "url": "https://apnews.com/article/heatwave-france-red-alert-fires-0041a4f17e22eaa205964ed5c01d6c24",
      "urlToImage": "https://dims.apnews.com/dims4/default/20d3e0e/2147483647/strip/true/crop/7556x4250+0+462/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2Fc3%2Fb1639a801b8dcec608a9220438f5%2F034f2448ac4545419b277378ea61d0c9"
    },
    {
      "author": null,
      "description": "A Colombian senator and presidential hopeful has died after being shot at a political rally two months ago. His family confirmed his death on Monday. Miguel Uribe, 39, was shot three times while giving a campaign speech in Bogota and had been in intensive care since the attack. A teenage suspect was arrested at the scene, but it's unclear who ordered the hit. The shooting alarmed Colombians, recalling the political violence of the 1990s. Uribe was a prominent figure in the conservative Democratic Center party. The attack sparked calls for justice and an end to violence.",
      "publishedAt": "2025-08-11T10:51:53Z",
      "title": "Colombian senator Miguel Uribe Turbay has died",
      "url": "https://apnews.com/article/colombia-miguel-uribe-senator-shooting-dead-bogota-6c8f32b5e23bedec5f634dee5e334042",
      "urlToImage": "https://dims.apnews.com/dims4/default/a55cfd6/2147483647/strip/true/crop/6493x3652+0+338/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F1a%2Fad05e8d81fa828611cc167c07d1d%2F22345c7ed5ee497484ef559466ee76aa"
    },
    {
      "author": null,
      "description": "Paramount will become the new home to Ultimate Fighting Championship events across the U.S. next year, through a seven-year agreement announced with TKO Group on Monday. Under the deal, Paramount will exclusively distribute the UFC’s full lineup of its 13 marquee numbered events and 30 “Fight Nights” on its streaming platform Paramount+ — with select numbered events also set to simulcast on CBS — starting in 2026. It’s a shift away from the UFC’s existing pay-per-view model, which Paramount and TKO say will allow the mixed martial arts programming reach more consumers nationwide. UFC events currently air on ESPN — which has offered tiered pricing for fans to view content across the sports network’s TV offerings and streaming platform ESPN+ since 2019.",
      "publishedAt": "2025-08-11T12:49:39Z",
      "title": "Paramount to become home to UFC fights in US",
      "url": "https://apnews.com/article/ufc-tko-paramount-ultimate-fighting-3804114c82e30e0359605b16105ff6bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d34e27/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F67%2F3d2418e0fc3ce0d7570eb595ea76%2F6f7d8d5015f64d74b447a28e73f938fc"
    },
    {
      "author": null,
      "description": "Texas is No. 1 in the Associated Press preseason Top 25 for the first time. The Longhorns narrowly edged out Penn State in the closest preseason vote since 1998. Texas received 25 first-place votes, while Penn State received 23. The Nittany Lions have their highest preseason ranking since they were No. 1 to open 1997. The Southeastern Conference leads with 10 teams in the Top 25. The Big Ten has two of the top three teams for the third straight year. The Big 12 has four ranked teams and the ACC has three.",
      "publishedAt": "2025-08-11T16:03:23Z",
      "title": "Texas No. 1 in preseason AP Top 25 for first time, edging Penn St, Ohio St",
      "url": "https://apnews.com/article/ap-top-25-college-football-f6a624b7dc17c1896a98951214f52039",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3f7fae/2147483647/strip/true/crop/7189x4044+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F7c%2Ffb36df5b76847a29470bf9079f73%2F70a8938f788a42208d759dbfa4fd1503"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}