{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Both major presidential candidates are making appearances Thursday meant to fire up their core supporters, with Vice President Kamala Harris participating in a livestream with Oprah Winfrey and Donald Trump attending an event with prominent Jewish donors before addressing a gathering of the Israeli-American Council.",
      "publishedAt": "2024-09-19T11:12:53Z",
      "title": "Harris plans a livestream with Oprah Winfrey while Trump is set to address an Israeli-American group",
      "url": "https://apnews.com/f9384395f54a0d071ab52bca80d3659e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b685599831884f2a8f39ecf2a78dd006/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and BASSEM MROUE",
      "description": "BEIRUT (AP) — The leader of Hezbollah vowed Thursday to keep up daily strikes on Israel despite this week's deadly sabotage of its members' communication devices, and said Israelis displaced from homes near the Lebanon border because of the fighting would not be able to return until the war in Gaza ends.",
      "publishedAt": "2024-09-19T11:14:00Z",
      "title": "Hezbollah leader vows retaliation against Israel for attacks on devices as both sides trade strikes",
      "url": "https://apnews.com/ab2436cf5bae5e2fe2dddb293671a0ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2875b77254e46ccb312f1be5a4d1cc6/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and MAJDI MOHAMMED",
      "description": "QABATIYA, West Bank (AP) — Israeli soldiers pushed three apparently lifeless bodies from rooftops during a raid in the northern part of the occupied West Bank on Thursday, according to an Associated Press journalist at the scene and video obtained by AP.",
      "publishedAt": "2024-09-19T22:43:48Z",
      "title": "Israeli soldiers pushed three apparently lifeless bodies from roofs during a West Bank raid",
      "url": "https://apnews.com/ae65d70f7da5db4603ba1b7c77f2ccd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2527c90c11fd4e9883c45a0f60bbf8bb/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "MIAMI (AP) — Shohei Ohtani became the first major league player to hit 50 home runs and steal 50 bases in a season, with the Los Angeles Dodgers star going deep twice to reach the half-century mark and swiping two bags to get to 51 against the Miami Marlins on Thursday.",
      "publishedAt": "2024-09-19T21:01:57Z",
      "title": "Shohei Ohtani becomes the first major league player with 50 homers and 50 stolen bases in a season",
      "url": "https://apnews.com/f8141d695112175fc2b695a0e9e748d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/642f3cdbf672430d93efda627c248ae9/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "SPRINGFIELD, Ohio (AP) — In the quiet corners of Springfield, Ohio — out of sight of the drumbeat of politicians and journalists, troopers and newly installed security cameras — the people who live here are taking a breath, praying and attempting to carry on.",
      "publishedAt": "2024-09-19T04:14:58Z",
      "title": "Residents of Springfield, Ohio, hunker down and pray for a political firestorm to blow over",
      "url": "https://apnews.com/7e8b09654c0dd90d72c884dbb798c71b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76ef6de867df4f4fbffa5636dc2d2024/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "Since the #MeToo movement took off, a multitude of male celebrities have been accused of sexual misconduct, but only a handful of those in the music and film industries who have actually faced criminal charges.",
      "publishedAt": "2024-09-19T19:33:14Z",
      "title": "Sean ‘Diddy’ Combs joins list of Hollywood stars charged with sex crimes",
      "url": "https://apnews.com/a2a6259e87b89b9f85baedabf6bb5074",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fbea9edac5847be9bf15e04b568c5da/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — The Justice Department has opened a civil rights investigation into a Mississippi sheriff's department whose officers tortured two Black men in a racist attack that included beatings, repeated use of stun guns and assaults with a sex toy before one of the victims was shot in the mouth, officials said Thursday.",
      "publishedAt": "2024-09-19T20:11:33Z",
      "title": "Justice Department opens civil rights probe of sheriff's office after torture of 2 Black men",
      "url": "https://apnews.com/2554c21a0c7366849d6119b07855f8c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/246ddf1ca2b34562ba8ec0131cfe89ec/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — When the FBI said this week that Iran had tried to provide Democrats with material stolen from Donald Trump’s campaign, it was only the latest allegation of foreign interference with the U.S.",
      "publishedAt": "2024-09-19T18:51:07Z",
      "title": "The FBI says Iran tried to send hacked files to Democrats. It's another sign of foreign meddling",
      "url": "https://apnews.com/3631e1832a8edb549d53126585503f32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/468ae7def6884bb08a4bbf87e7a55021/1993.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and CLAIRE GALOFARO",
      "description": "SEOUL, South Korea (AP) — As the plane descended into Seoul, Robert Calabretta swaddled himself in a blanket, his knees tucked into his chest like a baby in the womb. A single tear ran down his cheek.",
      "publishedAt": "2024-09-19T04:20:20Z",
      "title": "Widespread adoption fraud separated generations of Korean children from their families, AP finds",
      "url": "https://apnews.com/e4e7d4b8823212e3b260517c5128cd66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02f165c4cbf0466c901d285ab4333ce0/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — Scientists searching for the origins of COVID-19 have zeroed in on a short list of animals that possibly helped spread it to people, an effort they hope could allow them to trace the outbreak back to its source.",
      "publishedAt": "2024-09-19T16:47:34Z",
      "title": "A new genetic analysis of animals in the Wuhan market in 2019 may help find COVID-19's origin",
      "url": "https://apnews.com/05d573cfd019a20cb46d675af0c669dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d30c25379bbb4ab0ad15255e79f8c9ea/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}