{
  "articles": [
    {
      "author": null,
      "description": "CABO SAN LUCAS, Mexico (AP) — Hilary downgraded again to Category 1 hurricane as Mexico and California brace for storm's 'catastrophic' impact.",
      "publishedAt": "2023-08-20T03:22:23Z",
      "title": "Hilary downgraded again to Category 1 hurricane as Mexico and California brace for storm's 'catastrophic' impact",
      "url": "https://apnews.com/861d961f68c33d5494d7391ebede84b1",
      "urlToImage": ""
    },
    {
      "author": "IGNACIO MARTINEZ and STEFANIE DAZIO",
      "description": "CABO SAN LUCAS, Mexico (AP) — Hurricane Hilary roared toward Mexico’s Baja California peninsula late Saturday as a downgraded but still dangerous Category 1 hurricane likely to bring “catastrophic” flooding to the region and cross into the southwestern U.S.",
      "publishedAt": "2023-08-19T08:07:19Z",
      "title": "Hilary downgraded again to Category 1 hurricane as Mexico and California brace for storm's impact",
      "url": "https://apnews.com/7fddeb8c6eaf2e6cb8893dfe4db838fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59c5d7cfd102466cb71052aeb127df38/2500.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Hawaii Gov. Josh Green said Friday that what's rebuilt from the ashes of the devastating wildfires on Maui will be determined by the people. “Lahaina will rise again,” Green said during a livestreamed evening address from Honolulu.",
      "publishedAt": "2023-08-19T05:58:23Z",
      "title": "Maui town ravaged by fire will 'rise again,' Hawaii governor says of long recovery ahead",
      "url": "https://apnews.com/875c8a8571555da7cb006c651a807eff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7debbd89764c43c9b3af9973b2edf0ab/1920.jpeg"
    },
    {
      "author": "DAVID SHARP, JIM MORRIS and MARTHA BELLISLE",
      "description": "VANCOUVER, British Columbia (AP) — Firefighters battling wildfires in western Canada received help from reinforcements and milder weather Saturday, after the nation’s worst fire season on record destroyed structures, fouled the air with thick smoke and prompted evacuation orders for tens of thousands of residents.",
      "publishedAt": "2023-08-19T05:23:33Z",
      "title": "Canadian firefighters wage epic battle to save communities after mass evacuations",
      "url": "https://apnews.com/de07fcf732f303252468a40d2e01485d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aa2e97352c4b06a803a7b4be1925d4/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Ecuador is holding a special election Sunday to pick a new president, with police and soldiers on guard against unprecedented violence, including the assassination of a candidate this month.",
      "publishedAt": "2023-08-20T04:07:10Z",
      "title": "Ecuadorians choosing a new president amid increasing violence that may scare away voters",
      "url": "https://apnews.com/0d1b5a7c56c671217a47c1ecb7e826fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aa76f535c044e0eb406045ccbabee39/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "CUMMING, Ga. (AP) — When Allison Strickland urged a suburban Atlanta school board in June to remove four books from school libraries, she was following a path cleared by Georgia’s Republican lawmakers.",
      "publishedAt": "2023-08-20T04:04:19Z",
      "title": "Georgia made it easier for parents to challenge school library books. Almost no one has done so",
      "url": "https://apnews.com/6fdfbe7951c7592d932723a8bc06f7d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/758a94a3262e42bc9a2e37cffedf0458/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — The leader of mutinous soldiers who ousted Niger's democratically elected president said Saturday night that they will return the country to civilian rule within three years. Gen.",
      "publishedAt": "2023-08-19T07:34:53Z",
      "title": "Leader of Niger's junta says it will restore civilian rule within 3 years, but gives no details",
      "url": "https://apnews.com/d704ef6c5add00a37c6ee931d2f7561d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec051eecfe944c2b914829c8077d4d7e/3000.jpeg"
    },
    {
      "author": "EFREM LUKATSKY, KARL RITTER and ELISE MORTON",
      "description": "CHERNIHIV, Ukraine (AP) — A Russian missile attack in the center of a northern Ukrainian city on Saturday killed seven people and wounded over a hundred others, including children, Ukrainian officials said.",
      "publishedAt": "2023-08-19T09:09:53Z",
      "title": "Russian missile attack kills 7 in northern Ukrainian city as Zelenskyy visits NATO candidate Sweden",
      "url": "https://apnews.com/fc376a4b51811fe5d57115fc03b999b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cc2c8565c7546d3a1edd9c67ceb035d/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — The summer of 2023 may be drawing to a close — but the extreme heat is not: More record-shattering temperatures — this time across Texas — are expected Saturday and Sunday as the U.S.",
      "publishedAt": "2023-08-19T17:05:39Z",
      "title": "Record-setting temperatures forecast in Dallas as scorching heat wave continues to bake the US",
      "url": "https://apnews.com/9be6565ab02039f35519089ecaaf7f56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62ca97603bec4eb38e601c3d0015b956/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An American-owned oil tanker long suspected of carrying sanctioned Iranian crude oil began offloading its cargo near Texas late Saturday, tracking data showed, even as Tehran has threatened to target shipping in the Persian Gulf over it.",
      "publishedAt": "2023-08-20T03:40:20Z",
      "title": "Tanker believed to hold sanctioned Iran oil begins to be offloaded near Texas despite Tehran threats",
      "url": "https://apnews.com/3f257407678b844e5c71c39334866bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bb02123dc3f48b4bb15095497128c63/1023.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}