{
  "articles": [
    {
      "author": "HANNA ARHIROVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine fired six American-supplied longer-range missiles at Russia’s Bryansk region, Moscow said Tuesday, in what would be Kyiv's first use of the weapons inside Russia in 1,000 days of war.",
      "publishedAt": "2024-11-19T11:42:44Z",
      "title": "Moscow says Ukraine fired 6 US-made longer-range missiles into Russia",
      "url": "https://apnews.com/06002c8c50bfb2fc622f446a8580bc0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45f66b347ef14e9ea84ebe0fc11cfff2/1920.jpeg"
    },
    {
      "author": "LORI HINNANT, ILLIA NOVIKOV and DMYTRO ZHYHINAS",
      "description": "KYIV, Ukraine (AP) — The clock on her wall stopped almost as soon as the day began, its hands frozen by the Russian bomb that hit the dormitory serving as home for Ukrainians displaced by war.",
      "publishedAt": "2024-11-19T05:09:58Z",
      "title": "1,000 days of war in Ukraine, distilled in a single 24-hour span of violence and resilience",
      "url": "https://apnews.com/ade5a60cf2345d694871f85df162d08a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04b349d268694efba647f173b2f2ffcb/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB, WAFAA SHURAFA and FATMA KHALED",
      "description": "BEIRUT (AP) — A United States envoy said an agreement to end the Israel-Hezbollah war is “within our grasp” after talks in Lebanon on Tuesday. However, there was no such optimism in the Gaza Strip, where the looting of nearly 100 aid trucks by armed men worsened an already severe food crisis.",
      "publishedAt": "2024-11-19T09:34:36Z",
      "title": "US envoy says Israel-Hezbollah truce is 'within our grasp' as Gaza food crisis worsens after looting",
      "url": "https://apnews.com/a76670f9373598edd964139280eba60c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d71d79a71ada4b1e98b078a285a1bac1/1920.jpeg"
    },
    {
      "author": "KANIS LEUNG and ZEN SOO",
      "description": "HONG KONG (AP) — Forty-five ex-lawmakers and activists were sentenced to four to 10 years in prison Tuesday in Hong Kong’s biggest national security case under a Beijing-imposed law that crushed a once-thriving pro-democracy movement.",
      "publishedAt": "2024-11-19T01:23:49Z",
      "title": "45 pro-democracy activists get 4 to 10 years in prison in Hong Kong's biggest national security case",
      "url": "https://apnews.com/1ed13be76fa4918d83f7d3e498f2f543",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52f25bfbc06e467d9bfbee9ddad32f69/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Donald Trump's first stint in the White House proved to be a chaotic ride for the District of Columbia. Now with Trump set to return to power — backed by a Republican-controlled Congress and the momentum of a sweeping electoral win — local officials in the nation's capital are trying to sound conciliatory while preparing for the worst.",
      "publishedAt": "2024-11-19T05:11:33Z",
      "title": "Local Washington officials brace for four years of playing defense against Trump",
      "url": "https://apnews.com/6c6a8a9a61ecfd596f862769344c2f3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bbbe9e9fa3d4b9e9b119ddb767a400e/3000.jpeg"
    },
    {
      "author": "TARA COPP, KEVIN VINEYS and AARON KESSLER",
      "description": "CANNON AIR FORCE BASE, N.M. (AP) — Over a New Mexico training range named the Hornet, two Osprey aircraft speed 100 feet off the ground, banking hard over valleys and hills as they close in on a dusty landing zone.",
      "publishedAt": "2024-11-19T05:04:12Z",
      "title": "The Osprey's safety issues spiked over five years and caused deaths. Pilots still want to fly it",
      "url": "https://apnews.com/376bfa13622fb1caafea576164a1f761",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aefcb514da6464f9463553e6bc2a0a2/1920.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Iran has defied international demands to rein in its nuclear program and has increased its stockpile of uranium enriched to near weapons-grade levels, according to a confidential report by the United Nations’ nuclear watchdog seen Tuesday by The Associated Press.",
      "publishedAt": "2024-11-19T15:32:08Z",
      "title": "Iran defies international pressure, increasing its stockpile of near weapons-grade uranium, UN says",
      "url": "https://apnews.com/0525819542521d5f89bd09008f42cb2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e03dab7e745a424b8e85722fd51b26ae/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATHENS, Ga. (AP) — Georgia nursing student Laken Riley texted and called her mom as she headed out for a run to see whether she had time to chat — but then didn't respond to her mother's calls or increasingly frantic text messages.",
      "publishedAt": "2024-11-19T13:53:55Z",
      "title": "Prosecution is expected to rest in trial over death of Georgia nursing student Laken Riley",
      "url": "https://apnews.com/5aada3555874defc3f796c67fd9ce960",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd3050a82686430190ca4c8fe6c0a54e/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN and CHRISTOPHER WEBER",
      "description": "SEATTLE (AP) — Northern California and the Pacific Northwest are bracing for what is expected to be a powerful storm, with heavy rain and winds set to pummel the region and potentially cause power outages and flash floods.",
      "publishedAt": "2024-11-19T05:22:56Z",
      "title": "'Bomb cyclone' threatens Northern California and Pacific Northwest",
      "url": "https://apnews.com/d5006d946cda1fc1f4ecb8fe5b94ba59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f48f956ec04f4b999534656e19a3c1b3/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "HENNIKER, N.H. (AP) — When Hector Xu was learning to fly a helicopter in college, he recalled having a few “nasty experiences” while trying to navigate at night.The heart-stopping flights led to his research of unmanned aircraft systems while getting his doctorate degree in aerospace engineering at Massachusetts Institute of Technology.",
      "publishedAt": "2024-11-19T05:10:57Z",
      "title": "Forget driverless cars. One company wants autonomous helicopters to spray crops and fight fires",
      "url": "https://apnews.com/9af9228206bf9fd3598d10c8a243fab5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d0a3e6d74b845a7afea5a1e780f9bb7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}