{
  "articles": [
    {
      "author": "SAMY MAGDY, NAJIB JOBAIN and JOSEF FEDERMAN",
      "description": "CAIRO (AP) — Israel and Hamas on Monday gave cool public receptions to an Egyptian proposal to end their bitter war. But the longstanding enemies stopped short of rejecting the plan altogether, raising the possibility of a new round of diplomacy to halt a devastating Israeli offensive in the Gaza Strip.",
      "publishedAt": "2023-12-25T10:52:17Z",
      "title": "Egypt floats plan to end Israel-Hamas war. The proposal gets a cool reception",
      "url": "https://apnews.com/151faf920facb9910a254c2987e00d5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65289ff8344441ec9d8c8d7fc207ab34/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis on Monday blasted the weapons industry and its “instruments of death” that fuel wars as he made a Christmas Day appeal for peace in the world and in particular between Israel and the Palestinians.",
      "publishedAt": "2023-12-25T11:40:50Z",
      "title": "Pope Francis denounces the weapons industry as he makes a Christmas appeal for peace in the world",
      "url": "https://apnews.com/cb9af73aa193d8ffe413aa767be41234",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00d0e01fbb154a83b3f52757ce5b64f4/2694.jpeg"
    },
    {
      "author": "VOLODYMYR YURCHUK",
      "description": "KRYVORIVNIA, Ukraine (AP) — Christmas carried more than spiritual weight for many Ukrainians this year as the country newly observed it as a public holiday on Dec. 25 rather than the later date followed in Russia.",
      "publishedAt": "2023-12-25T18:27:48Z",
      "title": "Ukraine celebrates Christmas on Dec. 25 for the first time, distancing itself from Russia",
      "url": "https://apnews.com/156090c4c2c832dd0d7a58613e8d2877",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0df74a9e69e04765b54412a97889b0ab/3000.jpeg"
    },
    {
      "author": "ALEX BABENKO",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy on Monday hailed the shooting down of two Russian fighter jets on Christmas Eve and said “this Christmas sets the right mood for the entire year ahead.”",
      "publishedAt": "2023-12-25T11:58:53Z",
      "title": "Ukraine says it shot down Russian fighter jets and drones as the country officially marks Christmas",
      "url": "https://apnews.com/48ea3c04c7f907b5da098f3ce6cd643f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/343411b6c3bb4c1a83925f6f5fdbe0fc/3000.jpeg"
    },
    {
      "author": null,
      "description": "Conditions were mostly nice this year for travelers flying ahead of and on Christmas, but some naughty disruptions again plagued those flying with Southwest Airlines.For millions of people traveling over the holiday, this year was much better than last.",
      "publishedAt": "2023-12-25T19:40:12Z",
      "title": "Holiday travel is mostly nice, but with some naughty disruptions again on Southwest Airlines",
      "url": "https://apnews.com/527dcf19d1d6389eb3e067acda6221de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4c2ef07fbe24c7d86a19730b3974db3/3000.jpeg"
    },
    {
      "author": "EDGAR H. CLEMENTE",
      "description": "HUIXTLA, Mexico (AP) — Christmas Day meant the same as any other day for thousands of migrants walking through southern Mexico: more trudging under a hot sun.",
      "publishedAt": "2023-12-25T20:27:53Z",
      "title": "Migrant caravan in southern Mexico marks Christmas Day by trudging onward",
      "url": "https://apnews.com/7f5d9b8f93f3b22fecf3f0285acd6a82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9212207395ab4968978efbd83e9807b3/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — An Israeli airstrike Monday in a Damascus neighborhood killed a high-ranking Iranian general, Iranian state media said.Iranian officials and allied militant groups in the region vowed revenge for the killing but did not immediately launch any retaliatory strike.",
      "publishedAt": "2023-12-25T16:44:34Z",
      "title": "An Israeli airstrike in Syria kills a high-ranking Iranian general",
      "url": "https://apnews.com/7ee8496d727ba69834002f0444515a36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44ef257310ef40338b0e68c6390a0b18/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Gift cards make great stocking stuffers — just as long as you don't stuff them in a drawer and forget about them after the holidays.Americans are expected to spend nearly $30 billion on gift cards this holiday season, according to the National Retail Federation.",
      "publishedAt": "2023-12-25T10:27:31Z",
      "title": "The secret life of gift cards: Here's what happens to the billions that go unspent each year",
      "url": "https://apnews.com/e9592f6b4067601a27d0f0199da898c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e02586699e14e16b569b4d8c4850bea/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "We lost Twitter and got X. We tried out Bluesky and Mastodon (well, some of us did). We fretted about AI bots and teen mental health. We cocooned in private chats and scrolled endlessly as we did in years past.",
      "publishedAt": "2023-12-24T17:00:40Z",
      "title": "The year of social media soul-searching: Twitter dies, X and Threads are born and AI gets personal",
      "url": "https://apnews.com/98e4905027104347c7fd20fdff1641c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51235802a8ab4dbf9155a5d10e2e7b32/3000.jpeg"
    },
    {
      "author": null,
      "description": "KANSAS CITY, Mo. (AP) — Pop superstar Taylor Swift walked into Arrowhead Stadium alongside Santa Claus on Monday to watch her boyfriend and Kansas City Chiefs tight end Travis Kelce as they played the Las Vegas Raiders in a Christmas Day showdown.",
      "publishedAt": "2023-12-25T17:59:21Z",
      "title": "Taylor Swift celebrates Christmas Day by watching Travis Kelce and Chiefs play Las Vegas",
      "url": "https://apnews.com/dd7033682409457a12338edc432b2c04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d659b78be32848c8926faf310988e340/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}