{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel pounded the Gaza Strip with airstrikes on Thursday, including in the south where Palestinians were told to take refuge, and the country's defense minister told ground troops to “be ready” to invade, though he didn’t say when.",
      "publishedAt": "2023-10-19T07:59:07Z",
      "title": "Gaza awaits humanitarian aid, as Israel tells troops to ‘be ready’ for ground invasion",
      "url": "https://apnews.com/b084e9c453cc99f7bec6f66d7b5913d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b980f5b18674648bad77ffedcfd7ee8/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — A limited number of journalists in Gaza are trying to report on the war with Israel while facing the same problems as the besieged Palestinian population there — wondering where to live, where to get food and water, and how to stay safe.",
      "publishedAt": "2023-10-19T17:04:14Z",
      "title": "Journalists in Gaza wrestle with issues of survival in addition to getting stories out",
      "url": "https://apnews.com/259bcff10356a8a48d5b7640e8a16274",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b5c5eef38294a13bde7704dde6c2627/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Refusing to drop out, Republican Rep. Jim Jordan told GOP colleagues Thursday he would back a temporary U.S.",
      "publishedAt": "2023-10-19T04:07:42Z",
      "title": "GOP's Jordan backs a temporary House speaker plan and calls off 3rd vote for now, lawmakers say",
      "url": "https://apnews.com/abdef873a8d14979848b658e4ef46fd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4744a35ee6d43b9a418e1c6c91f2d5c/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Lawyer Sidney Powell pleaded guilty to reduced charges Thursday over efforts to overturn Donald Trump’s loss in the 2020 election in Georgia, becoming the second defendant in the sprawling case to reach a deal with prosecutors.",
      "publishedAt": "2023-10-19T14:06:14Z",
      "title": "Sidney Powell pleads guilty over efforts to overturn Trump's loss in Georgia and agrees to cooperate",
      "url": "https://apnews.com/ec7dc601ad78d756643aa2544028e9f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c09dd91602ec4626ba6256f84901ebd1/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — Federal regulators on Thursday approved the expansion of a natural gas pipeline in the Pacific Northwest over the protest of environmental groups and top officials in West Coast states, who said it goes against the region’s plans to address climate change and could pose a wildfire risk.",
      "publishedAt": "2023-10-19T16:34:43Z",
      "title": "Feds OK natural gas pipeline expansion in Pacific Northwest over environmentalist protests",
      "url": "https://apnews.com/5e9c79c412b407ddc9bcb21c1ff8ee26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39f0410916db4ae398be262f37004807/3000.jpeg"
    },
    {
      "author": null,
      "description": "BIRMINGHAM, Ala. (AP) — Beth Holloway was after one thing for 18 years: answers about what happened to her missing daughter.She got them Wednesday when Joran van der Sloot, long considered the chief suspect in her daughter’s 2005 disappearance in Aruba, admitted in submitted court filings to bludgeoning Natalee Holloway to death on a beach and dragging her body out to sea.",
      "publishedAt": "2023-10-19T05:12:36Z",
      "title": "Joran van der Sloot's confession in Natalee Holloway case provides long-sought answers, mother says",
      "url": "https://apnews.com/eab59b1e91aad341cc3a77949cfe80df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0546ace785d44e33a57deb1e57142000/1920.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — The number of former Californians who became Texans dropped slightly last year, but some of that slack was picked up by Arizona and Florida, which saw their tallies of ex-Californians grow, according to new state-to-state migration figures released Thursday.",
      "publishedAt": "2023-10-19T16:58:18Z",
      "title": "Fewer Californians are moving to Texas, but more are going to Florida and Arizona",
      "url": "https://apnews.com/8f94b2137b8b45e9c7123545a7f62db2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e02697412504774bb1850496f5dc0ef/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — With the growing popularity of disposable e-cigarettes, communities across the U.S.",
      "publishedAt": "2023-10-19T11:57:55Z",
      "title": "Communities can't recycle or trash disposable e-cigarettes. So what happens to them?",
      "url": "https://apnews.com/3d19dce9693ce78dd244729f524df02a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d96906728cbb46e481672c11a7c8de51/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve Chair Jerome Powell said Thursday that inflation remains too high and that bringing it down to the Fed's target level will likely require a slower-growing economy and job market.",
      "publishedAt": "2023-10-19T16:01:56Z",
      "title": "Fed Chair Powell: Slower economic growth may be needed to conquer stubbornly high inflation",
      "url": "https://apnews.com/e64132f742d9141c28d0d79794e274b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89e56871fa4846fbb49769bacaae542e/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — While screenwriters are busy back at work, film and TV actors remain on picket lines, with the longest strike in their history set to hit 100 days on Saturday after talks broke off with studios.",
      "publishedAt": "2023-10-19T13:40:37Z",
      "title": "Hollywood's actors strike is nearing its 100th day. Why hasn't a deal been reached and what's next?",
      "url": "https://apnews.com/40e0e325f7c92b6853bdc01c4c54b08c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/564524f78b25446f93d3f0b8c5f2cb53/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}