{
  "articles": [
    {
      "author": "WILL WEISSERT and DAN GELSTON",
      "description": "NEW YORK (AP) — President-elect Donald Trump walked out to a roaring standing ovation just ahead of the start of the UFC pay-per-view card at Madison Square Garden on Saturday night, combining two things close to his heart: fierce battles inside the octagon and New York City.",
      "publishedAt": "2024-11-16T18:23:17Z",
      "title": "Trump attends UFC championship fight in New York, taking a break from Cabinet picks",
      "url": "https://apnews.com/8d5bfbccd32c1115cf2f6b54b8c58a0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/812cc909db894661803d7ecd86747040/2798.jpeg"
    },
    {
      "author": "MIKE CATALINI, PHILIP MARCELO AND AUDREY McAVOY",
      "description": "TOTOWA, N.J. (AP) — Patrons at Murph's Tavern are toasting not just Donald Trump's return to the presidency but the fact that he carried their northern New Jersey county, a longtime Democratic stronghold in the shadow of New York City.",
      "publishedAt": "2024-11-16T13:37:50Z",
      "title": "From New Jersey to Hawaii, Trump made inroads in surprising places in his path to the White House",
      "url": "https://apnews.com/346dbbd11111f9558b69ed137321c630",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e5a9f569edd442697801511cbe67b12/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump's choice of Matt Gaetz to be attorney general has many Justice Department employees reeling, worried not only about their own jobs but the future of the agency that the Trump loyalist has railed against.",
      "publishedAt": "2024-11-16T13:15:23Z",
      "title": "Anxiety and dismay inside the Justice Department after Trump taps Gaetz as attorney general",
      "url": "https://apnews.com/852d3096a6f154fcdb23581948f906e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e30aaf5ce11f4f69a6e21939d79212bf/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS, HANNA ARHIROVA and LORI HINNANT",
      "description": "KYIV, Ukraine (AP) — At a secretive factory in Russia's central grasslands, engineers are manufacturing hundreds of decoy drones meant to overwhelm Ukrainian defenses as they try to protect against a horrific new weapon, an Associated Press investigation has found.",
      "publishedAt": "2024-11-16T05:06:21Z",
      "title": "Operation False Target: How Russia plotted to mix a deadly new weapon among decoy drones in Ukraine",
      "url": "https://apnews.com/2f904b04fcc5de17549415a974f5a92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76742f121c4d4081a87b504b1a48afc7/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — Over the past two weeks, the political landscape around the negotiations for a cease-fire in Gaza have undergone a dramatic transformation.",
      "publishedAt": "2024-11-16T05:45:40Z",
      "title": "The family of Israeli-American hostage pleads with Biden and Trump to bring hostages home",
      "url": "https://apnews.com/7e3cd6a6f0b9cd70cced92225a31e66c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261f2360482441f08c39757ea7a927a1/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Israeli ground forces reached their deepest point in Lebanon since they invaded six weeks ago before pulling back Saturday after battles with Hezbollah militants, Lebanese state media reported.",
      "publishedAt": "2024-11-16T12:06:32Z",
      "title": "Israeli troops reach deepest point in Lebanon since Oct. 1 invasion, Lebanese media say",
      "url": "https://apnews.com/41d19e05cebf73a66dc320ccad047d4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b690abc9d7f4bd4bf0409c5215fb0a0/1920.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — A powerful typhoon wrecked houses, caused towering tidal surges and forced hundreds of thousands of people to flee to emergency shelters as it cut across the northern Philippines on Sunday in the sixth major storm to hit the country in less than a month.",
      "publishedAt": "2024-11-17T04:00:27Z",
      "title": "Latest typhoon batters the Philippines, causing tidal surges and displacing about 400,000 people",
      "url": "https://apnews.com/520b17b3c2b0ccfd33c7421f65ba177d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/990344dae34e4c7baa46f195e83d1dcb/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and RYAN J. FOLEY",
      "description": "MINNEAPOLIS (AP) — On the last night of their lives, Jagdish Patel, his wife and their two young children tried to slip into the U.S. across a near-empty stretch of the Canadian border. Wind chills reached minus 36 Fahrenheit (minus 38 Celsius) that night in January 2022 as the family from India set out on foot to meet a waiting van.",
      "publishedAt": "2024-11-16T05:05:15Z",
      "title": "An Indian family froze to death crossing the Canada-US border, a perilous trip becoming more common",
      "url": "https://apnews.com/16946bb01a1d1ca2978f29e902e550fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adbe804cbf7349c38b9f3cba829deca0/1920.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "“Inside the NBA” will appear on ESPN and ABC beginning next season as part of a settlement between Warner Bros. Discovery and the NBA.Warner Bros. Discovery, the parent company of TNT Sports, sued the NBA in New York state court after the league did not accept the company’s matching offer for one of the packages in its new 11-year media rights deal, which will begin with the 2025-26 season.",
      "publishedAt": "2024-11-17T04:32:42Z",
      "title": "'Inside the NBA' will air on ESPN and ABC as part of settlement between WBD and NBA, AP sources say",
      "url": "https://apnews.com/6ac764c1827dc9ac3627469107263b66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75432fec4d94167bc7bf80096b65dc0/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — New York City politicians are calling on Whoopi Goldberg to apologize for suggesting on air that a local bakery had declined to make “The View” co-host a batch of desserts for her birthday because of her political beliefs.",
      "publishedAt": "2024-11-16T18:40:10Z",
      "title": "NYC politicians call on Whoopi Goldberg to apologize for saying bakery denied order over politics",
      "url": "https://apnews.com/45b9f1ab9da1783eb436c3db161da19d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9708340bfb24ae684f8db71d967570b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}