{
  "articles": [
    {
      "author": "SAM MEDNICK and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — A Hamas delegation was in Cairo on Saturday as Egyptian state media reported “noticeable progress” in cease-fire talks for Gaza.",
      "publishedAt": "2024-05-04T11:15:59Z",
      "title": "There's progress reported in Gaza truce talks, but Israel downplays chances of ending war with Hamas",
      "url": "https://apnews.com/4eae8b7a75440d4dd9a201219d60bcd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2c9169235c944e4896a869b5ba1fc33/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO and DENISE LAVOIE",
      "description": "Twenty-five people were arrested Saturday for trespassing at the University of Virginia after police clashed with pro-Palestinian protesters who refused to remove tents from campus, and demonstrators at the University of Michigan chanted anti-war messages and waved flags during commencement ceremonies.",
      "publishedAt": "2024-05-04T17:46:27Z",
      "title": "25 arrested at University of Virginia after police clash with pro-Palestinian protesters",
      "url": "https://apnews.com/ad9deb304a49edbb52f5ae607f08cecd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2690f1192616409c87017060ac651105/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — They’re hallmarks of American history: protests, rallies, sit-ins, marches, disruptions. They date from the early days of what would become the United States to the sights and sounds echoing across the landscapes of the nation’s colleges and universities during this activist spring.",
      "publishedAt": "2024-05-05T04:59:28Z",
      "title": "The American paradox of protest: Celebrated and condemned, welcomed and muzzled",
      "url": "https://apnews.com/22b1325188e0808db7389c8c3f04c331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c9a64480efc4e58b3a5c9263de69404/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "Just a few months short of a quarter-century as Russia's leader, Vladimir Putin on Tuesday will put his hand on a copy of the constitution and begin another six-year term as president wielding extraordinary power.",
      "publishedAt": "2024-05-05T04:52:29Z",
      "title": "As Putin begins another 6-year term, he is entering a new era of extraordinary power in Russia",
      "url": "https://apnews.com/cdb0f25dd8a5f2b53b9ea8d106d4b035",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5b9ac1c4d374ab98d2ffec85c5771e7/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — High waters flooded neighborhoods around Houston on Saturday following heavy rains that resulted in crews rescuing more than 400 people from homes, rooftops and roads engulfed in murky water.",
      "publishedAt": "2024-05-05T04:20:07Z",
      "title": "Hundreds rescued from Texas floods as forecast calls for more rain and rising water",
      "url": "https://apnews.com/793f0bcb98c9ec87da0727517e7f1787",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ac42d1aa354cefabf39501b0c73d7e/1920.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — Millions of voters in England cast ballots Thursday in an array of local elections, the last big test before a looming U.K. general election that all indicators suggest will see the Labour Party return to power after 14 years in the wilderness.",
      "publishedAt": "2024-05-05T04:29:53Z",
      "title": "What we learned from local votes ahead of looming UK general election",
      "url": "https://apnews.com/73955a42370ed8f68d0ac318178b6080",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/247c74690f5d4dd4ad13d1b1ed895559/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — It was a frigid winter morning when authorities found a Native American man dead on a remote gravel road in western New Mexico.",
      "publishedAt": "2024-05-05T04:37:24Z",
      "title": "As US spotlights those missing or dead in Native communities, prosecutors work to solve their cases",
      "url": "https://apnews.com/fb7f8145149850aa5ae14c44c9692667",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/203d4b5e94004a79be0eb2ca1f3d6785/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — A 16-year-old boy armed with a knife was shot dead by police after he stabbed a man in the Australian west coast city of Perth, officials said Sunday.The incident occurred in the parking lot of a hardware store in suburban Willetton on Saturday night.",
      "publishedAt": "2024-05-05T02:59:22Z",
      "title": "Australian police shoot dead a boy, 16, armed with a knife after he stabbed a man in Perth",
      "url": "https://apnews.com/b64913fe611ec9bda833d56d38107a2d",
      "urlToImage": ""
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — King Charles III’s decision to be open about his cancer diagnosis has helped the new monarch connect with the people of Britain and strengthened the monarchy in the year since his dazzling coronation at Westminster Abbey.",
      "publishedAt": "2024-05-05T04:27:30Z",
      "title": "King Charles III’s openness about cancer has helped him connect with people in year after coronation",
      "url": "https://apnews.com/54f27cc73f383bd7b69e93ceddd9d538",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c229db17e534a8f89fe63833b59ff20/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOUISVILLE, Ky. (AP) — The 150th Kentucky Derby produced one of the most dramatic finishes in its storied history — three noses at the wire.",
      "publishedAt": "2024-05-04T10:11:11Z",
      "title": "Mystik Dan wins 150th Kentucky Derby by a nose in the closest 3-horse photo finish since 1947",
      "url": "https://apnews.com/7a75a2184aa4433bafd1397340b61d99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02fcfc14d01f47448909563becbeab58/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}