{
  "articles": [
    {
      "author": null,
      "description": "NEDW YORK (AP) — Senate Majority Leader Chuck Schumer calls for Sen. Bob Menendez to resign after conviction on bribery charges.",
      "publishedAt": "2024-07-16T17:22:35Z",
      "title": "Senate Majority Leader Chuck Schumer calls for Sen. Bob Menendez to resign after conviction on bribery charges",
      "url": "https://apnews.com/d136bc759daf85f0e6bb4ad2696d12f9",
      "urlToImage": ""
    },
    {
      "author": "ALI SWENSON, CHRISTINE FERNANDO and BILL BARROW",
      "description": "MILWAUKEE (AP) — Immigration takes center stage as the Republican National Convention resumes Tuesday, with speakers spotlighting a key element of former President Donald Trump ’s political brand that helped endear him to the GOP base when he began his first campaign in 2015.",
      "publishedAt": "2024-07-16T04:04:51Z",
      "title": "Republican convention focuses on immigration a day after a bandaged Trump makes triumphant entrance",
      "url": "https://apnews.com/d832fedbbd0df0a4fa68f941474c0209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/684aac309f8b4ef89ba2829fb9ceef3d/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and PHILIP MARCELO",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez was convicted on Tuesday of all the counts he faced at his corruption trial, including accepting bribes of gold and cash from three New Jersey businessmen and acting as a foreign agent for the Egyptian government.",
      "publishedAt": "2024-07-16T05:10:28Z",
      "title": "Sen. Bob Menendez convicted of all charges, including accepting bribes paid in cash, gold and a car",
      "url": "https://apnews.com/bab89b99a77fc6ce95531c88ab26cc4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/816fb3335649459e951c505a3940a5e9/1920.jpeg"
    },
    {
      "author": "MELISSA PEREZ WINDER, ED WHITE and JIM SALTER",
      "description": "CHICAGO (AP) — Hundreds of people in a southern Illinois town were ordered to evacuate Tuesday as water rolled over the top of a dam, just one perilous result of severe weather that raged through Midwest overnight with relentless rain and tornadoes and hit the Chicago area especially hard.",
      "publishedAt": "2024-07-16T00:30:51Z",
      "title": "A dam fails after rain, wind, tornadoes pound the Midwest. The Chicago area is cleaning up",
      "url": "https://apnews.com/949aa0d324988c7920e2c16b2f7a2f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb4cd57a4a0e413fb0051fefc42050a8/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "LAS VEGAS (AP) — President Joe Biden returns to the campaign trail Tuesday for the first time since the attempted assassination of his Republican rival, former President Donald Trump, aiming to sharpen the choice voters will face this November in the wake of the attack.",
      "publishedAt": "2024-07-16T09:03:10Z",
      "title": "Biden is trying to sharpen the choice voters face in November as Republicans meet in Milwaukee",
      "url": "https://apnews.com/3f9386fae612adbb7630bad3c62b683d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/458a864615854a5da3b84be48e7a00df/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and FARNOUSH AMIRI",
      "description": "MILWAUKEE (AP) — JD Vance is supposed to help Donald Trump win the Midwest this fall.",
      "publishedAt": "2024-07-16T04:12:45Z",
      "title": "JD Vance is a relative political unknown. He's been asked to help Donald Trump avenge his 2020 loss",
      "url": "https://apnews.com/5b698796a382d313155476b1ee3b7e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c76e9ceb32554f04a349372d62a309be/2526.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The Israeli military on Tuesday said it would begin sending draft notices to Jewish ultra-Orthodox men next week — a step that could destabilize Prime Minister Benjamin Netanyahu's government and trigger more large protests in the community.",
      "publishedAt": "2024-07-16T14:40:02Z",
      "title": "Israeli military says it will begin drafting ultra-Orthodox men. That could rattle the government",
      "url": "https://apnews.com/c35b3a025da8cdd9b61f1c748a209419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cbe1d06bc8f4e2a9717f555c65719de/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — Police in Thailand say the bodies of six people were found Tuesday in a luxury hotel in downtown Bangkok and poisoning is a possibility.Investigators said the bodies were foaming at the mouth, an officer from the Lumpini police station said on condition of anonymity because he wasn’t authorized to release information.",
      "publishedAt": "2024-07-16T14:13:35Z",
      "title": "Six people are found dead in a hotel in downtown Bangkok, with poisoning a possibility",
      "url": "https://apnews.com/fef64b28304c8dcb201bd40c8dd09862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/102117795d694bcdaf60bc88f65e4030/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS and HALELUYA HADERO",
      "description": "NEW YORK (AP) — Amazon Prime Day is here, and experts are reminding consumers to be wary of scams.",
      "publishedAt": "2024-07-16T04:08:48Z",
      "title": "Amazon Prime Day is a big event for scammers, experts warn",
      "url": "https://apnews.com/0059befef607ea6649b119e4ed7c6eae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c0bbc0b32784eb78c79091164eb1eb2/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — For decades, Robert Lecker has read, taught and written about Alice Munro, the Nobel laureate from Canada renowned for her short stories. A professor of English at McGill University in Montreal, and author of numerous critical studies of Canadian fiction, he has thought of Munro as the “jewel” in the crown of her country's literature and source of some of the richest material for classroom discussion.",
      "publishedAt": "2024-07-16T14:28:52Z",
      "title": "Educators wonder how to teach the writings of Alice Munro in wake of daughter's revelations",
      "url": "https://apnews.com/2711d37fb6bf2e82dbdeba89d3c44548",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d276a4d6170a42f08978a1e4f0d946d1/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}