{
  "articles": [
    {
      "author": "VLADIMIR ISACHENKOV, ERIC TUCKER, ZEKE MILLER",
      "description": "President Donald Trump says he and Russian President Vladimir Putin have agreed to begin “negotiations” on ending the Ukraine war. The Republican said in a social media post Wednesday disclosing a call between the two leaders that they would “work together, very closely.” The call followed a prisoner swap that resulted in Russia releasing American schoolteacher Marc Fogel, of Pennsylvania, after more than three years of detention. Two U.S. officials say convicted Russian criminal Alexander Vinnik is being freed as part of the swap that saw Moscow’s release of Fogel. The officials spoke Wednesday on the condition of anonymity to discuss the swap.",
      "publishedAt": "2025-02-12T10:45:50Z",
      "title": "Trump says he and Russian leader Putin have agreed to begin ‘negotiations’ on ending Ukraine war",
      "url": "https://apnews.com/article/russia-us-marc-fogel-prisoner-swap-98418693957b1fa0189ee8ac4e8b4f2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/982db5e/2147483647/strip/true/crop/4710x2649+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F79%2F5e8265a896e6a2953ac5da7edcc1%2F095f262d10d749b084576fc686f6635e"
    },
    {
      "author": "LORNE COOK, TARA COPP",
      "description": "U.S. Defense Secretary Pete Hegseth says NATO membership for Ukraine is unrealistic. In sweeping remarks Wednesday, Hegseth suggested that the way forward for Ukraine is for the country to abandon hopes of a return to its pre-2014 borders and prepare for a negotiated settlement with Russia — one that should be backed up with an international force of troops. Hegseth made the comments during the first trip to NATO and the Ukraine Defense Contact Group by a member of the new Trump administration. Allies have been waiting to hear how much continued military and financial support Washington intends to provide to Ukraine’s government.",
      "publishedAt": "2025-02-12T11:27:10Z",
      "title": "US defense chief Hegseth calls NATO membership for Ukraine unrealistic",
      "url": "https://apnews.com/article/nato-ukraine-us-hegseth-trump-russia-a3ca747b102cae6737436596444a32d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/be830f8/2147483647/strip/true/crop/4440x2498+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F75%2Fc48623817adf3e131cfb0146a24a%2F2093a683b188458eb2730c1c129154a7"
    },
    {
      "author": "JOHN SEEWER",
      "description": "President Donald Trump’s announcement that he and Russian President Vladimir Putin had agreed to begin negotiations on ending the war in Ukraine followed a prisoner swap between the two nations. The exchange involves an American teacher who spent more than three years in detention in Russia. Marc Fogel is a teacher from just outside Pittsburgh. He was traveling to Russia to work at a school in 2021 when he was detained. His family and supporters said he had been traveling with medically prescribed marijuana. Almost a year later, he was sentenced to 14 years in prison.",
      "publishedAt": "2025-02-12T20:03:36Z",
      "title": "Things to know about Russia's release of American Marc Fogel and the impact on ending Ukraine war",
      "url": "https://apnews.com/article/russia-us-marc-fogel-prisoner-swap-84cc760992e35e9e22fffca5618cdef4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5065075/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2F27%2F40f45881f0a171fa2304fd637102%2F557ecea6c2a74ab1b94f8b61d8333b9a"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "The Senate has confirmed Tulsi Gabbard as President Donald Trump’s director of national intelligence. The vote Wednesday came after Republicans who had initially questioned her experience and judgment fell in line behind her nomination. Gabbard was an unconventional pick to oversee and coordinate the country’s 18 different intelligence agencies. She had made past comments sympathetic to Russia, she once met with now-deposed Syrian President Bashar Assad and had expressed previous support for government leaker Edward Snowden. Gabbard is a military veteran and a former Democratic congresswoman from Hawaii. She has no formal intelligence experience and has never run a government agency or department.",
      "publishedAt": "2025-02-12T15:05:07Z",
      "title": "Senate confirms Gabbard as Trump's director of national intelligence",
      "url": "https://apnews.com/article/tulsi-gabbard-trump-senate-national-intelligence-director-a1045b3f6bf91e491892e347b42cdc90",
      "urlToImage": "https://dims.apnews.com/dims4/default/47e5fc0/2147483647/strip/true/crop/7441x4186+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F37%2F758f3a9dde28883c7d3a2870ddc4%2Fbcc41f93d07c461a9c703542e15498e4"
    },
    {
      "author": "The Associated Press",
      "description": "Defense Secretary Pete Hegseth has announced a major shift in U.S. policy on Ukraine, abandoning the country's pre-2014 borders. Also, inflation has worsened as President Donald Trump continues to ramp up tariffs, and Trump will host India's Prime Minister Narendra Modi on Wednesday.",
      "publishedAt": "2025-02-12T07:35:00Z",
      "title": "Live updates: Hegseth says NATO membership for Ukraine is unrealistic",
      "url": "https://apnews.com/live/trump-presidency-updates-2-12-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/542ce1f/2147483647/strip/true/crop/3031x1705+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fc8%2F626df4f3466885e894128c7597cf%2Fap25043517615247.jpg"
    },
    {
      "author": "JOSH FUNK",
      "description": "Egg prices have reached a record high in the U.S. The consumer price index released on Wednesday confirmed what consumers, bakers and food companies already knew: an ongoing bird flu outbreak that began in 2022 are making eggs terribly expensive right now. The average price of a dozen Grade A eggs in U.S. cities reached $4.95 in January, eclipsing the previous record of $4.82 set in January 2023. Of course, that is only the nationwide average. A carton of eggs can cost $10 or more in some places. And specialized varieties, such as organic and cage-free eggs, are even more expensive.",
      "publishedAt": "2025-02-12T18:55:37Z",
      "title": "US eggs prices hit record high of $4.95 and are likely to keep climbing",
      "url": "https://apnews.com/article/egg-prices-record-bird-flu-a2394bdefc7bd0514d4f003cc5e8a908",
      "urlToImage": "https://dims.apnews.com/dims4/default/09650a8/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F8d%2F7aabff51851bc166ec3ff47e749a%2F0e8c363f28684007aae68e4fc606fc29"
    },
    {
      "author": "CEDAR ATTANASIO, MELISSA GOLDIN",
      "description": "FEMA payments to New York City for migrant assistance came under scrutiny this week as Elon Musk claimed his Department of Government Efficiency had uncovered $59 million in illegal payments to house migrants in luxury hotels when it was meant for American disaster relief. But the funds are being misrepresented. The city said it did receive $80 million last week, two tranches of funding from the Shelter and Service Program, which is administered by FEMA on behalf of U.S. Customs and Border Protection. The money was authorized by Congress in 2023 for SSP, which was created to support local government and NGOs to provide noncitizens released by immigration authorities. The money is separate from disaster relief funds.",
      "publishedAt": "2025-02-12T21:49:05Z",
      "title": "FACT FOCUS: FEMA funding to New York City to assist migrants is misrepresented",
      "url": "https://apnews.com/article/fema-migrants-nyc-funding-luxury-hotels-doge-c7d2c0b029bc653293a478b4bf5d59b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/471ab32/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F4d%2F5f0135bf0148fd8f4333488c45c5%2F165e08f59d2047ad90fb135b4f219ab9"
    },
    {
      "author": "TIA GOLDENBERG, SAMY MAGDY",
      "description": "Israel’s defense minister says “all hell will break loose” if Hamas does not release three hostages as planned this weekend. The threat on Wednesday comes as mediators work to keep the fragile ceasefire from collapsing. The militant group had accused Israel of failing to meet its commitments under the deal and threatened to delay the next release of hostages. A Hamas official now says there are “positive signals” for the release. The dispute has been a major test for the fragile ceasefire, along with President Donald Trump's proposal to relocate Palestinians out of devastated Gaza.",
      "publishedAt": "2025-02-12T17:59:48Z",
      "title": "Israel threatens 'all hell will break loose' on Hamas in latest Gaza ceasefire crisis",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-12-2025-0e1af7c530fd1cf6021ff9d419314cfb",
      "urlToImage": "https://dims.apnews.com/dims4/default/fcad36e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F6a%2Fe8b6d5a3fbb43c7d0c16712a9f65%2F1ec30cc131cc4c98ad65190c57a7894b"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "U.S. inflation accelerated last month as the cost of groceries and gasoline rose, a trend that will likely underscore the Federal Reserve’s resolve to delay any further interest rate cuts. The consumer price index increased 3% in January from a year ago, Wednesday’s report from the Labor Department showed, up from 2.9% the previous month. It has increased from a 3 1/2 year low of 2.4% in September. The figures underscore the stickiness of inflation, which created a major political problem for former President Joe Biden. President Donald Trump pledged to reduce prices in last year’s campaign, though most economists worry that his many proposed tariffs could at least temporarily increase costs.",
      "publishedAt": "2025-02-12T08:01:37Z",
      "title": "US inflation got worse with rising groceries and gasoline prices",
      "url": "https://apnews.com/article/inflation-economy-federal-reserve-48e77a855078b37bf3ccd58c9db94c82",
      "urlToImage": "https://dims.apnews.com/dims4/default/eeaf6fd/2147483647/strip/true/crop/5419x3048+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Feb%2F4de6d48edbce728241b9accf5374%2Ffabfc2caf6834d959d44a5246e66a86e"
    },
    {
      "author": "BEN FINLEY, JOHN RABY",
      "description": "Heavy snow and freezing rain from Kentucky to the nation's capital caused hundreds of crashes and left tens of thousands of residents in the dark. As the wintry mix turned over to rain amid rising temperatures, there's now a flood threat in several states. Authorities say one person died in a head-on crash on a snowy road Tuesday in Kentucky. By Wednesday, more than 190,000 customers in Virginia and nearly 16,000 in North Carolina had lost power. In California, an atmospheric river is expected to move in late Wednesday, likely flooding urban areas across central and Southern California.",
      "publishedAt": "2025-02-12T05:43:50Z",
      "title": "Eastern storm cuts power to tens of thousands as California braces for flooding",
      "url": "https://apnews.com/article/snow-freezing-rain-mid-atlantic-flooding-california-b94231bb4f5ed5c8dfc50a25f9fed738",
      "urlToImage": "https://dims.apnews.com/dims4/default/a704c02/2147483647/strip/true/crop/4785x2692+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Ffb%2F8901b782e5cba670206ecb53662f%2Fc7b796cc220347889a0c5c8de9e123ba"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}