{
  "articles": [
    {
      "author": "BARBARA SURK and HELENA ALVES",
      "description": "PARIS (AP) — Voters across mainland France have been casting ballots Sunday in the first round of exceptional parliamentary elections that could put France’s government in the hands of nationalist, far-right parties for the first time since the Nazi era.",
      "publishedAt": "2024-06-30T04:00:35Z",
      "title": "France's exceptionally high-stakes election has begun. The far right dominated preelection polls",
      "url": "https://apnews.com/f07061a929ed8eaad0e714e948159cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6262ced419a42d9b458f3a24cbe5840/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "EAST HAMPTON, N.Y. (AP) — Jill Biden was right at her husband's side Saturday as they exited Air Force One to head for a pair of campaign stops at luxurious vacation homes on Long Island.",
      "publishedAt": "2024-06-29T20:46:45Z",
      "title": "After president's debate debacle, Jill Biden delivering the message that they're still all in",
      "url": "https://apnews.com/c8fae7bab90c0f79ab88c9e783ca5ecd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c97277d660d246e6bfed38842edb9457/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — A sense of concern is growing inside the top ranks of the Democratic Party that leaders of Joe Biden’s campaign and the Democratic National Committee are not taking seriously enough the impact of the president’s troubling debate performance earlier in the week.",
      "publishedAt": "2024-06-30T01:15:54Z",
      "title": "A private call of top Democrats fuels more insider anger about Biden's debate performance",
      "url": "https://apnews.com/aa08cc2b556b315e728d1e9c2bf81be9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d7c3a885b24436eaad3487c93d5c596/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Beryl is forecast to strengthen into a powerful Category 4 storm as it approaches the southeast Caribbean, which began shutting down Sunday amid urgent pleads from government officials for people to take shelter.",
      "publishedAt": "2024-06-30T10:50:38Z",
      "title": "Hurricane Beryl forecast to become a Category 4 storm as it nears southeast Caribbean",
      "url": "https://apnews.com/aaae273e307658866fdd27f9f2c76592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e7c874d01824632b3bdeb466269f5de/1800.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — U.S., European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon's Iran-backed Hezbollah militants from spiraling into a wider Middle East war that the world has feared for months.",
      "publishedAt": "2024-06-29T15:39:56Z",
      "title": "US and Europe warn Lebanon's Hezbollah to ease strikes on Israel and back off from wider Mideast war",
      "url": "https://apnews.com/d6000dffd597f9580af2c7ea16374938",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9eac56f7084f4083ad5006a211b09c0a/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN and CHRISTINE FERNANDO",
      "description": "DARTFORD, England (AP) — Distrust has settled over the campaign trails in the United States and United Kingdom ahead of July 4 like a soggy summer haze.On that day, British voters will choose a new Parliament in an election expected to finish with a Labour government after 14 years under the Conservatives.",
      "publishedAt": "2024-06-30T05:05:58Z",
      "title": "American and British voters share deep roots. In 2024, they distrust their own leaders, too",
      "url": "https://apnews.com/29ce2a2c366219ac068e6c4f55f56f44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acbb667b31a44306bbb3bdc81b1d94f4/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The monthlong celebration of LGBTQ+ Pride reaches its exuberant grand finale on Sunday, bringing rainbow-laden revelers to the streets for marquee parades in New York, Chicago, San Francisco and elsewhere across the globe.",
      "publishedAt": "2024-06-30T05:41:20Z",
      "title": "Parties and protests mark the culmination of LGBTQ+ Pride month in NYC, San Francisco and beyond",
      "url": "https://apnews.com/0c8dd29c5f0d09c9e52b8b47a39efcd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18f364fce25b4438ad6f4bd7773522e4/1920.jpeg"
    },
    {
      "author": null,
      "description": "TORONTO (AP) — Canada's second largest airline, WestJet, said it canceled 407 flights affecting 49,000 passengers after the maintenance workers union announced it went on strike.",
      "publishedAt": "2024-06-29T12:29:50Z",
      "title": "Canada airline WestJet cancels more than 400 flights after a surprise strike by mechanics union",
      "url": "https://apnews.com/a4801eb2f8eb2d09a449e91b58eb3ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4955c83a030d468d8c42addb5ca7e65f/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO and STEFANIE DAZIO",
      "description": "NEW YORK (AP) — Video released late Saturday shows an officer in upstate New York fatally shooting a 13-year-old boy who had been tackled to the ground after he ran from police and pointed a replica handgun at them.",
      "publishedAt": "2024-06-29T16:49:52Z",
      "title": "Video shows NY officer fatally shooting 13-year-old on ground. Police say he pointed a replica gun",
      "url": "https://apnews.com/c3cf272ccfaf12d48eaf93d235ace444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59daf32a201c40d28346497886acdcab/1920.jpeg"
    },
    {
      "author": "CHANNI ANAND, PIYUSH NAGPAL and SIBI ARASU",
      "description": "JAMMU, India (AP) — The putrid smell of burning garbage wafts for miles from the landfill on the outskirts of Jammu in a potentially toxic miasma fed by the plastics, industrial, medical and other waste generated by a city of some 740,000 people.",
      "publishedAt": "2024-06-30T01:05:20Z",
      "title": "For India's garbage pickers, a miserable and dangerous job made worse by extreme heat",
      "url": "https://apnews.com/ba2664b6b651550141421466150229c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0525bee8f58e4e5393eea317b4263ead/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}