{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAM MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The Palestinian death toll in Gaza surpassed 20,000, health officials said Friday, the latest indication of the staggering cost of the war as Israel expanded its ground offensive and ordered tens of thousands more people to leave their homes.",
      "publishedAt": "2023-12-22T05:27:23Z",
      "title": "Gaza death toll surpasses 20,000 and Israel expands ground offensive despite pressure to scale back",
      "url": "https://apnews.com/7453c6f92d74eb1e12e506489031b91b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c827bd6a5344abf9726cf978e79c4e9/3000.jpeg"
    },
    {
      "author": "JULIET LINDERMAN, MARTHA MENDOZA and CEDAR ATTANASIO",
      "description": "Less than a year before a Hamas attack out of Gaza sparked a war, one of the oldest and largest sports complexes in the Palestinian territories got a much-needed overhaul: brand-new basketball, volleyball and tennis courts, a soccer field, a running track and, for the first time, accessible bathrooms.",
      "publishedAt": "2023-12-22T06:31:14Z",
      "title": "At least 5 US-funded projects in Gaza are damaged or destroyed, but most are spared",
      "url": "https://apnews.com/c294bf02cc3249421c181832c9d92c74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6d52429ef3b4240aeb76dc0c837ddef/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — This Congress started with showy bluster, a bitter 15-round, multi-day spectacle to elect a House speaker, a Republican who vowed to “never quit,” and then did just that.",
      "publishedAt": "2023-12-22T05:05:37Z",
      "title": "Punishing their own but passing few laws, a Congress in chaos leaves much to do in 2024",
      "url": "https://apnews.com/dda73a13a198293803e386976cf3414d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7b52ffd0a8945dbbca0fc184a36edc6/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "CORAL SPRINGS, Fla. (AP) — Joyce Loaiza lives alone, but when she returns to her apartment at a Florida senior community, the retired office worker often has a chat with a friendly female voice that asks about her day.",
      "publishedAt": "2023-12-22T05:11:45Z",
      "title": "Chatty robot helps seniors fight loneliness through AI companionship",
      "url": "https://apnews.com/a343409477b7aea350254f94daf52eb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/835ca86c446a4513a1c22a18548c17e1/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — The field of 2024 presidential candidates may have some options for shoppers scrambling for a last-minute holiday gift.As the campaign for the White House kicks into full gear, the contenders are offering an onslaught of holiday-themed merchandise, many of which capture some of the surreal aspects of the 2024 race.",
      "publishedAt": "2023-12-22T05:07:02Z",
      "title": "Need last-minute gifts? Presidential hopefuls offer ornaments, gift wrap — and Trump mug shot merch",
      "url": "https://apnews.com/79444cf120cadc20984b1e5fa4b586a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/564cf80cdb8c44e997ba9bb09d1d8868/3000.jpeg"
    },
    {
      "author": "MANUEL VALDES and CLAIRE RUSH",
      "description": "VANCOUVER, Wash. (AP) — Over the last six years, blood center employee Dylan Smith was often asked how frequently he gave blood himself. His answer was always the same: As a gay man, he couldn't.That changed this month.",
      "publishedAt": "2023-12-22T05:16:55Z",
      "title": "For years, he couldn't donate at the blood center where he worked. Under new FDA rules, now he can",
      "url": "https://apnews.com/f32446a736ae6034cd145054e2cc186e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58c6f13128f24de7863e839e23fb36d7/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — When Alexis Cholas lost his right arm as a volunteer combat medic near the front lines in eastern Ukraine, his civilian career as a surgeon was over.",
      "publishedAt": "2023-12-22T05:15:25Z",
      "title": "The war took away their limbs. Now bionic prostheses empower wounded Ukrainian soldiers",
      "url": "https://apnews.com/74ac2b6f401cdb479f940b69b0356209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65c36491a2ec41718583e9611ff6a2cd/3000.jpeg"
    },
    {
      "author": "EUGENE GARCIA and JOHN ANTCZAK",
      "description": "SANTA BARBARA, Calif. (AP) — A Pacific storm that pounded California's coastal areas and stranded motorists was poised to pounce on the southeastern area of the state through Friday, bringing flood threats to a sweeping area extending from San Diego into the Mojave Desert and even into parts of Arizona.",
      "publishedAt": "2023-12-22T05:20:30Z",
      "title": "Pacific storm that unleashed flooding barreling down on southeastern California",
      "url": "https://apnews.com/24b5a6a615acbba64c0783582581e461",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c8317abc89c41e5a73ca2460086eb79/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican’s chief prosecutor has appealed a court verdict that largely dismantled his theory of a grand conspiracy to defraud the Holy See of millions of euros but found a cardinal guilty of embezzlement.",
      "publishedAt": "2023-12-22T08:10:38Z",
      "title": "Vatican prosecutor appeals verdict that largely dismantled his fraud case but convicted cardinal",
      "url": "https://apnews.com/d5b94fcbec053e4736f39257c2e6b173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/697422cbb934491a8bb71401f9bae80d/3000.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Prized free-agent pitcher Yoshinobu Yamamoto and the Los Angeles Dodgers have agreed to a $325 million, 12-year contract, according to multiple reports.Yamamoto is set to join Japanese countryman Shohei Ohtani with the Dodgers, who signed the two-way superstar to a record $700 million, 10-year deal last week.",
      "publishedAt": "2023-12-22T05:44:24Z",
      "title": "Prized pitcher Yoshinobu Yamamoto agrees with Dodgers on $325 million deal, according to reports",
      "url": "https://apnews.com/e2efb94278f96ef8f3b37aa66156e96d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be7772ab54ca4c6bb0966773680f9758/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}