{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JILL COLVIN and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers rested their defense Tuesday without the former president taking the witness stand in his New York hush money criminal trial, moving the case closer to the moment when the jury will begin deciding his fate.",
      "publishedAt": "2024-05-21T04:06:57Z",
      "title": "Defense rests without ex-President Trump taking the witness stand in his New York hush money trial",
      "url": "https://apnews.com/b1beb56a666c398ae5393ede16c326da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f13f070fc0c542df86ae49995c5890da/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY, LEE KEATH and TIA GOLDENBERG",
      "description": "CAIRO (AP) — The United Nations says it has suspended food distribution in the southern Gaza city of Rafah due to lack of supplies and insecurity. It also said no aid trucks entered in the past two days via a floating pier set up by the U.S.",
      "publishedAt": "2024-05-21T07:38:07Z",
      "title": "UN halts all food distribution in Rafah after running out of supplies in the southern Gaza city",
      "url": "https://apnews.com/a3320a77a3a6ccff41db2a4bc63e4aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0731ab89e44561a9536e4e96d48b13/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Mourners in black began gathering Tuesday for days of funerals and processions for Iran's late president, foreign minister and others killed in a helicopter crash, a government-led series of ceremonies aimed at both honoring the dead and projecting strength in an unsettled Middle East.",
      "publishedAt": "2024-05-21T08:19:46Z",
      "title": "Mourners begin days of funerals for Iran's president and others killed in helicopter crash",
      "url": "https://apnews.com/7bb445b5885fdf0ac8616820bf7f59f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6a1fd2010f34e48bf32995c6bbbadb2/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and LISA MASCARO",
      "description": "WASHINGTON (AP) — In the hours after the attack on the U.S. Capitol on Jan. 6, 2021, Ohio’s then-Republican senator, Rob Portman, voted to accept President Joe Biden’s win over the defeated former president, Donald Trump, despite Trump’s false allegations that Biden only won because of fraud.",
      "publishedAt": "2024-05-21T04:01:28Z",
      "title": "Election deniers moving closer to GOP mainstream, report shows, as Trump allies fill Congress",
      "url": "https://apnews.com/460cde281d48e62e09e24c7573d6a9ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24eb1a23d5d74e3e829b41a7b9309c30/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — As president, Donald Trump imposed a 25% tariff on foreign steel, which hurt Clips &amp; Clamps Industries, a Michigan auto supplier — raising its materials prices, making it harder to compete with overseas rivals and costing it several contracts.",
      "publishedAt": "2024-05-21T10:00:24Z",
      "title": "Trump or Biden? Either way, US seems poised to preserve heavy tariffs on imports",
      "url": "https://apnews.com/1c17b1d223080b7a594326905380845a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee6b3e098ef7467f996944b733a1a101/3000.jpeg"
    },
    {
      "author": "CHALIDA EKVITTHAYAVECHNUKUL",
      "description": "BANGKOK (AP) — A Singapore Airlines flight hit severe turbulence over the Indian Ocean and descended 6,000 feet (around 1,800 meters) in about three minutes, the carrier said Tuesday. A British man died and authorities said dozens of passengers were injured, some severely.",
      "publishedAt": "2024-05-21T10:26:03Z",
      "title": "Severe turbulence during Singapore Airlines flight leaves several people badly injured. One man died",
      "url": "https://apnews.com/5a9a268e1a6a6fb9ece7e58b5ea9231b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f11ce6fd7075439c81391aff8e031cf6/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD",
      "description": "PHOENIX (AP) — Former New York City Mayor Rudy Giuliani pleaded not guilty Tuesday to nine felony charges stemming from his role in an effort to overturn Donald Trump’s 2020 election loss in Arizona to Joe Biden.",
      "publishedAt": "2024-05-21T05:06:04Z",
      "title": "Ex-NYC Mayor Rudy Giuliani pleads not guilty to felony charges in Arizona election interference case",
      "url": "https://apnews.com/4987d0774412d95a3dac007e81d5c157",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d606f2931444a8cb2f5fd7a6f33d427/3000.jpeg"
    },
    {
      "author": "MIKE HOUSEHOLDER and ED WHITE",
      "description": "ANN ARBOR, Mich. (AP) — Police broke up a pro-Palestinian encampment at the University of Michigan before dawn Tuesday, citing a threat to public safety and coming less than a week after demonstrators stepped up pressure by placing fake body bags on the lawn of a school official.",
      "publishedAt": "2024-05-21T11:42:15Z",
      "title": "Police break up pro-Palestinian camp at the University of Michigan",
      "url": "https://apnews.com/335904cf0ecb308a111eaa8bc86aeaf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2f138b436c34ee0b6b5b089f8668150/1920.jpeg"
    },
    {
      "author": "CATHERINE GASCHKA, JOHN LEICESTER and KEIRAN SMITH",
      "description": "PARIS (AP) — French President Emmanuel Macron is making a surprise trip to New Caledonia, the French Pacific territory that has been gripped by days of deadly unrest and where indigenous people have long sought independence.",
      "publishedAt": "2024-05-21T09:52:06Z",
      "title": "Macron is making a surprise trip to New Caledonia amid deadly unrest and indigenous frustration",
      "url": "https://apnews.com/0d1af256d3c782b7df0c90cbe6de8fae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d363014570554471ab06d54f4c130fe3/2000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "ABOARD THE THIRUKKURAL EXPRESS, India (AP) — The 1,800-mile (2,900-kilometer) journey south from New Delhi to Kanyakumari is one of the longest train rides in India, passing through cities, villages, scrub forests and deep ravines.",
      "publishedAt": "2024-05-21T04:23:25Z",
      "title": "Indian voters dissect Modi's politics while traversing the country by train",
      "url": "https://apnews.com/bc24fc9d405eb3bc50af63686fe06adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e727c41b90749778d59f37aff8e28dd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}