{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump says Ukraine can “forget about” joining NATO as he prepares to host President Volodymyr Zelenskyy at the White House. Federal government agencies must develop plans to eliminate employee positions.",
      "publishedAt": "2025-02-26T07:50:00Z",
      "title": "Live updates: Trump says Ukraine can 'forget about’ joining NATO as he plans to host Zelenskyy in Washington",
      "url": "https://apnews.com/live/trump-presidency-updates-2-26-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/475a027/2147483647/strip/true/crop/7462x4197+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F37%2F2a75e23e426a93ddad2a023b0083%2Fap25057649255341.jpg"
    },
    {
      "author": "Lorne Cook, Matthew Lee",
      "description": "A planned meeting between European Union foreign policy chief Kaja Kallas and Secretary of State Marco Rubio has abruptly canceled due to “scheduling issues.” It comes as political tensions have increased between Europe and the United States. Both sides blamed scheduling challenges, but European officials said they were caught off-guard. Notably, Kallas had previewed her planned talks with Rubio to reporters in Brussels just two days ago. The cancellation also came after the State Department instructed U.S. diplomats to step up demands on Europe to protect free speech and end what the Trump administration says are loose migration policies.",
      "publishedAt": "2025-02-26T19:28:59Z",
      "title": "High-level EU-US diplomatic talks are called off as transatlantic tensions rise",
      "url": "https://apnews.com/article/europe-united-states-diplomacy-ukraine-tensions-d21f00a9ea640334969352ef42a319f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b44f4e3/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Ff4%2F9599a6f846bd76bf16fcbd746555%2F87566c12129f476198c2bf7a073aa059"
    },
    {
      "author": "Bill Barrow",
      "description": "The Trump administration’s demand that federal agencies plan to radically downsize is driven by a key figure in the conservative movement who has long planned this move. In President Donald Trump’s first term, Russell Vought was largely a behind-the-scenes player who eventually became director of the influential but underappreciated Office of Management and Budget. He is back in that job in Trump’s second term after being the principal author of Project 2025, the conservative governing blueprint that Trump insisted during the 2024 campaign was not part of his agenda.",
      "publishedAt": "2025-02-26T21:42:16Z",
      "title": "Project 2025's Russell Vought carries out his vision for federal layoffs",
      "url": "https://apnews.com/article/trump-doge-russell-vought-project-2025-f403174299933b7e3a3b6ebd779c146c",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc0bd42/2147483647/strip/true/crop/5782x3252+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fcd%2Ffdd2b3f7bd31b11ac8c1efe2bba8%2F7b9c6c595df644df9f01205da0791624"
    },
    {
      "author": "Jill Lawless",
      "description": "U.K. Prime Minister Keir Starmer is flying to Washington on a trip aimed at persuading U.S. President Donald Trump to maintain military support for Ukraine. Ukraine and its European allies have been scrambling to respond after the Trump administration engaged directly with Moscow to quickly end the war in Ukraine. Starmer has announced a big boost in U.K. defense spending and offered to send British troops to Ukraine as part of a force to safeguard a ceasefire. He says an American “backstop” will be needed to ensure a lasting peace. Trump hasn’t committed to providing security guarantees for Ukraine. The trip comes after Washington and Kyiv struck an economic deal giving the U.S. a share of Ukraine’s lucrative rare earth mineral deposits.",
      "publishedAt": "2025-02-26T15:03:13Z",
      "title": "Keir Starmer heads to Washington with UK defense spending pledge to help sway Trump over Ukraine",
      "url": "https://apnews.com/article/starmer-washington-white-house-trump-ukraine-us-5f7814b6dd2f71d8cf575fa9301a1593",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd551b1/2147483647/strip/true/crop/6048x3402+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fae%2F56a05f655473aead1e136603460d%2F2edaaadb83c14ccca605669fe8abffd8"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court seems likely to side with an Ohio woman who claims she suffered sex discrimination in her employment because she is straight. The outcome of the case could remove an additional requirement that some courts apply when members of a majority group, including those who are white and heterosexual, sue for discrimination under federal law. The justices heard arguments in an appeal from Marlean Ames, who has worked for the Ohio Department of Youth Services for more than 20 years. Justice Brett Kavanaugh suggested the court say workplace discrimination “whether you are gay or straight, is prohibited. The rules are the same whichever way it goes.”",
      "publishedAt": "2025-02-26T17:26:23Z",
      "title": "Supreme Court seems likely to rule for straight Ohio woman claiming job bias",
      "url": "https://apnews.com/article/supreme-court-job-discrimination-lgbtq-ohio-230e67a4c4394852325f7e1969efd692",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc402e0/2147483647/strip/true/crop/5294x2978+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F76%2F487d91bb6e6eee2495fe7697526e%2F5b568e0e3bfb4344a036a87a15e1de29"
    },
    {
      "author": "Chris Megerian",
      "description": "President Donald Trump's administration says federal agencies should begin planning to eliminate employee positions. The process is known as a reduction in force. Agency leaders must submit their plans by March 13. Trump is setting the stage for what could become a dramatic realignment of the federal government. He's already downsized the workforce by laying off probationary employees. Now the administration is turning its attention to career officials with civil service protection. Trump foreshadowed this goal in an executive order that he signed with Elon Musk, the billionaire entrepreneur who's advising the Republican president on overhauling the government.",
      "publishedAt": "2025-02-26T16:31:00Z",
      "title": "Trump administration sets stage for large-scale federal worker layoffs in new memo",
      "url": "https://apnews.com/article/trump-elon-musk-federal-workers-layoffs-d295d4bb2cdd5023c27d9cb03754e81b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d981041/2147483647/strip/true/crop/7394x4159+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F41%2Fe107c105defd724c2bdc48419a33%2F57ed9e887bf24efb9d5367711da29934"
    },
    {
      "author": "Josh Funk, Josh Boak",
      "description": "The Trump administration believes a renewed emphasis on biosecurity can help in the battle against bird flu and ease egg prices, but the Agriculture Department predicts the current record prices are going to get much worse this year. It’s also not clear how much more farmers can do to keep the virus out. Agriculture Secretary Brooke Rollins offered the first new details about her bird flu plan Wednesday. But USDA predicted this week that egg prices will soar more than 41 percent this year on top of the record average price of $4.95 per dozen.",
      "publishedAt": "2025-02-26T18:36:38Z",
      "title": "Egg prices could jump another 41% this year, USDA says, as Trump's bird flu plan unveiled",
      "url": "https://apnews.com/article/record-egg-prices-usda-bird-flu-virus-92e9f5fbc4e0a792be484a4aee5b9c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7495a0/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fa6%2Ff8ea96a9b45cd801009d3b3152d7%2F4ffc4e6723c948f6bda6342fd16baf8d"
    },
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    },
    {
      "author": "Samy Magdy, Melanie Lidman",
      "description": "An Israeli security official says Hamas has handed to Red Cross the bodies of four Israelis who were held hostage in Gaza. Hamas handed over the bodies late Wednesday, and Israel was set to release of hundreds of Palestinian prisoners, days before the first phase of their ceasefire will end. Israel has delayed the release of over 600 Palestinian prisoners since Saturday to protest what it called the cruel treatment of hostages during their handover by Hamas. The militant group has called the delay a “serious violation” of the ceasefire and said talks on a second phase aren’t possible until the Palestinians are freed. The handover would complete both sides’ obligations under the ceasefire’s first phase.",
      "publishedAt": "2025-02-26T07:47:50Z",
      "title": "Israeli official says Hamas has handed to Red Cross 4 bodies of Israelis held hostage in Gaza",
      "url": "https://apnews.com/article/israel-hamas-hostages-ceasefire-witkoff-494b3f97c46f17f42213f3a71375c345",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ee5dbb/2147483647/strip/true/crop/4205x2365+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F1d%2Fd3939cf0fbecc8e6c6753b390801%2F513def2fe46642a1a129ff228b52fbce"
    },
    {
      "author": "Elliot Spagat, Will Weissert",
      "description": "President Donald Trump says he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors. Commerce Secretary Howard Lutnick said Tuesday the Trump Gold Card would replace EB-5 visas in two weeks. EB-5s were created by Congress in 1990 to generate foreign investment and are available to people who spend about $1 million on a company that employs at least 10 people. Lutnick says the Republican president's gold card would raise the price of admission for investors and eliminate fraud. The gold card is actually a green card, or permanent legal residency.",
      "publishedAt": "2025-02-26T18:16:51Z",
      "title": "Trump sees 'a thirst' for his 'gold card' visa idea",
      "url": "https://apnews.com/article/trump-gold-card-visa-million-investors-1aa4585dc053e21c7d887f1fdb9eec13",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe3d5ef/2147483647/strip/true/crop/5724x3220+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F89%2F02b5ff94141b3e76dee66e94dad8%2F2e6c4e72fe6b485ea0bbcc1324e5d92c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}