{
  "articles": [
    {
      "author": null,
      "description": "The German government says that Ukrainian President Volodymyr Zelenskyy will visit Berlin on Wednesday to join Chancellor Friedrich Merz for talks with European and U.S. leaders ahead of the Trump-Putin summit later this week. Merz has convened a series of virtual meetings on Wednesday in an attempt to have the voice of European and Ukraine’s leaders heard ahead of a summit that they have been sidelined from. Zelenskyy is due to meet with European leaders first, to prepare for a virtual call with U.S. President Donald Trump and Vice President JD Vance about an hour later.",
      "publishedAt": "2025-08-13T07:07:59Z",
      "title": "Zelenskyy to visit Berlin for meetings ahead of Trump-Putin summit",
      "url": "https://apnews.com/article/russia-ukraine-war-berlin-talks-trump-zelenskyy-merz-9f613b905f81af71920f754da503657a",
      "urlToImage": "https://dims.apnews.com/dims4/default/55d4614/2147483647/strip/true/crop/5279x2969+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F43%2F60e5d3759a99474de40d51af6570%2F03c38a734df54128bb9c578e96e8a2c6"
    },
    {
      "author": null,
      "description": "President Donald Trump’s meeting in Alaska with Vladimir Putin could be a decisive moment in the war in Ukraine and in the U.S. leader’s anomalous relationship with his Russian counterpart. Trump has long boasted that he’s always gotten along well with Putin and spoken admiringly of him, even praising him as “pretty smart” for invading Ukraine. But in recent months, he’s expressed open frustrations with Putin and called him “CRAZY” while threatening to impose sanctions on Russia. Still, Trump’s self-imposed deadline for sanctions came and went without any announced penalties or explanation from the White House and the Republican president, tempering expectations for their Friday summit.",
      "publishedAt": "2025-08-14T04:06:00Z",
      "title": "Trump's relationship with Putin is spotlighted in Alaska amid Ukraine war",
      "url": "https://apnews.com/article/trump-putin-relationship-over-years-d7a6c5400d9ec88127d16278be07a145",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcce3f3/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F4f%2Fdf82e1cb246260425f733ae75fb3%2Fe3e41cac1bc44ccb9b330b84a665cc11"
    },
    {
      "author": null,
      "description": "For most of his quarter-century rule, President Vladimir Putin visited places like Paris, London, Vienna and New York. Since Moscow invaded Ukraine, however, his destinations have been Beijing, Pyongyang, Hanoi and Minsk as the West sought to turn Russia into a pariah. The trip to Alaska will be Putin’s first to the U.S. since 2015, when he attended the U.N. General Assembly in New York. Russia has countered Western attempts to isolate it by bolstering its ties with ex-Soviet allies and other developing countries. Putin’s travel also has been limited by an International Criminal Court arrest warrant from 2023 that prompted him to avoid visits to places that recognize the court’s authority.",
      "publishedAt": "2025-08-13T14:15:43Z",
      "title": "Putin's trip to Alaska is his first to the US in a decade",
      "url": "https://apnews.com/article/russia-putin-trump-alaska-summit-foreign-trips-ad552c9b56d9b37bf0f29fd9841c256d",
      "urlToImage": "https://dims.apnews.com/dims4/default/300a359/2147483647/strip/true/crop/6390x3594+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fc7%2F30b09051a5914fee44bbf2a7602b%2Fc9aa9db7bee2456ca61334f2c6f2db31"
    },
    {
      "author": null,
      "description": "The White House says the number of National Guard troops in Washington will ramp up and federal officers will be on the streets of the nation’s capital around the clock. The changes starting Wednesday night come days after President Donald Trump made the unprecedented announcement that his administration would take over the police department for at least a month. The city’s mayor and police chief are framing the influx as a plus for public safety. But they say there are few hard measures for what a successful end to the operation might look like.",
      "publishedAt": "2025-08-13T18:05:41Z",
      "title": "Federal agents will be out 24/7 on patrol in DC, White House says",
      "url": "https://apnews.com/article/washington-police-takeover-trump-crime-national-guard-6afb751c7691e8f184057d8a16ddbbe7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f50d799/2147483647/strip/true/crop/4714x2652+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F50%2Fba8031a6db0ecab9bfb624dd7427%2F5f032f56cb3d44d59d4c2cc45d142097"
    },
    {
      "author": null,
      "description": "President Donald Trump has announced plans to move homeless people away from the nation's capital as part of a crime crackdown in Washington. But some details such as where homeless people might be taken are unclear. And there are questions about the legality of the plans. White House officials say authorities are focusing on enforcing existing laws. District of Columbia officials are making additional space available at shelters, as well as conducting outreach at homeless encampments. City residents worry that Trump's approach doesn't try to help address the root causes of homelessness.",
      "publishedAt": "2025-08-13T17:25:19Z",
      "title": "What we know about Trump's plan to move homeless people from Washington",
      "url": "https://apnews.com/article/trump-homeless-washington-relocation-encampments-federal-takeover-305cb8108031ef67b31712a42852c3d5",
      "urlToImage": "https://dims.apnews.com/dims4/default/7becefc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Ff4%2F67d44875bb44624488f921918464%2F462cc4056050484ab5275fcd6e7c3f58"
    },
    {
      "author": null,
      "description": "Gunfire aimed at the U.S. Centers for Disease Control and Prevention by a man authorities say was angry over COVID-19 vaccines is the latest in a string of violence and harassment directed at health care workers amid hostility lingering from the pandemic. Some public health care workers say the shooting that killed a police officer and rattled the CDC campus last week shouldn’t be surprising. That’s because they say distrust and anger are being amplified by misinformation about the safety of immunizations. Authorities say the Atlanta-area man who opened fire on the CDC had written about wanting to make the public aware of his discontent with the vaccine.",
      "publishedAt": "2025-08-13T21:22:47Z",
      "title": "CDC shooting underscores ongoing hostility toward health care workers",
      "url": "https://apnews.com/article/cdc-shooting-vaccines-healthcare-workers-kennedy-69a4c75eaac4fdd9fa13f58698d4c6c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/0302496/2147483647/strip/true/crop/5056x2844+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F67%2F87da4658918743c32ccd0c5774db%2Fcd3daa316f184adbb0245752c5f34506"
    },
    {
      "author": null,
      "description": "The Kennedy Center says it's “honored” to host President Donald Trump and hints he'll be announcing a construction project. The Kennedy Center says on its social media feed thanks to Trump's advocacy its “beautiful building will undergo renovations to restore its prestige and grandeur.” Trump is set to make an announcement Wednesday at the Kennedy Center, where this year’s honorees for its annual award are being revealed. Trump avoided the Kennedy Center Honors during his first term due to protests from artists. In his second term, the Republican president has made himself chairman and fired the board of trustees, which he replaced with loyalists. Trump has teased a possible name change for the center.",
      "publishedAt": "2025-08-13T04:02:06Z",
      "title": "Trump to visit Kennedy Center as honorees are announced",
      "url": "https://apnews.com/article/trump-kennedy-center-honorees-6c553c800ba334ad1ea47858b3dc271c",
      "urlToImage": "https://dims.apnews.com/dims4/default/93b0ec0/2147483647/strip/true/crop/4104x2309+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2Fbd%2Fb3b4eff3f5d4fa45798fb3cb3d7a%2F5cf63092d8e3490ab90e250f95338557"
    },
    {
      "author": null,
      "description": "Officials say new sandbag-style barriers installed along a river in Alaska’s capital city have held back record levels of flooding and prevented widespread damage after an ice dam at the nearby Mendenhall Glacier released a massive amount of rainwater and snowmelt downstream. Water pooled on several streets and in some yards in Juneau after the Mendenhall River crested Wednesday. But there were no damage reports similar to the last two years, when some homes washed away and flooding was rampant. Juneau City Manager Katie Koester told a news conference that without the barriers, hundreds of homes would have flooded. Many residents in the flood zone evacuated ahead of peak water levels.",
      "publishedAt": "2025-08-13T05:01:23Z",
      "title": "New river barriers prevented severe flood damage from a glacial outburst in Alaska, officials say",
      "url": "https://apnews.com/article/alaska-juneau-mendenhall-glacier-flooding-55b9de835689f312b99805753ebe9a14",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d7fb1d/2147483647/strip/true/crop/1569x883+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F8e%2F93dfeeb7c6b6d3fdfe89db9b23ac%2F8ccae202f1f04a56b4122d8872e29c36"
    },
    {
      "author": null,
      "description": "Health officials and witnesses say at least 25 people have been killed by Israeli gunfire while seeking aid. The shooting Wednesday came as ceasefire talks slowly resume and Israel says it will let Palestinians leave Gaza while scaling up its offensive. Prime Minister Benjamin Netanyahu says the right thing to do is “allow” Gaza’s population to leave as Israel readies for the next stage of war. The Associated Press reports Israel and South Sudan are in talks about relocating Palestinians to the war-torn East African nation. The office of Israel’s Deputy Foreign Minister says she is arriving in South Sudan for meetings but does not plan to broach the subject of the Palestinians.",
      "publishedAt": "2025-08-13T12:33:11Z",
      "title": "At least 25 killed by Israeli gunfire as Netanyahu says he will 'allow' Palestinians to leave",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-13-08-2025-7775eb3b3424dd181401c56a150ce100",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bae07c/2147483647/strip/true/crop/7112x4001+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Fc0%2F0955ce490def09b34d5b378e9141%2F5cbae11d12094e71aa401fa2ae861e83"
    },
    {
      "author": null,
      "description": "An official says a mother, father and child were killed when a tree fell on their car as heavy rain and flooding hit Tennessee. A spokesperson with the Hamilton County Office of Emergency Management says the three were killed early Wednesday when saturated ground caused the large tree to fall in the Chattanooga suburb of East Ridge. The official says the full extent of the damage isn’t yet known. Heavy rain and flash flooding prompted rescues of people stuck in homes and swamped vehicles on Tuesday, and more flooding is expected in the region Wednesday. Flood watches in central and eastern Tennessee are in effect through Wednesday night.",
      "publishedAt": "2025-08-13T13:30:23Z",
      "title": "Mother, father and child killed when tree falls on car during Tennessee storms",
      "url": "https://apnews.com/article/tennessee-flooding-deaths-chattanooga-child-storms-f809a7ecd6525b2b07f56761708a65d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d61838/2147483647/strip/true/crop/3829x2154+1+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F3b%2F596a0e017f28e1ea8bf70ed18893%2Fb914672a44e24335918eff0f78280520"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}