{
  "articles": [
    {
      "author": "REBECCA BOONE, BEATRICE DUPUY, GENE JOHNSON and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Within a day of Maui County releasing 388 names of people unaccounted for following the deadliest U.S.",
      "publishedAt": "2023-08-25T11:18:23Z",
      "title": "After Maui officials named 388 people unaccounted for in fires, many called to say they're OK",
      "url": "https://apnews.com/f0b02f12fad83690d9dfcedfd414b726",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ef00c42cda48e09292c6baf190fdf9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Kremlin on Friday rejected allegations it was behind a plane crash that is presumed to have killed mercenary leader Yevgeny Prigozhin, who conducted a brief but shocking mutiny in Russia two months ago.",
      "publishedAt": "2023-08-25T09:28:55Z",
      "title": "Kremlin denies role in plane crash believed to have killed Russian mercenary leader Prigozhin",
      "url": "https://apnews.com/1237eb57870538e52938839bcaa6675f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64e68a6f5ade477999b027c2d2c9e5e4/1920.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Less than a week after winning the Women’s World Cup, Spain’s national team players announced Friday that they will not play any more games unless the president of the country's soccer federation steps down for kissing player Jenni Hermoso on the lips after their victory.",
      "publishedAt": "2023-08-25T05:42:41Z",
      "title": "Spain soccer head won't resign for kissing player at World Cup. Team won’t play until he goes",
      "url": "https://apnews.com/3be367f0de6fbf1984e4885df0dcb00c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bca965bdaa94b90b5f30d09c7b6c5df/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS and MIKE HOUSEHOLDER",
      "description": "CANTON TOWNSHIP, Mich. (AP) — At least seven tornadoes touched down in Michigan as part of severe storms powered by strong winds that killed five people, while downing trees, tearing roofs off buildings and leaving hundreds of thousands of customers without power, officials said.",
      "publishedAt": "2023-08-25T11:53:14Z",
      "title": "7 tornadoes confirmed as Michigan storms down trees and power lines; 5 people killed",
      "url": "https://apnews.com/7e25d5c3f4bda95febb48c4f96cf2202",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2bca5eea34468893adeab8d9e016b7/1920.jpeg"
    },
    {
      "author": "AARON MORRISON",
      "description": "WASHINGTON (AP) — Martin Luther King III, along with his wife, Arndrea Waters King, and their 15-year-old daughter, Yolanda, have developed a set of traditions for this time of the year. Each August, they rewatch the Rev.",
      "publishedAt": "2023-08-26T04:12:14Z",
      "title": "Tens of thousands expected for March on Washington’s 60th anniversary demonstration",
      "url": "https://apnews.com/7639b60f26948fe614978dc6a763cc84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fea48b041fb4123b3bb059f250d7de0/1920.jpeg"
    },
    {
      "author": "SUMMER BALLENTINE and JIM VERTUNO",
      "description": "COLUMBIA, Mo. (AP) — A judge on Friday ruled against Texas' ban on gender-affirming health care for minors while a separate judge in Missouri let a similar ban take effect, jumbling again where in the U.S.",
      "publishedAt": "2023-08-25T20:20:27Z",
      "title": "Rulings in Texas, Missouri jumble again where US transgender youth can receive treatment",
      "url": "https://apnews.com/196d873aa5a5b8b05b0af18f0e653a16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f7b1c12a164807a14d86199764a202/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — One of Iowa's largest cities repealed its ban on “conversion therapy” — the discredited practice of trying to change a person’s sexual orientation or gender identity through counseling — after a Christian organization threatened legal action, part of a deepening national movement to challenge protections for LGBTQ+ kids.",
      "publishedAt": "2023-08-25T19:21:11Z",
      "title": "In Iowa and elsewhere, bans on LGBTQ+ ‘conversion therapy’ become a conservative target",
      "url": "https://apnews.com/f6d220171feac884a42006c1b5a19b1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/809a8b5ca80d40879c9d734c99e178d0/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "PELLA, Iowa (AP) — Vivek Ramaswamy has charged back into Iowa, stoking curiosity and skepticism after his attention-grabbing performance in the first Republican presidential debate.",
      "publishedAt": "2023-08-26T04:04:39Z",
      "title": "Ramaswamy faces curiosity and skepticism in Iowa after center-stage performance in GOP debate",
      "url": "https://apnews.com/808cd976e8f437252e5688019d535d93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c400402ec1b44955af6f6dcb4209eb68/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama is seeking to become the first state to execute a prisoner by making him breathe pure nitrogen.The Alabama attorney general’s office on Friday asked the state Supreme Court to set an execution date for death row inmate Kenneth Eugene Smith, 58.",
      "publishedAt": "2023-08-25T22:52:46Z",
      "title": "Alabama wants to be the 1st state to execute a prisoner by making him breathe only nitrogen",
      "url": "https://apnews.com/a6f414ff6147cbd38de6a8cd01f96653",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89ebbd3b31a4410e8ab82f60efaa7191/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Bronny James went into cardiac arrest during a basketball workout at the University of Southern California last month because of a congenital heart defect, according to a family spokeswoman.",
      "publishedAt": "2023-08-25T23:49:13Z",
      "title": "Bronny James has a congenital heart defect that caused his cardiac arrest, a spokesperson says",
      "url": "https://apnews.com/3953eee8789e83f3cccfb6dd798bc54e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e7c74f310ba4f14b3e7be8c408a26a0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}