{
  "articles": [
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — A truce between Israel and Hamas entered its fifth day on Tuesday, with the militant group promising to release more civilian hostages to delay the expected resumption of the war and Israel under growing pressure to spare Palestinian civilians when the fighting resumes.",
      "publishedAt": "2023-11-28T07:54:01Z",
      "title": "Israel and Hamas extend their truce, but it seems only a matter of time before the war resumes",
      "url": "https://apnews.com/a909a0a0c9c76ce80d1ff3e94bbe2ec4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f063d138e5af48cb8cc953b1fd05ee35/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — An Israeli hostage freed by Hamas said in an interview that she was initially fed well in captivity until conditions worsened and people became hungry. She was kept in a “suffocating” room and slept on plastic chairs with a sheet for nearly 50 days.",
      "publishedAt": "2023-11-28T06:05:11Z",
      "title": "Freed Israeli hostage describes deteriorating conditions while being held by Hamas",
      "url": "https://apnews.com/408f65fcc1b8f016f3735cd5022163eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cd4d8d3bce44248a5fa779ae1f72244/1600.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "BURLINGTON, Vt. (AP) — Three college students of Palestinian descent out for a walk in Vermont were seriously injured over the weekend when a man shot them at close range on a city street — an attack being investigated as a possible hate crime, authorities said Monday.",
      "publishedAt": "2023-11-26T18:55:41Z",
      "title": "Suspect in shooting of 3 men of Palestinian descent near the University of Vermont pleads not guilty",
      "url": "https://apnews.com/ab836d1941e4237b3649353eaceb4092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86b1972e86524f3691d2f6b38e8731e5/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JANIE HAR and MICHAEL CASEY",
      "description": "PORTLAND, Ore. (AP) — Tossing tent poles, blankets and a duffel bag into a shopping cart and three wagons, Will Taylor spent a summer morning helping friends tear down what had been their home and that of about a dozen others.",
      "publishedAt": "2023-11-28T05:09:35Z",
      "title": "Cities crack down on homeless encampments. Advocates say that’s not the answer",
      "url": "https://apnews.com/08ff74489ba00cfa927fe1cf54c0d401",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9a81228b2d424c8dfe17a6ded14bf7/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and THOMAS MACHOWICZ",
      "description": "WENDEN, Ariz. (AP) — A blanket of bright green alfalfa spreads across western Arizona's McMullen Valley, ringed by rolling mountains and warmed by the hot desert sun. Matthew Hancock's family has used groundwater to grow forage crops here for more than six decades.",
      "publishedAt": "2023-11-28T05:08:55Z",
      "title": "Tensions are bubbling up at thirsty Arizona alfalfa farms as foreign firms exploit unregulated water",
      "url": "https://apnews.com/d911d5219c8f41dc44d65fb2af6b04df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8735d652e5b84cba890206343d160861/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "BLUFFTON, S.C. (AP) — Nikki Haley argued Monday former President Donald Trump causes too much chaos to be successful in a second White House term, reiterating her argument about the GOP front-runner at a large town hall in her home state of South Carolina.",
      "publishedAt": "2023-11-27T22:30:42Z",
      "title": "Nikki Haley argues Donald Trump is always followed by 'chaos' before a large South Carolina crowd",
      "url": "https://apnews.com/dcbbc177346d9b441b9ba9d50d755756",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b032fe01bf4eb5ad748c2ad29bec06/3000.jpeg"
    },
    {
      "author": null,
      "description": "UTTARKASHI, India (AP) — Officials in India said Tuesday they were on the verge of rescuing the 41 construction workers trapped in a collapsed mountain tunnel for over two weeks in the country's north, after rescuers drilled their way through debris to reach them.",
      "publishedAt": "2023-11-28T07:45:33Z",
      "title": "41 workers trapped in a collapsed tunnel in India for 17 days are on verge of rescue, official says",
      "url": "https://apnews.com/1067e281a4ceff40b03c498bd0070063",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a278d035fc40495ea5a82f7740ecdc2d/2819.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — German Chancellor Olaf Scholz vowed Tuesday that his government will work “as fast as possible” to lay out how to solve a budget crisis, but he offered few details on how he would achieve his goals of promoting clean energy after a court decision struck down billions in funding.",
      "publishedAt": "2023-11-28T05:08:08Z",
      "title": "Germany's leader vows fixes for a budget crisis as the economy struggles. But he offers few details",
      "url": "https://apnews.com/d6015679d5c4604f9a16a118bb445983",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f2d846eb03847ebb9b1d9d895703ced/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "AMERICUS, Ga. (AP) — Hundreds turned out to salute Rosalynn Carter on Monday with the former U.S. first lady and global humanitarian's final journey from her rural hometown to the Jimmy Carter Presidential Center in Atlanta as her family began three days of memorials following her death at age 96.",
      "publishedAt": "2023-11-27T05:03:29Z",
      "title": "Rosalynn Carter tributes highlight her reach as first lady and humanitarian",
      "url": "https://apnews.com/2e798e487dc7e727a18f104d02248ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d7c573243b42ee91845d88dfdc9f6a/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — For a year, New York's Adult Survivors Act suspended the usual legal deadlines to give sexual assault victims one last chance to file lawsuits over misconduct that occurred years or decades ago.",
      "publishedAt": "2023-11-27T22:27:10Z",
      "title": "Celebrities, politicians among those named in sex abuse suits filed under NY's Adult Survivors Act",
      "url": "https://apnews.com/5952cd8f0213bd8ba34c47950511dfd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1522319d68dd4c84af50f3334d4141cf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}