{
  "articles": [
    {
      "author": "DEVNA BOSE",
      "description": "For kids, summer can revolve around playgrounds, pools, bikes and just being outside. For parents, it can mean a litany of ouchies to take care of — including scrapes, sunburns and dehydration, pediatricians say.",
      "publishedAt": "2024-07-01T14:07:37Z",
      "title": "Kids spend a lot of time outside in the summer. Here's how to deal with their common injuries",
      "url": "https://apnews.com/47ddaf7b7bb5b5d2c9e9c2a64ebb72cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86811932f4a8414e9f08cae8ff6383b2/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday ruled for the first time that former presidents have broad immunity from prosecution, extending the delay in the Washington criminal case against Donald Trump on charges he plotted to overturn his 2020 presidential election loss and all but ending prospects the former president could be tried before the November election.",
      "publishedAt": "2024-07-01T14:35:22Z",
      "title": "Supreme Court rules ex-presidents have broad immunity, dimming chance of a pre-election Trump trial",
      "url": "https://apnews.com/2dc0d1c2368d404adc0054151490f542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c727c30e319f47dfac3d50079938267b/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, ERIC TUCKER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The Supreme Court's ruling Monday in former President Donald Trump's 2020 election interference case makes it all but certain that the Republican will not face trial in Washington ahead of the November election.",
      "publishedAt": "2024-07-01T16:10:24Z",
      "title": "What to know about the Supreme Court immunity ruling in Trump's 2020 election interference case",
      "url": "https://apnews.com/72ec35de776315183e1db561257cb108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e9addf5920a4c3586d5e91ef4b558f1/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH, SAMY MAGDY and JULIA FRANKEL",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli army ordered a mass evacuation of Palestinians from much of Khan Younis on Monday, a sign that troops are likely to launch a new ground assault into the Gaza Strip’s second-largest city.",
      "publishedAt": "2024-07-01T08:35:34Z",
      "title": "Israel orders Palestinians to flee Khan Younis, signaling likely new assault on southern Gaza city",
      "url": "https://apnews.com/453808f05ef8b98eb1a6b9814441224a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3089be518a824166bf54c4413f460041/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and JON GAMBRELL",
      "description": "NEW YORK (AP) — Victims of Hamas’ Oct. 7 attack on Israel sued Iran, Syria and North Korea on Monday, saying their governments supplied the militants with money, weapons and know-how needed to carry out the assault that precipitated Israel's ongoing war in Gaza.",
      "publishedAt": "2024-07-01T17:24:43Z",
      "title": "Lawsuit accuses Iran, Syria and North Korea of providing support for Hamas' Oct. 7 attack on Israel",
      "url": "https://apnews.com/86460c28b0e7f8c6c8cd1fad6b1f5929",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e62d6a9128e482a8df066241964d0d0/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and KOFI JONES",
      "description": "BRIDGETOWN, Barbados (AP) — Hurricane Beryl ripped off doors, windows and roofs in homes across the southeastern Caribbean on Monday after making landfall on the island of Carriacou as the earliest storm of Category 4 strength to form in the Atlantic, fueled by record warm waters.",
      "publishedAt": "2024-07-01T11:08:06Z",
      "title": "Hurricane Beryl razes southeast Caribbean as a record-breaking Category 4 storm",
      "url": "https://apnews.com/234b2ecc47f8f0a8d6f3778bea503861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67531beac1354b529608442f0c91256c/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden's reset after his disastrous debate performance is looking more like a return to business as usual.Even as his campaign works to quell Democratic anxiety and reassure spooked donors, Biden has been putting the focus on presumptive Republican nominee Donald Trump as a threat to the nation, and trying to get back to doing the job of president.",
      "publishedAt": "2024-07-01T19:06:46Z",
      "title": "Biden campaign's reset after disastrous debate looks a lot like business as usual",
      "url": "https://apnews.com/c47243b3cedb88ce6ea7905a1975e164",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8bcc41adae546d380f6875496dccfde/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — Florida prosecutors knew the late millionaire and financier Jeffrey Epstein sexually assaulted teenage girls two years before they cut a plea deal that has long been criticized as too lenient and a missed opportunity to imprison him a decade earlier, according to transcripts released Monday.",
      "publishedAt": "2024-07-01T18:56:59Z",
      "title": "Florida prosecutors knew Epstein raped teenage girls 2 years before cutting deal, transcript shows",
      "url": "https://apnews.com/b5dce49bdd9bcbce2969107919ddc2d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff1f3af75c6d45ee9d48362b89200a12/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans on Monday filed a lawsuit against Attorney General Merrick Garland for the audio recording of President Joe Biden's interview with a special counsel in his classified documents case, asking the courts to enforce their subpoena and reject the White House's effort to withhold the materials from Congress.",
      "publishedAt": "2024-07-01T16:03:46Z",
      "title": "House Republicans sue Attorney General Garland over access to Biden special counsel interview audio",
      "url": "https://apnews.com/1757268eb7d7343aa1e9cc0ddafdbf5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54b607ddb2b64b5c9d5b78cd3573d399/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH and LINDSAY WHITEHURST",
      "description": "DANBURY, Conn. (AP) — Longtime Trump ally Steve Bannon was taken into custody Monday after surrendering at a federal prison to begin a four-month sentence on contempt charges for defying a subpoena in the congressional investigation into the U.S.",
      "publishedAt": "2024-07-01T04:14:48Z",
      "title": "Trump ally Steve Bannon surrenders to federal prison to serve 4-month sentence on contempt charges",
      "url": "https://apnews.com/77353a10250c36f77b2c1b7d188c5250",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e21e52a103464d48905a31aba5d1844f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}