{
  "articles": [
    {
      "author": "SAM METZ and AHMED HATEM",
      "description": "MOULAY BRAHIM, Morocco (AP) — The ground shook with a force few had ever felt, thundering through the remote Moroccan village in the dark of night. When the earthquake was over late Friday, the town carved into the Atlas Mountains lay in devastation, with possibly dozens dead, scores of homes crumpled and walls reduced to rubble.",
      "publishedAt": "2023-09-10T04:43:44Z",
      "title": "Moroccan villagers mourn after earthquake brings destruction to their rural mountain home",
      "url": "https://apnews.com/52cc12e8b556bc86970fff8575e79581",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80d4845672c74dec9cc35c9c84a9096f/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ADAM SCHRECK",
      "description": "NEW DELHI (AP) — G20 leaders paid their respects to Indian independence leader Mahatma Gandhi as their summit came to a close Sunday, a day after the group added a new member and reached agreement on a range of issues but softened language on Russia's war in Ukraine.",
      "publishedAt": "2023-09-10T04:29:54Z",
      "title": "G20 leaders pay respects at Gandhi memorial as they wrap up Indian summit and hand over to Brazil",
      "url": "https://apnews.com/9a44765ce588f9ed1b690a0f475a61ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4c7370e15334bb2a81bd40187ed2b35/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and AAMER MADHANI",
      "description": "HANOI (AP) — President Joe Biden opened a brief visit to Vietnam on Sunday by telling the country’s leadership that the two nations have a chance to shape the Indo-Pacific for decades to come.",
      "publishedAt": "2023-09-10T03:32:28Z",
      "title": "Biden opens Vietnam visit by saying the two countries are 'critical partners' at a 'critical time'",
      "url": "https://apnews.com/ac8f9dd899f77910c42295769d3fedb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f11ecd536014f6cb5f3de3626b20207/2300.jpeg"
    },
    {
      "author": null,
      "description": "HONOLULU (AP) — Most of West Maui will officially reopen to travelers Oct.",
      "publishedAt": "2023-09-09T20:13:03Z",
      "title": "Most of West Maui will welcome back visitors next month under a new wildfire emergency proclamation",
      "url": "https://apnews.com/931f3611be9e80b53e0adca3d8449a6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1e3d91a8b38436ab2703ae7eb53d7c6/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER, GABE STERN and KEN RITTER",
      "description": "New Mexico Gov. Michelle Lujan Grisham's emergency order suspending the right to carry firearms in public in and around Albuquerque drew an immediate court challenge from a gun-rights group Saturday, as legal scholars and advocates said they expected.",
      "publishedAt": "2023-09-09T20:29:27Z",
      "title": "Group sues after New Mexico governor suspends right to carry guns in Albuquerque in public",
      "url": "https://apnews.com/3fbe91683934057fe3036ccf187a7f1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5db81b523890407abe341d693b0f683b/1725.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Two foreign aid workers were reportedly killed in eastern Ukraine on Sunday as Russian shelling hit a van carrying a team of four working with a Ukrainian NGO, while dozens of Russian drones targeted Kyiv and wounded at least one civilian.",
      "publishedAt": "2023-09-10T10:14:33Z",
      "title": "Russian strikes on Ukraine kill 2 foreign aid workers and target Kyiv",
      "url": "https://apnews.com/a8d300ce02127880ff168d610b312c6a",
      "urlToImage": ""
    },
    {
      "author": "BHARATHA MALLAWARACHI",
      "description": "COLOMBO, Sri Lanka (AP) — Sri Lanka’s president said Sunday he will appoint a committee chaired by a retired Supreme Court judge to investigate allegations made in a British television report that the South Asian country’s intelligence was complicit in the 2019 Easter Sunday bombings that killed 269 people.",
      "publishedAt": "2023-09-10T10:37:58Z",
      "title": "Sri Lanka's president will appoint a committee to probe allegations of complicity in 2019 bombings",
      "url": "https://apnews.com/601d99b9a8627e309b05a11a8605974f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0c93c33ca8840cab54acafc40a83918/3000.jpeg"
    },
    {
      "author": "NOREEN NASIR, AARON MORRISON and AISHA I. JEFFERSON",
      "description": "The racist motivations of the white shooter who targeted and fatally shot Black people in Jacksonville, Florida, two weeks ago have revived concerns about the threat of hate violence and domestic terrorism against African Americans.",
      "publishedAt": "2023-09-09T14:02:37Z",
      "title": "As Jacksonville shooting victims are eulogized, advocates call attention to anti-Black hate crimes",
      "url": "https://apnews.com/92e8e5fd940276c8dd6d90b6f89acd32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e1d015fdb884afd90185f2909eaa674/3000.jpeg"
    },
    {
      "author": "ISSAM ADWAN",
      "description": "GAZA CITY, Gaza Strip (AP) — Israeli fighter jets bombed the Zorob family’s two-story home in the Gaza Strip in 2019, leaving nothing but a pile of debris and despair.",
      "publishedAt": "2023-09-10T05:17:02Z",
      "title": "Families in Gaza have waited years to move into new homes. Political infighting is keeping them out",
      "url": "https://apnews.com/7d0f528ca58802d4007e9e0bab0dda8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f637945f1e14299b36de98fba804cd2/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Prime Minister Rishi Sunak chastised China’s premier on Sunday for “unacceptable” interference in British democracy, after a newspaper reported that a researcher in Parliament was arrested earlier this year on suspicion of spying for Beijing.",
      "publishedAt": "2023-09-10T10:44:48Z",
      "title": "UK leader Sunak chides China after report a UK Parliament staffer is a suspected Beijing spy",
      "url": "https://apnews.com/f2a1e5ee83af0cc3f85850c2cb2fe377",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a24ebd61bb5450e9be35f5d5b37e659/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}