{
  "articles": [
    {
      "author": "SAM MEDNICK, JOSEF FEDERMAN and BASSEM MROUE",
      "description": "JERUSALEM (AP) — The Israeli army ordered some 100,000 Palestinians on Monday to begin evacuating from the southern city of Rafah in Gaza, signaling that a long-promised ground invasion there could be imminent and further complicating efforts to broker a cease-fire.",
      "publishedAt": "2024-05-06T05:29:00Z",
      "title": "Israeli army tells Palestinians to evacuate parts of Gaza's Rafah ahead of an expected assault",
      "url": "https://apnews.com/8659eae6e0a7362504f0aa4aa4be53e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/671909fed7484068a455d4e895dbfc10/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Prosecutors in Donald Trump's hush money trial are moving deeper into his orbit following an inside-the-room account about the former president's reaction to a politically damaging recording that surfaced in the final weeks of the 2016 campaign.",
      "publishedAt": "2024-05-06T04:24:11Z",
      "title": "Prosecutors move deeper into Trump's orbit as testimony in hush money trial enters a third week",
      "url": "https://apnews.com/c41df6a82434247352fe7a110daae981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50ef7eeb17eb496595cf8252e10c49ef/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — China's President Xi Jinping arrived at the French presidential palace on Monday for a two-day state visit that is expected to focus both on trade disputes and diplomatic efforts to convince Beijing to use its influence to move Russia toward ending the war in Ukraine.",
      "publishedAt": "2024-05-06T04:31:58Z",
      "title": "Macron sets trade and Ukraine as top priority as China's Xi Jinping pays a state visit to France",
      "url": "https://apnews.com/c7f48d55fd9ccb345fc6e9eda105f89b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9750ab4835a84ce5a5c97024c5e4813c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, DIDI TANG and NATHAN ELLGREN",
      "description": "WASHINGTON (AP) — After a student leader of the historic Tiananmen Square protests entered a 2022 congressional race in New York, a Chinese intelligence operative wasted little time enlisting a private investigator to hunt for any mistresses or tax problems that could upend the candidate's bid, prosecutors say.",
      "publishedAt": "2024-05-06T04:15:43Z",
      "title": "As China and Iran hunt for dissidents in the US, the FBI is racing to counter the threat",
      "url": "https://apnews.com/ee48c1b9c32d187b183faaa616d9ab16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/906c8d64d3094742ac77c50cf0551dc7/1920.jpeg"
    },
    {
      "author": "GARANCE BURKE and ALAN SUDERMAN",
      "description": "FORT LAUDERDALE, Fla. (AP) — Donald Trump’s former campaign manager looked squarely into the camera and promised his viewers they were about to witness a bold new era in politics.“You’re going to see some of the most amazing new technology in artificial intelligence that’s going to replace polling in the future across the country,” said Brad Parscale in a dimly lit promotional video accentuated by hypnotic beats.",
      "publishedAt": "2024-05-06T04:04:09Z",
      "title": "Brad Parscale helped Trump win in 2016 using Facebook ads. Now he’s back, and an AI evangelist",
      "url": "https://apnews.com/3ff2c8eba34b87754cc25e96aa257c9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c9f0a1d2e2d4f5cbf8a60fcc462b19c/3000.jpeg"
    },
    {
      "author": "COURTNEY SUBRAMANIAN",
      "description": "WASHINGTON (AP) — President Joe Biden’s campaign and Democratic candidates are in a fevered race with Republicans over who can best exploit the potential of artificial intelligence, a technology that could transform American elections — and perhaps threaten democracy itself.",
      "publishedAt": "2024-05-06T04:08:58Z",
      "title": "Nervous about falling behind the GOP, Democrats are wrestling with how to use AI",
      "url": "https://apnews.com/520f22de269ba1eff24d1544ca38d569",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0db2d38979484f57a8725289600327e8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia plans to hold drills simulating the use of battlefield nuclear weapons, the Defense Ministry announced Monday, days after the Kremlin reacted angrily to comments by senior Western officials about the war in Ukraine and Moscow warned that tensions with the West are deepening.",
      "publishedAt": "2024-05-06T08:10:42Z",
      "title": "Russia announces nuclear weapon drills after angry exchange with senior Western officials",
      "url": "https://apnews.com/b007cffdc4fc57922042a35fbe47907f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8285432586a405aad988bf64b036185/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — Floodwaters closed some Texas schools on Monday after days of heavy rains pummeled the Houston area and led to hundreds of rescues including people who were stranded on rooftops.",
      "publishedAt": "2024-05-06T04:30:11Z",
      "title": "Heavy rains ease around Houston but flooding remains after hundreds of rescues and evacuations",
      "url": "https://apnews.com/117b0f63c9bd53be31ee34e11547da21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98b6de3af54848d38c2310358b1feaa0/1920.jpeg"
    },
    {
      "author": "JEFFREY SCHAEFFER and SYLVIE CORBET",
      "description": "BRETTEVILLE-L'ORGUEILLEUSE, France (AP) — On D-Day, Charles Shay was a 19-year-old U.S. Army medic who was ready to give his life — and save as many as he could.Now 99, he’s spreading a message of peace with tireless dedication as he’s about to take part in the 80th anniversary commemorations of the landings in Normandy that led to the liberation of France and Europe from Nazi Germany occupation.",
      "publishedAt": "2024-05-06T06:23:29Z",
      "title": "On D-Day, 19-year-old medic Charles Shay was ready to give his life, and save as many as he could",
      "url": "https://apnews.com/9c2730a7d7fbbc0c80793b176b9c8bb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bddc2820eca142fb8677ceb395a3b0dc/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "With some help from artificial intelligence, country music star Randy Travis, celebrated for his timeless hits like “Forever and Ever, Amen” and “I Told You So,\" has his voice back.",
      "publishedAt": "2024-05-06T09:05:19Z",
      "title": "With help from AI, Randy Travis got his voice back. Here's how his first song post-stroke came to be",
      "url": "https://apnews.com/589a8c142f70ed8ccf53af6d32c662dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20f01d4900fb41edb20d28f33bc58659/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}