{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "The Trump administration is intensifying its sweeping efforts to shrink the size of the federal workforce by ordering agencies to lay off all probationary employees who had not yet gained civil service protection. Hundreds of thousands of workers could be affected. In addition, workers at some agencies have been warned that large workplace cuts are coming. The Office of Personnel Management told agencies on Thursday to lay off all probationary employees. It’s expected to be the first step in sweeping layoffs throughout the federal government. President Donald Trump signed an executive order this week that told agencies to plan for “large-scale reductions in force.”",
      "publishedAt": "2025-02-13T22:36:42Z",
      "title": "Trump administration lays off probationary government workers, warns others of large cuts to come",
      "url": "https://apnews.com/article/trump-federal-workers-layoffs-doge-406752da1614755b8fabe9c94e0c71a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/5205db3/2147483647/strip/true/crop/5559x3127+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F88%2Ff106308153125612f8df1ca9b351%2F83d9d34e3d3e4888a619f0c5a15adf65"
    },
    {
      "author": "WILL WEISSERT",
      "description": "Indian Prime Minister Narendra Modi has met with Trump national security adviser Mike Waltz ahead of his meeting with President Donald Trump. Modi also met Thursday with Trump administration official Elon Musk. Modi has heaped praise on Trump and hopes to avoid additional tariffs the new Republican administration has slapped on other countries. But that didn't stop Trump from signing an order increasing U.S. tariffs to match the tax rates that other countries charge on imports. That move affects American trading partners around the world, including India. Trump also has decried U.S. trade deficits internationally — and the U.S. has a large one with India.",
      "publishedAt": "2025-02-13T05:02:26Z",
      "title": "Modi's visit with Trump could boost US-India relations amid tariff woes",
      "url": "https://apnews.com/article/trump-india-modi-visit-washington-tariffs-83d5f6af65f923dc4feb3f38338c888d",
      "urlToImage": "https://dims.apnews.com/dims4/default/73ec848/2147483647/strip/true/crop/4170x2346+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F10%2F1a65292102d429f5809e611cfa97%2F970dc071a8024926a758a7582c108f75"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The White House had blocked an Associated Press journalist from a news conference with two major world leaders. It upped the stakes in a disagreement between the news agency and the Trump administration over AP’s style decision to stick with the name “Gulf of Mexico” for a body of water that the president rechristened the “Gulf of America.” An AP reporter was prevented from entering a news conference with Donald Trump and Indian Prime Minister Narendra Modi. It effectively shut out thousands of global news outlets from the remarks and information that came out of the event. Julie Pace, the AP’s senior vice president and executive editor, called it a “deeply troubling escalation” and “a plain violation of the First Amendment” to the U.S. Constitution.",
      "publishedAt": "2025-02-14T02:09:54Z",
      "title": "AP White House reporter blocked from Trump and Modi news conference",
      "url": "https://apnews.com/article/ap-white-house-gulf-name-dispute-media-864f2fbb5cfaeede009d7cea5788515b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2e7768/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fe5%2F89deacec8b68c642375ea1267c50%2Fbc08e9417d714e38a0f9add88ecaa148"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "Robert F. Kennedy Jr. has been sworn in as President Donald Trump’s health secretary. The Senate on Thursday confirmed him, voting 52 to 48. It puts the prominent vaccine skeptic in control of $1.7 trillion in federal spending, vaccine recommendations, food safety, and health insurance programs for roughly half the country. Republicans fell in line behind Trump despite hesitancy over Kennedy’s views on vaccines. The GOP has largely embraced Kennedy’s vision to “Make America Healthy Again” by directing the nation's public health agencies to focus on chronic diseases such as obesity. He's earned a formidable following with his populist and sometimes extreme views on food, chemicals and vaccines.",
      "publishedAt": "2025-02-13T05:19:28Z",
      "title": "RFK Jr. sworn in as Trump's health secretary after close Senate vote",
      "url": "https://apnews.com/article/rfk-trump-health-secretary-vote-5dbefeef0537dc241e6fb33b8f2a748b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a7f129f/2147483647/strip/true/crop/4469x2514+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fcc%2F56db7d4f5804fa4dc5d2dd04d970%2Fb73b97e0e5ba48faac17c94dc04b51e2"
    },
    {
      "author": "JOSH BOAK, CHRISTOPHER RUGABER",
      "description": "Donald Trump promised as a candidate that he could easily conquer inflation, but the reality is proving tougher than he expected. Wednesday’s consumer price index report showed that Trump could end up facing the same challenges that dragged down his predecessor, President Joe Biden. The annual inflation rate has risen over the three months since the November election to 3%. Gasoline prices in particular have climbed despite Trump’s claims that his return to the presidency would signal increased oil production that would lower energy costs. It’s a humbling reminder that even U.S. presidents are subject to the invisible hand of supply and demand, rather than the masters of it.",
      "publishedAt": "2025-02-13T05:08:58Z",
      "title": "The latest inflation report shows that high prices are Trump's major economic challenge",
      "url": "https://apnews.com/article/trump-inflation-tariffs-prices-consumer-50c4738216756499c8cdc17ab77d6d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/901bb20/2147483647/strip/true/crop/3968x2232+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F4b%2Fbeb8ed2c8817ff56fc49837f625f%2Fa328f2dcfcf24d578cf07aeafa7f17e1"
    },
    {
      "author": "MATTHEW DALY",
      "description": "In a major reversal, the new head of the Environmental Protection Agency says he'll try to rescind $20 billion in grants awarded by the Biden administration for climate and clean-energy projects. EPA Administrator Lee Zeldin says the agency will revoke contracts for a “green bank” that is set to fund thousands of projects to fight climate change and promote environmental justice. The program was approved by Democrats under President Joe Biden’s signature climate law. Republicans in Congress have called the green bank a “slush fund” and voiced concern over how the money will be used.",
      "publishedAt": "2025-02-13T19:24:19Z",
      "title": "EPA chief says he will seek return of $20 billion in clean-energy grants awarded by Biden",
      "url": "https://apnews.com/article/green-bank-epa-zeldin-climate-clean-energy-191b394cda251ef772867369f61f07b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a389330/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F7a%2Fbd55bf047c6c094651ad051d63c8%2F2d0c6f19ac574680be63d630a7f57bda"
    },
    {
      "author": "ALMA SOLÍS",
      "description": "Panama's president has said his country has received the first U.S. flight carrying deportees from other nations as the Trump administration takes Panama up on its offer to act as a stopover for expelled migrants. President José Raúl Mulino said Thursday in his weekly press briefing that a U.S. Air Force flight carrying 119 migrants of diverse nationalities had arrived Wednesday in Panama. The president said it was the first of three planned flights that were expected to total about 360 people. It came after U.S. Secretary of State Marco Rubio met with Mulino in Panama last week as the U.S. looks to expand its deportation capacity.",
      "publishedAt": "2025-02-13T17:21:45Z",
      "title": "US deports 119 migrants from a variety of nations to Panama",
      "url": "https://apnews.com/article/panama-us-migrants-mulino-trump-0460f98743706ae20fd3914f827b67a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/998e3a7/2147483647/strip/true/crop/3998x2249+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fa6%2Fe4d951ac0d9094a22f94f9f1e172%2Fef5deaff85604272b69ba1242d8c57b4"
    },
    {
      "author": "KATE PAYNE, STEPHANY MATAT, TALLAHASSEE, KIM CHANDLER, CHARLOTTE KRAMON",
      "description": "Florida Gov. Ron DeSantis has signed a sweeping package of immigration laws. It's aimed at carrying out President Donald Trump’s mass deportation agenda. The Republican governor said Thursday that the laws put Florida on the leading edge of conservative-controlled states using local resources for federal immigration enforcement. The new Florida laws would increase penalties for crimes committed by immigrants who enter the country without legal permission. That includes the death penalty for those who commit capital offenses like first-degree murder. Lawmakers in Georgia and Alabama also moved ahead Thursday with their own bills aimed at furthering Trump’s immigration crackdown.",
      "publishedAt": "2025-02-13T21:09:30Z",
      "title": "DeSantis signs sweeping immigration laws for Florida as states rush to fulfill Trump's agenda",
      "url": "https://apnews.com/article/desantis-trump-immigration-florida-legislature-5f53a37e042474fb057a9b964f151d61",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0e9a17/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F14%2F35bb091c1d456958deb514ae8931%2Fea257e43b15342939534b774cf246ec0"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has rolled out his plan to increase U.S. tariffs to match the tax rates that other countries charge on imports. The Republican is possibly triggering a broader economic confrontation with allies and rivals alike as he hopes to eliminate any trade imbalances. Trump said Thursday: “TODAY IS THE BIG ONE: RECIPROCAL TARIFFS!!!” The prospect of a dramatic hike on tariffs could send shockwaves through the world economy, possibly depressing growth while also causing inflation to intensify. Most economists say the tariffs would effectively be a tax increase on U.S. consumers. Trump says he's decided “for purposes of fairness\" he'll charge reciprocal tariffs.",
      "publishedAt": "2025-02-13T12:52:00Z",
      "title": "Trump signs a plan for reciprocal tariffs on US trading partners",
      "url": "https://apnews.com/article/trump-tariffs-reciprocal-imports-tax-trade-economy-54c0a26687dc96157d96229068894720",
      "urlToImage": "https://dims.apnews.com/dims4/default/95c5e57/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4c%2F2523bce79acc6a79e7755e0bf587%2F3cf12cc080014e7fb806f9ef2a81c8a4"
    },
    {
      "author": "CHRISTOPHER WEBER, PATRICK WHITTLE",
      "description": "Authorities say a more than 100-vehicle pileup in whiteout conditions has closed part of a major interstate along the Columbia River near Portland, Oregon. The Multnomah County Sheriff’s Office said on social media Thursday that westbound Interstate 84 was closed near Multnomah Falls after a vehicle pileup in which an SUV caught fire. It also says there are reports of people being trapped in vehicles. Authorities say the people in the SUV were able to escape. Officials say first responders are searching car by car and injuries have been reported. Multnomah Falls is about 25 miles east of Portland.",
      "publishedAt": "2025-02-13T06:54:55Z",
      "title": "Injuries reported in more than 100-vehicle pileup near Portland in whiteout conditions",
      "url": "https://apnews.com/article/california-rain-flooding-oregon-ice-snow-d00f3bf4f37d073d16dabef98197597e",
      "urlToImage": "https://dims.apnews.com/dims4/default/24d5374/2147483647/strip/true/crop/8025x4514+0+418/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F25%2Fbf745baa453f60a478e59c92c034%2Fd6218e5e107641daad38ae3b6436cfff"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}