{
  "articles": [
    {
      "author": "AAMER MADHANI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Saudi Arabia will host a Ukrainian-organized peace summit in early August seeking to find a way to start negotiations over Russia's war on the country, an official said Saturday night.",
      "publishedAt": "2023-07-30T03:41:53Z",
      "title": "Official tells AP that Saudi Arabia will host a Ukrainian-organized peace summit in August",
      "url": "https://apnews.com/ee8719ebcd6a0a541ce6a8670ae6bb09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0612921eeb414944bfe013f6381cf9a5/3000.jpeg"
    },
    {
      "author": null,
      "description": "LITTLE ROCK, Ark. (AP) — Arkansas is temporarily blocked from enforcing a law that would have allowed criminal charges against librarians and booksellers for providing “harmful” materials to minors, a federal judge ruled Saturday.",
      "publishedAt": "2023-07-29T21:24:10Z",
      "title": "Judge blocks Arkansas law allowing librarians to be criminally charged over ‘harmful’ materials",
      "url": "https://apnews.com/758f28c04c573d03b869ad2738e2b06d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/809cf249e4e44118a0fc71fd073711c5/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — China accused the United States of turning Taiwan into an “ammunition depot” after the White House announced a $345 million military aid package for Taipei, and the self-ruled island said Sunday it tracked six Chinese navy ships in waters off its shores.",
      "publishedAt": "2023-07-30T03:54:24Z",
      "title": "China says US military aid to Taiwan will not deter its will to unify the island",
      "url": "https://apnews.com/e49902a6f73781dfec61347fc1ad232b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6d58b82569d4ccfbc310e7294c7b71c/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "PARRIS ISLAND, S.C. (AP) — Not long ago, Marine Col. Jennifer Nash, a combat engineer with war deployments under her belt, made a vow to fellow officers as they headed to a dinner in Atlanta: She would get two new recruiting contacts by the end of the evening.",
      "publishedAt": "2023-07-29T16:11:58Z",
      "title": "'The Few, the Proud' aren't so few: Marines recruiting surges while other services struggle",
      "url": "https://apnews.com/b3293430025ffad521fa32379a29be74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fc575482fcd448db730a254ac24ff96/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Lawmakers broke for their August recess this week with work on funding the government largely incomplete, fueling worries about whether Congress will be able to avoid a partial government shutdown this fall.",
      "publishedAt": "2023-07-29T04:10:52Z",
      "title": "Members of Congress break for August with no clear path to avoiding a shutdown this fall",
      "url": "https://apnews.com/aea04e44447fcb8a818a01a54854ac12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eeff30be93614c75b7984987af845cab/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — It’s a stunning new allegation in an already serious case: Former President Donald Trump sought to delete Mar-a-Lago surveillance footage to obstruct the Justice Department’s investigation into his handling of classified documents.",
      "publishedAt": "2023-07-29T04:19:14Z",
      "title": "Fresh charges tie Trump even more closely to coverup effort. That could deepen his legal woes",
      "url": "https://apnews.com/eb6f5c62094690fcb2f652673fb9df58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fe015d827b64a39b8cf4302f4fea650/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS, BEATRICE DUPUY and REBECCA BLACKWELL",
      "description": "KEY BISCAYNE, Fla. (AP) — In the sweltering summer heat, nobody tries to cool off by jumping into a hot tub. In parts of Florida, however, that’s what the ocean has felt like.Earlier this week, sea surface temperatures reached as high as 101.2 degrees Fahrenheit (38.4 degrees Celsius) around the state’s southern tip in Manatee Bay, according to the National Weather Service — although scientists said the context for Monday’s reading is complicated.",
      "publishedAt": "2023-07-29T04:46:25Z",
      "title": "Water is refreshing in the heat, right? In parts of Florida this past week, not so much",
      "url": "https://apnews.com/2f0a1eb529aba9f17ee88a04cda7df42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a8009116fd24ef4b331a8f338e8efd9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian authorities say three Ukrainian drones attacked Moscow in the early hours on Sunday, injuring one person and prompting a temporary closure for traffic of one of four airports around the Russian capital.",
      "publishedAt": "2023-07-30T03:49:03Z",
      "title": "Overnight drone attack on Moscow injures 1, temporarily closes airport for traffic",
      "url": "https://apnews.com/4801c01e9f07ac882ab28d33666bf8d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f743e754f59481e86a322a347047446/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Leading up to the 2020 election, Facebook ads targeting Latino and Asian American voters described Joe Biden as a communist. A local station claimed a Black Lives Matter co-founder practiced witchcraft.",
      "publishedAt": "2023-07-29T04:08:44Z",
      "title": "Election disinformation campaigns targeted voters of color in 2020. Experts expect 2024 to be worse",
      "url": "https://apnews.com/712a5c5a9b72c1668b8c9b1eb6e0038a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd33edf4c4d54c9c97f372314eb91dc9/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — A historic heat wave that has gripped the U.S. Southwest throughout July, blasting residents and baking surfaces like brick, is beginning to abate with the late arrival of monsoon rains.",
      "publishedAt": "2023-07-29T05:05:01Z",
      "title": "30 days over 110 F in Phoenix. But expected monsoon rains could cool historically hot Southwest",
      "url": "https://apnews.com/922e965ba3d3e42cbffc2ece12d5c114",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0b9e35771049df95e931f674bec57e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}