{
  "articles": [
    {
      "author": "RAVI NESSMAN",
      "description": "JERUSALEM (AP) — International diplomacy to prevent the war in Gaza from spreading into a wider regional conflict intensified Friday, with the British and French foreign ministers making a joint trip to Israel while internationally mediated cease-fire talks in Qatar were expected to enter their second day.",
      "publishedAt": "2024-08-16T06:39:24Z",
      "title": "Diplomacy intensifies to halt the Israel-Hamas war and prevent wider regional conflict",
      "url": "https://apnews.com/cf0bb95a8a36cfabf1c6db8edf97c862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfdec9bb40264ad8a85011bc72d64963/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Some families of hostages held in Gaza believe the latest round of cease-fire talks between Israel and Hamas could be the last best chance to set their loved ones free after more than 300 days of captivity.",
      "publishedAt": "2024-08-16T04:08:31Z",
      "title": "Families of hostages in Gaza hope cease-fire talks will end their nightmare",
      "url": "https://apnews.com/339a8dd7966143f04f012fa4d2b67162",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6834dc04259421782a9bdcb3564c61d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A daring Ukrainian military push into Russia’s Kursk region has seen Kyiv's forces seize scores of villages, take hundreds of prisoners and force the evacuation of tens of thousands of civilians in what has become the largest attack on the country since World War II.",
      "publishedAt": "2024-08-16T04:10:08Z",
      "title": "Ukraine’s swift push into the Kursk region shocked Russia and exposed its vulnerabilities",
      "url": "https://apnews.com/1178b99b32b476816db3a48ffa06b11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/360c1b78d8744f21b2127fbba23d2c88/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, MICHAEL R. BLOOD and ALAN SUDERMAN",
      "description": "WASHINGTON (AP) — As California’s attorney general, Kamala Harris successfully defended the death penalty in court, despite her past crusade against it.As a new senator, she proposed to abolish cash bail — a reversal from when she chided San Francisco judges for making it “cheaper” to commit crimes by setting bail amounts too low.",
      "publishedAt": "2024-08-16T04:41:06Z",
      "title": "What do marijuana, the death penalty and fracking have in common? Harris shifted positions on them",
      "url": "https://apnews.com/f35dbacc2137e6aebc214befd4503ff8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deda05646db44bf58d71474a52ef0b9c/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "Former President Donald Trump on Thursday gave his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
      "publishedAt": "2024-08-15T23:49:24Z",
      "title": "FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference",
      "url": "https://apnews.com/f8ed52f64a12cf450b0d0f2591c9d92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa795622c6594802a2bb90d0b6af884e/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Five summers ago, Donald Trump’s running mate JD Vance — then a 34-year-old memoirist and father of a 2-year-old boy — took the stage at a conservative conference and tackled an issue that would become a core part of his political brand: the United States' declining fertility rate.",
      "publishedAt": "2024-08-16T04:38:44Z",
      "title": "Beyond 'childless cat ladies,' JD Vance has long been on a quest to encourage more births",
      "url": "https://apnews.com/555c0f78ef8dd4c13c88b9e8d5f0024a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2906e6bb717b4294a6e7221bf9ab566d/2828.jpeg"
    },
    {
      "author": "PIYUSH NAGPAL",
      "description": "NEW DELHI (AP) — Thousands of people marched through various Indian cities Friday to protest the rape and murder of a trainee doctor at a government hospital, demanding justice and better security at medical campuses and hospitals.",
      "publishedAt": "2024-08-16T09:59:44Z",
      "title": "Protests grow in India over the rape and killing of a doctor at a state-run hospital",
      "url": "https://apnews.com/b5b74dc5ea7483df95d5370acbce1369",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd74ef5d59244b2fac27f05cb5f44336/3000.jpeg"
    },
    {
      "author": "GRANT PECK",
      "description": "BANGKOK (AP) — The election of Paetongtarn Shinawatra as Thailand’s prime minister represents a remarkable comeback for the political dynasty founded by her billionaire father, Thaksin Shinawatra, who was ousted by a military coup in 2006.",
      "publishedAt": "2024-08-16T07:48:48Z",
      "title": "Thailand's new prime minister renews the legacy of her divisive father, Thaksin Shinawatra",
      "url": "https://apnews.com/087fae9ad578b7ed9171142dadc01bdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4ffd2d4843e4aca9a15f1193628147e/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials on the tiny island in the middle of the Atlantic Ocean prepared to open shelters and close government offices.",
      "publishedAt": "2024-08-16T10:54:53Z",
      "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm",
      "url": "https://apnews.com/7c53790d1b73ed431eae36bf3189fa4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c60d4a2f3c194a289b8baf7dd6c2038c/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON and KAITLYN HUAMANI",
      "description": "LOS ANGELES (AP) — Nearly 10 months after the death of Matthew Perry, the long-simmering investigation into the ketamine that killed him came dramatically into public view with the announcement that five people had been charged with having roles in the overdose of the beloved “Friends” star.",
      "publishedAt": "2024-08-16T05:22:51Z",
      "title": "Matthew Perry's death leads to sweeping indictment of 5, including doctors and reputed dealers",
      "url": "https://apnews.com/eb5fd5af85e2cffdc61642b7a4fbe0b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/233f68aa8a9c4f6d9d91c746a2146768/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}