{
  "articles": [
    {
      "author": "ILLIA NOVIKOV and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — The Kremlin warned Monday that President Joe Biden’s decision to let Ukraine strike targets inside Russia with U.S.-supplied longer-range missiles adds “fuel to the fire” of the war and would escalate international tensions even higher.",
      "publishedAt": "2024-11-18T09:39:19Z",
      "title": "Moscow warns the US over allowing Ukraine to hit Russian soil with longer-range weapons",
      "url": "https://apnews.com/5cd4f9fe2cee1ae8aed67d63c22b0703",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b662bb045a4b6694c6ae7ba1f26bc0/1920.jpeg"
    },
    {
      "author": "SALLY ABOU ALJOUD",
      "description": "BEIRUT (AP) — An Israeli airstrike slammed into a densely populated residential area in Lebanon’s capital near key government and diplomatic buildings late Monday, killing at least five people as the U.S.",
      "publishedAt": "2024-11-18T17:11:23Z",
      "title": "Israeli airstrike hits central Beirut near key government buildings and embassies",
      "url": "https://apnews.com/e97ba8991d02530306d10b1962b1c6e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/385a4be371e94b2f824e4fa02d86a693/1920.jpeg"
    },
    {
      "author": "KANIS LEUNG and ZEN SOO",
      "description": "HONG KONG (AP) — Forty-five lawmakers and activists were sentenced to four to 10 years in prison Tuesday in Hong Kong’s biggest national security case under a Beijing-imposed law that crushed a once-thriving pro-democracy movement.",
      "publishedAt": "2024-11-19T01:23:49Z",
      "title": "45 lawmakers and activists get 4 to 10 years in prison in Hong Kong's biggest national security case",
      "url": "https://apnews.com/1ed13be76fa4918d83f7d3e498f2f543",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b731286a18474a77858bfae9aa5ee8ed/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — As tens of thousands of marchers crowded the streets in New Zealand’s capital Wellington on Tuesday, the throng of people, flags aloft, had the air of a festival or a parade rather than a protest.",
      "publishedAt": "2024-11-19T03:30:48Z",
      "title": "42,000 crowd New Zealand's Parliament grounds in support of Māori rights",
      "url": "https://apnews.com/54d5a5345815bed2c2a12687d4f6b625",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e22999eacc041d4ada26c35f3b10d72/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATHENS, Ga. (AP) — A Georgia appeals court on Monday canceled oral arguments that were scheduled for next month on the appeal of a lower court ruling allowing Fulton County District Attorney Fani Willis to continue to prosecute the election interference case she brought against President-elect Donald Trump.",
      "publishedAt": "2024-11-18T23:18:06Z",
      "title": "Georgia appeals court cancels hearing in election interference case against Trump",
      "url": "https://apnews.com/a632d5b066a8a85ff12f0b2bf8e60557",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c734c0c7ef3451e95cacf88dd0b6eeb/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — There was House Speaker Mike Johnson walking behind President-elect Donald Trump's entourage into Saturday night's UFC fight at Madison Square Garden, his stature overcome by the enormity of the scene around him.",
      "publishedAt": "2024-11-18T23:33:57Z",
      "title": "Speaker Johnson's 'epic' weekend with Trump shows strengths and limits of his power",
      "url": "https://apnews.com/995a7ee3324e04ec6da680c826136655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15927615346e41e68367fd1f49c91519/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and DARLENE SUPERVILLE",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump said Monday he is naming former Wisconsin Rep. Sean Duffy as his nominee for transportation secretary, as he continues to roll out picks for his Cabinet.",
      "publishedAt": "2024-11-18T23:08:42Z",
      "title": "Trump says he is naming former Wisconsin Rep. Sean Duffy to be transportation secretary",
      "url": "https://apnews.com/c465bbc516b5f898233f86bee31a7a45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07303ec99e7c4022b871af281c8bd385/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE, ELÉONORE HUGHES and DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — Leaders of the world's 20 major economies called for a global pact to combat hunger, more aid for war-torn Gaza and an end to hostilities in the Mideast and Ukraine, issuing a joint declaration Monday that was heavy on generalities but short of details on how to accomplish those goals.",
      "publishedAt": "2024-11-19T04:28:31Z",
      "title": "G20 summit calls for more aid to Gaza and an end to the war in Ukraine",
      "url": "https://apnews.com/bb4f4ece63832580498d5829199c67b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20b090b8a9514097bcc2cec4119488de/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A man fatally stabbed three people across a swath of Manhattan on Monday morning, carrying out a series of random attacks without uttering a word to his victims, officials said. The 51-year-old suspect was in police custody after being found with blood on his clothes and the two kitchen knives he was carrying, authorities said.",
      "publishedAt": "2024-11-18T18:39:16Z",
      "title": "3 people are killed in random stabbings in New York City. A suspect is in custody",
      "url": "https://apnews.com/f16e3de00b1c9f8ef7cd2b2e4c0cc75c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6047a8b63e4241069b8b8df67c260319/3000.jpeg"
    },
    {
      "author": "BETH HARPAZ",
      "description": "NEW YORK (AP) — Arthur Frommer, whose \"Europe on 5 Dollars a Day\" guidebooks revolutionized leisure travel by convincing average Americans to take budget vacations abroad, has died.",
      "publishedAt": "2024-11-19T02:42:15Z",
      "title": "Arthur Frommer, travel guide innovator, has died at 95",
      "url": "https://apnews.com/7293814296854079a3a10f05d02faf44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dccc61b13d844b28b1acfca5fba70f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}