{
  "articles": [
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — The future looks bleak for war-weary Ukraine: It is beset by shortages in soldiers and ammunition, as well as doubts about the supply of Western aid.",
      "publishedAt": "2024-02-24T05:03:56Z",
      "title": "After 2 years of war, questions abound on whether Kyiv can sustain the fight against Russia",
      "url": "https://apnews.com/d0f1c1bd57f7ebbe5f7335738acbc6b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a466c199d0364388bec06310f46a1cf0/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS and JOANNA KOZLOWSKA",
      "description": "The body of Russian opposition leader Alexei Navalny has been handed over to his mother, a top aide to Navalny said Saturday on his social media account.",
      "publishedAt": "2024-02-24T09:10:53Z",
      "title": "The body of Russian opposition leader Alexei Navalny has been handed over to his mother, aide says",
      "url": "https://apnews.com/78fa6a0d6792ee868ad41fd672dea510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b322a7204fc4d73a3e09798ac713a53/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy welcomed Western leaders to Kyiv Saturday to mark the second anniversary of Russia's full-scale invasion, as Ukrainian forces run low on ammunition and weaponry and foreign aid hangs in the balance.",
      "publishedAt": "2024-02-24T05:59:52Z",
      "title": "Zelenskyy hosts Western leaders in Kyiv as Ukraine marks 2 years since Russia's full-scale invasion",
      "url": "https://apnews.com/65088ba9eb9bd729cf8c677e2115cb35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd609c302f1548fdabbcb8779a80a4d9/2953.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and KIMBERLEE KRUESI",
      "description": "COLUMBUS, Ohio (AP) — The resignation letter was short and direct.“I can no longer be under an oath to uphold the New Constitution of Ohio,\" wrote Sabrina Warner in her letter announcing she was stepping down from the state's Republican central committee.",
      "publishedAt": "2024-02-24T13:56:04Z",
      "title": "Oaths and pledges have been routine for political officials. That's changing in a polarized America",
      "url": "https://apnews.com/26682555293bdac60a9cb3d926b2a7bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdc62a69ab5d4562b2ddcece7a692e68/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "COLUMBIA, S.C. (AP) — Former President Donald Trump claimed Friday that his four criminal indictments have boosted his support among Black Americans because they see him as a victim of discrimination, comparing his legal jeopardy to the historic legacy of anti-Black prejudice in the U.S.",
      "publishedAt": "2024-02-24T03:51:19Z",
      "title": "Trump says his criminal indictments boosted his appeal to Black voters",
      "url": "https://apnews.com/aa1155c31bfc3b397a32b33eff04ada8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2a63583285342bc9bf5575c135be696/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A court filing Friday uses cellphone location data to try to raise questions about the testimony given by a special prosecutor in the Georgia election interference case against former President Donald Trump who had a romantic relationship with Fulton County District Attorney Fani Willis.",
      "publishedAt": "2024-02-23T20:03:57Z",
      "title": "Cellphone data cited in court filing raises questions about testimony on Fani Willis relationship",
      "url": "https://apnews.com/598e8e55eafff34ba17c2267d55a24cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a00e59a9a8b6488cafc3c88d52d03efc/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and GEOFF MULVIHILL",
      "description": "TOPEKA, Kan. (AP) — The recent Alabama Supreme Court ruling that frozen embryos are legally protected children is highlighting how support for the idea that a fetus should have the same rights as a person underpins far less dramatic laws and proposals from abortion foes across the U.S.",
      "publishedAt": "2024-02-24T06:06:45Z",
      "title": "Alabama IVF ruling puts spotlight on state plans for tax breaks and child support for fetuses",
      "url": "https://apnews.com/ffe4f4d326469a97fef999254ca86eea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3c95cea7be24a0ea8264832fb8400c9/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French President Emmanuel Macron was greeted with boos and whistles at the opening of the Paris Agricultural Fair on Saturday by angry farmers who blame him for not doing enough to support them.",
      "publishedAt": "2024-02-24T15:18:27Z",
      "title": "Macron booed by French farmers who blame him for not doing enough to support agriculture",
      "url": "https://apnews.com/6fada213cc3528aa634c880651e59a97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6147ed3d701e4f6fbdd4c8ddbd3082f3/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Warren Buffett credited his longtime partner — the late Charlie Munger — with being the architect of the Berkshire Hathaway conglomerate he's received the credit for leading and warned shareholders in his annual letter Saturday not to listen to Wall Street pundits or financial advisors who urge them to trade often.",
      "publishedAt": "2024-02-24T14:08:46Z",
      "title": "In his annual letter, Warren Buffett tells investors to ignore Wall Street pundits",
      "url": "https://apnews.com/41d58fcfe54fa1eba8f5492aac0542a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb539bd175ca4f38a445d751a45ca166/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN JUAN, Puerto Rico (AP) — Authorities in the eastern Caribbean said they were trying to locate two people believed to be U.S. citizens who were aboard a yacht that was hijacked by three escaped prisoners from Grenada.",
      "publishedAt": "2024-02-24T16:25:25Z",
      "title": "Caribbean officials search for 2 people aboard a yacht they say was hijacked by 3 escaped prisoners",
      "url": "https://apnews.com/f8752c4f9a7f936a78cff2e7c3733cda",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}