{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The wreckage goes on for block after devastated block. The smell is sickening. Every day, hundreds of people claw through tons of rubble with shovels and iron bars and their bare hands.",
      "publishedAt": "2023-11-17T04:20:40Z",
      "title": "Thousands of bodies lie buried in rubble in Gaza. Families dig to retrieve them, often by hand",
      "url": "https://apnews.com/89c0e8d0934d573d94d2fbfeba44d933",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9246f90623134d47a46b1ceeceff956f/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and DAVID RISING",
      "description": "RAFAH, Gaza Strip (AP) — Communications systems in the Gaza Strip were down for a second day Friday with no fuel to power the internet and phone networks, causing aid agencies to halt cross-border deliveries of humanitarian supplies even as they warned people may soon face starvation.",
      "publishedAt": "2023-11-17T08:30:09Z",
      "title": "Aid to Gaza halted with communications down for a second day, as food and water supplies dwindle",
      "url": "https://apnews.com/1811384fac6394329dd71e3aaf461eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2745933f1a4b1998593291cd181bf6/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA and SAM McNEIL",
      "description": "Abbey Onn lost her aunt and a young cousin when Hamas attackers rampaged through Kibbutz Nir Oz on Oct. 7. Now Onn is worried about what will happen to three other family members taken hostage that day as Israel pounds Gaza City in a bid to end Hamas’ control of the Gaza Strip.",
      "publishedAt": "2023-11-17T05:33:35Z",
      "title": "'Bring them home': As the battle for Gaza rages, hostage families wait with trepidation",
      "url": "https://apnews.com/9d4f1c996aaf5d66925c6a4e82a0076c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81dc30c5c18b473aac5ff689201d8265/2000.jpeg"
    },
    {
      "author": "AAMER MADHANI, DIDI TANG and CHRIS MEGERIAN",
      "description": "SAN FRANCISCO (AP) — Sometimes it can be easy to forget that President Joe Biden's original foreign policy priority was reasserting American influence in Asia. After all, that was before Russian tanks tried to blitz Ukraine, and before Israel and Hamas descended into a fresh round of bloody fighting.",
      "publishedAt": "2023-11-17T06:24:28Z",
      "title": "Biden seizes a chance to refocus on Asia as wars rage in Europe and the Mideast",
      "url": "https://apnews.com/fdccd6282fb32eceddec794349052fd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bbe859c259c4b2b93c886605796f5c3/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "SAN FRANCISCO (AP) — President Joe Biden on Thursday signed a temporary spending bill a day before a potential government shutdown, pushing a fight with congressional Republicans over the federal budget into the new year, as wartime aid for Ukraine and Israel remains stalled.",
      "publishedAt": "2023-11-17T06:35:21Z",
      "title": "Biden signs temporary spending bill averting government shutdown, pushing budget fight into new year",
      "url": "https://apnews.com/527c15d86de31470d1d659387912e66c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c2bcfa9c95f457ca2574e6de0492e66/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The Republicans battling to be the alternative to former President Donald Trump will come together for what an influential Christian organization in Iowa is billing as a friendly conversation on politics and their world views.",
      "publishedAt": "2023-11-17T05:06:39Z",
      "title": "DeSantis, Haley and Ramaswamy will meet in Iowa for a 'family discussion' on politics",
      "url": "https://apnews.com/805c24ebcf92a622a60ee3461616032e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a08b320ef2124422b268e56db084cf47/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Turkish President Recep Tayyip Erdogan set off for Germany Friday on a short visit overshadowed by the two countries' very different stances on the war between Israel and Hamas.",
      "publishedAt": "2023-11-17T05:10:39Z",
      "title": "Turkey's Erdogan to visit Germany as differences over the Israel-Hamas war widen",
      "url": "https://apnews.com/fd32a94ec8ab90a70710e23824e4e5ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10b39e1953444372831b34ae0608ea39/2000.jpeg"
    },
    {
      "author": "EVENS SANON and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The bullets began piercing the windows of the hospital as women cradling young children ran from room to room searching for a safe place to hide while the heavily armed gang drew closer.",
      "publishedAt": "2023-11-17T05:27:27Z",
      "title": "Gang attack on Haitian hospital leads to a call for help and an unlikely triumph for police",
      "url": "https://apnews.com/4ac9bae806ced9265531ec3e9a72ac7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb55dcf285564d94805c16302fab138e/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI",
      "description": "CIUDAD EVITA, Argentina (AP) — As Argentina heads for a presidential runoff election on Sunday, the decades-old populist movement known as Peronism is on shaky ground, its candidate having lost some traction even among longtime loyalists living in a suburb of the capital that is its literal and figurative embodiment.",
      "publishedAt": "2023-11-17T05:22:26Z",
      "title": "Argentina's Peronist machine is in high gear to shore up shaky votes before the presidential runoff",
      "url": "https://apnews.com/f5db5a92328f4316384ff6e0092c5272",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb8873b2918e4c7aa97c34a3a5f91ccc/3000.jpeg"
    },
    {
      "author": "SCOTT McFETRIDGE",
      "description": "ROSSTON, Texas (AP) — The cattle part as Meredith Ellis edges her small four-wheeler through the herd, silently counting the cows and their calves. It’s the way she starts most days on her 3,000-acre Texas ranch: ensuring all the cattle are safe, deciding when they should move to another pasture, and checking that the grass is as healthy as her animals.",
      "publishedAt": "2023-11-16T15:50:16Z",
      "title": "Beef is a way of life in Texas, but it's hard on the planet. This rancher thinks she can change that",
      "url": "https://apnews.com/9acdd8428029a83dc3c5bf71e817d425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e919e06294c491b86922d74cc534c3c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}