{
  "articles": [
    {
      "author": "Matthew Lee, Aamer Madhani",
      "description": "President Donald Trump and French President Emmanuel Macron are starting their day by taking part in a virtual meeting with fellow leaders of the Group of Seven economies to discuss Russia's war in Ukraine. Trump welcomed Macron to the White House on Monday at a moment of deep uncertainty about the future of transatlantic relations. The Republican meets with British Prime Minister Keir Starmer on Thursday. Trump has transformed American foreign policy and effectively tuned out European leadership as he looks to quickly end the war. The “America First” president has cast a shadow over what veteran U.S. diplomats and ex-government officials had regarded as America’s calming presence of global stability.",
      "publishedAt": "2025-02-24T05:02:06Z",
      "title": "Trump meets Macron as uncertainty grows about US ties to Europe and Ukraine",
      "url": "https://apnews.com/article/trump-macron-ukraine-russia-starmer-8869d05f2cd8db5da277dd927cf959d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb72087/2147483647/strip/true/crop/4576x2574+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F96%2Fef70452e530099d7ff0fdad87a51%2F4924916f737f43149c764561aff1d36c"
    },
    {
      "author": "Edith M. Lederer",
      "description": "In a dramatic shift in transatlantic relations under President Donald Trump, the United States has split with its European allies by refusing to blame Russia for its invasion of Ukraine in votes on three U.N. resolutions seeking an end to the three-year war. In the U.N. General Assembly, the U.S. joined Russia in voting against a Europe-backed Ukrainian resolution that calls out Moscow’s aggression and demands an immediate withdrawal of Russian troops. The U.S. then abstained from voting on its own competing resolution after Europeans. led by France, succeeded in amending it to make clear Russia was the aggressor. The voting was taking place as Trump was hosting French President Emmanuel Macron in Washington. A third vote took place in the U.N. Security Council.",
      "publishedAt": "2025-02-24T05:07:52Z",
      "title": "US refuses to blame Russia for Ukraine war, splitting with European allies in UN votes",
      "url": "https://apnews.com/article/un-russia-ukraine-war-resolution-trump-zelenskyy-cde221e5850196776525403e788c272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/735819f/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fa3%2Fac8c06cd4f1215b25c418d67817a%2Fd1b524af3bbe4adeb5503f4dcb614828"
    },
    {
      "author": null,
      "description": "A dozen leaders from Europe and Canada arrived in Ukraine’s capital by train Monday morning to mark the third anniversary of Russia’s invasion. The visitors were greeted at the station by Ukrainian Foreign Minister Andrii Sybiha and the president’s chief of staff Andrii Yermak. Among them were European Commission President Ursula von der Leyen and Canadian Prime Minister Justin Trudeau. Von der Leyen wrote on social media that Europe's destiny was at stake. The guests were set to attend events dedicated to the anniversary and discuss supporting Ukraine amid a recent U.S. policy shift under President Donald Trump.",
      "publishedAt": "2025-02-24T06:32:17Z",
      "title": "Foreign leaders visit Ukraine's capital to mark third war anniversary",
      "url": "https://apnews.com/article/russia-ukraine-war-anniversary-84e4c62519fc15b34e17f661cf3dd20e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d41efa0/2147483647/strip/true/crop/6889x3875+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fad%2F065b365e7b2ab1dbefa1d23dc59c%2F72d93c5e7f7a4a31a2243ec36b3a9567"
    },
    {
      "author": "Samya Kullab",
      "description": "Ukraine has offered to strike a deal with U.S. President Donald Trump for continued American military aid in exchange for developing Ukraine’s mineral industry. It could provide a valuable source of the rare earth elements that are essential for many kinds of technology. Trump said that he wanted such a deal earlier this month. It was initially proposed last fall by Ukrainian President Volodymyr Zelenskyy as part of his plan to strengthen Kyiv’s hand in future negotiations with Moscow. After an initial rocky start, negotiations on a deal are gaining traction.",
      "publishedAt": "2025-02-11T05:17:40Z",
      "title": "The US and Ukraine are closing in on a mineral deal. What changed, and what comes next?",
      "url": "https://apnews.com/article/russia-ukraine-war-rare-earth-elements-trump-6a4a95d4370a2e46a81ce4a3a352bf8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "The Supreme Court has declined to hear a pair of cases from abortion opponents who say laws limiting anti-abortion demonstrations near clinics violate their First Amendment rights. The high court turned down the appeals in orders handed down Monday, though two conservative justices disagreed. Activists argued the laws barring people from protesting or trying to dissuade women from abortions should be struck down after the justices overturned Roe v. Wade. The cities defending the laws in Illinois and New Jersey said they were passed to address disturbing behavior from protesters outside of health care clinics.",
      "publishedAt": "2025-02-24T15:43:27Z",
      "title": "Supreme Court turns back challenges to laws keeping abortion opponents away from clinics, patients",
      "url": "https://apnews.com/article/supreme-court-abortion-buffer-zones-7979c3d747d7eab88f7e8b723397e768",
      "urlToImage": "https://dims.apnews.com/dims4/default/185178d/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Ff3%2F037f98fcb4f310f35173da606ec6%2F263d4bd9234b47c2ac293ee41794f771"
    },
    {
      "author": "Fatma Khaled, Abdel Kareem Hana",
      "description": "Palestinians who returned to their homes in northern Gaza after the ceasefire began on Jan. 19 are still struggling to find shelter, food, water and other necessities. Many were initially overjoyed at the prospect of safety and return, only to be shocked by the mass destruction. The United Nations says humanitarian agencies have recently stepped up services, setting up free kitchens and water delivery stations, and distributing tents and tarps to hundreds of thousands across Gaza. A 20-year-old student from Gaza city said that the \"worst part is that we’re just now grasping that we lost it all.”",
      "publishedAt": "2025-02-25T05:13:09Z",
      "title": "Palestinians struggle to restart their lives in the ruins of Gaza",
      "url": "https://apnews.com/article/gaza-war-israeli-army-ceasefire-b46d188e65fb3082ed6469500d586e6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1c6acf/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F1e%2Ffc5c2f49724c327b75dd5def26a5%2F702f89e3d46a4d34a00fe620912ccb27"
    },
    {
      "author": "Susan Montoya Bryan",
      "description": "Do more U.S. airports need control towers? That's one of the questions that has arisen following a midair collision at an airport in southern Arizona last week. But experts say not having a tower at the Marana Regional Airport outside Tucson doesn’t mean it’s any less safe; pilots just have a different set of communication procedures to follow. Only about 10% of the public airports across the U.S. have air traffic control towers. Those usually are the busiest airports, where operations are complex and traffic is heavy. At airports without towers, pilots rely on radio communications and the principal of “see and avoid” to ensure they can maneuver safely.",
      "publishedAt": "2025-02-25T05:12:24Z",
      "title": "A midair collision in Arizona prompts questions about air traffic control towers",
      "url": "https://apnews.com/article/midair-crash-arizona-air-traffic-control-towers-95eabcb512f6dfd98ede5193e1b428af",
      "urlToImage": "https://dims.apnews.com/dims4/default/58a2fdb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F0a%2Feec8edd138807df7ac15e0b637fe%2F4502eae0447749dabaa92c62c8c567d2"
    },
    {
      "author": "Nicole Winfield, Trisha Thomas",
      "description": "The Vatican says Pope Francis, who is hospitalized in critical condition with double pneumonia, was well enough to meet with the Vatican secretary of state and his deputy to approve new decrees for saints and call a formal meeting to set the dates for their canonization. The audience, which occurred Monday, signaled that the machinery of the Vatican is still grinding on, even with doctors warning Francis' prognosis is guarded. The Vatican’s Tuesday noon bulletin announced that Francis had approved decrees for two new saints and five people for beatification — a step on the road to becoming a saint. It said Francis had “decided to convene a consistory about the future canonizations.”",
      "publishedAt": "2025-02-25T07:44:59Z",
      "title": "Pope Francis meet with Vatican No. 2 over candidates for sainthood",
      "url": "https://apnews.com/article/vatican-pope-health-83b690c6d47679c37ae10329369fd480",
      "urlToImage": "https://dims.apnews.com/dims4/default/1042635/2147483647/strip/true/crop/4010x2256+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fb5%2F37f2fe2b485cf26fdb7a8e31b95c%2F475464ddb62d4b709fc1b6d665bbb859"
    },
    {
      "author": "Giovanna Dell' Orto",
      "description": "Thousands of people have gathered in St. Peter’s Square to pray for an ailing Pope Francis, expressing sorrow for his suffering, hope for his recovery and gratitude for his efforts to steer the Catholic Church in new directions. The 88-year-old Francis has pneumonia in both lungs and remains in critical condition despite showing a slight improvement after 11 days in the hospital. Still, the mood was mostly grim in the monumental square on Monday evening, with many understanding they may be in Rome for Francis’ final days. Crowds sat under umbrellas on folding chairs or stood by the vast colonnades as they reflected fondly on the pontiff’s legacy.",
      "publishedAt": "2025-02-25T05:43:57Z",
      "title": "Thousands gather outside the Vatican to pray for Pope Francis' health",
      "url": "https://apnews.com/article/pope-francis-vatican-prayers-st-peters-basilica-da6bb2016081ebfaf4328834c1afd5e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/096b9ff/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Ff7%2F378493fd866b8569779e4d92ad7e%2Fba11de71fffc4fbfabe7b7f34cf1e582"
    },
    {
      "author": "Ryan J. Foley",
      "description": "Nearly 40% of the federal contracts President Donald Trump's administration claims to have canceled as part of its signature cost-cutting program aren’t expected to save any money. Trump adviser Elon Musk's Department of Government Efficiency has published an initial list of 1,125 contracts it terminated in recent weeks across the federal government. Data published on DOGE’s “Wall of Receipts” shows more than one-third of the contract cancellations are expected to yield no savings. That’s usually because the government has a legal requirement to spend the funds for the goods or services it purchased and in many cases has already done so. The Republican administration says it's targeting fraud, waste and abuse in the government.",
      "publishedAt": "2025-02-25T05:02:04Z",
      "title": "Nearly 40% of contracts canceled by Musk's DOGE are expected to produce no savings",
      "url": "https://apnews.com/article/doge-federal-contracts-canceled-musk-trump-cuts-a65976a725412934ad686389889db0df",
      "urlToImage": "https://dims.apnews.com/dims4/default/11a6683/2147483647/strip/true/crop/5652x3179+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fe6%2F439a649c9a50ff9359fa4f6cecee%2F1eff1afab62b4509a42b13865bcff8a6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}