{
  "articles": [
    {
      "author": "Associated Press",
      "description": "Former President Joe Biden's office says he has been diagnosed with prostate cancer. Biden was seen last week by doctors after urinary symptoms and a prostate nodule was found. He was diagnosed with prostate cancer on Friday, with the cancer cells having spread to the bone. His office said Sunday this represents a more aggressive form of the disease, but the cancer appears to be hormone-sensitive, which allows for effective management. Biden and his family are reviewing treatment options with his physicians.",
      "publishedAt": "2025-05-18T20:13:09Z",
      "title": "Biden has been diagnosed with prostate cancer",
      "url": "https://apnews.com/article/biden-cancer-prostate-be18c98abe341cd91277e1d3b75d5cd5",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ef1f41/2147483647/strip/true/crop/4828x2716+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F10%2Fb1239df1b48274b584129c03d869%2F5c1ed08747fe4151b02fe7c14ad07f7b"
    },
    {
      "author": null,
      "description": "Hospitals and medics in the Gaza Strip say Israeli strikes across the Palestinian enclave killed at least 66 people overnight and into Sunday. The hospitals and medics said women and children were among the dead. The bloodshed came as Israel launches an escalation of its war in Gaza, which it says is meant to ramp up pressure on Hamas to agree to a temporary ceasefire. The Israeli military had no immediate comment.",
      "publishedAt": "2025-05-18T06:47:32Z",
      "title": "Israeli strikes across Gaza kill at least 66 people",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-hostages-18-05-2025-f325044576f1ac31e6083622242c9990",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump is hoping separate phone calls with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelenskyy will make progress toward a ceasefire in the war in Ukraine. Trump expressed his hopes for a “productive day” Monday — and a ceasefire — in a social media post over the weekend. His effort will also include calls to NATO leaders. Trump has struggled to end a war that began with Russia’s invasion in 2022. That makes these conversations a serious test of his reputation as a dealmaker after having claimed he'd quickly settle the conflict once he was back in the White House, or even before he took office.",
      "publishedAt": "2025-05-19T04:01:42Z",
      "title": "Trump hopes for ceasefire progress in calls with Putin and Zelenskyy",
      "url": "https://apnews.com/article/trump-putin-zelenskyy-russia-ukraine-war-ceasefire-3ec4144fecac5d77c8bb33cc4d7018ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/03cc8c5/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Ff2%2F552e60b4fad1a60f7b08d5232f62%2F8da03f70b5d7436fb54b1f0c251cc099"
    },
    {
      "author": "Kevin Freking, Lisa Mascaro",
      "description": "Republicans are looking to get their massive tax cut and border security package back on track. The House Budget Committee will hold a rare Sunday night committee meeting after that same panel voted against advancing the measure two days earlier. Speaker Mike Johnson is looking to reverse that setback, get the bill out of the committee and bring it to a vote in the full House before the end of the week. Deficit hawks joined with Democratic lawmakers on the budget panel in voting against reporting the measure to the full House. Five Republicans voted no, one on procedural grounds, the other four voicing concerns about the bill’s impact on federal budget deficits.",
      "publishedAt": "2025-05-18T18:23:43Z",
      "title": "Republicans look to get Trump's bill back on track with rare Sunday session",
      "url": "https://apnews.com/article/republicans-tax-cuts-house-trump-johnson-border-f03b7e9cc3015ef9a0ece37b76bc5f66",
      "urlToImage": "https://dims.apnews.com/dims4/default/7203264/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F8e%2F475cf6e86656faf089cb87250ff3%2F7d9f218510ba44b19f9e37a67a539690"
    },
    {
      "author": "Pan Pylas, Jill Lawless",
      "description": "The U.K. and the European Union are meeting in London to discuss closer ties in their first official summit since Brexit. The meeting on Monday between U.K. Prime Minister Keir Starmer and top EU officials is intended to pave the way to a new agreement between the two sides. There is hope a deal could improve the U.K. economy that has been hit by a drop in EU trade caused by increased costs and red tape after leaving the bloc in early 2020. Starmer has sought to reset EU relations after the U.K.’s Brexit vote in 2016.",
      "publishedAt": "2025-05-19T04:16:42Z",
      "title": "UK looks to reset EU relations 5 years after Brexit",
      "url": "https://apnews.com/article/uk-eu-summit-brexit-trade-3181228316c3d0cd736ecbf93a1eff43",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc7fc66/2147483647/strip/true/crop/5213x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F41%2F6effed9e7f10f695e605f5f80bbd%2F7be7d0e1be744b06a61e977cbb881137"
    },
    {
      "author": null,
      "description": "Officials have increased the reward for the capture of seven inmates who escaped from a New Orleans jail by fleeing through a hole behind a toilet. FBI Special Agent Jonathan Trapp said Sunday seven of the 10 men are still at large and the FBI is offering $10,000 per inmate. He said he believes members of the public may be aiding the men. They range in age from 19 to 42 and face a variety of charges including aggravated assault, domestic abuse battery and murder.",
      "publishedAt": "2025-05-18T18:21:00Z",
      "title": "Reward increased for capture of escaped New Orleans inmates as 7 remain on the lam",
      "url": "https://apnews.com/article/new-orleans-jail-10-escape-manhunt-68e971fc1a9b4e603f924ceebbdcb559",
      "urlToImage": "https://dims.apnews.com/dims4/default/17e690b/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fde%2F84e0bf0b9db0ae8c06fbf161e2ea%2F652014be299f4ff1985938ce26387db0"
    },
    {
      "author": "Matthew Brown, Carolyn Kaster",
      "description": "More severe storms are expected to roll across the central U.S. this week following the weather-related deaths of more than two dozen people. The National Weather Service says the hazardous weather will range from thunderstorms and potentially baseball-sized hail on the Plains to dangerous heat in the South and heavy mountain snow in the West. Areas at risk of thunderstorms include communities in Kentucky and Missouri that were hit by deadly tornadoes on Friday. At least 19 people were killed in Kentucky, seven in Missouri and two in Virginia.",
      "publishedAt": "2025-05-19T04:17:16Z",
      "title": "More storms take aim at central US, where many are digging out from tornado damage",
      "url": "https://apnews.com/article/severe-storms-plains-kentucky-tornado-weather-407499784e8562419f2770ff31d5d207",
      "urlToImage": "https://dims.apnews.com/dims4/default/241cc4d/2147483647/strip/true/crop/5870x3302+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F0e%2F1e799f691f1a1a191a9782b9323c%2Fcffabc48151645e2b6c3d25e02e48df4"
    },
    {
      "author": "Bruce Shipkowski, Christopher Weber",
      "description": "New Jersey Transit’s train engineers have reached a tentative deal to end their three-day strike that had halted service for some 100,000 daily riders, including routes to Newark airport and across the Hudson River to New York City. The union says the engineers and the transit agency came to an agreement Sunday and trains would resume running their regular schedules on Tuesday. The main sticking point had been achieving a wage increase for the engineers without creating a financially disastrous domino effect for the transit agency. It was the state’s first transit strike in over 40 years, forcing people who normally rely on New Jersey Transit to find alternative transport or consider staying home.",
      "publishedAt": "2025-05-18T23:01:55Z",
      "title": "New Jersey Transit train engineers reach tentative deal to end strike that halted NYC routes",
      "url": "https://apnews.com/article/new-jersey-transit-strike-train-engineers-ce62c978e268893bd15357daea5c5d47",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca6ce4a/2147483647/strip/true/crop/3409x1918+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F8e%2F032eeae45c17ffea41487dd0f24c%2F551c9be7c47140bc9e9b9248091053e4"
    },
    {
      "author": "Annika Hammerschlag",
      "description": "Increasingly severe cyclones, grazing by invasive goats, and persistent turmoil in Yemen have threatened the survival of the country's iconic dragon’s blood tree. Found only on the island of Socotra, these umbrella-shaped trees have long captured the imaginations of tourists. But protecting them has fallen to residents like Sena Keybani. Her family runs a small nursery for the trees. Scientists warn the species could disappear within centuries. For Socotra, losing the trees would mean losing both an ecosystem and a fragile economy.",
      "publishedAt": "2025-05-19T03:34:51Z",
      "title": "Climate change and grazing goats threaten the survival of these rare dragon's blood trees",
      "url": "https://apnews.com/article/dragons-blood-trees-climate-change-conservation-3968466a5ce2653e64a59b545ef94660",
      "urlToImage": "https://dims.apnews.com/dims4/default/ace9984/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F52%2F24427c4db7bb1a66ab5ef2a9f7f6%2F40f6d8c9a92e42f79bb1cf258da015e5"
    },
    {
      "author": "Doug Ferguson",
      "description": "Scottie Scheffler has won the PGA Championship for his third major title. He won by five shots but this one was a nail-biter until the final hour. Jon Rahm made a furious charge and tied Scheffler for the lead on the back nine. But then golf’s No. 1 player was mistake-free and left the blunders to everyone else. Scheffler shot a 71 and picked up the Wanamaker Trophy. That puts him halfway home to the career Grand Slam and leaves no doubt about his status in the game. Bryson DeChambeau was among three players who tied for second.",
      "publishedAt": "2025-05-18T23:01:18Z",
      "title": "Great Scottie! Scheffler pulls away to win PGA Championship for 3rd major title",
      "url": "https://apnews.com/article/scottie-scheffler-pga-championship-rahm-dechambeau-806e62df373a7fbc726b41deedeb5eb1",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f839eb/2147483647/strip/true/crop/3685x2073+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fe1%2F0045c564708786ec58825b54e261%2F4f93d532076d4042aa8e0a5b08c87948"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}