{
  "articles": [
    {
      "author": "Associated Press",
      "description": "MOSCOW (AP) — The mother of Russia’s top opposition leader Alexei Navalny said Thursday that she has seen her son's body and that she is resisting strong pressure by authorities to agree to a secret burial outside the public eye.",
      "publishedAt": "2024-02-22T09:53:55Z",
      "title": "Mother of Kremlin critic Navalny says she's resisting pressure to agree to a secret burial",
      "url": "https://apnews.com/d5f54cf2aec6892b489c0c0a3a847efc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3248ac47887141f88f7ddae01f2c22bb/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli strikes killed at least 48 people in southern and central Gaza overnight, half of them women and children, health officials said Thursday, as European foreign ministers and U.N.",
      "publishedAt": "2024-02-22T13:56:50Z",
      "title": "Israeli strikes in Gaza kill 48 as fears mount over humanitarian crisis and West Bank violence",
      "url": "https://apnews.com/e8687b7235d0ac066170f3e5a72ce544",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5894f110e3d41eeb13fe7162a265531/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and COLLEEN LONG",
      "description": "WASHINGTON (AP) — The White House is considering using provisions of federal immigration law repeatedly tapped by former President Donald Trump to unilaterally enact a sweeping crackdown at the southern border, according to three people familiar with the deliberations.",
      "publishedAt": "2024-02-22T01:06:40Z",
      "title": "White House weighing executive actions on the border — with immigration powers used by Trump",
      "url": "https://apnews.com/f0ca943f0f148e165bc6e8ebfd149f14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae234682a6f14ae58548b950df3d87ff/2117.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "BUFFALO, N.Y. (AP) — The way prosecutors tell it, Joseph Bongiovanni went to work for years with a “little dark secret.”Behind the veneer of a veteran U.S. Drug Enforcement Administration agent, they alleged, was a turncoat on the take from the Buffalo Mafia, offering an “umbrella of protection” that derailed investigations of his childhood friends, covered for a sex-trafficking strip club and even helped a connected high school English teacher keep his marijuana-growing side hustle.",
      "publishedAt": "2024-02-22T15:04:49Z",
      "title": "'Little dark secret': DEA agent on trial accused of taking $250K in bribes from Mafia",
      "url": "https://apnews.com/bfa546895215ba235a770b17af9e6256",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5697a21637094575b38fb388781d12a6/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump could be at risk of losing some of his prized properties if he can’t pay his staggering New York civil fraud penalty. With interest, he owes the state nearly $454 million — and the amount is going up $87,502 each day until he pays.",
      "publishedAt": "2024-02-22T05:06:11Z",
      "title": "New York AG says she’ll seize Donald Trump’s property if he can’t pay $454 million civil fraud debt",
      "url": "https://apnews.com/63e643d0fe098cc1ac178c003f21a40d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f34bbb8eacc24fcdb21fe679d5f03878/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels set a ship ablaze in the Gulf of Aden on Thursday as Israel intercepted what appeared to be another Houthi attack near the port city of Eilat, authorities said.",
      "publishedAt": "2024-02-22T06:08:12Z",
      "title": "Suspected Houthi rebel missile sets cargo ship ablaze. Israel intercepts separate attack near Eilat",
      "url": "https://apnews.com/216c0bde5f79ed857f1f5ef7f157a66b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4cb0423cbef414caf3cdfd2adba7608/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and JOEY CAPPELLETTI",
      "description": "WATERFORD TOWNSHIP, Mich. (AP) — The Michigan Republican Party was deep in debt when a longtime party donor who had given more than $1 million over the past decade asked for a meeting with its chairwoman.",
      "publishedAt": "2024-02-22T15:24:44Z",
      "title": "Dueling pro-Trump factions in Michigan throw the swing state's Republicans into disarray",
      "url": "https://apnews.com/88d110d19ee2927a83844b9587b7148c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ba6476bff264555ae80bc20da950396/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama's largest hospital paused in vitro fertilization treatments Wednesday as providers and patients across the state scrambled to assess the impact of a court ruling that said frozen embryos are the legal equivalent of children.",
      "publishedAt": "2024-02-21T20:48:13Z",
      "title": "Alabama hospital puts pause on IVF in wake of ruling saying frozen embryos are children",
      "url": "https://apnews.com/4cf5d3139e1a6cbc62bc5ad9946cc1b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3421ed9c6281451d97d931c8776370a7/3000.jpeg"
    },
    {
      "author": "FRANK BAJAK and DAKE KANG",
      "description": "Chinese police are investigating an unauthorized and highly unusual online dump of documents from a private security contractor linked to the nation's top policing agency and other parts of its government — a trove that catalogs apparent hacking activity and tools to spy on both Chinese and foreigners.",
      "publishedAt": "2024-02-21T19:29:41Z",
      "title": "An online dump of Chinese hacking documents offers a rare window into pervasive state surveillance",
      "url": "https://apnews.com/aac38c75f268b72910a94881ccbb77cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87e1ff6f878742c58e935429ba8de08a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and SUSIE BLANN",
      "description": "LYMAN, Ukraine (AP) — When the Russian army mounted a full-scale invasion two years ago, Ukrainian men zealously rushed to recruitment centers across the country to enlist, ready to die in defense of their nation.",
      "publishedAt": "2024-02-22T05:17:43Z",
      "title": "Desperate for soldiers, Ukraine weighs unpopular plan to expand the draft",
      "url": "https://apnews.com/b2ca1d0ecd72019be2217a653989fbc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32cfe86dfc2a40aca048bb8d1a7e2199/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}