{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Spirit Airlines files for bankruptcy protection as financial losses pile up and debt payments loom.",
      "publishedAt": "2024-11-18T10:42:47Z",
      "title": "Spirit Airlines files for bankruptcy protection as financial losses pile up and debt payments loom",
      "url": "https://apnews.com/40283851fdc1c810f55bf5b9a1129555",
      "urlToImage": ""
    },
    {
      "author": "SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — A Russian ballistic missile with cluster munitions struck a residential area of a northern Ukraine city, killing 11 people including two children and injuring 84 others, officials said Monday.",
      "publishedAt": "2024-11-18T09:39:19Z",
      "title": "A Russian ballistic missile with cluster munitions kills 11 people and injures 84 in Ukraine's north",
      "url": "https://apnews.com/5cd4f9fe2cee1ae8aed67d63c22b0703",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13d55e9ef6154993ac701d64a3ea47f3/2000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Before Russia’s invasion, this was an ordinary green lawn in the heart of Ukraine’s capital. Tourists would visit to take photos, and locals would stroll there on weekends.But 1,000 days of war have transformed it into a makeshift memorial, dotted with blue-and-yellow flags — each honoring a soldier who died fighting Russia.",
      "publishedAt": "2024-11-18T05:15:38Z",
      "title": "A makeshift memorial grows in Ukraine’s capital after 1,000 days of war",
      "url": "https://apnews.com/825f56c9c80c0906b3dc7d0cc3eba959",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b24134b4e5be43c9a470af48a57b8f41/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes on the Gaza Strip killed eight people, including two children aged 7 and 9 and their parents, Palestinian officials said Monday. A third child, 10 years old, was wounded in an overnight strike on a tent where displaced people were sheltering in the southern city of Khan Younis, according to the Civil Defense, first responders who operate under the Hamas-run government.",
      "publishedAt": "2024-11-18T09:03:23Z",
      "title": "Middle East latest: Children and parents among 8 killed in Israeli strikes in Gaza, officials say",
      "url": "https://apnews.com/f8b998f646051a1ef19303b51225a7ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea657e39e3de4bc4a396b83c3ca7c48d/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Just a week after winning a majority of the vote in several of the nation’s largest Arab-majority cities, President-elect Donald Trump has filled top administration posts with staunch Israel supporters, including an ambassador to Israel who has claimed “there is no such thing as Palestinians.”",
      "publishedAt": "2024-11-18T05:14:16Z",
      "title": "Some Arab Americans who voted for Trump are concerned about his picks for key positions",
      "url": "https://apnews.com/677003f64d0a255a0f6f95c3a2a1b9db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fd5a9a6f1048de81d1cb56261cf7ab/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES and MAURICIO SAVARESE",
      "description": "RIO DE JANEIRO (AP) — With Brazil preparing to host the Group of 20 summit, it appears unlikely the leading rich and developing nations will sign on to a meaningful declaration regarding geopolitics: The meeting Monday and Tuesday in Rio de Janeiro is overshadowed by two major wars and Donald Trump's recent election victory.",
      "publishedAt": "2024-11-18T05:05:14Z",
      "title": "Brazil hosts a G20 summit overshadowed by wars and Trump's return, aiming for a deal to fight hunger",
      "url": "https://apnews.com/12f7a09b8f79229509de52c92c0a074c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb188e71197348069f7a6fee295e7f61/1920.jpeg"
    },
    {
      "author": "SIBI ARASU, MELINA WALLING and SETH BORENSTEIN",
      "description": "BAKU, Azerbaijan (AP) — United Nations climate talks resumed Monday with negotiators urged to make progress on a deal that could see developing countries get more money to spend on clean energy and adapting to climate-charged weather extremes.",
      "publishedAt": "2024-11-18T06:04:27Z",
      "title": "At climate summit in Baku, negotiators are urged to get down to business as talks enter second week",
      "url": "https://apnews.com/13f4acd0d1675b57250741f457dcdfd0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05db1c78d7bd48ddbb7d4c1b7ac4d10c/3000.jpeg"
    },
    {
      "author": "MANISH SWARUP and RISHI LEKHI",
      "description": "NEW DELHI (AP) — Authorities in India’s capital shut schools, halted construction and banned non-essential trucks from entering the city on Monday after air pollution shot up to its worst level this season.",
      "publishedAt": "2024-11-18T05:32:16Z",
      "title": "India's capital chokes as air pollution levels hit 50 times the safe limit",
      "url": "https://apnews.com/ae1ec1e6292009db198f18b113047cd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f061f1afae8348cfbe9ac5af654aa794/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Typhoon Man-yi left at least seven people dead in a landslide, destroyed scores of houses and displaced large numbers of villagers before blowing away from the northern Philippines, worsening the crisis wreaked by multiple back-to-back storms, officials said Monday.",
      "publishedAt": "2024-11-18T05:48:47Z",
      "title": "Typhoon Man-yi leaves 7 dead in landslide in Philippines and worsens crisis from back-to-back storms",
      "url": "https://apnews.com/04db73a5ee97fed4fbf12c342c4e7bb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/471c39c7f7a3481ab124c0f2d6343049/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Spirit Airlines said Monday that it has filed for bankruptcy protection and will attempt to reboot as it struggles to recover from the pandemic-caused swoon in travel and a failed attempt to sell the airline to JetBlue.",
      "publishedAt": "2024-11-18T10:44:47Z",
      "title": "Spirit Airlines files for bankruptcy as financial losses pile up and debt payments loom",
      "url": "https://apnews.com/782c7fb892adf1d2f366411bab955668",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0d1faa5c1d246de9432c7d4f45f28ec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}