{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Sweden officially joins NATO after completing its accession process, ending decades of post-WWII neutrality.",
      "publishedAt": "2024-03-07T16:28:36Z",
      "title": "Sweden officially joins NATO after completing its accession process, ending decades of post-WWII neutrality",
      "url": "https://apnews.com/9e952fd6fb594e04512ae503b6cde50d",
      "urlToImage": ""
    },
    {
      "author": "SAMY MAGDY and ABBY SEWELL",
      "description": "CAIRO (AP) — Hamas said Thursday that its delegation has left Cairo and that talks on a Gaza cease-fire and hostage release will resume next week, making it extremely unlikely that mediators will broker a deal before the Muslim holy month of Ramadan.",
      "publishedAt": "2024-03-07T11:22:43Z",
      "title": "Hamas says cease-fire talks to resume next week, making a truce before Ramadan highly unlikely",
      "url": "https://apnews.com/5657eedc005040694a9ab935ce3e39e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3524d975bc65473184fa1f8f7c897d76/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is set to use his State of the Union address Thursday to promote his vision for a second term to a dispirited electorate who question whether he's up to the job and to warn that GOP front-runner Donald Trump would be a dangerous alternative.",
      "publishedAt": "2024-03-07T05:03:44Z",
      "title": "It's not just what Biden will say in State of the Union address, but how",
      "url": "https://apnews.com/1a42ff9d4ef3e0f2753e43ac8d39fc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8977b0e34a64947ab8eb2bf3f66c5e4/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The invitation list for President Joe Biden's State of the Union address on Thursday speaks volumes about what Democrats and Republicans want to focus on as the 2024 election season heats up.",
      "publishedAt": "2024-03-07T10:04:26Z",
      "title": "State of the Union guests spotlight divide on abortion and immigration but offer some rare unity",
      "url": "https://apnews.com/003c5da894f9fd7af2c8289a267ac7b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d90fdc8676547eaaf4e51350fef1e7d/3000.jpeg"
    },
    {
      "author": "BILL BARROW and WILL WEISSERT",
      "description": "ATLANTA (AP) — Joe Biden and Donald Trump each won the White House by razor-thin margins in key states.",
      "publishedAt": "2024-03-07T05:11:18Z",
      "title": "Seven states and events miles apart: How the Trump and Biden campaigns approach a rematch",
      "url": "https://apnews.com/c02530a6e86e63f72eb6a616c16b0b4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/603576ecb1f240a4aad85faa4816e5e4/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "Power lines ignited massive wildfires across the Texas Panhandle that destroyed homes and killed thousands of livestock, officials said Thursday, including the largest blaze in state history that the utility provider Xcel Energy said its equipment appeared to have sparked.",
      "publishedAt": "2024-03-07T15:14:36Z",
      "title": "Power lines ignited the largest wildfire in Texas history, officials say",
      "url": "https://apnews.com/22540df0a0c1d2c42a7fe0284858845a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e9803b808fe49e09250bebc7bdd840b/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LORNE COOK",
      "description": "WASHINGTON (AP) — Sweden on Thursday formally joined NATO as the 32nd member of the transatlantic military alliance, ending decades of post-World War II neutrality as concerns about Russian aggression in Europe have spiked following Russia’s 2022 invasion of Ukraine.",
      "publishedAt": "2024-03-07T16:29:28Z",
      "title": "Sweden officially joins NATO, ending decades of post-World War II neutrality",
      "url": "https://apnews.com/8372bc866c8ddcf42d2b8209fa5cd2b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c7720b22a254541afae53e1dc347bc0/3000.jpeg"
    },
    {
      "author": "GIOVANNA DELL'ORTO",
      "description": "MIAMI (AP) — Christian voters and faith leaders have long been in the frontlines of providing assistance to migrants — but when it comes to support for immigration policies, from border security to legalization options for migrants already in the U.S., priorities diverge broadly.",
      "publishedAt": "2024-03-07T13:15:06Z",
      "title": "Many Christian voters in US see immigration as a crisis. How to address it is where they differ.",
      "url": "https://apnews.com/3c0a48d4ce37baa8d9e05786716a7b00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa47d850fd3340a78298cdcf0d7c7cd3/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Millions of Americans who have dropped pounds and boosted their health using popular obesity drugs like Wegovy are facing a new dilemma: What happens if they stop taking them?Many worry, rightly, that they’ll regain weight and revert to old habits.",
      "publishedAt": "2024-03-07T06:01:34Z",
      "title": "Weight-loss drugs like Wegovy are meant for long-term use. Some patients want to stop",
      "url": "https://apnews.com/0d2b4e3f055dfd1b02a1d330db805c52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30e7cf9c14a0406d95e463a4da2f6e99/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — More than a quarter of female Black voters describe abortion as their top issue in this year's presidential election, a poll out Thursday from health policy research firm KFF reveals.",
      "publishedAt": "2024-03-07T11:42:12Z",
      "title": "More Black women say abortion is their top issue in the 2024 election, a survey finds",
      "url": "https://apnews.com/da88c34a9390732b89f25c9c11f262f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3042070f0e614691ac021053616a7b4e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}