{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — As a former and potentially future president, Donald Trump hailed what would become Project 2025 as a road map for “exactly what our movement will do” with another crack at the White House.",
      "publishedAt": "2024-11-23T22:22:16Z",
      "title": "After Trump's Project 2025 denials, he is tapping its authors and influencers for key roles",
      "url": "https://apnews.com/843f5ff20131ccba5f056e7ccc5baf23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7f97bc6c48a426cb5263cdd653f6c53/3000.jpeg"
    },
    {
      "author": "BILL BARROW, ADRIANA GOMEZ LICON and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Saturday that he will nominate former White House aide Brooke Rollins to be his agriculture secretary, the last of his picks to lead executive agencies and another choice from within his established circle of advisers and allies.",
      "publishedAt": "2024-11-23T21:28:03Z",
      "title": "Trump taps Rollins as agriculture chief, completing proposed slate of Cabinet secretaries",
      "url": "https://apnews.com/75911e79188c48e27d6c3c12f1a58e80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a622ff2b80f4818a637d232533c567a/2773.jpeg"
    },
    {
      "author": "JOSH BOAK and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Working-class voters helped Republicans make steady election gains this year and expanded a coalition that increasingly includes rank-and-file union members, a political shift spotlighting one of President-elect Donald Trump’s latest Cabinet picks: a GOP congresswoman, who has drawn labor support, to be his labor secretary.",
      "publishedAt": "2024-11-23T21:36:35Z",
      "title": "Trump's Republican Party is increasingly winning union voters. It's a shift seen in his labor pick",
      "url": "https://apnews.com/1bff41e4caef610dbf38ead24d292e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23610259b35845fbad6e31ae56a89126/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and BASSEM MROUE",
      "description": "BEIRUT, Lebanon (AP) — Israeli airstrikes Saturday in central Beirut killed at least 20 people, officials said, as the once-rare attacks on the heart of Lebanon's capital continued without warning while diplomats scrambled to broker a cease-fire.",
      "publishedAt": "2024-11-23T08:51:22Z",
      "title": "Israeli strikes in central Beirut kill at least 20 as diplomats push for a cease-fire",
      "url": "https://apnews.com/60f383ef1f42ff9928770a77d27ec4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c31c0067397425787556d3f98953cb0/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — This past week has seen the most significant escalation in hostilities that Ukraine has witnessed since Russia's full-scale invasion and marks a new chapter in the nearly three-year war — one tinged with uncertainty and fear.",
      "publishedAt": "2024-11-23T11:32:09Z",
      "title": "The week that upped the stakes of the Ukraine war",
      "url": "https://apnews.com/0555d1af20edcb8dcf8aef47d868db22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd8da0dcb594a22b03bfe16ea9946d9/1280.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, SIBI ARASU, MELINA WALLING and MICHAEL PHILLIS",
      "description": "BAKU, Azerbaijan (AP) — United Nations climate talks adopted a deal to inject at least $300 billion annually in humanity’s fight against climate change, aimed at helping developing nations cope with the ravages of global warming in tense negotiations.",
      "publishedAt": "2024-11-23T04:16:41Z",
      "title": "A $300B a year deal for climate cash at UN summit sparks outrage for some and hope for others",
      "url": "https://apnews.com/8ab629945660ee97d58cdbef10136f35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ecb1baf658c4d149e4a354f93347826/2845.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Philippine Vice President Sara Duterte said Saturday she has contracted an assassin to kill the president, his wife and the House of Representatives speaker if she herself is killed, in a brazen public threat that she warned was not a joke.",
      "publishedAt": "2024-11-23T07:54:21Z",
      "title": "The Philippine vice president publicly threatens to have the president assassinated",
      "url": "https://apnews.com/0946ce72c2475b58a2daf54efa32fe45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5f8f901503547ecb43c05e3c2e048ba/3000.jpeg"
    },
    {
      "author": "GODOFREDO A. VASQUEZ and OLGA R. RODRIGUEZ",
      "description": "WINDSOR, Calif. (AP) — Forecasters warned over the weekend that another round of winter weather could complicate travel leading up to Thanksgiving in parts of the U.S. In California, where a person was found dead in a vehicle submerged in floodwaters on Saturday, authorities braced for more precipitation while still grappling with flooding and small landslides from a previous storm.",
      "publishedAt": "2024-11-23T06:01:21Z",
      "title": "Will a winter storm hit the US over Thanksgiving week? Here's what forecasts show so far",
      "url": "https://apnews.com/e0b787685ad719b1a99c722658f484f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b905d4e9e6054ca9a01faea5493952f1/1920.jpeg"
    },
    {
      "author": "RIAZ KHAN",
      "description": "PESHAWAR, Pakistan (AP) — Fighting between armed Sunni and Shiite groups in northwestern Pakistan killed at least 37 people and injured 25 others, a senior police officer from the region said Saturday.",
      "publishedAt": "2024-11-23T07:16:35Z",
      "title": "Fighting between armed sectarian groups in restive northwestern Pakistan kills at least 37 people",
      "url": "https://apnews.com/aec6e365dd13de8e381740008fbd14b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b2826e8ccd24879b66e26899affa434/3000.jpeg"
    },
    {
      "author": "DYEPKAZAH SHIBAYAN",
      "description": "ABUJA, Nigeria (AP) — When Nigeria's President Bola Tinubu ended the costly subsidies that made petrol affordable for many in Africa's most populous country, Ahmed Halilu knew his e-hailing cab business in the capital, Abuja, was about to run into huge losses.",
      "publishedAt": "2024-11-24T04:16:01Z",
      "title": "Nigeria turns to natural gas as transport prices soar after petrol subsidies were removed",
      "url": "https://apnews.com/0f1e29ccb050a11dbd927777a3244af2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72a70afade904ca3b66537ccfde8b5d6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}