{
  "articles": [
    {
      "author": null,
      "description": "The House Oversight Committee has subpoenaed the Justice Department for files in the Jeffrey Epstein sex trafficking investigation and is seeking depositions with the Clintons and former law enforcement officials. It's part of a congressional probe lawmakers believe may show links to President Donald Trump and former top officials. The Republican-controlled committee issued subpoenas for depositions with former President Bill Clinton, former Secretary of State Hillary Clinton and eight former top law enforcement officials. Trump has denied prior knowledge of Epstein’s crimes and claimed he cut off their relationship long ago. But lawmakers from both major political parties and many members of the Republican president’s base have refused to let it go.",
      "publishedAt": "2025-08-05T14:26:06Z",
      "title": "House committee issues subpoenas for Epstein files, depositions with Clintons",
      "url": "https://apnews.com/article/epstein-trump-congress-subpoena-clintons-a02749e1fe6f0de0c385c7fac186d3ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/a854e2a/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F4e%2Fbfb7ead1541eb44c49a4b6ad2527%2F0d3b00cdf79145c4a2ba4b4e892591d6"
    },
    {
      "author": null,
      "description": "Jeffrey Epstein’s ex-girlfriend wants to keep grand jury records secret in the sex trafficking case that sent her to prison. Her lawyers said so in a court filing Tuesday. They wrote that Maxwell hasn’t seen the material herself. The grand jury process is conducted behind closed doors. But she opposes unsealing what her lawyers described as potentially “hearsay-laden” transcripts of grand jury testimony. Meanwhile, prosecutors are continuing to urge a court to release some of those records in the criminal case-turned-political fireball.",
      "publishedAt": "2025-08-05T18:46:16Z",
      "title": "Ghislaine Maxwell doesn't want Epstein grand jury transcripts released",
      "url": "https://apnews.com/article/jeffrey-epstein-ghislaine-maxwell-grand-jury-transcripts-db60a21b4dfc5e312780759b41ce9eb4",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "Texas Democrats prevented their state’s House of Representatives from moving forward, at least for now, with a redrawn congressional map sought by President Donald Trump. In California, the state's dominant Democrats are maneuvering to counter Trump's Texas play by boosting Democratic House seats in the liberal-leaning state. The rivalry tugging at the nation's political balance is playing out in advance of the 2026 midterm elections, with both parties angling to gain ground in Washington. The Texas map would shore up Republicans’ midterm prospects as the president's political standing slumps. California Democrats are weighing political maps that could slash five Republican-held House seats in the liberal-leaning state.",
      "publishedAt": "2025-08-05T04:04:21Z",
      "title": "California and Texas grapple for political advantage in advance of 2026 midterms",
      "url": "https://apnews.com/article/redistricting-texas-california-house-map-trump-0f5f79185bbeeba8c2ff9999f48e5867",
      "urlToImage": "https://dims.apnews.com/dims4/default/14aba83/2147483647/strip/true/crop/3000x1688+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F62%2F5b13fe5ea92c7a5affec6b1a4c6e%2F3728418f0ff84fa883e4a5d51e3093bd"
    },
    {
      "author": null,
      "description": "The Department of Health and Human Services plans to cancel contracts and pull funding for some vaccines being developed to fight respiratory viruses like COVID-19 and the flu. Health Secretary Robert F. Kennedy Jr. announced Tuesday that $500 million worth of vaccine development projects using mRNA technology will be halted. The 22 projects are led by major pharmaceutical companies like Pfizer and Moderna. These mRNA vaccines are credited with slowing the 2020 coronavirus pandemic. Kennedy wants the department to invest in “better solutions,” but he provided no details on what those might be.",
      "publishedAt": "2025-08-05T22:27:09Z",
      "title": "RFK Jr. pulls $500M in funding for vaccine development",
      "url": "https://apnews.com/article/kennedy-vaccines-mrna-pfizer-moderna-1fb5b9436f2957075064c18a6cbbe3c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/0324154/2147483647/strip/true/crop/4874x2742+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F3f%2Fd62a5d2308201cfbf8472825cfcc%2F0e671a310b33494395ffbd57681315b4"
    },
    {
      "author": null,
      "description": "Former Israeli army and intelligence chiefs are calling for an end to the war in Gaza as Prime Minister Benjamin Netanyahu hints at further military action and the government plots its next move. The former security officials speaking out include those who led Shin Bet, Mossad and the Israeli military. Netanyahu announced Monday that he would convene his Security Cabinet in the coming days to decide on the next stage of the war. Israeli forces opened fire Tuesday morning toward Palestinians seeking desperately needed aid and in targeted attacks in the central and southern Gaza Strip, killing at least 25 people.",
      "publishedAt": "2025-08-05T11:04:58Z",
      "title": "Former Israeli security officials call to end the war in Gaza as Netanyahu hints at a new stage",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-08-05-2025-a43fc7d54feea4093ad94f7eff610721",
      "urlToImage": "https://dims.apnews.com/dims4/default/dac7ff6/2147483647/strip/true/crop/6003x3377+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F16%2F2692eb7ae871623b560dc01943bc%2F49d94df5845a431ea84fc94c478492ea"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu is considering ordering the full reoccupation of the Gaza Strip, according to Israeli media. It would mark a stunning escalation of the nearly 22-month war in the coastal territory that has already been largely destroyed and where experts say famine is unfolding. It would put the lives of countless Palestinians as well as about 20 living hostages at risk, and deepen Israel’s already stark international isolation. It would also face fierce opposition within Israel. Families of the hostages would consider it a virtual death sentence, and much of the security establishment is also reportedly opposed.",
      "publishedAt": "2025-08-05T19:12:14Z",
      "title": "What to know as Israel considers reoccupying Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-netanyahu-gaza-occupation-baec5d80f0394fdfb12db78e24b8109f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f501dd/2147483647/strip/true/crop/5347x3008+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F7c%2Fdc02589dbc53fffcc873dc632d1a%2F90c2b95231214440839d932170dfd660"
    },
    {
      "author": null,
      "description": "An inmate executed by Tennessee without deactivating his implanted defibrillator said he was in serious pain after the lethal injection started. Prison officials say 69-year-old Byron Black died at 10:43 a.m. Tuesday. His defibrillator was left working despite uncertainty about whether the device would shock his heart when the lethal chemicals took effect. Black's attorneys say the defibrillator could shock his heart as the pentobarbital in the lethal injection tried to stop it. Black's lawyer says they will review data kept by the device as well as information from a EKG as part of his autopsy.",
      "publishedAt": "2025-08-05T04:05:56Z",
      "title": "Tennessee executes man without deactivating implanted defibrillator",
      "url": "https://apnews.com/article/tennessee-execution-defibrillator-bd1c3d5fcc3dd78faf9fc3ba9a5c7aad",
      "urlToImage": "https://dims.apnews.com/dims4/default/db74778/2147483647/strip/true/crop/4206x2366+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fa7%2F79f8548f470f71292ab621c1d05d%2Ff39b732f26f14b19957f5a691d5a5e88"
    },
    {
      "author": null,
      "description": "Hiroshima is marking the 80th anniversary of the U.S. atomic bombing of the western Japanese city on Wednesday. Many aging survivors express frustration over growing global support for nuclear weapons as deterrence. With survivors' numbers rapidly declining and their average age now over 86, this anniversary is a significant milestone. The bombing on Aug. 6, 1945, killed 140,000 people and a second bomb on Nagasaki killed 70,000 more. Representatives from 120 countries, including Russia and Belarus, are expected to attend the ceremony. Survivors and their families plan to pay tribute to the victims at the peace memorial park before the official ceremony.",
      "publishedAt": "2025-08-05T23:01:14Z",
      "title": "Hiroshima marks 80th anniversary of atomic bombing in Japan amid growing nuclear threat",
      "url": "https://apnews.com/article/japan-us-hiroshima-atomic-bombing-survivors-2a15654cf3689f4f4128098ffbf9a614",
      "urlToImage": "https://dims.apnews.com/dims4/default/8831ad0/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F84%2Fe5bde0835518602b43c28e2659b9%2F95cc6698040642b7b213c6d8e06e6fa1"
    },
    {
      "author": null,
      "description": "The NFL has entered into a nonbinding agreement to sell NFL Network and other media assets to ESPN. The league will receive a 10% equity stake in ESPN in return. The deal still requires a final agreement, the approval of NFL owners and regulatory clearance. ESPN plans to include NFL Network in its upcoming direct-to-consumer service. The NFL will continue to own and produce the RedZone channel but will allow ESPN to distribute it. NFL Fantasy Football will merge with ESPN Fantasy Football. Viewers are unlikely to see changes until next year.",
      "publishedAt": "2025-08-06T00:00:52Z",
      "title": "NFL and ESPN reach nonbinding deal on NFL Network, RedZone, Fantasy Football",
      "url": "https://apnews.com/article/nfl-media-espn-a801cc6d355ddbcb98a8700125eed18b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f181989/2147483647/strip/true/crop/4619x2598+0+240/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F8d%2F043bcb1410e718d62bd2edc888e5%2Fa0d274708c45434f97b8129752773567"
    },
    {
      "author": null,
      "description": "A woman charged with selling Matthew Perry the ketamine dose that killed him is headed for trial in September. Jasveen Sangha's trial is the only one forthcoming over the “Friends” star's death after four other defendants reached plea agreements and are cooperating with prosecutors. A federal judge set the trial date for September 23. Sangha, who prosecutors say was known to customers as “The Ketamine Queen,” faces five counts of ketamine distribution, including one resulting in death. She has pleaded not guilty. Sangha was a major target in the investigation, along with Dr. Salvador Plasencia, who pleaded guilty last month.",
      "publishedAt": "2025-08-05T19:26:14Z",
      "title": "Matthew Perry case: 'Ketamine Queen' trial date moved",
      "url": "https://apnews.com/article/matthew-perry-ketamine-overdose-case-d776da9c86601ace3e05071b7701da6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5948b76/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F97%2Fb5ae85e6af08e83c15579830c6ab%2Ff6aa4409066b49a782e527cb042a4db1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}