{
  "articles": [
    {
      "author": "JEFF MARTIN and CHRISTOPHER O'MEARA",
      "description": "HORSESHOE BEACH, Fla. (AP) — Tropical Storm Debby reached Florida's gulf coast early Monday as a hurricane, bringing with it the potential for catastrophic flooding as it slowly passes over the northern part of the state.",
      "publishedAt": "2024-08-05T05:26:55Z",
      "title": "Tropical Storm Debby threatens Southeast with potentially catastrophic flooding, record-setting rain",
      "url": "https://apnews.com/eb9fc50d578826784824f35ba943a6da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f557cd53c704e6b9ff4b3f3d153357a/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM and KRUTIKA PATHI",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s prime minister resigned and fled the country Monday, after weeks of protests against a quota system for government jobs descended into violence and grew into a broader challenge to her 15-year rule.",
      "publishedAt": "2024-08-05T05:04:29Z",
      "title": "Bangladeshi PM Sheikh Hasina resigns as widening unrest sees protesters storm her official residence",
      "url": "https://apnews.com/fdc7f2632c3d8fcbd913e6c0a1903fd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ddc1b18c3ce407fb6ceeee72a974adc/1920.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — Nearly everything on Wall Street is tumbling Monday as fear about a slowing U.S.",
      "publishedAt": "2024-08-05T00:40:50Z",
      "title": "Dow drops 864 points, and Japanese stocks suffer worst crash since 1987 amid U.S. economy worries",
      "url": "https://apnews.com/c6240977e9482bf7207abc53b2a11e58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1d43dce27d0492fab69a0a8c5ddcd10/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Lebanese militant group Hezbollah said it launched a drone attack early Monday on northern Israel that the Israeli military said wounded two Israeli troops.",
      "publishedAt": "2024-08-05T06:01:29Z",
      "title": "Israel-Hamas war latest: Hezbollah says it launched a drone attack on northern Israel",
      "url": "https://apnews.com/631cf209427743bfa105516d52c1556d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c838b9c0db6045dc8db002f845199c37/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA and BRIAN MELLEY",
      "description": "LONDON (AP) — British Prime Minister Keir Starmer said Monday that a “standing army” of specialist police would be set up to deal with rioting and that the justice system would be ramped up to handle hundreds of arrests after violent disorder rocked cities across the nation over the past week.",
      "publishedAt": "2024-08-05T09:08:37Z",
      "title": "UK prime minister talks of 'standing army' of police to deal with rioting across Britain",
      "url": "https://apnews.com/a391b4513c41fe4de3806b28ee0c1740",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce6ba4d52e0a43a884f4d37662444e56/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "WASILLA, Alaska (AP) — She was a teenager, and the mother of a 2-year-old, when a knock came on the door of the trailer she called home. Two women were there to tell her about a federally funded preschool program called Head Start that was opening near her home in Chugiak.",
      "publishedAt": "2024-08-05T04:16:30Z",
      "title": "This preschool in Alaska changed lives for parents and kids alike. Why did it have to close?",
      "url": "https://apnews.com/b32c3623193f2b972521922954b71dbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a955131d9e84aa880751babd5e1ff0f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The dates are set. The venues are chosen. The only thing missing from this week's campaign blitz with Vice President Kamala Harris and her 2024 running mate is the name of the running mate.",
      "publishedAt": "2024-08-05T12:51:21Z",
      "title": "Rally dates are set. Venues are chosen. The only thing missing for Harris' blitz is her VP choice",
      "url": "https://apnews.com/1bc413ccbce977b2a4f71242410fee2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4e7412c7d2f4ae2a6e1e14fdc4f02ff/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, a daughter of immigrants who rose through the California political and law enforcement ranks to become the first female vice president in U.S.",
      "publishedAt": "2024-08-05T16:43:49Z",
      "title": "Kamala Harris is poised to become the Democratic presidential nominee",
      "url": "https://apnews.com/eb43b6b346cc644b2d195315cb2bfb20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/562e215042e942989558aa56506e7adb/1832.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ",
      "description": "CARACAS, Venezuela (AP) — Voices across the globe expressed concern Sunday over the growing number of arrests in Venezuela following last weekend’s disputed elections. Pope Francis said Venezuela is “living a critical situation” in his traditional Sunday remarks at the Vatican, adding, “I appeal to all parties to seek the truth, to avoid all kinds of violence.”",
      "publishedAt": "2024-08-04T17:23:04Z",
      "title": "Voices across the globe express concern over increasing arrests in Venezuela after disputed election",
      "url": "https://apnews.com/abb8176b46004554e59ec77f95130efe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6fb51ebbd58414083d8de91d1a5dd78/3000.jpeg"
    },
    {
      "author": "NOREEN NASIR",
      "description": "PARIS (AP) — Overcome with emotion, Algerian boxer Imane Khelif left the ring in tears after a resounding victory this weekend.",
      "publishedAt": "2024-08-04T15:17:18Z",
      "title": "For female athletes of color, scrutiny around gender rules and identity is part of a long trend",
      "url": "https://apnews.com/49b79a6b7ae76afaebb00319732d6486",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c72cdff2f05840fa9a8262db674f52e1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}