{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Palestinian officials say Israel’s strikes early Tuesday killed at least seven people in Gaza’s southern city of Khan Younis. At least 15 others, including women and children, were injured in the strikes, they said.",
      "publishedAt": "2024-09-24T05:38:14Z",
      "title": "Israel-Hamas war latest: Israeli strikes on Gaza kill at least 7 as people flee south Lebanon",
      "url": "https://apnews.com/a3377b1ade42c9a314bd48561395596b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c16d5e7c3f91433687a85a4bc47716c7/3000.jpeg"
    },
    {
      "author": "FADI TAWIL and MOHAMMAD ZAATARI",
      "description": "BEIRUT (AP) — Thousands of families from southern Lebanon packed cars and minivans with suitcases, mattresses, blankets and carpets and jammed the highway heading north toward Beirut on Monday to flee the deadliest Israeli bombardment since 2006.",
      "publishedAt": "2024-09-23T18:57:57Z",
      "title": "Thousands flee southern Lebanon in search of safety and shelter",
      "url": "https://apnews.com/3fa69d5575ed7167d65e9a58ef770e24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19ee54f6b6284d90827b7253ecf03132/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "MUWASI, Gaza Strip (AP) — As the escalating conflict between Israel and Hezbollah grabs global attention, Palestinians in Gaza wonder: What will become of their plight after nearly a year of devastating war?",
      "publishedAt": "2024-09-24T04:10:39Z",
      "title": "As Israel's fight with Hezbollah heats up, people of Gaza fear being forgotten",
      "url": "https://apnews.com/9d4d53e808ce5f67e234789f65d1ad71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033545f1675a44dc826400c65827d2a3/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — World leaders will open their annual meeting at the U.N. General Assembly Tuesday under the shadow of increasing global divisions, major wars in Gaza, Ukraine and, Sudan and the threat of an even larger conflict in the wider Middle East.",
      "publishedAt": "2024-09-24T05:07:12Z",
      "title": "World leaders meet under shadow of global divisions, 3 wars and possible Mideast conflict",
      "url": "https://apnews.com/e9b8bd0ee132f6a7f56555975f67b0de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cd73bdb4fe84450b90849380e2a7238/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, MATTHEW LEE and ZEKE MILLER",
      "description": "NEW YORK (AP) — President Joe Biden is set to deliver his final address to the U.N.",
      "publishedAt": "2024-09-24T04:03:29Z",
      "title": "Conflicts in the Mideast and Ukraine will loom over Biden's farewell address at the United Nations",
      "url": "https://apnews.com/4e4e839c3cdd4edd7543aea84af2346f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17d0199eadc74e7483fffce95022108f/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, JILL COLVIN and WILL WEISSERT",
      "description": "SMITHTON, Pa. (AP) — Donald Trump sat in a large barn in rural Pennsylvania on Monday, asking questions of farmers and offering jokes but, in a rarity for his campaign events, mostly listening.",
      "publishedAt": "2024-09-23T14:08:58Z",
      "title": "Trump listens during a farming event in rural Pennsylvania, then threatens John Deere with tariffs",
      "url": "https://apnews.com/dc1e402d7d829acc904a4326370ac04a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca63102dd23547669ea970c293285a34/1920.jpeg"
    },
    {
      "author": "LUIS ALBERTO CRUZ",
      "description": "PUERTO ESCONDIDO, Mexico (AP) — Hurricane John struck Mexico’s southern Pacific coast Monday night with fierce winds and heavy rainfall after strengthening from tropical storm to major hurricane in a matter of hours.",
      "publishedAt": "2024-09-23T06:29:28Z",
      "title": "Hurricane John strikes Mexico’s southern Pacific coast with 'life-threatening' flood potential",
      "url": "https://apnews.com/953e70f4b7bba39ab2f705742f63b803",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b190c2e8ff524285931f8539f1cd7248/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — The man accused in the assassination attempt of Donald Trump at a golf course in Florida left behind a note detailing his plans to kill the former president and kept in his car a handwritten list of dates and venues where Trump was to appear, the Justice Department said Monday.",
      "publishedAt": "2024-09-23T12:38:06Z",
      "title": "US to seek attempted assassination charge against man accused of staking out Trump at golf course",
      "url": "https://apnews.com/1295144a65f46059ce39b4ccd7288fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9489a96ff37444cdb80704501330e506/1500.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "TINMEL, Morocco (AP) — The hand-carved domes and brick-laid arches had almost all been put back together when an earthquake shook Morocco so violently that they caved in on themselves and crashed to the earth.",
      "publishedAt": "2024-09-24T05:05:47Z",
      "title": "Brick by brick, Morocco rebuilds 12th-century mosque destroyed by 2023 earthquake",
      "url": "https://apnews.com/56a224ce9a7a49c8c45fa9037a99bcf9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e68839c5c3794f228a2697693b7c0e79/3000.jpeg"
    },
    {
      "author": "MITCH STACY",
      "description": "CINCINNATI (AP) — Jayden Daniels stood in the pocket against an all-out blitz, took a hit from Bengals safety Geno Stone and launched a perfect ball toward Terry McLaurin in the corner of the end zone.",
      "publishedAt": "2024-09-24T03:17:00Z",
      "title": "Rookie Jayden Daniels nearly flawless for Commanders in 38-33 win over Bengals",
      "url": "https://apnews.com/5245c702b37940be22f3e64f28fe8131",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cefa5151c984270833630129f95234f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}