{
  "articles": [
    {
      "author": "TIA GOLDENBERG and JOSEF FEDERMAN",
      "description": "TEL AVIV, Israel (AP) — Israeli leaders on Sunday credited an international military coalition with helping thwart a direct Iranian attack involving hundreds of drones and missiles, calling the coordinated response a starting point for a “strategic alliance” of regional opposition to Tehran.",
      "publishedAt": "2024-04-14T06:33:30Z",
      "title": "Israel is quiet on next steps against Iran — and on which partners helped shoot down missiles",
      "url": "https://apnews.com/f27cda966ac274982d968cbcc033eff0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e99b7a5f64014684a7277bcb55854cce/1920.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "TEL AVIV, Israel (AP) — Iran's dramatic aerial attack on Israel follows years of enmity between the countries and marks the first time Iran has launched a direct military assault on Israel. The hostility between the countries has only worsened in the six months since Hamas launched its attack on Israel, which set off a war that continues to threaten to drag the entire region toward a broader conflict.",
      "publishedAt": "2024-04-14T20:26:20Z",
      "title": "Iran and Israel have a history of enmity. What key recent events led to Iran's assault on Israel?",
      "url": "https://apnews.com/2df3508a73e8919050baf29b60855210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89f62a987791454a80a4ac2fadd7181d/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — The United States on Sunday highlighted its role in helping Israel thwart Iran's aerial attack as President Joe Biden convened leaders of the Group of Seven countries in an effort to prevent a wider regional escalation and coordinate a global rebuke of Tehran.",
      "publishedAt": "2024-04-14T16:05:14Z",
      "title": "US works to prevent an escalation across the Mideast as Biden pushes Israel to show restraint",
      "url": "https://apnews.com/62cba0eaac095115f8386397b3ded2f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f45d40737743437294b3b4b8bc72700a/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — In a singular moment for American history, the hush money trial of former President Donald Trump begins Monday with jury selection.",
      "publishedAt": "2024-04-15T04:04:39Z",
      "title": "Trump's history-making hush money trial starts Monday with jury selection",
      "url": "https://apnews.com/8da8759352478be8effd3d5734aae35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6d2c1e54160480887ef0c8b6bd0a55e/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and JILL COLVIN",
      "description": "WASHINGTON (AP) — Tax Day reveals a major split in how Joe Biden and Donald Trump would govern: The presidential candidates have conflicting ideas about how much to reveal about their own finances and the best ways to boost the economy through tax policy.",
      "publishedAt": "2024-04-15T04:05:42Z",
      "title": "Tax Day reveals a major split in how Joe Biden and Donald Trump would govern",
      "url": "https://apnews.com/55d3031de64251169eb247f52430618d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bf357b87cc94bb19f3b90dbd7967758/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Australian police are examining why a lone assailant who stabbed six people to death in a busy Sydney shopping mall and injured more than a dozen others targeted women while avoiding men, a police commissioner said on Monday.",
      "publishedAt": "2024-04-15T04:59:35Z",
      "title": "Australian police probe why man who stabbed 6 people to death in a Sydney mall targeted women",
      "url": "https://apnews.com/ad40e483aead58e7982d647dec3c7732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73fe4b0eccc5464aa885f47992cdc5ff/3000.jpeg"
    },
    {
      "author": "AIJAZ HUSSAIN and SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Indian Prime Minister Narendra Modi and his government are increasingly wielding strong-arm tactics to subdue political opponents and critics of the ruling Hindu-nationalist party.",
      "publishedAt": "2024-04-15T04:17:00Z",
      "title": "In Modi's India, opponents and journalists feel the squeeze ahead of election",
      "url": "https://apnews.com/8f22465a6f0f021d43105a06a71d7840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb54ea9ff0224866adfa8680543c546a/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — As Union and Confederate armies clashed in a bloody fourth year of the Civil War, President Abraham Lincoln tasked one man to create the legal code for Arizona, almost 50 years before the territory became a state.",
      "publishedAt": "2024-04-15T04:08:39Z",
      "title": "The Civil War raged and fortune-seekers hunted for gold. This era produced Arizona's abortion ban",
      "url": "https://apnews.com/cf6598d4384fa35a4e073dfae3a844f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a841d9e3deab4e90a86cc8a33a78f6b5/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson said Sunday he will try to advance wartime aid for Israel this week as he attempts the difficult task of winning House approval for a national security package that also includes funding for Ukraine and allies in Asia.",
      "publishedAt": "2024-04-14T16:44:51Z",
      "title": "House Speaker Mike Johnson says he will push for aid to Israel and Ukraine this week",
      "url": "https://apnews.com/912a7419b00749fbc2f472df93f67bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3ab269c7d924e5e9b706548733e2846/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — Scottie Scheffler spent more time looking at his feet than any of the white leaderboards at Augusta National, all of them showing what everyone was watching — a Masters champion again, the undisputed best player in golf.",
      "publishedAt": "2024-04-14T13:32:26Z",
      "title": "Scottie Scheffler unstoppable and wins another Masters green jacket",
      "url": "https://apnews.com/8f9bcddc2f3c8aa4298a83c016286918",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69734f0eb85c440ca1ff78563ff093ba/2873.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}