{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump has signed a measure to have tariff rates match what other countries charge, which could cause taxes on imports to soon go up. The White House has treated these tariffs as a tool to negotiate new trade deals and raise government revenues.",
      "publishedAt": "2025-02-13T07:27:00Z",
      "title": "Live updates: Trump signs plan for new tariffs on all US trading partners",
      "url": "https://apnews.com/live/trump-presidency-updates-2-13-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/38ca7ba/2147483647/strip/true/crop/8016x4509+0+418/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F3a%2F501653be90beba9131462b555ccf%2F6edbba66934a46babfb82f0cb655f739"
    },
    {
      "author": "WILL WEISSERT",
      "description": "Indian Prime Minister Narendra Modi has met with Trump national security adviser Mike Waltz ahead of his meeting with President Donald Trump. Modi also met Thursday with Trump administration official Elon Musk. Modi has heaped praise on Trump and hopes to avoid additional tariffs the new Republican administration has slapped on other countries. But that didn't stop Trump from signing an order increasing U.S. tariffs to match the tax rates that other countries charge on imports. That move affects American trading partners around the world, including India. Trump also has decried U.S. trade deficits internationally — and the U.S. has a large one with India.",
      "publishedAt": "2025-02-13T05:02:26Z",
      "title": "Modi's visit with Trump could boost US-India relations amid tariff woes",
      "url": "https://apnews.com/article/trump-india-modi-visit-washington-tariffs-83d5f6af65f923dc4feb3f38338c888d",
      "urlToImage": "https://dims.apnews.com/dims4/default/73ec848/2147483647/strip/true/crop/4170x2346+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F10%2F1a65292102d429f5809e611cfa97%2F970dc071a8024926a758a7582c108f75"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "Tariffs are in the news at the moment. But what are they? Tariffs are typically charged as a percentage of the price a buyer pays a foreign seller. In the United States, tariffs are collected by Customs and Border Protection agents at 328 ports of entry across the country. Tariffs can be lower for countries with which the United States has trade agreements. For example, most goods can move among the United States, Mexico and Canada tariff-free because of Trump’s US-Mexico-Canada trade agreement. Mainstream economists are generally skeptical of tariffs.",
      "publishedAt": "2025-01-27T21:14:33Z",
      "title": "What are tariffs and how do they work?",
      "url": "https://apnews.com/article/economy-import-tariff-fce31b5c5c9f058ff09353c6846b1cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/64acfc1/2147483647/strip/true/crop/3896x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc3%2F52815690e03dea84bf89947478b0%2F6f880352f5454645926c54a604717a52"
    },
    {
      "author": "JOSH BOAK, CHRISTOPHER RUGABER",
      "description": "Donald Trump promised as a candidate that he could easily conquer inflation, but the reality is proving tougher than he expected. Wednesday’s consumer price index report showed that Trump could end up facing the same challenges that dragged down his predecessor, President Joe Biden. The annual inflation rate has risen over the three months since the November election to 3%. Gasoline prices in particular have climbed despite Trump’s claims that his return to the presidency would signal increased oil production that would lower energy costs. It’s a humbling reminder that even U.S. presidents are subject to the invisible hand of supply and demand, rather than the masters of it.",
      "publishedAt": "2025-02-13T05:08:58Z",
      "title": "The latest inflation report shows that high prices are Trump's major economic challenge",
      "url": "https://apnews.com/article/trump-inflation-tariffs-prices-consumer-50c4738216756499c8cdc17ab77d6d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/901bb20/2147483647/strip/true/crop/3968x2232+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F4b%2Fbeb8ed2c8817ff56fc49837f625f%2Fa328f2dcfcf24d578cf07aeafa7f17e1"
    },
    {
      "author": "MARK LONG",
      "description": "At 100 years old, the Goodyear Blimp is an ageless star in the sky. The 246-foot-long airship will be in the background of the Daytona 500 — flying roughly 1,500 feet above Daytona International Speedway, actually — to celebrate its greatest anniversary tour. Even though remote camera technologies are improving regularly and changing the landscape of aerial footage, the blimp continues to carve out a niche. At Daytona, with the usual 40-car field racing around a 2½-mile superspeedway, views from the blimp aptly provide the scope of the event.",
      "publishedAt": "2025-02-13T20:57:10Z",
      "title": "At 100, the Goodyear Blimp is still thriving",
      "url": "https://apnews.com/article/goodyear-blimp-nascar-anniversary-6a0a6063d3027b3a01c8786a0a82d075",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ca11ef/2147483647/strip/true/crop/2420x1361+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F11%2F3b43234e6cb0b9a1b7a59b28e140%2F598bd765fef44ec5b621d9fa701a3a39"
    },
    {
      "author": "LEA SKENE",
      "description": "A federal judge has temporarily blocked President Donald Trump’s executive order aimed at restricting gender-affirming health care for transgender youth. The judge’s ruling Thursday came in response to a lawsuit filed earlier this month on behalf of families with transgender or nonbinary children who allege their health care has already been compromised. Trumps order blocks support for gender-affirming health care for transgender people under age 19.",
      "publishedAt": "2025-02-13T20:34:49Z",
      "title": "Judge pauses Trump order on gender-affirming care for trans youth",
      "url": "https://apnews.com/article/judge-restraining-order-trump-transgender-health-care-8f8d935a3e757a1700dfb7363a67b07b",
      "urlToImage": "https://dims.apnews.com/dims4/default/0b3d5d6/2147483647/strip/true/crop/5102x2870+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fce%2F820d82f306d12d8153a0d482d49b%2F856a6e0827be4ce99388a74a36783824"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "U.S. Sen. Tina Smith of Minnesota says she won’t seek reelection, dealing a blow to her fellow Democrats’ hopes of retaking the Senate in 2026. Smith made the announcement on a video posted to social media Thursday. The 66-year-old says she wants to spend more time with her family after 20 years of work in the public sector. Smith says her decision is not political, it's entirely personal. But Smith adds that the country needs “strong, progressive leadership.” Smith says she'll use the two years left in her term working to represent Minnesota’s interests without having to worry about running for reelection.",
      "publishedAt": "2025-02-13T16:26:26Z",
      "title": "Sen. Tina Smith of Minnesota won’t seek reelection, dealing blow to Democrats’ hopes to take Senate",
      "url": "https://apnews.com/article/senator-tina-smith-minnesota-a6025b9d54498da5496df5452d72e7c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6dd3b9/2147483647/strip/true/crop/5504x3096+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F3d%2Ffea29cffbbcd6d7a19210f536b04%2F5d06b88fff3d48dcb6fd140bdc3c9252"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has rolled out his plan to increase U.S. tariffs to match the tax rates that other countries charge on imports. The Republican is possibly triggering a broader economic confrontation with allies and rivals alike as he hopes to eliminate any trade imbalances. Trump said Thursday: “TODAY IS THE BIG ONE: RECIPROCAL TARIFFS!!!” The prospect of a dramatic hike on tariffs could send shockwaves through the world economy, possibly depressing growth while also causing inflation to intensify. Most economists say the tariffs would effectively be a tax increase on U.S. consumers. Trump says he's decided “for purposes of fairness\" he'll charge reciprocal tariffs.",
      "publishedAt": "2025-02-13T12:52:00Z",
      "title": "Trump signs a plan for reciprocal tariffs on US trading partners",
      "url": "https://apnews.com/article/trump-tariffs-reciprocal-imports-tax-trade-economy-54c0a26687dc96157d96229068894720",
      "urlToImage": "https://dims.apnews.com/dims4/default/95c5e57/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4c%2F2523bce79acc6a79e7755e0bf587%2F3cf12cc080014e7fb806f9ef2a81c8a4"
    },
    {
      "author": "CHRISTOPHER WEBER, PATRICK WHITTLE",
      "description": "Authorities say a more than 100-vehicle pileup in whiteout conditions has closed part of a major interstate along the Columbia River near Portland, Oregon. The Multnomah County Sheriff’s Office said on social media Thursday that westbound Interstate 84 was closed near Multnomah Falls after a vehicle pileup in which an SUV caught fire. It also says there are reports of people being trapped in vehicles. Authorities say the people in the SUV were able to escape. Officials say first responders are searching car by car and injuries have been reported. Multnomah Falls is about 25 miles east of Portland.",
      "publishedAt": "2025-02-13T06:54:55Z",
      "title": "Injuries reported in more than 100-vehicle pileup near Portland in whiteout conditions",
      "url": "https://apnews.com/article/california-rain-flooding-oregon-ice-snow-d00f3bf4f37d073d16dabef98197597e",
      "urlToImage": "https://dims.apnews.com/dims4/default/24d5374/2147483647/strip/true/crop/8025x4514+0+418/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F25%2Fbf745baa453f60a478e59c92c034%2Fd6218e5e107641daad38ae3b6436cfff"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE",
      "description": "President Donald Trump said Thursday that he wants to restart nuclear arms control talks with Russia and China and that eventually he hopes all three countries could agree to cut their massive defense budgets in half. Speaking to reporters, Trump lamented the hundreds of billions of dollars being invested in rebuilding the nation’s nuclear deterrent and said he hopes to gain commitments from U.S. adversaries to cut their own spending. While the U.S. and Russia hold massive stockpiles of weapons since the Cold War, Trump predicted that China would catch up in their capability to exact nuclear devastation “within five or six years.”",
      "publishedAt": "2025-02-13T20:09:02Z",
      "title": "Trump wants denuclearization talks with Russia and China",
      "url": "https://apnews.com/article/trump-china-russia-nuclear-bbc1c75920297f1e5ba5556d084da4de",
      "urlToImage": "https://dims.apnews.com/dims4/default/95c5e57/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4c%2F2523bce79acc6a79e7755e0bf587%2F3cf12cc080014e7fb806f9ef2a81c8a4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}