{
  "articles": [
    {
      "author": "Nicole Winfield, Silvia Stellacci",
      "description": "The Vatican is carrying on with its Holy Year celebrations without the pope. Pope Francis remains hospitalized with pneumonia and a complex respiratory infection. Doctors say it will keep him hospitalized for at least another week and regardless is still touch-and-go. In a brief early update Saturday, the Vatican said Francis slept well overnight. But doctors have warned that the main threat facing the 88-year-old Francis would be the onset of sepsis, a serious infection of the blood that can occur with pneumonia. As of Friday, there was no evidence of any sepsis, and Francis was responding to the various drugs he is taking.",
      "publishedAt": "2025-02-22T11:34:24Z",
      "title": "Sepsis a threat in pope's pneumonia battle as Vatican Holy Year celebrations march on without him",
      "url": "https://apnews.com/article/pope-francis-pneumonia-sepsis-vatican-respiratory-infection-bab5b9a141517171d4efc71fadafa0a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5775990/2147483647/strip/true/crop/3445x1938+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F6b%2Fe8a8c0c84a588615d96e4939864f%2Fd3d35ff587814047b6884cca820ff090"
    },
    {
      "author": "Nicole Winfield",
      "description": "The pope looms so large in everyday Italian life that there are lots of expressions that make light of even a dark event like his death. “A pope dies, they make another,” goes one, suggesting how life goes on. His possible successor a matter of intense gossip everywhere, from taxicabs to butchers' shops. Pope Francis' recent bout with pneumonia, which has landed him in the hospital for the fourth time, has fueled more speculation. This time, that's been fueled by the movie “Conclave,” which has reminded the world about the arcane rules and spectacular drama involved in a papal election and turned viewers into armchair experts.",
      "publishedAt": "2025-02-20T13:33:37Z",
      "title": "When the pope is sick, Italians always gossip about who comes next — even before 'Conclave'",
      "url": "https://apnews.com/article/pope-francis-health-hospital-vatican-3bab1220b31d00cf37d183f45ad287ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6f0620/2147483647/strip/true/crop/7576x4262+0+395/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Ff2%2F588f58c94f1388e4f6c3ae10ab9a%2F73dd8a59dca94c5187e221b2f948b23c"
    },
    {
      "author": null,
      "description": "A hospital official says a gunman has been killed after shots were fired at a hospital in central Pennsylvania. Officials at UPMC Memorial in York said that no patients were injured and that the gunman is dead. The extent of any other injuries was unclear. Law enforcement is on premises and is managing the situation. UPMC Memorial is a five-story, 104-bed hospital in York that opened in 2019.",
      "publishedAt": "2025-02-22T17:46:18Z",
      "title": "Shooter dead after opening fire at Pennsylvania's UPMC Memorial hospital",
      "url": "https://apnews.com/article/york-pennsylvania-hospital-shooting-gunman-dead-270382b4e7bb1c48e78b50247c722df4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Justin Spike",
      "description": "Hungarian Prime Minister Viktor Orbán says his country will decide whether Ukraine joins the European Union. The comments in a State of the Nation address in Budapest on Saturday were a new escalation of his adversarial posture toward Kyiv. Orbán described Ukraine as a buffer zone between NATO and Russia and predicted that it would remain so. He argued that Ukraine’s EU accession would harm Hungary’s economy and vowed to block it. Orbán is seen as the Kremlin's closest EU partner. He has obstructed aid to Ukraine while maintaining ties with Moscow. He vowed legal action on Saturday against groups receiving U.S. aid and proposed a constitutional amendment defining gender as binary.",
      "publishedAt": "2025-02-22T16:08:00Z",
      "title": "Hungarians will decide whether Ukraine can join the European Union, Orbán says",
      "url": "https://apnews.com/article/hungary-orban-ukraine-eu-membership-f4a02aa3efee975b6d2e7c4086f284dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/240dae0/2147483647/strip/true/crop/5954x3349+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F93%2Fe27a2030282a23e465123c212af7%2Ff6a8022ae9eb461ab2f4fcb77542637a"
    },
    {
      "author": null,
      "description": "Red Cross ambulances have arrived in Gaza’s southernmost city of Rafah in preparation for the handover of six Israeli hostages to be freed Saturday under the Israel-Hamas ceasefire deal. AP video showed the ambulances waiting among a crowd with a line of Hamas fighters nearby in Rafah, where two of the hostages are expected to be handed over. The other four are to be handed over in central Gaza.",
      "publishedAt": "2025-02-22T06:23:32Z",
      "title": "Family confirms second body released by militants was Shiri Bibas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-22-2025-364c7abeb679e910cb5acba234469574",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1bf97d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F43%2F476efdca70eadb16c08f1e79432d%2F465de4ee09d343a18485466b3b56195c"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's deputy foreign minister says preparations have begun for a face-to-face meeting between U.S. President Donald Trump and Russia's Vladimir Putin. Sergei Ryabkov told Russian state media on Saturday that a possible summit could involve broad talks on global issues, including the war in Ukraine. But he said efforts to bring it about are at an early stage. Last week Russian and U.S. representatives agreed to start working toward ending the war and improving their diplomatic and economic ties, at high-level talks in Saudi Arabia that marked an extraordinary about-face in U.S. foreign policy under President Trump.",
      "publishedAt": "2025-02-22T12:36:47Z",
      "title": "Trump-Putin summit preparations are underway, Russia says",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-talks-89e19bc56677064f6f9a6d6e03de7362",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e95ea0/2147483647/strip/true/crop/4730x2661+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Ff3%2F72fe7b8ef362f1f0cb1220ae473f%2F9f0d8c65f7ba4fbaa7b4c6787cd1261f"
    },
    {
      "author": "Calvin Woodward",
      "description": "President Donald Trump is moving with light speed and brute force to reshape America at home and abroad. In his first month back in office, he's performed a pirouette in foreign policy as he pulls the U.S. back from historic alliances, reaches out to Russia and chokes foreign aid. At home, he's fired thousands of federal workers and mandated an about-face in the missions of department after department. How much of this sticks will largely depend on courts, which appear to be the only check on Trump's expansive use of executive power. Congress has so far been compliant as Trump pursues his ends by edict instead of legislation.",
      "publishedAt": "2025-02-22T13:49:33Z",
      "title": "Trump moves with light speed and brute force in shaking the core of what America has been",
      "url": "https://apnews.com/article/trump-reshaping-america-democracy-musk-executive-power-0e8b6724d45fcdb3e6f0cef05ae7b952",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b3fb7/2147483647/strip/true/crop/3024x1701+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F40%2Fc8566d5c48341b5fed2c6e2b1f35%2F287ed54c254b46eca9e61bb0fe1bdd48"
    },
    {
      "author": "Bernard Condon",
      "description": "Elon Musk’s cost-cutting team is eliminating jobs at the vehicle safety agency that oversees Tesla and has launched investigations into deadly crashes involving his company’s cars. The National Highway Traffic Safety Administration has cut a “modest” amount of positions, according to a statement from the agency. Musk has accused NHTSA of holding back progress on self-driving technology with its investigations and recalls. Asked about whether the cuts would impact any probes into Tesla, the agency referred to a statement saying it will enforce the law on all automobile manufacturers.",
      "publishedAt": "2025-02-22T17:07:54Z",
      "title": "DOGE is laying off workers at auto safety agency overseeing Tesla",
      "url": "https://apnews.com/article/musk-trump-autonomous-selfdriving-doge-auto-safety-99b369c5e3ccd3e7c09b6951604b3a0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/53c2a06/2147483647/strip/true/crop/2830x1592+0+148/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F4e%2F619cac5970632a88f2f5491006c4%2Fdbe87e756d714b8eaef2924407f207e7"
    },
    {
      "author": null,
      "description": "Military officials say a shooting at a U.S. Air Force base in New Mexico has left one airman dead and another wounded. A spokesperson for Kirtland Air Force Base in Albuquerque says the shooting happened near one of the entrances at about 2 a.m. Saturday and was not a terrorist act or an attack by an outsider. One airman died at the scene and the other was taken to a hospital with a gunshot wound to a hand and later discharged. The Air Force released few other details and did not immediately say whether someone was in custody or if there was a search for a suspect.",
      "publishedAt": "2025-02-22T17:49:27Z",
      "title": "Shooting at Air Force Base in New Mexico kills airman, wounds another",
      "url": "https://apnews.com/article/shooting-kirtland-air-force-base-new-mexico-cc56a0c9b0e1606bec2dd3447063977b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Geir Moulson",
      "description": "The contenders in Germany’s election are making their final appeals to voters. The opposition leader and front-runner vowed Saturday to revive the stagnant economy and defend Europe’s interests in the face of a confrontational U.S. administration. Chancellor OIaf Scholz insisted that he still hopes for an improbable last-minute comeback. Germans are electing a new parliament Sunday after a campaign focused on the state of Europe’s biggest economy and calls to curb migration. Uncertainty has grown rapidly about the future of Ukraine and the strength of Europe’s alliance with the United States.",
      "publishedAt": "2025-02-22T16:56:26Z",
      "title": "Leading contenders make their final appeals to German voters before a landmark election",
      "url": "https://apnews.com/article/germany-election-merz-scholz-far-right-campaign-fb8240ad3a83f762177fdde4232a13e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6f7aa2/2147483647/strip/true/crop/6648x3739+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F92%2F628294e578e60bef8e68dd52d29c%2F5a5c2815f72944ccbd7b5aff0c002fd1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}