{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — At the Republican National Convention and multiple rallies since, former President Donald Trump has been greeted as a hero who narrowly escaped assassination and is destined to lead a new American golden age.",
      "publishedAt": "2024-08-13T04:13:03Z",
      "title": "A conservative gathering provides a safe space for Republicans who aren't on board with Trump",
      "url": "https://apnews.com/636bf9b50112a8f00842668f509a438b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5c256bbd7a64d989e7f99dbf519de69/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Reem Abu Hayyah, just three months old, was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday. A few miles (kilometers) to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.",
      "publishedAt": "2024-08-13T12:02:57Z",
      "title": "Israeli strikes on Gaza leave children without parents and parents without children",
      "url": "https://apnews.com/36c11d9bb2c01b094e4301bf4e197f0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b8e8e69471e4a7cb1563e785fdc454d/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — Missouri voters will decide in November whether to guarantee a right to abortion with a constitutional amendment that would reverse the state’s near-total ban.The secretary of state’s office certified Tuesday that an initiative petition received more than enough valid signatures from registered voters to qualify for the general election.",
      "publishedAt": "2024-08-13T13:37:59Z",
      "title": "Initiative to enshrine abortion rights in Missouri constitution qualifies for November ballot",
      "url": "https://apnews.com/0c0a28e5176a647b47aaca5a5d287628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67d8852b90d04fb2924d8687e46ea081/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and CARLA K. JOHNSON",
      "description": "NEW ORLEANS (AP) — President Joe Biden is zeroing in on the policy goals closest to his heart now that he's no longer seeking a second term, visiting New Orleans on Tuesday to promote his administration's \"moonshot\" initiative aiming to dramatically reduce cancer deaths.",
      "publishedAt": "2024-08-13T04:15:56Z",
      "title": "Biden announces $150 million in research grants as part of his 'moonshot' push to fight cancer",
      "url": "https://apnews.com/df375e5e4dd1511276710b192bad9c0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eede59bd82de41be8e56b70e627d7866/3000.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "Whatever possessed Vice President Kamala Harris to pick Minnesota Gov. Tim Walz as her running mate, it probably wasn’t a desire to inflame arguments about apostrophes. But it doesn’t take much to get grammar nerds fired up.",
      "publishedAt": "2024-08-13T19:31:38Z",
      "title": "There's an apostrophe battle brewing among grammar nerds. Is it Harris' or Harris's?",
      "url": "https://apnews.com/967c0bbefc09be6c804588daabed7ec9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4312f4e342aa4b7b9dc24fa93564206a/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Ernesto battered the northeast Caribbean on Tuesday as it took aim at Puerto Rico, where officials closed schools, opened shelters and moved dozens of the U.S.",
      "publishedAt": "2024-08-13T11:38:22Z",
      "title": "Tropical Storm Ernesto batters northeast Caribbean and aims at Puerto Rico as it strengthens",
      "url": "https://apnews.com/15ff3b85e54780fa89aa51087a87d5dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57f72443c3ac45e29ff722190d29cb52/2402.jpeg"
    },
    {
      "author": "PATRICK AFTOORA ORSAGOS and JOHN SEEWER",
      "description": "COLUMBUS, Ohio (AP) — An Ohio police officer was indicted Tuesday on murder and other charges in the shooting of Ta’Kiya Young, a 21-year-old pregnant Black mother who was killed after being accused of shoplifting last August.",
      "publishedAt": "2024-08-13T14:17:48Z",
      "title": "Officer faces murder charge in shooting of pregnant Black woman who was accused of shoplifting",
      "url": "https://apnews.com/5aeeaeff40fbad5dd85da1a77767bce6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e4d47801f5c409898e5ca40615e4adf/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia said Tuesday that its forces checked an effort by Ukrainian troops to expand a stunning weeklong incursion into the Kursk region, as a Ukrainian Foreign Ministry spokesman said Kyiv has no intention of occupying Russian territory.",
      "publishedAt": "2024-08-13T12:24:55Z",
      "title": "Russia says it thwarted a Ukrainian charge to expand its incursion. Kyiv says it won't occupy land",
      "url": "https://apnews.com/5378360d6b1f244930d8886be4469bc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18d6c2248cb4c82a5781feea30152c4/2477.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "MOUNTAIN VIEW, Calif. (AP) — Google on Tuesday unveiled its next generation of Pixel phones, providing the maker of Android software a head start on the next iPhone in the race to bring more artificial-intelligence services to devices that have become people’s constant companions.",
      "publishedAt": "2024-08-13T19:16:01Z",
      "title": "Google rolls out Pixel 9 phones earlier than usual as AI race with Apple heats up",
      "url": "https://apnews.com/706f612f4d1b0d6ed06431026e9afcbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a14f05b41c3349d08511c46e6283a129/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — An 83-foot (25-meter) motor boat that was one of the first refrigerated sardine carriers during the heyday of Maine’s sardine industry is going to be scrapped after a recovery operation to retrieve the sunken vessel.",
      "publishedAt": "2024-08-13T18:35:18Z",
      "title": "Before lobster, Maine had a thriving sardine industry. A sunken ship reminds us of its storied past",
      "url": "https://apnews.com/5c2bafbb60c003f61e91d5d034a59bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3955e499819c4752ab270ceace3f58cb/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}