{
  "articles": [
    {
      "author": "NICOLE WINFIELD, PAOLO SANTALUCIA and COLLEEN LONG",
      "description": "BORGO EGNAZIA, Italy (AP) — A Group of Seven summit opened Thursday with agreement reached on a U.S. proposal to back a $50 billion loan to Ukraine using frozen Russian assets as collateral, giving Kyiv a strong show of support even as Europe's political chessboard shifts to the right.",
      "publishedAt": "2024-06-13T10:37:35Z",
      "title": "G7 summit opens with deal to use Russian assets for Ukraine as EU's traditional powers recalibrate",
      "url": "https://apnews.com/54720de17121ea282ec9a145a9fd2006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b764e035f6041ecaf59714035e97578/3000.jpeg"
    },
    {
      "author": null,
      "description": "BORGO EGNAZIA, Italy (AP) — Italy is hosting the summit of the Group of Seven leading industrialized nations in the wake of the European Parliament election, which saw a surge in support for the far right in places like G7 members France and Germany.",
      "publishedAt": "2024-06-13T07:45:54Z",
      "title": "The Latest: Italy hosts the Group of Seven summit with global conflicts on the agenda",
      "url": "https://apnews.com/fc5fe5c0f07e82c607cdae50a6fb6b36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3022702d428c41a08cf47dec91395dbe/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "The latest proposal for a cease-fire in Gaza has the support of the United States and most of the international community, but Hamas has not fully embraced it, and neither, it seems, has Israel.Hamas this week accepted the broad outline but requested “amendments.\" Prime Minister Benjamin Netanyahu has publicly disputed aspects of the plan, raising questions about Israel's commitment to what the U.S.",
      "publishedAt": "2024-06-12T15:22:14Z",
      "title": "What are the main sticking points in the cease-fire talks between Israel and Hamas?",
      "url": "https://apnews.com/ab6925549d8f523a6e5c61e88e7eec8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b88bc6870d3478296a5bda5f069fcb4/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.",
      "publishedAt": "2024-06-12T19:33:09Z",
      "title": "Yemen's Houthi rebels launch boat-borne bomb attack against Greek-owned ship in Red Sea",
      "url": "https://apnews.com/12e8bf184bfa08669bbe17b8e1f99b0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4287702f69f4048b2c908f632d72ce3/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Donald Trump is making a triumphant return to Capitol Hill to meet with House and Senate Republicans, his first since sending the mob to “fight like hell” ahead of the Jan.6, 2021 attack, as GOP lawmakers find themselves newly energized and reinvigorated by his bid to retake the White House.",
      "publishedAt": "2024-06-13T04:07:29Z",
      "title": "Trump is returning to Capitol Hill to meet with Republican lawmakers, a first since Jan. 6 attack",
      "url": "https://apnews.com/ef6a2dc69ee8cd3e11479d095f2bfd1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c020ab05318c41c38e35c56dffb197a6/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina's Senate began what's likely to be an all-night voting marathon on the details of President Javier Milei 's sweeping proposals to slash spending and boost his own powers early Thursday, shortly after giving the plan overall approval in a narrow vote as thousands of protesters clashed with police outside.",
      "publishedAt": "2024-06-13T05:47:58Z",
      "title": "Milei's radical overhaul advances in Argentina's Senate as protesters clash with police",
      "url": "https://apnews.com/854202d5c18bc862f3cdbc27bf6cae35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bfbe6cc3b4b433382b60a9015881b7f/1920.jpeg"
    },
    {
      "author": "NICHOLAS PAPHITIS",
      "description": "ATHENS, Greece (AP) — Desperate hands clutched at Ali Elwan's arms, legs and neck, and screams misted his ears, as he spat out saltwater and fought for three hours to keep afloat in the night, dozens of miles from land.",
      "publishedAt": "2024-06-13T04:10:45Z",
      "title": "One year later, migrants who survived wreck off Greece seek justice and struggle to cope with life",
      "url": "https://apnews.com/a6386a5e7287920766b79e35a981ad8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caf629c78e204c0e9e97d42eb2d0b1b4/2000.jpeg"
    },
    {
      "author": "FREIDA FRISARO and CURT ANDERSON",
      "description": "FORT LAUDERDALE, Fla. (AP) — A tropical disturbance has brought a rare flash flood emergency to much of southern Florida as residents prepared to weather more heavy rainfall on Thursday and Friday.",
      "publishedAt": "2024-06-13T04:31:51Z",
      "title": "After rare flash flood emergency, Florida prepares for more heavy rainfall in coming days",
      "url": "https://apnews.com/bb31b2d8ac01ee1300642ce674c6e61c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a4526d74a644c0e9e61d9d44f3e745e/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — If Tesla shareholders approve an all-stock compensation package for CEO Elon Musk that was thrown out this year by a Delaware judge, it would almost guarantee he would remain at the company he grew to be the world leader in electric vehicles, shifting to AI and robotics including autonomous vehicles, which Musk says is Tesla's future.",
      "publishedAt": "2024-06-13T11:19:45Z",
      "title": "Future of Elon Musk and Tesla are on the line as shareholders vote on massive pay package",
      "url": "https://apnews.com/8b6cce1a1aa460dbbaac69eb73e0e5e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/776a2731769740b4830e7fa5a4dae630/1920.jpeg"
    },
    {
      "author": "SCHUYLER DIXON",
      "description": "DALLAS (AP) — Jayson Tatum and Jaylen Brown shared a long hug after helping Boston avoid the biggest collapse in an NBA Finals game since at least 1997.",
      "publishedAt": "2024-06-13T03:11:26Z",
      "title": "Tatum, Brown help Celtics hold off huge Dallas rally for 106-99 win, 3-0 lead in NBA Finals",
      "url": "https://apnews.com/9e2aa5254dade3eaf56795b1fc94beb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a776a72a641437392bbb935e26c444c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}