{
  "articles": [
    {
      "author": "JEFF AMY and JEFF MARTIN",
      "description": "WINDER, Ga. (AP) — The 14-year-old accused of fatally shooting four people at his high school in Georgia was expected to make his first court appearance Friday, a day after his father was also arrested for allowing his son to have a weapon.",
      "publishedAt": "2024-09-06T04:44:27Z",
      "title": "Teen accused of killing 4 at Apalachee High is set to appear in court. His father was also arrested",
      "url": "https://apnews.com/e13b91e80c7fbefd7e3104e710afeb8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f769fceb19174fb2bfa4320ddc11c158/3000.jpeg"
    },
    {
      "author": "BY JEFF AMY",
      "description": "WINDER, Ga. (AP) — It was the middle of second period at Apalachee High School, and the boy who few knew slipped out of his algebra class in J Hall again.",
      "publishedAt": "2024-09-06T04:05:54Z",
      "title": "Inside the Georgia high school where a sleepy morning was pierced by gunfire",
      "url": "https://apnews.com/2134142ff2ec2b7dc14d1e44c4f8bf74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bc3f6e4f4ca4969883c1918a3219122/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Friday's monthly jobs report will likely mark a pivotal moment for the economy and the Federal Reserve.",
      "publishedAt": "2024-09-06T04:01:19Z",
      "title": "Jobs report will help Federal Reserve decide how much to cut interest rates",
      "url": "https://apnews.com/bac1b453d3873d5f23f2061344d28fd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8c42606e515464d9db146581a62ab23/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Russia has long sought to inject disinformation into U.S. political discourse. Now, it's got a new angle: paying Americans to do the work.This week's indictment of two Russian state media employees on charges that they paid a Tennessee company to create pro-Russian content has renewed concerns about foreign meddling in the November election while revealing the Kremlin's latest tactic in a growing information war.",
      "publishedAt": "2024-09-06T04:10:11Z",
      "title": "American company, Russian propaganda: New Kremlin tactic reveals escalating effort to sway US vote",
      "url": "https://apnews.com/13b15fcd42e52d77c22454c223e85b95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f695bd812d3a479fa37d0c30aad57c1d/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The federal election interference case against Donald Trump inched forward Thursday, with a judge permitting prosecutors to file court documents later this month that could detail unflattering allegations about the former president as the Republican nominee enters the final weeks of his White House run.",
      "publishedAt": "2024-09-05T04:16:43Z",
      "title": "Prosecutors in Trump election case get judge's OK to lay out fresh evidence in court filing",
      "url": "https://apnews.com/f29a81ddd995b15afe95fcc00e928465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/650ae7c16f7d4697971019656b3449a3/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris raised well more than double what former President Donald Trump took in from donors in August, her campaign announced Friday, saying it raised $361 million from nearly 3 million donors in her first full month as a candidate.",
      "publishedAt": "2024-09-06T09:01:51Z",
      "title": "Harris raised $361 million in August from nearly 3 million donors, campaign says",
      "url": "https://apnews.com/8b41b580ba46d8dbfa2c7ede3b696ff8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24848ddd39fc4264b3db5bf1bccf4f02/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "PORT MORESBY, Papua New Guinea (AP) — Pope Francis arrived in Papua New Guinea on Friday for the second leg of his four-nation trip through Southeast Asia and Oceania, becoming the second pope to visit the poor, strategically important South Pacific nation.",
      "publishedAt": "2024-09-06T02:47:45Z",
      "title": "Pope arrives in Papua New Guinea for the second leg of his Southeast Asia and Oceania trip",
      "url": "https://apnews.com/bf3cbe6efde1487da695893b63ec471e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ab9b66b5b49452ab856c84323447795/1920.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI",
      "description": "NAIROBI, Kenya (AP) — A fire in a school dormitory in Kenya killed 17 students and seriously burned 13 others, police said Friday.There are fears that the death toll may rise, police said.The cause of the fire Thursday night at Hillside Endarasha Primary in Nyeri county was being investigated, police spokesperson Resila Onyango said.",
      "publishedAt": "2024-09-06T05:31:44Z",
      "title": "A fire in a school in Kenya kills 17 students and seriously burns 13 others",
      "url": "https://apnews.com/7017997f40514fefe817a820a7f6c6c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a694b97efbe46e7ba87023379da6fdc/3000.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "KANSAS CITY, Mo. (AP) — Patrick Mahomes thought for a moment that the Chiefs were headed to overtime. So did Ravens counterpart Lamar Jackson, who had found Isaiah Likely in the back of the end zone with no time left for a touchdown that appeared to tie the game.",
      "publishedAt": "2024-09-06T04:05:58Z",
      "title": "Chiefs hold off Ravens 27-20 when review overturns TD on final play of NFL's season opener",
      "url": "https://apnews.com/e11de910772704671858be9565d1aa10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a64f711a25a43a4bd4fb24521e212ad/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE and NICKY FORSTER",
      "description": "WASHINGTON (AP) — Federal regulators responsible for the safety of the U.S. drug supply are still struggling to get back to where they were in 2019, before the COVID-19 pandemic upended factory inspections in the U.S. and across the world, The Associated Press has found.",
      "publishedAt": "2024-09-05T13:15:03Z",
      "title": "Nearly 2,000 drug plants are overdue for FDA checks after COVID delays, AP finds",
      "url": "https://apnews.com/7b3a7e9b45bcc3aea86ce5bf781271f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aad755249524296ba855241f85946c5/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}