{
  "articles": [
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden on Thursday opened a critical stretch in his effort to salvage his imperiled reelection campaign, arguing the stakes extend far beyond his own political prospects to the future of the country's economy and democracy itself.",
      "publishedAt": "2024-07-04T16:46:23Z",
      "title": "Biden heads into a make-or-break stretch for his imperiled presidential campaign",
      "url": "https://apnews.com/8866379e91fdb1425bbd2eb5344655c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b127674b0a9b47d3a3d2067ff6d6ccda/2684.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — The Israeli government has approved plans to build nearly 5,300 new homes in settlements in the occupied West Bank, a monitoring group said Thursday, the latest in a campaign to accelerate settlement expansion, aimed at cementing Israeli control over the territory and preventing the establishment of a future Palestinian state.",
      "publishedAt": "2024-07-04T09:51:38Z",
      "title": "Israel approves plans for nearly 5,300 new homes in West Bank settlements",
      "url": "https://apnews.com/972cc86ab554103bba449dc117bee0d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bad8c9154a5145e593607862d3676908/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — British voters were picking a new government Thursday in a parliamentary election widely expected to bring the Labour Party to power against a gloomy backdrop of economic malaise, mounting distrust in institutions and a fraying social fabric.",
      "publishedAt": "2024-07-04T04:01:31Z",
      "title": "British voters pick a new government against a backdrop of economic malaise and deep pessimism",
      "url": "https://apnews.com/3c89a7974f05748943adfbebf03d3db6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bda0ad9d515648e2aae92e54b11116bf/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "The burgers aren't the only things sizzling this Fourth of July: Millions of people are under heat warnings as large numbers of Americans traveled to toast their nation’s birth with parades, cookouts and fiery splashes of colors against the evening sky.",
      "publishedAt": "2024-07-04T04:07:05Z",
      "title": "Americans shrug off searing heat to celebrate Fourth of July with parades, cookouts and fireworks",
      "url": "https://apnews.com/602108ca0e195ca52479d37cc1c04b9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90ad53b7ce01455ebb803b0e3fc8c2fd/1920.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "Around 134 million people in the U.S. are under alerts as an “extremely dangerous and record-breaking” heat wave broils much of the country, according to the National Weather Service. Regions that may see temperatures above 90 degrees Fahrenheit (32 degrees Celsius) or much higher into the triple digits (well above 37 degrees Celsius) include nearly all of the West Coast, the southern Plains, most of the lower Mississippi Valley into the Ohio Valley and parts of Florida, said Bob Oravec, a lead forecaster with the National Weather Service.",
      "publishedAt": "2024-07-04T15:22:42Z",
      "title": "Millions swelter under dangerous Fourth of July heat wave",
      "url": "https://apnews.com/2ad854fd039aa2fbd84284ed2a064b79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca955ca2d0004da2b639787d54f410f6/3000.jpeg"
    },
    {
      "author": "MARTÍN SILVA and JOHN MYERS JR.",
      "description": "TULUM, Mexico (AP) — Hurricane Beryl ripped off roofs in Jamaica, jumbled fishing boats in Barbados and damaged or destroyed 95% of homes on a pair of islands in St. Vincent and the Grenadines before rumbling past the Cayman Islands early Thursday and taking aim at Mexico's Caribbean coast.",
      "publishedAt": "2024-07-04T04:48:13Z",
      "title": "Hurricane Beryl churns toward Mexico after leaving destruction in Jamaica and eastern Caribbean",
      "url": "https://apnews.com/04eda74885bbe45ae3630e2ca713ef92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2062a6f18fae46c8a29c3d1288be5836/1920.jpeg"
    },
    {
      "author": "ANUPAM NATH",
      "description": "MORIGAON, India (AP) — A blue tarp covered a mother and her newborn daughter from the incessant rain on their boat journey. Jahanara Khatoon, 25, had just given birth on the boat on their way to a healthcare center, surrounded by the raging floodwaters of the Brahmaputra River.",
      "publishedAt": "2024-07-04T11:27:13Z",
      "title": "Indian mother delivers baby on boat as her river island is inundated by floodwaters",
      "url": "https://apnews.com/bb281029d775694bedc79ad08254431e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49870ffa05274bb2899275dd9b9dc119/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Robert Woodland, a Russia-born U.S. citizen, was convicted of drug-related charges by a Moscow court and sentenced to 12 1/2 years in prison on Thursday, court officials and his lawyers said.",
      "publishedAt": "2024-07-04T15:13:53Z",
      "title": "US citizen Woodland convicted of drug-related charges by Moscow court. He's sentenced to 12.5 years",
      "url": "https://apnews.com/f858be6b6668bc9d46023077e468a36b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97030d06e6474ec296d2c02f1dbcb580/3000.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR and EDDIE PELLS",
      "description": "GENEVA (AP) — The international swimming federation says its top administrator has been ordered to testify as a witness in a U.S. criminal investigation into the case of 23 Chinese swimmers who failed doping tests in 2021 yet were allowed to continue competing.",
      "publishedAt": "2024-07-04T14:43:35Z",
      "title": "World swimming federation confirms US federal investigation into Chinese swimmers' doping tests",
      "url": "https://apnews.com/d55b6c2853e2d7a79cefa68afe51f9bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ea7816e8ec472f965f556aa6b1e5f6/3000.jpeg"
    },
    {
      "author": null,
      "description": "BERLIN (AP) — The Swifties are about to take over the German city formerly known as Gelsenkirchen, where American superstar Taylor Swift is set to give three Eras Tour concerts later this month.In honor of the singer, the city has renamed itself “Swiftkirchen\" — at least temporarily — to welcome the tens of thousands of fans who are expected to come for her shows on July 17, 18 and 19, German news agency dpa reported.",
      "publishedAt": "2024-07-04T10:55:33Z",
      "title": "With Taylor Swift heading to Germany, one city has taken her name — at least for a few weeks",
      "url": "https://apnews.com/63a8cf1b2c6e7bcc44d09c00839e1b29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42f1da45f35e421196e7c6fbd5bc98c5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}