{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — International mediators appeared to make progress Wednesday on extending the truce in Gaza, encouraging the territory's Hamas rulers to keep freeing hostages in return for the release of Palestinian prisoners and further respite from Israel's air and ground offensive.",
      "publishedAt": "2023-11-29T07:44:26Z",
      "title": "Mediators look to extend truce in Gaza on its final day, with one more hostage swap planned",
      "url": "https://apnews.com/57e73a26c647ecd97e77afe19c08e077",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6cf6c9445dd42bd98cfd38bb51c8d1c/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A crew member who was recovered from the ocean after a U.S. military Osprey aircraft carrying six people crashed Wednesday off southern Japan has been pronounced dead, coast guard officials said.",
      "publishedAt": "2023-11-29T07:21:23Z",
      "title": "US military Osprey aircraft with 6 aboard crashes off southern Japan, at least 1 dead",
      "url": "https://apnews.com/7d704ec5925826593aebcf0e7d1312ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d23fa912ad7441f8a6ac5debfe31883/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Rosalynn Carter will receive her final farewells Wednesday in the same tiny town where she was born and that served as a home base as she and her husband, former President Jimmy Carter, climbed to the White House and spent four decades thereafter as global humanitarians.",
      "publishedAt": "2023-11-29T05:32:55Z",
      "title": "Rosalynn Carter set for funeral and burial in the town where she and her husband were born",
      "url": "https://apnews.com/7bfe185985105ed61eb69446819c6c26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca903e4f86b643acb4ca80695990d926/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump has embraced the rioters who attacked the U.S. Capitol on Jan. 6, 2021 as patriots, vowed to pardon a large portion of them if he wins a second term and even collaborated on a song with a group of jailed defendants.",
      "publishedAt": "2023-11-29T05:04:59Z",
      "title": "Trump embraces the Jan. 6 rioters on the trail. In court, his lawyers hope to distance him from them",
      "url": "https://apnews.com/1e3b917739a06a9d63227298f5547793",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ffe1801fa744c499fbab6d7ca3fc3fe/2811.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The world is heading for considerably less warming than projected a decade ago, but that good news is overwhelmed by much more pain from current climate change than scientists anticipated, experts said.",
      "publishedAt": "2023-11-29T04:20:42Z",
      "title": "Climate contradictions key at UN talks. Less future warming projected, yet there's more current pain",
      "url": "https://apnews.com/3355b4d2dc0d483ba7dbf582cd89f0b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/effcddb2a0ec4cc4b67c010776b52258/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — At least 40 civilians were killed last weekend by al-Qaida-linked rebels trying to take control of a besieged town in Burkina Faso’s hard-hit northern region, the United Nations' rights office said, calling the attack a war crime.",
      "publishedAt": "2023-11-29T11:10:50Z",
      "title": "At least 40 civilians killed by al-Qaida-linked rebels in a Burkina Faso town, UN rights office says",
      "url": "https://apnews.com/f5a96076ac84148259e48a82ca6d7484",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58bd45641a184ab4a21356867488632a/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — As authorities in Vermont push forward with their investigation of the weekend shooting of three college students of Palestinian descent, they are weighing whether to treat the violence as a hate crime.",
      "publishedAt": "2023-11-28T18:22:36Z",
      "title": "Was the Vermont shooting of 3 men of Palestinian descent a hate crime? Under state law it might be",
      "url": "https://apnews.com/03e051f7a7f5634ee220803bdbe4886c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff6a7d70b554818a129629cada020fc/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. life expectancy rose last year — by more than a year — but still isn't close to what it was before the COVID-19 pandemic. The 2022 rise was mainly due to the waning pandemic, Centers for Disease Control and Prevention researchers said Wednesday.",
      "publishedAt": "2023-11-29T05:01:17Z",
      "title": "US life expectancy rose last year, but it remains below its pre-pandemic level",
      "url": "https://apnews.com/de21ba7085f1aa0f05ed2df78faa964d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d10552f92f7a4f03aa694faae4123e52/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Computer-generated writers ... writing computer-generated stories? Sports Illustrated is the latest media company to see its reputation damaged by being less than forthcoming — if not outright dishonest — about who or what is writing its stories at the dawn of the artificial intelligence age.",
      "publishedAt": "2023-11-28T22:44:29Z",
      "title": "Sports Illustrated is the latest media company damaged by an AI experiment gone wrong",
      "url": "https://apnews.com/479cc3869c0638df5bbb26d4b1e4f18f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8c67751fda54211b4465d2a08ecdb0d/3000.jpeg"
    },
    {
      "author": "FRANCES D'EMILIO",
      "description": "VATICAN CITY (AP) — Pope Francis presided at his weekly audience with the public at the Vatican, but he said that he's still unwell and asked an aide to read his remarks for him on Wednesday, a day after canceling an overseas trip.",
      "publishedAt": "2023-11-29T08:50:50Z",
      "title": "An ailing Pope Francis tells the public he's better than a day earlier but has aides read speeches",
      "url": "https://apnews.com/184779d17424d81d09ed83eea0a00175",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91c92dd4cf6d43a6a82385cafdeda1fd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}