{
  "articles": [
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Japan, a nation so hardworking its language has a term for literally working oneself to death, is trying to address a worrisome labor shortage by coaxing more people and companies to adopt four-day workweeks.",
      "publishedAt": "2024-08-31T04:14:47Z",
      "title": "Japan wants its hardworking citizens to try a 4-day workweek",
      "url": "https://apnews.com/f78a95a89d99e7b323f7554721088d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e7febcba6d847619df13787c9772c74/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — As the Earth sizzled through a summer with four of the hottest days ever measured, Vice President Kamala Harris and former President Donald Trump have starkly different visions on how to address a changing climate while ensuring a reliable energy supply.",
      "publishedAt": "2024-08-31T04:04:27Z",
      "title": "Harris and Trump offer starkly different visions on climate change and energy",
      "url": "https://apnews.com/0989a331574665365330b21108f7f9b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/066c637bf9bf490aad1e54ae39119a26/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — At first glance, there's little that a 78-year-old former president and a 23-year-old internet personality might have in common.Donald Trump admitted in a recent appearance on Adin Ross' show that he only “more or less” understood livestreaming, the publishing of live video on social media.",
      "publishedAt": "2024-08-31T04:01:54Z",
      "title": "Trump courts conservative male influencers to try to reach younger men",
      "url": "https://apnews.com/dc293b71917193920e751d93030fabae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cded91040e0e4808848f26f7de73c5a7/3000.jpeg"
    },
    {
      "author": null,
      "description": "JOHNSTOWN, Pa. (AP) — Police said Saturday that a man will face misdemeanor charges after he stormed into the press area at Donald Trump's rally in Johnstown, Pennsylvania, before being surrounded by authorities and eventually subdued with a Taser as the former president spoke at the campaign stop.",
      "publishedAt": "2024-08-30T22:32:46Z",
      "title": "Police say a man will face charges after storming into the press area at a Trump rally",
      "url": "https://apnews.com/68fe78b79ae65556c4efc850e142998c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bd60d54c5a04b079b67739c73fa9979/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Arrests for illegal border crossings from Mexico during August are expected to rise slightly from July, officials said, likely ending five straight months of declines.Authorities made about 54,000 arrests through Thursday, which, at the current rate, would bring the August total to about 58,000 when the month ends Saturday, according to two U.S.",
      "publishedAt": "2024-08-31T15:21:28Z",
      "title": "Border arrests are expected to rise slightly in August, hinting 5-month drop may have bottomed out",
      "url": "https://apnews.com/12357799e15b1b1f5399dac19184fcc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c070465ec37c4760a0debb0e71503a29/3000.jpeg"
    },
    {
      "author": null,
      "description": "BOVINA, Miss. (AP) — Seven people were killed and dozens were injured in Mississippi after a commercial bus overturned on Interstate 20 on Saturday morning, according to the Mississippi Highway Patrol.",
      "publishedAt": "2024-08-31T17:20:15Z",
      "title": "Mississippi bus crash kills 7 people and injures 37",
      "url": "https://apnews.com/eb16d10eed0abcdfd30f053d899a5767",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bdac461f0fe4236aa2fc4fd39ecaa73/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "JERUSALEM (AP) — A campaign to inoculate children in Gaza against polio and prevent the spread of the virus began on Saturday, the Health Ministry said, as Palestinians in the Hamas-governed enclave and in the occupied West Bank reeled from Israel's military offensives.",
      "publishedAt": "2024-08-31T13:26:37Z",
      "title": "Polio vaccine campaign begins in Gaza a day before an expected pause in fighting",
      "url": "https://apnews.com/b3016b2ac2085c103b412a437f7579eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b52b3a9f53944945b393a7d23efef2ed/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The U.N. health agency and partners are launching a campaign starting Sunday to vaccinate 640,000 Palestinian children in Gaza against polio, an ambitious effort amid a devastating war that has destroyed the territory's healthcare system.",
      "publishedAt": "2024-08-31T04:05:00Z",
      "title": "3 days, 640,000 children, 1.3M doses. The plan to vaccinate Gaza's young against polio",
      "url": "https://apnews.com/3acaa0dcf9744810c51032f45e609a2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a27176603c443899973224749ef4eee/1920.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — When the air raid siren bellows in the dead of night, the women in arms rush to duty. Barely two months since joining the mobile air-defense unit, 27-year-old Angelina has perfected the drill to a tee: Combat gear fitted, anti-aircraft machine gun in place, she cruised behind the wheel of a pickup, singing along to a Ukrainian song about rebellion.",
      "publishedAt": "2024-08-31T04:16:30Z",
      "title": "With men at the front lines, women watch over Ukraine's night sky for Russian drones",
      "url": "https://apnews.com/c93d97de4c39ca5a12d5906c3ee014c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0521c0893b5946158b8102b9837aadc8/1920.jpeg"
    },
    {
      "author": "MITCH STACY",
      "description": "Columbus Blue Jackets officials could hardly believe their luck when they persuaded superstar Johnny Gaudreau to pass up larger markets and sign here two years ago.Ecstatic fans looked to “Johnny Hockey” to score goals and jump-start the fortunes of a struggling team that had reached the playoffs just six times in the previous 21 seasons and advanced beyond the opening round only twice.",
      "publishedAt": "2024-08-31T13:10:21Z",
      "title": "Sudden death of 'Johnny Hockey' means more hard times for beleaguered Columbus Blue Jackets",
      "url": "https://apnews.com/74fec73925bcd72179b771b06758b71b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6195bcc7d385414883e9c7b18d220510/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}