{
  "articles": [
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. has approved $20 billion in arms sales to Israel, including scores of fighter jets and advanced air-to-air missiles, the State Department announced Tuesday.",
      "publishedAt": "2024-08-13T20:10:48Z",
      "title": "US approves $20 billion in weapons sales to Israel amid threat of wider Middle East war",
      "url": "https://apnews.com/b6a99129c88a5dcc4a4753e20b5e19ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadfe65a195d44eb922af2836c685430/2933.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "JERUSALEM (AP) — International mediators are hoping to kickstart stalled cease-fire negotiations between Israel and Hamas with a new round of talks meant to finally clinch a deal between the sides. But the chances of a breakthrough appear slim.",
      "publishedAt": "2024-08-14T04:44:48Z",
      "title": "A new round of Gaza cease-fire talks is starting. Why is a deal so elusive?",
      "url": "https://apnews.com/f43a53d4a2ee75ef320ef385ee9e659f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68e4dbb5778444489cf4dc73b784689e/3000.jpeg"
    },
    {
      "author": "DAN MERICA, NICHOLAS RICCARDI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden, watching tens of thousands of migrants from Central America reach the U.S.-Mexico border just a few months into his administration, tapped his second-in-command to help address the influx — a decision that has exposed Vice President Kamala Harris to one of her biggest political liabilities.",
      "publishedAt": "2024-08-14T04:13:32Z",
      "title": "Presented with rise in border crossings, Harris chose a long-term approach to the problem",
      "url": "https://apnews.com/46d23ad3b0e8a1780ac0a6a306120b3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/911e244df70841ba9ea2bc91b36677f2/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has a perceived advantage over former President Donald Trump on several leadership qualities such as honesty, a new poll from The Associated Press-NORC Center for Public Affairs Research finds, although Americans are slightly more likely to trust Trump on the economy and immigration.",
      "publishedAt": "2024-08-14T04:01:58Z",
      "title": "Americans give Harris an advantage over Trump on honesty and discipline, an AP-NORC poll finds",
      "url": "https://apnews.com/f025463df08beacbaa0c51e7bbb7eda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cccd65de662449db96ed4bb00d765e9f/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Democratic U.S. Rep. Ilhan Omar, one of the progressive House members known as the “Squad” and a sharp critic of how Israel has conducted the war in Gaza, has won her primary race in Minnesota.",
      "publishedAt": "2024-08-13T05:01:45Z",
      "title": "US Rep. Ilhan Omar, a member of the progressive ‘Squad,’ wins Democratic primary in Minnesota",
      "url": "https://apnews.com/e8b62d80a4952efeb1e40d5a857a2b4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e32e2a06d00a4821b61f5377542ab4fb/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ASHEVILLE, N.C. (AP) — Donald Trump will have another opportunity Wednesday to recalibrate his presidential comeback bid, this time with a rally and speech in North Carolina that his campaign is billing as a significant economic address.",
      "publishedAt": "2024-08-14T04:08:31Z",
      "title": "Donald Trump is going to North Carolina for an economic speech. Can he stick to a clear message?",
      "url": "https://apnews.com/bc81b98a425e46c32065c02650b2b44c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55ae1678a4a94b9ba8d6d97037aee21e/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Ernesto was poised to become a hurricane shortly after brushing past Puerto Rico late Tuesday as officials closed schools, opened shelters and moved dozens of the U.S.",
      "publishedAt": "2024-08-13T11:38:22Z",
      "title": "A strengthening Ernesto is poised to become a hurricane after brushing past Puerto Rico",
      "url": "https://apnews.com/15ff3b85e54780fa89aa51087a87d5dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37ae85e91f604e799f8c08e8a5e29b29/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia said Tuesday that its forces checked an effort by Ukrainian troops to expand a stunning weeklong incursion into the Kursk region, as a Ukrainian Foreign Ministry spokesperson said Kyiv has no intention of occupying Russian territory.",
      "publishedAt": "2024-08-13T12:24:55Z",
      "title": "Russia says it thwarted a Ukrainian charge to expand its incursion. Kyiv says it won't occupy land",
      "url": "https://apnews.com/5378360d6b1f244930d8886be4469bc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98c85849b7124f02a36fe74ebc2b7ec8/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese Prime Minister Fumio Kishida, in a surprise move Wednesday, announced he will not run in the upcoming party leadership vote in September, paving the way for Japan to have a new prime minister.",
      "publishedAt": "2024-08-14T01:52:37Z",
      "title": "Japan's Kishida announces he will not run in September, paving the way for a new prime minister",
      "url": "https://apnews.com/a666ab460848ad5b7b2e9c47460be0b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d03942709c4b9fb430a612bbe595bf/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — It’s been three years since the Taliban took control of Afghanistan.",
      "publishedAt": "2024-08-14T04:14:53Z",
      "title": "The Taliban have ruled Afghanistan for 3 years. Here are 5 things to know",
      "url": "https://apnews.com/9d949d0555de84a003333f7ab7d0ef96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a1d7c0cd942439893220c7a4757fc7d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}