{
  "articles": [
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — Two Denver-area paramedics were convicted Friday for giving a fatal overdose of the sedative ketamine to Elijah McClain in 2019 — a jury verdict that experts said could have a chilling effect on first responders around the country.",
      "publishedAt": "2023-12-23T00:54:50Z",
      "title": "2 paramedics found guilty in death of Elijah McClain, who they injected with an overdose of ketamine",
      "url": "https://apnews.com/acef1eabe02b458f53d30d8fe3bf76a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82b0a785d7b74d0583fb836bfbcea090/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and SAM MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel's war to destroy Hamas has killed more than 20,000 Palestinians, health officials in Gaza said Friday, as Israel expanded its offensive and ordered tens of thousands more people to leave their homes.",
      "publishedAt": "2023-12-22T05:27:23Z",
      "title": "Gaza war's staggering toll reaches a grim milestone: 20,000 dead",
      "url": "https://apnews.com/7453c6f92d74eb1e12e506489031b91b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/905eb97fdb344787b32de7ecb139d21b/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. Security Council adopted a watered-down resolution Friday calling for immediately speeding aid deliveries to hungry and desperate civilians in Gaza but without the original plea for an “urgent suspension of hostilities” between Israel and Hamas.",
      "publishedAt": "2023-12-22T16:38:49Z",
      "title": "UN approves watered-down resolution on aid to Gaza without call for suspension of hostilities",
      "url": "https://apnews.com/a5bb32fb9f071689d231533a26beb838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/941881916081408698f98d5ed4ed92f3/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Supreme Court said Friday it will not immediately take up a plea by special counsel Jack Smith to rule on whether former President Donald Trump can be prosecuted for his actions to overturn the 2020 election results.",
      "publishedAt": "2023-12-22T19:35:57Z",
      "title": "Supreme Court rejects prosecutor's push to fast-track ruling in Trump election subversion case",
      "url": "https://apnews.com/90b93eeb663ebaf67a2e0bc266390fa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f330bb5f2a44ebe8e25ad558f046f49/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump says he is eager to debate President Joe Biden, even if the debates are sponsored by the nonpartisan Commission on Presidential Debates.",
      "publishedAt": "2023-12-22T18:55:50Z",
      "title": "Trump says he’s eager to debate Biden in 2024, even if controversial commission plans events",
      "url": "https://apnews.com/428216dc2a0e9692a64dfde800753f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbc94b4816904e9aa078340f955f28ce/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — The liberal-controlled Wisconsin Supreme Court overturned Republican-drawn legislative maps on Friday and ordered that new district boundary lines be drawn as Democrats had urged in a redistricting case they hope will weaken GOP majorities.",
      "publishedAt": "2023-12-22T20:52:44Z",
      "title": "Wisconsin Supreme Court orders new legislative maps in redistricting case brought by Democrats",
      "url": "https://apnews.com/eccbcfee414d1943073a9fb949743860",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd6a7aec34eb4e7987915b6a97c28b91/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "BOSTON (AP) — When Ernseau Admettre decided to leave Haiti and head north with his young family in tow, very little was guaranteed.But the situation in his homeland, beset by poverty and gang violence, had grown so dire that a risky passage to and then across the United States' southern border offered a kind of hope he said he could never find by staying put.",
      "publishedAt": "2023-12-22T23:11:16Z",
      "title": "At a church rectory in Boston, Haitian migrants place their hopes on hard work and helping hands",
      "url": "https://apnews.com/ecfd0f6ce13acab2b35306a13e53d857",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f25482a633584d0ab2b3726f8df466aa/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "CORAL SPRINGS, Fla. (AP) — Joyce Loaiza lives alone, but when she returns to her apartment at a Florida senior community, the retired office worker often has a chat with a friendly female voice that asks about her day.",
      "publishedAt": "2023-12-22T05:11:45Z",
      "title": "Chatty robot helps seniors fight loneliness through AI companionship",
      "url": "https://apnews.com/a343409477b7aea350254f94daf52eb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99f9ace8e65043769aea611e92b47e65/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Look for flu and COVID-19 infections to ramp up in the coming weeks, U.S. health officials say, with increases fueled by holiday gatherings, too many unvaccinated people and a new version of the coronavirus that may be spreading more easily.",
      "publishedAt": "2023-12-22T18:37:10Z",
      "title": "Flu and COVID infections are rising and could get worse over the holidays, CDC says",
      "url": "https://apnews.com/f382233d2d15301c75c7d3b3ba82c800",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c122feaea92d4719a3a929427660c925/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — The holiday travel rush hit its peak Friday as mild weather and lower flight cancelation rates raised hopes for merrier drivers and airline passengers than last year.",
      "publishedAt": "2023-12-22T12:44:05Z",
      "title": "Busiest holiday travel season in years is off to a smooth start with few airport delays",
      "url": "https://apnews.com/8f7958fda3dabda82494a5effb143eea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f540e56770bb485d9a9570bf31a28625/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}