{
  "articles": [
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — A teenage student opened fire with a handgun Monday at a private Christian school in Wisconsin, killing a teacher and another teenager during the final week before Christmas break.",
      "publishedAt": "2024-12-16T17:47:46Z",
      "title": "Teacher and a teenage student killed in a shooting at a private Christian school in Wisconsin",
      "url": "https://apnews.com/498c8ad26d299602553201ad639a4a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5523b8e22ab420b94bc62b81b80b327/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "MADISON, Wis. (AP) — A teenage student opened fire at the Abundant Life Christian School in Madison, Wisconsin on Monday, killing a teacher and another teenage student in the final week before Christmas break.",
      "publishedAt": "2024-12-16T19:23:29Z",
      "title": "The Latest: Teacher and a student killed in a shooting at a private Christian school in Wisconsin",
      "url": "https://apnews.com/8c0610859b9fb285a7f67a1dce7b22d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bfe31d4ad9f49c882181c76fe14ace8/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and TARA COPP",
      "description": "KYIV, Ukraine (AP) — Ukraine’s military intelligence agency and the Pentagon said Monday that some North Korean troops have been killed during combat against Ukrainian forces in Russia’s Kursk border region.",
      "publishedAt": "2024-12-16T11:50:22Z",
      "title": "Ukraine and US say some North Korean troops have been killed fighting alongside Russian forces",
      "url": "https://apnews.com/33bf427736c5802fb97df41fdbf61396",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c3dab2383d43569e011a317a00a715/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "After months of deadlock, Israel and Hamas appear to be moving closer toward a ceasefire to end their 14-month war.",
      "publishedAt": "2024-12-16T22:13:45Z",
      "title": "Negotiators say Israel and Hamas are inching toward a ceasefire deal. This is what it may look like",
      "url": "https://apnews.com/264087c7a547031a9433ecbbdcd920d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0e10fe5ddd24e558b9fa141f197f322/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and JILL COLVIN",
      "description": "PALM BEACH, Fla. (AP) — In a freewheeling press conference at his Mar-a-Lago club, President-elect Donald Trump said Monday he would consider pardoning embattled New York Mayor Eric Adams, declared the country was “not going to lose\" the polio vaccine and weighed in on the flurry of drone sightings over New Jersey.",
      "publishedAt": "2024-12-16T16:50:55Z",
      "title": "Trump weighs in on NY mayor, vaccines and drones in freewheeling press conference at Mar-a-Lago",
      "url": "https://apnews.com/44beea6cf8c93f070638842712bf3aca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b24a33acf87488591c1b99434408617/1920.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau faced the biggest test of his political career after Finance Minister Chrystia Freeland, long one of his most powerful and loyal ministers, resigned from the Cabinet on Monday.",
      "publishedAt": "2024-12-16T14:42:53Z",
      "title": "Canada's finance minister resigns as unpopular Trudeau faces biggest test of his political career",
      "url": "https://apnews.com/a8355a62870edd962fee8138dc6bfc77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc35a8328ac6446189512fa1209c1ac6/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS and MIKE CATALINI",
      "description": "TRENTON, N.J. (AP) — Drone-detecting devices deployed in New Jersey in the past week have found “little to no evidence” of anything nefarious or threatening, Gov. Phil Murphy said Monday as calls grew for action to address the mysterious nighttime sightings of suspected unmanned flights across the northeastern U.S.",
      "publishedAt": "2024-12-16T16:28:57Z",
      "title": "Drone detectors in New Jersey have found 'little or no evidence' of wrongdoing, governor says",
      "url": "https://apnews.com/b37fda04755803392178b1f39b76ccd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b24a33acf87488591c1b99434408617/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — TikTok on Monday asked the Supreme Court to step in on an emergency basis to block the federal law that would ban the popular platform in the United States unless its China-based parent company agreed to sell it.",
      "publishedAt": "2024-12-16T20:27:25Z",
      "title": "TikTok asks the Supreme Court for an emergency order to block a US ban unless it's sold",
      "url": "https://apnews.com/101afd280e5018bc1296613517f041d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af5bd4c467994d769d0d85bce0ea3ce5/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — An alleged Chinese spy who cultivated close ties with Prince Andrew said Monday he has done “nothing wrong or unlawful” as Britain's government faced questions about what it is doing to thwart security threats from China.",
      "publishedAt": "2024-12-16T18:19:59Z",
      "title": "Who is the alleged Chinese spy with close ties to Britain's Prince Andrew?",
      "url": "https://apnews.com/df7354a1cf404a203e809ce36c4754d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ff7c80c973044f7a36da154aae539eb/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Former talk show host Carlos Watson was sentenced Monday to nearly 10 years in prison in a federal financial conspiracy case that cast his once-buzzy Ozy Media as an extreme of fake-it-'til-you-make-it startup culture.",
      "publishedAt": "2024-12-16T20:35:48Z",
      "title": "Former TV host Carlos Watson gets nearly 10 years in prison in case about failed startup Ozy Media",
      "url": "https://apnews.com/08f18ac01494d0b5f0285db32ff5ecb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31af3541b228481cb7095c8ec12e346f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}