{
  "articles": [
    {
      "author": null,
      "description": "The Federal Aviation Administration is closing the airspace around El Paso International Airport in Texas for 10 days, grounding all flights to and from the airport. A notice posted on the FAA’s website said the temporary flight restrictions were for “special security reasons,” but the notice did not provide additional details. The closure does not include Mexican airspace. The airport said in an Instagram post that all flights to and from the airport would be grounded from late Tuesday through late on Feb. 20, including commercial, cargo and general aviation flights. It suggests travelers contact their airlines to get up-to-date flight information.",
      "publishedAt": "2026-02-11T10:51:06Z",
      "title": "FAA closes airspace around El Paso International Airport for 10 days",
      "url": "https://apnews.com/article/faa-el-paso-texas-air-space-closed-1f774bdfd46f5986ff0e7003df709caa",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff83bb/2147483647/strip/true/crop/4005x2669+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F56%2Fa40ae2f7385a44057ca845ba8125%2F9ff56359bb5749f2959b601277ec2e4f"
    },
    {
      "author": "Jim Morris, Rob Gillies",
      "description": "Canadians are in shock after a deadly mass shooting in British Columbia. Seven people were killed at a school in Tumbler Ridge, and two others at a nearby home. Authorities say the suspected shooter, a woman, was found dead from a self-inflicted wound. More than 25 people were wounded in Tuesday's attack, with two in critical condition. Prime Minister Mark Carney expressed his condolences and announced flags will fly at half-staff for seven days. School shootings are rare in Canada, which has strict gun control laws. The motive remains unclear as the investigation continues.",
      "publishedAt": "2026-02-11T15:00:38Z",
      "title": "Shooting at a school and home in Canada leaves 9 dead and 25 injured",
      "url": "https://apnews.com/article/canada-school-shooting-british-columbia-e577eb5689d1af42f6077a56368d4170",
      "urlToImage": "https://dims.apnews.com/dims4/default/d719763/2147483647/strip/true/crop/947x631+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F3e%2F9f6f7b81dbf6a97d54173ced10ac%2F1b43a2da28d94a6e931131d50f6b3342"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s president has apologized to “all those affected” by the nationwide protest and bloody crackdown that followed it. President Masoud Pezeshkian also denounced on Wednesday unspecified “Western propaganda” surrounding the protests. Pezeshkian said he knew the “great sorrow” felt by people in the protests and crackdown, without directly acknowledging the hand Iranian security forces had in the bloodshed. Pezeshkian also insisted that his nation was “not seeking nuclear weapons. ... and are ready for any kind of verification.” His comments came during a speech at a commemoration marking Iran’s 1979 Islamic Revolution.",
      "publishedAt": "2026-02-11T06:52:00Z",
      "title": "Iran marks 47th anniversary of revolution",
      "url": "https://apnews.com/article/iran-revolution-anniversary-us-nuclear-talks-protests-4ffab53ef628073ca90b9c8707485577",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fb262b/2147483647/strip/true/crop/4174x2781+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F79%2F05e9e6f9f317d7810f1db354c414%2Fafcb32e8928d45d7b0d6f96dee84147b"
    },
    {
      "author": "Ty ONeil, John Seewer, Hallie Golden",
      "description": "Officials say a person has been detained for questioning in the disappearance of Nancy Guthrie. The Pima County Sheriff’s Department said in a statement Tuesday night that deputies detained someone during a traffic stop south of Tucson. The department later said a location in Rio Rico, about an hour's drive from Tucson, was being searched. The news was another potential break in a case that has gripped the nation for more than a week. It came hours after the FBI released surveillance images of a masked person with a handgun holster outside Guthrie’s front door the night she vanished. It wasn’t clear if the person being questioned is the same person captured on surveillance video.",
      "publishedAt": "2026-02-11T09:07:30Z",
      "title": "Investigators searching a location in Arizona in disappearance of Nancy Guthrie",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-6f1016e390e2c59d82604731f795a8ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fe5f8d/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Ffb%2F24e7ddafb1b6a5f69f27f389ea64%2F23d59d53447a428eaf511b88e3156199"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker",
      "description": "Attorney General Pam Bondi is set to face questions from lawmakers over the Justice Department’s handling of files related to Jeffrey Epstein that have exposed sensitive private information about victims despite redaction efforts. Bondi is confronting a new wave of criticism stemming from the political saga that has dogged her term after the release of millions of additional Epstein disclosures that victims have slammed as sloppy and incomplete. It will be the first time the attorney general appears before Congress since a tumultuous hearing in October in which she repeatedly deflected questions and countered Democrats’ criticism of her actions with her own political attacks.",
      "publishedAt": "2026-02-11T05:05:39Z",
      "title": "Bondi will face questions from lawmakers over Epstein files",
      "url": "https://apnews.com/article/pam-bondi-house-judiciary-committee-justice-department-6d7502b80e42e9e9454264e242507bbd",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dbb8cf/2147483647/strip/true/crop/7494x4993+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F57%2Fefd2d6b9a3aa62f8a8201bc2f55e%2Fe5b8c6fefab049ba8ea8898d3528c7fa"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "US adds surprising 130,000 jobs last month yet revisions cut hundreds of thousands of jobs last year",
      "url": "https://apnews.com/article/jobs-economy-unemployment-labor-c760d3f86988833bc9ccb3936d44d61b",
      "urlToImage": null
    },
    {
      "author": "Ryan J. Foley",
      "description": "Investigators say one immigration official abused his girlfriend for years. Another admitted he sexually abused a woman in his custody. A third is charged with taking bribes. A review by The Associated Press found at least two dozen U.S. Immigration and Customs Enforcement employees and contractors have been charged with crimes since 2020. The wrongdoing includes patterns of physical and sexual abuse and corruption. Most cases happened before Congress gave ICE $75 billion last year to hire more agents and detain more people, but experts say these kinds of crimes could accelerate. A spokesperson says ICE takes allegations of misconduct \"extremely seriously\" and thoroughly vets new applicants.",
      "publishedAt": "2026-02-11T05:14:35Z",
      "title": "Crimes by ICE personnel in recent years show patterns of abuse, corruption, AP review shows",
      "url": "https://apnews.com/article/ice-agents-arrested-misconduct-crimes-abuse-corruption-45b0d2248c0add9523e0bf5a953faaea",
      "urlToImage": "https://dims.apnews.com/dims4/default/99c2d5f/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F48%2F5591799bc8841c420b129ac978d5%2Fa36e0e633e5e4429a59a20f0c2568816"
    },
    {
      "author": "Farnoush Amiri, Melanie Lidman",
      "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu are expected to discuss new nuclear talks with Iran. The longtime Israeli leader is visiting the White House on Wednesday. It comes as both Tehran and Washington are projecting cautious optimism after holding indirect talks in Oman on Friday about how once again to approach negotiations over Iran’s nuclear program. It remains unclear how much influence Netanyahu will have over Trump's approach toward Iran. Trump said Tuesday that he wants “no nuclear weapons, no missiles.” Netanyahu’s office has said he wants Iran talks to include limits on Iran’s ballistic missile program and support for militant groups like the Palestinian Hamas and Lebanon’s Hezbollah.",
      "publishedAt": "2026-02-11T05:02:10Z",
      "title": "Trump and Netanyahu meeting to focus on Iran",
      "url": "https://apnews.com/article/israel-iran-trump-netanyahu-nuclear-talks-fa5be8069deb4b1b01cdf30d3e3525e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/148d1b9/2147483647/strip/true/crop/2800x1866+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F92%2Fcff3128a8d93f54f000c9cdb02d4%2F61591b9a504845cfa509b1fa75e2c1c5"
    },
    {
      "author": "Jeffrey Collins",
      "description": "Alex Murdaugh's lawyers are asking the South Carolina Supreme Court to overturn his murder convictions. They argue that the trial judge's rulings and a biased court clerk prevented a fair trial. Murdaugh's lawyers are expected to tell the justices at Wednesday's hearing that allowing evidence Murdaugh stole from clients biased jurors into thinking he could be a killer and that there was no physical evidence linking him to the deaths of his wife and younger son. Even if the convictions are overturned, Murdaugh won't get out of prison. He is serving a 40-year federal sentence for stealing $12 million from clients.",
      "publishedAt": "2026-02-11T05:12:26Z",
      "title": "Alex Murdaugh's lawyers appeal murder convictions",
      "url": "https://apnews.com/article/alex-murdaugh-killings-appeal-supreme-court-0d234a230b7ac602f836f9d091a0a88f",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c3e4aa/2147483647/strip/true/crop/4853x3234+0+72/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F49%2F2f2f8c9e9096574d7f78fd72f34d%2F91a1f895c9f6438bbf042e4b75e3c962"
    },
    {
      "author": "Elaine Kurtenbach, Matt Ott",
      "description": "U.S. stocks are rising back to their record levels following an encouraging report that said the nation’s unemployment rate unexpectedly improved last month. The S&P 500 rose 0.5% early Wednesday. The Dow Jones Industrial Average added 237 points, and the Nasdaq composite rose 0.6%. Treasury yields climbed in the bond market after the Labor Department said U.S. employers added 130,000 jobs to their payrolls last month, more than economists had expected. Moderna slumped after the Food and Drug Administration refused to consider its application for a new flu vaccine. Indexes rose across much of Asia and Europe.",
      "publishedAt": "2026-02-11T04:24:12Z",
      "title": "Wall Street climbs to record levels after a report showing the jobless rate improved",
      "url": "https://apnews.com/article/stocks-markets-fed-retail-profit-4cfa87d4a833d315ed219dcd22da2f49",
      "urlToImage": "https://dims.apnews.com/dims4/default/72e1484/2147483647/strip/true/crop/5568x3710+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Ffa%2F253e9d8bc7cb054bea6a4523085b%2F83cf116faf514d2094f3ea9f40ca095f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}