{
  "articles": [
    {
      "author": null,
      "description": "Switzerland is home to some of the world’s most recognizable luxury brands. It now faces a 39% tariff as a result of U.S. President Donald Trump’s trade war. Industry groups warned that both Swiss companies and American consumers could pay the price. Swiss officials failed to reach an agreement with the U.S. after Trump initially threatened a 31% tariff in April. The Swiss government spent Friday reeling from the news. The U.S. goods trade deficit with Switzerland was $38.5 billion last year. That's according to the Office of the United States Trade Representative.",
      "publishedAt": "2025-08-01T15:43:01Z",
      "title": "Switzerland, the land of luxury brands, could see prices skyrocket from Trump's 39% tariffs",
      "url": "https://apnews.com/article/switzerland-tariffs-trump-us-trade-war-3700eaf85a7eac02bb0fd52a0461176b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9529dc7/2147483647/strip/true/crop/6275x3530+0+327/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F65%2F30ad6c253389f8b7b255e4af5058%2F5804395bdaf44ea58548afba6b05e1b3"
    },
    {
      "author": null,
      "description": "American businesses and consumers are finding the contours of President Donald Trump’s foreign trade agenda taking shape. But they don't have much more clarity on how import taxes on goods from dozens of countries will affect them. Late Thursday, Trump ordered new tariff rates for 66 countries, the European Union, Taiwan and the Falkland Islands. Trump postponed the start date for all of the tariffs from Friday until Aug. 7. Companies are dealing with tariffs in various ways, from absorbing the tax costs themselves to raising prices. Economist say U.S. consumers are likely to foot at least part of the bill.",
      "publishedAt": "2025-08-01T15:31:53Z",
      "title": "Economists say US consumers are likely to see effects from Trump's tariffs",
      "url": "https://apnews.com/article/trump-tariffs-consumers-prices-ebf959d8f8ad24bd0757d8e3693924c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/bed8879/2147483647/strip/true/crop/3000x1688+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2Fff%2F89676f2f6a4c21237df3f1c58600%2Fc351168a2edc485ca1e7fc818f86c6d2"
    },
    {
      "author": null,
      "description": "World shares have retreated after President Donald Trump issued a new set of import duties that will apply to dozens of countries as of Aug. 7. U.S. futures fell 0.9% after Trump announced tariff rates of up to 41% for imports from 68 countries and the European Union and a separate increase to 35% for Canada, effective Friday. European shares were down more than 1.5% and the Kospi in South Korea sank nearly 4%. Oil prices also fell. On Thursday, the S&P 500 fell 0.4% while the Dow lost 0.7%. The Nasdaq composite index closed less than 0.1% lower.",
      "publishedAt": "2025-08-01T05:31:50Z",
      "title": "World shares fall after Trump's order imposing new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-asia-wall-street-5bf5640b85f63cf7db292d0aaf26e97a",
      "urlToImage": "https://dims.apnews.com/dims4/default/38c8961/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Ff7%2F9c4efc260269e89c30fb4ce3bafd%2F444eba4af8134cf384bb1ed640627575"
    },
    {
      "author": null,
      "description": "President Donald Trump is calling for the Federal Reserve’s board of governors to usurp the power of Fed Chair Jerome Powell. Trump criticized the head of the U.S. central bank for not cutting short-term interest rates. Posting on Truth Social on Friday, Trump calls Powell “stubborn.” The Fed chair has been subjected to vicious verbal attacks by the Republican president over several months. The Fed has the responsibility of stabilizing prices and maximizing employment. Powell has held its benchmark rate for overnight loans constant this year, saying Fed officials needed to see what impact Trump’s massive tariffs had on inflation.",
      "publishedAt": "2025-08-01T11:45:51Z",
      "title": "Trump wants Fed board to take control from Powell",
      "url": "https://apnews.com/article/trump-powell-interest-rates-federal-reserve-fed-88fe11c20c3074bbd1445a69bbdc623e",
      "urlToImage": "https://dims.apnews.com/dims4/default/175ec6a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F79%2F1956baa6063aa3a8fa2448a900e8%2F963e843df70847c49f82b8d948a2e32e"
    },
    {
      "author": null,
      "description": "Jeffrey Epstein’s former girlfriend, Ghislaine Maxwell, has been moved from a federal prison in Florida to a prison camp in Texas as her criminal case generates renewed public attention. The federal Bureau of Prisons said Friday that Maxwell was taken to Bryan, Texas, but did not explain the circumstances. Her attorney confirmed the move but also declined to discuss the reasons for it. Maxwell was convicted in 2021 of helping Epstein sexually abuse underage girls and was sentenced to 20 years in prison. She had been held at a prison in Tallahassee, Florida, until her transfer to the camp in Texas.",
      "publishedAt": "2025-08-01T16:38:53Z",
      "title": "Former Epstein girlfriend Ghislaine Maxwell transferred to prison camp in Texas",
      "url": "https://apnews.com/article/epstein-ghislaine-maxwell-justice-department-prison-27d53cd22f8c53d9f2b5012cea32eb5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump’s special envoy Steve Witkoff has visited southern Gaza on Friday during international outrage over starvation, shortages and deadly chaos near aid distribution sites. An official involved with the visit says Witkoff and U.S. Ambassador to Israel Mike Huckabee toured one of Gaza Humanitarian Foundation’s distribution sites in Rafah, Gaza’s southernmost city. All four of the group’s distribution sites are in zones controlled by the Israeli military and have become flashpoints of desperation. Hundreds have been killed by gunfire or trampling. The Israeli military says it has only fired warning shots at people who approach its forces. GHF says its armed contractors have only used pepper spray or fired warning shots.",
      "publishedAt": "2025-08-01T10:52:58Z",
      "title": "US envoy visits distribution site in Gaza as humanitarian crisis worsens",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-08-1-2025-038b7191ca02608f9b7d8236292096f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Kyiv is observing a day of mourning after a Russian drone and missile attack killed 31 people, including five children, and injured over 150. The attack on Thursday marked the highest number of child casualties in a single strike on the city since October 2022. The Russian assault destroyed a large part of a nine-story residential building and damaged over 100 other structures. Ukrainian President Volodymyr Zelenskyy has called for stronger sanctions against Russia. Meanwhile, Ukrainian forces are under pressure in the eastern city of Chasiv Yar as Russia pushes to break through defenses.",
      "publishedAt": "2025-08-01T09:13:36Z",
      "title": "Kyiv mourns after a Russian attack that killed 31 people",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-attack-trump-putin-42474bc80c492190ec88861322ff0f84",
      "urlToImage": "https://dims.apnews.com/dims4/default/2867149/2147483647/strip/true/crop/3349x1884+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F0d%2F1a0f2c6008c8c4b51e01d996411e%2F136fab7ccc7c4b7e887323065769ace8"
    },
    {
      "author": null,
      "description": "The Smithsonian Institution has removed a reference to President Donald Trump's impeachments from an exhibit. It says it's temporary. This decision comes as the White House presses for a more positive view of American history. A label about impeachment was added in 2021 to the National Museum for American History's exhibit on presidential power. Smithsonian spokesperson Phillip Zimmerman said the section needed an overhaul. Trump is the only president impeached twice, in 2019 and 2021. Zimmerman says the impeachment reference will be restored after revisions. Since January, Trump has demanded changes across Washington cultural institutions, including the Smithsonian, the Library of Congress, and the Kennedy Center.",
      "publishedAt": "2025-08-01T15:54:05Z",
      "title": "Smithsonian removes Trump impeachment reference from exhibit",
      "url": "https://apnews.com/article/smithsonian-trump-impeachment-label-removed-d15860f008d6645d196b4c542f870475",
      "urlToImage": "https://dims.apnews.com/dims4/default/0952922/2147483647/strip/true/crop/5508x3098+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2Fe4%2F6187203c497350c290ac0bb4f109%2F0323fb9a5cca40e5ac0288b24e4e48a4"
    },
    {
      "author": null,
      "description": "Aviation experts say night vision goggles may have created some difficulties for the pilots on an Army helicopter that collided with a passenger jet in January. For example, the goggles would have made it difficult for the pilots to see the plane’s colored lights. The goggles also limited the pilots’ peripheral vision as they flew near Ronald Reagan Washington National Airport. The goggles were discussed Friday before the National Transportation Safety Board. It's wrapping up its final day of public testimony about the January fatal midair crash that killed 67 people. The final report on the crash is expected next year.",
      "publishedAt": "2025-08-01T04:05:49Z",
      "title": "NTSB to finish public investigative hearings on fatal midair crash",
      "url": "https://apnews.com/article/ntsb-hearings-army-helicopter-airplane-crash-potomac-984dc835b1cc63274768192a404bfa2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/606f944/2147483647/strip/true/crop/6577x3700+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fe3%2F57e0d55f5b94790d034a5cdccd6d%2F70e88dd0d8fd4bb088694daa3d05c0e6"
    },
    {
      "author": null,
      "description": "A teacher who authorities say admitted to fatally stabbing a couple he didn’t know who were hiking with two of their children in an Arkansas state park is expected to have his first court appearance. Andrew James McGann has been charged with two counts of capital murder in the killing Saturday of 43-year-old Clinton David Brink and his 41-year-old wife Cristen Amanda Brink. He is being held without bond and is expected to appear Friday morning at the Washington County Detention Center. The Associated Press has left messages at numbers listed for McGann. It is unclear if he has a lawyer.",
      "publishedAt": "2025-08-01T04:38:36Z",
      "title": "Arkansas trail killing suspect to appear in court",
      "url": "https://apnews.com/article/arkansas-trail-killing-suspect-court-appearance-376a70c6340aef654ddd34fda11b42cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/41eb7fd/2147483647/strip/true/crop/7262x4085+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fad%2F3da910017abe93f0b79cad3f7162%2F16fa0b2df7da4276b000ed5e34f9d921"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}