{
  "articles": [
    {
      "author": "KRYSTA FAURIA, ETHAN SWOPE, JAKE OFFENHARTZ and JOSEPH B. FREDERICK",
      "description": "LOS ANGELES (AP) — Police in riot gear massed on the UCLA campus and ordered a large group of pro-Palestinian demonstrators inside a fortified encampment to leave the area or face arrest late Wednesday, one night after violence instigated by counter-protesters erupted in the same place.",
      "publishedAt": "2024-05-02T04:03:30Z",
      "title": "Tension grows on UCLA campus as police order dispersal of large pro-Palestinian gathering",
      "url": "https://apnews.com/ec3f62c51c08599f8fcecd99f7cf9e33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c25b19d43b74e3ab5d6d482b078cab0/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Before police officers poured into Columbia University on Tuesday night, arresting more than 100 people as they cleared an occupied school building and tent encampment, New York City Mayor Eric Adams said he received a piece of intelligence that shifted his thinking about the campus demonstrations over the war in Gaza.",
      "publishedAt": "2024-05-01T22:37:15Z",
      "title": "A retired teacher saw inspiration in Columbia's protests. Eric Adams called her an outside agitator",
      "url": "https://apnews.com/5319fdf36599295a3840d77c69458b57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c621479a8f9e4ebb97ad0d027c37052e/2048.jpeg"
    },
    {
      "author": "MATTHEW LEE, SAMY MAGDY and SAM MEDNICK",
      "description": "JERUSALEM (AP) — U.S. Secretary of State Antony Blinken hiked up pressure on Hamas on Wednesday to accept the latest proposal for a cease-fire with Israel, saying the “time is now” for an agreement that would free hostages and pause the nearly seven months of war in Gaza.",
      "publishedAt": "2024-05-01T07:17:43Z",
      "title": "Blinken presses Hamas to seal cease-fire with Israel, says 'the time is now' for a deal",
      "url": "https://apnews.com/7cbf7c696989cdc3a22383c823fb2e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd602bcf52a8465784bedb2ad4e37db7/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump faces the prospect of additional sanctions in his hush money trial as he returns to court Thursday for another contempt hearing followed by testimony from a lawyer who represented two women who have said they had sexual encounters with the former president.",
      "publishedAt": "2024-05-02T04:03:50Z",
      "title": "Trump faces prospect of additional sanctions in hush money trial as key witness resumes testimony",
      "url": "https://apnews.com/fe6995afbc96650b67f46d813ab05f06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51c5a7cad32e4735bd8f4b44e5b787c8/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Two years after a leaked draft of a U.S. Supreme Court opinion signaled that the nation's abortion landscape was about to shift dramatically, the issue is still consuming the nation's courts, legislatures and political campaigns — and changing the course of lives.",
      "publishedAt": "2024-05-02T04:12:21Z",
      "title": "Abortion is still consuming US politics and courts 2 years after a Supreme Court draft was leaked",
      "url": "https://apnews.com/9ee070c3540cb730b251d707e5f98ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60986915986f4ad58aba0fab284879ef/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KHARKIV, Ukraine (AP) — During pitched battles with far better-armed Russian forces, Ukrainian soldier Batyar’s unit has few options.Devastating Russian aerial glide bombs that can drop up to 1.5 tons of explosives out of range of most of Ukraine's air defenses are gnawing away at his men’s positions in a new tactic.",
      "publishedAt": "2024-05-02T04:04:43Z",
      "title": "No safety in retreat: Ukrainian soldiers say rear defensive lines barely exist amid Russian advance",
      "url": "https://apnews.com/8a72981dfdb755de6f8011b13f4d062e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/884511ef1fd849dd84aac77e2ad512ca/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A section of a highway collapsed after heavy rains in a mountainous area in southern China, sending cars tumbling down a slope and leaving at least 36 people dead, authorities said Thursday.",
      "publishedAt": "2024-05-01T05:02:11Z",
      "title": "A highway collapse in China kills 36 people and sends more than 20 cars down a steep slope",
      "url": "https://apnews.com/59a28381cdff792c2ccd2861ea7ef5bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2ad4924d3f54456b3ff96b9974afc8f/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "FORT LIBERTY, N.C. (AP) — The video is unsettling, with haunting images of faceless people, fire and soldiers. The voiceover is a cascade of recognizable historical voices as the screen pulses cryptic messages touting the power of words, ideas and “invisible hands.”",
      "publishedAt": "2024-05-02T04:31:30Z",
      "title": "Faceless people, invisible hands: New Army video aims to lure recruits for psychological operations",
      "url": "https://apnews.com/f216951fdaff4fa0130386a8f85c76e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e335fbbf17534b94a18b1113a36b0aab/2560.jpeg"
    },
    {
      "author": "DAVID KLEPPER and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Bollywood stars seldom weigh in on politics, so videos showing two celebrities criticizing Indian Prime Minister Narendra Modi — and endorsing his main opposition, the Congress party — were bound to go viral.",
      "publishedAt": "2024-05-02T05:13:23Z",
      "title": "As India votes, misinformation surges on social media: 'The whole country is paying the price'",
      "url": "https://apnews.com/703a56c73f9341393f05400ea218b87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2f0cd67a6f54cc48ee0061539e1c95e/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "DUESSELDORF, Germany (AP) — Herbert Rubinstein was 5 years old when he and his mother where taken from the Jewish ghetto of Chernivtsi and put on a cramped cattle wagon waiting to take them to their deaths.",
      "publishedAt": "2024-05-02T04:12:15Z",
      "title": "At time of rising antisemitism, Holocaust survivors take on denial and hate in new digital campaign",
      "url": "https://apnews.com/3706dc209ecee009a7e0d6651498d8bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d537cafebd24d0b94efe89dbfadb525/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}