{
  "articles": [
    {
      "author": "MICHAEL R. BLOOD",
      "description": "LOS ANGELES (AP) — Two months after his historic ouster as House speaker, Republican Rep.",
      "publishedAt": "2023-12-06T16:33:06Z",
      "title": "GOP Rep. Kevin McCarthy of California is resigning, 2 months after his ouster as House speaker",
      "url": "https://apnews.com/84fc76226de7d20e140325bbe87622c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93082c06a5e04d3092f8503bfdb3c27e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Intense fighting blocked relief workers from distributing food, water and medicine across most of the Gaza Strip, deepening the humanitarian crisis as Israeli forces battled Hamas militants Wednesday in a ground offensive that has brought some of the devastation and mass displacement seen in the north to the south.",
      "publishedAt": "2023-12-06T07:21:50Z",
      "title": "Heavy fighting in Gaza halts most aid delivery and leaves civilians with few places to seek safety",
      "url": "https://apnews.com/156afcb1626f1cb4e9e26e5430c7185c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61184714085445a288f0b9aeeedf11c7/1920.jpeg"
    },
    {
      "author": "BILL BARROW and JONATHAN J. COOPER",
      "description": "TUSCALOOSA, Ala. (AP) — The shrinking field of Republican presidential hopefuls will gather on a debate stage Wednesday for the fourth time this year, running out of time to shake up a race that's been dominated by former President Donald Trump.",
      "publishedAt": "2023-12-06T05:03:35Z",
      "title": "A narrowing Republican presidential field will debate with just six weeks before the Iowa caucuses",
      "url": "https://apnews.com/0b53c0fb84ab64e62ea3697ac9d8be08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37973e2172f841df8b3f2893cc83a951/3000.jpeg"
    },
    {
      "author": "LYNN ELBER",
      "description": "LOS ANGELES (AP) — Norman Lear, the writer, director and producer who revolutionized prime time television with \"All in the Family,\" “The Jeffersons” and “Maude,” propelling political and social turmoil into the once-insulated world of TV sitcoms, has died.",
      "publishedAt": "2023-12-06T13:55:11Z",
      "title": "Norman Lear, producer of TV's 'All in the Family' and influential liberal advocate, has died at 101",
      "url": "https://apnews.com/87300f0e49b54c05803ab315dfdf9933",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/313f15b1a14d4a608d4c1ca973418a46/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and COLLEEN LONG",
      "description": "WASHINGTON (AP) — It was a decade ago that Capitol Hill was consumed by an urgency to overhaul the nation’s immigration system, fueled in no small part by Republicans who felt a political imperative to make inroads with minority voters by embracing more generous policies.",
      "publishedAt": "2023-12-06T05:04:24Z",
      "title": "Washington's center of gravity on immigration has shifted to the right. Can the parties make a deal?",
      "url": "https://apnews.com/7507034034ba49a8f170777600cad46e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2569bb53fe84513b12d53a3540fb517/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The U.S. is expected to announce a $175 million package of military aid to Ukraine on Wednesday, including guided missiles for the High Mobility Artillery Rocket Systems (HIMARS), anti-armor systems and high-speed anti-radiation missiles, according to U.S.",
      "publishedAt": "2023-12-06T16:32:22Z",
      "title": "US expects to announce new weapons aid for Ukraine as Congress is stalled on more funding",
      "url": "https://apnews.com/24735694f4f93e5a571f30004957e1a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec6272ec41324e6bae8c7076d7f3f173/2176.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "VERONA, Italy (AP) — Sitting on a terrace in Verona as the bells toll at a nearby medieval church, Igor Makarov sips coffee as he describes his life as a billionaire under Western sanctions.Most of his fortune earned doing business in Russia and the former Soviet Union is frozen, and his plans to develop his energy businesses are currently shelved.",
      "publishedAt": "2023-12-06T06:10:18Z",
      "title": "The West has sanctioned Russia's rich. But is that really punishing Putin and helping Ukraine?",
      "url": "https://apnews.com/fc2d9d2bba3e81f27b14f7e69a7df818",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25f8ec331aab4c1b9ae1aef6a3cb00e2/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Ten Republicans who posed as fake electors for former President Donald Trump in Wisconsin and filed paperwork falsely saying he had won the battleground state have settled a civil lawsuit and admitted their actions were part of an effort to overturn President Joe Biden's victory, attorneys who filed the case announced Wednesday.",
      "publishedAt": "2023-12-06T17:07:59Z",
      "title": "Fake Donald Trump electors settle civil lawsuit in Wisconsin, agree that President Biden won",
      "url": "https://apnews.com/fff7cd21e3083f300874eccd69141f8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01d7246b8c1348ef9f5be43155f7f522/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Just how hard did some Republican members of Congress work to keep President Donald Trump in office after his 2020 election loss?",
      "publishedAt": "2023-12-06T05:06:30Z",
      "title": "A court filing gives a rare look inside the FBI seizure of a lawmaker's phone in 2020 election probe",
      "url": "https://apnews.com/5ea6f446145f81437d5a534197481dc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7cdbda246d247609c3a7dcc3352cb40/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "In weather terminology, they call it “rapid intensification” — the process by which a storm strengthens dramatically in a short period.In pop culture terminology, they call it Taylor Swift.",
      "publishedAt": "2023-12-06T16:54:33Z",
      "title": "2023 (Taylor's Version): The year in pop culture",
      "url": "https://apnews.com/9689644b1967304b0d7acbbbdd7bebce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70080c039b8647e3ba3d4f93190b14ba/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}