{
  "articles": [
    {
      "author": "JACK JEFFERY and TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israel's military announced Sunday it had withdrawn its forces from the southern Gaza city of Khan Younis, wrapping up a key phase in its ground offensive against the Hamas militant group and bringing its troop presence in the territory to one of the lowest levels since the six-month war began.",
      "publishedAt": "2024-04-07T13:12:13Z",
      "title": "Israel is pulling some troops from southern Gaza. Now the plan is to clear Hamas from Rafah",
      "url": "https://apnews.com/5257a90302686de80788469f74aab40c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65e61f2ca9c84bec9c3ccfd8fa91624b/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "NUSEIRAT, Gaza Strip (AP) — Rockets streaked through the morning sky in Gaza on Oct. 7 as Amal Al-Taweel hurried to the hospital in the nearby Nuseirat refugee camp, already in labor. After a difficult birth, she and her husband, Mustafa, finally got to hold Ali, the child they spent three years trying to have.",
      "publishedAt": "2024-04-07T04:08:30Z",
      "title": "These Palestinian mothers in Gaza gave birth Oct. 7. Their babies have known only war",
      "url": "https://apnews.com/8350dcdd42f717530a1a1f5ad40e2ee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e69513662d594c3ca520155cf8b1a413/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — The head of the U.N.’s atomic watchdog agency on Sunday condemned a Ukrainian drone strike on one of six nuclear reactors at the Russian-controlled Zaporizhzhia Nuclear Power Plant in Ukraine, saying such attacks “significantly increase the risk of a major nuclear accident.\"",
      "publishedAt": "2024-04-07T14:34:25Z",
      "title": "Attacks on Zaporizhzhia nuclear plant significantly increase accident risk, IAEA head says",
      "url": "https://apnews.com/a28710a691f3259b5dd6586787838b60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4e0850dd5b4556b68a1df613b99b1d/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "CLEVELAND (AP) — Kamilla Cardoso delivered once again for Dawn Staley and South Carolina.A perfect finish. A dynasty. A team too big for Caitlin Clark and Iowa this time around.Cardoso had 15 points and a career-high 17 rebounds, and South Carolina completed its perfect season with an 87-75 victory over Clark and the Hawkeyes in the NCAA championship game on Sunday.",
      "publishedAt": "2024-04-07T21:13:59Z",
      "title": "South Carolina finishes perfect season with NCAA championship, beating Clark and Iowa 87-75",
      "url": "https://apnews.com/80c556d6a9130a301d0f59e6eb997a4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c886f27e68274907a33b1d9c2321173d/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "MESQUITE, Texas (AP) — Eclipse spectators staked out their spots across three countries Sunday, fervently hoping for clear skies despite forecasts calling for clouds along most of the sun-vanishing route.",
      "publishedAt": "2024-04-07T20:24:10Z",
      "title": "Weather is the hot topic as eclipse spectators stake out their spots in US, Mexico and Canada",
      "url": "https://apnews.com/06767dd9e63cce8eb2351c22e90e38b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dc7bf3056aa42cc9d706bfd3c28c7a1/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GABRIELA MOLINA",
      "description": "QUITO, Ecuador (AP) — The global condemnation of Ecuador's government for its decision to break into the Mexican Embassy snowballed Sunday with more presidents and other leaders expressing disapproval, shock and dismay.",
      "publishedAt": "2024-04-07T11:11:59Z",
      "title": "International leaders condemn Ecuador after police break into the Mexican Embassy in Quito",
      "url": "https://apnews.com/e39b08390c4a2c83c5ae0ac234ddf135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c08e0086786d43599f94dd3ad32f114d/3000.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA and IGNATIUS SSUUNA",
      "description": "KIGALI, Rwanda (AP) — Rwandan President Paul Kagame blamed the inaction of the international community for allowing the 1994 genocide to happen as Rwandans on Sunday commemorated 30 years since an estimated 800,000 people were killed by government-backed extremists.",
      "publishedAt": "2024-04-07T09:09:08Z",
      "title": "Kagame blames the world's inaction as Rwanda commemorates the 1994 genocide with lingering scars",
      "url": "https://apnews.com/6322893ec7fa443177a70e00f796dfc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78d968d0bede4597b3fc61fbb97a5e3f/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — A Texas woman who went into premature labor, developed sepsis and nearly died and a Louisiana woman who said restrictive abortion laws prevented her from getting medical help for a miscarriage are now campaigning for President Joe Biden as the Democrat highlights how women's health is being affected by the overturning of federal abortion protections.",
      "publishedAt": "2024-04-07T14:22:06Z",
      "title": "2 women who say abortion restrictions put them in medical peril feel compelled to campaign for Biden",
      "url": "https://apnews.com/eb79daf45180e16ac594480a9345bcde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85506e9fcd8c43f39e4bf722aa0f3bd3/3000.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — When America's top diplomat called with condolences over the killing of John Flickinger's son in the Israeli airstrikes on a World Central Kitchen aid convoy in Gaza, Flickinger knew what he wanted to say.",
      "publishedAt": "2024-04-07T18:15:29Z",
      "title": "In call with Blinken, father of killed aid worker urges tougher US stance on Israel in Gaza",
      "url": "https://apnews.com/239831b06a160233f234f4544b76036e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47ac1f5c4b90400caa414e5c0db64aad/1200.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "The U.S. Food and Drug Administration’s accelerated approval program is meant to give patients early access to promising drugs.",
      "publishedAt": "2024-04-07T18:06:31Z",
      "title": "Many cancer drugs remain unproven 5 years after accelerated approval, a study finds",
      "url": "https://apnews.com/d5adffd124e0d038a8fd0357ced59546",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df8aec122d9e44a6afc11432f99c4eed/2742.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}