{
  "articles": [
    {
      "author": null,
      "description": "The Iranian state television says that Iran’s underground enrichment site at Fordo has been attacked again. The report, also carried by other Iranian media, offered no word on damage, nor who launched the assault on Monday. However, Israel has been conducted airstrikes throughout the day in Iran. The United States launched a major attack Sunday on three Iranian nuclear sites, including Fordo, which required the use of sophisticated bunker-buster bombs.",
      "publishedAt": "2025-06-23T08:39:17Z",
      "title": "Iran targets Israel with missiles and drones after US strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-trump-bomber-news-06-23-2025-9e78510c88ccc5e262341f41550609c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/77ef267/2147483647/strip/true/crop/6611x3719+0+344/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F82%2F6a4ec8601ce8668bc131d8460f7b%2F2b5d3290d6454d06b22cc7d63d4a4688"
    },
    {
      "author": null,
      "description": "President Donald Trump is calling for the U.S. and other oil-producing economies to pump more oil as crude prices remain volatile following U.S. strikes on Iranian nuclear facilities. The White House is also sharpening its warning to Iran against closing the Strait of Hormuz, a vital oil and gas shipping lane, in retaliation for the U.S. carrying out strikes on Iran’s nuclear program. Trump in a morning social media posting wrote, “To the Department of Energy: DRILL, BABY, DRILL!!! And I mean NOW!!!”",
      "publishedAt": "2025-06-23T16:01:15Z",
      "title": "Trump wants oil producers to pump more crude following strikes on Iran sites",
      "url": "https://apnews.com/article/trump-iran-oil-strait-hormuz-regime-change-35eb69d501e5e4fa00463009d539996e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c59acd/2147483647/strip/true/crop/2436x1370+0+127/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F02%2F53a2ad48fdccabe197292f0d0d5b%2Feee5b4f37c1e41099c66892c82c7aa4a"
    },
    {
      "author": null,
      "description": "European nations worked Monday to keep alive diplomatic efforts to curb the Israel-Iran war as the two countries traded strikes following the United States’ weekend attack on Iran’s nuclear program. Calls for Tehran to enter talks with Washington appeared to fall on deaf ears. Tehran reached out to ally Russia for support instead. At a meeting of European Union foreign ministers in Brussels, diplomats expressed concern about the potential for Iranian retaliation to spark a wider war and global economic instability. U.K. Foreign Secretary David Lammy urged Iran to meet European officials and to open talks with the U.S. But Iran has rejected negotiations with Washington and a European official said no more talks with Iran are currently planned.",
      "publishedAt": "2025-06-23T16:28:01Z",
      "title": "Europe tries to revive diplomacy after US strikes on Iran nuclear sites",
      "url": "https://apnews.com/article/iran-nuclear-us-strikes-europe-diplomacy-israel-114c02f97c8e0e1f5622a33b39802667",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d29762/2147483647/strip/true/crop/8182x4602+0+426/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F63%2Fb951677b68538c19fd4ac905eaed%2F14a56d76735e4cf58de54f479f363591"
    },
    {
      "author": null,
      "description": "Officials say Russian drones and missiles have killed at least 14 civilians in Ukraine, with nine deaths reported in the capital, Kyiv. Ukraine’s air force said Monday that Russia fired 352 drones and decoys overnight, as well as 11 ballistic missiles and five cruise missiles. Officials said a Russian ballistic missile strike also destroyed a high school later in the day in Ukraine’s southern Odesa region, killing two staff. No children were at the school due to the summer vacation. President Volodymyr Zelenskyy was on a visit to the U.K. in search of further military support for the fight against Russia's invasion.",
      "publishedAt": "2025-06-23T04:45:48Z",
      "title": "Russian attacks on Ukraine kill at least 14 people, most of them in Kyiv",
      "url": "https://apnews.com/article/russian-ukraine-war-attack-kyiv-deaths-injuries-aed85e211f1e43928b5bf52d718c1892",
      "urlToImage": "https://dims.apnews.com/dims4/default/e861fee/2147483647/strip/true/crop/5034x2832+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Ff8%2Fb1b46cc3ff8929b7491801b31140%2F35d04fcfe6154c51b1604ab76f8dbc3d"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump and his NATO counterparts are gathering this week for what might be a historic summit. It could also drive a wedge among the 32 member countries. Just a week ago, things had seemed rosy. NATO Secretary-General Mark Rutte was optimistic for an agreement to dedicate 5% of GDP to defense spending. Then Spain rejected the new target, calling it “unreasonable.” The following day, Trump said that America should not have to respect the goal. On Sunday, he ordered the bombing of nuclear installations in Iran, which could dominate the summit. Questions also remain over Ukraine’s place at the meeting.",
      "publishedAt": "2025-06-23T04:31:40Z",
      "title": "NATO summit could be historic or divided",
      "url": "https://apnews.com/article/nato-summit-military-spending-trump-ukraine-iran-17b6d6b193300baa492ef313c9aa629e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0acde0d/2147483647/strip/true/crop/2976x1674+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F4d%2Fb70e4976861dfc8060aaf4047884%2Ff06219d3873343b0a52232207e61e313"
    },
    {
      "author": null,
      "description": "The price of oil rose and U.S. stock futures fell as global markets react to the U.S. strike against nuclear targets in Iran. The price of Brent crude oil, the international standard, rose 3.9% to $80 a barrel. U.S. crude rose 4.3% to $77 a barrel. Futures for the S&P 500 fell 0.5%. Treasury yields fell slightly. On Saturday, U.S. forces attacked three Iranian nuclear and military sites, further increasing the stakes in the war between Israel and Iran.",
      "publishedAt": "2025-06-22T22:09:05Z",
      "title": "Oil rises and US stock futures slide as markets react to US strike on Iran nuclear sites",
      "url": "https://apnews.com/article/stock-market-oil-iran-attack-2d05b0a9e52320e822b649b8e29d28aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c94d39/2147483647/strip/true/crop/7914x4452+0+414/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F90%2F2eecf142336eabf9d44737a36b3e%2F97ee0a90b79b440581a83c1113dd8e1f"
    },
    {
      "author": null,
      "description": "A new report finds that the number of abortions in the U.S. grew in 2024 as more women obtained pills through telehealth. The latest WeCount project for the Society of Family Planning finds that 1 in 4 abortions uses medications prescribed by a provider who does not see the patient in person. That is up from 1 in 20 in the months before the U.S. Supreme Court overturned Roe v. Wade in 2022. The number may explain why another recent study found that fewer women crossed state lines for abortion in 2024 than the year before.",
      "publishedAt": "2025-06-23T10:02:37Z",
      "title": "Abortion numbers rose in 2024 because of more telehealth prescriptions, report finds",
      "url": "https://apnews.com/article/abortion-data-wecount-pills-telehealth-anniversary-7d42e427bc1e26d2ea7b48b8f20a042e",
      "urlToImage": "https://dims.apnews.com/dims4/default/16a12f1/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F06%2F73291d06ac822ff712a752309d35%2F33c5ffe4ca7940c38f4ddcc6b0c2a4bc"
    },
    {
      "author": null,
      "description": "A jury has watched nearly 20 minutes of recordings of marathon sex events that prosecutors and defense lawyers have both cited as important to the outcome of the sex trafficking trial of music mogul Sean “Diddy” Combs. The recordings shown to the jury Monday by prosecutors roughly doubled the time the jury has spent viewing the explicit footage of two of Combs' former girlfriends sexually involved with male sex workers while Combs filmed the encounters. Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges. Prosecutors expect to rest by Tuesday. After a defense presentation, closing arguments are expected to occur Thursday.",
      "publishedAt": "2025-06-23T17:29:40Z",
      "title": "Jury sees more sex videos as prosecutors wind down case against Sean 'Diddy' Combs",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-drugs-62083111db88dd2fee04ddc63dcabe0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3a62e9/2147483647/strip/true/crop/2396x1348+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F2c%2Fab7c01fca4b716c9e1dfebac6abd%2F937ad5043233412b9f312a2b5541d372"
    },
    {
      "author": null,
      "description": "Dozens of researchers are chasing, driving and running into storms to collect fresh hail, getting their car bodies and their own bodies dented in the name of science. They hope these hailstones will reveal secrets about storms, damage and maybe the air itself. But what do you do with nearly 4,000 melting iceballs? A lot. Researchers in the first-of-its-kind Project ICECHIP to study hail are measuring the hailstones, weighing them, slicing them, crushing them, chilling them, driving them across several states, seeing what’s inside of them and in some cases — which frankly is more about fun and curiosity — eating them.",
      "publishedAt": "2025-06-23T13:01:01Z",
      "title": "Storm chasers crush and weigh hailstones to improve weather forecasts",
      "url": "https://apnews.com/article/hail-storms-climate-change-science-tornadoes-805cc4a9cd4735ad757685afa69ca1c4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1cc4467/2147483647/strip/true/crop/4766x2681+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Fc3%2F0f72cd1644addef4da2b4bb17fb8%2F0f30c10728b54bdba73dbd57d0905c07"
    },
    {
      "author": null,
      "description": "The largest digital camera ever built has released its first shots of the universe. The Vera C. Rubin Observatory, located on a mountaintop in Chile, unveiled vibrant images Monday of colorful nebulas, stars and galaxies. Funded by the U.S. National Science Foundation and Department of Energy, the observatory will survey the southern sky for the next 10 years. The observatory hopes to track 20 billion galaxies and discover new asteroids and other celestial objects. The effort is named after astronomer Vera Rubin, who offered the first tantalizing evidence of a mysterious force called dark matter.",
      "publishedAt": "2025-06-23T14:08:57Z",
      "title": "Vera C. Rubin Observatory unveils its first images of galaxies and nebulas",
      "url": "https://apnews.com/article/vera-rubin-observatory-nsf-d7b645d2b1c0caad16f0945e1227a9b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/a72aa68/2147483647/strip/true/crop/5120x2880+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fcc%2Fb50674b2f6f23a6d6eb12e6a27e6%2Faa5429d6ae8045f786bf202d2f1560cf"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}