{
  "articles": [
    {
      "author": "LINLEY SANDERS",
      "description": "Many U.S. adults believe the federal government is overspending. But polling also shows many Americans, including Republicans, think the country is spending too little on major government programs like Social Security. The polls from The Associated Press-NORC Center for Public Affairs Research come as President Donald Trump and adviser Elon Musk push for extensive cuts throughout the federal government, slashing funding for humanitarian aid and turning their attention to the Department of Education and the military. The polls suggest Americans may not agree with where the Republican administration’s cuts should fall. A January AP-NORC poll shows about two-thirds of Americans say the government is spending “too little” on Social Security and education.",
      "publishedAt": "2025-02-14T12:03:57Z",
      "title": "Where US adults think the government is spending too much",
      "url": "https://apnews.com/article/ap-poll-government-spending-social-security-medicare-8a8ddb0e721355a4e9585da4147efe1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "ELLEN KNICKMEYER, LINDSAY WHITEHURST",
      "description": "A federal judge has ordered the Trump administration to temporarily lift a funding freeze shutting down U.S. humanitarian aid and development worldwide. Judge Amir Ali's order Thursday gives the Republican administration five days to show it’s complying. The judge cites the financial devastation that the sudden funding cutoff has caused suppliers and nonprofits that help the U.S. carry out aid programs overseas. Contractors, farmers and suppliers in the U.S. and around the world say the Trump administration’s funding freeze has stiffed them on hundreds of millions of dollars. Trump says the U.S. Agency for International Development, or USAID, and much of foreign assistance overall is out of line with his agenda.",
      "publishedAt": "2025-02-14T13:01:35Z",
      "title": "Judge sets a 5-day deadline for the Trump administration to start lifting its USAID funding freeze",
      "url": "https://apnews.com/article/usaid-trump-funding-freeze-musk-lawsuit-67e4c708955a652e5e4d39ce157d6113",
      "urlToImage": "https://dims.apnews.com/dims4/default/d12e960/2147483647/strip/true/crop/5921x3331+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Ffe%2Fe64363a6441b949af6175d0e675a%2F90a36d535b1c4ca5a255f18d6be40c83"
    },
    {
      "author": "MATTHEW DALY",
      "description": "In a major reversal, the new head of the Environmental Protection Agency says he'll try to rescind $20 billion in grants awarded by the Biden administration for climate and clean-energy projects. EPA Administrator Lee Zeldin says the agency will revoke contracts for a “green bank” that is set to fund thousands of projects to fight climate change and promote environmental justice. The program was approved by Democrats under President Joe Biden’s signature climate law. Republicans in Congress have called the green bank a “slush fund” and voiced concern over how the money will be used.",
      "publishedAt": "2025-02-13T19:24:19Z",
      "title": "EPA chief says he will seek return of $20 billion in clean-energy grants awarded by Biden",
      "url": "https://apnews.com/article/green-bank-epa-zeldin-climate-clean-energy-191b394cda251ef772867369f61f07b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a389330/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F7a%2Fbd55bf047c6c094651ad051d63c8%2F2d0c6f19ac574680be63d630a7f57bda"
    },
    {
      "author": "MIKE STOBBE, CARLA K. JOHNSON",
      "description": "Department of Health and Human Services officials expect most of the agency’s roughly 5,200 probationary employees to be fired. That’s according to a recording of a staff meeting shared with The Associated Press. Included in that tally are nearly 1,300 employees at the Centers for Disease Control and Prevention. The moves are part of the Trump administration’s bid to get rid of nearly all probationary employees.",
      "publishedAt": "2025-02-14T15:19:59Z",
      "title": "HHS to lose thousands of workers under Trump administration probationary job cuts",
      "url": "https://apnews.com/article/trump-job-cuts-health-cdc-0d002fd6f528a7b91ced79628bf68196",
      "urlToImage": "https://dims.apnews.com/dims4/default/67f85a2/2147483647/strip/true/crop/5221x2937+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F90%2F1dc3bdb229721f46e418b0ac2f5a%2F9af97671f2f646a19933bcb709bcfca7"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Danielle Sassoon had served just three weeks as interim U.S. Attorney for the Southern District of New York when she penned a letter to U.S. Attorney General Pam Bondi saying she could not follow a directive to drop the office’s corruption case against New York City Mayor Eric Adams. Her resignation was accepted and the standoff has become a public airing of the battle between political priorities and criminal culpability. Sassoon said in her letter that she was confident in the criminal charges and cited her objections to what she called a political “quid pro quo” with Adams' legal team.",
      "publishedAt": "2025-02-14T18:35:57Z",
      "title": "Who is Danielle Sassoon, the US attorney who resigned rather than drop charges against Eric Adams?",
      "url": "https://apnews.com/article/danielle-sassoon-resignation-letter-bio-eric-adams-a20ac0413ff3d426715c327863cc4f42",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc3edd0/2147483647/strip/true/crop/4173x2347+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F38%2Fa796397fe3b1fb28d74b77242bff%2F9164466f88664264bfc35c081775c266"
    },
    {
      "author": "GARY FIELDS, TIM SULLIVAN",
      "description": "Investigators say the crew of the helicopter that collided midair with an American Airlines jet near Washington D.C.’s Ronald Reagan National Airport might not have heard instructions from the air traffic controller to pass behind the plane. National Transportation Safety Board Chairwoman Jennifer Homendy said the recording from the Black Hawk helicopter cockpit suggests the crew may have missed the key instruction just before the Jan. 29 collision, in which all 67 aboard the two aircraft were killed.",
      "publishedAt": "2025-02-14T19:46:27Z",
      "title": "Helicopter crew in collision with plane may not have heard key instruction from tower, NTSB says",
      "url": "https://apnews.com/article/washington-national-airport-aircraft-crash-ntsb-3dec2686beb43ada10ce392c857751cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/9708267/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F3c%2F2735cc41f49cf793fd68c611bb23%2F9cddda579bdd4edbb13215b642bd5b33"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "After nearly 500 days in captivity in Gaza, with little access to media, recently freed hostages have many questions. Now home in Israel, they are confronting a flood of information about loved ones and destroyed communities, and are still figuring out their place in a changed world. Their families are grappling with how to fill them in on what they missed without potentially deepening their trauma. One hostage forced to speak at a staged Hamas ceremony before his release told a crowd of masked militants and journalists that he was looking forward to seeing his wife and two teenage daughters. It wasn't until he arrived back in Israel that he learned the crushing reality: all three had been killed during the Oct. 7 attack.",
      "publishedAt": "2025-02-14T13:46:23Z",
      "title": "Hostages freed from Gaza discover personal lives shattered by Hamas",
      "url": "https://apnews.com/article/israel-hostages-gaza-hamas-ceasefire-af820b4bd1d62de94e2022b521db268c",
      "urlToImage": "https://dims.apnews.com/dims4/default/affd4e0/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F87%2F46fa691be794d9b03affc412dc37%2F5625e60bd3ab4d1eb63643ff2e8409a0"
    },
    {
      "author": "FATIMA HUSSEIN, JOSH BOAK",
      "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system. That's after Democratic senators raised red flags about the access provided to Trump aide Elon Musk’s Department of Government Efficiency. The audit will also review the past two years of the system’s transactions as it relates to Musk’s assertion of “alleged fraudulent payments.” That's according to a letter from Treasury’s deputy inspector general obtained Friday by The Associated Press. The audit marks part of the broader effort led by Democratic lawmakers and federal employee unions to provide transparency about DOGE’s activities under President Donald Trump's Republican administration.",
      "publishedAt": "2025-02-14T15:00:34Z",
      "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
      "url": "https://apnews.com/article/treasury-inspector-general-audit-doge-musk-democrats-d1e2710d0b63f54a8c1fe50fe4f23d4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03d34b/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fef%2Fb447c386aed921b95de41bf9d695%2Fcbf9c83827c049c99de488ebc7fc15ad"
    },
    {
      "author": "AAMER MADHANI, EMMA BURROWS, STEFANIE DAZIO",
      "description": "Ukrainian President Volodymyr Zelenskyy says his country wants “security guarantees” before any talks to end the Ukraine-Russia war. Zelenskyy made his remarks Friday during a highly anticipated meeting with U.S. Vice President JD Vance at the Munich Security Conference. Shortly before sitting down with Vance, Zelenskyy said he will only agree to meet in-person with Russian leader Vladimir Putin after a common plan is negotiated with U.S. President Trump. Zelenskyy said he believes Trump is the key to ending the war, and said the U.S president gave him his telephone number.",
      "publishedAt": "2025-02-14T05:02:03Z",
      "title": "Zelenskyy to Vance: Ukraine wants 'security guarantees' as Trump seeks to end Ukraine-Russia war",
      "url": "https://apnews.com/article/vance-rubio-munich-security-conference-ukraine-ab2d7379aaf6ca224cc51e1f9ade9edf",
      "urlToImage": "https://dims.apnews.com/dims4/default/b75f120/2147483647/strip/true/crop/3871x2177+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F83%2Fa18f599f963f63b86c9380132ac8%2F410f15afdce44ba181a3c95856ef1b32"
    },
    {
      "author": "MANUEL VALDES",
      "description": "A second federal judge has paused President Donald Trump’s executive order halting federal support for gender-affirming care for transgender youth under 19. U.S. District Court Judge Lauren King issued a temporary restraining order on Friday. The decision came one day after another federal judge in Baltimore temporarily blocked Trump’s directive for 14 days. The president’s order calls for halting federal funding for institutions that provide the care and excluding the care from coverage through government-run insurance programs. Democratic attorneys general from Washington state, Oregon and Minnesota argue the order discriminates against transgender people.",
      "publishedAt": "2025-02-14T19:16:58Z",
      "title": "Second federal judge pauses Trump’s order against gender-affirming care for youth",
      "url": "https://apnews.com/article/trump-transgender-judge-seattle-restraining-order-granted-7dc418e445ddf74c7f69c777839373b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/473136c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fee%2Febef4326bdab6d992e302f84f5d8%2F9dc65f88da0047ab88b2001b2fb7b23e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}