{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, ABBY SEWELL and MATTHEW LEE",
      "description": "JERUSALEM (AP) — Israeli ground forces crossed into southern Lebanon early Tuesday, marking a significant escalation of an offensive against Hezbollah militants and opening a new front in a yearlong war against its Iranian-backed adversaries.",
      "publishedAt": "2024-09-30T09:14:51Z",
      "title": "Israel begins ground offensive against Hezbollah in southern Lebanon",
      "url": "https://apnews.com/83ea5f243688f309754ec74850de4238",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8620bb9358446989ac261d47f4aa382/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — As a hostage in Gaza, Aviva Siegel found herself begging for food and water. Since her release, she has found herself begging for her husband to be set free from his own ongoing captivity.",
      "publishedAt": "2024-10-01T04:36:39Z",
      "title": "A former hostage fought for her own life in Gaza. A year on, she fights for her husband's freedom",
      "url": "https://apnews.com/d8ecb415268e911cea09518acdaf7ba2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d594d31cb624dda9ca9a94de0bcaf00/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — Dockworkers at ports from Maine to Texas began walking picket lines early Tuesday in a strike over wages and automation that could reignite inflation and cause shortages of goods if it goes on more than a few weeks.",
      "publishedAt": "2024-09-30T16:20:49Z",
      "title": "Dockworkers at ports from Maine to Texas go on strike, a standoff risking new shortages",
      "url": "https://apnews.com/e5468e760f46a64e4322d1702beb1f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fb36934a241476ebe669888fab443f3/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "ASHEVILLE, N.C. (AP) — President Joe Biden was set to survey the devastation in the mountains of Western North Carolina on Wednesday, where exhausted emergency workers continued to work around-the-clock to clear roads, restore power and cellphone service, and reach people left stranded by Hurricane Helene.",
      "publishedAt": "2024-10-01T04:10:03Z",
      "title": "Biden plans survey of devastation in North Carolina as Helene's death toll tops 130",
      "url": "https://apnews.com/c5ff143de63e31bd345066221f5e4d24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fa29e5a753f43c7959ce814bcdad269/1920.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "WAUNAKEE, Wis. (AP) — Former President Donald Trump plans to spend the hours ahead of Tuesday night's vice-presidential debate campaigning in Wisconsin, stopping in a critical Democratic county that is crucial to Democrat Kamala Harris ' hopes for winning the key battleground state.",
      "publishedAt": "2024-10-01T04:05:22Z",
      "title": "Trump heads to Wisconsin's critical Democratic stronghold ahead of vice presidential debate",
      "url": "https://apnews.com/60307f1fa8530c60a7f7cde721260efc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ba15dc3462c450eb157270024a1dd76/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Tim Walz and JD Vance will meet for their first and possibly only vice presidential debate Tuesday, in what could be the last debate for both campaigns to argue their case before the election.",
      "publishedAt": "2024-10-01T04:01:50Z",
      "title": "Walz and Vance will meet in their first and possibly only vice presidential debate",
      "url": "https://apnews.com/66ff2e5e45a8dda55b0a2242fc238fdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f21c833bd6740a7a476a98f97417a4a/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER and JENNIFER PELTZ",
      "description": "UNITED NATIONS (AP) — They gathered at the United Nations surrounded by unsettling warnings of an escalating conflict that could engulf the Middle East and further shatter international relations that are based on \"multilateralism\" — nations working together and sharing power.",
      "publishedAt": "2024-10-01T01:02:07Z",
      "title": "Leaders depart UN facing prospect of a wider Mideast war — but with a blueprint for a better future",
      "url": "https://apnews.com/a6396f79d45a67b44c97f8ece2eec619",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0067020a7d6f490a9851e29c51feed53/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — China is marking the 75th year of Communist Party rule as economic challenges and security threats linger over the massive state. No festivities have been announced for the occasion Tuesday, save for a flag-raising ceremony at Tiananmen Square, with an honor guard marching from the entrance of the sprawling palace that in past centuries was the home of Chinese emperors.",
      "publishedAt": "2024-10-01T00:20:23Z",
      "title": "China marks 75 years of Communist Party rule as economic challenges and security threats linger",
      "url": "https://apnews.com/5f140a2c8db38029ea0c0f2769e9f619",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/344c0bde7866478388f6100bfc23b44a/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Pete Rose, baseball’s career hits leader and fallen idol who undermined his historic achievements and Hall of Fame dreams by gambling on the game he loved and once embodied, has died.",
      "publishedAt": "2024-09-30T23:48:37Z",
      "title": "Pete Rose, baseball’s banned hits leader, has died at age 83",
      "url": "https://apnews.com/e0f3dfa057fc46629447e04b6540e4c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03abdadb1916430e9f95590c00bffc20/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — The Justice Department announced Monday it plans to launch a review of the 1921 Tulsa Race Massacre, an attack by a white mob on a thriving Black district that is considered one of the worst single acts of violence against Black people in U.S.",
      "publishedAt": "2024-09-30T22:23:44Z",
      "title": "Justice Department will launch civil rights review into 1921 Tulsa Race Massacre",
      "url": "https://apnews.com/ea6551dc40c73996c3bf7e0a3ad3b06d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66f272c8b67e4eebb27cb35973181f56/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}