{
  "articles": [
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — The mother of a student in class with the boy accused of killing four people in a Georgia high school shooting says information that school officials were warned that the boy was having a crisis shows the shooting could have been prevented.",
      "publishedAt": "2024-09-08T21:19:34Z",
      "title": "Mother's warning to Georgia school about suspect raises questions about moments before shooting",
      "url": "https://apnews.com/cbaf55d23ae14a68a2e70b9bd3f6dd29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d33736ce58d1414ebcd447fef3551cdf/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — When Donald Trump and Kamala Harris meet onstage Tuesday night in Philadelphia, they’ll both know there’s little debate that Pennsylvania is critical to their chances of winning the presidency.",
      "publishedAt": "2024-09-08T12:42:16Z",
      "title": "Little debate that Pennsylvania is key as Harris and Trump prep for Philly showdown",
      "url": "https://apnews.com/2dcb86551271b79d63551739b1a5fd18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a908637cadc44f04af04e5f9bd6e9d67/3000.jpeg"
    },
    {
      "author": "JALAL BWAITEL and JULIA FRANKEL",
      "description": "KHIRBET ZANUTA, West Bank (AP) — An entire Palestinian community fled their tiny West Bank village last fall after repeated threats from Israeli settlers with a history of violence.",
      "publishedAt": "2024-09-08T04:25:26Z",
      "title": "Chased away by Israeli settlers, these Palestinians returned to a village in ruins",
      "url": "https://apnews.com/b426fa223791d88e97bcd48d3e618081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2b93ed6ffa4b048e1eed715b21eec4/3000.jpeg"
    },
    {
      "author": "MAHMOUD ILLEAN and NATALIE MELZER",
      "description": "ALLENBY CROSSING, West Bank (AP) — Three Israelis were shot and killed Sunday at the border crossing between the West Bank and Jordan, Israeli officials said, in what appeared to be an attack linked to the 11-month-old war in Gaza.",
      "publishedAt": "2024-09-08T07:27:02Z",
      "title": "Shooting attack at the West Bank-Jordan border crossing kills 3 Israelis",
      "url": "https://apnews.com/5278cf1f7ec254fb6ecca0f2758e7e3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe728306f8a4278aa726dcd6bfa3d3d/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER and LEAH WILLINGHAM",
      "description": "LONDON, Ky. (AP) — Authorities searched a rugged, hilly area of southeastern Kentucky on Sunday for a man suspected in the weekend shooting of nine vehicles and wounding of five people on a busy interstate.",
      "publishedAt": "2024-09-08T14:53:59Z",
      "title": "After interstate shootings wound 5 in Kentucky, searchers scour hill terrain for suspect",
      "url": "https://apnews.com/33b6846b5df8a01cb0c3b77565033e33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1040ab3fe4784c4d8ad140235baf4cfa/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Jannik Sinner started slowly at the U.S. Open, dropping the first set he played after being exonerated in a doping case no one knew about until shortly before play began at Flushing Meadows.",
      "publishedAt": "2024-09-08T06:31:45Z",
      "title": "Jannik Sinner beats Taylor Fritz in the US Open men's final just weeks after his doping exoneration",
      "url": "https://apnews.com/13448c797be1d9a94b82f43f6c068aa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0e6b875859847669eef1c04a1d14d81/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — For millions of Venezuelans and dozens of foreign governments, Edmundo González was the undisputed winner of the country's July 28 presidential election.But on Sunday, he joined the swelling ranks of once-prominent government opponents who have fled into exile, leaving his political future uncertain and tightening Nicolás Maduro's grip on power.",
      "publishedAt": "2024-09-08T17:20:02Z",
      "title": "Opposition candidate burst into Venezuelan politics just months before being chased into exile",
      "url": "https://apnews.com/e819ef0671e938ae54643973a900af30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0e8c9a951554dbb8fc5065ff7087a02/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "MIAMI GARDENS, Fla. (AP) — A police officer was put on administrative leave after being involved in an incident where the Miami Dolphins' Tyreek Hill was handcuffed and placed face down on a street outside the team's home stadium following a traffic stop Sunday morning, hours before the star wide receiver played in his first game of the season.",
      "publishedAt": "2024-09-08T15:14:15Z",
      "title": "Tyreek Hill is detained by police before Dolphins game; 1 officer is subsequently placed on leave",
      "url": "https://apnews.com/b7818aea160bed284444594a689f453d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90cb9cdd8f404b8e9a5618654027744d/3000.jpeg"
    },
    {
      "author": "DYEPKAZAH SHIBAYAN",
      "description": "ABUJA, Nigeria (AP) — A fuel tanker collided head-on with another truck in Nigeria on Sunday causing an explosion that killed at least 48 people, the country’s emergency response agency said. The fuel tanker was also carrying cattle in the Agaie area in north-central Niger state and at least 50 of them were burned alive, Abdullahi Baba-Arab, director-general of the Niger State Emergency Management Agency, said.",
      "publishedAt": "2024-09-08T18:46:33Z",
      "title": "Fuel tanker collision in Nigeria caused an explosion that killed at least 48 people",
      "url": "https://apnews.com/e082a840da51f7078dc2a54aed09ea92",
      "urlToImage": ""
    },
    {
      "author": "JOE REEDY",
      "description": "The impasse between DirecTV and Disney over a new carriage agreement has become more heated as it entered its second week.DirecTV filed a complaint with the Federal Communications Commission on Saturday night accusing Disney of negotiating in bad faith.",
      "publishedAt": "2024-09-08T22:14:28Z",
      "title": "DirecTV files complaint against Disney with FCC as impasse enters 2nd week",
      "url": "https://apnews.com/70acfc11ac3db57e0307b8fe364caf8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c96cfef1e264b7bb322bab138b6de14/1889.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}