{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Cardinals are returning to the Sistine Chapel to continue voting for a new pope. The first conclave ballot failed to find a winner, sending black smoke through the chapel chimney. Some cardinals expected a short conclave to replace Pope Francis, but it may take a few rounds of voting for one man to secure the two-thirds majority needed. The secretive ritual began Wednesday with Cardinal Pietro Parolin leading the proceedings. Thousands gathered in St. Peter’s Square to watch the event on video screens. The cardinals are sequestered from the outside world until they find a new pope.",
      "publishedAt": "2025-05-08T05:01:25Z",
      "title": "Cardinals return to the Sistine Chapel to elect the new pope",
      "url": "https://apnews.com/article/conclave-pope-francis-cardinals-vatican-d7991a37a679f09792ed220cc1f6bbed",
      "urlToImage": "https://dims.apnews.com/dims4/default/206cb3b/2147483647/strip/true/crop/7870x4427+0+410/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F11%2F92feac4b807bc3558b6ea8cb8300%2F2eb1b8ff8d6847208a39e94a93186d81"
    },
    {
      "author": null,
      "description": "VATICAN CITY (AP) — Cardinal Robert Prevost, an American missionary who spent his career ministering in Peru and leads the Vatican’s powerful office of bishops, was elected the first U.S. pope in the 2,000-year history of the Catholic Church.",
      "publishedAt": "2025-05-08T17:33:16Z",
      "title": "AP PHOTOS: A new pope is chosen",
      "url": "https://apnews.com/article/vatican-new-pope-photos-27ed8420e91b9b40cca8e65899ab878e",
      "urlToImage": "https://dims.apnews.com/dims4/default/23fdcbd/2147483647/strip/true/crop/5677x3193+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F0e%2Fbac4ce01f663ccbaa6854a7a7138%2F4c295efa1b8847ad9167cf80c8760323"
    },
    {
      "author": "Zeke Miller, Jill Lawless",
      "description": "The United States and Britain are expected to announce a trade deal that will lower the burden of President Donald Trump’s sweeping tariffs. A deal would be seem as a political victory for U.K. Prime Minister Keir Starmer. Trump said that a deal is due to be announced at 10 a.m. EDT or 1400 GMT. He said that it will be a “full and comprehensive one that will cement the relationship between the United States and the United Kingdom for many years to come.” Starmer’s office said the prime minister would give an “update” about U.S. trade talks later on Thursday. Trump placed a 10% tax on imports from Britain as well as 25% tariffs on autos, steel and aluminum.",
      "publishedAt": "2025-05-08T09:01:55Z",
      "title": "US and UK expected to announce a trade deal that Trump says will cement their relationship",
      "url": "https://apnews.com/article/us-uk-trump-starmer-trade-deal-79d55b8ade0dd8c9265ada9400d079db",
      "urlToImage": "https://dims.apnews.com/dims4/default/ceb0e23/2147483647/strip/true/crop/8064x4536+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8e%2F1f2b28af29017dd50f92cc82757e%2F4732a8d9916e4c228176431017d4ebd0"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "President Donald Trump's administration is asking the Supreme Court to allow it to end humanitarian parole for hundreds of thousands of immigrants from four countries. The emergency appeal filed Thursday asks the justices to halt a lower-court order keeping in place legal protections for more than 500,000 people from Cuba, Haiti, Nicaragua and Venezuela. The Republican administration argues the decision wrongly intrudes on the Department of Homeland Security’s authority. The order from U.S. District Judge Indira Talwani blocked the administration from putting an early end to the immigrants’ temporary legal status.",
      "publishedAt": "2025-05-08T17:24:25Z",
      "title": "Trump asks Supreme Court to let him to end humanitarian parole for 500,000 people",
      "url": "https://apnews.com/article/trump-immigration-parole-supreme-court-6282e48ef9bf41bd5c77e8e2b0642e89",
      "urlToImage": "https://dims.apnews.com/dims4/default/41efec0/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe9%2F6ef4d323016b07e4f56d91781143%2F78ad037c00ff44b5b6d53c1bb4674ef6"
    },
    {
      "author": "Babar Dogar",
      "description": "Pakistan’s army spokesman, Lt. Gen. Ahmad Sharif, said an Indian drone attacked a military target near Lahore overnight, wounding four soldiers, while the country’s air defense system intercepted and shot down 12 Indian drones that entered Pakistani airspace at various locations. He said the military target was partially damaged in the attack in Lahore. He added that in southern Sindh province, one civilian was killed and another wounded when debris from downed drones fell in a populated area.",
      "publishedAt": "2025-05-08T05:01:41Z",
      "title": "Pakistan says it shot down 12 Indian drones and 1 attacked military target",
      "url": "https://apnews.com/article/india-pakistan-drone-lahore-kashmir-4a33b5884b0860c01f266e2a93688ef7",
      "urlToImage": "https://dims.apnews.com/dims4/default/abf66ee/2147483647/strip/true/crop/7636x4295+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F6a%2F925d12c8461c2a2d423cdc8c7831%2Ff2528a4a5a374e9cad84934c6f64e82a"
    },
    {
      "author": null,
      "description": "Ukraine’s Parliament has unanimously voted in favor of ratifying of a landmark minerals deal with the U.S. The ratification on Thursday is a key step in setting the deal in motion. It calls for the creation of a joint investment fund with the U.S. Parliament approved the agreement with 338 members voting in favor out of the required 226 votes. No lawmaker voted against it or abstained.",
      "publishedAt": "2025-05-08T08:03:51Z",
      "title": "Ukraine's parliament ratifies a minerals deal with the US",
      "url": "https://apnews.com/article/russia-ukraine-war-ceasefire-89aa0cf9123ca8a55eec9dd8713a4e7b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e919987/2147483647/strip/true/crop/6430x3617+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2Fbf%2Fc14155a081f343f751b6b07d4f9c%2Ffe9891674b844b40b0840df384d09c91"
    },
    {
      "author": "Josh Funk, John Seewer",
      "description": "The Trump administration has proposed a major overhaul of the U.S. air traffic control system in the wake of recent deadly plane crashes and technical failures that have put a spotlight on the outdated network. Transportation Secretary Sean Duffy says the plan calls for six new air traffic control centers, along with technology and communications upgrades at all of the nation’s air traffic facilities over the next three years. How much it will all cost wasn’t immediately revealed. Officials want to add fiber, wireless and satellite technology at more than 4,600 locations, replace 600 radars and increase the number of airports with systems designed to reduce near misses on runways.",
      "publishedAt": "2025-05-08T17:04:58Z",
      "title": "White House proposes a major overhaul of the outdated US air traffic control system",
      "url": "https://apnews.com/article/air-traffic-control-plane-crashes-trump-duffy-8e334139510f395c8ee093e134aae5fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b77463/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F79%2F1bb56263f0660fc2f53f9392caf5%2F87a6a71b29d7494c8ac44829ec655904"
    },
    {
      "author": "Adithi Ramakrishnan",
      "description": "New experiments show eggs are less likely to crack when they fall on their side. It’s commonly thought that eggs are strongest at their ends because the arc-shaped bottom redirects the force of the impact and softens the blow. But when scientists ran simulations and dropped nearly 200 eggs horizontally and vertically from three short heights, eggs broke less when they landed on their side. Scientists discovered that the egg’s equator was more flexible and absorbed more of the energy of the fall before cracking. The new research was published Thursday in the journal Communications Physics.",
      "publishedAt": "2025-05-08T15:00:50Z",
      "title": "Eggs are less likely to crack when dropped on their side, according to science",
      "url": "https://apnews.com/article/how-to-drop-an-egg-without-cracking-it-a5ae1c5d8ff22c7d76be3b8329f448be",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f68bc7/2147483647/strip/true/crop/7718x4341+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2Ffe%2F64d3272b6aced55cd670ee11c4ff%2Fec5383a7e59345dcb570e156921efe5e"
    },
    {
      "author": "Michael R. Sisak, Jennifer Peltz",
      "description": "A former model has testified that Harvey Weinstein sexually assaulted her when she was 16 years old, calling it the most “horrifying thing I ever experienced” to that point. Kaja (KEYE’-ah) Sokola told jurors at Weinstein’s #MeToo retrial on Thursday that the onetime movie honcho put his hand inside her underwear and made her touch his genitals at a Manhattan apartment in 2002. Weinstein is not charged with any crime in connection with the alleged assault. Sokola is testifying because Weinstein is charged with forcing oral sex on her at a Manhattan hotel four years later. Weinstein has pleaded not guilty to all of the charges and denies sexually assaulting anyone.",
      "publishedAt": "2025-05-08T16:52:40Z",
      "title": "Ex-model tearfully tells jury that Harvey Weinstein sexually assaulted her when she was 16",
      "url": "https://apnews.com/article/harvey-weinstein-metoo-sexual-assault-retrial-619811883bfd0988d85c156231cf0c55",
      "urlToImage": "https://dims.apnews.com/dims4/default/d828551/2147483647/strip/true/crop/7299x4106+0+380/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Faa%2F94837bdc148e3fdbb01efe264f6c%2F7b02a373d12c4d92ba4ddfaade6f3259"
    },
    {
      "author": "Seung Min Kim, Michael Kunzelman",
      "description": "President Donald Trump said that he will pull the nomination of conservative activist Ed Martin Jr. to be the top federal prosecutor for the nation’s capital, after a key Republican senator said he could not support him for the job due to his defense of Jan. 6 rioters. “We have somebody else that will be great,” Trump told reporters in the Oval Office Thursday when asked about the status of Martin’s confirmation. He said it was disappointing, but “that’s the way it works sometime.”",
      "publishedAt": "2025-05-08T15:58:04Z",
      "title": "Trump pulls nomination of DC US Attorney after Republican Senate defection",
      "url": "https://apnews.com/article/donald-trump-ed-martin-white-house-justice-department-thom-tillis-cecf801799faa2b56fd1bb4fac48379e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1d50ff/2147483647/strip/true/crop/4492x2527+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F98%2F8efdaeae0ba0c4fc2d8247bd4aa2%2F25730d061cd24ce8a6831cda34ba77ea"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}