{
  "articles": [
    {
      "author": "LISA MASCARO, ZEKE MILLER and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Democrats worried about President Joe Biden's ability to win this November are making a renewed push for him to reconsider his reelection bid, using mountains of data, frank conversations and now, his own time off the campaign trail after testing positive for COVID, to encourage a reassessment.",
      "publishedAt": "2024-07-18T05:33:53Z",
      "title": "Democrats making a fresh push for Biden to reconsider running in runup to their own party convention",
      "url": "https://apnews.com/3f9e3d15431fd4974771a54e1d0e4ea7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eeac4c4f6b9047f3badead55c511372e/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Donald Trump takes the stage Thursday at the Republican National Convention to accept his party's nomination again and give his first speech since he was cut off mid-sentence by a flurry of gunfire in an assassination attempt at a rally in Pennsylvania.",
      "publishedAt": "2024-07-18T11:03:25Z",
      "title": "Donald Trump will accept Republican nomination again days after surviving an assassination attempt",
      "url": "https://apnews.com/5f1f337ac39477e9d1c53d3e027edda3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7b3d08dc9e847f9a4e9fa0cba5091ae/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM and JULIE CARR SMYTH",
      "description": "CHARLESTON, W.Va. (AP) — Newly minted vice presidential nominee JD Vance built his Wednesday night speech to the Republican National Convention around his own Appalachian roots, but it wasn't the first time he had shared his personal story.",
      "publishedAt": "2024-07-18T04:13:14Z",
      "title": "GOP vice presidential pick Vance talks Appalachian ties in speech as resentment over memoir simmers",
      "url": "https://apnews.com/b666f86429ace1d29a13691f6254ff79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/061b673c527e4a1485d52bbd47932a85/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israel’s far-right national security minister visited Jerusalem’s most sensitive holy site on Thursday, a move that could disrupt the delicate Gaza cease-fire talks.Itamar Ben-Gvir, an ultranationalist settler leader, said he had gone up to the contested Jerusalem hilltop compound of Al-Aqsa Mosque to pray for the return of the hostages \"but without a reckless deal, without surrendering.”",
      "publishedAt": "2024-07-18T06:40:16Z",
      "title": "Far-right Israeli minister visits sensitive Jerusalem holy site, a threat to Gaza cease-fire talks",
      "url": "https://apnews.com/f92f49c9f2254702f07a6a2af677c89e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6253f62146349c7ac989d4d5b2fc05e/3000.jpeg"
    },
    {
      "author": "FATMA KHALED and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Nabila Hamada gave birth to twin boys in Gaza early in the war, in a hospital reeking of decaying bodies and full of displaced people.",
      "publishedAt": "2024-07-18T04:25:22Z",
      "title": "Bedwetting, nightmares and shaking. War in Gaza takes a mental health toll, especially on children",
      "url": "https://apnews.com/370c7ccc24dcc8a2c4b81acd5345221b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9295d0055c34cc996e73476b1c29e52/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Discontented, economically squeezed voters have turned against sitting governments on both right and left during many of the dozens of elections held this year, as global power blocs shift and political certainties crumble.",
      "publishedAt": "2024-07-18T04:21:30Z",
      "title": "Uncertainty is the winner and incumbents the losers so far in a year of high-stakes global elections",
      "url": "https://apnews.com/08f20983fc7fdf74484baa6dbf9c0fcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/424f3d6049974f2dace39dcc7ce60a01/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Victoria Estevez finally met someone who saw past her shyness. They spent two months learning about their likes and dislikes, texting about their families and friends, and walking around their hometowns on Venezuela's Caribbean coast.",
      "publishedAt": "2024-07-18T06:08:37Z",
      "title": "The uncertainty that plagues life in crisis-ridden Venezuela is also wreaking havoc on relationships",
      "url": "https://apnews.com/a2ccff116ea52ea742e03ebed294dbd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5c24ba0b0a3464f94e2389c94bfc04d/3000.jpeg"
    },
    {
      "author": "KIRILL ZARUBIN and EMMA BURROWS",
      "description": "YEKATERINBURG, Russia (AP) — Wall Street Journal reporter Evan Gershkovich attended a hearing behind closed doors on Thursday in his trial in Russia on espionage charges that he, his employer and the U.S.",
      "publishedAt": "2024-07-18T06:32:38Z",
      "title": "US journalist attends hearing in Russia in his trial on espionage charges that he and the US deny",
      "url": "https://apnews.com/fcc03e6ec79f5a9a8a2cded213ec3edc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57d5802e530d486d89fc61ab75b6a894/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — A former president is shot, the gunman quickly neutralized, and all of it is caught on camera. But for those who don't believe their eyes, that's just the start of the story.For some supporters of former President Donald Trump, the failure of the Secret Service to prevent the attempted assassination point to a conspiracy orchestrated by President Joe Biden.",
      "publishedAt": "2024-07-18T04:23:43Z",
      "title": "'One screen, two movies': Conflicting conspiracy theories emerge from Trump shooting",
      "url": "https://apnews.com/bf345b7cd72cc8c243084fe6ba8fa53a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/075c1583012449fcb87b9b75d338bee6/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER and TOM NOUVIAN",
      "description": "PARIS (AP) — A special kind of iron curtain came down across central Paris on Thursday, with the beginning of an Olympic anti-terrorism perimeter along the banks of the River Seine sealing off a kilometers-long (miles-long) area to Parisians and tourists who hadn’t applied in advance for a pass.",
      "publishedAt": "2024-07-18T10:06:51Z",
      "title": "Paris police are sealing off the Seine River ahead of the Olympics opening ceremony",
      "url": "https://apnews.com/9699ddf157afdb845efbd176b9ceb953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61809179699d4a6f8215ef7542bc3a7a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}