{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — The latest round of Gaza cease-fire talks ended in Cairo after “in-depth and serious discussions,” the Hamas militant group said Sunday, reiterating key demands that Israel again rejected.",
      "publishedAt": "2024-05-05T12:19:20Z",
      "title": "Hamas says latest cease-fire talks have ended. Israel vows military operation in 'very near future'",
      "url": "https://apnews.com/5fb0455b81674b2bfe38d997c95d6f00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9206c894aea4f66a27a6209d8c01344/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JON GAMBRELL",
      "description": "TEL AVIV, Israel (AP) — Israel ordered the local offices of Qatar's Al Jazeera satellite news network to close Sunday, escalating a long-running feud between the broadcaster and Prime Minister Benjamin Netanyahu's hard-line government as Doha-mediated cease-fire negotiations with Hamas hang in the balance.",
      "publishedAt": "2024-05-05T10:22:43Z",
      "title": "Israel orders Al Jazeera to close its local operation and seizes some of its equipment",
      "url": "https://apnews.com/eba9416aea82f505ab908ee60d1de5e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99b5de0f23584ffd8cbb4ebb664d55ac/3000.jpeg"
    },
    {
      "author": "NICK PERRY and PHILIP MARCELO",
      "description": "Students protesting the war in Gaza abandoned their camp at the University of Southern California early Sunday after being surrounded by police and threatened with arrest, while Northeastern University's commencement ended peacefully at Boston's Fenway Park.",
      "publishedAt": "2024-05-05T11:45:27Z",
      "title": "Anti-war protesters leave USC after police arrive, while Northeastern ceremony proceeds calmly",
      "url": "https://apnews.com/3afafc2d56c6dc87635549475d94e1d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc83ed3d636d40418b19ff667cdfdce2/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and ZEKE MILLER",
      "description": "WILMINGTON, N.C. (AP) — This North Carolina voter is nervous.Will Rikard, a 49-year-old father of two, was among several hundred Democrats who stood and cheered for Joe Biden as the first-term president delivered a fiery speech recently about the billions of dollars he has delivered to protect the state's drinking water.",
      "publishedAt": "2024-05-05T14:37:46Z",
      "title": "Denial and uncertainty are looming over a Biden-Trump rematch 6 months out from Election Day",
      "url": "https://apnews.com/12e52060e54c8f48be001d159f4a4dcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fad05abb6274c609dc7f58274029c9c/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Virtually every day of his hush money criminal trial, former President Donald Trump talks about how he can’t talk about the case.",
      "publishedAt": "2024-05-05T12:01:31Z",
      "title": "What a judge's gag order on Trump means in his hush money case",
      "url": "https://apnews.com/fae616037d3606cc60abbffb0e91f7ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9668a5e0634582a10d97bc17346eb1/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.So this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.",
      "publishedAt": "2024-05-05T04:45:49Z",
      "title": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7",
      "url": "https://apnews.com/492eab9a3b95de64602ccdec863f1b37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5023657347ff4ad2b8f53c526afac3ae/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Massive floods in Brazil’s southern Rio Grande do Sul state have killed at least 75 people over the last seven days, and another 103 were reported missing, local authorities said Sunday.",
      "publishedAt": "2024-05-05T15:27:50Z",
      "title": "Floods in southern Brazil kill at least 75 people over 7 days, with 103 people missing",
      "url": "https://apnews.com/f62a0ace01aad5832a928ec4a918b579",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0cd9bd423c34f839d0cd4c3c36b007e/2000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — It was a frigid winter morning when authorities found a Native American man dead on a remote gravel road in western New Mexico.",
      "publishedAt": "2024-05-05T04:37:24Z",
      "title": "As US spotlights those missing or dead in Native communities, prosecutors work to solve their cases",
      "url": "https://apnews.com/fb7f8145149850aa5ae14c44c9692667",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bd37e3c350f4bda8a560fa72a5b855a/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "COLUMBIA, S.C. (AP) — A church volunteer stood at an apartment door, beckoning inside a Congolese family for their first look at where they would live in America. “Your new house!” volunteer Dan Davidson exclaimed as the couple and the woman's brother stepped into the two-bedroom apartment in South Carolina's capital, smiling tentatively at what would come next.",
      "publishedAt": "2024-05-05T11:52:45Z",
      "title": "Biden has rebuilt the refugee system after Trump-era cuts. What comes next in an election year?",
      "url": "https://apnews.com/93cd3b6408fd45907645849da91e23bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24bcb546d4c04817beb67a06c5479adc/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — It took just a few days for United Methodist delegates to remove a half-century's worth of denominational bans on gay clergy and same-sex marriages.",
      "publishedAt": "2024-05-05T12:39:09Z",
      "title": "Methodists end anti-gay bans, closing 50 years of battles over sexuality for mainline Protestants",
      "url": "https://apnews.com/ef5755c84d49896c520b5835e6169317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ffe6bdfc73549df8d5c39eb1d5bb060/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}