{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A veteran tabloid publisher testified Tuesday that he pledged to be Donald Trump 's “eyes and ears\" during his 2016 presidential campaign, recounting how he promised the then-candidate that he would help suppress stories that had the potential to harm the Republican's election bid.",
      "publishedAt": "2024-04-23T04:08:37Z",
      "title": "Tabloid publisher says he pledged to be Trump campaign's 'eyes and ears' during 2016 race",
      "url": "https://apnews.com/d44d4a7ce66cc08edb5981b3afb882ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b255fd80e0a4a86b088e231ea40a205/1920.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "DETROIT (AP) — The U.S. Justice Department announced a $138.7 million settlement Tuesday with more than 100 people who accused the FBI of grossly mishandling allegations of sexual assault against Larry Nassar in 2015 and 2016, a critical time gap that allowed the sports doctor to continue to prey on victims before his arrest.",
      "publishedAt": "2024-04-23T16:36:31Z",
      "title": "US government agrees to $138.7M settlement over FBI's botching of Larry Nassar assault allegations",
      "url": "https://apnews.com/3b760f3d317cbe18209aa02a611a298f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9218081fa3ba4ebd8835e00e8e2c578d/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Satellite photos analyzed by The Associated Press appear to show a new compound of tents being built near Khan Younis in the southern Gaza Strip as the Israeli military continues to signal it plans an offensive on the city of Rafah.",
      "publishedAt": "2024-04-23T07:04:19Z",
      "title": "The Latest | Tent compound rises in southern Gaza as Israel prepares for Rafah offensive",
      "url": "https://apnews.com/7eb0c352bd4b9f7f87ff197be77d70d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7dcc58eccd24b5888073d5a20b509ef/1920.jpeg"
    },
    {
      "author": "KAREN MATTHEWS and NICK PERRY",
      "description": "NEW YORK (AP) — The Israel-Hamas war protests creating friction at universities across the United States escalated Tuesday as some colleges encouraged students to attend classes remotely and dozens faced charges after setting up tents on campuses and ignoring official requests to leave.",
      "publishedAt": "2024-04-23T11:55:05Z",
      "title": "Protests roiling US colleges escalate with arrests, new encampments and closures",
      "url": "https://apnews.com/2c1f043478570f9206a2ea8470457cf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ab15e36117644118bb7b4fdc054b524/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Five people, including a child, died while trying to cross the English Channel from France to the U.K., French authorities said Tuesday, just hours after the British government approved a migrant bill to deport some of those who entered the country illegally to Rwanda.",
      "publishedAt": "2024-04-23T08:31:27Z",
      "title": "5 migrants die while crossing the English Channel hours after the UK approved a deportation bill",
      "url": "https://apnews.com/00d73287212405d70fdb513cd791fcbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89765bb79fdd49f69a22fc252a16e536/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India's main opposition party accused Prime Minister Narendra Modi of using hate speech after he called Muslims “infiltrators\" — some of his most incendiary rhetoric about the minority faith, days after the country began its weekslong general election.",
      "publishedAt": "2024-04-23T05:38:59Z",
      "title": "Modi is accused of using hate speech for calling Muslims 'infiltrators' at an Indian election rally",
      "url": "https://apnews.com/90f70cfae68d39ecc80a90acab6e3e00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7995481067ff49d08c3a4cecc1827314/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said a Russian missile strike that smashed a prominent skyline television tower in Kharkiv was part of the Kremlin’s effort to intimidate Ukraine’s second-largest city, which in recent weeks has come under increasingly frequent attack.",
      "publishedAt": "2024-04-23T08:57:30Z",
      "title": "A Russian strike on Kharkiv's TV tower is part of an intimidation campaign, Ukraine's Zelenskyy says",
      "url": "https://apnews.com/317bfd1aef56342a82dfa0a776dadbcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51c0b45bcade45a8a7fa625579cc06c3/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Pentagon is poised to send an initial $1 billion package of military aid to Ukraine, U.S.",
      "publishedAt": "2024-04-23T17:05:42Z",
      "title": "Pentagon set to send initial $1 billion in military aid to Ukraine once bill clears Senate and Biden",
      "url": "https://apnews.com/54045b0755b1711d0e22beaedf137cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/598eb559889f46f5ba06e96250d44730/2000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — The Supreme Court will hear arguments Wednesday in a case that could determine whether doctors can provide abortions to pregnant women with medical emergencies in states that enact abortion bans.",
      "publishedAt": "2024-04-23T17:14:28Z",
      "title": "What's EMTALA, the patient protection law at the center of Supreme Court abortion arguments?",
      "url": "https://apnews.com/000a2482fdd1f1299599c91a6cc7635a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00438470ff604a3d92929d758a68d9ee/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Thousands of United Methodists are gathering in Charlotte, North Carolina, for their big denominational meeting, known as General Conference. It’s a much-anticipated gathering.",
      "publishedAt": "2024-04-23T14:21:00Z",
      "title": "United Methodists open first top-level conference since breakup over LGBTQ inclusion",
      "url": "https://apnews.com/8b428597c86901b2d5886afeca5069c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9dbada43e4f431d98c11debec37e463/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}