{
  "articles": [
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "AURORA, Colo. (AP) — Starting seventh grade at her first American school, facing classes taught entirely in English, Alisson Ramirez steeled herself for rejection and months of feeling lost.",
      "publishedAt": "2024-10-27T04:14:36Z",
      "title": "They came to America looking for better lives — and better schools. The results were mixed",
      "url": "https://apnews.com/2aee52bc80300f5507a903cda3e441da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce90eae301114ba8b6e0f6404af62b90/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Israeli attack on Iran damaged facilities at a secretive military base southeast of the Iranian capital that experts in the past have linked to Tehran's onetime nuclear weapons program and at another base tied to its ballistic missile program, satellite photos analyzed Sunday by The Associated Press show.",
      "publishedAt": "2024-10-27T10:14:29Z",
      "title": "Satellite images show damage from Israeli attack at 2 secretive Iranian military bases",
      "url": "https://apnews.com/0c6ee6a8544268612cb7d49727d8449d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7f30693a4724180a280ee42b59b06b5/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "AIN EL DELB, Lebanon (AP) — It was Sunday, family time for most in Lebanon, and Hecham al-Baba was visiting his sister. She insisted he and their older brother stay for lunch, hoping to prolong the warm gathering in stressful times.",
      "publishedAt": "2024-10-27T04:09:33Z",
      "title": "A Lebanese family was holding a Sunday gathering when an Israeli strike toppled their building",
      "url": "https://apnews.com/963fceb3514518420b579a4a381ac286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ae6bf667a684d489b4e96437a9fda07/3000.jpeg"
    },
    {
      "author": "AMI BENTOV, TIA GOLDENBERG, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAMAT HASHARON, Israel (AP) — Egypt’s president says his country has proposed a two-day cease-fire between Israel and Hamas during which four hostages held in Gaza would be freed.President Abdel-Fattah el-Sissi, speaking in Cairo, said the proposal also includes the release of some Palestinian prisoners and the delivery of humanitarian aid to the besieged Gaza Strip.",
      "publishedAt": "2024-10-27T05:30:19Z",
      "title": "Egypt's president says it has proposed a 2-day Gaza cease-fire and release of 4 hostages",
      "url": "https://apnews.com/b4bf551e7c7de2af29257f6d4cc74da2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd5e42f977b74334b23648fffa90f70c/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump is finally getting his Madison Square Garden moment.With just over a week to go before Election Day, the former president will take the stage at one of the country's most iconic venues, hosting a hometown rally to deliver his campaign's closing message against Democratic Vice President Kamala Harris.",
      "publishedAt": "2024-10-27T04:02:46Z",
      "title": "Trump veers away from swing states for his Madison Square Garden moment",
      "url": "https://apnews.com/fcfe75be7f8281fde7bffa3adb3bba5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d45a3d20ebb840e8aa4c40ca7a8d150e/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and CHRIS MEGERIAN",
      "description": "PHILADELPHIA (AP) — Kamala Harris told a Philadelphia church congregation that the United States is “determined to turn the page on hatred and division\" as she began crisscrossing the Democratic stronghold Sunday.",
      "publishedAt": "2024-10-27T09:28:21Z",
      "title": "Harris calls on the US 'to turn the page on hatred and division' as she crisscrosses Philadelphia",
      "url": "https://apnews.com/640ea532f6de541a5e03509bfe1471ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/805b06fedb6048498f51af72cb137db3/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "LANCASTER, Pa. (AP) — The Rev. David Peck knows first-hand how divided communities wracked by violence can be gutted by that repeated devastation.In his previous work as an Anglican church representative for international development, Peck saw on his trips to Africa how religious groups could be part of the problem — but also part of the solution.",
      "publishedAt": "2024-10-27T12:07:29Z",
      "title": "Swing-state priest teaches ancient techniques for surviving today's political turmoil",
      "url": "https://apnews.com/01898315038576e82629848e2e990cde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf535922cbd04312ab3339e84752a1c8/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "AURORA, Colo. (AP) — Starting seventh grade at her first American school, facing classes taught entirely in English, Alisson Ramirez steeled herself for rejection and months of feeling lost.",
      "publishedAt": "2024-10-27T04:14:36Z",
      "title": "They came to America looking for better lives — and better schools. The results were mixed",
      "url": "https://apnews.com/2aee52bc80300f5507a903cda3e441da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce90eae301114ba8b6e0f6404af62b90/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "TALISAY, Philippines (AP) — As a storm pounded his rural home, Raynaldo Dejucos asked his wife and children to stay indoors and keep safe from a lightning strike or slippery roads.One thing the 36-year-old didn't mention was landslides.",
      "publishedAt": "2024-10-27T11:17:12Z",
      "title": "A Philippine town in the shadow of a volcano is hit by landslides it never expected",
      "url": "https://apnews.com/e18e6d928e8d8233c521c378ff58c1b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e401bfe5d98148e49fbc81034632b7e2/3000.jpeg"
    },
    {
      "author": "NAYARA BATSCHKE and ISABEL DEBRE",
      "description": "MONTEVIDEO, Uruguay (AP) — Voters in the small South American nation of Uruguay headed to the polls to choose a new president on Sunday in a race between two moderates that defies regional trends of bitter division and democratic erosion.",
      "publishedAt": "2024-10-27T04:02:00Z",
      "title": "Uruguay's elections buck the Latin American trend, offering voters a choice between 2 moderates",
      "url": "https://apnews.com/86984f87bb0607d9c061c293ec11fe71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c264bfd59641484db4d8a5d2373c2a80/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}