{
  "articles": [
    {
      "author": "KATE BRUMBACK and ERIC TUCKER",
      "description": "ATLANTA (AP) — Donald Trump and 18 allies were indicted in Georgia on Monday with scheming to overturn his 2020 election loss in the state, with prosecutors turning to a statute normally associated with mobsters to accuse the former president, lawyers and other top aides in a sweeping criminal conspiracy aimed at keeping him in power.",
      "publishedAt": "2023-08-14T16:23:05Z",
      "title": "Trump, 18 allies indicted in Georgia over 2020 election meddling, the 4th criminal case against him",
      "url": "https://apnews.com/d39562cedfc60d64948708de1b011ed3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59269cc3593348c48bc5db5ecf2edf5a/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Hawaii's governor warned that scores more people could be found dead following the Maui wildfires as search crews go through neighborhoods where the flames galloped as fast as a mile a minute and firefighters struggled to contain the inferno with what some officials complained was a limited water supply.",
      "publishedAt": "2023-08-14T10:39:41Z",
      "title": "Hawaii's governor warns that scores more people could be found dead following wildfires on Maui",
      "url": "https://apnews.com/02ac109a255ef4d9c962c468b5a74360",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/917de0cf440f435d8f08e27d6ca9aa45/1920.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO, MATT SEDENSKY and CLAIRE RUSH",
      "description": "LAHAINA, Hawaii (AP) — The smoke was starting to blot out the sun. Winds were howling, and heat bore down as flames licked the trees on the horizon.",
      "publishedAt": "2023-08-14T18:41:26Z",
      "title": "They were alone in a fight to survive. Maui residents had moments to make life-or-death choices",
      "url": "https://apnews.com/8a8bf7e4257c1cedaa161e4002b3e7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/334dc031e945423bbe6deb62f704959f/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and AMY BETH HANSON",
      "description": "HELENA, Mont. (AP) — Young environmental activists scored what experts described as a ground-breaking legal victory Monday when a Montana judge said state agencies were violating their constitutional right to a clean and healthful environment by allowing fossil fuel development.",
      "publishedAt": "2023-08-14T17:24:06Z",
      "title": "Young environmental activists prevail in first-of-its-kind climate change trial in Montana",
      "url": "https://apnews.com/c7fdc1d8759f55f60346b31c73397db0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b486524e5c9467eb418576694980471/2464.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "BRANDON, Miss. (AP) — Six white former Mississippi law officers pleaded guilty on Monday to state charges for torturing two Black men in a racist assault.",
      "publishedAt": "2023-08-14T04:20:05Z",
      "title": "Six former Mississippi officers plead guilty to state charges for torturing two Black men",
      "url": "https://apnews.com/a04261f338812a0aaf43b4b7efa8c944",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53f333bd6b264befa3c8f8747a4c7e89/1920.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "SALT LAKE CITY (AP) — The Utah man accused of making violent threats against President Joe Biden before a trip to Salt Lake City last week pointed a handgun at FBI agents attempting to arrest him, the agency said on Monday.",
      "publishedAt": "2023-08-14T22:28:45Z",
      "title": "Utah man accused of threatening president pointed gun at agents, FBI says",
      "url": "https://apnews.com/4041e4375894c9b942648920cbb83d65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb1a1d208ffc4948967c392c505e4863/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A strong tropical storm lashed central and western Japan with heavy rain and high winds Tuesday, causing flooding and power blackouts and paralyzing air and ground transportation while many people were traveling for a Buddhist holiday week.",
      "publishedAt": "2023-08-15T00:53:50Z",
      "title": "A strong tropical storm is lashing parts of Japan and disrupting holiday travel",
      "url": "https://apnews.com/44e746440df4ca30d30ec3a6cad9dfcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0eba4c3346e4fecb2d65919ef324ab4/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — A Texas woman was sentenced Monday to 30 years in prison for helping dispose of the body of a U.S. soldier, whose 2020 killing sparked a movement of women speaking out about sexual abuse in the military and led to changes in how they can report it.",
      "publishedAt": "2023-08-14T22:21:06Z",
      "title": "Texas woman who helped hide US soldier Vanessa Guillén’s body sentenced to 30 years in prison",
      "url": "https://apnews.com/f18b6be5fd70e2b18e3c67d88e482d8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8337fab7201448d9d8a0123f7657f70/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER and JIM SALTER",
      "description": "NEW YORK (AP) — Tensions between public officials and the press are hardly unusual. To a large extent, it's baked into their respective roles.What's rare in a democratic society is a police raid on a news organization's office or the home of its owner.",
      "publishedAt": "2023-08-14T21:04:30Z",
      "title": "EXPLAINER: Why is a police raid on a newspaper in Kansas so unusual?",
      "url": "https://apnews.com/5adfc0f2857abaf8b7478c613662363e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a9e79640bca4ebaa6a0de11df8c90e4/2500.jpeg"
    },
    {
      "author": "JAKE BLEIBERG and PAUL J. WEBER",
      "description": "DALLAS (AP) — Police video released Monday shows U.S. Rep. Ronny Jackson of Texas being taken to the ground by officers, profanely berating them and threatening to report them to the governor during an altercation at a rodeo last month.",
      "publishedAt": "2023-08-14T22:53:18Z",
      "title": "Video shows Texas US Rep. Ronny Jackson berating officers after being wrestled to ground at rodeo",
      "url": "https://apnews.com/d73e0333f62e150baf170d84b7128dbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/991bfedcce0f4042ad8e9a1b05b72826/2291.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}