{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "Ukraine’s capital has came under a large-scale combined drone and missile attack with explosions and machine gun fire heard throughout the city. Many residents of Kyiv are taking shelter in the underground subway stations. The debris of intercepted missiles and drones fell in at least 4 city districts, acting head of Kyiv military administration, Tymur Tkachenko, wrote on Telegram. According to Tkachenko, six people required medical care after the attack, two fires sparked at Solomianskyi district of Kyiv. Prior to the attack, city mayor Vitalii Klitschko warned Kyiv residents of more than 20 Russian strike drones heading towards Kyiv.",
      "publishedAt": "2025-05-24T00:02:19Z",
      "title": "Kyiv comes under large-scale Russian drone and missile attack with explosions heard throughout city",
      "url": "https://apnews.com/article/russia-ukraine-war-attack-drones-kyiv-469287eb80a7c3d423379969d4752ab9",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ba878e/2147483647/strip/true/crop/5886x3311+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F7a%2F899c8f4767da774fe308ad88cd8b%2F3b403e3eb6394814858dfb79a8f255fd"
    },
    {
      "author": "Julie Watson",
      "description": "The music agency Sound Talent Group says three of its employees died on the private plane that crashed into a San Diego neighborhood on Thursday. The music agency says the dead include Dave Shapiro, the agency’s co-founder. Shapiro is listed as the owner of the plane and has a pilot’s license. Sound Talent Group has represented artists including Hanson, Sum 41 and Vanessa Carlton. The agency didn’t share the names of the other two employees who were killed. The private jet crashed early Thursday into a neighborhood of U.S. Navy-owned housing in San Diego during foggy weather, igniting at least one home and numerous vehicles parked on the street.",
      "publishedAt": "2025-05-22T12:37:03Z",
      "title": "3 people dead after small plane crashes into San Diego neighborhood",
      "url": "https://apnews.com/article/plane-crash-san-diego-5e465454fc0282a81adafc1bfdc142a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7616bde/2147483647/strip/true/crop/4619x2598+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F7d%2F245e1c081dc1ce790684553dacb3%2F0137346332ce469b9dc66cd844192eef"
    },
    {
      "author": "Seung Min Kim, West Point, N.y.",
      "description": "President Donald Trump is delivering his first military commencement address since returning to office. The Republican president is set to speak to West Point’s graduating class on Saturday morning. Trump gave the commencement address at West Point in 2020, during the height of the COVID-19 pandemic. The president urged the graduating cadets to “never forget” the soldiers who fought a war over slavery during his remarks, which came as the nation was reckoning with its history on race after the murder of George Floyd in Minneapolis. Trump also paid tribute to the military academy’s history and its famed graduates, including Douglas MacArthur and Dwight D. Eisenhower.",
      "publishedAt": "2025-05-24T04:03:50Z",
      "title": "Trump is set to deliver West Point commencement address",
      "url": "https://apnews.com/article/trump-commencement-army-west-point-graduates-ecbc20a0ce46350618dabae573e40556",
      "urlToImage": "https://dims.apnews.com/dims4/default/05a7775/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F56%2Fed8a5dcfdb04cf8c1b5439b38dbf%2F824191205e1d458ea83befe7e0bec343"
    },
    {
      "author": "Marc Levy, Paul Wiseman",
      "description": "President Donald Trump says U.S. Steel will keep its headquarters in Pittsburgh as part of what he called a “partnership” between the American steelmaker and Japan-based Nippon Steel, which sought to buy it. Trump's statement Friday left it vague as to whether he's approving Nippon Steel’s bid after vowing to block it, but investors took it as a positive sign, sharply pushing up U.S. Steel’s shares. The companies issued approving statements, but didn't describe terms of the deal. Nippon Steel’s nearly $15 billion bid to buy U.S. Steel was blocked by former President Joe Biden. One union official suggests the federal government will have a role in the company’s management going forward.",
      "publishedAt": "2025-05-23T20:20:02Z",
      "title": "Trump says US Steel will keep HQ in Pittsburgh in a sign he'll approve bid by Japan-based Nippon",
      "url": "https://apnews.com/article/trump-us-steel-nippon-pittsburgh-23621e64084d428478082b897988ae13",
      "urlToImage": "https://dims.apnews.com/dims4/default/42eaa17/2147483647/strip/true/crop/4793x2696+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2Fba%2F8be97d1aac09f76a9a9b1b97f7f4%2Fffcbbf34ee3d4892979330f1a413745b"
    },
    {
      "author": "Nicole Winfield, Franklin Briceño",
      "description": "Pope Leo XIV's record handling sex abuse cases while he was an Augustinian superior and bishop in Peru has come under renewed scrutiny since his election May 8. And overall, one of the biggest challenges facing history’s first American pope will be how he addresses the clergy abuse scandal. But one group of people who are defending the former Robert Prevost’s record and cheering his election are the victims of the Sodalitium Christianae Vitae, a sect-like organization in the heart of the Latin American church. They endured decades of twisted abuses including physical, sexual and psychological violence at the hands of its leaders and say Prevost helped when many others didn't.",
      "publishedAt": "2025-05-24T05:06:06Z",
      "title": "As Pope Leo XIV faces new scrutiny, victims of abusive Catholic group praise his help",
      "url": "https://apnews.com/article/vatican-pope-peru-sodalicio-6fcdbb103f78aaeccc58e7b22f81e868",
      "urlToImage": "https://dims.apnews.com/dims4/default/a43cea9/2147483647/strip/true/crop/6212x3494+0+324/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F44%2F8054cf5e441a508570e6cfd7d86e%2F48e1617f8df24dd6b449ba2e8ca46bb1"
    },
    {
      "author": "Maria Sherman",
      "description": "The alternative music community is in mourning after a private jet hit a power line in foggy weather early Thursday and crashed into a San Diego neighborhood. It slammed into a home and killed multiple people on the flight. Among them was the groundbreaking music executive Dave Shapiro, a pillar of his music scene, and Daniel Williams, a former drummer for the popular Ohio metalcore band The Devil Wears Prada. Both Williams and Shapiro served as success stories for their rock music scenes, proof that these subcultural sounds had real mainstream appeal, according to members of their community.",
      "publishedAt": "2025-05-24T04:11:23Z",
      "title": "San Diego plane crash: The alt-rock community is mourning",
      "url": "https://apnews.com/article/san-diego-music-scene-plane-crash-dave-edee947fde1afeca79602f4d7991ecac",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b6c32b/2147483647/strip/true/crop/2769x1558+0+145/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F67%2F07350e08101207fcb85718814119%2Ff69afdeb73a04a22bafd4ce013dbfbeb"
    },
    {
      "author": "Sam Mednick, Samy Magdy",
      "description": "Several Palestinians and Israeli soldiers say troops are systematically forcing Palestinians to act as human shields in Gaza, sending them into buildings and tunnels to check for bombs and gunmen. They say the practice has become ubiquitous over 19 months of war. Israel’s military says it prohibits using civilians as shields, a practice it's long accused Hamas of using. It says it’s investigating a handful of cases but wouldn’t give details. Seven Palestinians described to The Associated Press being used as shields in Gaza and the occupied West Bank. One said he was beaten, bound and blindfolded. Two Israeli solders also described using human shields and that derogatory terms like mosquito were used to refer to the Palestinians.",
      "publishedAt": "2025-05-24T05:14:46Z",
      "title": "Israel's use of human shields in Gaza is widespread, sources say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d900316/2147483647/strip/true/crop/1500x844+0+78/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc0%2F4fad2f910044a37decd3f587f885%2Fe61c218e2cb544c196e80231a80dc353"
    },
    {
      "author": "Jake Coyle",
      "description": "Can Neon extend one of the most unprecedented streaks in movies? That’s one of the big questions heading into the presentation of the Palme d’Or on Saturday at the Cannes Film Festival. The past five winners in Cannes have all been released by the indie distributor, including last year’s victor, “Anora.” On Saturday, Neon could make it six in a row. As far-fetched as that might sound, it might even be likely. Four of the most widely acclaimed film of Cannes — Joachim Trier’s family drama “Sentimental Value,” Jafar Panahi’s revenge thriller “It Was Just an Accident,” Kleber Mendonça Filho’s political thriller “The Secret Agent” and Óliver Laxe’s desert road trip “Sirât” — will be distributed by Neon.",
      "publishedAt": "2025-05-24T04:00:14Z",
      "title": "Cannes prepares to award the Palme d'Or, with Neon positioned to add to an unprecedented streak",
      "url": "https://apnews.com/article/cannes-2025-palme-dor-awards-72ccfe497665406489f8a9b997eda224",
      "urlToImage": "https://dims.apnews.com/dims4/default/f769a51/2147483647/strip/true/crop/8026x4515+0+418/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F66%2Ffbbdbe5e21e9fd030bcbba0569d3%2F8ee9a07a135446eb8feb68dc0778a695"
    },
    {
      "author": "Deepti Hajela",
      "description": "Ask someone for their thoughts, could it now cost you a nickel? If you want to call somebody stingy, would you say they’re a quarter-pincher? And if they spend money unwisely, are they now dime wise but pound foolish? Ok, maybe those are some penny-ante concerns in the wake of the U.S. Treasury saying it will stop making shiny new penny coins after the current production run is complete. But it is the end of an era in the United States. While there will still be over a billion pennies in circulation, no new cents will be joining their ranks for the first time in more than two centuries.",
      "publishedAt": "2025-05-23T19:53:30Z",
      "title": "The penny won't be made anymore, but its impact on the culture remains",
      "url": "https://apnews.com/article/no-more-penny-end-production-cent-25527a16976a8c81f91c1a4a4eba473a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8ef37f/2147483647/strip/true/crop/3000x1688+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2Fb0%2Ffec1953df8ad5ac70df1a75e293c%2Febe6676e626a46ffb644ab081b3ef915"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump on Friday threatened to put a 25% tariff on Apple products unless iPhones are manufactured in the United States. The threat delivered over social media could dramatically increase the price of iPhones, potentially hurting sales and the profits of one of America’s leading technology companies. The company now joins Amazon, Walmart and other major companies as being in the White House’s crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by the import taxes being imposed by Trump.",
      "publishedAt": "2025-05-23T11:39:48Z",
      "title": "Trump threatens 25% import tax on Apple unless iPhones are made in the US",
      "url": "https://apnews.com/article/trump-tariff-apple-iphone-tax-170021e8fad22878d0183b5d48971087",
      "urlToImage": "https://dims.apnews.com/dims4/default/060d102/2147483647/strip/true/crop/5383x3028+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F4a%2F263e817a39437ebb480885f4b629%2F2b51e19e1e9649db8f993672e49ba853"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}