{
  "articles": [
    {
      "author": "TARA COPP, MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The head of the CIA jetted to Europe for talks with Israeli and Qatari officials Monday, sounding out the potential for a deal on a new cease-fire and the release of hostages in Gaza, as the U.S.",
      "publishedAt": "2023-12-18T07:59:44Z",
      "title": "US envoys work for new hostage release deal, scale-down of Israel-Hamas war but say no timetable",
      "url": "https://apnews.com/c094153a62262f8c8e56ef13f98f528f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca2348661144405bce8421c095e8f2e/1920.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "MANAMA, Bahrain (AP) — The U.S. and a host of other nations are creating a new force to protect ships transiting the Red Sea that have come under attack by drones and ballistic missiles fired from Houthi-controlled areas of Yemen, Defense Secretary Lloyd Austin announced early Tuesday in Bahrain.",
      "publishedAt": "2023-12-18T21:32:21Z",
      "title": "Pentagon announces new international mission to counter attacks on commercial vessels in Red Sea",
      "url": "https://apnews.com/286d51bfd65e741e839e185f0f4a455b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de7f2253c40a404f9543359c049ea7ca/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and PAUL J. WEBER",
      "description": "BROWNSVILLE, Texas (AP) — Republican Texas Gov.",
      "publishedAt": "2023-12-18T20:33:10Z",
      "title": "Texas governor signs bill that lets police arrest migrants who enter the US illegally",
      "url": "https://apnews.com/8c86bc6c20a7c30d6127b2413b8688fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddb96974530240979e6b7920a93bb0da/1920.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Marvel had more riding on Jonathan Majors than perhaps any other actor. Now it's parting ways with him, and throwing years of plans for its cinematic universe in disarray.",
      "publishedAt": "2023-12-19T00:42:38Z",
      "title": "Jonathan Majors' Marvel ouster after assault conviction throws years of Disney's plans into disarray",
      "url": "https://apnews.com/d20f14b2ddeb088e5d09cf5889238990",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55ccc98aaba740ad8640d4221e413d78/3000.jpeg"
    },
    {
      "author": null,
      "description": "STOCKHOLM (AP) — A volcanic eruption started Monday night on Iceland's Reykjanes Peninsula, turning the sky orange and prompting the country’s civil defense to be on high alert.The eruption appears to have occurred about four kilometers (2.4 miles) from the town of Grindavik, the Icelandic Meteorological Office said.",
      "publishedAt": "2023-12-19T00:04:58Z",
      "title": "Iceland volcano erupts weeks after thousands were evacuated from a town on Reykjanes Peninsula",
      "url": "https://apnews.com/0840241f66c7799b55dfff4c3d4c4cc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3867c8ee5c724bd0881d38a474790573/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and DAVID CRARY",
      "description": "ROME (AP) — Pope Francis formally approved letting Catholic priests bless same-sex couples, the Vatican announced Monday, a radical shift in policy that aimed at making the church more inclusive while maintaining its strict ban on gay marriage.",
      "publishedAt": "2023-12-18T14:06:17Z",
      "title": "Pope approves blessings for same-sex couples that must not resemble marriage",
      "url": "https://apnews.com/bfa5b71fa79055626e362936e739d1d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1216a7315dcf424982e4093c88207c6b/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — An overnight earthquake killed at least 116 people in a cold and mountainous region in northwestern China, the country's state media reported Tuesday.Search and rescue operations were underway in Gansu and neighboring Qinghai provinces.",
      "publishedAt": "2023-12-18T23:43:15Z",
      "title": "Earthquake in northwestern China kills at least 116 people in Gansu and Qinghai provinces",
      "url": "https://apnews.com/6255dcb3ce03a570f6aaaf565230afb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eb6908d8e4b4128a5fd50d6e6b3aa48/3000.jpeg"
    },
    {
      "author": "RENATA BRITO and FELIPE DANA",
      "description": "FASS BOYE, Senegal (AP) — A month had passed when the first four men decided to jump.Countless cargo ships had navigated past them, yet no one had come to their rescue. Their fuel was finished.",
      "publishedAt": "2023-12-18T09:03:22Z",
      "title": "36 days at sea: How these castaways survived hallucinations, thirst and desperation",
      "url": "https://apnews.com/a0ea8214f4c17883af34808eef3e7f88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d54cd170ecc4eb680aec5104a42605f/1920.jpeg"
    },
    {
      "author": "JOVANA GEC",
      "description": "BELGRADE, Serbia (AP) — Serbia's weekend snap election was held in “unjust conditions,\" with multiple reports of irregularities, international observers said on Monday, as opponents of populist President Aleksandar Vucic took to the streets claiming the vote was rigged.",
      "publishedAt": "2023-12-18T10:05:41Z",
      "title": "Serbia's opposition takes to the streets claiming election fraud in Sunday's vote",
      "url": "https://apnews.com/068394fc25eadfbeb38402b34b10fd71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6c63a1bac584ecda3e342e6b7741bd7/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Justice Sandra Day O'Connor, the first woman to serve on the U.S. Supreme Court, was remembered Monday as a trailblazer who never lost sight of how the high court's decisions affected all Americans.",
      "publishedAt": "2023-12-18T05:23:11Z",
      "title": "The late Sandra Day O'Connor, the first woman to serve on the Supreme Court, honored as trailblazer",
      "url": "https://apnews.com/92f9145bd594b84f0911b3fa0a244761",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c26483ea6c074014bdd5907ea20a0d33/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}