{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Shooter dead and rally attendee killed at Trump event in Pennsylvania, Butler County District attorney tells AP.",
      "publishedAt": "2024-07-13T23:24:26Z",
      "title": "Shooter dead and rally attendee killed at Trump event in Pennsylvania, Butler County District attorney tells AP",
      "url": "https://apnews.com/106e3757e54750dba6f4c6bc99bda109",
      "urlToImage": ""
    },
    {
      "author": "JILL COLVIN, COLLEEN LONG, JULIE CARR SMYTH, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "BUTLER, Pa. (AP) — The shooting at former President Donald Trump’s rally in Pennsylvania is being investigated as an attempted assassination of the former president and presumptive Republican nominee, law enforcement officials say.",
      "publishedAt": "2024-07-13T04:00:26Z",
      "title": "Shooting at Trump rally is being investigated as assassination attempt, AP sources say",
      "url": "https://apnews.com/7c7ba6b99b5f38d2d840ed95b2fdc3e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0e100d9161d4356aaff73843400aa90/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Donald Trump’s campaign says he is “fine” after being whisked off the stage at a rally in Butler, Pennsylvania after apparent gunshots rang through the crowd. A statement says “President Trump thanks law enforcement and first responders for their quick action during this heinous act.” It adds that “he is fine and is being checked out at a local medical facility.",
      "publishedAt": "2024-07-13T14:29:06Z",
      "title": "The Latest: Trump whisked from stage following apparent gunfire at rally, says he is fine",
      "url": "https://apnews.com/56b8d4463b242e2bd23194fed7704d6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05e4c752929a47c0a2824b77305bf64e/3000.jpeg"
    },
    {
      "author": "MOHAMED JAHJOUH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel said it targeted Hamas’ shadowy military commander in a massive strike Saturday in the crowded southern Gaza Strip that killed at least 90 people including children, according to local health officials.",
      "publishedAt": "2024-07-13T10:27:48Z",
      "title": "Israeli strike targets the Hamas military commander and kills at least 90 in southern Gaza",
      "url": "https://apnews.com/83bc4de7ed25b317c7871fd5c0999ad1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc3944ec9d7a4c7d869b87a791954d6f/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is on a public and private blitz to shake off concerns about his cognitive capacities.But with public doubts about his fitness to serve unabating, Biden’s every move is now under a withering microscope as any potential stumble risks becoming magnified and delivering another blow to his candidacy.",
      "publishedAt": "2024-07-13T04:01:23Z",
      "title": "Biden's supporters want to 'let Joe be Joe' — but his stumbles are now under a bigger spotlight",
      "url": "https://apnews.com/834695dd707d3de47e86a791d4387915",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca3e714a644d41d2939c4c039272aad1/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — European allies in NATO are stepping up their military spending, just as Donald Trump wanted. They're pointing to common interests, such as concerns over China.",
      "publishedAt": "2024-07-13T12:13:56Z",
      "title": "With words, deeds and arms deals, allies make the case for NATO in terms that would appeal to Trump",
      "url": "https://apnews.com/824a12356d561caad2341805b04d58ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ecc67f6c03945b0a400aa4f013a7aeb/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Richard Simmons, television's hyperactive court jester of physical fitness who built a mini-empire in his trademark tank tops and short shorts by urging the overweight to exercise and eat better, died Saturday.",
      "publishedAt": "2024-07-13T21:45:47Z",
      "title": "Richard Simmons, a fitness guru who mixed laughs and sweat, dies at 76",
      "url": "https://apnews.com/db369da9e7f54f17bbbb1331af43508f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe8584c93cfe40bc9a9efbb657b479df/2025.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Dr. Ruth Westheimer, the diminutive sex therapist who became a pop icon, media star and best-selling author through her frank talk about once-taboo bedroom topics, has died. She was 96.",
      "publishedAt": "2024-07-13T14:39:41Z",
      "title": "Dr. Ruth Westheimer, America’s diminutive and pioneering sex therapist, dies at 96",
      "url": "https://apnews.com/6d4af57b5f034bf9a90977de41b88735",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd62f92b3cc84ee6ab65dcad0cc26b00/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russian shelling of Ukraine killed four people on Saturday, officials said, as the two countries exchanged drone attacks, one of which set ablaze a Russian oil depot. Two people died in Ukraine’s partly occupied Kherson region and two were wounded in the attack close to the regional capital, said Gov.",
      "publishedAt": "2024-07-13T08:47:29Z",
      "title": "Shelling kills 4 in Ukraine as a drone attack sparks fire at an oil depot in Russia",
      "url": "https://apnews.com/cd0e673169643690c5b9b57ff1c97186",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0820f9ce793541cdb4fd33ce2cfd98f9/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "Conservative groups are systematically attempting to challenge the legitimacy of large numbers of voter registrations across the country before the presidential election.The strategy is part of a wider effort raising questions about the integrity of this year's election as former President Donald Trump repeatedly claims without evidence that his opponents are trying to cheat.",
      "publishedAt": "2024-07-13T14:51:46Z",
      "title": "Conservative groups are pushing to clean voter rolls. Others see an effort to sow election distrust",
      "url": "https://apnews.com/36c5596361f4596f245ffeee7b138764",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d716af732ac74402a83721b115597bd5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}