{
  "articles": [
    {
      "author": "JOSEPH WILSON, MELANIE LIDMAN and JOSEPH KRAUSS",
      "description": "TEL AVIV, Israel (AP) — Norway, Ireland and Spain said Wednesday they would recognize a Palestinian state, a historic but largely symbolic move that further deepens Israel’s isolation more than seven months into its grinding war against Hamas in Gaza.",
      "publishedAt": "2024-05-22T06:42:14Z",
      "title": "Norway, Ireland and Spain say they will recognize a Palestinian state, deepening Israel's isolation",
      "url": "https://apnews.com/ddfd774a23d39f77f5977b9c89c43dbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f6907d42f3a46c495ad088c08415880/1920.jpeg"
    },
    {
      "author": "ALBERTO MENDOZA",
      "description": "SAN PEDRO GARZA GARCIA, Mexico (AP) — A strong gust of wind toppled the stage at a campaign rally Wednesday evening in the northern Mexican state of Nuevo Leon, killing at least nine people — including a child — and injuring 63, the state's governor said.",
      "publishedAt": "2024-05-23T03:37:03Z",
      "title": "Strong winds topple stage at a campaign rally in northern Mexico, killing at least 9 people",
      "url": "https://apnews.com/1c4745f31a5b3caf2bce2db47d7cec12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a03eb1f4d0640a78f0b411ef94c867e/1920.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — A deadly tornado that wreaked havoc in the small city of Greenfield, Iowa, left four people dead and nearly three dozen injured, officials said, while a fifth person was killed elsewhere.",
      "publishedAt": "2024-05-23T04:15:07Z",
      "title": "5 dead and nearly 3 dozen hurt in tornadoes that tore through Iowa, officials say",
      "url": "https://apnews.com/0c8fb42453cdac5a7e0ec7e193071e6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9560c318aa25425e8aa9155d863f5a1a/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan scrambled jets and put missile, naval and land units on alert Thursday over Chinese military exercises being conducted around the self-governing island democracy where a new president took office this week.",
      "publishedAt": "2024-05-23T03:12:15Z",
      "title": "Taiwan scrambles jets and puts missile, naval and land units on alert over China's military drills",
      "url": "https://apnews.com/2598c308207041be0638a0be028a9097",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05208f75d6d8464e94bdc1a02a1ded41/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and GEOFF MULVIHILL",
      "description": "CHICAGO (AP) — Republican lawmakers in states across the U.S. have been rejecting Democrats' efforts to protect or expand access to birth control, an issue Democrats are promoting as a major issue in this year's elections along with abortion and other reproductive rights concerns.",
      "publishedAt": "2024-05-23T04:01:58Z",
      "title": "A comment from Trump and GOP actions in the states put contraceptive access in the 2024 spotlight",
      "url": "https://apnews.com/d376b5c489298e3035f7f433fe579b1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d753358e3efe482ab8bf1a68ff16556b/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — If there are bragging rights associated with Donald Trump praising your legal acumen when he speaks after a day's testimony at his criminal trial, Fox News analyst Andy McCarthy has already been cited at least a dozen times.",
      "publishedAt": "2024-05-23T04:03:59Z",
      "title": "Donald Trump may be stuck in a Manhattan courtroom, but he knows his fave legal analysts",
      "url": "https://apnews.com/556f3eeb724c8bd11b26369f66620627",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcc2d71c3474456eae0786f8096d045b/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and JOHN LEICESTER",
      "description": "President Emmanuel Macron on Thursday met with local officials in riot-hit New Caledonia, having crossed the globe by plane in a high-profile show of support for the French Pacific archipelago gripped by deadly unrest and where Indigenous people have long sought independence from France.",
      "publishedAt": "2024-05-22T12:27:44Z",
      "title": "In riot-hit New Caledonia, French President Macron says priority is return to calm amid unrest",
      "url": "https://apnews.com/4ab593152d9c91c9bdcd2f91d8911f97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/589ebf418bd248ab88b926876186dddb/1920.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — A second flag of a type carried by rioters during the attack on the U.S. Capitol on Jan. 6, 2021, was displayed outside a house owned by Supreme Court Justice Samuel Alito, The New York Times reported Wednesday.",
      "publishedAt": "2024-05-22T22:17:54Z",
      "title": "Second flag carried by Jan. 6 rioters displayed outside house owned by Justice Alito, report says",
      "url": "https://apnews.com/1842c40b833637c981c59c3f39bc4669",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e4333352ce34cdf9b855c41e764f49c/3000.jpeg"
    },
    {
      "author": "FRANKLIN BRICEÑO",
      "description": "LIMA, Peru (AP) — The crack of bat on ball and the sight of Venezuelan children running the bases on the soccer field turned baseball diamond on the outskirts of Peru's capital are watched with confusion by locals accustomed to soccer.",
      "publishedAt": "2024-05-23T04:04:05Z",
      "title": "Baseball becomes a shelter for Venezuelan children in soccer-mad Peru",
      "url": "https://apnews.com/2db8aa8616bbcea874b703f87dd26f35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a349c4e9fe4948eabf2b440cc9712502/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "You didn’t think summer travel would be easy, did you?Highways and airports are likely to be jammed the next few days as Americans head out for Memorial Day weekend getaways and then return home.",
      "publishedAt": "2024-05-23T05:06:38Z",
      "title": "Remember last year's Memorial Day travel jams? Chances are they will be much worse this year",
      "url": "https://apnews.com/6d05ba4de79f1ae1ca7fd2c822b532f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d18db82bb5074f45b0adea6e12b659ac/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}