{
  "articles": [
    {
      "author": "ALEXANDRA OLSON, ZEKE MILLER",
      "description": "President Donald Trump’s administration is directing that all federal diversity, equity and inclusion staff be put on paid leave, and that agencies develop plans to lay them off. That's according to a memo Tuesday from the Office of Personnel Management. The memo follows an executive order Trump signed on his first day ordering a sweeping dismantling of the federal government’s diversity and inclusion programs that could touch on everything from anti-bias training to funding for minority farmers and homeowners. The memo directs agencies to place DEI office staffers on paid leave by 5 p.m. Wednesday, and take down all public DEI-focused webpages by the same deadline.",
      "publishedAt": "2025-01-21T23:03:53Z",
      "title": "Trump directs all federal diversity, equity and inclusion staff be put on leave",
      "url": "https://apnews.com/article/dei-trump-executive-order-diversity-834a241a60ee92722ef2443b62572540",
      "urlToImage": "https://dims.apnews.com/dims4/default/e93f226/2147483647/strip/true/crop/4479x2519+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F70%2F5f7e23f4ef8e66616922e00aa2c7%2F1891260582d84f2598be01c9cd832936"
    },
    {
      "author": "MICHELLE L. PRICE, ZEKE MILLER",
      "description": "President Donald Trump has defended his decision to pardon people convicted of assaulting police officers during the attack on the Capitol and suggests there could be a place in U.S. politics for the Proud Boys extremist group, quickly evoking some of the controversies of his first term. Trump on Tuesday defended his decision to use his first hours in office to pardon hundreds of people who participated in violence at the Capitol siege on Jan. 6, 2021, including the former leaders of the Oath Keepers and Proud Boys, who were convicted of seditious conspiracy charges but released from prison after Trump signed his order.",
      "publishedAt": "2025-01-21T16:47:26Z",
      "title": "Trump defends pardons for rioters and suggests Proud Boys could have place in politics",
      "url": "https://apnews.com/article/trumps-first-day-white-house-b9ab76e21a159e681ea5ac74231adcea",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8e0d4b/2147483647/strip/true/crop/2143x1205+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fc1%2F0e82ad14f27645de7ff8c5013a7d%2Fe65c455f5db64376a121505d05d5ed07"
    },
    {
      "author": null,
      "description": "The Episcopal bishop of Washington used the inaugural prayer service at the Washington National Cathedral Tuesday to directly address President Donald Trump, urging him to \"have mercy\" and compassion for LGBTQ people and undocumented migrant workers.",
      "publishedAt": "2025-01-21T19:25:02Z",
      "title": "Reverend at inaugural prayer service implores Trump to ‘have mercy’ on LGBTQ people and migrants",
      "url": "https://apnews.com/video/reverend-at-inaugural-prayer-service-implores-trump-to-have-mercy-on-lgbtq-people-and-migrants-1667ce77106b4fcbb92658f92ec772bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/71ecdb9/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F9a%2F30a44cb34650a81b41ea31457043%2Fyoutube-thumbnails-2025-01-21t143458-931.png"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "President Donald Trump has publicly promised a shock-and-awe campaign to deliver major policy victories, and less than 36 hours after Trump’s inauguration, Democrats are struggling to confront it. In less than two days, the Republican president has moved to end diversity and inclusion programs across the federal government, withdrawn the U.S. from the Paris climate accords, blocked a federal law banning TikTok, and sought to end the constitutional guarantee of birthright citizenship. Each of those actions enrages part of the Democratic base. Together, they make it difficult to formulate a response by an already fractured party.",
      "publishedAt": "2025-01-21T22:34:02Z",
      "title": "Democrats struggle to pick their message against Trump",
      "url": "https://apnews.com/article/democrats-messaging-trump-tech-billionaires-strategy-policies-4c4a340700cbab5f36aeb8aa23f2691c",
      "urlToImage": "https://dims.apnews.com/dims4/default/60152ce/2147483647/strip/true/crop/3847x2164+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F8d%2F8cbe1d06b4887adaa197c60996b4%2F7f407e7370d949c98c8ac79d85943501"
    },
    {
      "author": "MIKE CATALINI",
      "description": "Attorneys general from 22 states have sued to block President Donald Trump’s move to end a century-old immigration policy known as birthright citizenship guaranteeing that U.S.-born children are citizens regardless of their parents’ status. Trump’s roughly 700-word executive order, issued late Monday, amounts to a fulfillment of something he talked about during the presidential campaign. But whether it succeeds is far from certain as attorneys general in 22 states and two cities challenged the order in court on Tuesday, seeking to block the president.",
      "publishedAt": "2025-01-21T17:22:51Z",
      "title": "22 states sue to stop Trump's order blocking birthright citizenship",
      "url": "https://apnews.com/article/birthright-citizenship-trump-executive-order-immigrants-fc7dd75ba1fb0a10f56b2a85b92dbe53",
      "urlToImage": "https://dims.apnews.com/dims4/default/959bdb0/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2Fbb%2Fb3cdd69d538b479f719f6a448a0e%2F7d3bfb7c093148b0be7a5ce7384409d9"
    },
    {
      "author": "ALAN SUDERMAN",
      "description": "President Donald Trump’s goodwill in the cryptocurrency industry has taken a hit after he and his wife launched meme coins — a move critics say looks like an unseemly cash grab that undermines an effort to legitimize digital assets. The industry, which felt unfairly targeted by the Biden administration and spent heavily to help Trump win, is eager for the new president’s help to make crypto a bigger part of mainstream financial systems. Trump has promised a lighter regulatory touch and picked pro-crypto officials for key government positions. By associating himself so closely with meme coins, some crypto fans worry that Trump hurts his chances to help the wider crypto industry.",
      "publishedAt": "2025-01-21T22:48:11Z",
      "title": "Trump's embrace of meme coin sours mood in crypto industry",
      "url": "https://apnews.com/article/trump-crypto-meme-coin-regulation-c624272aead106ff7ca04419e68949d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee72faa/2147483647/strip/true/crop/3941x2217+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2Fa7%2Fb369d7261d04302076f9a81f4743%2F14f45dbfb90b4bdc85cd3d5bed7832e3"
    },
    {
      "author": "BERNARD CONDON",
      "description": "Right-wing extremists are celebrating Elon Musk’s straight-arm gesture during a speech Monday, although his intention wasn’t totally clear and some hate watchdogs are saying not to read too much into it. One extremist group saw it as a rallying cry for their movement. Hate watchdogs said it was unclear what Musk was trying to convey and urged caution. Musk himself was dismissive of the critics who saw it as a Nazi salute, though he didn't offer further explanation. But the confusion and plea for calm hasn’t stopped critics and fans alike of the world’s richest man from reading into the gesture what they wanted.",
      "publishedAt": "2025-01-21T18:51:54Z",
      "title": "Musk's straight-arm gesture embraced by right-wing extremists regardless of what he meant",
      "url": "https://apnews.com/article/musk-gesture-salute-antisemitism-0070dae53c7a73397b104ae645877535",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ebb23d/2147483647/strip/true/crop/4011x2256+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fea%2F65d56ae4a8288299545146d3bfe2%2F87e399711fe94f7ba2a0d63e87a1ec7c"
    },
    {
      "author": "ERIC TUCKER",
      "description": "The Justice Department has reassigned key senior officials across multiple divisions as part of a leadership shakeup ahead of the expected confirmation of President Donald Trump’s pick for attorney general, Pam Bondi. Among those moved to other positions inside the department is Bruce Swartz, the longtime head of the Justice Department’s office of international affairs, which handles extradition matters. That's according to people familiar with the matter who spoke on condition of anonymity to The Associated Press to discuss personnel moves and who said that as many as 20 officials had been reassigned. Another affected official is George Toscas, a veteran deputy assistant attorney general in the department’s national security division.",
      "publishedAt": "2025-01-21T23:16:14Z",
      "title": "Key career officials at Justice Department reassigned to different positions",
      "url": "https://apnews.com/article/trump-fbi-justice-department-360fe0c616e11f72bca68ab69f5eed6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f247266/2147483647/strip/true/crop/2713x1526+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fcf%2F8a041454efbec095a5dc10d5e736%2F06bfd46193044af6b286847339eeb6e7"
    },
    {
      "author": "GERALD HERBERT, DAVID J. PHILLIP",
      "description": "A rare frigid storm is charging through Texas and the northern Gulf Coast, blanketing New Orleans and Houston with snow, closing highways and grounding nearly all flights. School was canceled Tuesday for students in areas more used to hurricane dismissals than snow days. The storm has prompted the first ever blizzard warnings for several coastal counties near the Texas-Louisiana border. Heavy snow, sleet and freezing rain are expected around the Deep South as a blast of Arctic air plunges much of the Midwest and the eastern U.S. into a deep freeze. Nearly 2,000 flights to, from or within the U.S. have been canceled and about 10,000 more are delayed.",
      "publishedAt": "2025-01-21T05:10:13Z",
      "title": "Deep South braces for rare winter storm threatening heavy snow",
      "url": "https://apnews.com/article/us-extreme-cold-winter-storm-snow-3e9c316297191ca53f1ef26de8f9b9f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0261d9/2147483647/strip/true/crop/3540x1991+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Ff6%2F593866e33567f8d15d6da5ff559b%2F1149d834f7434a71a290180854160110"
    },
    {
      "author": "FARNOUSH AMIRI, TARA COPP",
      "description": "Senators vetting the nomination of Pete Hegseth for defense secretary have received an affidavit from a former sister-in-law alleging that the onetime Fox News was abusive to his second wife to the point where she feared for her safety. A lawyer for Hegseth denied the allegations. The sister-in-law, Danielle Hegseth, was formerly married to the nominee’s brother. In an affidavit obtained by The Associated Press, she said she believes that Pete Hegseth is “unfit” to run the Defense Department based on what she witnessed and heard. She said she first relayed her allegations to the FBI in December but was concerned that the information was not shared with Congress as senators consider Hegseth’s nomination to lead the Pentagon.",
      "publishedAt": "2025-01-21T22:38:41Z",
      "title": "Pete Hegseth's former sister-in-law alleges abuse against second wife in affidavit to Senate",
      "url": "https://apnews.com/article/pete-hegseth-affidavit-defense-secretary-pentagon-trump-e195ba72a3f47060f7a1b7a81981cba2",
      "urlToImage": "https://dims.apnews.com/dims4/default/7699446/2147483647/strip/true/crop/4714x2652+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F99%2Fdd92d18f9299efd64d477d1dcd59%2F8e21e95bbdf24e2ab4e4b95c0b543a28"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}