{
  "articles": [
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — A strong earthquake shook a high-altitude region of western China and areas of Nepal on Tuesday, damaging hundreds of houses, littering streets with rubble and killing at least 126 people in Tibet.",
      "publishedAt": "2025-01-07T01:51:33Z",
      "title": "Tibet earthquake kills at least 126 people and leaves many trapped",
      "url": "https://apnews.com/ca21bd4848209370b9eebcaf107208df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21e3a43862504640bcbf77c83acdd5f8/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and BRIAN WITTE",
      "description": "DES MOINES, Iowa (AP) — The plunging polar vortex brought subfreezing temperatures Tuesday to some of the southernmost points of the U.S., threatening to dump snow on parts of Texas and Oklahoma in the coming days and contributing to a power outage in Virginia's capital that made the water unsafe to drink.",
      "publishedAt": "2025-01-07T06:05:02Z",
      "title": "The polar vortex brings its bitter cold to the Southern US",
      "url": "https://apnews.com/3d4a3826d070d9e84d69bbf2800198a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fea10de29e214a11961691611ad0132a/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — Nearly 44 years after Jimmy Carter left the nation's capital in humbling defeat, the 39th president returns to Washington for three days of state funeral rites starting Tuesday.",
      "publishedAt": "2025-01-07T11:14:24Z",
      "title": "Jimmy Carter on his way back to Washington, where he remained an outsider",
      "url": "https://apnews.com/9200a643ca205719d94895c9a5deb36f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/762c8915fed843038d027aee96149416/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Living to 100 let Jimmy Carter fulfill his wish to vote for Democratic Vice President Kamala Harris against Republican Donald Trump in November.",
      "publishedAt": "2025-01-07T11:08:00Z",
      "title": "Trump's praise of Carter in death after jeering him in life deepens a contradictory relationship",
      "url": "https://apnews.com/e82074628e4faa974d8263017c8b5b3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ace4533358624aaf9d66c0c55d4e0e33/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS, HUMERA LODHI and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — More Americans say immigration should be a top focus for the U.S. government in 2025, as the country heads toward a new Republican administration in which President-elect Donald Trump has promised the mass deportations of migrants and an end to birthright citizenship.",
      "publishedAt": "2025-01-07T12:07:01Z",
      "title": "Immigration is a higher priority for Americans than it was a year ago, an AP-NORC poll shows",
      "url": "https://apnews.com/e6cb1e8eaca01d315f56d6560f0cc332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f123c607da664e1ebac39d54c3aaad7a/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau announced his resignation after facing an increasing loss of support both within his party and in the country.",
      "publishedAt": "2025-01-07T05:08:25Z",
      "title": "Who will replace Justin Trudeau?",
      "url": "https://apnews.com/84ff95a506d0c58226f0653447d8809b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a73ba79c675471cbcdf903dbd667061/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB and MALAK HARB",
      "description": "DAMASCUS, Syria (AP) — Handcuffed and squatting on the floor, Abdullah Zahra saw smoke rising from his cellmate’s flesh as his torturers gave him electric shocks. Then it was Zahra’s turn. They hanged the 20-year-old university student from his wrists until his toes barely touched the floor and electrocuted and beat him for two hours.",
      "publishedAt": "2025-01-07T05:11:58Z",
      "title": "Long silenced by fear, Syrians now speak about rampant torture under Assad",
      "url": "https://apnews.com/ad4c676858c8016ea5fd4f7a4946353e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9ed809525594000b057cc033e7ef257/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON, SYLVIE CORBET and ELAINE GANLEY",
      "description": "PARIS (AP) — Jean-Marie Le Pen, the founder of France’s far-right National Front who was known for fiery rhetoric against immigration and multiculturalism that earned him both staunch supporters and widespread condemnation, died Tuesday.",
      "publishedAt": "2025-01-07T12:24:52Z",
      "title": "Jean-Marie Le Pen, French far-right leader known for fiery rhetoric against immigration, dies at 96",
      "url": "https://apnews.com/67c1f95b9c864374b2bcba20f746d530",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9891dcc20f234f2bb9c49059c7173bc4/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration said Tuesday that a Sudanese paramilitary group and its proxies are committing genocide in a civil war with the country's military that has killed tens of thousands of people, leveling sanctions on the group’s leader and affiliated companies.",
      "publishedAt": "2025-01-07T15:47:20Z",
      "title": "US says Sudanese rebel force has committed genocide, and it imposes sanctions on the group's leaders",
      "url": "https://apnews.com/7a0d20f857af3fd428750cf2dfd231ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/123dcfe7d6904b6c82eeebd93ab14174/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Shortly before he was hanged by the Nazis in 1945 at age 39, Dietrich Bonhoeffer reportedly told a fellow prisoner: “This is the end — for me the beginning of life.”It was – more than he knew.",
      "publishedAt": "2025-01-07T13:00:57Z",
      "title": "What would Bonhoeffer do? Anti-Nazi pastor's legacy claimed, debated across political spectrum",
      "url": "https://apnews.com/493ff264db9529f67085c6bacb72a7a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/599091a27fdf4f75ac2b63571cf08f56/2834.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}