{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday ruled for the first time that former presidents have broad immunity from prosecution, extending the delay in the Washington criminal case against Donald Trump on charges he plotted to overturn his 2020 presidential election loss and all but ending prospects the former president could be tried before the November election.",
      "publishedAt": "2024-07-01T14:35:22Z",
      "title": "Supreme Court rules ex-presidents have broad immunity, dimming chance of a pre-election Trump trial",
      "url": "https://apnews.com/2dc0d1c2368d404adc0054151490f542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a1c6eb565164469b19988a4c2cbb416/1920.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The Supreme Court extended the delay in the criminal case against Donald Trump on charges he plotted to overturn the 2020 election, reducing the chance that Trump could be tried before the November election.",
      "publishedAt": "2024-07-01T12:07:03Z",
      "title": "US Supreme Court Latest: Court sends Trump’s immunity case back to lower court",
      "url": "https://apnews.com/2b8d1c3e88524ba55bef2508dd6202cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/158baa27b867400b9000694dbdb4d96a/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH, SAMY MAGDY and JULIA FRANKEL",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli army ordered a mass evacuation of Palestinians from much of Khan Younis on Monday, a sign that troops are likely to launch a new ground assault in the Gaza Strip’s second largest city.",
      "publishedAt": "2024-07-01T08:35:34Z",
      "title": "Israel orders Palestinians to flee Khan Younis, signaling likely new assault on southern Gaza city",
      "url": "https://apnews.com/453808f05ef8b98eb1a6b9814441224a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2927107ef4a54872bb15f227c22eba7a/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and JON GAMBRELL",
      "description": "NEW YORK (AP) — Victims of Hamas’ Oct. 7 attack on Israel sued Iran, Syria and North Korea on Monday, saying their governments supplied the militants with money, weapons and know-how needed to carry out the assault that precipitated Israel's ongoing war in Gaza.",
      "publishedAt": "2024-07-01T17:24:43Z",
      "title": "Lawsuit accuses Iran, Syria and North Korea of providing support for Hamas' Oct. 7 attack on Israel",
      "url": "https://apnews.com/86460c28b0e7f8c6c8cd1fad6b1f5929",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e62d6a9128e482a8df066241964d0d0/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — A dangerous and extremely powerful Hurricane Beryl made landfall Monday on the Caribbean island of Carriacou after becoming the earliest storm of Category 4 strength to form in the Atlantic, fueled by record warm waters.",
      "publishedAt": "2024-07-01T11:08:06Z",
      "title": "Beryl makes landfall as Category 4 hurricane on Caribbean island of Carriacou in Grenada",
      "url": "https://apnews.com/234b2ecc47f8f0a8d6f3778bea503861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b45c8c603e5d4c47b5102b29227ad2c8/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER, SYLVIE CORBET and BARBARA SURK",
      "description": "PARIS (AP) — With the ultimate outcome still up in the air, France's fiercely anti-immigration National Rally and opponents of the long-taboo far-right party scrambled Monday to capitalize on an indecisive first round of voting in surprise legislative elections.",
      "publishedAt": "2024-07-01T09:51:08Z",
      "title": "French far right works to turn election win into power. Its rivals want to stop it in decisive vote",
      "url": "https://apnews.com/d03ea9af865b1f1f4ee6044194a305fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5a6d164bc64aa4a3b65f93da02099c/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans on Monday filed a lawsuit against Attorney General Merrick Garland for the audio recording of President Joe Biden's interview with a special counsel in his classified documents case, asking the courts to enforce their subpoena and reject the White House's effort to withhold the materials from Congress.",
      "publishedAt": "2024-07-01T16:03:46Z",
      "title": "House Republicans sue Attorney General Garland over access to Biden special counsel interview audio",
      "url": "https://apnews.com/1757268eb7d7343aa1e9cc0ddafdbf5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54b607ddb2b64b5c9d5b78cd3573d399/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH and LINDSAY WHITEHURST",
      "description": "DANBURY, Conn. (AP) — Longtime Trump ally Steve Bannon was taken into custody Monday after surrendering at a federal prison to begin a four-month sentence on contempt charges for defying a subpoena in the congressional investigation into the U.S.",
      "publishedAt": "2024-07-01T04:14:48Z",
      "title": "Trump ally Steve Bannon surrenders to federal prison to serve 4-month sentence on contempt charges",
      "url": "https://apnews.com/77353a10250c36f77b2c1b7d188c5250",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e21e52a103464d48905a31aba5d1844f/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday kept a hold on efforts in Texas and Florida to limit how Facebook, TikTok, X, YouTube and other social media platforms regulate content posted by their users.",
      "publishedAt": "2024-07-01T14:28:19Z",
      "title": "The Supreme Court keeps on hold efforts in Texas and Florida to regulate social media platforms",
      "url": "https://apnews.com/dc523bc9a6ef7b0f7b0aa933d0a43cca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1317df41102478c9c302d7c5b08a7ee/3000.jpeg"
    },
    {
      "author": null,
      "description": "ARLINGTON, Va. (AP) — Boeing announced plans to acquire key supplier Spirit AeroSystems for $4.7 billion, a move that it says will improve plane quality and safety amid increasing scrutiny by Congress, airlines and the Department of Justice.",
      "publishedAt": "2024-07-01T05:07:28Z",
      "title": "Under pressure on plane safety, Boeing is buying stressed supplier Spirit for $4.7 billion",
      "url": "https://apnews.com/c6956d6f22355c95aa39a79eb384ff41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fc8fd73cfef43aa91f02e30533c35c8/2212.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}