{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Pennsylvania’s governor says a small plane has crashed in Philadelphia as crews respond to a fiery scene. The crash happened Friday less than 3 miles from Northeast Philadelphia Airport, which primarily serves business jets and charter flights. Philadelphia’s emergency management office says Friday there was a “major incident” at the location of the crash site and that roads are closed in the area.",
      "publishedAt": "2025-02-01T00:19:36Z",
      "title": "A small plane has crashed in Philadelphia, governor says",
      "url": "https://apnews.com/article/philadelphia-pa-plane-crash-incident-9f5cfa83125137bf523558cc3738a370",
      "urlToImage": "https://dims.apnews.com/dims4/default/03eadba/2147483647/strip/true/crop/5858x3295+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F50%2Fb3529163517b522fb8bf2c98984d%2Ff4e858d21db247b98f09a318babbd960"
    },
    {
      "author": null,
      "description": "A small plane crashed in Northeast Philadelphia 30 seconds after it took off as crews respond to a fiery scene, Pennsylvania’s governor said Friday.",
      "publishedAt": "2025-02-01T01:25:31Z",
      "title": "Philadelphia plane crash causes fiery scene with multiple homes ablaze",
      "url": "https://apnews.com/video/philadelphia-plane-crash-causes-fiery-scene-with-multiple-homes-ablaze-9d8c42156f5246cbb7cca7aeeee2a854",
      "urlToImage": "https://dims.apnews.com/dims4/default/db6fcaf/2147483647/strip/true/crop/427x240+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fee%2Fbd5c81be6cc4d84edad07dcd4098%2Fus-pa-small-plane-crash-smoke-20250201i-autocr-1920x1080.jpg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "Trump administration officials are moving to fire FBI agents involved in politically sensitive investigations involving President Donald Trump. That's according to two people familiar with the plans. It was not clear how many agents might be affected, but officials acting at the direction of the administration were working to identify individual agents who could be terminated, said the people who insisted on anonymity to discuss private conversations. Among the politically explosive investigations involving Trump over the last four years were inquiries into his efforts to overturn the 2020 presidential election and his hoarding of classified documents, as well as hundreds of criminal cases against rioters who stormed the U.S. Capitol on Jan. 6, 2021.",
      "publishedAt": "2025-01-31T20:00:28Z",
      "title": "Trump admin moving to fire FBI agents involved in investigations of president",
      "url": "https://apnews.com/article/trump-fbi-firing-a7b19a5f414ce82c6f6b5f6656000d23",
      "urlToImage": "https://dims.apnews.com/dims4/default/36af382/2147483647/strip/true/crop/5193x2921+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F26%2F913429508e156d628621d072b6ec%2F52260ac42e484d67bf28eb4818090f55"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "A government memo aimed at implementing President Donald Trump’s order rolling back protections for transgender people has rippled through the federal government as agencies scrambled to make changes to strip “gender ideology” from websites, contracts and emails. The Office of Personnel Management directed agency heads to have staff remove pronouns from their government emails, disband employee resource groups, and terminate grants and contracts related to the issue. The directive was sent Wednesday and ordered the changes instituted by 5 p.m. Friday. It also asked agencies to remove the term “gender” from government forms and swap it out with “sex.”",
      "publishedAt": "2025-01-31T21:44:34Z",
      "title": "Health data, entire pages wiped from federal websites as Trump officials target 'gender ideology'",
      "url": "https://apnews.com/article/trump-gender-ideology-sex-pronouns-order-transgender-2d7e54837f5d0651ed0cefa5ea0d6301",
      "urlToImage": "https://dims.apnews.com/dims4/default/23f7d58/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Fec%2F5a3193af7fcc27bbed6a65ef66d3%2Fa5b71a0cfae748c08b3b97a5f2d450d9"
    },
    {
      "author": "SARA CLINE, GEOFF MULVIHILL",
      "description": "A New York doctor has been indicted by a Lousiana grand jury for allegedly prescribing an abortion pill online in the Deep South state, which has one of the strictest near-total abortion bans in the country. Dr. Margaret Carpenter and her company, Nightingale Medical were charged on Friday with criminal abortion by means of abortion-inducing drugs, a felony. The case appears to be the first instance of criminal charges against a doctor accused of sending abortion pills to another state, at least since the U.S. Supreme Court overturned Roe v. Wade in 2022 and opened the door for states to have strict anti-abortion laws.",
      "publishedAt": "2025-01-31T18:37:19Z",
      "title": "New York doctor indicted for prescribing abortion pill in Louisiana",
      "url": "https://apnews.com/article/abortion-indictment-lousiana-new-york-doctor-63ff4d9da8a9b592a7ca4ec7ba538cd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/71e08a2/2147483647/strip/true/crop/8251x4641+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fea%2F1b9f4ad3d70bfdc51b056fc68145%2F8e6131da98e941e1945640377b30e685"
    },
    {
      "author": "ZEKE MILLER, AAMER MADHANI, JOSH BOAK",
      "description": "Canada and Mexico say they’ve prepared the option of retaliatory tariffs to be used if necessary now that the White House says the U.S. will put in place 25% tariffs on imports from them this weekend. Canadian Prime Minister Justin Trudeau says tariffs would have “disastrous consequences” for the U.S., putting American jobs at risk and causing prices to rise. Mexican President Claudia Sheinbaum says Mexico has a “Plan A, Plan B, Plan C for what the United States government decides.” The White House on Friday provided no word on whether there would be any exemptions to the measures that could result in swift price increases to U.S. consumers.",
      "publishedAt": "2025-01-31T18:43:55Z",
      "title": "White House says Trump tariffs on Canada, Mexico and China will come Saturday. No word on exemptions",
      "url": "https://apnews.com/article/trump-tariffs-china-canada-mexico-fentanyl-e526616cdcb7fc596ed999cb89ee2265",
      "urlToImage": "https://dims.apnews.com/dims4/default/189f603/2147483647/strip/true/crop/3295x1853+0+174/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F48%2F89d3dd8690985edc8eae9de02397%2F02d1baf5cbed4fe5aae65c51b8f020cc"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP, ADRIANA GOMEZ LICON, LEA SKENE",
      "description": "A midair collision between an Army helicopter and an American Airlines flight from Kansas has killed all 67 people aboard the two aircraft. That was the word from authorities Thursday as they scrutinized the actions of the military pilot after the country’s deadliest aviation disaster in almost a quarter century. At least 28 bodies were pulled from the icy waters of the Potomac River after the helicopter apparently flew into the path of the jet late Wednesday while it was landing at Ronald Reagan National Airport near Washington. The plane carried 60 passengers and four crew. Three soldiers were aboard the helicopter.",
      "publishedAt": "2025-01-31T05:09:23Z",
      "title": "Midair collision kills 67 people in the deadliest US air disaster in almost a quarter century",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-325edc6c0c2439dd6c1e73a81e382c0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb5006c/2147483647/strip/true/crop/5606x3153+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F5e%2F2906f862faa347ab67a750b218ee%2F6bf61d420d0b48b496f94fb121f81120"
    },
    {
      "author": "HALLIE GOLDEN, DAVE COLLINS",
      "description": "A passenger jet hit an Army helicopter with three soldiers as the plane got ready to land at Reagan National near Washington, D.C. The two aircraft went into the Potomac River Wednesday night, killing all 67 aboard. D.C.'s fire chief said Friday that 41 bodies have been recovered. The passengers included figure skaters returning from the 2025 U.S. Figure Skating Championships in Wichita, Kansas, and a group of hunters returning from a guided trip. The cause is under investigation and first responders continue searching the river. Defense Secretary Pete Hegseth says a key question is how high the helicopter was flying.",
      "publishedAt": "2025-01-30T08:34:30Z",
      "title": "What we know about the D.C. plane crash",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-aircraft-crash-9d79051a9e535bd855df5a4e5553b2e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/0370ebd/2147483647/strip/true/crop/4009x2255+0+211/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F65%2F1ee9475d90651abd3b62e6b6f4f8%2Fe9377da388164cbd9d0012973aedab0d"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "It was a day of wrenching emotions: Relief, joy, anger and trauma all spilled out as Hamas released a new round of hostages and Israel freed more Palestinians from its prisons.",
      "publishedAt": "2025-01-31T18:37:04Z",
      "title": "AP photos capture a day of wrenching emotion as Israel and Hamas release hostages and prisoners",
      "url": "https://apnews.com/article/mideast-wars-photo-gallery-hostages-eeb1fd13f239c33f9d35b8d88d2a7034",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec14ca4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F6d%2F138547c2c33ea92410c645158022%2F5dbceabc778d4f098a06ef231d6859aa"
    },
    {
      "author": "REGINA GARCIA CANO, JOSHUA GOODMAN",
      "description": "Six Americans who had been detained in Venezuela in recent months have freed by the government of President Nicolás Maduro after he met with a senior Trump administration official. U.S. President Donald Trump and his envoy for special missions, Richard Grenell, announced the release of the six men on social media. Grenell posted on X a photo showing him and the men aboard an aircraft. Grenell’s hours long trip to Venezuela, according to the White House, was focused on Trump’s efforts to deport Venezuelans back to their home country, which currently does not accept them, and on the release of the detained Americans.",
      "publishedAt": "2025-01-31T16:18:00Z",
      "title": "Venezuela frees 6 Americans after meeting between President Maduro and Trump's envoy",
      "url": "https://apnews.com/article/trump-maduro-envoy-migrants-grenell-edfa58920c0a76f0bbe9de995a07d1a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/dd1e5ab/2147483647/strip/true/crop/2451x1379+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F70%2F32260c896d6b5a323265b1faaff9%2Fdef21896888445e2a1884166b7977fe4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}