{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin has announced a temporary Easter ceasefire in Ukraine starting Saturday, citing humanitarian reasons. Russia and Ukraine meanwhile swapped hundreds of captured soldiers in the largest exchange since Moscow’s full-scale invasion started over three years ago. According to the Kremlin, the ceasefire will last from 6 p.m. Moscow time on Saturday to midnight following Easter Sunday. Ukrainian President Volodymy Zelenskyy dismissed it as “another attempt by Putin to play with human lives.” He wrote on X that air raid alerts are spreading across Ukraine and “Shahed drones in our skies reveal Putin’s true attitude toward Easter and toward human life.”",
      "publishedAt": "2025-04-19T10:30:02Z",
      "title": "Russia, Ukraine swap hundreds of prisoners in war's largest exchange",
      "url": "https://apnews.com/article/russia-ukraine-war-kursk-drones-3c940cf913f22eb21803841b4d026db8",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f5e569/2147483647/strip/true/crop/3093x1740+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2Fa2%2Fe1fb5835ec5ae8e258515fa1033b%2Fff5f44f32adc490b9a933985d7d7980b"
    },
    {
      "author": "Nicholas Riccardi, Mark Sherman",
      "description": "The Supreme Court has blocked, for now, the deportations of any Venezuelans held in northern Texas under an 18th century wartime law. In a brief order early Saturday, the court directed the Trump administration not to remove Venezuelans held in the Bluebonnet Detention Center “until further order of this court.” Justices Clarence Thomas and Samuel Alito dissented. The high court acted in an emergency appeal from the American Civil Liberties Union contending that immigration authorities appeared to be moving to restart removals under the Alien Enemies Act of 1798.",
      "publishedAt": "2025-04-18T18:50:42Z",
      "title": "Supreme Court blocks, for now, deportations of any Venezuelans held in northern Texas",
      "url": "https://apnews.com/article/aclu-trump-deport-venezuelans-supreme-court-5d85ffec44fca7c267315b34cec9ddb2",
      "urlToImage": "https://dims.apnews.com/dims4/default/c417445/2147483647/strip/true/crop/3514x1977+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2Ff5%2F03af1fe2bfa9751087e83a54a2f5%2F6977895aa7624aa58ea012cb64146ffa"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Gaza’s Health Ministry says more than 90 people have been killed by Israeli strikes in the last 48 hours. The ministry does not differentiate between civilians and combatants. The dead include at least 15 people killed overnight, among them women and children, some of who were sheltering in a designated humanitarian zone, according to hospital staff. Israel is ramping up attacks across Gaza as it tries to pressure Hamas to release its hostages and disarm. Israel has said it plans to occupy large “security zones” inside Gaza.",
      "publishedAt": "2025-04-19T10:16:12Z",
      "title": "Israeli strikes on Gaza kill more than 90 Palestinians",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-19-2025-5e80a0efc0b267515ec88aec4c3672d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": "Matthew Lee, Jon Gambrell",
      "description": "Iran and the United States are preparing for a second round of negotiations over Tehran’s rapidly advancing nuclear program in Rome. The talks Saturday in Italy over Easter weekend again will hinge on U.S. billionaire Steve Witkoff, the U.S. Mideast envoy of President Donald Trump, and Iranian Foreign Minister Abbas Araghchi. Whether the two men find common ground in the high-stakes negotiations could mean success or failure in the talks. At risk is a possible American or Israeli military strike on Iran’s nuclear sites, or the Iranians following through on their threats to pursue an atomic weapon.",
      "publishedAt": "2025-04-19T02:27:14Z",
      "title": "Iran, US prepare for second round of nuclear talks in Rome",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiations-rome-oman-5539236d72216f55aa7766be90b963b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ec9969/2147483647/strip/true/crop/6512x3663+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2Fa6%2F49121926d3deff268acfed58b048%2F52a3775696134ff1b9e386f3341c8444"
    },
    {
      "author": "Kwiyeon Ha, Pan Pylas",
      "description": "Thousands of trans rights protesters gathered in central London, days after the U.K.‘s Supreme Court ruled that a woman is someone born biologically female and that transgender women are excluded from that legal definition. With growing unease over what it means for the rights of transgender people, protesters came together Saturday for what was billed as an “emergency demonstration” in Parliament Square. Trans groups are worried that Wednesday’s landmark decision would undermine their rights, even though the U.K.’s highest court said transgender people remain protected from discrimination. The head of Equality and Human Rights Commission said the ruling will mean transgender women will be excluded from women’s toilets, hospital wards and sports teams.",
      "publishedAt": "2025-04-19T14:49:07Z",
      "title": "Thousands gather in London to support trans rights following UK ruling over definition of woman",
      "url": "https://apnews.com/article/britain-trans-rights-protest-court-ruling-london-63efca6104673e6b8647a20a0705683f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9a0905/2147483647/strip/true/crop/7912x4451+0+412/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F22%2Fcdb977eab0d3212739f3c39f0b7a%2Fcdceb0f1063f458096d02a3a3795a6d7"
    },
    {
      "author": "Collin Binkley",
      "description": "As U.S. colleges are pulling back on diversity, equity and inclusion practices, students of color say they are starting to lose campus mentors, move-in events, scholarships and diversity offices where they always have felt welcome on predominately white campuses. The full scope of campus DEI rollbacks is still emerging as colleges respond to the Trump administration’s orders against diversity practices. But students at some schools say early cuts are chipping away at the sense of community that has helped open the door to higher education. The retreat from DEI has accelerated under President Donald Trump and his threats to cut federal funding.",
      "publishedAt": "2025-04-19T04:09:42Z",
      "title": "College DEI rollbacks hit students' scholarships, campus mentors",
      "url": "https://apnews.com/article/dei-diversity-equity-inclusion-college-bbe09c081d8a47fcb5616c8fa3b23cee",
      "urlToImage": "https://dims.apnews.com/dims4/default/4914060/2147483647/strip/true/crop/7230x4067+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F7a%2Fd8022e8250d30cb0e4b707dbea6c%2Ff69faa32ca98458d8e724929c1996f1d"
    },
    {
      "author": "Ali Swenson",
      "description": "Some of the rioters who tried to take over the U.S. Capitol on Jan. 6, 2021, are now considering running for office after being pardoned by President Donald Trump. At least two dozen Republican groups around the country have invited Jan. 6 rioters to speak to their members in recent months, according to an Associated Press tally. There seems to be a segment of the party's base that views those pardoned rioters not as criminals, but as patriots. One historian see a danger in that because it's “a growing acceptance on the right of political violence, as long as it’s done in the service of Trump\" and his false claims about the 2020 election being stolen.",
      "publishedAt": "2025-04-19T12:55:38Z",
      "title": "Some pardoned Jan. 6 rioters are now candidates for office",
      "url": "https://apnews.com/article/capitol-riot-trump-politics-republicans-pardons-d70e8e27c1907ebb53a6b44d388eb703",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ef8e97/2147483647/strip/true/crop/4801x2701+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F07%2Ff9aba8ecbc1454daafffb14aaee9%2Fe4269bbcc7094d4593d0d96eaed3d5b0"
    },
    {
      "author": "Sean Murphy",
      "description": "Thirty years after the deadliest homegrown attack in U.S. history, former President Bill Clinton will return to Oklahoma City for a remembrance ceremony. Clinton was president on April 19, 1995, when a truck bomb exploded, destroying a nine-story federal building in the city's downtown. He will deliver the keynote address Saturday at a remembrance ceremony near the Oklahoma City National Memorial Museum. Clinton was widely praised for how he helped the city grapple with its grief in the wake of the bombing, which killed 168 people, including 19 children. He says it was a day in his presidency that he will never forget.",
      "publishedAt": "2025-04-19T04:04:32Z",
      "title": "Bill Clinton returns to Oklahoma City 30 years after the bombing",
      "url": "https://apnews.com/article/oklahoma-city-bombing-anniversary-bill-clinton-7705cadbc882630edf068ea45e035a3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2aca37e/2147483647/strip/true/crop/3000x1688+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fc5%2F308a0ce537440200bf1d7ba5dd9a%2F0e9fd2dd999a481db3bd67a914355154"
    },
    {
      "author": "Kate Payne, Heather Hollingsworth",
      "description": "After a deadly shooting at Florida State University, questions are emerging about how the stepson of a beloved sheriff’s deputy tasked with school safety at a middle school became the accused gunman. Political science student Phoenix Ikner was a long-standing member of a sheriff’s office youth advisory council. But when officers rushed to the university’s student union on reports of gunfire, authorities say it was the 20-year-old who used his stepmother’s former service weapon to open fire, killing two men and wounding six others. The chief of safety for Leon County Schools said the allegations underscore that “none of us are immune to tragedy.”",
      "publishedAt": "2025-04-19T04:03:31Z",
      "title": "Questions emerge about how a deputy's stepson became the accused gunman in deadly FSU shooting",
      "url": "https://apnews.com/article/phoenix-ikner-fsu-shooting-971835051a7f9b11e5cf4bc4ce018d8b",
      "urlToImage": "https://dims.apnews.com/dims4/default/70979a0/2147483647/strip/true/crop/2877x1618+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Ffc%2Faa330f1a50cc05f23811a9595d43%2F86100f9791de42ebaebd176a122e74f9"
    },
    {
      "author": "Jimmy Golen",
      "description": "The Boston Marathon and Mayor Michelle Wu insist that international runners and other foreign visitors remain welcome in the city. They say there is no evidence that travel for this year’s race has fallen off in the face of increased border scrutiny. Wu said at a public safety media briefing not far from the finish line, ‘We seek to be a home for everyone.’ This year’s marathon has more than 30,000 entrants from 128 countries. U.S. tourism officials say international visits have plummeted because of rhetoric over tariffs and talk of annexing Canada. Race officials say they will not know if no-shows are up after the start.",
      "publishedAt": "2025-04-18T20:47:53Z",
      "title": "Boston Marathon and city insist all are welcome. But some runners say politics will keep them home",
      "url": "https://apnews.com/article/boston-marathon-trump-travel-fe710d72d81df888afb9857f2ef20378",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e69935/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F9f%2F472a358164ca6790a63690db8a83%2F60b5850a79fb46aab74810d17108e87c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}