{
  "articles": [
    {
      "author": "SARAH EL DEEB and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israel said late Monday it planned to carry out more strikes in Lebanon against a Hezbollah-run financial institution that it targeted the night before and which it says uses customers' deposits to finance attacks against Israel.",
      "publishedAt": "2024-10-21T09:36:27Z",
      "title": "Israel says more strikes are coming against a Hezbollah-run financial institution",
      "url": "https://apnews.com/3fe94c75a6d6d44c89f350d7e94785df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa8af03aa4d44c2f9eab37f85e4c7b8c/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — Two weeks out from Election Day, the crisis in the Middle East is looming over the race for the White House, with one candidate struggling to find just the right words to navigate its difficult cross-currents and the other making bold pronouncements that the age-old conflict can quickly be set right.",
      "publishedAt": "2024-10-22T04:06:59Z",
      "title": "Mideast conflict looms over US presidential race as Harris and Trump jostle for an edge",
      "url": "https://apnews.com/623945957dac623c238041242e13340a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/073882e9bab94be7acf23e9d72985156/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and BILL BARROW",
      "description": "SWANNANOA, N.C. (AP) — Surveying storm damage in North Carolina, former President Donald Trump on Monday blasted federal emergency responders whose work has been stymied by armed harassment and a deluge of misinformation, but he said he was not concerned that the aftermath of Hurricane Helene would affect election results in the battleground state.",
      "publishedAt": "2024-10-21T04:20:25Z",
      "title": "Trump makes more debunked claims about FEMA as he surveys storm damage in North Carolina",
      "url": "https://apnews.com/2dea5d3130416a56f21a5c22ce2e4386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/299f8914b46843618d30955856212d7a/1920.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "MACON, Ga. (AP) — Sabrina Friday scanned the room at Mother's Nest, an organization in Macon that provides baby supplies, training, food and housing to mothers in need, and she asked how many planned to vote.",
      "publishedAt": "2024-10-22T04:11:35Z",
      "title": "In battleground Georgia, poor people see no reason to vote. That decision could sway election",
      "url": "https://apnews.com/34209a5bba0b2697eb6fcdd004dca584",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c9b0e439d24614bd9a54e6071a8c4e/3000.jpeg"
    },
    {
      "author": "FRANKLIN BRICEÑO and REGINA GARCIA CANO",
      "description": "LIMA, Peru (AP) — Peru’s former President Alejandro Toledo on Monday was sentenced to 20 years and six months in prison in a case involving Brazilian construction giant Odebrecht, which became synonymous with corruption across Latin America, where it paid millions of dollars in bribes to government officials and others.",
      "publishedAt": "2024-10-21T23:11:02Z",
      "title": "Peru’s ex-president Toledo gets more than 20 years in prison in case linked to corruption scandal",
      "url": "https://apnews.com/5f23c3d8fd176dfc6ca8125e96b2e3ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d98155234354a4eae1e23e94af9a23c/3000.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — China is holding live-fire drills off the coast of its southern Fujian province facing Taiwan, just a week after a massive air-and-sea drill it called punishment for Taiwan's president rejecting Beijing's claims of sovereignty.",
      "publishedAt": "2024-10-22T04:01:54Z",
      "title": "China holds live-fire drills opposite Taiwan, a week after large-scale exercise",
      "url": "https://apnews.com/4f7b62d187f68878acdacdd4d55fb891",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2baf23f1df64a23b2ad5577b7de7943/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The Israeli military has carried out a wave of airstrikes targeting branches of a financial institution affiliated with Lebanon’s Hezbollah, saying the quasi-banking system is being used to fund the militant group's military wing.",
      "publishedAt": "2024-10-21T17:40:11Z",
      "title": "What is the Hezbollah-linked financial institution Israel is targeting in Lebanon?",
      "url": "https://apnews.com/67220b894b55500b0be799a0be4245c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e448cfcbabf64b8ea84bf82155247db5/3000.jpeg"
    },
    {
      "author": "ANDREA RODRIGUEZ and MILEXSY DURAN",
      "description": "HAVANA (AP) — Cuba's capital remained largely paralyzed on Monday and the rest of the island braced for the fourth night of a massive blackout that has generated a handful of small protests and a stern government warning that any unrest will be punished.",
      "publishedAt": "2024-10-21T04:49:59Z",
      "title": "Storm causes at least 6 deaths in Cuba, where a long power outage is raising tempers",
      "url": "https://apnews.com/b197e174af2c9f664d4c3aaf0c5a6e75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29b380426b9f426d81a20cdd67ead047/1920.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "Dissent is thriving this fall at American colleges, and not just among student activists. With student protests limited by new restrictions, faculty have taken up the cause.To faculty, new protest rules threaten freedom of speech — and the freedom to think, both central to university life.",
      "publishedAt": "2024-10-22T04:05:07Z",
      "title": "New campus protest rules spur an outcry from college faculty",
      "url": "https://apnews.com/14da92667846c2b23a36eec64e1d8ff3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2910545fbd8a4dd3b67fe07cd5518ded/3000.jpeg"
    },
    {
      "author": null,
      "description": "FALL CITY, WASH. (AP) — Law enforcement officials found five people killed in a shooting inside a home southeast of Seattle on Monday morning and took a teenager into custody, police said. Several people called 911 around 5 a.m.",
      "publishedAt": "2024-10-21T22:58:23Z",
      "title": "Teen in custody after 5 found dead in shooting at home in Washington state, police say",
      "url": "https://apnews.com/95c41498579ce16783746202e48c269b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a057221e5ef4de9a24d4555fac92aff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}