{
  "articles": [
    {
      "author": "JAKE OFFENHARTZ, JENNIFER PELTZ, MICHAEL R. SISAK and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — In the wake of salacious testimony from porn actor Stormy Daniels, prosecutors in Donald Trump's hush money trial narrowed their focus to checks and phone records Friday as they laid the groundwork for jurors to hear from the star witness: Michael Cohen, Trump’s former attorney.",
      "publishedAt": "2024-05-10T04:09:22Z",
      "title": "Prosecutors focus on phone records in Trump's hush money trial as Michael Cohen's testimony awaits",
      "url": "https://apnews.com/ddef05884265e4d6217b55a89304b878",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a962bdb3260e470d889d2bbe27dae732/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Heavy fighting between Israeli troops and Palestinian militants on the outskirts of the southern Gaza city of Rafah has left crucial nearby aid crossings inaccessible and forced more than 110,000 people to flee north, U.N.",
      "publishedAt": "2024-05-10T10:46:06Z",
      "title": "Heavy fighting in Gaza's Rafah keeps aid crossings closed and sends 110,000 civilians fleeing",
      "url": "https://apnews.com/936d54a23f7db2e6e6f910216a703ab7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/725d5af6102c47008c178fa484a93072/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, ELLEN KNICKMEYER, MIKE BALSAMO and ZEKE MILLER",
      "description": "WASHINGTON (AP) — A soon-to-be-released Biden administration review of Israel's use of U.S.-provided weapons in its war in Gaza does not conclude that Israel has violated the terms for their use, according to three people who have been briefed on the matter.",
      "publishedAt": "2024-05-10T16:21:18Z",
      "title": "Biden administration won't conclude Israel violated terms of US weapons agreement, AP sources say",
      "url": "https://apnews.com/c83b6f39ce2799e5d2c473a337e2f857",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dd00633bff5426a9f8f9de4e3a81002/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI and MICHAEL CASEY",
      "description": "Police made dozens of arrests as pro-Palestinian protest encampments were dismantled Friday at the University of Pennsylvania and the Massachusetts Institute of Technology, hours after police tear-gassed demonstrators and took down a similar camp at the University of Arizona.",
      "publishedAt": "2024-05-10T10:02:57Z",
      "title": "Police arrest dozens as they break up pro-Palestinian protests at several US universities",
      "url": "https://apnews.com/7d9cd0a1f4ac7eaca41b38de798a2217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4089afaf4cb04fd285d86b1a6fae57df/1920.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "CHARLESTON, W.Va. (AP) — For Derrick Evans, being part of the mob that stormed the U.S. Capitol wasn’t enough. The former West Virginia lawmaker wants to make his path to the halls of Congress permanent.",
      "publishedAt": "2024-05-10T04:15:11Z",
      "title": "One man was a Capitol Police officer. The other rioted on Jan. 6. They're both running for Congress",
      "url": "https://apnews.com/7659d9493956919c83adf474259ab303",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a446ae8783e440f081b2f4358388d5bc/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN",
      "description": "SHREVEPORT, La. (AP) — Mona Hardin has been waiting five long years for any resolution to the federal investigation into her son’s deadly arrest by Louisiana State Police troopers, an anguish only compounded by the fact that nearly every other major civil rights case during that time has passed her by.",
      "publishedAt": "2024-05-10T05:05:52Z",
      "title": "'Where's Ronald Greene's justice?': 5 years on, feds still silent on Black motorist's deadly arrest",
      "url": "https://apnews.com/4446d9b069803545247c610882951763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5499f813f2b94993b53ace406685eb28/2493.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — A federal appeals court panel on Friday upheld the criminal conviction of Donald Trump’s longtime ally Steve Bannon for defying a subpoena from the House committee that investigated the attack on the U.S.",
      "publishedAt": "2024-05-10T15:10:15Z",
      "title": "Appeals court upholds Steve Bannon's contempt of Congress conviction",
      "url": "https://apnews.com/397cd470d2862816fea776b0d788a760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/553b2a3a21ad4364b49bb2e2fc1df81e/3000.jpeg"
    },
    {
      "author": null,
      "description": "TALLAHASSEE, Fla. (AP) — Powerful storms left thousands without electricity Friday in Florida and other Southeastern states, where damaging winds toppled trees onto homes and power lines following days of deadly severe weather that produced tornadoes in Michigan, Tennessee and other states.",
      "publishedAt": "2024-05-10T15:10:29Z",
      "title": "Storms slam parts of Florida, Mississippi and elsewhere as cleanup from earlier tornadoes continues",
      "url": "https://apnews.com/d0ab30032e266b707e17e0bae43c4c9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/225e75d78464429795ec67affb8699c6/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA and MIKE STOBBE",
      "description": "U.S. health and agriculture officials pledged nearly $200 million in new spending and other efforts Friday to help track and contain an outbreak of bird flu in the nation's dairy cows that has spread to more than 40 herds in nine states.",
      "publishedAt": "2024-05-10T17:08:14Z",
      "title": "US pledges money and other aid to help track and contain bird flu on dairy farms",
      "url": "https://apnews.com/0b46e7a28a20fe825d7a324a976bac22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1443759ee1e5491588a56cf661d4f9e9/3000.jpeg"
    },
    {
      "author": "ALICIA RANCILIO",
      "description": "A new generation can learn how to paint happy trees and to make happy accidents with a TV series teaching the Bob Ross -method of painting using some of the prolific artist's work that have never been seen before.",
      "publishedAt": "2024-05-10T13:33:29Z",
      "title": "Bob Ross' legacy lives on in new 'The Joy of Painting' series",
      "url": "https://apnews.com/cd50203eb6b3cf4f1893364cfae472be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00408369ad744d48b0a18a5c80a2e394/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}