{
  "articles": [
    {
      "author": "ANITA SNOW and THOMAS MACHOWICZ",
      "description": "WENDEN, Ariz. (AP) — A blanket of bright green alfalfa spreads across western Arizona's McMullen Valley, ringed by rolling mountains and warmed by the hot desert sun. Matthew Hancock's family has used groundwater to grow forage crops here for more than six decades.",
      "publishedAt": "2023-11-28T05:08:55Z",
      "title": "Tensions are bubbling up at thirsty Arizona alfalfa farms as foreign firms exploit unregulated water",
      "url": "https://apnews.com/d911d5219c8f41dc44d65fb2af6b04df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8735d652e5b84cba890206343d160861/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and CARA ANNA",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel pounded targets in the crowded southern half of the Gaza Strip on Saturday and ordered more neighborhoods designated for attack to evacuate, driving up the death toll even as the United States and others urged it to do more to protect Gaza civilians a day after a truce collapsed.",
      "publishedAt": "2023-12-02T07:32:44Z",
      "title": "Israeli offensive shifts to crowded southern Gaza, driving up death toll despite evacuation orders",
      "url": "https://apnews.com/f300e8dac70d5309bf5f5a75bace7689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f54a09edefb47e58a811ce253f33fa0/1920.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — When it came to the Middle East, Henry Kissinger wasn't pushing for peace — only for what was possible.By the time Kissinger died Wednesday at 100, the agreements he negotiated as United States secretary of state between Israel, Egypt and Syria stabilized borders for nearly half a century after the 1973 Arab-Israeli war.",
      "publishedAt": "2023-12-02T05:22:02Z",
      "title": "With 'shuttle diplomacy,' step by step, Kissinger chased the possible in the Mideast",
      "url": "https://apnews.com/e0d3d89e796d7a5b2bae230615987c1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c079178fdf49e980fe60131d725976/2942.jpeg"
    },
    {
      "author": "JON GAMBRELL, PETER PRENGAMAN and SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Fifty oil companies representing nearly half of global production have pledged to reach near-zero methane emissions and end routine flaring in their operations by 2030, the president of this year's United Nations climate talks said Saturday, a move that environmental groups called a “smokescreen.\"",
      "publishedAt": "2023-12-02T12:23:38Z",
      "title": "At COP28 meeting, oil companies pledge to combat methane. Environmentalists call it a \"smokescreen\"",
      "url": "https://apnews.com/58c756d843fbc696b28a330295505be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95d96d2a108c4c1f959e41eec72b7af7/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "A mother and her 14-year-old daughter are advocating for better protections for victims after AI-generated nude images of the teen and other female classmates were circulated at a high school in New Jersey.",
      "publishedAt": "2023-12-02T13:04:33Z",
      "title": "Teen girls are being victimized by deepfake nudes. One family is pushing for more protections",
      "url": "https://apnews.com/b6f44be048b31fe0b430aeee1956ad38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/120f1cc7fe7643959dc3a42f68721be6/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — One fall day in 2010, retired Supreme Court Justice Sandra Day O’Connor slipped into the courtroom where she worked for nearly 25 years to take in an “amazing” sight.",
      "publishedAt": "2023-12-02T05:16:07Z",
      "title": "Justice Sandra Day O'Connor paved a path for women on the Supreme Court. Four are serving today",
      "url": "https://apnews.com/fdda04cb0d18c0fd2086a062494f5f24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58514bac50aa4f8d9732b37e23f36fe6/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian security forces raided gay clubs and bars across Moscow Friday night, less than 48 hours after the country’s top court banned what it called the “global LGBTQ+ movement” as an extremist organization.",
      "publishedAt": "2023-12-02T09:21:39Z",
      "title": "Police raid Moscow gay bars after a Supreme Court ruling labeled LGBTQ+ movement 'extremist'",
      "url": "https://apnews.com/33e1b9a0110bf22dc2ebc7c42efe6335",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a064bdd574074d86bc7d3ad831646837/3000.jpeg"
    },
    {
      "author": null,
      "description": "LAS VEGAS (AP) — Five homeless people were shot in Las Vegas on Friday, one of them fatally, and police were searching for a lone suspect, authorities said. The shooting occurred around 5:30 p.m.",
      "publishedAt": "2023-12-02T03:38:19Z",
      "title": "Las Vegas police search for suspect after 5 homeless people are shot, killing 1",
      "url": "https://apnews.com/520e3012f29e24915b55cd61f8951271",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "MANILA, Philippines (AP) — A powerful earthquake with a preliminary magnitude of 7.6 struck Saturday off the southern Philippine coast, prompting many villagers to flee their homes in panic around midnight after Philippine authorities issued a tsunami warning.",
      "publishedAt": "2023-12-02T15:16:16Z",
      "title": "7.6 magnitude earthquake strikes off the southern Philippines and tsunami warnings are issued",
      "url": "https://apnews.com/245460306105515a2d104f082b4d506e",
      "urlToImage": ""
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The House is making history this year in ways that Republicans could hardly have envisioned when the party took control.",
      "publishedAt": "2023-12-02T05:07:11Z",
      "title": "McCarthy was ditched and Santos expelled. The House is making history, but not as the GOP envisioned",
      "url": "https://apnews.com/809d2c0b4e261fe39c0f8c69cfd462e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00bab5305700417290c39f3589c93ebb/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}