{
  "articles": [
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, a daughter of immigrants who rose through the California political and law enforcement ranks to become the first female vice president in U.S.",
      "publishedAt": "2024-08-05T16:43:49Z",
      "title": "Kamala Harris is now Democratic presidential nominee, will face off against Donald Trump this fall",
      "url": "https://apnews.com/eb43b6b346cc644b2d195315cb2bfb20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ff0729a750846adbe3c911b8fc109a5/1920.jpeg"
    },
    {
      "author": "JEFF MARTIN and CHRISTOPHER O'MEARA",
      "description": "HORSESHOE BEACH, Fla. (AP) — Tropical Storm Debby moved menacingly into some of America’s most historic Southern cities and was expected to bring prolonged downpours and flooding throughout the day Tuesday after slamming into Florida and prompting the rescue of hundreds from flooded homes.",
      "publishedAt": "2024-08-06T04:08:29Z",
      "title": "Slow-moving Tropical Storm Debby bringing torrential rains, major flood threat to southeastern US",
      "url": "https://apnews.com/211c7968e905576455d10d3706d04193",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21bdc256787c49938996b8a4c2087f4c/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — A key organizer of Bangladesh's student protests said Nobel Peace Prize laureate Muhammad Yunus was their choice as head of an interim government a day after longtime Prime Minister Sheikh Hasina resigned.",
      "publishedAt": "2024-08-06T04:25:51Z",
      "title": "Protesters who toppled Hasina want Nobel laureate Muhammad Yunus to lead Bangladesh",
      "url": "https://apnews.com/bca66e8251f86deb3fe28c913d0a1444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/108a08517354402e8f510b4237466b1d/1920.jpeg"
    },
    {
      "author": "STAN CHOE and ELAINE KURTENBACH",
      "description": "NEW YORK (AP) — Japan’s benchmark Nikkei 225 index soared nearly 11% early Tuesday, a day after it set markets tumbling in Europe and on Wall Street. Other markets in Asia also rebounded, but more moderately, appearing to settle somewhat after the rollercoaster ride that started the week.",
      "publishedAt": "2024-08-06T02:13:40Z",
      "title": "Japan's share benchmark soars nearly 11% a day after massive sell-offs that shook Wall Street",
      "url": "https://apnews.com/79deff7e82224b37c77ee8867c10a953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a53679c36b24988ac9d9215bdf29d86/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — As Iran threatens to respond to the suspected Israeli assassination of Hamas leader Ismail Haniyeh in Tehran, the regional militias that the Islamic Republic has armed for decades could play a role in any attack.",
      "publishedAt": "2024-08-05T11:27:47Z",
      "title": "Proxy forces armed by Iran could take part in retaliation against Israel over Hamas leader's killing",
      "url": "https://apnews.com/2bf649b0127edfdc65d08e6b68aa3695",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/071515e9cf0f49eab06492d8280ec70e/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — Venezuela’s top prosecutor on Monday announced a criminal investigation against the opposition’s presidential candidate Edmundo González and its leader Maria Corina Machado over their call on the armed forces to abandon their support for President Nicolás Maduro and to stop repressing demonstrators.",
      "publishedAt": "2024-08-05T20:03:54Z",
      "title": "Venezuela's top prosecutor announces criminal probe against opposition leaders González, Machado",
      "url": "https://apnews.com/763defac84e8234ff36e0dc6182efdf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa85a16f6ee74630ac9468b64b61e17e/1920.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT and MICHAEL LIEDTKE",
      "description": "WASHINGTON (AP) — A judge on Monday ruled that Google's ubiquitous search engine has been illegally exploiting its dominance to squash competition and stifle innovation, a seismic decision that could shake up the internet and hobble one of the world's best-known companies.",
      "publishedAt": "2024-08-05T19:33:47Z",
      "title": "Google illegally maintains monopoly over internet search, judge rules",
      "url": "https://apnews.com/319a61f20fb11510097845a30abaefd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a58a66b4e39465ea69bc401e20dc2c1/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Investigators will question Boeing officials during a hearing starting Tuesday about the midflight blowout of a panel from a 737 Max, an accident that further tarnished the company's safety reputation and left it facing new legal jeopardy.",
      "publishedAt": "2024-08-06T04:01:32Z",
      "title": "Witnesses will tell a federal safety board about the blowout on a Boeing 737 Max earlier this year",
      "url": "https://apnews.com/22059af5e451a0f1047c955e1dcc9a5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/749cbd195dfb4b02aeeb0b04f5bd57ec/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Hiroshima officials urged world leaders Tuesday to stop relying on nuclear weapons as deterrence and take immediate action toward abolishment — not as an ideal, but to remove the risk of atomic war amid conflicts in Ukraine and the Middle East and rising tensions in East Asia.",
      "publishedAt": "2024-08-06T03:22:18Z",
      "title": "Hiroshima governor says nuclear disarmament must be tackled as a pressing issue, not an ideal",
      "url": "https://apnews.com/020e40faa78322340f4235f96ae1fbdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03f0ebc028fc4ed9a8199d48648ad9af/3000.jpeg"
    },
    {
      "author": "VICTORIA MILKO",
      "description": "TEAHUPO’O, Tahiti (AP) — French Polynesian Kauli Vaast won the gold medal in men’s surfing while Caroline Marks from the United States won the women's surfing gold medal on Monday at the Paris Olympics in Tahiti.",
      "publishedAt": "2024-08-06T01:04:16Z",
      "title": "French Polynesian Kauli Vaast and Caroline Marks of U.S. win gold at Paris Olympics surfing",
      "url": "https://apnews.com/1b025616787b645a521afbcf2aed4d55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/386a29b146ba434a8da3ecf513e1825f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}