{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A veteran tabloid publisher testified Tuesday that he pledged to be Donald Trump 's “eyes and ears\" during his 2016 presidential campaign, recounting how he promised the then-candidate that he would help suppress harmful stories and even arranged to purchase the silence of a doorman.",
      "publishedAt": "2024-04-23T04:08:37Z",
      "title": "Tabloid publisher says he pledged to be Trump campaign's 'eyes and ears' during 2016 race",
      "url": "https://apnews.com/d44d4a7ce66cc08edb5981b3afb882ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b255fd80e0a4a86b088e231ea40a205/1920.jpeg"
    },
    {
      "author": "NICK PERRY and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — What began last week when Columbia University students refused to end their protest against Israel’s war with Hamas had turned into a much larger movement by Tuesday as students across the nation set up encampments, occupied buildings and ignored demands to leave.",
      "publishedAt": "2024-04-23T11:55:05Z",
      "title": "It began with defiance at Columbia. Now students nationwide are upping their Gaza war protests",
      "url": "https://apnews.com/2c1f043478570f9206a2ea8470457cf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75a11cb11ea84de59d5715f50ccaa06b/1920.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "DETROIT (AP) — The U.S. Justice Department announced a $138.7 million settlement Tuesday with more than 100 people who accused the FBI of grossly mishandling allegations of sexual assault against Larry Nassar in 2015 and 2016, a critical time gap that allowed the sports doctor to continue to prey on victims before his arrest.",
      "publishedAt": "2024-04-23T16:36:31Z",
      "title": "US government agrees to $138.7M settlement over FBI's botching of Larry Nassar assault allegations",
      "url": "https://apnews.com/3b760f3d317cbe18209aa02a611a298f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9218081fa3ba4ebd8835e00e8e2c578d/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Senate voted overwhelmingly Tuesday to move ahead with $95 billion in war aid to Ukraine, Israel and Taiwan, bringing the bill to the brink of passage after months of delays and contentious internal debate over how involved the United States should be abroad.",
      "publishedAt": "2024-04-23T04:51:02Z",
      "title": "Aid for Ukraine, Israel and Taiwan advances in Senate with big bipartisan vote",
      "url": "https://apnews.com/8fe738b17e5c4b2636bc0de11b2620b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4776b07dac2d4043984b556b5680f919/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said a Russian missile strike that smashed a prominent skyline television tower in Kharkiv was part of the Kremlin’s effort to intimidate Ukraine’s second-largest city, which in recent weeks has come under increasingly frequent attack.",
      "publishedAt": "2024-04-23T08:57:30Z",
      "title": "A Russian strike on Kharkiv's TV tower is part of an intimidation campaign, Ukraine's Zelenskyy says",
      "url": "https://apnews.com/317bfd1aef56342a82dfa0a776dadbcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51c0b45bcade45a8a7fa625579cc06c3/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — The Supreme Court will hear arguments Wednesday in a case that could determine whether doctors can provide abortions to pregnant women with medical emergencies in states that enact abortion bans.",
      "publishedAt": "2024-04-23T17:14:28Z",
      "title": "What's EMTALA, the patient protection law at the center of Supreme Court abortion arguments?",
      "url": "https://apnews.com/000a2482fdd1f1299599c91a6cc7635a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00438470ff604a3d92929d758a68d9ee/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Five people, including a child, died while trying to cross the English Channel from France to the U.K., French authorities said Tuesday, just hours after the British government approved a migrant bill to deport some of those who entered the country illegally to Rwanda.",
      "publishedAt": "2024-04-23T08:31:27Z",
      "title": "5 migrants die while crossing the English Channel hours after the UK approved a deportation bill",
      "url": "https://apnews.com/00d73287212405d70fdb513cd791fcbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89765bb79fdd49f69a22fc252a16e536/1920.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI and MIKE CATALINI",
      "description": "ST. PAUL, Minn. (AP) — A movement to ban book bans is gaining steam in Minnesota and several other states, in contrast to the trend playing out in more conservative states where book challenges have soared to their highest levels in decades.",
      "publishedAt": "2024-04-23T04:12:36Z",
      "title": "Minnesota and other Democratic-led states lead pushback on censorship. They're banning the book ban",
      "url": "https://apnews.com/d52fee70d8e3d4f158068de37ce8194b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a215379a00724644aee6d5158699cb52/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and DAVID HAMILTON",
      "description": "Tesla’s first-quarter net income plummeted 55%, but its stock price surged in after-hours trading Tuesday as the company said it would accelerate production of new, more affordable vehicles.The Austin, Texas, company said it made $1.13 billion from January through March compared with $2.51 billion in the same period a year ago.",
      "publishedAt": "2024-04-23T10:01:08Z",
      "title": "Tesla 1Q profit falls 55%, but stock jumps as company moves to speed production of cheaper vehicles",
      "url": "https://apnews.com/b60696cb69d7735983abcf51aee7f743",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a52b7b00744841958eb7ed2861906644/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Thousands of United Methodists are gathering in Charlotte, North Carolina, for their big denominational meeting, known as General Conference. It’s a much-anticipated gathering.",
      "publishedAt": "2024-04-23T14:21:00Z",
      "title": "United Methodists open first top-level conference since breakup over LGBTQ inclusion",
      "url": "https://apnews.com/8b428597c86901b2d5886afeca5069c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bac3412d614741e3afedf1336060aa32/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}