{
  "articles": [
    {
      "author": "AAMER MADHANI and JILL COLVIN",
      "description": "ATLANTA (AP) — Kamala Harris on Saturday criticized House Speaker Mike Johnson for suggesting that Republicans might cut government subsidies for semiconductor manufacturing as she and Republican Donald Trump embarked on one last weekend quest to round up every possible vote in the battleground states that will determine the next president.",
      "publishedAt": "2024-11-02T14:31:19Z",
      "title": "Harris slams GOP on manufacturing as she and Trump hunt for votes on the campaign's final weekend",
      "url": "https://apnews.com/437e0faf54c19bee5944650166383bfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b221a0e5124e4d10a548c50c029f21c0/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The final doors are being knocked, ads are blaring and candidates are making a last pitch to voters. Even with the high-energy final push, the races for control of Congress are at a stalemate, essentially a toss-up for the House and fight to the finish for the Senate.",
      "publishedAt": "2024-11-02T13:07:26Z",
      "title": "It's a fight to the finish in races that will determine control of Congress",
      "url": "https://apnews.com/219b09af4634e1a47f70082995085203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77dc8633eee14f7e93999e7901507006/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "ERIE, Pa. (AP) — It wasn’t much when he bought it, but Michael Hooks has made the old garage his own haven. And the city of Erie knows it. Half a dozen cars honk as they pass by one October afternoon, the people hanging out of car windows to wave hello at him.",
      "publishedAt": "2024-11-02T15:27:16Z",
      "title": "Listen to business owners and voters in Erie, Pennsylvania. They could help decide the White House.",
      "url": "https://apnews.com/5056e4316b17641ab2fb5e8942009085",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bcc4992ca974f31b26f1c4448682f4c/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader on Saturday threatened Israel and the U.S. with “a crushing response” over attacks on Iran and its allies.Ayatollah Ali Khamenei spoke as Iranian officials are increasingly threatening to launch yet another strike against Israel after its Oct.",
      "publishedAt": "2024-11-02T08:48:28Z",
      "title": "Iran's supreme leader threatens Israel and US with 'a crushing response' over Israeli attack",
      "url": "https://apnews.com/30385c3a17d1fca9415eb37db86dc9c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/495329dae95c4b25b7003509fe0b3d3e/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK and SAMY MAGDY",
      "description": "JERUSALEM (AP) — An attack on a central Israeli town early Saturday injured 11 people as Iran's supreme leader vowed a punishing response to Israel's attack last week and Israeli airstrikes continued in Gaza.",
      "publishedAt": "2024-11-02T10:55:38Z",
      "title": "Attack on central Israel injures 11 as Iran's leader promises a punishing response",
      "url": "https://apnews.com/f7a3c3f1d6b6ea2c54615a367ffb6ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2046a43cfcd24c689ee5c525aa04aa22/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump has spent months laying the groundwork to challenge the results of the 2024 election if he loses — just as he did four years ago.",
      "publishedAt": "2024-11-02T04:03:08Z",
      "title": "Trump is using election lies to lay the groundwork for challenging 2024 results if he loses",
      "url": "https://apnews.com/52832138394282b8a3355b45c0b913a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01897aa06cf0434ea695e942cece638b/3000.jpeg"
    },
    {
      "author": "GARY ROBERTSON and JILL COLVIN",
      "description": "GASTONIA, N.C. (AP) — Donald Trump will rally supporters in North Carolina every day until Tuesday's election, a flurry of late activity in the only swing state that he won in both his 2016 and 2020 campaigns.",
      "publishedAt": "2024-11-02T13:56:36Z",
      "title": "Trump will spend every day until the election in North Carolina, a swing state he won twice",
      "url": "https://apnews.com/aacda8a46f20d1dc654ca9ef4c2c3de8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37b55ed854834afdab4dafbf47c2801d/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine's President Volodymyr Zelenskyy urged its allies to stop “watching” and take steps before North Korean troops deployed in Russia reach the battlefield, and the country's army chief warned that his troops are facing “one of the most powerful offensives” by Moscow since the all-out war started more than two years ago.",
      "publishedAt": "2024-11-02T11:40:44Z",
      "title": "Ukraine's Zelenskyy urges allies to act before North Korean troops reach the front",
      "url": "https://apnews.com/912e5e54ad3170bd77580405c6f97018",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc03e63b9e8942e8a4130ab94aa98da7/3000.jpeg"
    },
    {
      "author": "STEPHEN WADE",
      "description": "Irv Rubenstein holds a doctorate in exercise science and has run a personal fitness training studio for 35 years in Nashville, Tennessee. Obviously, he speaks positively about the benefits of using a personal trainer, and this goes for grizzled-gym goers as well as beginners.",
      "publishedAt": "2024-11-02T13:35:00Z",
      "title": "How to choose the best personal trainer for your fitness goals — and budget",
      "url": "https://apnews.com/c94f4f6625d2d6a5a77537946d1518b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e02494da5ee04e49bea36e5877aed408/3000.jpeg"
    },
    {
      "author": "JULIE WALKER",
      "description": "NEW YORK (AP) — A man who took in an orphaned squirrel and made it a social media star vowed Saturday that New York state's decision to seize and euthanize the animal “won't go unheard.”",
      "publishedAt": "2024-11-02T16:18:15Z",
      "title": "Man says it's 'surreal' that officials euthanized pet squirrel Peanut",
      "url": "https://apnews.com/45a4cba19e1c49cb0cd58fef0f140f0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1381212a7805424fb062e916c48bfa15/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}