{
  "articles": [
    {
      "author": "Aamer Madhani, Zeke Miller",
      "description": "President Donald Trump is opening his four-day Mideast trip by paying a visit to Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman. The two leaders on Tuesday are expected to hold talks on U.S. efforts to dismantle Iran’s nuclear program, end the war in Gaza, hold down oil prices and more. The crown prince is also expected to fete Trump with a formal dinner and a gathering of members of the Gulf Cooperation Council. It is made up of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates.",
      "publishedAt": "2025-05-13T04:04:02Z",
      "title": "Trump will open his Mideast trip by visiting the Saudi crown prince",
      "url": "https://apnews.com/article/trump-mideast-saudi-arabia-mbs-qatar-uae-b782fe922d09afced2e1074b65016e80",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bdccb3/2147483647/strip/true/crop/1854x1043+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F3c%2F2066f6d60518b41f2254b6cda58d%2F087de7573919499cab0660a97efdee78"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Tia Goldenberg",
      "description": "The Hamas militant group says it will release an American-Israeli hostage held in Gaza during the day. In a statement, Hamas did not immediately disclose further details about the release expected on Monday. Hamas had announced on Sunday that it would free Edan Alexander as a good will gesture for the Trump administration. Alexander, an Israeli soldier, was taken captive on Oct. 7, 2023. Israeli authorities earlier acknowledged Alexander's planned release, without saying when it would happen. It would be the first hostage release since Israel shattered an 8-week ceasefire with Hamas.",
      "publishedAt": "2025-05-12T07:36:30Z",
      "title": "Hamas says it will release American-Israeli hostage Edan Alexander on Monday",
      "url": "https://apnews.com/article/mideast-wars-gaza-hostages-05-12-2025-72ca1188e3df7677870fb518191c14df",
      "urlToImage": "https://dims.apnews.com/dims4/default/464f1a1/2147483647/strip/true/crop/6510x3662+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F58%2Ffd77369edf973ca68eb5ad1efba8%2F41e2edda21d14e8abb1f75df74171a78"
    },
    {
      "author": "Simina Mistreanu",
      "description": "A day after China and the U.S. agreed to a 90-day truce in their tariffs stalemate, China is moving to strengthen its alliances as a counterweight to President Donald Trump's trade war. President Xi Jinping warned against bullying and said he was ready to join hands with Latin American countries to block protectionism. He was addressing a regional forum where he was joined by the presidents of Brazil, Chile and Colombia and other Latin American and Caribbean officials. Meanwhile, the head of the WTO appealed to Japan to champion global free trade. The realities of Trump's global trade offensive overshadowed an initial burst of optimism over the China-U.S. deal among investors, as rallies in stocks and oil prices faded.",
      "publishedAt": "2025-05-13T05:43:34Z",
      "title": "China seeks a united front with Latin America in countering Trump's trade war",
      "url": "https://apnews.com/article/china-latin-trade-tariffs-us-jinping-de2a3faa01ce6e98617cbecd74658c34",
      "urlToImage": "https://dims.apnews.com/dims4/default/e99a0db/2147483647/strip/true/crop/3501x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fc7%2Fd0d24874f2707fb05cceab5875e8%2F8b5009e90fc1436a929d1cb1c25c1793"
    },
    {
      "author": "Aijaz Hussain, Sheikh Saaliq",
      "description": "A series of military strikes last week by India and Pakistan brought the nuclear-armed rivals closer to a broader war. The possibility of a nuclear conflagration seemed real and the fighting only stopped when global powers intervened. Experts say the crisis deepened the neighbors’ rivalry as both crossed a threshold with each striking the other with high-speed missiles and drones. The tit-for-tat strikes also brought Kashmir again into global focus, as the U.S. President Donald Trump offered mediation over the simmering dispute that has long been described as the regional nuclear flashpoint.",
      "publishedAt": "2025-05-12T09:10:35Z",
      "title": "Trump’s mediation offer renews focus on Kashmir after India-Pakistan clash risked broader war",
      "url": "https://apnews.com/article/kashmir-india-pakistan-trump-38027d8167f32805121a5f8faca0fda2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a32348/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2Fe7%2Fa7bc18c57fef75a845406df477bd%2F4ef58a35991a43d6aa61576f1c7115ba"
    },
    {
      "author": "Josh Boak, Didi Tang",
      "description": "President Donald Trump’s agreement with China to temporarily slash tariffs for 90 days offered the world a bit of welcome relief. But what persists is a sense of uncertainty and the possibility that the damage from the trade war could already be done. Trump declared the de-escalation of the trade war a victory, saying he would soon chat with Chinese President Xi Jinping about how to preserve the financial relationship between the world’s two largest economies. Regardless, the tariffs are now elevated from when Trump took office and the scramble to respond to the White House’s mix of threats and olive branches might leave CEOs, investors and consumers unwilling to take risks.",
      "publishedAt": "2025-05-12T20:44:01Z",
      "title": "What's next with Trump's trade war truce with China",
      "url": "https://apnews.com/article/trump-tariffs-whats-next-2d597284774fddd6ad9fa4f60e783d34",
      "urlToImage": "https://dims.apnews.com/dims4/default/dadf122/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F5f%2F535b50bcd6f8b514672378c4abd6%2Faacafabb79a04180853f354498a3b19f"
    },
    {
      "author": null,
      "description": "A federal judge is refusing to block the Internal Revenue Service from sharing immigrants’ tax data with Immigration and Customs Enforcement for the purpose of identifying and deporting people illegally in the U.S. In a win for the Trump administration, U.S. District Judge Dabney Friedrich denied a preliminary injunction Monday in a lawsuit filed by nonprofit groups. They argued that undocumented immigrants who pay taxes are entitled to the same privacy protections as U.S. citizens and immigrants who are legally in the country. The decision comes after former acting IRS commissioner Melanie Krause resigned over the deal allowing ICE to submit names and addresses of immigrants inside the U.S. illegally to the IRS for cross-verification against tax records.",
      "publishedAt": "2025-05-12T21:45:25Z",
      "title": "Judge refuses to block IRS from sharing tax data to identify and deport people illegally in U.S.",
      "url": "https://apnews.com/article/irs-ice-tax-data-deportations-federal-judge-fd696d215843bdc16260dfad471f500d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8a3762/2147483647/strip/true/crop/4679x2632+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F93%2Ff677259d5f6a356bd0aa0a30d51b%2Fe8968b61207a4b1ba2779e6502852355"
    },
    {
      "author": "Chris Megerian, Zeke Miller, Bernard Condon",
      "description": "For President Donald Trump, accepting a free Air Force One replacement from Qatar is a no-brainer. But Trump’s plan threatens to turn a global symbol of American power into an airborne collection of ethical, legal, security and counterintelligence concerns. He tried to tamp down some of the opposition by saying he would donate the plane to a future presidential library after his term ends. Democrats are united in outrage over the plan, and even some of the Republican president’s allies have expressed concerns. Trump will likely face persistent questions about the plane in the coming days as he travels to the Middle East.",
      "publishedAt": "2025-05-12T21:06:54Z",
      "title": "Trump's plan to accept free jet from Qatar raises questions",
      "url": "https://apnews.com/article/donald-trump-qatar-air-force-one-2ef13d87b71185bde547abe6840b098c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dadf122/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F5f%2F535b50bcd6f8b514672378c4abd6%2Faacafabb79a04180853f354498a3b19f"
    },
    {
      "author": "Sylvie Corbet",
      "description": "A Paris court is set to deliver its verdict on accusations that French actor Gérard Depardieu sexually assaulted two women who were working on a film with him. The actor is accused of having groped a set dresser and an assistant on a film set in 2021. The case is widely seen as a post-MeToo test of how French society and its film industry address allegations of sexual misconduct involving prominent figures. During the trial in March, Depardieu rejected the accusations. He acknowledged that he used vulgar and sexualized language and that he grabbed the set dresser's hips during an argument, but denied that his behavior was sexual.",
      "publishedAt": "2025-05-13T04:03:07Z",
      "title": "A Paris court is to rule in French actor Gérard Depardieu's sexual assault case",
      "url": "https://apnews.com/article/depardieu-verdict-sexual-assault-french-actor-c1c5feb8237a79785bfeeb80c62428c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/409c281/2147483647/strip/true/crop/2888x1625+0+151/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F5b%2F568ed1e99334a329a2a34d70fd96%2F4db38059096445f6a77b4a776b46e6b4"
    },
    {
      "author": "Thomas Adamson, John Leicester, Nicolas Vaux-montagny",
      "description": "Kim Kardashian has arrived at a Paris courthouse to testify against the men accused of robbing her at gunpoint in 2016, an event that reshaped her life and redefined celebrity security in the age of social media. This will be the first time she has faced the alleged assailants since that night, when she begged for her life as masked men bound her with zip ties and stole over $6 million in jewelry. Kardashian’s appearance is expected to be the emotional centerpiece of a trial that has captivated France.",
      "publishedAt": "2025-05-13T05:15:50Z",
      "title": "Kim Kardashian arrives to testify at Paris robbery trial",
      "url": "https://apnews.com/article/kim-kardashian-trial-paris-fashion-week-b06a96edfa5271de2d92870dcafe2796",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9fd950/2147483647/strip/true/crop/3738x2103+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F29%2Fb0ec2a96a6727175c4ecfbe3febe%2F8a48e0dc91774e9fa60f50712d9b6acb"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The R&B singer Cassie is poised to testify in Sean “Diddy” Combs sex trafficking trial. Testimony resumes Tuesday in New York. Combs is accused of forcing women including Cassie into drugged-up sex parties he described as “freak-offs.” Prosecutors say he used his status as a powerful executive to coerce women into abusive sexual encounters. Lawyers for three-time Grammy winner told the jury that while Combs could be violent, he never veered into sex trafficking or racketeering. Cassie has been at the center of Combs’ stunning downfall. She sued him in 2023 alleging years of abuse. A surveillance video made public last year showed Combs beating her at a Los Angeles hotel in 2016.",
      "publishedAt": "2025-05-13T04:02:07Z",
      "title": "R&B singer Cassie set to testify in Sean 'Diddy' Combs sex trafficking trial",
      "url": "https://apnews.com/article/diddy-sex-trafficking-freak-offs-cassie-f61773689c057e0264d5a755b40b825a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b23893a/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F21%2F0648a7fb5a77565263e0bf56bdf4%2F42829eefa2b842cf8e34d7f8cf1de00c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}