{
  "articles": [
    {
      "author": null,
      "description": "The jury in Sean “Diddy” Combs’ sex trafficking trial is set to resume deliberations. The jury reached a verdict Tuesday on all but one of the five counts the hip-hop mogul faces. Judge Arun Subramanian ordered the jury to continue deliberating for a third day on Wednesday. The jury said Tuesday it was unable to reach consensus on the top charge of racketeering conspiracy. It indicated it had already decided about other charges, including sex trafficking. Subramanian, prosecutors and Combs’ defense team said less than 13 hours of deliberations was too soon to give up on reaching a verdict on all counts. The jury's partial verdict remains under wraps for now.",
      "publishedAt": "2025-07-02T05:05:27Z",
      "title": "Jury in Diddy's sex trafficking trial to resume deliberations after reaching partial verdict",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-a9358ff8917e96874f027872e07cd9a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d03410e/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F80%2F09a6b0c1f96f0fd7919de74d9b2f%2Feac8d5a12d124ca885a751f871fa203c"
    },
    {
      "author": null,
      "description": "More than two years after the stabbing deaths of four University of Idaho students shocked the rural community of Moscow, Idaho, the former criminal justice doctoral student charged in the murders is expected in court Wednesday to plead guilty in a deal to avoid the death penalty. Brian Kohberger agreed to the plea deal in the past few days, just weeks before his trial was to begin, after his attorneys tried but failed to have execution stricken as a possible punishment. The deal drew mixed reactions from the victims' families, ranging from support to outrage that Kohberger would live.",
      "publishedAt": "2025-07-02T04:05:59Z",
      "title": "Bryan Kohberger is due to appear in court to plead guilty in University of Idaho stabbings",
      "url": "https://apnews.com/article/kohberger-idaho-students-slain-6626d7c53a08563cfa9df5123f41bd87",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7feec4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F24%2Fbc0f88655b584fce0e2b246f8080%2F242b342dd39d4aca86f39763dca3c3cd"
    },
    {
      "author": null,
      "description": "House Republicans are sprinting toward a vote on President Donald Trump’s tax and spending cuts package. The Republicans are looking to seize momentum from a hard-fought vote in the Senate, essentially daring members with concerns to defy Trump and vote against it. The bill will extend and make permanent various individual and business tax breaks Republicans passed in Trump’s first term, plus temporarily add new tax breaks, such as no income taxes on tips and overtime. The House already passed one version of the bill in May with just one vote to spare. It's unclear if House Republicans will be able to do the same with the Senate-amended version Wednesday.",
      "publishedAt": "2025-07-02T04:02:41Z",
      "title": "House Republicans are racing toward a final vote on Trump's tax bill",
      "url": "https://apnews.com/article/big-beautiful-bill-trump-tax-cuts-3b525482be43fdf956366cebd84dcaac",
      "urlToImage": "https://dims.apnews.com/dims4/default/95cafe8/2147483647/strip/true/crop/4970x2796+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F9f%2Ff66227677ca9ea1cd4c75f05c760%2F5651e88edafe4454b7baa1204d0d9034"
    },
    {
      "author": null,
      "description": "American contractors guarding aid distribution sites in Gaza are using live ammunition and stun grenades as hungry Palestinians scramble for food, according to accounts and videos obtained by The Associated Press. Two U.S. contractors, speaking to the AP on condition of anonymity because they were revealing their employers’ internal operations, said they were coming forward because they were disturbed by what they considered dangerous and irresponsible practices. The contractor who provided the videos said the bullets were fired in all directions — in the air, into the ground and at times towards the Palestinians. The testimonies offer a rare glimpse inside an often-chaotic scene at these sites.",
      "publishedAt": "2025-07-02T19:48:54Z",
      "title": "Two US contractors describe chaos and gunfire as Palestinians seek food in Gaza",
      "url": "https://apnews.com/article/palestinians-israel-gaza-contractors-aid-distribution-fe27f3ea83e06a09d66424eed7a5d56f",
      "urlToImage": "https://dims.apnews.com/dims4/default/515095a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F21%2Fb93af4f74b8f7fdf09773c18aa1d%2F5ba486a526ca4bb494091ae32fe7aec4"
    },
    {
      "author": null,
      "description": "A federal judge has ruled that an executive order by President Donald Trump suspending asylum access at the southern border is unlawful. Wednesday's decision could throw into doubt one of the key pillars of the president’s plans to crack down on immigration at the southern border. But the judge gave the Trump administration two weeks to appeal. In an executive order Jan. 20, Trump declared that the situation at the southern border was an invasion, and he was “suspending the physical entry” of migrants and their ability to seek asylum until he decides it is over.",
      "publishedAt": "2025-07-02T19:23:56Z",
      "title": "Judge blocks order barring asylum access at border",
      "url": "https://apnews.com/article/immigration-asylum-lawsuit-trump-border-aclu-af374b821fb3872078beb5a495e01d8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Authorities say seven people are missing following an explosion at a fireworks warehouse in rural Northern California that caused a massive fire. The California Department of Forestry and Fire Protection says Wednesday that emergency crews and investigators are working with the property’s owner and monitoring the area using drones to find the individuals. It's not immediately clear if those missing worked at the warehouse or lived nearby. People were urged to avoid the area for several days following the Tuesday night blast, which set off a barrage of fireworks and caused a huge blaze that led to other spot fires and collapsed the building in the farming community northwest of Sacramento.",
      "publishedAt": "2025-07-02T10:47:20Z",
      "title": "California fireworks warehouse explosion forces evacuations",
      "url": "https://apnews.com/article/fireworks-warehouse-explosion-california-1047354701b97a34ef084542f32d0d8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a182d55/2147483647/strip/true/crop/4866x2737+98+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F6f%2F22ee152003a203b85404430d8523%2F7e7b2a52ee954c9cab5e9e30ec4289fb"
    },
    {
      "author": null,
      "description": "The Wisconsin Supreme Court has struck down the state’s 176-year-old abortion ban. The court’s liberal majority ruled 4-3 on Wednesday that the ban is no longer valid because newer abortion restrictions superseded it. State lawmakers adopted the total ban in 1849. It was in effect until 1973, when the U.S. Supreme Court’s Roe v. Wade decision legalizing abortion nullified it, and was never repealed. Conservatives argued that the U.S. Supreme Court’s 2022 decision overturning Roe reactivated the prohibition. Democratic Attorney General Josh Kaul sued, arguing that a 1985 state law that prohibits abortions after viability essentially repealed the ban.",
      "publishedAt": "2025-07-02T13:18:26Z",
      "title": "Wisconsin Supreme Court strikes down state’s 1849 abortion ban",
      "url": "https://apnews.com/article/wisconsin-abortion-ban-1849-01658358639a63db7df92aeec34c612d",
      "urlToImage": "https://dims.apnews.com/dims4/default/19b820d/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F85%2F9785f0bf29b2be39082979f352bc%2Fcfd26ea007b443d4b8c5c5e46c794750"
    },
    {
      "author": null,
      "description": "Paramount says it has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October. The parent company of CBS told media outlets that the money will go to Trump's future presidential library, not to the president himself. It said the settlement did not involve an apology. Trump's lawyer said the president had suffered “mental anguish” over the editing of the interview by CBS News. Paramount and CBS have rejected Trump's contention that the interview was edited to enhance how Harris sounded. A press advocacy group has threatened to sue if Paramount settled the case.",
      "publishedAt": "2025-07-02T07:38:53Z",
      "title": "Paramount settles with Trump for $16 million over ‘60 Minutes’ interview",
      "url": "https://apnews.com/article/trump-media-harris-minutes-paramount-6415042fe910ae60b432dd8c73ef61b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c55c90/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fd5%2Fc4c7e26373e8c4ac9e14e3f34fa8%2F8aaa4bcab7394249af6df681ad86857d"
    },
    {
      "author": null,
      "description": "Sales of Tesla electric cars fell sharply in the last three months compared to a year earlier as boycotts over Elon Musk’s political views continue to keep buyers away. Tesla is also facing stiff competition from other electric vehicle makers, especially in Europe where China’s BYD has taken a bite out of its market share. The 13% plunge in sales reported Wednesday adds to growing signs that Musk’s embrace of U.S. President Donald Trump and far-right politicians in Europe has had a deep and enduring impact to Tesla’s brand appeal. Sales fell to 384,122 in April through June, down from 443,956 in the same period last year.",
      "publishedAt": "2025-07-02T13:30:13Z",
      "title": "Tesla sales fell sharply in the last three months as anti-Musk sentiment still has an effect",
      "url": "https://apnews.com/article/trump-musk-tesla-sales-model-y-boycott-doge-deliveries-976a467eca5a179db58cbe4318f54a52",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f32261/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F22%2Fcd6e9e84a8f10f688dd24151bf0e%2F44261c70d11241448ba7818e7868b06c"
    },
    {
      "author": null,
      "description": "A person with knowledge of the details says the New York Knicks have offered their coaching job to Mike Brown and are working to finalize a deal with the two-time NBA Coach of the Year. Brown would replace Tom Thibodeau, who was fired last month despite leading the Knicks to the Eastern Conference finals for the first time in 25 years. He had his second interview with the Knicks on Tuesday before the job was offered, the person told The Associated Press. The person spoke on condition of anonymity Wednesday because details of the search were to remain private.",
      "publishedAt": "2025-07-02T18:01:50Z",
      "title": "Knicks working on deal to make Mike Brown coach, AP source says",
      "url": "https://apnews.com/article/knicks-coach-mike-brown-a65076c173949b538b3a6a2a055559cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c842b7/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F72%2F5c8782d285a2f8c2e0a5d917f50c%2F121e0961b24442159a85f499e250c039"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}