{
  "articles": [
    {
      "author": "JOSH BOAK, CHRISTOPHER RUGABER",
      "description": "Donald Trump promised as a candidate that he could easily conquer inflation, but the reality is proving tougher than he expected. Wednesday’s consumer price index report showed that Trump could end up facing the same challenges that dragged down his predecessor, President Joe Biden. The annual inflation rate has risen over the three months since the November election to 3%. Gasoline prices in particular have climbed despite Trump’s claims that his return to the presidency would signal increased oil production that would lower energy costs. It’s a humbling reminder that even U.S. presidents are subject to the invisible hand of supply and demand, rather than the masters of it.",
      "publishedAt": "2025-02-13T05:08:58Z",
      "title": "The latest inflation report shows that high prices are Trump's major economic challenge",
      "url": "https://apnews.com/article/trump-inflation-tariffs-prices-consumer-50c4738216756499c8cdc17ab77d6d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/901bb20/2147483647/strip/true/crop/3968x2232+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F4b%2Fbeb8ed2c8817ff56fc49837f625f%2Fa328f2dcfcf24d578cf07aeafa7f17e1"
    },
    {
      "author": "JOSH FUNK",
      "description": "Egg prices have reached a record high in the U.S. The consumer price index released on Wednesday confirmed what consumers, bakers and food companies already knew: an ongoing bird flu outbreak that began in 2022 are making eggs terribly expensive right now. The average price of a dozen Grade A eggs in U.S. cities reached $4.95 in January, eclipsing the previous record of $4.82 set in January 2023. Of course, that is only the nationwide average. A carton of eggs can cost $10 or more in some places. And specialized varieties, such as organic and cage-free eggs, are even more expensive.",
      "publishedAt": "2025-02-12T18:55:37Z",
      "title": "US egg prices hit a record high and are likely to keep climbing",
      "url": "https://apnews.com/article/egg-prices-record-bird-flu-a2394bdefc7bd0514d4f003cc5e8a908",
      "urlToImage": "https://dims.apnews.com/dims4/default/09650a8/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F8d%2F7aabff51851bc166ec3ff47e749a%2F0e8c363f28684007aae68e4fc606fc29"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Elon Musk has called for the United States to “delete entire agencies” from the federal government. Musk has consolidated control over large swaths of the government with President Donald Trump’s blessing since assuming leadership of the Department of Government Efficiency. That’s included sidelining career officials, gaining access to sensitive databases and inviting a constitutional clash over the limits of presidential authority. Musk made the comments on Thursday to the World Governments Summit in Dubai. Musk, the world’s wealthiest person through his investments in SpaceX and electric carmaker Tesla, also joked that he was the “White House’s tech support,” borrowing from his profile on the social platform X, which he owns.",
      "publishedAt": "2025-02-13T05:25:17Z",
      "title": "Elon Musk calls for US to 'delete entire agencies'",
      "url": "https://apnews.com/article/elon-musk-doge-us-uae-6f7c0e5b43adfb4ec3c1f14a964f573c",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc4c334/2147483647/strip/true/crop/5716x3215+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F7c%2Fc74b16d9797ab2de49c83372a787%2Fa4c8677ab9994303bd8b315883e0f752"
    },
    {
      "author": "MATT OTT",
      "description": "U.S. applications for unemployment benefits fell last week as employers continue to retain workers despite resurgent inflation and elevated interest rates. The number of Americans filing for jobless benefits fell by 7,000 to 213,000 for the week ending February 8, the Labor Department said Thursday. Analysts projected that 215,000 new applications would be filed. Weekly applications for jobless benefits are considered representative of layoffs. The total number of Americans receiving unemployment benefits for the week of February 1 fell to 1.85 million, a decrease of 36,000 from the previous week.",
      "publishedAt": "2025-02-13T13:39:40Z",
      "title": "The number of Americans seeking jobless benefits falls as employers continue to hold on to workers",
      "url": "https://apnews.com/article/unemployment-benefits-jobless-claims-labor-layoffs-a78665a24e51f2c3634fda4881bc1d5d",
      "urlToImage": "https://dims.apnews.com/dims4/default/91d3e0f/2147483647/strip/true/crop/7471x4202+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F4c%2Fe3a5a684c527a4ffd1d6775876e6%2F9994055977c54c60a605ac12699479d8"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "A generation has passed since the peak in AIDS-related deaths. Few people under 30 years old understand what AIDS does to the body. The U.S.-led global response to HIV has been so effective that AIDS wards of people wasting away are a vision of the past. Now health experts, patients and others fear those days could return if the Trump administration doesn’t reverse its abrupt freeze on foreign aid or no other global power steps into the void, and fast. The U.N. AIDS agency says there could be over 6 million AIDS deaths in the next five years.",
      "publishedAt": "2025-02-13T05:38:20Z",
      "title": "This is what happens to the body when HIV drugs are stopped for millions of people",
      "url": "https://apnews.com/article/trump-aid-freeze-usaid-hiv-pepfar-9c1e6a70c5250a56feddf48757f923c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/41578a7/2147483647/strip/true/crop/1992x1121+0+29/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F46%2Fccc9fefa849dd84a36aed30b4c59%2F259f749c676b45f08c6b4cce20d823ec"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "After President Donald Trump effectively slammed the door on asylum-seekers crossing the U.S. southern border when he took office in January, many are recalibrating their plans. Instead of entering the U.S. illegally, they are ditching, or at least pausing, their ambitions of reaching the U.S. and instead looking to build a life in Mexico. Migrants trying to apply for asylum in Mexico in January more than tripled compared to the monthly average from the previous year, according to an international official with knowledge of the numbers who was not authorized to discuss them publicly.",
      "publishedAt": "2025-02-13T05:13:44Z",
      "title": "With doors closed to the US, asylum-seekers turn to their Plan B: A new life in Mexico",
      "url": "https://apnews.com/article/mexico-asylum-seekers-us-trump-executive-orders-7cc3a88a474d85d1d16ede87f56eb6c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e844886/2147483647/strip/true/crop/4535x2551+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F4f%2Fb17de2d2beea1eeb27ec54fca830%2F66534ed34cae42bb91b928a4de2ca5bf"
    },
    {
      "author": null,
      "description": "German police say a driver drove a vehicle into a group of people in Munich on Thursday, injuring several. Authorities didn’t immediately give a specific number of injuries or provide details about the incident near downtown Munich, including whether the people were hit deliberately. Police said on social platform X that the driver was “secured” at the scene and no longer poses any danger. A demonstration by the service workers’ union was taking place at the time of the incident. It was not immediately clear whether demonstrators were among the injured.",
      "publishedAt": "2025-02-13T10:12:09Z",
      "title": "Several are injured after a driver hits a group of people in Munich",
      "url": "https://apnews.com/article/germany-munich-car-crowd-4fe219d06bba255ec9971555e724bb90",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fad112/2147483647/strip/true/crop/2244x1262+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F89%2F666f8ffc241b33210d04d08dc0a9%2Fa593986808614aaeaa75e347f72f3af5"
    },
    {
      "author": "SAMY MAGDY",
      "description": "Hamas says it will release the next group of Israeli hostages as planned, apparently resolving a major dispute that threatened the ceasefire in the Gaza Strip. The militant group said Egyptian and Qatari mediators have affirmed that they will work to “remove all hurdles.” Hamas said it would implement the ceasefire deal. Thursday's statement indicated three more Israeli hostages would be freed Saturday. There was no immediate comment from Israel after Hamas’ announcement.",
      "publishedAt": "2025-02-13T10:21:34Z",
      "title": "Hamas says it will release more Israeli hostages as planned, apparently resolving ceasefire dispute",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-02-13-2025-ceasefire-hostages-34526505868eb797266a0aa17f4208e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5536735/2147483647/strip/true/crop/5970x3358+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F4d%2F0ad2b5057ed1a33c38ce612c19d8%2F47bd1d591d8a4234a31d72fcb469cbdc"
    },
    {
      "author": "ASSOCIATED PRESS",
      "description": "Russian officials and state media have taken a triumphant tone after U.S. President Donald Trump jettisoned three years of U.S. policy and announced he would likely meet soon with Russian President Vladimir Putin to negotiate a peace deal in the almost three-year war in Ukraine. Trump’s change of tack seemed to identify Putin as the only player that matters in ending the fighting. It looked set to sideline Ukrainian President Zelenskyy, as well as European governments, in any peace negotiations. Ukrainian President Volodymyr Zelenskyy says he will not accept any agreements about Ukraine that do not include his country in talks.",
      "publishedAt": "2025-02-13T12:50:18Z",
      "title": "Russia rejoices at Trump-Putin call as Zelenskyy says he won't accept a deal without consultation",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-9bd931d9ffde1bb573fae514efb29ddd",
      "urlToImage": "https://dims.apnews.com/dims4/default/278323d/2147483647/strip/true/crop/2640x1485+0+138/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ffb%2F9949e096ff90cdf9d0c170204bba%2F3c5a49fa5b9d42ef91084a60e151884d"
    },
    {
      "author": "LORNE COOK",
      "description": "Several NATO allies are insisting that Ukraine and Europe must not be cut out of any peace negotiations, after U.S. President Donald Trump signaled that he would hold talks soon with Russian President Vladimir Putin. U.K. Defence Secretary John Healey said Thursday that “Ukraine’s voice must be at the heart of any talks.” The United States has rattled NATO by saying that Ukraine should never join and that European allies should take responsibility for Ukraine's security. Estonian Defense Minister Hanno Pevkur said that Europe has driven sanctions against Russia, invested heavily in Ukraine’s defense, and will have to foot the bill for reconstruction. Defense Secretary Pete Hegseth denied that the United States is betraying Ukraine.",
      "publishedAt": "2025-02-13T07:58:20Z",
      "title": "NATO allies insist Ukraine and Europe must be in peace talks as Trump touts Putin meeting",
      "url": "https://apnews.com/article/nato-us-ukraine-war-europe-negotiations-0e3688f571c33797d812b1b9cbc575e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b4c145/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F92%2F911d8873f6696695a8bb6c4017bb%2Fcd8b0d13f31e49cabc9df264427c5bc5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}