{
  "articles": [
    {
      "author": "JILL COLVIN and ROB GILLIES",
      "description": "NEW YORK (AP) — President-elect Donald Trump threatened on Monday to impose sweeping new tariffs on Mexico, Canada and China as soon as he takes office as part of his effort to crack down on illegal immigration and drugs.",
      "publishedAt": "2024-11-26T00:27:17Z",
      "title": "Trump threatens to impose sweeping new tariffs on Mexico, Canada and China on first day in office",
      "url": "https://apnews.com/59239afe12033ca99c65c7a2be0e4f0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ffe008754447c69e8f20222b5dd89f/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, ERIC TUCKER and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith moved to abandon two criminal cases against Donald Trump on Monday, acknowledging that Trump’s return to the White House will preclude attempts to federally prosecute him for retaining classified documents or trying to overturn his 2020 election defeat.",
      "publishedAt": "2024-11-25T18:28:29Z",
      "title": "Special counsel moves to abandon election interference and classified documents cases against Trump",
      "url": "https://apnews.com/d6172cf98d8e03e099571c908267456c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1bb078fa804c258b700ef27b539b49/1920.jpeg"
    },
    {
      "author": "SALLY ABOU ALJOUD, JOSEF FEDERMAN and SAM METZ",
      "description": "BEIRUT (AP) — Israel's military launched airstrikes across Lebanon on Monday, unleashing explosions throughout the country and killing at least 31 while Israeli leaders appeared to be closing in on a negotiated ceasefire with the Hezbollah militant group.",
      "publishedAt": "2024-11-25T18:55:32Z",
      "title": "Israel launches new airstrikes on Lebanon as leaders draw closer to a ceasefire with Hezbollah",
      "url": "https://apnews.com/2b8d33a720931ed0ac315b055dfce57b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0907a1f0f65a427eaac2bd36fea60445/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Diplomats and other officials say there have been several sticking points in ceasefire talks to end the war between Israel and the Lebanese militant group Hezbollah, even as conditions for an agreement appear to be ripe.",
      "publishedAt": "2024-11-25T10:55:15Z",
      "title": "What's blocking a ceasefire between Israel and Hezbollah?",
      "url": "https://apnews.com/ce56620463c579a33a4d8b03de035ae3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d32aba491f3457fb60d5364a181a4aa/1920.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Supporters seeking the release of imprisoned Pakistani former premier Imran Khan on Tuesday broke through a ring of shipping containers locking down the capital Islamabad, battled police, and ignored a government threat to respond with gunfire.",
      "publishedAt": "2024-11-26T04:40:50Z",
      "title": "Imran Khan supporters breach lockdown in Pakistani capital as government threatens to open fire",
      "url": "https://apnews.com/46ea4720c1f4a28326f73f449f21355e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/153e2cb4e55044ccb8d695c4b46bb1ca/2295.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Walmart, the world’s largest retailer, is rolling back its diversity, equity and inclusion policies, joining a growing list of major corporations that have done the same after coming under attack by conservative activists.",
      "publishedAt": "2024-11-26T02:02:22Z",
      "title": "Walmart becomes latest - and biggest - company to roll back its DEI policies",
      "url": "https://apnews.com/34b06922e60e5116fe198696201ce4d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3bc7b7e20e34dccbd9cfae1b10d136b/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "A white Florida woman who fatally shot a Black neighbor through her front door during an ongoing dispute over the neighbor’s boisterous children was sentenced Monday to 25 years in prison for her manslaughter conviction.",
      "publishedAt": "2024-11-25T05:12:08Z",
      "title": "White Florida woman sentenced to 25 years in prison for shooting Black neighbor in lengthy dispute",
      "url": "https://apnews.com/eeebdfa89b98164b87179629ca36799c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d8caafaa7d5438caad544fda00edffd/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — Hong Kong’s top court on Tuesday upheld earlier rulings that favored subsidized housing benefits and equal inheritance rights for same-sex married couples, in a landmark victory for the city's LGBTQ+ community.",
      "publishedAt": "2024-11-26T02:18:00Z",
      "title": "Hong Kong's top court rules in favor of equal inheritance and housing benefits for same-sex couples",
      "url": "https://apnews.com/ad09f4280d718b6718aba98025293c33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/577eb00a0a9e484782e8fa75fd24777b/3000.jpeg"
    },
    {
      "author": "MEAD GRUVER and AMY BETH HANSON",
      "description": "A judge on Monday rejected a request to block a San Jose State women’s volleyball team member from playing in a conference tournament on grounds that she is transgender.",
      "publishedAt": "2024-11-25T20:06:02Z",
      "title": "Judge rejects request to sideline a San Jose State volleyball player on grounds she’s transgender",
      "url": "https://apnews.com/a45e6751924f73abd5ba5d786d43f5a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a1f8b3b199f401f9d1bbcf6844f834b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Airports and highways are expected to be jam-packed during Thanksgiving week, a holiday period likely to end with another record day for air travel in the United States.",
      "publishedAt": "2024-11-25T16:46:29Z",
      "title": "Thanksgiving Travel Latest: Airport strike, staff shortages and weather could impact holiday travel",
      "url": "https://apnews.com/9c42556a16a14af750b648ba6e8de4eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5af54c36d31c437585eebc98b1ec90af/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}