{
  "articles": [
    {
      "author": null,
      "description": "BOISE, Idaho (AP) — Chad Daybell sentenced to death for murder of wife and girlfriend’s 2 youngest children in Idaho doomsday plot.",
      "publishedAt": "2024-06-01T17:44:26Z",
      "title": "Chad Daybell sentenced to death for murder of wife and girlfriend’s 2 youngest children in Idaho doomsday plot",
      "url": "https://apnews.com/8987f1f45ec64562fbb1aa7bab83fe37",
      "urlToImage": ""
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Pride Month, the worldwide celebration of LGBTQ+ culture and rights, kicks off Saturday with events around the globe.But this year’s festivities in the U.S. will unfold against a backdrop of dozens of new state laws targeting LGBTQ+ rights, particularly transgender young people.",
      "publishedAt": "2024-06-01T04:18:01Z",
      "title": "LGBTQ+ Pride Month is starting to show its colors around the world. What to know",
      "url": "https://apnews.com/1abf80d0cf1026b60b47f565e9953fec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/582c53a8def54e95b38c4155f71a1a3a/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Embracing Donald Trump’s strategy of blaming the U.S. justice system after his historic guilty verdict, Republicans in Congress are fervently enlisting themselves in his campaign of vengeance and political retribution as the GOP runs to reclaim the White House.",
      "publishedAt": "2024-06-01T04:24:48Z",
      "title": "Republicans join Trump's attacks on justice system and campaign of vengeance after guilty verdict",
      "url": "https://apnews.com/a05db7fa2512a62afe035992f2baaf16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e369da136e6418e95c1c318280c8a27/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israel’s prime minister on Saturday called a permanent cease-fire in Gaza a “nonstarter” until long-standing conditions for the ending the war are met, appearing to undermine a proposal that U.S.",
      "publishedAt": "2024-06-01T10:04:25Z",
      "title": "Israel describes a permanent cease-fire in Gaza as a 'nonstarter,' undermining Biden's proposal",
      "url": "https://apnews.com/8c06dda3a8e20491b5a34377c60bb827",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33938d3d8c6546d89c0764cfcd306474/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Acknowledging only “an uptick” in Israeli military activity, the United States has gone to lengths to avoid any suggestion that Israeli forces have crossed a red line set by President Joe Biden in the deepening offensive in the southern Gaza city of Rafah.",
      "publishedAt": "2024-06-01T13:51:49Z",
      "title": "The Biden administration says Israel hasn't crossed a red line on Rafah. This could be why",
      "url": "https://apnews.com/2b13ba81805c4b7ad988f7959abc1a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bd59519543342f4a6f2e91e6779bb6a/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — The African National Congress party lost its parliamentary majority in a historic election result Saturday that puts South Africa on a new political path for the first time since the end of the apartheid system of white minority rule 30 years ago.",
      "publishedAt": "2024-06-01T07:28:39Z",
      "title": "The ANC party that freed South Africa from apartheid loses its 30-year majority in landmark election",
      "url": "https://apnews.com/d9da7582ca98a4e00fec2da6a5fe1e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41961b9202554a01aded4d05441a745e/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — Voter participation advocate Theresa Pasqual traverses Acoma Pueblo with a stack of sample ballots in her car and applications for absentee ballots, handing them out at every opportunity ahead of New Mexico's Tuesday primary.",
      "publishedAt": "2024-06-01T14:02:41Z",
      "title": "100 years ago, US citizenship for Native Americans came without voting rights in swing states",
      "url": "https://apnews.com/ed175f6bbdc1b3a078bd675be8ac0b04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6012b65b0c104d45b8c4076f4a047cd6/2972.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — President Joe Biden's son was in federal court, prepared to plead guilty to misdemeanor tax offenses. The culmination of a sprawling investigation, the deal between Hunter Biden and prosecutors was going to spare him a politically explosive trial in the middle of his father’s reelection campaign and likely prison time.",
      "publishedAt": "2024-06-01T14:55:01Z",
      "title": "From collapsed plea deal to trial: How Hunter Biden has come to face jurors on federal gun charges",
      "url": "https://apnews.com/cc96568ac3428802557c85876c820dec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b3a6be76d5142b1bce45d2b70d5ce69/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "North Korea launched more trash-carrying balloons toward the South after a similar campaign earlier in the week, according to South Korea’s military, in what Pyongyang calls retaliation for activists flying anti-North Korean leaflets across the border.",
      "publishedAt": "2024-06-01T12:38:16Z",
      "title": "North Korea is sending more trash-carrying balloons to South Korea",
      "url": "https://apnews.com/7a9b372462a8390f279e5288923a8da3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb72f88296254825b9d795aadd58903f/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "As weight-loss plans go, it’s easy to see the allure of intermittent fasting: Eat what you want, but only during certain windows of time — often just eight hours a day.Instead of counting calories or measuring portions, dieters just have to pay attention to the clock, said Courtney Peterson, a nutrition researcher at the University of Alabama at Birmingham.",
      "publishedAt": "2024-06-01T12:00:25Z",
      "title": "Is intermittent fasting better than counting calories? Maybe not, but you might stick with it",
      "url": "https://apnews.com/c8a7a8e0bafc5b6f6faa9f30bfcc0646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c08d9974a5e4a62b8fdd651b033a069/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}