{
  "articles": [
    {
      "author": "Chris Megerian, Amelia Thomson-DeVeaux",
      "description": "An AP-NORC poll finds that only about one-third of U.S. adults have a favorable opinion of Elon Musk after his brief foray into the federal government. And about two-thirds of U.S. adults think he has too much influence in Washington. Musk has spent years building his reputation as a business titan and tech visionary, but the billionaire entrepreneur is expected to leave his administration job in the coming weeks. Musk is noticeably less popular than is the effort to pare back the government workforce. Although about half of U.S. adults believe President Donald Trump has gone too far, 31% say he’s on target and 15% want him to go even further.",
      "publishedAt": "2025-04-27T11:26:54Z",
      "title": "Musk is unpopular and most think he has too much influence in Washington",
      "url": "https://apnews.com/article/musk-trump-doge-tesla-d1206a96983b30b9cef7b18eaa8c48a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/212e5f7/2147483647/strip/true/crop/4356x2450+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Ff7%2F749e50ba24d86d5823b976cbd42a%2Fd78b4a40bb764e2690ff84d02097d686"
    },
    {
      "author": null,
      "description": "Police in Canada say the driver of a car struck revelers at a street festival, killing and injuring an unknown number of people. The Vancouver Police Department says the vehicle drove into a crowd at a Filipino community festival at 8:14 p.m. Saturday. The exact number of dead or injured was not immediately available. Police say the driver was taken into custody. The Lapu Lapu Day festival was being held in a South Vancouver neighbourhood. Video posted on social media showed victims and debris strewn across a long stretch of road, with at least seven people lying immobile on the ground. A black SUV with a crumpled front section could be seen in still photos.",
      "publishedAt": "2025-04-27T05:41:10Z",
      "title": "Lapu Lapu Day: Car kills and injures people attending street festival in Vancouver",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-6635b400430a7015341d3ca0c4c1e7fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/115816b/2147483647/strip/true/crop/3600x2025+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fe6%2F5b097ab3916a6fb1867990f1ce81%2Fc0812d82118c45daa131b00d0c4efb7c"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s president has visited those injured in a huge explosion that rocked one of the Islamic Republic’s main ports. The facility purportedly linked to an earlier delivery of a chemical ingredient used to make missile propellant. The visit Sunday by President Masoud Pezeshkian came as the toll from Saturday’s blast at the Shahid Rajaei port outside of Bandar Abbas in southern Iran’s Hormozgan province rose to 40 with some 1,000 others injured. While Iran’s military sought to deny the delivery of ammonium perchlorate from China, new videos emerged showing an apocalyptic scene at the still-smoldering port.",
      "publishedAt": "2025-04-27T13:12:24Z",
      "title": "Iran's president visits injured from port blast that killed 40",
      "url": "https://apnews.com/article/iran-explosion-bandar-abbas-port-shahid-rajaei-53387f4f71dba2788569655297c57cff",
      "urlToImage": "https://dims.apnews.com/dims4/default/00a2234/2147483647/strip/true/crop/7008x3942+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fee%2F7b64644b0022f0b1773da6d81599%2Fef82a9809aed45fa96155f1f847305d4"
    },
    {
      "author": "Vanessa Gera, Silvia Stellacci",
      "description": "Roman Catholic faithful have begun visiting the tomb of Pope Francis. Starting early Sunday they began filing past the simple white tomb in St. Mary Major Basilica. The visits came a day after Pope Francis was bade farewell by the powerful of the world and a crowd of hundreds of thousands. A single white rose was placed on the tomb that said “Franciscus” — the pope’s name in Latin. A light cast its warm glow over the tomb and a reproduction of the late pontiff’s pectoral cross on the wall above it. The tomb was opened on the second of nine days of official mourning for Francis, after which a conclave will be held to elect the next pope.",
      "publishedAt": "2025-04-27T08:01:57Z",
      "title": "Catholic faithful pay respects to Pope Francis as his tomb opens to the public",
      "url": "https://apnews.com/article/pope-francis-tomb-st-mary-major-ea3fe0b086ac64e72374f9bc43603b84",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdca86a/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F99%2Fa8de12467f289417de375422da60%2F97c24cd711994863a97501f79e9951a1"
    },
    {
      "author": "Sally Abou Aljoud",
      "description": "Israeli jets have struck Beirut’s southern suburbs in the third such attack since a ceasefire began in late November. The airstrike on Sunday targeted what Israel says are Hezbollah facilities. A warning was issued before the strike. It prompted panicked evacuations across the southern suburbs. An earlier drone strike killed a man in southern Lebanon. Israel says it targeted a Hezbollah member rebuilding militant capabilities. Israeli strikes have continued in southern and eastern Lebanon despite the ceasefire in late November. The strikes have killed civilians and Hezbollah members. Hezbollah has warned it will “resort to alternatives” and won't disarm if Israeli airstrikes persist and Lebanon’s government doesn't act.",
      "publishedAt": "2025-04-27T15:42:21Z",
      "title": "Israeli jets strike Beirut's southern suburbs for third time since ceasefire",
      "url": "https://apnews.com/article/lebanon-hezbollah-southern-suburbs-israel-5fbec1f6c4aa0e283b3d56e5134e8097",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a6ddc9/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F32%2Fc187baf691bf2d2b8540f1584b64%2F900ed9bf027e4523bc27307128da54ff"
    },
    {
      "author": null,
      "description": "Russia has launched a sweeping drone assault across Ukraine overnight, targeting multiple regions after U.S. President Donald Trump cast doubt over Russian President Vladimir Putin’s willingness to end the war. One person was reported killed and a 14-year-old girl wounded in the city of Pavlohrad in the Dnipropetrovsk region, which was hit for the third consecutive night. The attacks came hours after Russia claimed to have regained control over the remaining parts of the Kursk region, which Ukrainian forces seized in a surprise incursion last August. Ukrainian officials said the fighting in Kursk was still ongoing.",
      "publishedAt": "2025-04-27T10:04:25Z",
      "title": "Russia launches nearly 150 drones against Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-talks-trump-3cc1f42ef5e7916d52ee64d173bf0832",
      "urlToImage": "https://dims.apnews.com/dims4/default/dceeca8/2147483647/strip/true/crop/4000x2250+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F67%2Ffc796ca67183ef5f6122bfa2963a%2F393339112cbc45e28e9936b072a7e873"
    },
    {
      "author": "Steve Peoples, Thomas Beaumont",
      "description": "Republican members of Congress have gone to great lengths to avoid public meetings with their constituents over their two-week Easter recess. Nationwide, Republicans hosted only a handful of in-person town halls during the congressional break. The most vulnerable House Republicans were especially shielded from public view. Some didn't answer their office phones for days. None of them, a collection of swing-district conservatives from across states like Colorado, California, Iowa and Pennsylvania, hosted in-person events that were open to the public. Just one planned a telephone town hall. Others favored smaller invitation-only gatherings with local officials promoted only after they were over.",
      "publishedAt": "2025-04-27T12:54:25Z",
      "title": "Swing-district Republican lawmakers aren't holding town halls",
      "url": "https://apnews.com/article/republicans-recess-congress-no-town-halls-de45284c77fbc54a13c7090f75994674",
      "urlToImage": "https://dims.apnews.com/dims4/default/be367f1/2147483647/strip/true/crop/5568x3132+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2F04%2Fcbb0d15e92562c3a8da9ea436eaa%2F474b6fddafe646458d32045675c0aa2f"
    },
    {
      "author": "Matt Sedensky",
      "description": "As President Donald Trump's trade war has injected turmoil in financial markets, many retired and near-retired Americans are anxiously looking on, worried about outliving their savings or having to put off entries on their bucket lists. Many older investors are taking the advice of experts to fine-tune investments if necessary but avoid dramatic moves that would cement losses. It's hard for someone of any age to watch their account drop in value, but it can be especially tough on older people. Financial planner Tj Binkowski of Nashville, Tennessee, says that when you're retired, paper losses aren't just on paper anymore.",
      "publishedAt": "2025-04-27T08:58:23Z",
      "title": "Market turmoil has many afraid to check retirement savings",
      "url": "https://apnews.com/article/retirement-stock-market-tariffs-trump-recession-f658b939b66c9dae8ebe093d0dd10ab4",
      "urlToImage": "https://dims.apnews.com/dims4/default/2379377/2147483647/strip/true/crop/5758x3239+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F81%2F9f9e544f6c4134027b98217658f6%2F2538c7fdb21a4f75b3c0aaebcf7fc8cf"
    },
    {
      "author": "Laura Ungar",
      "description": "People with diseases caused by rare mutations have fewer options and poorer prospects than other patients despite rapid recent advancements in the growing field of genetic science. In cystic fibrosis, for example, medications can vastly improve health for 90% of people with the condition, which is the most common fatal genetic disease in the U.S. But the therapies don't work for the 10% of patients with rare mutations. Experts say one big reason for this dynamic is that it's less profitable to develop therapies for smaller numbers of people. With help from charities, however, scientists are working on gene therapies that can help all patients, regardless of mutation.",
      "publishedAt": "2025-04-26T14:59:04Z",
      "title": "Genetic medicine can leave people with rare mutations behind. But there's new hope",
      "url": "https://apnews.com/article/gene-therapy-cystic-fibrosis-genetic-disease-156838bed586a5650f06d7bec4b2edae",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4bcae2/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fb9%2F3d367fc631d0e280483f690b4726%2F1ecef1c4d9984c249c3b96b2e4724840"
    },
    {
      "author": "Seung Min Kim, Linley Sanders",
      "description": "An AP-NORC poll finds many Americans don't agree with President Trump’s aggressive efforts to quickly enact his agenda, and even Republicans aren't overwhelmingly convinced his attention has been in the right place. Americans are nearly twice as likely to say Trump has been mostly focusing on the wrong priorities as to say he's been focusing on the right ones. The findings suggest Democrats are even unhappier with the reality of the second Trump term than before he was sworn in. While about 7 in 10 Republicans say Trump has been at least a “good” president so far, only about half say he’s emphasized the right things.",
      "publishedAt": "2025-04-26T11:23:37Z",
      "title": "Only about half of Republicans say Trump's priorities are right, poll finds",
      "url": "https://apnews.com/article/trump-economy-immigration-trade-100-days-poll-625efe6128d5f2e90e04bcc7f30479eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e1b039/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Ff0%2F030b88fe7d8fee886c3dc11bb0f9%2F2610ee8fca9a4779b7ad6287619a5703"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}