{
  "articles": [
    {
      "author": null,
      "description": "SAN DIEGO (AP) — A rarely seen deep sea fish resembling a serpent was found floating dead on the ocean surface off the San Diego coast and was brought ashore for study, marine experts said.The silvery, 12-foot-long (3.6-meter) oarfish was found last weekend by a group of snorkelers and kayakers in La Jolla Cove, north of downtown San Diego, the Scripps Institution of Oceanography said in a statement.",
      "publishedAt": "2024-08-15T20:20:49Z",
      "title": "A rarely seen deep sea fish is found in California, and scientists want to know why",
      "url": "https://apnews.com/833218b1d02125d3dee86c4df640a89e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/addae5d2172b44c19f2f9569735a8f33/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.",
      "publishedAt": "2024-08-15T10:43:28Z",
      "title": "As Gaza death toll passes 40,000, corpses are buried in yards, streets, tiered graves",
      "url": "https://apnews.com/988d16b648e06e222f04964dc9440da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7324a26694034ed099568ad064fc0055/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "DOHA, Qatar (AP) — International mediators held a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict.",
      "publishedAt": "2024-08-15T06:28:38Z",
      "title": "Mediators hold new Gaza cease-fire talks and hope to head off a wider war",
      "url": "https://apnews.com/a6a5b35859e1d1d1511729b40a71f837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16d25313ab544b019b21b57ee6b4fade/1920.jpeg"
    },
    {
      "author": "NICK PERRY, JAKE OFFENHARTZ and JOCELYN GECKER",
      "description": "NEW YORK (AP) — As students return to colleges across the United States, administrators are bracing for a resurgence in activism against the war in Gaza, and some schools are adopting rules to limit the kind of protests that swept campuses last spring.",
      "publishedAt": "2024-08-15T16:49:51Z",
      "title": "US colleges revise rules on free speech in hopes of containing anti-war demonstrations",
      "url": "https://apnews.com/b2321b9626e4a824f47cfce6b680e6d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4390a13747cf4cc5bf6bb513b9c8aeec/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — Venezuela’s opposition was dealt a blow Thursday when countries that had been pressuring President Nicolás Maduro to release vote tallies backing his claim to victory in last month’s presidential election began suggesting a repeat of the contest instead.",
      "publishedAt": "2024-08-15T14:41:36Z",
      "title": "Venezuela's opposition faces setback after countries suggest repeat of presidential election",
      "url": "https://apnews.com/1c3afbf01f4c85e7903c2fc3d7fdbf38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e50f86933190459b9309d190a0a110e7/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON and KAITLYN HUAMANI",
      "description": "LOS ANGELES (AP) — Five people including his personal assistant and two doctors have been charged in connection with Matthew Perry's death in what prosecutors called a “broad underground criminal network” dedicated to getting the “Friends” star the powerful surgical anesthetic that killed him.",
      "publishedAt": "2024-08-15T14:32:32Z",
      "title": "Matthew Perry's assistant among 5 people, including 2 doctors, charged in 'Friends' star's death",
      "url": "https://apnews.com/b3708a3818f1c649f234f83a6cd16e30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/233f68aa8a9c4f6d9d91c746a2146768/1920.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "Former President Donald Trump on Thursday gave his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
      "publishedAt": "2024-08-15T23:49:24Z",
      "title": "FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference",
      "url": "https://apnews.com/f8ed52f64a12cf450b0d0f2591c9d92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4b3e4656e0b4c3c9c3b2cdfc7304a8d/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is zeroing in on high food prices as her campaign previews an economic policy speech Friday in North Carolina, promising to push for a federal ban on price gouging on groceries as she looks to address one of voters' top concerns.",
      "publishedAt": "2024-08-15T13:49:57Z",
      "title": "Harris zeroes in on high food prices as inflation plays a big role in the presidential race",
      "url": "https://apnews.com/c3bbfd8aa3bfd2be3e98d021f0a182ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34bee420054c41a5813922eeab5482c2/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and FRANKLIN BRICENO",
      "description": "NEW YORK (AP) — A reputed Peruvian gang leader suspected in nearly two dozen killings in his home country was arrested Wednesday in New York by U.S. immigration authorities.Gianfranco Torres-Navarro, the leader of “Los Killers” who is wanted for 23 killings in Peru, was arrested in Endicott, New York, about 145 miles (233 kilometers) northwest of New York City, U.S.",
      "publishedAt": "2024-08-15T22:16:04Z",
      "title": "US arrests reputed Peruvian gang leader wanted for 23 killings in his home country",
      "url": "https://apnews.com/9ba446c26cde81e48396a30a7a687bba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d378cb06734d42a8815a0af8f09c7f07/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Thursday that his country's troops had taken full control of Sudzha, the largest Russian town to fall to Ukraine's forces since the start of their cross-border incursion more than a week ago.",
      "publishedAt": "2024-08-15T09:27:47Z",
      "title": "Zelenskyy says Ukrainian troops have taken full control of the Russian town of Sudzha",
      "url": "https://apnews.com/b7fb57c21a43f0f06bf79a4477eb62e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db2ad4a809564036963b184a8adfea46/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}