{
  "articles": [
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops fired on a crowd of Palestinians racing to pull food off an aid convoy in Gaza City on Thursday, witnesses said. More than 100 people were killed in the chaos, bringing the death toll since the start of the Israel-Hamas war to more than 30,000, according to health officials.",
      "publishedAt": "2024-02-29T08:58:06Z",
      "title": "Palestinians say Israeli troops fired at people seeking food. Israel says scene was deadly stampede",
      "url": "https://apnews.com/f9b5a62a80d8b83eac4946d3c85af58b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a6206154a9345e683bd3cba850866c8/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, JILL COLVIN and COLLEEN LONG",
      "description": "BROWNSVILLE, Texas (AP) — Three hundred miles apart, President Joe Biden and likely Republican challenger Donald Trump walked the U.S.-Mexico border in Texas Thursday, dueling trips underscoring how important immigration has become for the 2024 election and how much each man wants to use it to his advantage.",
      "publishedAt": "2024-02-29T05:10:02Z",
      "title": "Miles apart, Biden and Trump tour U.S.-Mexico border highlighting immigration as an election issue",
      "url": "https://apnews.com/42c945d02742b169bde40601a27fde02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60df02d36bea46b9af3d3fea92197a4e/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "STINNETT, Texas (AP) — A dusting of snow covered a desolate landscape of scorched prairie, dead cattle and burned out homes in the Texas Panhandle on Thursday, giving firefighters brief relief in their desperate efforts to corral a blaze that has grown into the largest in state history.",
      "publishedAt": "2024-02-29T05:26:45Z",
      "title": "A wildfire scorching the Texas Panhandle has grown to the largest in state history",
      "url": "https://apnews.com/cbbb6a279bef1bd020722ed48927114a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c00cfd347c54621a14a9e35246662ed/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House passed another short-term spending measure Thursday that would keep one set of federal agencies operating through March 8 and another set through March 22, avoiding a shutdown for parts of the federal government that would otherwise kick in Saturday.",
      "publishedAt": "2024-02-29T18:58:34Z",
      "title": "The House approves a short-term extension to avoid a shutdown. Senators are up next to vote",
      "url": "https://apnews.com/ca365b6aa96b00a718e491ef7449d9d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75d1653c14b24a7d9d12e4a274e19fdb/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "BOSTON (AP) — Jack Teixeira, the Massachusetts Air National Guard member accused of leaking highly classified military documents on a social media platform, is expected to plead guilty in his federal case, according to court papers filed Thursday.",
      "publishedAt": "2024-02-29T22:01:37Z",
      "title": "Pentagon leak suspect Jack Teixeira expected to plead guilty in federal case",
      "url": "https://apnews.com/cf5ef91310c58ebd1fffd2f6da148e8e",
      "urlToImage": ""
    },
    {
      "author": "JULIA FRANKEL",
      "description": "OFER PRISON, West Bank (AP) — A U.S. citizen who was dragged out of her home and detained by Israeli authorities for over three weeks was released on bail Thursday to wait out the remainder of her trial in the West Bank, the latest in a case attracting international attention for prosecuting an American in Israeli military court.",
      "publishedAt": "2024-02-29T21:20:20Z",
      "title": "Palestinian-American woman who faces trial in Israeli military court is released on bail",
      "url": "https://apnews.com/08cde4ee232f098061a62d80543a9e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/811b00f642794808a716d3177b65b46b/2000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin faced pointed bipartisan criticism at a congressional hearing Thursday for his failure to promptly notify President Joe Biden and other U.S.",
      "publishedAt": "2024-02-29T05:17:27Z",
      "title": "Lawmakers fault Defense Secretary Austin for a failure of leadership over his secret hospital stay",
      "url": "https://apnews.com/7d5832926ed4815994912b4f9ca36000",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7eb29c57b61a46109a9dccf38087d06f/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — A federal judge on Thursday blocked a new Texas law that would give police broad powers to arrest migrants suspected of illegally entering the U.S., dealing a victory to the Biden administration with a broad rejection of Republican Gov.",
      "publishedAt": "2024-02-29T16:30:37Z",
      "title": "Judge blocks Texas law that gives police broad powers to arrest migrants who illegally enter US",
      "url": "https://apnews.com/3bcded91620cbd9686575caa6bcac203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60df02d36bea46b9af3d3fea92197a4e/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and JIM MUSTIAN",
      "description": "MIAMI (AP) — A former career U.S. diplomat told a federal judge Thursday he will plead guilty to charges of working for decades as a secret agent for communist Cuba, an unexpectedly swift resolution to a case prosecutors called one of the most brazen betrayals in the history of the U.S.",
      "publishedAt": "2024-02-29T19:38:06Z",
      "title": "Career US diplomat abruptly admits to spying for communist Cuba for decades",
      "url": "https://apnews.com/b37ced95151526af4a9607eb50d9752d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcd5ec0f4ae0442c9aa91c2169f471e2/2839.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama lawmakers rushed to protect in vitro fertilization services Thursday after fertility clinics shut down in the wake of a state court ruling that frozen embryos are children under the state wrongful death law.",
      "publishedAt": "2024-02-29T18:36:18Z",
      "title": "Alabama lawmakers rush to get IVF services restarted",
      "url": "https://apnews.com/045123bb4061398e9e3c809e3ecf26dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85105689535747a4a7bc40b48d9c50c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}