{
  "articles": [
    {
      "author": null,
      "description": "PARIS (AP) — The opening ceremony of the 2024 Paris Olympics has begun.",
      "publishedAt": "2024-07-26T17:32:13Z",
      "title": "The opening ceremony of the 2024 Paris Olympics has begun",
      "url": "https://apnews.com/172d9fdcf11544bc0388e2c49f44d567",
      "urlToImage": ""
    },
    {
      "author": "ELLEN KNICKMEYER and JILL COLVIN",
      "description": "WASHINGTON (AP) — Clasping his hand warmly, a beaming Donald Trump welcomed Israeli Prime Minister Benjamin Netanyahu for their first face-to-face meeting in nearly four years on Friday, as they sought to mend an important political alliance that had broken down after Netanyahu congratulated Joe Biden on his 2020 presidential victory over Trump.",
      "publishedAt": "2024-07-26T04:03:47Z",
      "title": "A beaming Trump welcomes Netanyahu to Mar-a-Lago, mending a yearslong rift with a key political ally",
      "url": "https://apnews.com/3d7a6b47060fbe51f66d82104ac5e1aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00c58fa3898247c1895d520d3feddab1/1920.jpeg"
    },
    {
      "author": "THOMAS ADAMSON and JEFFREY SCHAEFFER",
      "description": "PARIS (AP) — Arsonists attacked France's high-speed rail network early Friday, setting fires that paralyzed train travel to Paris for some 800,000 people across Europe, including athletes heading to the opening ceremony of the Olympic Games.",
      "publishedAt": "2024-07-26T07:10:11Z",
      "title": "Arsonists attack French high-speed rail system hours before opening ceremonies of the Paris Olympics",
      "url": "https://apnews.com/74c9727d33ac86bfc126f98e45cb874f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b2758090ae4202a5f0e95d50caebdc/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Former President Barack Obama and former first lady Michelle Obama have endorsed Kamala Harris in her White House bid, giving the vice president the expected but still crucial backing of the nation’s two most popular Democrats.",
      "publishedAt": "2024-07-26T09:00:18Z",
      "title": "Barack and Michelle Obama endorse Kamala Harris, giving her expected but crucial support",
      "url": "https://apnews.com/48e38547560ae64484399d278c697a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8194fa8f377741eaabcf990820193dac/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — When it comes to Republican vice presidential nominee JD Vance's name, it's complicated.The senator from Ohio introduced himself to the world in 2016 when he published his bestselling memoir, “Hillbilly Elegy,” under the name J.D.",
      "publishedAt": "2024-07-26T04:04:36Z",
      "title": "What's in a name? Republican vice presidential nominee JD Vance has had many of them",
      "url": "https://apnews.com/359c3d1361c94f5d2d1e9798b7854477",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/977031a4cf7a4c38bf77889beb89027f/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, MARÍA VERZA and CHRISTOPHER SHERMAN",
      "description": "WASHINGTON (AP) — A powerful Mexican drug cartel leader who eluded authorities for decades was duped into flying into the U.S., where he was arrested alongside a son of Joaquín “El Chapo” Guzmán, according to a U.S.",
      "publishedAt": "2024-07-26T16:12:03Z",
      "title": "Powerful cartel leader 'El Mayo’ Zambada was lured onto airplane before arrest in US, AP source says",
      "url": "https://apnews.com/1d658ece5313a4de35bed732b3a86abf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f6a61de70e4cc6b9534f24b2ebbd00/2000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — A key question is looming for Vice President Kamala Harris as she edges closer to gaining the Democratic presidential nomination: Can she turn the Biden-Harris economic record into a political advantage in a way that President Joe Biden failed to do?",
      "publishedAt": "2024-07-26T07:00:28Z",
      "title": "Harris will carry Biden's economic record into the election. She hopes to turn it into an asset",
      "url": "https://apnews.com/d4dc87e150e5c0b76b664ad7525e05a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f79d85bb725498387e976e8cbac4dfb/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. health officials Friday announced a recall of some Boar's Head liverwurst and deli meats as they investigate a listeria outbreak that has sickened nearly three dozen people and caused two deaths.",
      "publishedAt": "2024-07-26T14:43:49Z",
      "title": "Recall of Boar's Head deli meats announced during investigation of listeria outbreak",
      "url": "https://apnews.com/2ab9ad2db304d829807982a53898cdb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f493c20c65d4a3a8d81e99980dece00/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE and JOHN ANTCZAK",
      "description": "More than 130 structures have been destroyed and thousands more remain threatened by California's largest active wildfire days after a man was seen ditching a burning car, authorities said. The Park Fire started Wednesday when a man pushed a burning car into a gully in Chico and then calmly blended in with others fleeing the scene, authorities said.",
      "publishedAt": "2024-07-26T12:14:45Z",
      "title": "California's largest wildfire is 0% contained 2 days after it reportedly began with a burning car",
      "url": "https://apnews.com/90e078225df39c0ed23e8edb9d26b8c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ad260d7d25d4b79b6ae498d1d15b91d/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD, JULIE WATSON and STEPHEN SMITH",
      "description": "GLOSTER, Miss. (AP) — This southern Mississippi town's expansive wood pellet plant was so close to Shelia Mae Dobbins' home that she sometimes heard company loudspeakers. She says industrial residues coated her truck and she no longer enjoys spending time in the air outdoors.",
      "publishedAt": "2024-07-26T05:03:07Z",
      "title": "Wood pellets production boomed to feed EU demand. It's come at a cost for Black people in the South",
      "url": "https://apnews.com/cd9a3de5f55d5acf495986fed8ddc778",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f902ec0e082647e0b771338733905412/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}