{
  "articles": [
    {
      "author": "MELANIE LIDMAN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israeli airstrikes across Lebanon killed dozens of people on Sunday as the Hezbollah militant group sustained a string of deadly blows to its command structure, including the killing of its overall leader, Hassan Nasrallah.",
      "publishedAt": "2024-09-29T09:09:33Z",
      "title": "Israeli airstrikes kill dozens across Lebanon as Hezbollah confirms a 7th top commander was killed",
      "url": "https://apnews.com/4696e581e28d8c747f017221f2cf420f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12fd2fcdc3514c1388425102722c10b2/1920.jpeg"
    },
    {
      "author": "HASSAN AMMAR",
      "description": "BEIRUT (AP) — More than two days after a massive Israeli airstrike that killed the leader of the Hezbollah militant group, smoke is still rising from the smoldering wreckage.",
      "publishedAt": "2024-09-29T12:14:14Z",
      "title": "AP images offer a close-up look at the smoldering site of Nasrallah's assassination",
      "url": "https://apnews.com/7ebf675d75e4d49c7b307864cdbc7dc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f963d40fa096414ca608a75d9bb92ffc/3000.jpeg"
    },
    {
      "author": "KATE PAYNE and JEFFREY COLLINS",
      "description": "PERRY, Fla. (AP) — Gov. Roy Cooper says death toll of 11 in North Carolina is expected to rise from Hurricane Helene.“This is an unprecedented tragedy that requires an unprecedented response,” Cooper said at a press conference Sunday.",
      "publishedAt": "2024-09-29T04:04:53Z",
      "title": "Supplies, emergency workers rushed to North Carolina while Florida digs out from Helene's damage",
      "url": "https://apnews.com/16b41006d3cb6fedad78d19ca3f389a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2ea64b82bda4fa79f91d1f70796a9ce/1920.jpeg"
    },
    {
      "author": "DEEPA BHARATH",
      "description": "MENIFEE, California (AP) — With Election Day just a few weeks away, longtime church members Lucky Hartunian and Janie Booth sat outside the Revival Christian Fellowship's sanctuary in Menifee, California, inviting congregants to register to vote.",
      "publishedAt": "2024-09-29T12:19:03Z",
      "title": "Conservative Christians were skeptical of mail-in ballots. Now they are gathering them in churches",
      "url": "https://apnews.com/1d1a48c53f8e970fb3f31a7650f200fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c7103380e8e445a9c5cd029851f3ab2/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "LOS ANGELES (AP) — Vice President Kamala Harris is set to rally in Las Vegas on Sunday night as both she and Republican Donald Trump continue to make frequent trips to Nevada, looking to gain momentum in the swing state as Election Day nears.",
      "publishedAt": "2024-09-29T11:24:02Z",
      "title": "Harris is set to rally again in Las Vegas as both campaigns emphasize swing-state Nevada",
      "url": "https://apnews.com/5e43f8e9159925cea38070e0bb662e47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7f39991527b4baa9799b2eef89a456b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Republicans on Sunday sought to distance themselves from Donald Trump's latest insults of Democratic nominee Kamala Harris during a rambling weekend rally in Wisconsin in which he called her “mentally disabled.”",
      "publishedAt": "2024-09-29T15:59:37Z",
      "title": "Some Republicans distance themselves from Trump's latest attack on Harris' mental fitness",
      "url": "https://apnews.com/a38195f876767332c48d12226a6aea2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f017f602e6e4fbd8439cf177697a3d2/3000.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Austria's far-right Freedom Party was headed for its first win in a national parliamentary election on Sunday, finishing ahead of the governing conservatives after tapping into voters’ anxieties about immigration, inflation, Ukraine and other concerns, a projection showed.",
      "publishedAt": "2024-09-29T04:05:58Z",
      "title": "Austria's far-right Freedom Party heading for its first national election win",
      "url": "https://apnews.com/1a22057b230a2576e0ca0ee69607cf6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6696535a3d7c49a78d0838ccfb19984d/3000.jpeg"
    },
    {
      "author": "MARK SCOLFORO",
      "description": "NEW KENSINGTON, Pa. (AP) — The four men who put Steve Szarewicz away for murder all changed their stories at one time or another, yet Szarewicz still sits behind bars. That's where he has been for almost 43 years.",
      "publishedAt": "2024-09-29T10:03:00Z",
      "title": "Appeals stretch 4 decades for a prisoner convicted on little police evidence",
      "url": "https://apnews.com/89edc6dbe87e33c0f723e8fe70e8a282",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ed163c2fdc743fb9c10cd9ae111f762/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ABOARD THE PAPAL PLANE (AP) — Pope Francis wrapped up a troubled visit to Belgium on Sunday by doubling down on his traditional views on women and abortion and demanding that Catholic bishops stop covering up for predator priests — a scandal that has devastated the church’s credibility around the globe.",
      "publishedAt": "2024-09-29T08:15:03Z",
      "title": "Pope wraps troubled Belgium visit by doubling down on abortion and women, praising abuse victims",
      "url": "https://apnews.com/f02c45fb9e902df27fa71fc088ce73a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1aeebcb2aa14702b5f4e99f7f3b724c/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Rescuers in Nepal recovered dozens of bodies from buses and other vehicles that were buried in landslides near the capital Kathmandu, as the death toll from flooding rose to at least 148 with dozens missing, officials said Sunday.",
      "publishedAt": "2024-09-29T04:56:14Z",
      "title": "At least 148 are dead in floods and landslides in Nepal",
      "url": "https://apnews.com/9e810fd32a53ca5bb0172438adcb21af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c00fabb9d3d4180b468c4b5f7b00d1e/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}