{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces raided one of the last functioning hospitals in Gaza’s north and bombarded the south with airstrikes that killed at least 28 Palestinians, pressing ahead with their offensive Tuesday with renewed backing from the United States, despite rising international alarm.",
      "publishedAt": "2023-12-19T08:35:05Z",
      "title": "Israel delivers deadly airstrikes in south Gaza and raids a hospital in the north",
      "url": "https://apnews.com/226fdce935f5797ba8abc9ae4ad857cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4277e2192ea240b79ec5ee8a4b886aa5/1920.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "LUKEVILLE, Ariz. (AP) — Hundreds of dates are written on concrete-filled steel columns erected along the U.S. border with Mexico to memorialize when the Border Patrol has repaired illicit openings in the would-be barriers.",
      "publishedAt": "2023-12-19T05:04:45Z",
      "title": "Illegal crossings surge in remote areas as Congress, White House weigh major asylum limits",
      "url": "https://apnews.com/beddd2ca0ffd02884ce0d0ad1785f538",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/575cb22fdf254898884de184fa3b31de/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Justice Sandra Day O’Connor, the Arizona rancher's daughter who became a voice of moderate conservatism as the first woman on the U.S.",
      "publishedAt": "2023-12-19T05:05:09Z",
      "title": "Sandra Day O’Connor called a pioneer and 'iconic jurist' as she is memorialized by Biden, Roberts",
      "url": "https://apnews.com/9113c9072894cdcbb4689d7ff56e98f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c26483ea6c074014bdd5907ea20a0d33/1920.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — Civil rights organizations on Tuesday filed a lawsuit challenging a new Texas law that would allow police to arrest migrants who cross the border illegally and permit local judges to order them to leave the country.",
      "publishedAt": "2023-12-19T19:07:06Z",
      "title": "Groups sue over new Texas law that lets police arrest migrants who enter the US illegally",
      "url": "https://apnews.com/2be91001567623db8ad3171265d5e739",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9b273a27404a18ab3b0f75016cc6ce/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "Google has agreed to pay $700 million and make several other concessions to settle allegations that it had been stifling competition against its Android app store — the same issue that went to trial in another case that could result in even bigger changes.",
      "publishedAt": "2023-12-19T05:32:40Z",
      "title": "Google to pay $700 million to US states, consumers in app store settlement",
      "url": "https://apnews.com/e4e2f422baa846c66deac90c7866c5fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/314509efa833437a969d28146d3cea74/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "ATLANTA (AP) — It’s unclear to Tameka how — or even when — her children became unenrolled from Atlanta Public Schools. But it was traumatic when, in fall 2021, they figured out it had happened.After more than a year of some form of pandemic online learning, students were all required to come back to school in person.",
      "publishedAt": "2023-12-19T05:03:03Z",
      "title": "These kids want to go to school. The main obstacle? Paperwork",
      "url": "https://apnews.com/22f4b2e1fc15f73f370da9f2679c02f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20385c09930a4e8683172aa2b6c03cbf/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis’ green light for Catholic priests to offer blessings to same-sex couples is in many ways a recognition of what has been going on in some European parishes for years.",
      "publishedAt": "2023-12-19T15:29:48Z",
      "title": "Pope's approval of gay blessings could have impact where rights are restricted, LGBTQ+ advocates say",
      "url": "https://apnews.com/29b1c90f245170f7cfba81a0d1dadac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6162a26325c4cb19c1aeae9d5258875/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — South Carolina and Florida were the two fastest-growing states in the U.S., as the South dominated population gains in 2023, and the U.S. growth rate ticked upward slightly from the depths of the pandemic due to a drop in deaths, according to estimates released Tuesday by the U.S.",
      "publishedAt": "2023-12-19T18:20:51Z",
      "title": "South dominates US population gains as deaths drop",
      "url": "https://apnews.com/a21094d38c216097c1ddd06164a133eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a12808c74af445edbef4c4908cbc6b71/2000.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "CHICAGO (AP) — Christmas tree breeder Jim Rockis knows what it looks like when one dies long before it can reach a buyer.Rockis farms trees in West Virginia and Pennsylvania, where he and other producers often grow their iconic evergreens outside their preferred habitat higher in the mountains.",
      "publishedAt": "2023-12-19T17:49:50Z",
      "title": "As climate warms, that perfect Christmas tree may depend on growers' ability to adapt",
      "url": "https://apnews.com/90d88a843a07b5d6d943a98f11806cd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebca094fed49414b9e0c0ddd64c2a37a/3000.jpeg"
    },
    {
      "author": "TIM BOOTH",
      "description": "SEATTLE (AP) — Kalen DeBoer landing the job at Washington two years ago seemed to be an unheralded transaction at the time.",
      "publishedAt": "2023-12-19T17:02:05Z",
      "title": "Washington's Kalen DeBoer is the AP coach of the year after leading undefeated Huskies to the CFP",
      "url": "https://apnews.com/2911f015e8e942b36c612184be2cd8a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2344d848083645aa9f8709ff77fa735f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}