{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — The first of Donald Trump’s four criminal trials will begin April 15, a Manhattan judge ruled Monday after tearing into the former president’s lawyers for what he said were unfounded claims that the hush-money case had been tainted by prosecutorial misconduct.",
      "publishedAt": "2024-03-25T04:25:41Z",
      "title": "Trump's New York hush money case is set for trial April 15",
      "url": "https://apnews.com/b8fb980a6ec745e918a13e676b7f1460",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be9de36d588449258f120f46b8e6385b/2040.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations Security Council on Monday issued its first demand for a cease-fire in Gaza, with the U.S. angering Israel by abstaining from the vote. Israel responded by canceling a visit to Washington by a high-level delegation in the strongest public clash between the allies since the war began.",
      "publishedAt": "2024-03-25T04:01:55Z",
      "title": "UN demand for Gaza cease-fire provokes strongest clash between US and Israel since war began",
      "url": "https://apnews.com/b7985fede65e5477aba2c8d2e62a6632",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d636c50859874c28ae5b48a18f11fab6/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin will meet with Israel's minister of defense on Tuesday and discuss ways to defeat Hamas other than conducting a ground invasion of the southern Gaza city of Rafah, the Pentagon said, at a time of rising tensions between the two countries.",
      "publishedAt": "2024-03-26T04:07:27Z",
      "title": "US and Israeli defense chiefs to meet Tuesday as tensions rise over Gaza",
      "url": "https://apnews.com/ba2fa9612856b2e6e8c9e0e1624fd3aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f64cab9b118f41f795ba359176240b4c/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The U.S. warning to Russia couldn't have been plainer: Two weeks before the deadliest attack in Russia in years, Americans had publicly and privately advised President Vladimir Putin's government that “extremists” had “imminent plans” for just such slaughter.",
      "publishedAt": "2024-03-26T04:15:32Z",
      "title": "‘Duty to warn’ guided US advance warning of the Moscow attack. Adversaries don’t always listen",
      "url": "https://apnews.com/ab89b8b933c1c51b25903166951a1c7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/304bf244c1064627a3e3b78907bb0d42/2061.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Ukraine needs any edge it can get to repel Russia from its territory. One emerging bright spot is its small but fast-growing defense industry, which the government is flooding with money in hopes that a surge of homemade weapons and ammunition can help turn the tide.",
      "publishedAt": "2024-03-26T04:05:38Z",
      "title": "Ukraine ramps up spending on homemade weapons to help repel Russia",
      "url": "https://apnews.com/90b03d92f72f878c8c2ac04b0d12f804",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d93051c04e6e4f2086543e7b4aad7f78/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and COLLEEN LONG",
      "description": "NEW YORK (AP) — Two properties belonging to music mogul Sean “Diddy” Combs in Los Angeles and Miami were searched Monday by federal Homeland Security Investigations agents and other law enforcement as part of an ongoing sex trafficking investigation by federal authorities in New York, two law enforcement officials told The Associated Press.",
      "publishedAt": "2024-03-25T21:43:15Z",
      "title": "Feds search Sean 'Diddy' Combs’ properties as part of sex trafficking probe, AP sources say",
      "url": "https://apnews.com/8883ed2c7308f3fcdb2cdf03fbe329d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f9956689a1469f8737cccf5d69602d/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is hearing arguments Tuesday in its first abortion case since conservative justices overturned the constitutional right to an abortion two years ago.",
      "publishedAt": "2024-03-26T04:04:12Z",
      "title": "Supreme Court hears arguments Tuesday in case that could restrict access to abortion medication",
      "url": "https://apnews.com/4406d53e8af90f6a523264f535f5adf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7061fe564dfc4019bc5e857f8e82719a/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japan’s Cabinet on Tuesday approved a plan to sell future next-generation fighter jets that it’s developing with Britain and Italy to other countries, in the latest move away from the country’s postwar pacifist principles.",
      "publishedAt": "2024-03-26T00:20:58Z",
      "title": "Japan approves plan to sell fighter jets to other nations in latest break from pacifist principles",
      "url": "https://apnews.com/48e8f39c549232fe13ed67ddff0bfac4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef55d9fb0a5d4319a8b77ec4b7757eb9/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — Shohei Ohtani said Monday he never bet on sports or knowingly paid any gambling debts accumulated by his longtime interpreter, Ippei Mizuhara.Instead, the Los Angeles Dodgers star claims his close friend lied to him for years and stole millions from the two-time MVP.",
      "publishedAt": "2024-03-25T17:19:40Z",
      "title": "Shohei Ohtani says he never bet on sports, interpreter Ippei Mizuhara stole money, told lies",
      "url": "https://apnews.com/e330999371308631f35c18d81be76e11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac172b357914874b12f612eb9764cb8/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days.",
      "publishedAt": "2024-03-25T04:07:01Z",
      "title": "Court agrees to pause collection of Trump's massive civil fraud judgment if he puts up $175M",
      "url": "https://apnews.com/8447c48d0436083737204b13401438d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab25ef1ec7f54085800218e159a0f066/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}