{
  "articles": [
    {
      "author": "IGNACIO MARTINEZ and JULIE WATSON",
      "description": "CABO SAN LUCAS, Mexico (AP) — Hurricane Hilary headed for Mexico's Baja California Saturday as the U.S, National Hurricane Center predicted “catastrophic and life-threatening flooding” for the peninsula and for the southwestern United States, where it is forecast to make land as a tropical storm on Sunday.",
      "publishedAt": "2023-08-19T08:07:19Z",
      "title": "Hurricane Hilary threatens 'catastrophic and life-threatening' flooding in Mexico and California",
      "url": "https://apnews.com/7fddeb8c6eaf2e6cb8893dfe4db838fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3c1cfd21797406fb22fd8a4b85e4fa3/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Hawaii Gov. Josh Green said Friday that what's rebuilt from the ashes of the devastating wildfires on Maui will be determined by the people. “Lahaina will rise again,” Green said during a livestreamed evening address from Honolulu.",
      "publishedAt": "2023-08-19T05:58:23Z",
      "title": "Maui town ravaged by fire will 'rise again,' Hawaii governor says of long recovery ahead",
      "url": "https://apnews.com/875c8a8571555da7cb006c651a807eff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7debbd89764c43c9b3af9973b2edf0ab/1920.jpeg"
    },
    {
      "author": "TAMMY WEBBER and JIM MORRIS",
      "description": "VANCOUVER, British Columbia (AP) — Residents heeded warnings to evacuate the capital of Canada's Northwest Territories as a large wildfire burned just outside the city of 20,000 Friday, while firefighters battled a growing fire that set homes ablaze in a city in British Columbia.",
      "publishedAt": "2023-08-18T04:59:08Z",
      "title": "City empties as thousands flee wildfire burning near capital of Canada's Northwest Territories",
      "url": "https://apnews.com/7b8c327876d86a483c8e25df7bc2c566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/beb59c0c189c48d19697c69c987426c3/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The loop Donald Trump's private jet made above the Iowa State Fair before his visit last weekend was more than just a gesture to the hundreds of supporters — and a few rival candidates — on the ground.",
      "publishedAt": "2023-08-19T04:02:09Z",
      "title": "Trump looms large over Iowa State Fair, but many GOP voters still mulling their caucus choices",
      "url": "https://apnews.com/c1a3c5b437dce7bb6f93e650d2e36db4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dac35aa9e204513976ec49292d787bc/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — It’s easy to understand why Gail Newsham can’t stop grinning as she prepares for England’s soccer team to play in the final of the Women’s World Cup.",
      "publishedAt": "2023-08-19T11:43:19Z",
      "title": "England women's team unites fans as once ignored squad eyes nation's first World Cup title since '66",
      "url": "https://apnews.com/8c063c025e2d267741ae6b3e0528a11f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/434d367f5dc442f0b3a4d67ad9e58957/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, PATRICK ORSAGOS and RENATA BRITO",
      "description": "CINCINNATI (AP) — Aissata Sall was scrolling through WhatsApp in May when she first learned about the new route to the United States. For Ibrahima Sow, the discovery came on TikTok a few weeks later.",
      "publishedAt": "2023-08-19T04:33:43Z",
      "title": "Thousands more Mauritanians are making their way to the US, thanks to a route spread on social media",
      "url": "https://apnews.com/bbef5afc25680ad7f2704afa76f44cea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e52b9c9c51bf4add8da04a910b71f1b5/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and HEATHER HOLLINGSWORTH",
      "description": "TOPEKA, Kan. (AP) — A central Kansas police chief was not only on legally shaky ground when he ordered the raid of a weekly newspaper, experts said, but it may have been a criminal violation of civil rights, a former federal prosecutor added, saying: “I'd probably have the FBI starting to look.”",
      "publishedAt": "2023-08-19T11:31:17Z",
      "title": "A raid on a Kansas newspaper likely broke the law, experts say. But which one?",
      "url": "https://apnews.com/bead3f49d323c784d40154067141dc7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b07b585ce0546039d25959405d57004/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — A delegation from regional nations is expected to arrive in Niger in a last-ditch diplomacy effort to reach a peaceful solution with mutinous soldiers who ousted the country's president last month.",
      "publishedAt": "2023-08-19T07:34:53Z",
      "title": "A scramble of last-ditch diplomacy aims at finding a peaceful solution to Niger's deepening crisis",
      "url": "https://apnews.com/d704ef6c5add00a37c6ee931d2f7561d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d2189c399f043d08e511040a62eb844/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU, GERALD IMRAY, FARAI MUTSAKA and PAUL WISEMAN",
      "description": "ABUJA, Nigeria (AP) — Business has vanished at Kingsley Odafe’s clothing shop in Nigeria’s capital, forcing him to lay off three employees.One culprit for his troubles stands out: The U.S. dollar’s strength against the Nigerian currency, the naira, has pushed the price of garments and other foreign goods beyond the reach of local consumers.",
      "publishedAt": "2023-08-19T05:09:11Z",
      "title": "Emerging economies are pushing to end the dollar's dominance. But what's the alternative?",
      "url": "https://apnews.com/d4322e1f99480962eccc05628a0ddb64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f185ffdd9f684a079de06e1a732265fb/3000.jpeg"
    },
    {
      "author": "PAT GRAHAM and EDDIE PELLS",
      "description": "BUDAPEST, Hungary (AP) — A year ago, Trey Hardee found himself alone in a hotel room, hitting rock bottom.Struggling to cope with the realities of life in the aftermath of a successful track career, the father of three, a two-time world champion and Olympic silver medalist in the decathlon, was thinking about ending his life.",
      "publishedAt": "2023-08-19T09:58:26Z",
      "title": "Decathlete Trey Hardee's mental health struggles began after celebrated career ended",
      "url": "https://apnews.com/882b5b3e696a088166480af3f24990d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/511bcd3b6cf041e287813a9cac554815/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}