{
  "articles": [
    {
      "author": "MARIA SHERMAN",
      "description": "Few artists have legacies so mammoth their very name could be considered synonymous with the music industry, but then again, most musicians are not the prodigious producer Quincy Jones.",
      "publishedAt": "2024-11-04T17:33:17Z",
      "title": "Remembering Quincy Jones: 10 career-spanning songs to celebrate his legacy",
      "url": "https://apnews.com/79ddd6c617aa7e4945b5ab22cd392be5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21472452b6c749cbb365f9e9ec1a61b6/2976.jpeg"
    },
    {
      "author": "JILL COLVIN, DARLENE SUPERVILLE and BILL BARROW",
      "description": "ALLENTOWN, Pa. (AP) — Vice President Kamala Harris and former President Donald Trump made their final pitches to voters Monday in the same part of Pennsylvania, at roughly the same time, spending the last full day of the presidential campaign in a state that could make or break their chances.",
      "publishedAt": "2024-11-04T05:07:07Z",
      "title": "Harris and Trump's final push before Election Day brings them to the same patch of Pennsylvania",
      "url": "https://apnews.com/0429c35a84739bd90d9e5bb92fe803de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fcf3a1fcbe54bfbb9208a04939855c8/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — It's the election that no one could have foreseen. Not so long ago, Donald Trump was marinating in anger at Mar-a-Lago after being impeached twice and voted out of the White House.",
      "publishedAt": "2024-11-04T05:09:15Z",
      "title": "A presidential campaign unlike any other ends on Tuesday. Here's how we got here",
      "url": "https://apnews.com/5190456906435fa1ce481e6863ef5d81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f80cac969c2c496cb0bd4128f5f1c64d/3000.jpeg"
    },
    {
      "author": "MATT BROWN and FREIDA FRISARO",
      "description": "MIAMI (AP) — Concerts and carnivals hosted at polling precincts. “Souls to the Polls” mobilizations after Sunday service. And star-studded rallies featuring Hollywood actors, business leaders, musical artists and activists.",
      "publishedAt": "2024-11-04T00:58:47Z",
      "title": "Harris, Obamas and voting rights leaders work to turn out Black voters in run-up to Election Day",
      "url": "https://apnews.com/0f2d15b252fa68557e94d943da1e7624",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/553dd1f4bb394aaabe48d0879ef818db/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and JONATHAN J. COOPER",
      "description": "GASTONIA, N.C. (AP) — Donald Trump says he will be the “protector” of women, whether they like it or not.",
      "publishedAt": "2024-11-03T16:48:26Z",
      "title": "Trump wants to narrow his deficit with women but he's not changing how he talks about them",
      "url": "https://apnews.com/c4ba3f564e981aec7cd12f24d390aced",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fce644f26abb4bb68ec96a5af82cc368/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "WASHINGTON (AP) — Election Day is nearly upon us. In a matter of hours, the final votes in the 2024 presidential election will be cast.In a deeply divided nation, the election is a true toss-up between Democrat Kamala Harris and Republican Donald Trump.",
      "publishedAt": "2024-11-04T05:11:33Z",
      "title": "Here's what to watch as Election Day approaches in the U.S.",
      "url": "https://apnews.com/6dc879eef5e056c2b5dbee86773b09ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8755a030d304969b6562171cbed18e6/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration is stepping up criticism of Israel for not doing enough to improve humanitarian conditions in Gaza as a 30-day deadline looms for Israeli officials to meet certain requirements or risk potential restrictions on military assistance.",
      "publishedAt": "2024-11-04T21:25:16Z",
      "title": "US gives Israel a 'fail' grade on improving aid to Gaza so far",
      "url": "https://apnews.com/656d54b6ff0f37e6219f46deabc0baff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde81050adcc46a698e7e3ae51959d84/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "A former police officer was convicted of murder Monday in the shooting of Andre Hill, a Black man who was holding a cellphone and keys when he was killed.",
      "publishedAt": "2024-11-04T17:38:23Z",
      "title": "Ex-officer found guilty in the 2020 shooting death of Andre Hill",
      "url": "https://apnews.com/7c9405baf78daf4394cb74df9ad2191e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/305ce8da60164d109a8648e49bb08a21/1920.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Mud splattered the cheek of Spain's monarch as survivors of catastrophic floods unleashed their fury in a barrage of muck and mire. Felipe VI took it, literally, on the chin, and his determination to stay and speak to the enraged crowd could redefine his reign.",
      "publishedAt": "2024-11-04T19:40:51Z",
      "title": "Spain's king stood his ground under a mud barrage. What will the iconic moment mean for his reign?",
      "url": "https://apnews.com/903a0f29591049ff54e9778e916882b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8651300dede5479b8eb662cc0445312b/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Unionized factory workers at Boeing were voting Monday whether to accept a contract offer or to continue their strike, which has lasted more than seven weeks and shut down production of most Boeing passenger planes.",
      "publishedAt": "2024-11-04T05:01:32Z",
      "title": "Boeing machinists hold contract vote that could end their 7-week strike",
      "url": "https://apnews.com/614c4d5afd97d1f50ab9cfe1f4f94255",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99121482b2294f209f1e798f8249533a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}