{
  "articles": [
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Israel and Hezbollah traded strikes again Tuesday as the death toll from a massive Israeli bombardment climbed to nearly 560 people and thousands fled from southern Lebanon with the two sides on the brink of all-out war.",
      "publishedAt": "2024-09-24T09:24:58Z",
      "title": "Israel and Hezbollah renew fire after the deadliest day in Lebanon since 2006",
      "url": "https://apnews.com/640a0046aceea1b5cfb395a54ff36bce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b4244e9204147d8862a1f263ecaba20/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Lebanese health authorities on Tuesday raised the death toll from two days of Israeli airstrikes targeting Hezbollah militants to 558. Palestinian officials in Gaza, meanwhile, said new Israeli strike killed at least seven people in the southern city of Khan Younis.",
      "publishedAt": "2024-09-24T05:38:14Z",
      "title": "Israel-Hamas war latest: Two-day death toll from Israeli strikes in Lebanon reaches 558",
      "url": "https://apnews.com/a3377b1ade42c9a314bd48561395596b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa6770bd09a44f159f1603eb10f55d7b/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "MUWASI, Gaza Strip (AP) — As the escalating conflict between Israel and Hezbollah grabs global attention, Palestinians in Gaza wonder: What will become of their plight after nearly a year of devastating war?",
      "publishedAt": "2024-09-24T04:10:39Z",
      "title": "As Israel's fight with Hezbollah heats up, people of Gaza fear being forgotten",
      "url": "https://apnews.com/9d4d53e808ce5f67e234789f65d1ad71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033545f1675a44dc826400c65827d2a3/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — World leaders will open their annual meeting at the U.N. General Assembly on Tuesday under the shadow of increasing global divisions, major wars in Gaza, Ukraine and, Sudan and the threat of an even larger conflict in the wider Middle East.",
      "publishedAt": "2024-09-24T05:07:12Z",
      "title": "World leaders meet under shadow of global divisions, 3 wars and possible Mideast conflict",
      "url": "https://apnews.com/e9b8bd0ee132f6a7f56555975f67b0de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cd73bdb4fe84450b90849380e2a7238/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, MATTHEW LEE and ZEKE MILLER",
      "description": "NEW YORK (AP) — President Joe Biden is set to deliver his final address to the U.N.",
      "publishedAt": "2024-09-24T04:03:29Z",
      "title": "Conflicts in the Mideast and Ukraine will loom over Biden's farewell address at the United Nations",
      "url": "https://apnews.com/4e4e839c3cdd4edd7543aea84af2346f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17d0199eadc74e7483fffce95022108f/3000.jpeg"
    },
    {
      "author": "LUIS ALBERTO CRUZ",
      "description": "PUERTO ESCONDIDO, Mexico (AP) — Tropical Storm John struck Mexico’s southern Pacific coast with life-threatening flood potential after growing into a major hurricane in a matter of hours.It came ashore near the town of Punta Maldonado late Monday night as a Category 3 hurricane with maximum sustained winds of 120 mph (190 kph).",
      "publishedAt": "2024-09-24T07:25:58Z",
      "title": "Tropical Storm John strikes Mexico’s southern Pacific coast with 'life-threatening' flood potential",
      "url": "https://apnews.com/b56193c39433fa96cd06d83ae2228157",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c379d60736a42bc8450c12159647e9a/1596.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "In Georgia, election workers will have to hand count the number of ballots cast after voting is completed.",
      "publishedAt": "2024-09-24T04:26:55Z",
      "title": "Several states are making late changes to election rules, even as voting is set to begin",
      "url": "https://apnews.com/c6d5a339503771596758a733851bfeae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/778ffdbc4a314b5dba8960c8e12260e5/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is viewed more favorably by Asian American, Native Hawaiian and Pacific Islander registered voters than former President Donald Trump, according to a new poll.",
      "publishedAt": "2024-09-24T10:21:06Z",
      "title": "Harris is more popular than Trump among AAPI voters, a new APIA Vote/AAPI Data survey finds",
      "url": "https://apnews.com/1db02aa7fdbe63426e779af8db1623e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffbb298e34e743838a4b5de3b132c798/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Obesity is high and holding steady in the U.S., but the proportion of those with severe obesity — especially women — has climbed since a decade ago, according to new government research.",
      "publishedAt": "2024-09-24T04:03:15Z",
      "title": "Severe obesity is on the rise in the US",
      "url": "https://apnews.com/5663c0388b19009eae3834d695710bc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91d1e840520c4471a46a42ee920539eb/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH and JENNIFER McDERMOTT",
      "description": "NEWPORT, Ore. (AP) — On a cloudy late August morning, Burke Hales was on a boat a mile off the central Oregon coast, pointing to a sandy beach along the forested shoreline. It was there, the Oregon State University oceanography professor said, that the subsea cables from the first large wave energy test site in the continental U.S.",
      "publishedAt": "2024-09-24T04:06:08Z",
      "title": "Climate solutions: 2 kinds of ocean energy inch forward off the Oregon coast",
      "url": "https://apnews.com/5dbf36ac5614639de39b5d4f68620b39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/669efee656664ae9bc2ea1218f5e69e9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}