{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump's lawyer told The Associated Press he was surprised at Trump’s stoic demeanor as he listened to the verdict that made him the first former U.S. president convicted of a crime.",
      "publishedAt": "2024-06-01T01:38:16Z",
      "title": "Donald Trump’s attorney was 'shocked' the former president took the verdict with 'solemnness'",
      "url": "https://apnews.com/4361e2bd70c287f38ba68b920e13ff81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38205381b58e4510be219921f26db6f7/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump sought to move past his historic criminal conviction on Friday and build momentum for his bid to return to the White House with fierce attacks on the judge who oversaw the case, the prosecution’s star witness and the criminal justice system as a whole.",
      "publishedAt": "2024-05-31T04:07:16Z",
      "title": "Trump tries to move past his guilty verdict by attacking the criminal justice system",
      "url": "https://apnews.com/4629840240cb308c5eae335532ad17ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Embracing Donald Trump’s strategy of blaming the U.S. justice system after his historic guilty verdict, Republicans in Congress are fervently enlisting themselves in his campaign of vengeance and political retribution in the GOP bid to reclaim the White House.",
      "publishedAt": "2024-06-01T04:24:48Z",
      "title": "Republicans join Trump's attacks on justice system and campaign of vengeance after guilty verdict",
      "url": "https://apnews.com/a05db7fa2512a62afe035992f2baaf16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — The African National Congress party lost its parliamentary majority in a historic election result Saturday that puts South Africa on a new political path for the first time since the end of the apartheid system of white minority rule 30 years ago.",
      "publishedAt": "2024-06-01T07:28:39Z",
      "title": "The ANC party that freed South Africa from apartheid loses its 30-year majority in landmark election",
      "url": "https://apnews.com/d9da7582ca98a4e00fec2da6a5fe1e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41961b9202554a01aded4d05441a745e/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "TEL AVIV, Israel (AP) — Families of Israeli hostages held by Hamas called for all parties to immediately accept a proposal detailed by U.S.",
      "publishedAt": "2024-06-01T10:04:25Z",
      "title": "Hostage families call for a cease-fire deal pushed by Biden. Israel says conditions must be met",
      "url": "https://apnews.com/8c06dda3a8e20491b5a34377c60bb827",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edc3d0ef6e0c407aabf57b1ad9ca796a/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Patients lying shackled and blindfolded on more than a dozen beds inside a white tent in the desert. Surgeries performed without adequate painkillers. Doctors who remain anonymous.",
      "publishedAt": "2024-06-01T05:15:33Z",
      "title": "Israel maintains a shadowy hospital in the desert for Gaza detainees. Critics allege mistreatment",
      "url": "https://apnews.com/3ca025f6ca412ce07c0c41cf11c52c6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f08a521da204631b251fb0865014699/3000.jpeg"
    },
    {
      "author": "COLLEEN BARRY",
      "description": "MILAN (AP) — While Italian Premier Giorgia Meloni adopts a reassuring Western-allied foreign policy, cultural wars at home are preserving her far-right credentials heading into a European Parliamentary election, where her neo-fascist-rooted Brothers of Italy party is projected to secure significant gains — and a possible coalition role.",
      "publishedAt": "2024-06-01T04:14:38Z",
      "title": "Europe vote may tip balance between Meloni's far-right agenda in Italy and mainstream foreign policy",
      "url": "https://apnews.com/9fc9de659ba8f848f26edf597155f332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f979b943c84441be2e1d94374b1ead/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "As weight-loss plans go, it’s easy to see the allure of intermittent fasting: Eat what you want, but only during certain windows of time — often just eight hours a day.Instead of counting calories or measuring portions, dieters just have to pay attention to the clock, said Courtney Peterson, a nutrition researcher at the University of Alabama at Birmingham.",
      "publishedAt": "2024-06-01T12:00:25Z",
      "title": "Is intermittent fasting better than counting calories? Maybe not, but you might stick with it",
      "url": "https://apnews.com/c8a7a8e0bafc5b6f6faa9f30bfcc0646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c08d9974a5e4a62b8fdd651b033a069/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "As climate change makes disasters such as cyclones, floods and droughts more intense, more frequent and striking more places, fewer people are dying from those catastrophes globally because of better warning, planning and resilience, a top United Nations official said.",
      "publishedAt": "2024-06-01T06:00:47Z",
      "title": "UN official highlights how better preparation has shrunk disaster deaths despite worsening climate",
      "url": "https://apnews.com/ebe7f7c75d318a2024501b35bec509a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e959f3e9c4c4423b803a93756413bd54/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "Mike Tyson's fight with Jake Paul has been postponed after the 57-year-old Tyson fell ill on a flight last weekend.Tyson and Paul said Friday that they will announce a new fight date next week.",
      "publishedAt": "2024-05-31T21:58:34Z",
      "title": "Mike Tyson's fight with Jake Paul has been postponed after Tyson's health episode",
      "url": "https://apnews.com/7383b668be4a94f5e6fe9037a84be87c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8c3d2daa7aa4eeb98fd7bfdbdf86ade/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}