{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and NICHOLAS RICCARDI",
      "description": "Over the past two weeks, Donald Trump said shoplifters should be immediately shot, suggested the United States' top general be executed and mocked a political opponent’s husband who was beaten with a hammer.",
      "publishedAt": "2023-10-05T04:03:09Z",
      "title": "Trump's intensifying rhetoric offers insight into how he might govern again as president",
      "url": "https://apnews.com/39e090680a33c0869312e79bcef106e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa4a2df3f51543e18af7ab31da42bb9f/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — Kevin McCarthy spent years raising mountains of Republican campaign cash, flying around the country to recruit top candidates in key districts and painstakingly building political relationships as he worked his way toward becoming speaker of the House.",
      "publishedAt": "2023-10-05T04:06:55Z",
      "title": "Kevin McCarthy's ouster as House speaker could cost the GOP its best fundraiser heading into 2024",
      "url": "https://apnews.com/13abbe256e55f4741370ba00ccb224ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4575143eb2354ffda23ed0e2b5292b91/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "TEL AVIV, Israel (AP) — Israel has quietly helped fuel Azerbaijan’s campaign to recapture Nagorno-Karabakh, supplying powerful weapons to Azerbaijan ahead of its lightening offensive last month that brought the ethnic Armenian enclave back under its control, officials and experts say.",
      "publishedAt": "2023-10-05T04:28:10Z",
      "title": "Israeli arms quietly helped Azerbaijan retake Nagorno-Karabakh, to the dismay of region's Armenians",
      "url": "https://apnews.com/6814437bcd744acc1c4df0409a74406c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/befd46c1602e44abb46378ceffcfd866/3000.jpeg"
    },
    {
      "author": "DAVID KEYTON, MIKE CORDER and JILL LAWLESS",
      "description": "STOCKHOLM (AP) — Jon Fosse, a master of spare Nordic writing in a sprawling body of work ranging from plays to novels and children’s books, won the Nobel Prize in literature on Thursday for works that “give voice to the unsayable.”",
      "publishedAt": "2023-10-05T07:36:50Z",
      "title": "Jon Fosse, a Norwegian master of spare Nordic writing, wins the Nobel Prize in literature",
      "url": "https://apnews.com/ee1bd9e65cbce0d32026712f94a2ef3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a620d9e9af4496ba70acf9fcbaacd57/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "After a summer of record-smashing heat, warming somehow got even worse in September as Earth set a new mark for how far above normal temperatures were, the European climate agency reported Thursday.",
      "publishedAt": "2023-10-05T02:28:50Z",
      "title": "September sizzled to records and was so much warmer than average scientists call it 'mind-blowing'",
      "url": "https://apnews.com/1d80d23b98efd62d20b79f83619dfb82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1de26dd3d3430d953ef1751ad25e5f/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Mike Dulak grew up Catholic in Southern California, but by his teen years, he began skipping Mass and driving straight to the shore to play guitar, watch the waves and enjoy the beauty of the morning.",
      "publishedAt": "2023-10-05T04:02:02Z",
      "title": "America's nonreligious are a growing, diverse phenomenon. They really don't like organized religion",
      "url": "https://apnews.com/91bb8430280c88fd88530a7ad64b03f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f46603c99cb4e9e82d6dfbdab00dfca/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia targeted Ukraine with drones in another massive attack early Thursday as President Volodymyr Zelenskyy traveled to Spain to rally support from Western allies at a summit of some 50 European leaders.",
      "publishedAt": "2023-10-05T08:49:52Z",
      "title": "Russia launches more drone attacks as Ukrainian President Zelenskyy travels to a European forum",
      "url": "https://apnews.com/f7c320ed2908b447f32bf32ede8caf2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a426d9482c284ed3a4b438ae0af3ac7b/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER and TOM KRISHER",
      "description": "TOLEDO, Ohio (AP) — When Rhonda Naus got a job inspecting Jeep Wranglers fresh off the assembly line, her paycheck added up to roughly half of what her co-workers were making. But with that came an expectation that her temporary status eventually would become permanent with a big jump in wages.",
      "publishedAt": "2023-10-05T09:01:03Z",
      "title": "Auto worker strike highlights disparities between temporary and permanent employees",
      "url": "https://apnews.com/58cfc129b91b257b25c0a9254b2c44ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d491379ae5d471994d66a7465b82537/2000.jpeg"
    },
    {
      "author": "BECKY BOHRER",
      "description": "JUNEAU, Alaska (AP) — Nearly every Alaskan will receive a $1,312 check starting this week, their annual share from the earnings of the state’s nest-egg oil fund. Some use the money for extras like tropical vacations but others — particularly in high-cost rural Alaska where jobs and housing are limited — rely on it for home heating fuel or snow machines that are critical for transportation.",
      "publishedAt": "2023-10-05T04:16:07Z",
      "title": "Nearly every Alaskan gets a $1,312 oil check this fall. The unique benefit is a blessing and a curse",
      "url": "https://apnews.com/c512839da89902b06f39e87866733cf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af41ee1889814e82a6ea4164ff528d23/3000.jpeg"
    },
    {
      "author": "ELAINE GANLEY",
      "description": "PARIS (AP) — They creep, they crawl, they feast on your blood as you sleep. They may travel in your clothes or backpacks to find another person worth dining on — on the subway, or at the cinema. Bedbugs go where you go, and they have become a nightmare haunting France for weeks.",
      "publishedAt": "2023-10-05T04:58:16Z",
      "title": "Bedbugs are making France anxious ahead of the 2024 Summer Olympics",
      "url": "https://apnews.com/7ff56cbeed2cbe83e3f623b326a08892",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/137aec3cc6fb4f6b8ee5db892c6e46fb/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}