{
  "articles": [
    {
      "author": "Kate Payne, David Fischer",
      "description": "Florida State University has released an alert warning of an active shooter on the school's campus in Tallahassee. Officials say police are on scene or on the way. Students and faculty have been instructed to continue to seek shelter and await further instructions.",
      "publishedAt": "2025-04-17T16:26:44Z",
      "title": "Active shooter reported on Florida State campus in Tallahassee",
      "url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal appeals court says it is “shocking” that The Trump administration claims it can’t do anything to free Kilmar Abrego Garcia from an El Salvador prison and return him to the U.S. A three-judge panel from the 4th U.S. Circuit Court of Appeals on Thursday unanimously refused to suspend a judge’s decision to order sworn testimony by Trump administration officials to determine if they complied with her instruction to facilitate Abrego Garcia’s return.",
      "publishedAt": "2025-04-17T19:29:41Z",
      "title": "Appeals court calls Trump officials defiance over Abrego Garcia 'shocking'",
      "url": "https://apnews.com/article/abrego-garcia-trump-maryland-el-salvador-2090f0dd508bbc3d2f60845842af27b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/0aca7d1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F26%2F51840e5ed136828d2845c3974d63%2Fa76685c0ca494bb3be86899cd908c3e3"
    },
    {
      "author": "Mary Clare Jalonick, Yolanda Magaña",
      "description": "Maryland Sen. Chris Van Hollen says he was denied entry into the El Salvador prison where Kilmar Abrego Garcia is being held. Van Hollen is in El Salvador to push for Abrego Garcia’s release after he was sent there by the Trump administration in March despite an immigration court order preventing his deportation. He says in a video posted on X his car was stopped when he tried to enter the prison Thursday to check on Abrego Garcia’s health. Van Hollen says his car was stopped by soldiers about 3 kilometers from the prison, even as other cars were allowed to go on. Abrego Garcia is a a Salvadoran citizen who was living in Maryland when he was deported.",
      "publishedAt": "2025-04-16T17:06:04Z",
      "title": "Maryland's Van Hollen blocked from El Salvador prison holding Abrego Garcia",
      "url": "https://apnews.com/article/abrego-garcia-el-salvador-trump-deportation-van-hollen-senator-81cca0ac24a9a312be97c730679f8dd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/79dcf5b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F9c%2F8db43adb84c59152287941d07d94%2F6ed042bcaf774ada8a08a5e4d581f18b"
    },
    {
      "author": null,
      "description": "The Supreme Court is keeping a hold on President Donald Trump’s restrictions on birthright citizenship but will hear arguments on the issue in May. Trump’s executive order to end birthright citizenship for the children of people who are in the U.S. illegally has been halted nationwide by three district courts around the country. The Republican administration had sought to narrow those orders to allow for the policy to take effect in parts or most of the country. That is expected to be the focus of the high court arguments under the court's order Thursday.",
      "publishedAt": "2025-04-17T18:11:27Z",
      "title": "Supreme Court keeps hold on Trump’s restrictions on birthright citizenship but sets May arguments",
      "url": "https://apnews.com/article/supreme-court-birthright-citizenship-trump-6f0cb929c4604ec1d9bf9fea99765b61",
      "urlToImage": "https://dims.apnews.com/dims4/default/9922c2c/2147483647/strip/true/crop/4938x2778+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F7d%2Faf235ce8c74616cc72c29520a06e%2F7b46c2bb087040fba75928bb700be375"
    },
    {
      "author": "Megan Janetsky, Julie Watson",
      "description": "A U.S. man has been fatally shot after he hijacked a small passenger plane in Belize. That's according to officials in Belize and the U.S. After the plane carrying 14 passengers and two crew members landed safely on Thursday, police in Belize identified the man as Akinyela Taylor. Chester Williams, Belize police commissioner, said that Taylor wielded a knife and stabbed three people on the plane. The three were later taken to a hospital. A passenger licensed to carry firearms shot the hijacker. A U.S. Embassy spokesperson confirmed Taylor was a U.S. citizen but U.S. officials could not confirm a Belize commissioner's statement that he was a military veteran. The hijacker's motive was not immediately known.",
      "publishedAt": "2025-04-17T20:15:06Z",
      "title": "A US man hijacks a small plane in Belize and stabs people. He is fatally shot and plane lands safely",
      "url": "https://apnews.com/article/belize-plane-hijacked-passengers-injured-1c1aaba8db4fdf27f50b88fb61b073b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jaimie Ding, Andrew Dalton",
      "description": "Erik and Lyle Menendez’s bid for shorter sentences has been delayed again due to disputes among prosecutors and their lawyers. A Los Angeles judge said Thursday that discussions over the admissibility of the state parole board’s risk assessments will be considered during a new hearing on May 9. The brothers were sentenced in 1996 to life without parole for killing their parents in 1989. Defense attorneys argued they acted in self-defense after years of abuse. Prosecutors said they killed their parents for the inheritance. The resentencing hearing will focus on whether they have been rehabilitated and deserve a lesser sentence.",
      "publishedAt": "2025-04-17T04:01:49Z",
      "title": "The Menendez brothers' bid for a shorter sentence and possible parole is delayed again",
      "url": "https://apnews.com/article/menendez-brothers-resentencing-2fd1b7882fc828e4eaeff5b86c9b3705",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d48cd5/2147483647/strip/true/crop/3021x1699+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Ff0%2Ff2b5bcf51839043a224e191fe6f0%2F629a30e603174e2babe844e69011c2a5"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Luigi Mangione, the man accused of gunning down UnitedHealthcare CEO Brian Thompson outside a Manhattan hotel in December, has been indicted in a New York court on four charges including a count eligible for the death penalty. A grand jury returned the indictment on Thursday in Manhattan federal court. The charges include stalking, murder and a firearms count. It was not immediately clear when the 26-year-old Mangione will be arraigned. He faces separate federal and state murder charges for the killing. A message seeking comment on the indictment was left for a spokesperson for Mangione’s lawyers.",
      "publishedAt": "2025-04-17T22:34:43Z",
      "title": "UnitedHealthcare killing suspect Luigi Mangione indicted on death penalty-eligible charges",
      "url": "https://apnews.com/article/unitedhealthcare-ceo-killing-luigi-mangione-nyc-8783ef6526bf0d14c2507d278888db3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Maryclaire Dale, Mark Scolforo",
      "description": "The arsonist who broke into the Pennsylvania governor’s residence while Gov. Josh Shapiro and his family slept upstairs faced little resistance as he smashed windows, ignited Molotov cocktails and crawled inside. A security expert who is retired from the FBI wonders how that happened. State police who protect the governor have pledged to hire an outside firm to review the breach. And it has happened before around the world — at the White House, at Buckingham Palace and at the California home of former House Speaker Nancy Pelosi. Pennsylvania suspect Cody Balmer is being held without bail pending a competency evaluation.",
      "publishedAt": "2025-04-17T21:37:40Z",
      "title": "Pennsylvania intruder faced little resistance as Gov. Josh Shapiro and his family slept",
      "url": "https://apnews.com/article/pennsylvania-governor-shapiro-mansion-fire-security-cc51b9f913c82250abcdcda024780e2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ec3f91/2147483647/strip/true/crop/1500x844+0+78/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Ffa%2F98c3ede575624e42a9d199dfa2f2%2Fcc9369c5e17d4d78b61976d4caaab6d2"
    },
    {
      "author": "Colleen Barry",
      "description": "Italian Premier Giorgia Meloni will test her mettle as an EU facilitator when she meets with Donald Trump in the White House. The meeting on Thursday marks the first face-to-face between a European leader and the U.S. president since he announced, and then temporarily suspended, tariffs of 20% on European exports. Meloni is traveling in her role as Italy’s leader, but she has been in close contact with EU Commission President Ursula Von Der Leyen ahead of the trip. The 90-day pause on the retaliatory tariffs has raised some hopes for negotiation, and experts say that Meloni’s margins for progress are more in bringing clarity on Trump's goals than in outright concessions.",
      "publishedAt": "2025-04-17T04:05:04Z",
      "title": "Meloni will test her mettle as EU-US bridge when she meets Trump in Washington",
      "url": "https://apnews.com/article/trump-meloni-white-house-meeting-eu-us-tariffs-a524f386ad4fa628c17949043ecd91e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e1e97c/2147483647/strip/true/crop/5107x2873+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2Fcb%2F537e587414a97a4de41d5ce48197%2F16895e23eda0488f9a9d96bac87c661b"
    },
    {
      "author": "Annie Ma, Jocelyn Gecker, Collin Binkley",
      "description": "President Donald Trump's administration has escalated its ongoing battle with Harvard, threatening to revoke the university’s ability to host international students, who make up 27% of the campus. The threat emerged as the president called for withdrawing the school's tax-exempt status. The Department of Homeland Security ordered Harvard late Tuesday to turn over detailed records of the school's foreign student visa holders’ \"illegal and violent activities” by April 30. The move deepens the crackdown on Harvard. On Monday, it became the first university to openly defy the administration’s demands related to activism on campus, antisemitism and diversity. The federal government has already frozen more than $2 billion in grants and contracts to the Ivy League institution.",
      "publishedAt": "2025-04-17T14:17:43Z",
      "title": "Trump administration takes aim at Harvard's international students and tax-exempt status",
      "url": "https://apnews.com/article/trump-harvard-tax-exempt-status-international-students-07a10958bf078cb04b59d1fc9a3a27a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2a8acf/2147483647/strip/true/crop/4421x2487+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fca%2F084da462cbeccc78a71fee1f7f49%2F181b3421fdff42949b3e41adec48b0bb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}