{
  "articles": [
    {
      "author": "STEVE LeBLANC and NICK PERRY",
      "description": "The students at an encampment at Columbia University who inspired a wave of pro-Palestinian demonstrations across the country dug in for their 10th day Friday, as administrators and police at college campuses from California to Connecticut wrestle with how to address protests that have seen scuffles with police and hundreds of arrests.",
      "publishedAt": "2024-04-26T04:23:05Z",
      "title": "As some universities negotiate with pro-Palestinian protesters, others quickly call the police",
      "url": "https://apnews.com/e8a2e657e2614f94373beae602e9ba9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20b4525d96e64d64863a5236032ecf24/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Palestinian militant group Hamas has said for more than 15 years that it could accept a two-state compromise with Israel — at least, a temporary one.",
      "publishedAt": "2024-04-25T21:58:53Z",
      "title": "Hamas again raises the possibility of a 2-state compromise. Israel and its allies aren't convinced",
      "url": "https://apnews.com/f756cc054732eb3f7e0c49a9987560a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96420f8670d8421ab8dc45d272927e29/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — There was talk of drone strikes and presidential bribes, of a potential ruling “for the ages” and of the Founding Fathers, too. The presidential race went unmentioned but was not far from mind.",
      "publishedAt": "2024-04-25T20:45:42Z",
      "title": "Key moments from landmark Supreme Court arguments on Trump's immunity claims",
      "url": "https://apnews.com/4813fceb6bc8b0ea2f47bf9315bf7991",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4c084ed9cba41559eb42c574c864283/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — After prosecutors’ lead witness painted a tawdry portrait of “catch and kill” tabloid schemes, defense lawyers in Donald Trump’s hush money trial are poised Friday to dig into an account of the former publisher of the National Enquirer and his efforts to protect Trump from negative stories during the 2016 election.",
      "publishedAt": "2024-04-26T04:01:57Z",
      "title": "Trump's lawyers will grill ex-tabloid publisher as 1st week of hush money trial testimony wraps",
      "url": "https://apnews.com/868e6b9d30a039d5009ec6a9d7e96ff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c2aa946e57e41a2a82ccd9b8d746b62/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — #MeToo founder Tarana Burke has heard it before. Every time there’s a legal setback, the movement is declared dead in the water. A legal success, and presto, it’s alive again.So Burke, who nearly two decades ago coined the phrase “Me too” from her work with sexual assault survivors, found herself again declaring after New York's highest court on Thursday overturned Harvey Weinstein’s 2020 rape conviction: The #MeToo reckoning is greater than any court case.",
      "publishedAt": "2024-04-26T04:43:08Z",
      "title": "‘The movement will persist’: Advocates stress Weinstein reversal doesn’t derail #MeToo reckoning",
      "url": "https://apnews.com/8272c7113b53714c51cb54111cd01bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/144d5fea3d954a8d99e3d8815667fdbc/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Millions of Indians began voting Friday in the second round of multi-phase national elections as Prime Minister Narendra Modi sought to galvanize voters with his assertive brand of Hindu nationalist politics.",
      "publishedAt": "2024-04-26T03:46:31Z",
      "title": "India begins second phase of national elections with Modi's BJP as front-runner",
      "url": "https://apnews.com/ecebcccaaf32ad337e7360d9962c5cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc764b6465b04ded90cbe5131441294d/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. is expected to announce Friday that it will provide about $6 billion in long-term military aid to Ukraine, U.S. officials said, adding that it will include much sought after munitions for Patriot air defense systems.",
      "publishedAt": "2024-04-25T23:50:44Z",
      "title": "US expected to provide $6 billion to fund long-term weapons contracts for Ukraine, officials say",
      "url": "https://apnews.com/026fc8f9ee064ffb49bbee2422e2908b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f99f0daeaf44d7e9cbfffe8667d6086/744.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "BEIJING (AP) — The United States and China butted heads over a number of contentious bilateral, regional and global issues as U.S.",
      "publishedAt": "2024-04-26T02:23:16Z",
      "title": "US-China talks start with warnings about misunderstandings and miscalculations",
      "url": "https://apnews.com/8c1c453df3afbd6ec87ced0c8d618064",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01de4830edf7493a91544444471855d5/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "NEW YORK (AP) — Rooting for Donald Trump to fail has rarely been this profitable.Just ask a hardy band of mostly amateur Wall Street investors who have collectively made tens of millions of dollars over the past month by betting that the stock price of his social media business — Truth Social — will keep dropping despite massive buying by Trump loyalists and wild swings that often mirror the candidate’s latest polls, court trials and outbursts on Trump Social itself.",
      "publishedAt": "2024-04-26T04:05:59Z",
      "title": "Rooting for Trump to fail has made his stock shorters millions",
      "url": "https://apnews.com/986566b8b876cd5ddae909029fd410c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9bcb2af74734e129650daa8c36ee0f6/2553.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "DETROIT (AP) — Caleb Williams swiftly walked on stage, looked out and screamed “Woooo! Yeah!” Long-suffering Bears fans felt his joy.Williams is heading to the Windy City, aiming to become the franchise quarterback Chicago has sought for decades.",
      "publishedAt": "2024-04-26T00:20:16Z",
      "title": "Quarterbacks Williams, Daniels, Maye, Penix, McCarthy and Nix selected in top 12 of NFL draft",
      "url": "https://apnews.com/36120e9df01c0cdaebf0e621cfbd2a8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44e815103c134771b1b837f0322b8846/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}