{
  "articles": [
    {
      "author": "KIM TONG-HYUNG and CLAIRE GALOFARO",
      "description": "Yooree Kim marched into a police station in Paris and told an officer she wanted to report a crime. Forty years ago, she said, she was kidnapped from the other side of the world, and the French government endorsed it.",
      "publishedAt": "2024-09-20T04:32:58Z",
      "title": "Western nations were desperate for Korean babies. Now many adoptees believe they were stolen",
      "url": "https://apnews.com/67d6bb03fddede7dcca199c2e3cd486e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4039edc375df4db6a2c97298b2ec95b7/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders announced an agreement Sunday on a short-term spending bill that will fund federal agencies for about three months, averting a possible partial government shutdown when the new budget year begins Oct.",
      "publishedAt": "2024-09-22T21:12:35Z",
      "title": "Spending deal averts a possible federal shutdown and funds the government into December",
      "url": "https://apnews.com/d51de0cd895db687a6f5b35fc0dab13e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae6c212d82304e67bace5f33d2b0de9e/2479.jpeg"
    },
    {
      "author": "NATALIE MELZER and KAREEM CHEHAYEB",
      "description": "NAHARIYA, Israel (AP) — Hezbollah fired over 100 rockets early Sunday across northern Israel, with some landing near the city of Haifa, as Israel launched hundreds of strikes on Lebanon. A Hezbollah leader declared an “open-ended battle” was underway as both sides appeared to be spiraling closer toward all-out war.",
      "publishedAt": "2024-09-22T04:52:27Z",
      "title": "Hezbollah hits back with rockets as it declares an 'open-ended battle' with Israel",
      "url": "https://apnews.com/fb1aa8ae061885ba86855f7fe9ec5be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f754fcd4718e4086bb8397b655b5eccb/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Former President Donald Trump said on Sunday that he doesn't “think” he'd run again for president in 2028 if he falls short in his bid to return to the White House in 2024.",
      "publishedAt": "2024-09-22T20:45:30Z",
      "title": "Trump says, if he loses, 2024 run will be his last",
      "url": "https://apnews.com/da72e8e1b412e85c012343fa70db4640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8033c8d1e69472fa713df2582e3231d/3000.jpeg"
    },
    {
      "author": "HOLLY MEYER, PETER SMITH and AMELIA THOMSON-DEVEAUX",
      "description": "Vice President Kamala Harris is a Baptist who was influenced by religious traditions in her mother’s home country of India.",
      "publishedAt": "2024-09-22T12:14:20Z",
      "title": "Are Trump and Harris particularly Christian? That's not what most Americans would say: AP-NORC poll",
      "url": "https://apnews.com/badf15a55529afe5b7dd4a5bbdd2722e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca88093a30594222812b82906a211889/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON",
      "description": "RALEIGH, N.C. (AP) — Several top staffers in North Carolina Republican Lt. Gov. Mark Robinson's campaign for governor have quit their posts, marking more fallout from a CNN report outlining evidence that he made disturbing posts on a pornography website’s message board more than a decade ago.",
      "publishedAt": "2024-09-22T16:46:32Z",
      "title": "Several Mark Robinson campaign staffers quit as fallout over online posts continues",
      "url": "https://apnews.com/5fa5e739329bbabbc7cc0c9ed286ed23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/267f1610c103444c92021a81f67e7e70/3000.jpeg"
    },
    {
      "author": null,
      "description": "UNIONDALE, N.Y. (AP) — Indian Prime Minister Narendra Modi, continuing a multiday U.S. visit, addressed a cultural celebration on Long Island Sunday, where he praised the United States' return of nearly 300 antiquities to India and relayed news of his country's dual win at the Chess Olympiad in Budapest, Hungary, to an enthusiastic crowd.",
      "publishedAt": "2024-09-22T19:30:35Z",
      "title": "India Prime Minister's U.S. visit brings him to New York and celebration of cultural ties",
      "url": "https://apnews.com/1e3a2fd0d1a812d96351e6db7e5320e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe4e0c82275848dd9ffdcd7407f03d8a/2031.jpeg"
    },
    {
      "author": null,
      "description": "SACRAMENTO, Calif. (AP) — “Paper or plastic” will no longer be a choice at grocery store checkout lines in California under a new law signed Sunday by Gov. Gavin Newsom that bans all plastic shopping bags.",
      "publishedAt": "2024-09-22T20:13:11Z",
      "title": "California governor signs law banning all plastic shopping bags at grocery stores",
      "url": "https://apnews.com/406dedf02b416ad2bb302f498c3bce58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d8d093a98e144ffbda54440cb8690ee/3000.jpeg"
    },
    {
      "author": "BERNIE WILSON",
      "description": "SAN DIEGO (AP) — The Chicago White Sox tied the post-1900 MLB record of 120 losses by the 1962 expansion New York Mets on Sunday when the San Diego Padres won 4-2 by rallying for three runs in the eighth inning, capped by Fernando Tatis Jr.'s towering home run.",
      "publishedAt": "2024-09-22T22:40:17Z",
      "title": "White Sox lose 120th game to tie post-1900 record by the 1962 expansion New York Mets",
      "url": "https://apnews.com/f75492f07d79b6d3c71eca4ddf7d854f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a8135d47f3547c8b3d442167cf67fac/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — France has sent a group of special anti-riot police that's been banned for 65 years to the French Caribbean island of Martinique, where protesters have gathered despite the government barring demonstrations in parts of the island.",
      "publishedAt": "2024-09-22T16:59:50Z",
      "title": "Long-forbidden French anti-riot force sent to Martinique as thousands defy bans on protests",
      "url": "https://apnews.com/46fbdb23a02ebeb3e76cc1d632c53929",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2247b0e3ec7542af8d6db3ef70e6161f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}