{
  "articles": [
    {
      "author": "LOLITA C. BALDOR",
      "description": "PRAGUE (AP) — The head of NATO's military committee said Saturday that Ukraine has the solid legal and military right to strike deep inside Russia to gain combat advantage — reflecting the beliefs of a number of U.S.",
      "publishedAt": "2024-09-14T18:27:07Z",
      "title": "NATO military committee chair, others back Ukraine's use of long range weapons to hit Russia",
      "url": "https://apnews.com/d020f72aaa3abec8e5fa971f7123ffe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3accef889ce4b8399c81ef58c2bf73b/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — A long-range missile fired from Yemen landed in an open area in central Israel early Sunday, the Israeli military said.The early morning attack triggered air raid sirens, including at Israel's international airport, but there were no immediate reports of casualties or damage.",
      "publishedAt": "2024-09-15T05:27:10Z",
      "title": "Missile fired from Yemen lands in open area in central Israel and sets off air raid sirens",
      "url": "https://apnews.com/5f26be6628a0e7df38bc933520552f5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26435e0a631346e2879a26d7c722ef7e/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, MAKIYA SEMINERA and MATT BROWN",
      "description": "WASHINGTON (AP) — While President Joe Biden was hosting a celebration of Black excellence at the White House with lawmakers, advocates and celebrities this past week, Kamala Harris was instead headed off to campaign in Pennsylvania.",
      "publishedAt": "2024-09-14T15:44:17Z",
      "title": "Harris is promoting her resume and her goals rather than race as she courts Black voters",
      "url": "https://apnews.com/0544720c6bacaf0484259bdabe83239f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68c10089ca7d40559e63b27e8c5cc6a1/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Tropical Storm Ileana made landfall on the coast of the Mexican state of Sinaloa Saturday a day after it pounded the resort-studded Los Cabos.",
      "publishedAt": "2024-09-14T07:03:32Z",
      "title": "Tropical Storm Ileana makes landfall on Mexico's Sinaloa coast after pounding Los Cabos",
      "url": "https://apnews.com/970c4df9c396c98286a5abcb10b87ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadb6d16531f48ffb4d20f817976d3f5/3000.jpeg"
    },
    {
      "author": null,
      "description": "JEFFERSON, Ga. (AP) — Funeral services for a teenage boy remembered for his endearing smile and a math teacher known for her dedication to students were held Saturday, 10 days after both were killed by a gunman who opened fire at a Georgia high school.",
      "publishedAt": "2024-09-14T04:11:41Z",
      "title": "Funerals held for teen boy and math teacher killed in Georgia high school shooting",
      "url": "https://apnews.com/dec5f503746a5960f0e350596282be11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cff3dd25c3a440d8f742fb84abb27ea/3000.jpeg"
    },
    {
      "author": "MANUEL RUEDA",
      "description": "BOGOTA, Colombia (AP) — Three Americans, two Spaniards and a Czech citizen were arrested Saturday after Venezuelan officials accused them of coming to the South American country to assassinate President Nicolas Maduro.",
      "publishedAt": "2024-09-15T00:15:18Z",
      "title": "Venezuela says it arrested 6 foreigners allegedly involved in a plot to kill President Maduro",
      "url": "https://apnews.com/696768e00bf22f5747062a4a8b662fcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ca1d58086074a1181c01315a1b23a9a/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — It was the farthest trip of his pontificate and one of the longest papal trips ever in terms of days on the road and distance traveled.",
      "publishedAt": "2024-09-15T05:01:36Z",
      "title": "87 and hobbled, Pope Francis goes off-script in Asia and reminds world he can still draw a crowd",
      "url": "https://apnews.com/9e873fd69bf46a25f16a431a0fca6dcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e2a4d3c8bcb41d79be5222026f2c9c9/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and JOHN HANNA",
      "description": "PITTSBURG, Kan. (AP) — The Rev. Anthony Navaratnam stood before his congregation and urged them to pray for the women from surrounding states who will flock to the new abortion clinic in town that opened in August.",
      "publishedAt": "2024-09-15T04:04:16Z",
      "title": "How a small town in Kansas found itself at the center of abortion’s national moment",
      "url": "https://apnews.com/d239ee0566d719a44334e58da3b3356e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebd67109e63f4162bdcc26096a781186/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — “Shogun” could be in for an epic night, “The Bear” could clean up for the second time in less than a year, and “Baby Reindeer” has gone from dark horse to contender as the 76th Primetime Emmy Awards arrive on Sunday.",
      "publishedAt": "2024-09-15T04:04:30Z",
      "title": "'Shogun,' 'The Bear' and 'Baby Reindeer' are at the top of the queue as the Emmys arrive",
      "url": "https://apnews.com/8588922c128c775092509b70a599a6d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a30edfa02048ed8af55e3a7b3a1dc1/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KARACHI, Pakistan (AP) — Stained glass windows, a sweeping staircase and embellished interiors make Mohatta Palace a gem in Karachi, a Pakistani megacity of 20 million people. Peacocks roam the lawn and the sounds of construction and traffic melt away as visitors enter the grounds.",
      "publishedAt": "2024-09-15T04:47:50Z",
      "title": "Traces of this Pakistani megacity's past are vanishing, but one flamboyant pink palace endures",
      "url": "https://apnews.com/d6a8645e6bf7e87bbd94e6ccbf953235",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9f3ddc00ed54a0fb35683fac158c367/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}