{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's lawyers accused the star prosecution witness in his hush money trial of lying to jurors, portraying Trump fixer-turned-foe Michael Cohen on Thursday as a serial fabulist who is bent on seeing the presumptive Republican presidential nominee behind bars.",
      "publishedAt": "2024-05-16T04:01:37Z",
      "title": "Michael Cohen pressed on his crimes and lies as defense attacks key Trump hush money trial witness",
      "url": "https://apnews.com/ec08be1219703deb3cd10604844deacb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f98f09f70a204b189062cfc8a2efa45d/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — The White House on Thursday blocked the release of audio from President Joe Biden’s interview with a special counsel about his handling of classified documents, arguing that Republicans in Congress only wanted the recordings “to chop them up” and use them for political purposes.",
      "publishedAt": "2024-05-16T12:31:20Z",
      "title": "White House blocks release of Biden audio as Republicans move ahead with Garland contempt charge",
      "url": "https://apnews.com/edf67af3810ab877c7c195956b49b3a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9e14eceaf9f4850a240afe038f8cd5b/1920.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — Texas Gov. Greg Abbott issued a full pardon Thursday for a former U.S. Army sergeant convicted of murder for fatally shooting an armed demonstrator in 2020 during nationwide protests against police violence and racial injustice.",
      "publishedAt": "2024-05-16T19:43:08Z",
      "title": "Texas governor pardons ex-Army sergeant convicted of killing Black Lives Matter protester",
      "url": "https://apnews.com/4b1d0c54b0de451642bcf1e8cd75a7e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bddadc0e865b4c18abba6670d2feca64/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The Pentagon said Thursday that humanitarian aid will soon begin flowing onto the Gaza shore through the new pier that was anchored to the beach and will begin reaching those in need almost immediately.",
      "publishedAt": "2024-05-16T06:03:20Z",
      "title": "Aid for Gaza will soon flow from pier project just finished by US military, Pentagon says",
      "url": "https://apnews.com/9414c4148285917f1c858b9590117a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/475b1e85eed9410abddc2aa162533f22/2859.jpeg"
    },
    {
      "author": "STEPHEN GROVES and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — The House delivered a rebuke to President Joe Biden Thursday for pausing a shipment of bombs to Israel, passing legislation that seeks to force the weapons transfer as Republicans worked to highlight Democratic divisions over the Israel-Hamas war.",
      "publishedAt": "2024-05-16T15:58:09Z",
      "title": "House votes to require delivery of bombs to Israel in GOP-led rebuke of Biden policies",
      "url": "https://apnews.com/735c8d40c3ea9985c65f1b53cbf68fc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cbbfa77351f4591858c293e919955b9/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN and CURT ANDERSON",
      "description": "STONECREST, Ga. (AP) — A lawyer for the family of Roger Fortson said Thursday that police radio traffic and the body camera footage of the Florida sheriff’s deputy who killed the Black U.S. Air Force airman reinforce their assertion that the deputy was directed to the wrong apartment while responding to a domestic disturbance call that day.",
      "publishedAt": "2024-05-16T16:35:50Z",
      "title": "Lawyer for family of slain US Air Force airman says video and calls show deputy went to wrong home",
      "url": "https://apnews.com/0de65f5b5011ca98c447de5a78090ee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cebf789beb6b48be99a3f778fe9e7fe6/1920.jpeg"
    },
    {
      "author": "BELA SZANDELSZKY, PETR DAVID JOSEK and PHILIPP JENNE",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — Slovak authorities charged a man Thursday with attempting to assassinate Prime Minister Robert Fico, saying he acted alone in a politically motivated attack that left the longtime leader in serious but stable condition.",
      "publishedAt": "2024-05-16T07:05:22Z",
      "title": "Slovak authorities charge 'lone wolf' with assassination attempt on the prime minister",
      "url": "https://apnews.com/23faba11c0f371ef0f69a34861337ae0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10ee483690c74c00a52f6be1b533c8f0/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday rejected a conservative-led attack that could have undermined the Consumer Financial Protection Bureau.",
      "publishedAt": "2024-05-16T14:11:43Z",
      "title": "Supreme Court sides with the Consumer Financial Protection Bureau, spurning a conservative attack",
      "url": "https://apnews.com/9f30de9bbfa5b25a47804b101fb998e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/984cf3b04bf748b2bcb2346b7fb65e4e/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Justice Department on Thursday formally moved to reclassify marijuana as a less dangerous drug, a historic shift in generations of U.S.",
      "publishedAt": "2024-05-16T17:01:00Z",
      "title": "Justice Department formally moves to reclassify marijuana as a less dangerous drug in historic shift",
      "url": "https://apnews.com/15b43441670757b0c2bfa36731e47d07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2a02862f043435bbb5eb344ce548368/3000.jpeg"
    },
    {
      "author": "MARGIE MASON and ROBIN McDOWELL",
      "description": "PHOENIX (AP) — Blas Sanchez was nearing the end of a 20-year stretch in an Arizona prison when he was leased out to work at Hickman’s Family Farms, which sells eggs that have ended up in the supply chains of huge companies like McDonald’s, Target and Albertsons.",
      "publishedAt": "2024-05-16T10:06:09Z",
      "title": "US prisoners are being assigned dangerous jobs. But what happens if they are hurt or killed?",
      "url": "https://apnews.com/0ff52ff1735d7e9f858248177a2a60c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84b68eed3b4e4a9b83b2384356f55853/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}