{
  "articles": [
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Labour leader Keir Starmer officially became British prime minister on Friday hours after his Labour Party swept to power in a landslide victory after more than a decade in opposition.",
      "publishedAt": "2024-07-05T04:26:08Z",
      "title": "Starmer takes power as prime minister as UK Labour Party sweeps to power in historic election win",
      "url": "https://apnews.com/e94f379ea893ec17711fd82cec03b603",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6583719f49f7497797f1d27ab6a2b15b/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Labour leader Keir Starmer officially became prime minister of the United Kingdom on Friday.Starmer received the blessing of King Charles III to form a government in a ceremony known as the “kissing of hands.” A photo of the occasion served as the official announcement of Starmer’s new title.",
      "publishedAt": "2024-07-04T06:07:33Z",
      "title": "The Latest | Keir Starmer is officially the new UK prime minister",
      "url": "https://apnews.com/bcb7d9ae72243a069eedfb872010a201",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/244bcbeb13bc42568595829063a4afb1/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden on Thursday opened a critical stretch in his effort to salvage his imperiled reelection campaign, facing a growing sense that he may have just days to make a persuasive case that he is fit for office before Democratic support for him completely evaporates.",
      "publishedAt": "2024-07-04T16:46:23Z",
      "title": "Biden heads into a make-or-break stretch for his imperiled presidential campaign",
      "url": "https://apnews.com/8866379e91fdb1425bbd2eb5344655c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84595af96f2b45409d665f6235be80c8/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Former President Donald Trump said during his debate with President Joe Biden last week that the Jan.",
      "publishedAt": "2024-07-05T04:08:31Z",
      "title": "FACT FOCUS: Trump's misleading claims about the Jan. 6, 2021, attack on the Capitol",
      "url": "https://apnews.com/0b3406e02c86bd057e15c9d8c16ccd51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f59952696e74f33a52010cf190d1705/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — The indictment of former Brazilian President Jair Bolsonaro for money laundering and criminal association in connection with undeclared diamonds from Saudi Arabia marked the far-right leader’s second formal accusation with more potentially in store.",
      "publishedAt": "2024-07-05T04:10:14Z",
      "title": "Brazil's Bolsonaro indicted for alleged money laundering for undeclared diamonds from Saudi Arabia",
      "url": "https://apnews.com/feaf8be28c7c60cef518c688449cb6e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/453cdd332210416f8ffd44085cd760f2/2000.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Iranians voted Friday in a runoff presidential election between a hard-line former nuclear negotiator and a reformist lawmaker, with both men trying to convince a skeptical public to cast ballots after years of economic woes and mass protests roiling the Islamic Republic.",
      "publishedAt": "2024-07-05T04:30:46Z",
      "title": "Iran holds runoff presidential vote pitting hard-line former negotiator against reformist lawmaker",
      "url": "https://apnews.com/89bdb24e9074afaa9aa9b7556bf80983",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc44671c26104b62875ec5ef3871302d/1920.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — The Israeli military said Friday it was conducting counterterrorism activity that included an airstrike in the area of the West Bank city of Jenin. Palestinian authorities said five people were killed.",
      "publishedAt": "2024-07-05T07:57:05Z",
      "title": "Israel conducts military operation in the area of the West Bank city of Jenin; 5 Palestinians killed",
      "url": "https://apnews.com/d20ff57c3efe9ba8b783f9c5b5891c96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38027ce0b57a445d993524422ec05027/3000.jpeg"
    },
    {
      "author": "MARTÍN SILVA and JOHN MYERS JR.",
      "description": "TULUM, Mexico (AP) — Hurricane Beryl weakened slightly to a Category 2 storm as it headed for what could be a direct hit on Mexico's Caribbean coast resort of Tulum early Friday, where authorities urged tourists to leave white sand beaches.",
      "publishedAt": "2024-07-05T04:17:27Z",
      "title": "Hurricane Beryl takes aim at the Mexican resort of Tulum as a Category 2 storm",
      "url": "https://apnews.com/4b84e981f62bd53340a385fac42579f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fbace3055d8428b98830ee24d3ea2b4/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The American job market likely cooled last month while still remaining fundamentally healthy, which would be welcome news for the Federal Reserve in its drive to fully tame inflation.",
      "publishedAt": "2024-07-05T04:01:20Z",
      "title": "US jobs report for June is likely to point to slower but still-solid hiring",
      "url": "https://apnews.com/c99bb206d61a2fb2e96156460849d006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4e7580d5c6c4b9e9c0a21667f0cd395/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — After her son, the family’s shining light and only breadwinner, was arrested last year, Tambudzai Tembo went into meltdown. In Zimbabwe, where clinical mental health services are scarce, her chances of getting professional help were next to zero.",
      "publishedAt": "2024-07-05T05:41:14Z",
      "title": "A bench and a grandmother's ear: Zimbabwe’s novel mental health therapy spreads overseas",
      "url": "https://apnews.com/0a3611a7b800aa3628bd3abe53a131cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1576e16827f74ec2a13520d389bcd0f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}