{
  "articles": [
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — Republicans have won enough seats to control the U.S. House, completing the party’s sweep into power and securing their hold on U.S. government alongside President-elect Donald Trump.",
      "publishedAt": "2024-11-14T03:29:43Z",
      "title": "Republicans win 218 US House seats, giving Donald Trump and the party control of government",
      "url": "https://apnews.com/e3754a684a7b96b129841d4b207c15e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c073fb259654a16a0e7db29cd1fe68f/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON, JILL COLVIN and ZEKE MILLER",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump chose Rep. Matt Gaetz of Florida to serve as his attorney general on Wednesday, bypassing more experienced options in favor of a loyalist who has built a national reputation as a disruptor and whom Trump has tasked with dramatically overhauling the Justice Department.",
      "publishedAt": "2024-11-13T16:50:04Z",
      "title": "Trump picks Matt Gaetz for attorney general, Marco Rubio for secretary of state",
      "url": "https://apnews.com/0c65537ce9cd79194f1bcf60aad88f92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d299f174a5a8485bab1c0433827655cc/2739.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — President-elect Donald Trump’s pick for attorney general, Rep. Matt Gaetz of Florida, was once embroiled in a sex trafficking investigation by the Justice Department he's been tapped to lead, and has been under scrutiny by the House Ethics Committee over allegations including sexual misconduct.",
      "publishedAt": "2024-11-13T23:47:51Z",
      "title": "Matt Gaetz once faced a sex trafficking investigation by the Justice Department he could now lead",
      "url": "https://apnews.com/9d51501fb6ad5c04b5b4113d3a6a584b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b5a4afb069a4447ac7d1de16172b83e/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republicans have elected South Dakota Sen. John Thune as the next Senate majority leader, completing a momentous shift in their leadership that elevates a top deputy of Mitch McConnell into a key position as President-elect Donald Trump returns to the White House.",
      "publishedAt": "2024-11-13T05:08:41Z",
      "title": "Republican John Thune of South Dakota is elected the next Senate majority leader",
      "url": "https://apnews.com/c3c1c451a420729136ae641a14d9d5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4541e74f1d674248a8e636bd580c7fc2/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Donald Trump’s return to the White House has made many countries anxious and recalculating where they stand with the U.S., but India appears to be welcoming the change that may embolden nationalist leaders like Prime Minister Narendra Modi.",
      "publishedAt": "2024-11-14T02:14:46Z",
      "title": "India's Modi likely to find comfort in Trump's return and a shared worldview",
      "url": "https://apnews.com/a291df0d68d76d88da353e1e12ad1934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b612959df12942de905a82c41737e245/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike on a home in northern Gaza killed three siblings aged 6 and under, among at least six people killed in airstrikes in the war-ravaged territory, Palestinian medics said. In Lebanon, an Israeli airstrike on an apartment building south of Beirut on Wednesday killed at least six people and wounded 15, the Health Ministry said.",
      "publishedAt": "2024-11-13T09:54:03Z",
      "title": "Middle East latest: 3 young siblings killed in Gaza as Israeli strikes in Lebanon kill 6",
      "url": "https://apnews.com/2e7065731020a76e89b42643bdfcb9ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aab650940de4295be7b97ce0e94a8a2/1920.jpeg"
    },
    {
      "author": "FARAI MUTSAKA and MELINA WALLING",
      "description": "CHIPINGE, Zimbabwe (AP) — Gertrude Siduna appears to have little appetite for corn farming season.Rather than prepare her land in Zimbabwe’s arid southeastern Chipinge district for the crop that has fed her family for generations, the 49-year-old — bitter at repeated droughts that have decimated yields — turns her thoughts to the prices and farming techniques of chilies.",
      "publishedAt": "2024-11-14T05:01:43Z",
      "title": "Food aid interventions can curb climate change-induced hardship. But should they do more?",
      "url": "https://apnews.com/ba53edf6360211643ba9d8fa66793b61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25bdcad11cf1404293f5306efd7eb11e/3000.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS",
      "description": "COLOMBO, Sri Lanka (AP) — Sri Lankans are voting in a parliamentary election Thursday that is key for the country's new, Marxist-leaning president to consolidate his party's power and follow through on promises of economic recovery.",
      "publishedAt": "2024-11-14T01:33:05Z",
      "title": "Sri Lanka votes in a parliamentary election that's key for its new Marxist-leaning president",
      "url": "https://apnews.com/fde212f89fb237f2a623b792ec958a22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b79363fc59b4aa688adfce6189b083f/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MEXICO CITY (AP) — U.S. Ambassador Ken Salazar lashed out Wednesday at Mexico’s failure to accept aid in the fight against drug cartels, claiming the country “closed the doors” on security cooperation.",
      "publishedAt": "2024-11-13T23:53:25Z",
      "title": "US ambassador says Mexico 'closed the doors' on security cooperation and denies its violence problem",
      "url": "https://apnews.com/02e0c9a499e9605291f3ba5a2f9e6f4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19720b29aceb418a9d41c25263885a6a/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "OME, Japan (AP) — Deep in a dark warehouse the sake sleeps, stored in rows of giant tanks, each holding more than 10,000 liters (2,640 gallons) of the Japanese rice wine that is the product of brewing techniques dating back more than 1,000 years.",
      "publishedAt": "2024-11-14T03:25:17Z",
      "title": "Japan's sake brewers hope UNESCO heritage listing can boost rice wine's appeal",
      "url": "https://apnews.com/0416f613b0b43a34ab109d023a37906a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08520d726b08488284ae43a778d505c8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}