{
  "articles": [
    {
      "author": "MELANIE LIDMAN, SAM MEDNICK, WAFAA SHURAFA",
      "description": "The ceasefire announced between Israel and Hamas gives hope to families of hostages and war-weary Palestinians — but their nightmare is far from over. Families of the hostages do not know whether their loved ones are alive or dead, and many will have to wait for a subsequent phase of the agreement that has yet to be negotiated. In war-ravaged Gaza, many displaced Palestinians do not know if their homes are still standing. Thousands are still buried under rubble and dozens are missing after encounters with Israeli forces. Vast areas appear uninhabitable, and it could take decades to rebuild. In the tense leadup to the announcement of the deal, relatives of the hostages were afraid to get their hopes up and agonizing over the unknown.",
      "publishedAt": "2025-01-15T14:55:38Z",
      "title": "Families in Israel and Gaza awaited truce in agony",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-displaced-waiting-5a4fde9e5527b682dccb6466cb48ce83",
      "urlToImage": "https://dims.apnews.com/dims4/default/d258437/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F79%2F54ddd25e1ac4a32f6fe5c66fa723%2F4d3c837f50a74ea683919171a231b313"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Israel and Hamas agreed to a ceasefire deal to pause the devastating war in the Gaza Strip, the United States and Qatar said Wednesday.",
      "publishedAt": "2025-01-15T11:50:00Z",
      "title": "Live updates: Israel-Hamas ceasefire in Gaza is confirmed by the US and Qatar",
      "url": "https://apnews.com/live/israel-hamas-ceasefire-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/3640203/2147483647/strip/true/crop/4896x2754+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F1f%2Fb17353394048ad7dfd58e856f48a%2Fap25015706056455.jpg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Mediators say Israel and Hamas have agreed to a pause in fighting in Gaza and to begin releasing the hostages held there. If the ceasefire holds, it could eventually bring an end to the bloodiest and most destructive war ever fought between Israel and Hamas. The war transformed the wider region but leaves the decades-old Israeli-Palestinian conflict at the heart of the turmoil unresolved. While Israel struck major blows during the war, the “total victory” that Prime Minister Benjamin Netanyahu sought now appears elusive. Hamas has survived for now, although Gaza has been ruined. It's unclear now what will happen to the Palestinian territory.",
      "publishedAt": "2025-01-15T22:14:44Z",
      "title": "What does the ceasefire agreement mean for Israel, Hamas and the wider Middle East?",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-takeaways-5829d95a8a4179b1ce15e18b3d5b6c6f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed84aea/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F00%2F12f8ca3c09bef355f54b5224616c%2F1ea1629269cd48879f2976d4845f8430"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY, JOSEF FEDERMAN",
      "description": "Officials announced that Israel and Hamas agreed to a ceasefire deal to pause the devastating 15-month war in the Gaza Strip, raising the possibility of winding down the deadliest and most destructive fighting between the bitter enemies. The deal, coming after weeks of painstaking negotiations in the Qatari capital, promises the release of dozens of hostages held by Hamas in phases, the release of hundreds of Palestinian prisoners in Israel and would allow hundreds of thousands of displaced people in Gaza to return to what remains of their homes. It also would flood badly needed humanitarian aid into a devastated territory. Qatar's prime minister said the deal would go into effect on Sunday. Israel said final details still need ironing out.",
      "publishedAt": "2025-01-15T16:35:52Z",
      "title": "Officials tout a Gaza ceasefire deal and plan to free hostages. Israel says details still in flux",
      "url": "https://apnews.com/article/gaza-israel-hamas-ceasefire-334ecc4420fe3b6fce9f7a27ca886b65",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ac7b57/2147483647/strip/true/crop/8583x4828+0+447/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F3e%2F71a35200039fd5b1fb83759611f6%2F0903c1dd755f4de98c0880b249783fe0"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "The United Nations says it’s ready to ramp up the delivery of desperately needed humanitarian aid to Gaza after a ceasefire agreement and urged the removal of major security and political obstacles so it can reach all those in need. U.N. Secretary-General Antonio Guterres called Wednesday's announcement of a deal to pause the fighting “a critical first step.” He told reporters that the U.N.’s top priority must be to ease the tremendous suffering caused by the conflict triggered by Hamas’ Oct. 7, 2023, attacks in southern Israel. U.N. humanitarian chief Tom Fletcher said aid agencies have been mobilizing supplies in preparation for a ceasefire.",
      "publishedAt": "2025-01-16T01:33:02Z",
      "title": "UN says it's ready to ramp up delivery of desperately needed aid to Gaza",
      "url": "https://apnews.com/article/un-gaza-ceasefire-humanitarian-aid-palestinians-israel-cfb07cfde1e4f3c2f62537a12d2eb5a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a30bb2/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Ff3%2F377f8a076d97cbf2aaca3512f2c7%2Feb97bc961b2e4722bd0117497b385ee6"
    },
    {
      "author": "JAIMIE DING, JULIE WATSON, CHRISTOPHER WEBER",
      "description": "Firefighters have reported significant gains against the two massive wildfires burning around Los Angeles while also extinguishing smaller blazes set by arsonists. The progress was reported Wednesday as a final round of windy, flame-fanning weather moved through Southern California. With winds picking up again, much of the nation’s second-most populous metropolitan region was still on alert for new outbreaks and flareups from the fires that have killed at least 25 people and destroyed thousands of homes. Better conditions expected in the coming days should help fire crews make even more headway and allow residents to return to their neighborhoods to begin rebuilding.",
      "publishedAt": "2025-01-15T05:17:35Z",
      "title": "LA fires: Red flag warnings issued as millions in Southern California on edge",
      "url": "https://apnews.com/article/los-angeles-wildfires-southern-california-212389bfba69f39baaf72579f1644ddd",
      "urlToImage": "https://dims.apnews.com/dims4/default/098d893/2147483647/strip/true/crop/5888x3312+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2Fec%2Ff3b422e64cf87aef02b0c2a65c8f%2Fd39f48bbbcaa4a1b99698921192cd95e"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The Food and Drug Administration is ordering food and drug makers to remove a dye called Red 3 from the products U.S. consumers eat and drink. The colorant was banned from cosmetics and non-oral medications decades ago because a study showed it caused cancer when eaten by rats. But it kept appearing on the ingredient lists of popular snack foods and other grocery products because it remained approved for use until now. Consumer advocates monitor manufacturers that still include the additive, and companies often switch to less notorious alternatives. Shoppers should always check food labels to see if an item contains Red 3, which is also known as erythrosine and FD&C Red No. 3.",
      "publishedAt": "2025-01-16T00:03:25Z",
      "title": "What products contain Red 3 dye? Checking ingredient labels is the best way to find out",
      "url": "https://apnews.com/article/what-products-have-red-dye-3-2d8b05b641a0c1f9af833de1c48cd55d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2278dc0/2147483647/strip/true/crop/2100x1181+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F82%2F2145bdcac98d8c24dbff3fcdd5ca%2F8ae2b28f7dab436d8423efd5d4d54739"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "Lawyers representing South Korea’s impeached president say he will refuse further questioning after being detained by anti-corruption officials over his ill-fated declaration of martial law last month, maintaining that the investigation is illegal. President Yoon Suk Yeol exercised his right to remain silent as he underwent more than 10 hours of questioning on Wednesday at the headquarters of the Corruption Investigation Office for High-Ranking Officials, following a massive law enforcement operation to detain him at his official residence in Seoul. Investigators are expected to move to place him under arrest in the coming days.",
      "publishedAt": "2025-01-16T02:04:11Z",
      "title": "Lawyers of detained South Korean president say he will reject questioning by investigators",
      "url": "https://apnews.com/article/south-korea-yoon-detention-court-martial-law-354adfdf81ecb08ba2b850e77e4da888",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c9861d/2147483647/strip/true/crop/3254x1830+0+106/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F87%2Fd8d39339af6dc8fe2ae0b6321cdc%2F7b02d8db13ee4afbb441acb326a961d5"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER, COLLEEN LONG",
      "description": "President Joe Biden has used his farewell address to the nation to warn of an “oligarchy” of the ultra-wealthy taking root in the country and of a “tech-industrial complex” that is infringing on Americans’ rights and the future of democracy. Speaking Wednesday from the Oval Office as he prepares to hand over power to President-elect Donald Trump, Biden sounded alarm over the accumulation of power and wealth among a small few. Biden also called for a constitutional amendment to end immunity for sitting presidents, after the Supreme Court granted Trump sweeping protections last year from criminal liability over his role in trying to undermine his 2020 defeat to Biden.",
      "publishedAt": "2025-01-15T21:01:37Z",
      "title": "Biden farewell address: Watch live speech from Oval Office",
      "url": "https://apnews.com/article/joe-biden-farewell-address-oval-office-8bc6051c20adc1bc212cdd8be2578624",
      "urlToImage": "https://dims.apnews.com/dims4/default/3be01fc/2147483647/strip/true/crop/4199x2362+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Feb%2Fe5a5fdbed64f8ceef386e5db42ce%2F331f9b7de52841329f6f39462022f4f2"
    },
    {
      "author": "CHRIS MEGERIAN, COLLEEN LONG",
      "description": "President Joe Biden offered up a few surprises in his farewell address. Instead of simply summing up his term in office, he warned Wednesday about the increasing influence of the ultrawealthy, criticized disinformation on social media and called for continuing the fight against climate change. Biden also said there should be a constitutional amendment to ensure presidents aren't immune for crimes they commit while in office. It was likely the last major speech of a political career spanning more than five decades. Biden's term ends Monday, when he'll be replaced by Donald Trump.",
      "publishedAt": "2025-01-16T02:44:46Z",
      "title": "Five things to know about Biden's farewell address that also served as a warning to the country",
      "url": "https://apnews.com/article/joe-biden-farewell-address-8831dd4b82637ca50ca097dc226d8e20",
      "urlToImage": "https://dims.apnews.com/dims4/default/56babd0/2147483647/strip/true/crop/4480x2520+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F5a%2F045c2ef59531bd24ae4e5a6a14d4%2Fef33b20e88824e5ea2adb291d2bdc6fc"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}