{
  "articles": [
    {
      "author": "JULIE WATSON, MEGAN JANETSKY",
      "description": "The Trump administration has ended use of the border app called CBP One that allowed nearly 1 million people to legally enter the United States. Shortly after Donald Trump's swearing-in, messages told migrants waiting in Mexico that their appointments were canceled. The reverberations of CBP One's sudden end sent shock waves across Mexico. Hope and excitement evaporated into feelings of despair and disbelief for migrants who pulled suitcases crammed with clothing and stuffed animals to occupy their children. Tears ran down her cheeks of a Colombian woman who said, “We don't know what we are going to do.”",
      "publishedAt": "2025-01-21T00:13:24Z",
      "title": "Migrants stranded when thousands of appointments to enter the US are canceled as Trump takes office",
      "url": "https://apnews.com/article/trump-immigration-cbp-one-border-app-652854b5f2a4e6ccd6ee2ccc729cbb55",
      "urlToImage": "https://dims.apnews.com/dims4/default/6939a51/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F95%2Fd6c76f9fb9e22438da6a5960bbfb%2F09a0784a96964ab8b1a7657ae5682ef8"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate has passed a bill that would require federal authorities to detain migrants accused of theft and violent crimes. It's the first measure that President Donald Trump likely will sign into law and gives more weight to his plans to deport millions of migrants. Trump has made a broad crackdown on illegal immigration his top priority. And Congress, with Republicans in control and some Democrats willing to go along, is showing it's ready to follow suit. The Laken Riley Act is named after a Georgia nursing student whose murder by a Venezuelan man last year became a rallying cry for Trump’s White House campaign.",
      "publishedAt": "2025-01-20T23:37:23Z",
      "title": "Senate passes immigrant detention bill that could be the first measure Trump signs into law",
      "url": "https://apnews.com/article/congress-immigration-laken-riley-trump-4011a282775d58d509d953a9830aa367",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b5d210/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F03%2Fb52361995e9edd257612a8128c37%2F5e095d80fdfc4b95b6e7c897e13c3833"
    },
    {
      "author": "GISELA SALOMON, SOPHIA TAREEN",
      "description": "For millions in the U.S. illegally or with temporary legal status, the start of Donald Trump’s second term as president comes with a feeling their time in the U.S. may end soon. Trump made mass deportations a signature issue of his campaign and has promised a raft of orders to remake immigration policy when he takes office Monday. Plans for deportation arrests appear to be in flux after news leaked of an operation in Chicago this week. Trump’s “border czar” Tom Homan said on Fox News Sunday that Chicago was not off the table, but officials were reconsidering when and how to conduct enforcement. So-called sanctuary cities such as Chicago, which limit how local police cooperate with federal immigration authorities, have been a favorite Trump target.",
      "publishedAt": "2025-01-20T05:23:58Z",
      "title": "As Trump returns to the White House, families prepare for mass deportations",
      "url": "https://apnews.com/article/trump-deportation-immigration-homan-asylum-inauguration-ac10480dc636b758ab3c435b974aeb19",
      "urlToImage": "https://dims.apnews.com/dims4/default/371c6b7/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F54%2F32d72acb57b1059cde5885752880%2Fa064e4d4571f465daa90f052618d710a"
    },
    {
      "author": "SAMY MAGDY, JOSEPH KRAUSS",
      "description": "As a ceasefire brought calm to Gaza’s ruined cities, Hamas was quick to emerge from hiding. The militant group has not only survived Israel’s 15-month military campaign — among the deadliest and most destructive in recent memory — but it remains firmly in control of the coastal territory that now resembles an apocalyptic wasteland. For all the might it deployed in Gaza, Israel failed to remove Hamas from power, one of its central war aims. That makes a return to fighting more likely, but the results might be the same.",
      "publishedAt": "2025-01-20T16:46:40Z",
      "title": "Hamas still rules over what remains of Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-militants-rule-93da074c251d0fcaa395503749e2849e",
      "urlToImage": "https://dims.apnews.com/dims4/default/343cfee/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fb8%2Ff9471cfcbac6a18214bdb2a8539d%2F6ef73c50f2434c91b221a091c1100383"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "Residents across the country from the Northern Plains to the tip of Maine are bracing for dangerously low temperatures as residents along the East Coast contend with a thick blanket of snow — and more snowfall in the forecast. Winter storm warnings are in effect for parts of the Mid-Atlantic and New England. Heavy lake-effect snow is expected in western New York state Monday through Wednesday morning. Meanwhile, an area from the Rockies into the Northern Plains is expected to see temperatures drop unusually low, up to minus 55 degrees Fahrenheit. Sub-zero wind chills are forecast to reach as far south as Oklahoma and the Tennessee Valley.",
      "publishedAt": "2025-01-20T05:17:07Z",
      "title": "Millions across the US brace for plummeting temperatures and winter storms",
      "url": "https://apnews.com/article/extreme-cold-winter-storm-snow-5840ab2626b23dba983bbac7c00390d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b453a5/2147483647/strip/true/crop/3568x2007+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F46%2F7d2d0b9b28ee8f3b7b0d3b57804e%2F4261278bbf3a45a6b31fb25cce1952c5"
    },
    {
      "author": null,
      "description": "Authorities say a U.S. Border Patrol agent has been fatally shot in northern Vermont. The acting secretary of the Department of Homeland Security said in a statement that the agent was killed Monday in the line of duty. The FBI said a suspect was killed and a second suspect was taken into custody. Vermont State Police said the shooting happened in the afternoon on Interstate 91 in Coventry. A portion of the highway was closed in both directions for about two hours after the shooting. Coventry is close to the U.S. Customs and Border Protection’s Newport Station.",
      "publishedAt": "2025-01-20T22:37:20Z",
      "title": "Authorities say a US border patrol agent was fatally shot in Vermont south of border",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-0c9dfc32ac99d0527c008dfee4a34ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb68bc4/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fdb%2F3620ba0cd407798da34d7efc0c21%2Fa74b822c235d4e9a8056e6ff51da7826"
    },
    {
      "author": "ZEKE MILLER, CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "Donald Trump has been sworn in as the 47th president, returning to power with a promise to end America’s decline and to “completely and totally reverse” the actions of the man who drove him from office four years ago. Trump overcame impeachments, criminal indictments and a pair of assassination attempts to win another term in the White House. He planned to act swiftly after the ceremony. Dozens of executive orders have already been prepared for his signature to clamp down on border crossings, increase fossil fuel development and end diversity and inclusion programs across the federal government.",
      "publishedAt": "2025-01-20T05:06:30Z",
      "title": "Trump returns to power after unprecedented comeback, emboldened to reshape American institutions",
      "url": "https://apnews.com/article/donald-trump-inauguration-swearing-capitol-b3549ebe5dae74a872502aa79def7a11",
      "urlToImage": "https://dims.apnews.com/dims4/default/4cc5770/2147483647/strip/true/crop/7040x3960+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Ff4%2F31edaaa5df5a909805ab0ce9e95e%2Fca28e9cb0d534b5b9d1b20c8f0ab7269"
    },
    {
      "author": "ALANNA DURKIN RICHER, MICHAEL KUNZELMAN",
      "description": "President Donald Trump says he is pardoning about 1,500 of his supporters who have been charged in the Jan. 6, 2021, U.S. Capitol attack, using his sweeping clemency powers on his first day back in office to dismantle the largest investigation and prosecution in Justice Department history. The pardons were expected after Trump’s yearslong campaign to rewrite the history of the Jan. 6 attack that left more than 100 police officers injured and threatened the peaceful transfer of power. Trump says he is also commuting the sentences of six defendants, though the White House did not immediately provide further details.",
      "publishedAt": "2025-01-21T00:57:15Z",
      "title": "Trump issues sweeping pardon of supporters charged in the Jan. 6, 2021, Capitol attack",
      "url": "https://apnews.com/article/capitol-jan-6-pardons-trump-justice-department-8ce8b2a8f8cb602d5eaf85ac7b969606",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec3e980/2147483647/strip/true/crop/5440x3060+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F3c%2F5f80623162b2ef0bd648e5f064c1%2F524a7057f98e4b028d0d68cb974b7f0b"
    },
    {
      "author": "LISA MASCARO",
      "description": "The Senate has confirmed Marco Rubio as secretary of state, giving President Donald Trump the first member of his Cabinet. The vote was unanimous. Senators went back to work Monday night in the Capitol after Trump's inauguration. Rubio is among the least controversial of Trump’s nominees. Action on other Trump Cabinet picks, including former combat veteran and Fox News host Pete Hegseth for defense secretary, is expected later in the week. It's typical for the Senate to confirm some of a new president's top Cabinet positions on Inauguration Day.",
      "publishedAt": "2025-01-20T22:41:22Z",
      "title": "Senators are already working to confirm Trump's first Cabinet nominees",
      "url": "https://apnews.com/article/trump-cabinet-marco-rubio-secretary-of-state-nominee-39c378e19d0327a7f091f302daf8ca3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7b100d/2147483647/strip/true/crop/3356x1888+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F04%2Fda31fdc1eed20101bdc086cd2ab6%2F9c8876011e0442a2a95dee8dbd38234c"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER",
      "description": "Dr. Anthony Fauci and retired Gen. Mark Milley say they appreciate their pardons from President Joe Biden. The Democratic president on Monday pardoned Milley, Fauci and members of the House committee that investigated the Jan. 6 attack on the Capitol, using the extraordinary powers of his office in his final hours to guard against potential “revenge” by the incoming Republican Trump administration. Donald Trump has warned of an enemies list filled with those who’ve crossed him politically or sought to hold him accountable for his attempt to overturn his 2020 election loss and his role in the storming of the Capitol on Jan. 6, 2021. Fauci spoke to ABC.",
      "publishedAt": "2025-01-20T12:13:18Z",
      "title": "Biden pardons Fauci, Milley, and members of the Jan. 6 committee",
      "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747",
      "urlToImage": "https://dims.apnews.com/dims4/default/92e0ad2/2147483647/strip/true/crop/5647x3176+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fa8%2F654c69a432ed6eb6cfebe318e280%2Ffcf24b94e060459ea4889bcaea1b6082"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}