{
  "articles": [
    {
      "author": "WAFAA SHURAFA and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across the Gaza Strip overnight and into Sunday killed at least 22 people, including five children, Palestinian medical officials said, while Gaza's small Christian community celebrated a pre-Christmas Mass.",
      "publishedAt": "2024-12-22T08:38:02Z",
      "title": "Israeli strikes in Gaza kill at least 22 as Vatican envoy visits Christians for pre-Christmas Mass",
      "url": "https://apnews.com/6638c448bcc5780d98c3e8284ce58fe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5834e40f0e1445578178d3290157a266/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and FATMA KHALED",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Winter is hitting the Gaza Strip and many of the nearly 2 million Palestinians displaced by the devastating 14-month war with Israel are struggling to protect themselves from the wind, cold and rain.",
      "publishedAt": "2024-12-22T05:03:45Z",
      "title": "Winter is hitting Gaza and many Palestinians have little protection from the cold",
      "url": "https://apnews.com/24fe23c8ae2743294c169cff4a1431d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5af5af4bff5e44f9af6d524c3163518e/1920.jpeg"
    },
    {
      "author": "BILL BARROW and WILL WEISSERT",
      "description": "PHOENIX (AP) — Donald Trump suggested Sunday that his new administration could try to regain control of the Panama Canal that the United States “foolishly” ceded to its Central American ally, contending that shippers are charged “ridiculous” fees to pass through the vital transportation channel linking the Atlantic and Pacific Oceans.",
      "publishedAt": "2024-12-22T20:24:28Z",
      "title": "Trump threatens to try to take back the Panama Canal. Panama's president balks at the suggestion",
      "url": "https://apnews.com/97cba0d41f043dd9f156dc8355ee3f44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/457c0b4eae654e329aa350b7bb3f7cfa/3000.jpeg"
    },
    {
      "author": null,
      "description": "MAGDEBURG, Germany (AP) — Four women and a 9-year-old boy were killed and 200 people were injured when a man drove into a Christmas market teeming with holiday shoppers in the German city of Magdeburg — an attack that has left Germans mourning the victims and with a shaken sense of security.",
      "publishedAt": "2024-12-21T18:00:47Z",
      "title": "What we know about the deadly Christmas market attack in Germany",
      "url": "https://apnews.com/c28c6ed42c7d1692798a28d2aba47514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fbf0323d10349cbb7454ff6e9ee8de7/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "QARDAHA, Syria (AP) — On the walls of the palatial mausoleum built to house the remains of former Syrian President Hafez Assad, vandals have sprayed variations of the phrase, “Damn your soul, Hafez.”",
      "publishedAt": "2024-12-22T05:04:54Z",
      "title": "In Assad's hometown, few shared in his family's fortune. They hope they won't share in his downfall",
      "url": "https://apnews.com/cbeb4ab8d5bf4bacc75fb9792bb4cd14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09ffd4810ddf41108f74d4ddec5e3098/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin on Sunday hosted Slovakia’s prime minister, Robert Fico, in a rare visit to the Kremlin by an EU leader since Moscow's all-out invasion of Ukraine in February 2022.",
      "publishedAt": "2024-12-22T16:56:49Z",
      "title": "Russia's Putin holds talks with Slovakian PM Fico, in a rare visit to Moscow by an EU leader",
      "url": "https://apnews.com/45e08385f245bff9df02d6b533561598",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9d06eebede49ac9f5948fac1c95bd5/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, STEPHEN GROVES, JILL COLVIN and JOSH BOAK",
      "description": "WASHINGTON (AP) — After days of threats and demands, Donald Trump had little to show for it once lawmakers passed a budget deal in the early hours of Saturday, narrowly averting a pre-Christmas government shutdown.",
      "publishedAt": "2024-12-21T20:38:59Z",
      "title": "What Trump's decision to wade into spending fight tells us about the next 4 years",
      "url": "https://apnews.com/e0258d31a9018c7af09afc11a8634707",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57511b8ab4a478ca4171ec71e155388/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and THOMAS ADAMSON",
      "description": "MAMOUDZOU, Mayotte (AP) — When Cyclone Chido ravaged Mayotte’s fragile infrastructure, it also exposed deep-seated tensions between the island’s residents and its large migrant population.",
      "publishedAt": "2024-12-22T12:48:46Z",
      "title": "Destructive Cyclone Chido unearths a rift between locals and migrants in France's Mayotte",
      "url": "https://apnews.com/c30253c3672e8719a1ba9135485b2495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e63101512f534b9eb6ba85290724e562/1920.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — A NASA spacecraft aims to fly closer to the sun than any object sent before. The Parker Solar Probe was launched in 2018 to get a close-up look at the sun.",
      "publishedAt": "2024-12-22T14:00:16Z",
      "title": "NASA's Parker Solar Probe aims to fly closer to the sun like never before",
      "url": "https://apnews.com/69c7041048c12b0741ff54a66118def7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c693c050e8e4dd79d751a33bb481e53/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and BARARA ORTUTAY",
      "description": "Bluesky has seen its user base soar since the U.S. presidential election, boosted by people seeking refuge from Elon Musk's X, which they view as increasingly leaning too far to the right given its owner's support of President-elect Donald Trump, or wanting an alternative to Meta's Threads and its algorithms.",
      "publishedAt": "2024-12-22T12:36:04Z",
      "title": "Bluesky finds with growth comes growing pains — and bots",
      "url": "https://apnews.com/ce9df3b9166ec1ba36f3d5278ff60dcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf85bd0d48b542ca95df2c066f6a1261/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}