{
  "articles": [
    {
      "author": "TOM KRISHER and DAVID KOENIG",
      "description": "DETROIT (AP) — The United Auto Workers union says it will go on strike at three vehicle assembly plants as it presses Detroit companies to come up with better wage and benefit offers.The factories include a General Motors assembly plant in Wentzville, Missouri; a Ford factory in Wayne, Michigan, near Detroit; and a Stellantis Jeep plant in Toledo, Ohio.",
      "publishedAt": "2023-09-12T23:27:12Z",
      "title": "UAW poised for midnight strike at plants in Wayne, Michigan, Toledo, Ohio, and Wentzville, Missouri",
      "url": "https://apnews.com/a0b4b8b66e2001230fda0f2114ef78a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b873033a4e947fcb2a2aa29b6d6c57e/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden was indicted Thursday on federal firearms charges, the latest step in a long-running investigation into the president's son that puts the case on track toward a possible high-stakes trial as the 2024 election looms.",
      "publishedAt": "2023-09-14T17:36:21Z",
      "title": "Hunter Biden is indicted on federal firearm-purchasing charges after plea deal fails",
      "url": "https://apnews.com/e5c8ded90ea8c22d2e2e7cb09804b747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4306b7c97b084d409fea6448d4a1240f/2160.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and EMMA BURROWS",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un arrived Friday in Komsomolsk-on-Amur in far eastern Russia and is expected to visit a plant that builds fighter jets as South Korea has said it’s concerned his visit is focused on expanding military cooperation in a possible arms-for-technology deal.",
      "publishedAt": "2023-09-14T07:30:09Z",
      "title": "Kim Jong Un arrives in Russian city of Komsomolsk-on-Amur for expected visit to fighter jet plant",
      "url": "https://apnews.com/20aedd047c7112eeff2b8c77c7aa5e55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ef8c0c26f3c4a3b954a64ae81f853b9/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and MATTHEW LEE",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy is expected at the White House and on Capitol Hill next week as he visits the U.S. during the United Nations General Assembly.",
      "publishedAt": "2023-09-14T21:59:28Z",
      "title": "Zelenskyy is expected to visit Washington as Congress is debating $24 billion in aid for Ukraine",
      "url": "https://apnews.com/8690dc44d00aa297c75cf514aeb5c63b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2812b7bd184a4453b84bddf664000e42/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "New England is known for its fickle weather, powerful nor'easters and blizzards. Destructive hurricanes, however, are relatively rare and typically don't pack the same punch as tropical cyclones that hit the Southeast.",
      "publishedAt": "2023-09-14T20:03:57Z",
      "title": "How hard will Hurricane Lee hit New England? The cold North Atlantic may decide that",
      "url": "https://apnews.com/4be9fed47adbf17e9d1f5a2224d35528",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9681ffad354c49ea98d6a47440863079/2998.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Angry, frustrated and unable to lead a fractured and unruly Republican majority, House Speaker Kevin McCarthy on Thursday told the colleagues threatening to oust him: Do it.",
      "publishedAt": "2023-09-14T15:57:16Z",
      "title": "Angry and frustrated, McCarthy challenges right-flank colleagues to try to oust him from his post",
      "url": "https://apnews.com/3ec12e37d00004b1e84b3d3db3237863",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d04a0bec406841688e025ed74558d312/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and EMILY SWANSON",
      "description": "WASHINGTON (AP) — About half of Americans say they have little or no confidence that the Justice Department is handling its investigation into Hunter Biden in a fair and nonpartisan way, and 1 in 3 are highly concerned about whether President Joe Biden may have committed wrongdoing related to his son’s business dealings, according to a new poll.",
      "publishedAt": "2023-09-14T17:06:32Z",
      "title": "Americans sharply divided over whether Biden acted wrongly in son's businesses, AP-NORC poll shows",
      "url": "https://apnews.com/39a0268a3e2d4a0df1bed285d769b74a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/094bf8b07a0846d397be7dee23df736a/1671.jpeg"
    },
    {
      "author": null,
      "description": "DERNA, Libya (AP) — The death toll in Libya's coastal city of Derna has soared to 11,300 as search efforts continue following a massive flood fed by the breaching of two dams in heavy rains, the Libyan Red Crescent said Thursday.",
      "publishedAt": "2023-09-14T08:07:24Z",
      "title": "Flooding death toll soars to 11,300 in Libya's coastal city of Derna, aid group says",
      "url": "https://apnews.com/21b1a195d261a642e12dac13f0d19431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce2eaefb7ba4ad6bc7faf142e5e3c71/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD and SHELBY LUM",
      "description": "NEW YORK (AP) — Dozens of doctors and nurses silently lined the hospital hallway in tribute: For a history-making two months, a pig’s kidney worked normally inside the brain-dead man on the gurney rolling past them.",
      "publishedAt": "2023-09-14T14:28:51Z",
      "title": "Pig kidney works a record 2 months in donated body, raising hope for animal-human transplants",
      "url": "https://apnews.com/83dfb5e6d022ca72039a821cc6bc00ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fdf11a0055c4cc389404851fc21d8cf/1571.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA said Thursday that the study of UFOs will require new scientific techniques, including advanced satellites as well as a shift in how unidentified flying objects are perceived.",
      "publishedAt": "2023-09-14T09:00:17Z",
      "title": "NASA says more science and less stigma are needed to understand UFOs",
      "url": "https://apnews.com/8b477a5ed6a42f99bb13a4518368ce9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eed2f7996ba74ba6bb17b218d2a8fc6e/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}