{
  "articles": [
    {
      "author": "JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "AUSTIN, Texas (AP) — Donald Trump tried Friday to turn a major celebratory event for Kamala Harris into an attack line tied to one of his favorite subjects, immigration.",
      "publishedAt": "2024-10-25T14:26:27Z",
      "title": "Trump visits Texas to tape Joe Rogan's podcast and to criticize Harris on immigration",
      "url": "https://apnews.com/7ed6b971a86c69ed4344205ab2db668b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/658cb1dbb98d4e26ae7fd4397e066aaa/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — This year's presidential election could come down to microscopic margins, so Kamala Harris is hunting for votes in even the most unlikely of places.",
      "publishedAt": "2024-10-25T14:55:23Z",
      "title": "In a tight election where every vote counts, Harris is trying to squeeze a few out of Trump's base",
      "url": "https://apnews.com/60fe6c335dc6ce8367b7d9ae7be573f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfb69cb5557642b9bc684586de89ba3a/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ZEKE MILLER and MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — Chinese hackers engaged in a broader espionage operation targeted cellphones used by Republican presidential nominee Donald Trump, his running mate, JD Vance, and people associated with the Democratic campaign of Kamala Harris, people familiar with the matter said Friday.",
      "publishedAt": "2024-10-25T20:13:59Z",
      "title": "AP sources: Chinese hackers targeted phones of Trump, Vance, people associated with Harris campaign",
      "url": "https://apnews.com/d085787db764d46922a944b50e239e4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3769775ef0b46dfae392b9a1fd1f29f/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes on residential areas in southern Gaza killed 38 people on Friday, including 13 children from the same extended family, Palestinian health officials said.",
      "publishedAt": "2024-10-25T04:31:36Z",
      "title": "Israel raids a Gaza hospital and its strike on a home kills 13 children",
      "url": "https://apnews.com/0920f63542d158ad5999c481e421da00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96b605aa890f4310abfaa2648ea3c596/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "CENTRAL ISLIP, N.Y. (AP) — The former longtime CEO of Abercrombie &amp; Fitch pleaded not guilty Friday to federal sex trafficking and interstate prostitution charges.",
      "publishedAt": "2024-10-25T04:34:00Z",
      "title": "Former Abercrombie & Fitch CEO pleads not guilty to sex trafficking and prostitution charges",
      "url": "https://apnews.com/c23731581f7a836ca02b431b55055ca8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d49accd83793484d95b276ca0f09fd52/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "LAVEEN VILLAGE, Ariz. (AP) — President Joe Biden on Friday formally apologized to Native Americans for the “sin” of a government-run boarding school system that for decades forcibly separated children from their parents, calling it a “blot on American history” in his first presidential visit to Indian Country.",
      "publishedAt": "2024-10-25T04:13:40Z",
      "title": "Biden visits Indian Country and apologizes for the 'sin' of a 150-year boarding school policy",
      "url": "https://apnews.com/0ac697174d60f8481924a09cbc0c6d51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25b4c82a4b24495da282dc36b98b0738/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "Less than two weeks before Election Day, The Washington Post said Friday it would not endorse a candidate for president in this year's tightly contested race and would avoid doing so in the future — a decision immediately condemned by a former executive editor but one that the current publisher insisted was “consistent with the values the Post has always stood for.”",
      "publishedAt": "2024-10-25T19:20:25Z",
      "title": "Washington Post becomes second major US newspaper this week to not endorse a presidential candidate",
      "url": "https://apnews.com/51de8348502aa17f432504c4764c63f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/360740f8b78c44eab40546e6b5e3430d/3000.jpeg"
    },
    {
      "author": "JOHN ROGERS",
      "description": "LOS ANGELES (AP) — Phil Lesh, a classically trained violinist and jazz trumpeter who found his true calling reinventing the role of rock bass guitar as a founding member of the Grateful Dead, died Friday at age 84.",
      "publishedAt": "2024-10-25T20:10:37Z",
      "title": "Phil Lesh, founding member of Grateful Dead and influential bassist, dies at 84",
      "url": "https://apnews.com/491f2ca2727f4b16be0cca033a7b1b6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1ab64af42b143e28854401331cf3a38/747.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A deadly outbreak of E. coli poisoning tied to McDonald's Quarter Pounders has expanded, with at least 75 people sick in 13 states, federal health officials said Friday.",
      "publishedAt": "2024-10-25T15:50:07Z",
      "title": "At least 75 people are sickened as the deadly McDonald's E. coli outbreak expands",
      "url": "https://apnews.com/a1ec3dc14636f5e713b15b32aedcd524",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46e43a2a98734f9dab2a57e13a7b6488/1920.jpeg"
    },
    {
      "author": "HAL BOCK",
      "description": "In the beginning, the World Series matchup of the Dodgers against the Yankees was a kind of charming intra-city showdown of two New York City boroughs, blue collar Brooklyn, equipped with a neighborhood called Gravesend, against the pretentious Bronx, with the fancy Grand Concourse.",
      "publishedAt": "2024-10-25T15:07:35Z",
      "title": "Yankees vs Dodgers: The World Series' most frequent rivalry through the years",
      "url": "https://apnews.com/bff08bfb932f8e56257f852a488e4a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f0d126a9c754b498784c0cf63b309cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}