{
  "articles": [
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private lander on Thursday made the first U.S. touchdown on the moon in more than 50 years, but managed just a weak signal back until flight controllers scrambled to gain better contact.",
      "publishedAt": "2024-02-22T17:45:09Z",
      "title": "Private lander makes first US moon landing in more than 50 years",
      "url": "https://apnews.com/9c896bfca61582773d381f4045fd35d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15a0732e6f674b63b950cd7893a53c14/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Some Republicans joined Democrats in expressing alarm over a ruling this week by the Alabama Supreme Court that jeopardized future access to in vitro fertilization, giving allies of President Joe Biden new fuel for their efforts to center abortion access in the presidential election.",
      "publishedAt": "2024-02-22T23:46:37Z",
      "title": "Some Republicans are voicing doubt over Alabama IVF ruling. Democrats see an opportunity",
      "url": "https://apnews.com/5fa61803333ab1ec1062835397c15570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0bb7a27691a434690f5f1f5bfa04f2d/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, SAMY MAGDY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — International efforts to broker a cease-fire between Israel and Hamas appeared to gain new momentum Thursday as the White House said a visit by a senior envoy with Israeli leaders was “going well” and other mediators reported encouraging signs from the warring parties.",
      "publishedAt": "2024-02-22T13:56:50Z",
      "title": "Mideast cease-fire efforts gain steam as US envoy visits. Mediators report 'encouraging' signs",
      "url": "https://apnews.com/e8687b7235d0ac066170f3e5a72ce544",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a94f47e9688546cc821ffa600200c766/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A former FBI informant who claims to have links to Russian intelligence and is charged with lying about a multimillion-dollar bribery scheme involving President Joe Biden's family was again taken into custody Thursday in Las Vegas, two days after a judge released him.",
      "publishedAt": "2024-02-22T22:29:40Z",
      "title": "Ex-FBI source accused of lying about Bidens and having Russian contacts is returned to US custody",
      "url": "https://apnews.com/e6de5f083e7ea7c2f1aa6233d24d7cfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84eb1a784aff472787e43b692e0b97ca/3000.jpeg"
    },
    {
      "author": "DENISE LAVOIE and MATTHEW BARAKAT",
      "description": "RICHMOND, Va. (AP) — Four foreign nationals were arrested and charged Thursday with transporting suspected Iranian-made weapons on a vessel intercepted by U.S. naval forces in the Arabian Sea last month.",
      "publishedAt": "2024-02-22T22:06:44Z",
      "title": "4 charged in transporting suspected Iranian-made weapons. 2 SEALs died in intercepting the ship",
      "url": "https://apnews.com/f23e236630c74a52003729f893d69725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/072898a2e8cf4d7f981f9b26f7a2b847/2580.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "AT&amp;T said the hourslong outage to its U.S. cellphone network Thursday appeared to be the result of a technical error, not a malicious attack. The outage knocked out cellphone service for thousands of its users across the U.S.",
      "publishedAt": "2024-02-22T12:27:22Z",
      "title": "AT&T says the outage to its US cellphone network was not caused by a cyberattack",
      "url": "https://apnews.com/02d8dfd93019e79e5e2edbeed08ee450",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e98be4682d34cb7a1b1368fc1509f42/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "ANAHUAC, Texas (AP) — A Black high school student’s monthslong punishment by his Texas school district for refusing to change his hairstyle does not violate a new state law that prohibits race-based hair discrimination, a judge ruled on Thursday.",
      "publishedAt": "2024-02-22T05:11:46Z",
      "title": "Texas school legally punished Black student over hairstyle, judge says",
      "url": "https://apnews.com/4a1c3ec2ff85da27ffb2118f9fc55007",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ba70dc929594d65b271d701ae1d8733/3000.jpeg"
    },
    {
      "author": null,
      "description": "An Ohio mother who left her 16-month-old daughter home alone in a playpen for 10 days last summer while she went on vacation pleaded guilty on Thursday to aggravated murder.Kristel Candelario, 32, also pleaded guilty to child endangerment as part of a plea deal with Cuyahoga County prosecutors, who agreed to dismiss two murder counts and a felonious assault charge.",
      "publishedAt": "2024-02-22T19:08:46Z",
      "title": "Ohio mom who left toddler alone when she went on vacation pleads guilty to aggravated murder",
      "url": "https://apnews.com/2f83d06c6469b7b9c06df449ad7e1c8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f256ac4612d744b385d5ae7e0a1af655/3000.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "SAN DIEGO (AP) — It will still be months before the San Diego Zoo gets new pandas, the first such bears sent to the United States by China in decades.",
      "publishedAt": "2024-02-22T23:41:44Z",
      "title": "Atlanta is the only place in US to see pandas for now. But dozens of spots abroad have them",
      "url": "https://apnews.com/235de70dec5e6c6f11cd16f53547cfb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f598d9c3e0754d09843283f73b99b6a6/3000.jpeg"
    },
    {
      "author": "ANTHONY McCARTNEY",
      "description": "LOS ANGELES (AP) — Former talk show host Wendy Williams has been diagnosed with the same form of dementia that actor Bruce Willis has, a statement released Thursday on behalf of her caretakers says.",
      "publishedAt": "2024-02-22T19:28:26Z",
      "title": "Wendy Williams diagnosed with same form of dementia as Bruce Willis",
      "url": "https://apnews.com/d3cebb8c20f750a623f9d180a50c03e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f7795188179448e855c1e7430a194c4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}