{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli warplanes carried out airstrikes early Sunday near Gaza's largest hospital, which is packed with patients and tens of thousands of Palestinians seeking shelter, residents said.",
      "publishedAt": "2023-10-29T06:19:43Z",
      "title": "Israel strikes near Gaza's largest hospital after accusing Hamas of using it as a base",
      "url": "https://apnews.com/de1a7d660ba2f6d80b3d7aeaae5bb0f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fad3aa872ee493b93cc5a5365661f28/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Two days after cellular and internet service abruptly vanished for most of Gaza amid a heavy Israeli bombardment, the crowded enclave was coming back online Sunday as communications systems were gradually being restored.",
      "publishedAt": "2023-10-28T20:41:47Z",
      "title": "Internet, phone service gradually returns after vanishing for most of Gaza amid heavy bombardment",
      "url": "https://apnews.com/abd024625526f6d808c1583afd58e2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afdc65367ba44931afc82f8b2bc89a88/2559.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military has sought to assure the public it can achieve the two goals of its war on Hamas simultaneously — toppling the strip's militant rulers and rescuing some 230 hostages abducted from Israel.",
      "publishedAt": "2023-10-28T21:35:30Z",
      "title": "Israel says its war can both destroy Hamas and rescue hostages. Their families are less certain",
      "url": "https://apnews.com/49b39b3d43cc263b872191874e2d69fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6709e6589cce4ebb93fb855926bc2550/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON and JIM MUSTIAN",
      "description": "Police across Maine were alerted just last month to “veiled threats” by the U.S. Army reservist who would go on to carry out the worst mass shooting in the state’s history, one of a string of missed red flags that preceded the massacre.",
      "publishedAt": "2023-10-28T21:11:09Z",
      "title": "Maine police were alerted weeks ago about shooter's threats",
      "url": "https://apnews.com/4d5066230b500c152a7dd0d3e4d13f1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d47fc826b64442eb440cc5be353ac61/3000.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — “Friends” star Matthew Perry, the Emmy-nominated actor whose sarcastic, but lovable Chandler Bing was among television’s most famous and most quotable characters, has died at 54.",
      "publishedAt": "2023-10-29T01:21:21Z",
      "title": "Matthew Perry, Emmy-nominated 'Friends' star, dead at 54",
      "url": "https://apnews.com/f2963e83691d2bd2a8626d85a69c73cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/408c9a35f03841df95e9ff299482abc3/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, HALELUYA HADERO and COREY WILLIAMS",
      "description": "DETROIT (AP) — Jeep maker Stellantis reached a tentative contract agreement with the United Auto Workers union on Saturday as it escalated strikes against General Motors by adding a plant in Tennessee.",
      "publishedAt": "2023-10-28T17:12:26Z",
      "title": "UAW and Stellantis reach tentative contract deal as union adds strike at Tennessee GM factory",
      "url": "https://apnews.com/d32cb38791730c4c92a8b2112c205e59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce7e38ec0e844d7da93f8a09c84e15dc/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — More resources are arriving on Mexico's battered Pacific coast, and the death toll from Hurricane Otis is growing as searchers recover more bodies from Acapulco's harbor and under fallen trees and other storm debris.",
      "publishedAt": "2023-10-29T04:25:41Z",
      "title": "More help arrives in Acapulco, and hurricane's death toll rises to 39 as searchers comb debris",
      "url": "https://apnews.com/50eb6a8fe677455428cbacfd3966e72c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72bde1fc1e1f4cb8833a194e813d76d8/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "BUFFALO, N.Y. (AP) — They attend the same classes with access to the same programs, and even come from the same families. But girls consistently are outperforming boys, graduating at higher rates at public high schools around the country.",
      "publishedAt": "2023-10-29T04:01:59Z",
      "title": "Boys graduate high school at lower rates than girls, with lifelong consequences",
      "url": "https://apnews.com/c7b8dff33221e0ded2d1369397d96455",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea4bfdc278514a1896f9be42367c2ba2/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Iranian teenage girl injured weeks ago in a mysterious incident on Tehran's Metro while not wearing a headscarf has died, state media reported Saturday.",
      "publishedAt": "2023-10-28T06:41:33Z",
      "title": "An Iranian teenager injured on Tehran Metro while not wearing a headscarf has died, state media say",
      "url": "https://apnews.com/16c4f49e15dd774121e7498f34bd6622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b0764608fb94e1ab8b6cf0f90ad29d6/2920.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "ARLINGTON, Texas (AP) — Merrill Kelly called his four-season detour to South Korea a “Lost in Translation” experience. When he made his World Series debut, it was Texas Rangers batters who were disoriented.",
      "publishedAt": "2023-10-29T03:14:50Z",
      "title": "Kelly dominates after Korea detour as Diamondbacks rout Rangers 9-1 to tie World Series 1-all",
      "url": "https://apnews.com/a1bb4e8fa2ab89fda2ac1bbb9d85a234",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57377076b709430b93cb1a61d8e3442f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}