{
  "articles": [
    {
      "author": "SHARON JOHNSON",
      "description": "DAUFUSKIE ISLAND, S.C. (AP) — Sallie Ann Robinson proudly stands in the front yard of her grandmother’s South Carolina home. The sixth-generation native of Daufuskie Island, a once-thriving Gullah community, remembers relatives hosting meals and imparting life lessons on the next generation.",
      "publishedAt": "2023-12-20T05:03:22Z",
      "title": "Descendants fight to maintain historic Black communities. Keeping their legacy alive is complicated",
      "url": "https://apnews.com/f5963d81d8e9d73a6812821d3a15dbc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55acf2f9422645ebb33ac7ef2f2a1402/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — More than 90 Palestinians, including dozens from an extended family, were killed in Israeli airstrikes on two homes in Gaza, rescuers and hospital officials said Saturday, a day after the U.N.",
      "publishedAt": "2023-12-23T09:31:19Z",
      "title": "Israel strikes 2 homes, killing more than 90 Palestinians while hundreds have been detained",
      "url": "https://apnews.com/982fae4d0802b20d2a90423445c9f64b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c175b38e4e440d19bf4a0b790385454/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Fadi Sckak has already lost his father to the violence in Gaza. He wants to help his mother escape that fate.",
      "publishedAt": "2023-12-23T17:13:46Z",
      "title": "Americans beg for help getting family out of Gaza. \"I just want to see my mother again,' a son says",
      "url": "https://apnews.com/3d1dda48bed40c8b3e0dc2efa11caf9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01bb498482574a5fa0f9420fc2db2105/2735.jpeg"
    },
    {
      "author": "MARK SHERMAN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Supreme Court said Friday it will not immediately take up a plea by special counsel Jack Smith to rule on whether former President Donald Trump can be prosecuted for his actions to overturn the 2020 election results.",
      "publishedAt": "2023-12-22T19:35:57Z",
      "title": "Supreme Court rejects prosecutor's push to fast-track ruling in Trump election subversion case",
      "url": "https://apnews.com/90b93eeb663ebaf67a2e0bc266390fa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f330bb5f2a44ebe8e25ad558f046f49/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Standing on a portable stage erected at home plate of the Milwaukee Brewers ballpark, Wisconsin Gov. Tony Evers recently praised the professional baseball team as an “essential part” of the state's “culture and identity” and “economic success.”",
      "publishedAt": "2023-12-23T06:07:29Z",
      "title": "Plans abounding for new sports stadiums across the US, carrying hefty public costs",
      "url": "https://apnews.com/a81d825286530bb95f227efc99f2e9d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b6a5b9d47fd4410a21a84f3d7c4ef4b/3000.jpeg"
    },
    {
      "author": "KRISTEN GELINEAU, EDNA TARIGAN and REZA SAIFULLAH",
      "description": "PIDIE, Indonesia (AP) — Their screams and sobs could be heard from the ailing boat soon after it emerged into view amid the vastness of the Andaman Sea. Crowded on board were tiny babies and children, alongside mothers and fathers begging to be saved.",
      "publishedAt": "2023-12-23T04:12:38Z",
      "title": "‘Pray for us’: Eyewitnesses reveal first clues about a missing boat with up to 200 Rohingya refugees",
      "url": "https://apnews.com/c174d368f3a20e704b0aa745f8449e01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58c1679cf9de446ba6213b8597e183a6/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — The liberal-controlled Wisconsin Supreme Court overturned Republican-drawn legislative maps on Friday and ordered that new district boundary lines be drawn as Democrats had urged in a redistricting case they hope will weaken GOP majorities.",
      "publishedAt": "2023-12-22T20:52:44Z",
      "title": "Wisconsin Supreme Court orders new legislative maps in redistricting case brought by Democrats",
      "url": "https://apnews.com/eccbcfee414d1943073a9fb949743860",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd6a7aec34eb4e7987915b6a97c28b91/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — The strong earthquake that hit northwest China this week, and killed at least 148 people, has caused economic losses estimated to be worth tens of millions in the agricultural and fisheries industries, state media reported Saturday.",
      "publishedAt": "2023-12-23T12:16:50Z",
      "title": "Strong earthquake in northwest China that killed at least 148 causes economic losses worth millions",
      "url": "https://apnews.com/5f33ca0b89e97391d30f2277b0c086f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e86a869330bf4c21906f89d48f2c8832/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump says he is eager to debate President Joe Biden, even if the debates are sponsored by the nonpartisan Commission on Presidential Debates.",
      "publishedAt": "2023-12-22T18:55:50Z",
      "title": "Trump says he’s eager to debate Biden in 2024, even if controversial commission plans events",
      "url": "https://apnews.com/428216dc2a0e9692a64dfde800753f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbc94b4816904e9aa078340f955f28ce/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — A man suspected of stealing an artwork by Banksy of a stop sign adorned with three military drones, was arrested Saturday, London police said.",
      "publishedAt": "2023-12-23T17:25:14Z",
      "title": "Suspect arrested in alleged theft of a Banksy stop sign decorated with military drones",
      "url": "https://apnews.com/eba62d25eed6b60301289baa50f13e55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fef7fc3ea9241a0944e73e20d85c5d2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}