{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and DAVID RISING",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel pounded targets in the southern Gaza Strip on Saturday, intensifying a renewed offensive that followed a weeklong truce with Hamas and giving rise to renewed concerns about civilian casualties.",
      "publishedAt": "2023-12-02T07:32:44Z",
      "title": "Israel intensifies its assault on southern Gaza, causing renewed concern about civilian deaths",
      "url": "https://apnews.com/f300e8dac70d5309bf5f5a75bace7689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c3c701122d546bbb24bfd41ecc2f230/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN and SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Countries once colonized by empires are striking back on global warming — and they have the pope's blessing.",
      "publishedAt": "2023-12-02T04:40:03Z",
      "title": "Developing nations press rich world to better fight climate change at U.N. climate summit",
      "url": "https://apnews.com/543225dd77913eee8ca69bc53ea3da76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d232e637cb904f439a45f1db4e677ec1/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Biden administration on Saturday issued a final rule aimed at reducing methane emissions, targeting the U.S. oil and natural gas industry for its role in global warming as President Joe Biden seeks to advance his climate legacy.",
      "publishedAt": "2023-12-02T08:36:40Z",
      "title": "Biden rule aims to reduce methane emissions, targeting US oil and gas industry for global warming",
      "url": "https://apnews.com/6d37e9da49944e9a8c0b08aeb3ddc73e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78b682add2234a56b9bdd4be22c20072/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — One fall day in 2010, retired Supreme Court Justice Sandra Day O’Connor slipped into the courtroom where she worked for nearly 25 years to take in an “amazing” sight.",
      "publishedAt": "2023-12-02T05:16:07Z",
      "title": "Justice Sandra Day O'Connor paved a path for women on the Supreme Court",
      "url": "https://apnews.com/fdda04cb0d18c0fd2086a062494f5f24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a981dfd8146a4887a9d8b2fd02e05da5/1992.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — When it came to the Middle East, Henry Kissinger wasn't pushing for peace — only for what was possible.By the time Kissinger died Wednesday at 100, the agreements he negotiated as United States secretary of state between Israel, Egypt and Syria stabilized borders for nearly half a century after the 1973 Arab-Israeli war.",
      "publishedAt": "2023-12-02T05:22:02Z",
      "title": "With 'shuttle diplomacy,' step by step, Kissinger chased the possible in the Mideast",
      "url": "https://apnews.com/e0d3d89e796d7a5b2bae230615987c1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c079178fdf49e980fe60131d725976/2942.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — The giant waves form in the storm belts of the Southern Ocean, off Antarctica, where whales roam. Supercharged by intense winds, the swells then roll on an ocean journey of thousands of kilometers (miles) to crash into Tahiti in the South Pacific.",
      "publishedAt": "2023-12-02T07:16:12Z",
      "title": "The surfing venue for the Paris Olympics is on the other side of the world but could steal the show",
      "url": "https://apnews.com/3c0a8538c8e6f763314809460ce5b705",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03ee3f8de29f48b3bd70c52a3a18f441/1998.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and THOMAS BEAUMONT",
      "description": "DES MOINES, Iowa (AP) — Ron DeSantis plans on Saturday to complete his campaign promise to visit each of Iowa’s 99 counties, a timeworn tactic for presidential candidates hoping to make their mark in the leadoff state over months mingling with voters at the state's diners, cookouts and Pizza Ranches.",
      "publishedAt": "2023-12-02T05:35:18Z",
      "title": "Trump and DeSantis will hold dueling campaign events in Iowa with the caucuses just six weeks away",
      "url": "https://apnews.com/16489ac59dd5e725bafb8096ea152175",
      "urlToImage": ""
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The House is making history this year in ways that Republicans could hardly have envisioned when the party took control.",
      "publishedAt": "2023-12-02T05:07:11Z",
      "title": "With the expulsion of Santos and ouster of McCarthy, the House is making unexpected history",
      "url": "https://apnews.com/809d2c0b4e261fe39c0f8c69cfd462e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d7648080b994a41bef86b62feaa4690/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump is not immune from prosecution in his election interference case in Washington, a federal judge ruled Friday, knocking down the Republican's bid to derail the case charging him with plotting to overturn the 2020 presidential election.",
      "publishedAt": "2023-12-02T00:43:52Z",
      "title": "Judge rejects Trump’s claim of immunity in his federal 2020 election prosecution",
      "url": "https://apnews.com/a98872759762c95fa925ff831df27388",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/498209ea472e4bcaa77787663d2033c2/3000.jpeg"
    },
    {
      "author": null,
      "description": "ATLANTA (AP) — A protester was in critical condition Friday after setting themself on fire outside the Israeli consulate in Atlanta, authorities said. A security guard who tried to intervene was also injured.",
      "publishedAt": "2023-12-01T21:58:33Z",
      "title": "Protester critically injured after setting self on fire outside Israeli consulate in Atlanta",
      "url": "https://apnews.com/8f17dd72592f86797a45cda9b60605a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0380e28424474f848f312321382b488b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}