{
  "articles": [
    {
      "author": "ALANNA DURKIN RICHER, COLLEEN LONG, ERIC TUCKER, ZEKE MILLER and STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — Donald Trump was the target of what the FBI said “appears to be an attempted assassination” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican presidential nominee survived another attempt on his life.",
      "publishedAt": "2024-09-15T18:44:03Z",
      "title": "Trump was the subject of an apparent assassination attempt at his Florida golf club, the FBI says",
      "url": "https://apnews.com/f62f8378d3a8ce7b2e99d6a8fb40aba9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6a7c0586bd941f0951ddf8f5641b8f3/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — An apparent attempt to assassinate former President Donald Trump as he played golf in Florida has rocked a presidential campaign already marred by violence and raised questions about how such a thing could have happened for the second time in as many months.",
      "publishedAt": "2024-09-16T02:58:50Z",
      "title": "Apparent attempt on Trump's life raises questions about how it could have happened again",
      "url": "https://apnews.com/b989e21dae38e7220ccfaccb02abd151",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd90768fa5534cfa8701f99a37f0198c/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "FORT LAUDERDALE, Fla. (AP) — Former President Donald Trump is safe following what the FBI says \"appears to be an attempted assassination” while playing golf two months after another attempt on his life at a rally in Pennsylvania.",
      "publishedAt": "2024-09-16T00:22:10Z",
      "title": "5 things to know about the apparent assassination attempt on Trump at one of his golf courses",
      "url": "https://apnews.com/564c56e167c3cdc6c50f6a2e91db9a6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0937c64cb85840f9ac676ebce5dc4c98/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian officials say Israeli airstrikes have killed 16 people in the Gaza Strip, including five women and four children.A strike early Monday flattened a home in the built-up Nuseirat refugee camp in central Gaza, killing at least 10 people, including four women and two children.",
      "publishedAt": "2024-09-16T05:31:45Z",
      "title": "Israel-Hamas war latest: Israeli airstrikes kill 16 in Gaza, including 4 children, Palestinians say",
      "url": "https://apnews.com/a794f441dbfddebe87fd9b95c28008fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d05460f6b6bd4848870af88e4c4e0e50/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — The strongest typhoon to hit Shanghai since at least 1949 made landfall early Monday with powerful winds and heavy rains after more than 400,000 people were evacuated.Flights, ferries and train services were suspended in the megacity and in neighboring provinces, disrupting travel during China’s three-day Mid-Autumn Festival.",
      "publishedAt": "2024-09-16T03:36:48Z",
      "title": "Typhoon hits Shanghai with 94-mph winds after 400,000 people were evacuated",
      "url": "https://apnews.com/74e8af786c5cf9bac56542df81af5ac4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f5ede8e2d8b4a1da5c8e511b8134103/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "SPRINGFIELD, Ohio (AP) — For many Haitian immigrants, Sunday mornings in Springfield, Ohio, are spent joyfully worshipping God as they sing and pray in their native Creole. This Sunday, they needed that uplifting balm more than ever.",
      "publishedAt": "2024-09-15T16:46:36Z",
      "title": "Haitians in Ohio find solidarity at church after chaotic week of false pet-eating claims",
      "url": "https://apnews.com/aa7827f1236f207c9f64ae07096e3977",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39065e65b1504685afd757aab8b595d9/1920.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ, GISELA SALOMON and DEVI SHASTRI",
      "description": "McALLEN, Texas (AP) — For three days, the staff of an Orlando medical clinic encouraged a woman with abdominal pain who called the triage line to go to the hospital. She resisted, scared of a 2023 Florida law that required hospitals to ask whether a patient was in the U.S.",
      "publishedAt": "2024-09-16T04:01:19Z",
      "title": "Florida hospitals ask immigrants about their legal status. Texas will try it next",
      "url": "https://apnews.com/21faed1d4d1b984ea3557d09f22dab9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdb507dff17348558070ff710bb8da98/2063.jpeg"
    },
    {
      "author": "ALLEN G. BREED and TIM SULLIVAN",
      "description": "BLUFFTON, South Carolina (AP) — On the first day of his American National Government class, Prof. Kevin Dopf asks how many of his students are United States citizens. Every hand shoots up.“So, how did all you people become citizens?” he asks.",
      "publishedAt": "2024-09-16T04:11:20Z",
      "title": "Is 'Judge Judy' on the Supreme Court? Lack of civics knowledge leads to colleges filling the gap",
      "url": "https://apnews.com/704d8abe56c0fc9b2c9a35187dacdc99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc25aa4348c143c8907da55e500d1773/1920.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — “Shogun” had historic wins in an epic 18-Emmy first season, “Hacks” scored an upset for best comedy on what was still a four-trophy night for “The Bear,” and “Baby Reindeer” had a holiday at an Emmy Awards that had some surprising swerves.",
      "publishedAt": "2024-09-15T04:04:30Z",
      "title": "'Shogun' and 'Hacks' win top series Emmy Awards and 'The Bear' and 'Baby Reindeer' take 4 apiece",
      "url": "https://apnews.com/8588922c128c775092509b70a599a6d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d6f4060dbf8439b9b2b672db02fcf55/1920.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "KANSAS CITY, Mo. (AP) — Harrison Butker kept making a lonely walk to midfield after each quarter Sunday to check on the direction of the wind, which tends to swirl inside Arrowhead Stadium. He did it one last time during the 2-minute warning, when his Chiefs were trailing the Bengals by two and trying to give him a winning field-goal attempt.",
      "publishedAt": "2024-09-15T23:41:39Z",
      "title": "Butker hits a 51-yard winner for KC after penalty on Bengals safety keeps Chiefs alive",
      "url": "https://apnews.com/0e5430b9f6d4298661da31ed964bce5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dbdbb788af94922b69ad3104212d74d/2184.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}