{
  "articles": [
    {
      "author": null,
      "description": "Over 60,000 Palestinians have been killed in the 21-month Israel-Hamas war, according to Gaza’s Health Ministry. The ministry's statement on Tuesday did not say how many were civilians or militants, but has said women and children make up around half the dead. The ministry, part of the Hamas-run government, said the latest death toll had risen to 60,034, with 145,870 people wounded since Hamas’ Oct. 7, 2023, attack. Israel’s offensive has destroyed vast areas of Gaza, displaced around 90% of the population and caused to a catastrophic humanitarian crisis, with experts warning of famine.",
      "publishedAt": "2025-07-29T10:10:16Z",
      "title": "Over 60,000 Palestinians have died in the 21-month Israel-Hamas war, Gaza’s Health Ministry says",
      "url": "https://apnews.com/article/palestinians-death-toll-war-health-ministry-816d592952814db869924f9626ca8876",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5e8829/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F3c%2F6970bdf41dba05f97eeb92d77a84%2F48efc724951e43cda13ced6bbc5b9de8"
    },
    {
      "author": null,
      "description": "The leading international authority on food crises said in a new alert that the “worst-case scenario of famine is currently playing out in the Gaza Strip,” and “widespread death” will occur without immediate action. Tuesday's alert, still short of a formal famine declaration, follows an outcry over images of emaciated children in Gaza after nearly 22 months of war. The Integrated Food Security Phase Classification, or IPC, said Gaza has teetered on the brink of famine for two years, but recent developments have “dramatically worsened” the situation, including “increasingly stringent blockades” by Israel.",
      "publishedAt": "2025-07-29T08:03:03Z",
      "title": "Food crisis experts say 'worst-case scenario of famine' is happening in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-famine-israel-warning-d14ca629a68f7bdefe9c2fcc67d62224",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c5cfbf/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F70%2F5bcd6bc702191bafaa465613c18a%2F4e09f4354e3f4fb2a4b7a2ac7ee4a87d"
    },
    {
      "author": null,
      "description": "At least two people, including a New York City police officer, have been shot in Manhattan office building. That's according to person familiar with the matter who was not authorized to publicly discuss the ongoing investigation and spoke to AP on condition of anonymity. The person did not immediately know the victims' conditions. The office building houses some of the country’s top financial firms and the National Football League. The Fire Department of New York says emergency crews were called to the Park Avenue office building Monday evening for a report of someone shot.",
      "publishedAt": "2025-07-28T23:05:36Z",
      "title": "At least 2 people shot at Manhattan office building housing financial firms and NFL, source tells AP",
      "url": "https://apnews.com/article/new-york-city-shooting-nfl-building-274f8b4f6147d21298a08f8003ef13c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dd0d09/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Ff0%2F93e27924aafebe2638b3b5a5ff66%2Fffc741809e884b31806b9727dff702c1"
    },
    {
      "author": null,
      "description": "Officials say a man with a rifle killed an off-duty New York City police officer and three other people before taking his own life at a Manhattan office tower. Law enforcement officials are working to unravel what took place on Monday and determine why the location may have been targeted. The city had recently announced it was on pace to have its fewest murders and fewest people hurt by gunfire than any year in recent decades. Shane Tamura, of Las Vegas, was identified as the gunman by police, although his motive and reasoning for targeting the building was not immediately clear.",
      "publishedAt": "2025-07-29T04:14:07Z",
      "title": "NYC shooting: What we know so far about the shooting and the gunman",
      "url": "https://apnews.com/article/new-york-city-shooting-killed-0d002f9e3a3fdab7d7ad93616d42e865",
      "urlToImage": "https://dims.apnews.com/dims4/default/8564470/2147483647/strip/true/crop/4800x2700+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F74%2F8fca2e63efa1a92442ce2acab911%2Fcf6345883bde4ae8809b1a65bbc4517f"
    },
    {
      "author": null,
      "description": "Russian glide bombs and missiles have struck a Ukrainian prison and a medical facility, killing at least 22 people. Officials reported the attacks on Tuesday. A Russian airstrike on a prison in the Zaporizhzhia region killed at least 17 inmates and wounded more than 80 others. In the Dnipro region, authorities reported at least four people were killed and eight injured. This comes as U.S. President Donald Trump has threatened Russia with sanctions unless it stops its bombardment of civilian areas. The Kremlin has warned against ultimatums, framing the conflict as a geopolitical confrontation with the West.",
      "publishedAt": "2025-07-29T07:06:43Z",
      "title": "Russia kills 22 in Ukraine attacks despite Trump threat",
      "url": "https://apnews.com/article/russia-ukraine-war-prison-zaporizhzhia-feb6039758a0ee9bb21e1dab986c20b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a337e5/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fdb%2Fe943a384f972ed0665160e189221%2F13e7c044aa5743e5b040d214e6d00471"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump has opened a new golf course in Scotland, ending a five-day trip focused on promoting his family’s luxury properties and playing golf. Trump cut a red ribbon to officially open the course in Balmedie on Scotland's northern coast on Tuesday and let news media watch him tee off. His son Eric designed the course and was present along with his brother Don Jr. The trip allowed the Republican president to escape Washington’s summer humidity and scandals. The new course is part of Trump International Golf Links, Scotland, and hosts a PGA Seniors Championship event later this week. Trump says even a bad day playing golf is \"still good.”",
      "publishedAt": "2025-07-29T04:01:44Z",
      "title": "Trump caps his Scottish visit by opening a new golf course",
      "url": "https://apnews.com/article/trump-golf-new-scottish-course-family-profits-207ec2a182508f46325653952869052e",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ca6290/2147483647/strip/true/crop/2955x1662+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F8b%2F5937969648b24d3d3894e4b86fb5%2Ff624a7c3af8d4fbfa4b51a1928502469"
    },
    {
      "author": null,
      "description": "President Donald Trump says his friendship with Jeffrey Epstein ended after Epstein hired people who had worked for Trump. The Republican president said Monday that he had warned Epstein about hiring Trump staff and that when Epstein did it again, “I threw him out of the place.” The place Trump refers to is his Mar-a-Lago club in Palm Beach, Florida. Authorities say the disgraced financier killed himself in a New York jail cell in 2019 as he awaited trial on sex trafficking charges. The case has dogged Trump after he and his top allies stoked conspiracy theories about Epstein's death.",
      "publishedAt": "2025-07-28T18:43:03Z",
      "title": "Trump says he ended friendship with Jeffrey Epstein during Scotland visit",
      "url": "https://apnews.com/article/trump-epstein-friendship-scotland-falling-out-a9896c04fcf932f232f1b319154eb800",
      "urlToImage": "https://dims.apnews.com/dims4/default/e179e48/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F80%2F1261f4c28f41226b8aa572617abd%2Fd185e32d376a4366b7816f174a6ce287"
    },
    {
      "author": null,
      "description": "Police in Nevada say a gunman opened fire just outside a casino and resort in Reno and shot multiple people. The conditions of the victims were not immediately known. Reno police spokesperson Chris Johnson said the gunman was taken into custody Monday and was being treated at a hospital. Johnson says the shooting was reported around 7:30 a.m. Monday outside the casino in the valet area. Reno police warned residents to stay out of the vicinity. Multiple emergency vehicles, including several ambulances, responded outside the casino.",
      "publishedAt": "2025-07-28T16:00:03Z",
      "title": "Multiple injuries reported in Reno Grand Sierra Resort shooting and suspect is in custody",
      "url": "https://apnews.com/article/reno-nevada-grand-sierra-resort-shooting-e8892d51ec4dd2d61b507012773a8c4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/93d0468/2147483647/strip/true/crop/2000x1125+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F6b%2Fb5be04bea301db0e35cfa87ef398%2F81ec8d5d53ec4a7da2e22ebf6261a5bb"
    },
    {
      "author": null,
      "description": "Scientists in Mexico are testing innovative methods they hope can be employed to locate the overwhelming number of people missing due to cartel violence. They are experimenting with pigs to simulate how human bodies decompose, and researchers are using satellite, geophysical and biological mapping techniques to study changes in the porcine graves. They hope the research will enhance efforts to find the more than 130,000 reported missing across Mexico. Jalisco, a state heavily affected by disappearances, is a focal point for this research. While technology isn't a complete solution, it complements traditional methods such as witness testimonies and digging.",
      "publishedAt": "2025-07-29T04:02:14Z",
      "title": "Mexico scientists test using technology and pigs to find cartel victims",
      "url": "https://apnews.com/article/mexico-cartels-disappeared-technology-pigs-9e0fec063c7365c9b1dc4d2262313f86",
      "urlToImage": "https://dims.apnews.com/dims4/default/dd02e99/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F73%2Fd34a1997355bc3ef47a5b6d7295f%2F73062f68829c4f328744e1d92862bfcb"
    },
    {
      "author": null,
      "description": "Ryne Sandberg, a Hall of Fame second baseman who became one of baseball’s best all-around players while starring for the Chicago Cubs, has died. He was 65. Sandberg announced in January 2024 that he had been diagnosed with metastatic prostate cancer. He had chemotherapy and radiation treatments, and then said in August 2024 that he was cancer-free. But he posted on Instagram on Dec. 10 that his cancer had returned and spread to other organs. He announced this month that he was still fighting, while “looking forward to making the most of every day with my loving family and friends.”",
      "publishedAt": "2025-07-29T01:35:15Z",
      "title": "Hall of Fame second baseman Ryne Sandberg has died after battling cancer",
      "url": "https://apnews.com/article/ryne-sandberg-dead-bef54481c04d15870c48ee7aea7ed131",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef95641/2147483647/strip/true/crop/2992x1683+0+136/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F09%2F5a912aeb98a635d98fc422841662%2F1e8e6f5f445245f7a01f7dfc68e03e8e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}