{
  "articles": [
    {
      "author": "SEAN MURPHY and JULIO CORTEZ",
      "description": "VALLEY VIEW, Texas (AP) — Powerful storms killed at least 18 people, injured hundreds and left a wide trail of destruction across Texas, Oklahoma and Arkansas after obliterating homes and destroying a truck stop where dozens sought shelter in a restroom during the latest deadly weather to strike the central U.S.",
      "publishedAt": "2024-05-27T04:09:10Z",
      "title": "Latest deadly weather in US kills at least 18 as storms carve path of ruin across multiple states",
      "url": "https://apnews.com/91b0ff5c06f9bdc8b8ca68f36afbafa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0be3eae105d41fc856cc28468c197dc/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinian health workers said Israeli airstrikes killed at least 35 people Sunday and hit tents for displaced people in the southern Gaza city of Rafah, and “numerous” others were trapped in flaming debris.",
      "publishedAt": "2024-05-26T08:42:49Z",
      "title": "Palestinian medics say Israeli airstrikes kill 35 in Gaza's Rafah as displaced people are hit",
      "url": "https://apnews.com/eb25eb70d2c7b9e6bcd0497060eccbca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fb0be3eb00243409a76276f786e8a73/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — After 22 witnesses, including a porn actor, tabloid publisher and White House insiders, testimony is over at Donald Trump’s criminal trial in New York.",
      "publishedAt": "2024-05-26T12:03:16Z",
      "title": "Here's what every key witness said at Donald Trump’s hush money trial. Closing arguments are coming",
      "url": "https://apnews.com/ed9e28cd63502c0949e9fafcc6f0a991",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e1248e3d4574cb9a927956deba522a0/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Australia prepared on Monday to send aircraft and other equipment to help at the site of a deadly landslide in Papua New Guinea as overnight rains in the South Pacific nation’s mountainous interior raised fears that the tons of rubble that buried hundreds of villagers could become dangerously unstable.",
      "publishedAt": "2024-05-27T03:08:49Z",
      "title": "Australia plans to send aid to Papua New Guinea as rain raises safety fears at deadly landslide site",
      "url": "https://apnews.com/3e1444634d8859b1f2378b334c6a0d41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60fc7e4d161f4be8b5b7f17ce0f679b2/2000.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — Business is good at “the firm.”The eight-person team at the State Department is leading Washington's efforts to ease the economic blowback for countries targeted by China.It emerged in the scramble to help Lithuania during a spat with China over Taiwan two years ago.",
      "publishedAt": "2024-05-27T04:06:58Z",
      "title": "China has threatened trade with some countries after feuds. They're calling 'the firm' for help",
      "url": "https://apnews.com/42655e067386a20b22f1317ce298f334",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfec2aed9a9c48b294f9064f9399b412/3000.jpeg"
    },
    {
      "author": "LORI HINNANT and VASILISA STEPANENKO",
      "description": "FAR WESTERN UKRAINE (AP) — Precious few choices are available to Alexander, a 26-year-old Russian soldier, since his capture: Clothes, meals and the hours of his day are rigidly accounted for in the camp for prisoners of war.",
      "publishedAt": "2024-05-27T04:01:52Z",
      "title": "Russian POWs get to make phone calls home. Ukrainians don't. A growing movement wants that to change",
      "url": "https://apnews.com/585d93ec00fe7a80a9c520e265ac5a6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4b61366ccf14c518f4978c6566391ca/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Concepcion Alejo is used to being invisible.Alejo, 43, touches her face up with makeup on a Tuesday morning, and steps out of her tiny apartment on the fringes of Mexico City.",
      "publishedAt": "2024-05-27T04:02:38Z",
      "title": "A woman could be Mexico's next leader. Millions of others continue in shadows as domestic workers",
      "url": "https://apnews.com/c617636b5d3ef6125a3b036ff557265f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7c09537956f451582180d159ceacdfb/3000.jpeg"
    },
    {
      "author": "DANICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — For 12-year-old Juliana St. Vil, life begins every afternoon.She bounds out of the crowded shelter where she’s been sleeping on the concrete floor for 10 months, a smile on her face despite harsh surroundings.",
      "publishedAt": "2024-05-27T04:06:02Z",
      "title": "Forced to rebuild a life at 12, a Haitian girl joins thousands seeking an escape from gang violence",
      "url": "https://apnews.com/84a599afc1223f12af3c496b44cce4fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/119da85f099d44cd87fda738ddd286e2/3000.jpeg"
    },
    {
      "author": null,
      "description": "DHAKA, Bangladesh (AP) — A cyclone flooded coastal villages and left hundreds of thousands of people without power Monday in southern Bangladesh, where nearly 800,000 residents had evacuated. At least seven deaths were reported.",
      "publishedAt": "2024-05-27T02:23:14Z",
      "title": "Cyclone floods coastal villages and cuts power in Bangladesh, where 800,000 had evacuated",
      "url": "https://apnews.com/9d258d86f7745951112e82de2a532a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69f7f303c82145ed933d5c94a5baa853/1920.jpeg"
    },
    {
      "author": "TAIWO ADEBAYO",
      "description": "ABUJA, Nigeria (AP) — Nigeria's government is cracking down on illegal mining, making dozens of arrests of unlicensed miners since April for allegedly stealing the country’s lithium, a critical mineral used in batteries for electric vehicles, smartphones and power systems.",
      "publishedAt": "2024-05-27T02:26:18Z",
      "title": "Nigeria is emerging as a critical mineral hub. The government is cracking down on illegal operations",
      "url": "https://apnews.com/4c639e034f6bca724bf26cdc55805d4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e4b1ac2f6ee4182b3acf87b20b31001/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}