{
  "articles": [
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — A special prosecutor who had a romantic relationship with Fulton County District Attorney Fani Willis formally withdrew Friday from the Georgia election interference case against Donald Trump after a judge ruled he had to leave or Willis couldn't continue to pursue the charges.",
      "publishedAt": "2024-03-15T13:08:38Z",
      "title": "Prosecutor leaves Georgia election case against Trump after relationship with district attorney",
      "url": "https://apnews.com/60b7dd9642fc9ef7c03d75980692334c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17aba26d178b41dfb48d4ec71090f21f/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — Fulton County District Attorney Fani Willis can prosecute Donald Trump on charges that he interfered with Georgia's 2020 election now that a special prosecutor with whom she had a romantic relationship has withdrawn from the case.",
      "publishedAt": "2024-03-15T21:43:24Z",
      "title": "What to know about judge's ruling allowing Fani Willis to stay on Trump's Georgia election case",
      "url": "https://apnews.com/150a46abe71ee76da2c0050798a5d93e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fc950f13b484467a64b39c8ecfc743e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "WADI GAZA, Gaza Strip (AP) — A ship delivered 200 tons of humanitarian supplies, food and water to Gaza on Friday, the Israeli military said, inaugurating a sea route from Cyprus for aid to help ease the humanitarian crisis brought by Israel’s 5-month-old offensive in the enclave.",
      "publishedAt": "2024-03-15T10:38:07Z",
      "title": "The first ship to use a new sea route delivers aid to Gaza, Israeli miliary says",
      "url": "https://apnews.com/d4e2f9ed525914233e4cf16c217f5248",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — A Russian ballistic missile attack blasted homes in the southern Ukrainian city of Odesa on Friday, followed by a second missile that targeted first responders who arrived at the scene, officials said.",
      "publishedAt": "2024-03-15T12:22:35Z",
      "title": "Russian missiles kill at least 16 people in the latest strike on southern Ukraine's Odesa",
      "url": "https://apnews.com/f7f8db9afd8fcaf08c41b0fac3ef885f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c8d689d2f334e599c78ff7f58497be2/2000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The United States and allies warned Iran on Friday that major Western economies will pile new sanctions on Tehran if it moves forward with an advancing plan to provide ballistic missiles to Russia for its war with Ukraine.",
      "publishedAt": "2024-03-15T15:08:51Z",
      "title": "US, G-7 allies warn Iran to back off deal to provide Russia ballistic missiles or face new sanctions",
      "url": "https://apnews.com/f12dc454b04f7cbe671d2c401e31390c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f3d2e525c9049f98c8cb6d58a0bbbc4/1200.jpeg"
    },
    {
      "author": "JOSHUA A. BICKEL and JOHN SEEWER",
      "description": "LAKEVIEW, Ohio (AP) — Blaine Schmidt sifted through the broken glass and splintered wood throughout his Ohio home Friday, salvaging a guitar and a bundle of diapers.His couch and a crib had been ripped apart by one of many tornadoes that tore through the central U.S., killing three people and injuring dozens more.",
      "publishedAt": "2024-03-15T13:29:02Z",
      "title": "Tornadoes kill 3 and leave trails of destruction in the central US",
      "url": "https://apnews.com/731ed36b02cd521590ac8f5dbc4509f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01184c8fe5314e45a564634ff2b91321/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — A unanimous Supreme Court ruled Friday that public officials can sometimes be sued for blocking their critics on social media, an issue that first arose for the high court in a case involving then-President Donald Trump.",
      "publishedAt": "2024-03-15T15:20:28Z",
      "title": "Supreme Court rules public officials can sometimes be sued for blocking critics on social media",
      "url": "https://apnews.com/973f1d18e74faccaa4bfce3bd65cc1af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed230932cc1745898f9bc4a8eeca25b3/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE, STEVE LeBLANC and NICK PERRY",
      "description": "PORTLAND, Maine (AP) — Law enforcement should have seized a man's guns and put him in protective custody weeks before he committed Maine's deadliest mass shooting, a report found Friday.An independent commission has been reviewing the events that led up to Army reservist Robert Card killing 18 people at a bowling alley and a bar in Lewiston on Oct.",
      "publishedAt": "2024-03-15T20:58:50Z",
      "title": "Law enforcement should have seized man's guns weeks before he killed 18 in Maine, report finds",
      "url": "https://apnews.com/3f3720c3213ca39aeeb166eb5e7a86b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b43ca246da04e3394675c9bd9d115f4/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and ELÉONORE HUGHES",
      "description": "SAO PAULO (AP) — Two top Brazilian military leaders declared to police that former President Jair Bolsonaro presented them a plan for him to remain in power after the 2022 election he lost, but both refused and warned him they would arrest him if he tried it, according to judicial documents released Friday.",
      "publishedAt": "2024-03-15T18:04:03Z",
      "title": "Brazil military leaders told police Bolsonaro plotted to remain in power despite election defeat",
      "url": "https://apnews.com/fb03d16461fab0d31846d630fb93acc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4114cccc1324ca0b46b90168182b33c/2698.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Eclipse-themed beer. Jewelry and ornaments. And doughnuts that capture the sun's disappearing act with the help of buttercream frosting.",
      "publishedAt": "2024-03-15T17:09:34Z",
      "title": "Businesses are ready for April's total solar eclipse with celestial-themed doughnuts and beer",
      "url": "https://apnews.com/c2e881062d0c366ab72b5d6ca1db3b59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/837d39ec289b45af98101d799e340717/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}