{
  "articles": [
    {
      "author": "Samya Kullab, Volodymyr Yurchuk",
      "description": "Ukrainian officials and analysts say Ukrainian President Volodymyr Zelenskyy has few options but to draw U.S. President Donald Trump’s ire against Vladimir Putin, while depending on Europe’s support. Ukraine’s strategy since U.S.-brokered peace talks were launched is to convince the Trump administration the Russian leader is unreliable and that only Kyiv is serious about peace. It’s a rhetorical game of pingpong in which both Kyiv and Moscow are trying to outmaneuver the other vis-à-vis the U.S. But the political theatrics underscore stark realities on the ground. In this war of attrition against Russia’s invasion, Ukraine’s position is poised to grow weaker as time goes on.",
      "publishedAt": "2025-05-17T04:08:23Z",
      "title": "Russia-Ukraine fighting grinds on as Turkey talks yield no real way to end war",
      "url": "https://apnews.com/article/ukraine-russia-zelenskyy-putin-trump-turkey-talks-457f6df4c614efa7dceae0eec028dd28",
      "urlToImage": "https://dims.apnews.com/dims4/default/6bce033/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F60%2F6d49b4c085bbd4f2fb4b7b2e798d%2F6072e0ac45104419be857f0e94827de1"
    },
    {
      "author": "Julia Frankel",
      "description": "The crisis in Gaza has reached one of its darkest periods, as Israel blocks all food and supplies from entering the territory and continues an intensifying bombardment campaign. Humanitarian officials caution that famine threatens to engulf the strip. Doctors say they are out of medicine to treat routine conditions. Israeli officials vow even more vigorous attacks. The military is preparing for a new organization with U.S. backing to take over aid delivery, despite alarms raised from humanitarian groups. Bushra Khalidi of the humanitarian nonprofit Oxfam calls it the deadliest and most destructive phase of Israel’s war on Gaza.",
      "publishedAt": "2025-05-16T18:50:05Z",
      "title": "The crisis is Gaza is only growing. Here's what to know",
      "url": "https://apnews.com/article/hamas-israel-gaza-crisis-hunger-palestinians-war-9caf8f6eb19efe038c1fd50aa1d2d8ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f6fd91/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F60%2Fe56aeeeb38f8323b3dbdbfc0cecf%2Ffa244c98e7a140b8b59ac45670d9fea2"
    },
    {
      "author": "Corey Williams",
      "description": "As a punishing heat wave takes hold of Texas, weather forecasters are warning that severe storms with hail and even hurricane-force winds could hobble parts of Appalachia and the Midwest. Tornadoes were also a risk for Friday. The National Weather Service said severe weather was likely across parts of the central Appalachians and the Mid-Atlantic states. Residents in Kentucky, southern Indiana, southern Illinois and parts of Tennessee, Missouri, Arkansas and Ohio should brace for intense storms that could include baseball-sized hail.",
      "publishedAt": "2025-05-16T14:57:30Z",
      "title": "Forecasters warn severe storms, hail and high winds could hobble parts of Appalachia and Midwest",
      "url": "https://apnews.com/article/tornado-weather-thunderstorms-great-lakes-22395202a65b0c37cc06c541ea772172",
      "urlToImage": "https://dims.apnews.com/dims4/default/b395bc4/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F28%2Fb2cfb0f20689406b3f24ba245490%2F70703d337c5840db9f1de0dd0d08fb09"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court has rejected the Trump administration’s appeal to quickly resume deportations of Venezuelans under an 18th century wartime law. Over two dissenting votes, the justices acted Friday on an emergency appeal from lawyers for Venezuelan men who have been accused of being gang members. The administration says that designation makes them eligible for rapid removal from the United States under the Alien Enemies Act of 1798. The high court had already called a temporary halt to the deportations from a north Texas detention facility in a middle-of-the-night order issued last month. Justices Samuel Alito and Clarence Thomas dissented.",
      "publishedAt": "2025-05-16T20:05:49Z",
      "title": "Supreme Court rejects Trump bid to resume quick deportations of Venezuelans under 18th century law",
      "url": "https://apnews.com/article/trump-supreme-court-venezuelans-deportations-c1dc29a89faa173593f5d42b62aa8276",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee92b39/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F6b%2F55a3f63410f5534ed4cb72f35b25%2F2469e2cdc3704cb18ed25331aec37954"
    },
    {
      "author": "Matt Brown, Leah Askarinam",
      "description": "House Republicans are in the final rounds of negotiations over a sweeping budget plan that has been significantly influenced by President Donald Trump's priorities. Many GOP lawmakers expect the bill will only make it through the finish line if Trump personally weighs with members. It is not unusual in the modern era for a president to direct the legislative priorities in Congress, but many House Republicans see Trump’s role as singular and decisive as they aim to pass the bill before Memorial Day.",
      "publishedAt": "2025-05-17T04:05:38Z",
      "title": "Republicans forge their tax bill in Trump's image",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-tax-cuts-medicaid-42f594eb6f1b99373ed1093515088076",
      "urlToImage": "https://dims.apnews.com/dims4/default/f756479/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F0e%2F7cde487126e3ae0510c17c5b79f9%2F0d3da90a193e4689ad3345084c51429e"
    },
    {
      "author": null,
      "description": "Orleans Parish Sheriff Susan Hutson says there are indications that the ten inmates who escaped from a New Orleans jail received help in their escape from people in the department. Authorities first noticed the 10 inmates were missing during a Friday morning headcount. One of the inmates was captured Friday after a brief foot chase through the French Quarter, the Louisiana State Police said in a post on the social media platform X.",
      "publishedAt": "2025-05-16T18:05:54Z",
      "title": "Sheriff says there are indications 10 inmates who escaped New Orleans jail had inside help",
      "url": "https://apnews.com/article/new-orleans-inmates-escape-0f96f173a3ded57b4b23f9a07b6cffac",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ae8582/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F06%2F685cbd1144b89f063e1307a16940%2Fa2151771de3948e28bac22795e3c58a8"
    },
    {
      "author": "Suman Naishadham",
      "description": "Madrid's international airport has for months been the site of homeless encampments amid a growing housing crisis in Spain, where rental costs have risen especially fast in the country's capital and also in Barcelona. Hundreds of homeless individuals are estimated to be sleeping in Madrid's airport, but that could soon change. Spain's airport authority this week said that it would start limiting who could enter the airport during periods of low-travel to prevent the homelessness problem from getting worse. A political blame game between Spanish authorities at different levels of government has meant that the issue has largely gone unaddressed.",
      "publishedAt": "2025-05-17T05:18:29Z",
      "title": "In Spain, a homelessness crisis unfolds in Madrid's airport",
      "url": "https://apnews.com/article/spain-madrid-airport-homeless-c6ab9507234aae0ba995cdebc62c982d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1bdd5bd/2147483647/strip/true/crop/4712x2651+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F3d%2F99fcac1c3008b7b430ad03b6388a%2F749e8195ed214fd2b0a88c5bb25a56b2"
    },
    {
      "author": null,
      "description": "Testimony in the Sean “Diddy” Combs sex trafficking trial has opened a window into what prosecutors say was the sordid world of group sex, drugs and violence beneath his glittering, jet-set persona. Much of the testimony that began on Monday was hard to watch. Combs ex-girlfriend, Cassie, recounted being beaten and pressured into degrading sexual performances with strangers. A lawyer for the Bad Boy Records founder conceded Combs was a jerk and a swinger prone to violence, but argued he wasn't a sex trafficker.",
      "publishedAt": "2025-05-17T04:11:43Z",
      "title": "Key moments from first week of Sean ‘Diddy’ Combs’ sex trafficking trial",
      "url": "https://apnews.com/article/combs-diddy-cassie-freak-offs-sex-trial-afa3c282e1482406783af679b88a78e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a7dd2b/2147483647/strip/true/crop/512x288+0+48/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F78%2Feba14378c78f40c8ca244f418f23%2F65c97abd995443cc8781d48b5e643605"
    },
    {
      "author": null,
      "description": "Acts from more than two dozen countries will take the stage in Basel, Switzerland, to compete in the final of the Eurovision Song Contest. The action kicks off Saturday at 9 p.m. Central European Summer Time, which is 8 p.m. in Britain and 3 p.m. EDT in the U.S. and Canada. The competition will be aired by national broadcasters in participating nations. In some territories, it’ll be watchable on Eurovision’s YouTube channel. In the U.S., Eurovision will stream live on Peacock. Viewers in nonparticipating countries can vote online or using the Eurovision app. Viewers in participating countries can vote by app, phone or text message.",
      "publishedAt": "2025-05-17T05:07:18Z",
      "title": "How to watch and vote in the grand final of the Eurovision Song Contest",
      "url": "https://apnews.com/article/eurovision-grand-final-how-to-watch-vote-545aec6706f9559a9bddb98def55b0fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3a42cf/2147483647/strip/true/crop/6900x3881+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F87%2Fd1cd552df3ee7f94b8f76124de7b%2F6e1f74ac070747f1b270076e451d60d5"
    },
    {
      "author": "Jack Denton, Desmond Tiro",
      "description": "Young men who once lived the “gangster life” in Kenya's capital have become farmers with a social mission. They took up the work in one of Africa's largest slums after seeing too many friends shot dead. Now they grow food, feed neighborhood children and run other projects. One member calls the work therapeutic. But the United States and others are cutting the aid funding that trickles down to local groups like these. One expert such homegrown projects in places like Nairobi are better placed to respond to local needs. They can even expand elsewhere. But where will they find financial support?",
      "publishedAt": "2025-05-17T04:09:45Z",
      "title": "They once lived the 'gangster life.' Now they tackle food insecurity in Kenya's slums",
      "url": "https://apnews.com/article/kenya-gangsters-crime-farmers-food-insecurity-58259e3100c7f8f2da9f5239b8a6a9de",
      "urlToImage": "https://dims.apnews.com/dims4/default/b713e6b/2147483647/strip/true/crop/5489x3088+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Ff1%2F04a0837537799aa277d3de7c9dbe%2Fc7c76830700d439bbb2ca9693e342d26"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}