{
  "articles": [
    {
      "author": "LEE KEATH",
      "description": "CAIRO (AP) — Two basic mistakes, according to the Israeli military. First, an officer overlooked a message detailing the vehicles in the convoy.",
      "publishedAt": "2024-04-06T05:11:10Z",
      "title": "Israel says its strike that killed aid workers was a mistake. Rights groups say it was no anomaly",
      "url": "https://apnews.com/cb695de7f6ef9e9d7d9cf8fbf6e95364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dd6343a58ed4ad3a757d618a7e39049/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — It’s the last wish of a dying mother, to be with her daughter once more. But six months into Israel's war against Hamas, time is running out for Liora Argamani, who hopes to stay alive long enough to see her kidnapped daughter come home.",
      "publishedAt": "2024-04-06T05:07:36Z",
      "title": "For families of hostages, it's a race against time as Israel's war reaches six-month mark",
      "url": "https://apnews.com/d601ff02e41abf1f4f026f21f0db8755",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a9d3393c2e44684b66c5d08305e99d3/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — With immigration shaping the elections that will decide control of Congress, Democrats are trying to outflank Republicans and convince voters they can address problems at the U.S. border with Mexico, embracing an issue that has traditionally been used against them.",
      "publishedAt": "2024-04-06T04:02:30Z",
      "title": "Democrats lean into border security as it shapes contest for control of Congress",
      "url": "https://apnews.com/ca10e37c4f961700cdd1645e09422ac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01f97c42d264447c8c4364868677eca5/3000.jpeg"
    },
    {
      "author": "BROOKE SCHULTZ",
      "description": "HARRISBURG, Pa. (AP) — POV: You’re on TikTok, and so is your governor — even as your Legislature considers banning the app from state-owned devices and networks. Efforts to ban TikTok over security concerns about China's influence through the platform have picked up steam in the past year in state legislatures, with an expansive ban even proposed by Congress.",
      "publishedAt": "2024-04-06T04:07:47Z",
      "title": "Some states are seeking to restrict TikTok. That doesn't mean their governors aren't using it",
      "url": "https://apnews.com/585bd1ee2e04f618f16883b61cb45e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/638ffa751cfe4173ad46d914ca17fc82/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — The Mexican president has quickly moved to break off diplomatic ties with Ecuador after police broke into the Mexican Embassy to arrest a former Ecuadorian vice president who had sought political asylum there after being indicted on corruption charges.",
      "publishedAt": "2024-04-06T03:56:11Z",
      "title": "Mexico's president says his country is breaking diplomatic ties with Ecuador after embassy raid",
      "url": "https://apnews.com/de5aa3a638b54fdfa3474c8ee25ca57e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/709979cbb7074f41bc312adbf17afb6f/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT",
      "description": "INDIANAPOLIS (AP) — Almost 25 years after suing the firearms industry for failing to prevent illegal gun sales, the northwestern Indiana city of Gary won a critical victory last fall when a judge ordered gun manufacturers to hand years of production and sales records.",
      "publishedAt": "2024-04-06T04:05:39Z",
      "title": "State Republicans killed an Indiana city's lawsuit to stop illegal gun sales. Why?",
      "url": "https://apnews.com/ee82fc0ca8953238eb1bf45bb46533cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7f3230d58c24f8e8dd6457557d6eb39/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "DALLAS (AP) — East Coast residents were jolted Friday by a 4.8-magnitude earthquake centered near Lebanon, New Jersey, with weak rumblings felt as far away as Baltimore and the Massachusetts-New Hampshire border.",
      "publishedAt": "2024-04-05T19:46:53Z",
      "title": "East Coast earthquakes aren't common, but they are felt by millions. Here's what to know",
      "url": "https://apnews.com/2a85cb2e51f70f386eeab4c054e261e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a59bfe730774410eb7002c4fca186177/3000.jpeg"
    },
    {
      "author": "JAN M. OLSEN",
      "description": "COPENHAGEN, Denmark (AP) — The now-aging hippies who took over a derelict naval base in Copenhagen more than 50 years ago and turned it into a freewheeling community known as Christiania want to boot out criminals who control the community's lucrative market for hashish by ripping up the cobblestoned street where it openly changes hands.",
      "publishedAt": "2024-04-06T05:19:22Z",
      "title": "Christiania, Copenhagen’s hippie oasis, wants to rebuild without its illegal hashish market",
      "url": "https://apnews.com/298f1ec51a6775574d8d3d96db6e7327",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d38b79571247cc9cbc52f87d507a05/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Ever since the Federal Reserve signaled last fall that it was likely done raising interest rates, Wall Street traders, economists, car buyers, would-be homeowners — pretty much everyone — began obsessing over a single question: When will the Fed start cutting rates?",
      "publishedAt": "2024-04-06T10:00:31Z",
      "title": "When will Fed cut rates? As US economy flexes its muscles, maybe later or not at all",
      "url": "https://apnews.com/6956cf26933610aa33a40a4bdd19ece3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0756a1011824f7c8bb9185fbfbb31fb/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "CLEVELAND (AP) — Caitlin Clark eventually found a way.Completely shut down in the first half, the most exciting player in women's college basketball now has one game left in her storied career at Iowa.",
      "publishedAt": "2024-04-06T03:39:33Z",
      "title": "Caitlin Clark leads Iowa rally for 71-69 win over UConn in women's Final Four. South Carolina awaits",
      "url": "https://apnews.com/2acf587b26f4080b1e647144e30fa56b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/313e23902ba9451a8d38d90d891d2315/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}