{
  "articles": [
    {
      "author": "LISA MASCARO, KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Kevin McCarthy's last-ditch plan to keep the federal government temporarily open collapsed in dramatic fashion Friday as a robust faction of hard-right holdouts rejected the package, making a shutdown almost certain.",
      "publishedAt": "2023-09-29T15:15:00Z",
      "title": "McCarthy's last-ditch plan to keep the government open collapses, making a shutdown almost certain",
      "url": "https://apnews.com/4b6644959722dbbbed654768bd9fc653",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce68b3df59f44d19892b8665a90fd37/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A potent rush-hour rainstorm swamped the New York metropolitan area on Friday, shutting down some subways and commuter railroads, flooding streets and highways, and delaying flights into LaGuardia Airport.",
      "publishedAt": "2023-09-29T14:36:24Z",
      "title": "New York City area under state of emergency after storms flood subways, strand people in cars",
      "url": "https://apnews.com/a16ad4720eddd6c0f7ea3b761f414e80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26f2837decd74860abdb9a3e91392be3/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and DAVID KOENIG",
      "description": "DETROIT (AP) — The United Auto Workers union expanded strikes against Detroit automakers Friday, ordering 7,000 more workers to walk off the job in Illinois and Michigan to put more pressure on the companies to improve their offers.",
      "publishedAt": "2023-09-29T12:30:56Z",
      "title": "United Auto Workers strikes spread as 7,000 more workers at two plants join the picket line",
      "url": "https://apnews.com/e2c78274333bea20856b90126a6b831c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/037ee1d66609401eaf5d3875a780c209/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Navy will begin randomly testing its special operations forces for steroids and other performance-enhancing drugs beginning in November, taking a groundbreaking step that military leaders have long resisted.",
      "publishedAt": "2023-09-29T16:19:01Z",
      "title": "The Navy will start randomly testing SEALs and special warfare troops for steroids",
      "url": "https://apnews.com/883a7262652224ac382d22fd38f90940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3b7aa86d01a4c559463793a92f59ec1/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — One of the last living witnesses to the fatal drive-by shooting of rapper Tupac Shakur in Las Vegas was charged with murder Friday in the 1996 killing, a long-awaited breakthrough in a case that has frustrated investigators and fascinated the public.",
      "publishedAt": "2023-09-29T16:32:11Z",
      "title": "Witness to the 1996 drive-by shooting of Tupac Shakur indicted on murder charge in rapper's death",
      "url": "https://apnews.com/3f7050c2a68813d86a96b96fbb3f1d1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d12efed186f040019c70133d7234a88f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD and JONATHAN J. COOPER",
      "description": "ANAHEIM, Calif. (AP) — Donald Trump will make a personal pitch Friday to California Republicans in a bid to solidify his support in a GOP presidential contest he has dominated for months, while Ron DeSantis and other rivals get another chance to break the front-runner’s momentum with time fast vanishing to reorder the race.",
      "publishedAt": "2023-09-29T13:26:20Z",
      "title": "Trump looks to set up a California primary victory with a personal pitch to Republican activists",
      "url": "https://apnews.com/e2f59e579f106c03aaf6189ea1079f11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d12334f43b6488c8806e91ede772ce0/3000.jpeg"
    },
    {
      "author": "ABDUL SATTAR",
      "description": "QUETTA, Pakistan (AP) — A suspected suicide bomber blew himself up among a crowd of people celebrating the Prophet Muhammad’s birthday in southwestern Pakistan on Friday, killing at least 52 people and wounding nearly 70 others, authorities said, in one of the country's deadliest attacks targeting civilians in months.",
      "publishedAt": "2023-09-29T06:58:53Z",
      "title": "Dozens dead after blast in southwestern Pakistan at a rally celebrating birthday of Islam's prophet",
      "url": "https://apnews.com/f9d1fab750bc8fcb03bb11e09e22d9de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/932aa0a0d9754c9096b314f03b5cfd45/2183.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — The Archdiocese of Baltimore announced Friday it filed for Chapter 11 bankruptcy reorganization days before a new state law goes into effect removing the statute of limitations on child sex abuse claims and allowing victims to sue their abusers decades after the fact.",
      "publishedAt": "2023-09-29T18:31:18Z",
      "title": "Baltimore Archdiocese says it will file for bankruptcy before new law on abuse lawsuits takes effect",
      "url": "https://apnews.com/fd2c76a1764af8c61f17db73c6655510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7beff9f11bdb456aa36048e0a5f2b9bb/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ",
      "description": "MEMPHIS, Tenn. (AP) — A Tennessee judge said Friday she is ending a conservatorship agreement between former NFL player Michael Oher and a Memphis couple who took him in when he was in high school, but the highly-publicized dispute over financial issues will continue.",
      "publishedAt": "2023-09-29T15:46:09Z",
      "title": "Judge says she is ending conservatorship between former NFL player Michael Oher and Memphis couple",
      "url": "https://apnews.com/ee1997025e6c9013e4d665ef18d95dc7",
      "urlToImage": ""
    },
    {
      "author": "MARY CLARE JALONICK and MICHAEL R. BLOOD",
      "description": "WASHINGTON (AP) — U.S. Sen. Dianne Feinstein of California, a centrist Democrat and champion of liberal causes who was elected to the Senate in 1992 and broke gender barriers throughout her long career in local and national politics, has died.",
      "publishedAt": "2023-09-29T12:56:16Z",
      "title": "Democratic Sen. Dianne Feinstein of California, an advocate for liberal priorities, dies at age 90",
      "url": "https://apnews.com/c831f3228ac44faa9653234570bb8ce9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2eda85e9dd44e69970b98524efa7b27/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}