{
  "articles": [
    {
      "author": "KEVIN FREKING, HALELUYA HADERO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The House on Wednesday passed a bill that would lead to a nationwide ban of the popular video app TikTok if its China-based owner doesn't sell its stake, as lawmakers acted on concerns that the company's current ownership structure is a national security threat.",
      "publishedAt": "2024-03-13T04:05:02Z",
      "title": "House passes a bill that could lead to a TikTok ban if Chinese owner refuses to sell",
      "url": "https://apnews.com/8fa7258fae1a4902d344c9d978d58a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68e37da41ad94958be2b0b7c902cc09d/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia 2020 election interference case on Wednesday dismissed some of the charges against former President Donald Trump and others, but the rest of the sweeping racketeering indictment remains intact.",
      "publishedAt": "2024-03-13T14:14:19Z",
      "title": "Judge dismisses some charges against Trump in the Georgia 2020 election interference case",
      "url": "https://apnews.com/46e0b68c25719c404130f7e6eab69dcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/032f868817d1475692baf4be00e4d25c/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The Israeli military said Wednesday it plans to direct a significant portion of the 1.4 million displaced Palestinians living in the Gaza Strip’s southernmost town of Rafah toward “humanitarian islands” in the center of the territory ahead of its planned offensive in the area.",
      "publishedAt": "2024-03-13T18:48:58Z",
      "title": "Israel says it plans to direct Palestinians out of Rafah ahead of anticipated offensive",
      "url": "https://apnews.com/1ecd20b754890b623f523be41591aadf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28682e2ae6cc4ae397895810846b38ea/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — The death of a nonbinary student the day after a fight inside an Oklahoma high school restroom has been ruled a suicide, the state medical examiner's office said Wednesday.",
      "publishedAt": "2024-03-13T21:38:20Z",
      "title": "Death of nonbinary teen Nex Benedict after school fight is ruled a suicide, medical examiner says",
      "url": "https://apnews.com/88f403bfd5436a53b636dcc2bc59ebf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65905b23760549059d176c1f533a32fc/1600.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "Three Missouri men have been charged with federal counts related to the illegal purchase of high-powered rifles and guns with extended magazines after last month's shooting at the Kansas City Chiefs’ Super Bowl parade and rally left one person dead, roughly two dozen others injured and sent hundreds of people scrambling for cover, federal prosecutors said Wednesday.",
      "publishedAt": "2024-03-13T19:06:46Z",
      "title": "3 men charged with federal firearms counts after Kansas City Chiefs Super Bowl parade shooting",
      "url": "https://apnews.com/57662b493b2d987288dabca4bc5fd6f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1c2ad4fe0db474fb01d4cc06f8583d9/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS AND AMELIA THOMSON-DeVEAUX",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump have secured their party’s nominations for president, setting up a rematch of the 2020 election.While both men sailed through the primary season, their paths to a win in November will be more difficult.",
      "publishedAt": "2024-03-13T18:00:20Z",
      "title": "Biden's fraying coalition and Trump's struggle with moderates: AP data shows nominees' challenges",
      "url": "https://apnews.com/f80f8d7193e7901768b1bf67378c442a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/603576ecb1f240a4aad85faa4816e5e4/3000.jpeg"
    },
    {
      "author": "JASON DEAREN and MICHAEL REZENDES",
      "description": "A former bishop in The Church of Jesus Christ of Latter-day Saints who was featured in an Associated Press investigation into how the church protects itself from allegations of sexual abuse was arrested by police in Virginia this week after being indicted on charges he sexually abused his daughter while accompanying her on a school trip when she was a child, according to court filings.",
      "publishedAt": "2024-03-13T21:10:47Z",
      "title": "Former Mormon bishop highlighted in AP investigation arrested on felony child sex abuse charges",
      "url": "https://apnews.com/aedc8cfc9175ebadb18420ec25a5f99c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c5fd2c5c5514322b353de4e22729030/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Vladimir Putin said Wednesday that Russia is ready to use nuclear weapons if its sovereignty or independence is threatened, issuing another blunt warning to the West just days before an election in which he’s all but certain to secure another six-year term.",
      "publishedAt": "2024-03-13T06:40:03Z",
      "title": "Putin warns again that Russia is ready to use nuclear weapons if its sovereignty is threatened",
      "url": "https://apnews.com/82ced2419d93ae733161b56fbd9b477d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/207e8c59c851418d81100b5eb4892a8e/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A proposal to install new leadership in Haiti appeared to be crumbling Wednesday as some political parties rejected the plan to create a presidential council that would manage the transition.",
      "publishedAt": "2024-03-13T17:57:04Z",
      "title": "Plan to install new leaders in Haiti appears to crumble after political parties reject it",
      "url": "https://apnews.com/aa91714a56ade1220a4e5f0d203716d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8af9382e5b834bba9f7c2e959b346309/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — For years, scientists have known people who use neti pots can become infected with a brain-eating amoeba if they use the wrong kind of water. On Wednesday, researchers linked a second kind of deadly amoeba to nasal rinsing.",
      "publishedAt": "2024-03-13T16:25:42Z",
      "title": "Another dangerous amoeba has been linked to neti pots and nasal rinsing. Here's what to know",
      "url": "https://apnews.com/aed6e6f9129d85146d396d71b8778812",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef2f7d566cc54720a1b8b4bdf7da9628/2333.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}