{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel launched ground operations and carried out airstrikes in a hard-hit city in southern Gaza overnight, killing at least 51 people, including women and children, Palestinian medical officials said Wednesday.",
      "publishedAt": "2024-10-02T05:50:18Z",
      "title": "Palestinian officials say 51 killed in Israeli operation on southern Gaza",
      "url": "https://apnews.com/7d93f71b7894177b4f9c303671ee55de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f13d66f69bb47bf9e89f57e07ac6af9/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — When Israel bombed buildings outside the southern Lebanese city of Sidon, Mohamed Arkadan and his team rushed to an emergency unlike anything they had ever seen.About a dozen apartments had collapsed onto the hillside they once overlooked, burying more than 100 people.",
      "publishedAt": "2024-10-02T07:05:19Z",
      "title": "Under fire and using old equipment, Lebanon's rescuers struggle to respond to Israeli offensive",
      "url": "https://apnews.com/cc0e211c73d8f033387574a69e14a32f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b916c598f8e4532ad249f6e1d3fa2a5/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "YATTA, West Bank (AP) — At dawn in mid-May, Sayyed Ayyed and dozens of other unemployed Palestinian men gathered at the foot of the towering wall of concrete and barbed wire dividing the occupied West Bank from Israel.",
      "publishedAt": "2024-10-02T04:04:21Z",
      "title": "Palestinians in West Bank risk crossing Israel's separation barrier to flee failing economy",
      "url": "https://apnews.com/2971f01fd6fd878399911cef00bfa087",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb530b9f3fb54a0695578282c08c07f8/3000.jpeg"
    },
    {
      "author": "ERIK VERDUZCO, JEFF AMY and KIMBERLEE KRUESI",
      "description": "SWANNANOA, N.C. (AP) — President Joe Biden will survey the devastation in North and South Carolina on Wednesday as rescuers continue their search for anyone still unaccounted for after Hurricane Helene caused catastrophic damage across the Southeast and killed at least 166 people.",
      "publishedAt": "2024-10-02T04:23:32Z",
      "title": "Helene death toll now at least 166 as Biden plans to visit ravaged Carolinas",
      "url": "https://apnews.com/3f812f70c4d2649e2198362e9ae42b06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a30da31037b8464db1190f7eef8d38ef/3000.jpeg"
    },
    {
      "author": "BILL BARROW, ZEKE MILLER and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Vice presidential hopefuls Tim Walz and JD Vance focused their criticism on the top of the ticket on Tuesday as they engaged in a policy-heavy discussion that may be the last debate of the 2024 presidential campaign.",
      "publishedAt": "2024-10-02T02:20:09Z",
      "title": "Vance and Walz keep it civil in a policy-heavy discussion: VP debate takeaways",
      "url": "https://apnews.com/5b6f219b555416ff579764048ac238a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a19397d7b66487fb7e04b262e1b7531/1920.jpeg"
    },
    {
      "author": "TOM KRISHER, WYATTE GRANTHAM-PHILIPS and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — The 45,000 dockworkers who went on strike Tuesday for the first time in decades at 36 U.S.",
      "publishedAt": "2024-10-01T10:43:00Z",
      "title": "Dockworkers may have the negotiating advantage in their strike against US ports",
      "url": "https://apnews.com/91703e4798dbc9ee82185e983f31a3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5432e0816734cf7a8711ab86c1495fb/1920.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Thai police on Wednesday said they were investigating whether the school bus fire that killed 23 young students and teachers in suburban Bangkok was caused by negligence after filing initial charges against the driver.",
      "publishedAt": "2024-10-02T04:32:11Z",
      "title": "Thai police seek negligence charges for a school bus fire that killed 23",
      "url": "https://apnews.com/56780d1c64bc4474fb3157a6740cf938",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca9f9f27e914bc5aa6bb3606b67c820/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "KAMITUGA, Congo (AP) — It's been four months since Sifa Kunguja recovered from mpox, but as a sex worker, she said, she's still struggling to regain clients, with fear and stigma driving away people who've heard she had the virus.",
      "publishedAt": "2024-10-02T04:46:24Z",
      "title": "Sex workers find themselves at the center of Congo's mpox outbreak",
      "url": "https://apnews.com/5f6f3c7e9f0abd1917f8daf41678ea2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc9fe066dfde48acb26e74f037b19d8e/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY and TERRY CHEA",
      "description": "SAN FRANCISCO (AP) — Cabrel Ngounou's life in Cameroon quickly unraveled after neighbors caught the teenager with his boyfriend.",
      "publishedAt": "2024-10-02T04:05:27Z",
      "title": "US 'Welcome Corps' helps resettle LGBTQ+ refugees fleeing crackdowns against gay people",
      "url": "https://apnews.com/1c4a419125f50aa769c8416cd47312e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3e88b2dbb764201903df9e383a974fb/1920.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — John Amos, who starred as the family patriarch on the hit 1970s sitcom “Good Times\" and earned an Emmy nomination for his role in the seminal 1977 miniseries “Roots,” has died.",
      "publishedAt": "2024-10-01T18:15:05Z",
      "title": "John Amos, patriarch on 'Good Times' and an Emmy nominee for the blockbuster 'Roots,' dies at 84",
      "url": "https://apnews.com/65a1d2dc84175bb5d4c579901af7164f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a189ce14c5dc43b7a1268535eb6a52c5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}