{
  "articles": [
    {
      "author": "TIA GOLDENBERG, MOHAMMAD JAHJOUH",
      "description": "Israeli officials say Israel forces have begun withdrawing from a key Gaza corridor, part of Israel’s commitments under a tenuous ceasefire deal with Hamas. The deal is moving ahead but faces a major test over whether the sides can negotiate its planned extension. Israel agreed as part of the truce to remove its forces from the 4-mile Netzarim corridor, a strip of land that bisects northern Gaza from the south. While the development Sunday signals the agreement is moving ahead, the sides appear to have made little progress on negotiating the deal’s second phase, which is meant to extend the truce and lead to the release of more Israeli hostages held by Hamas.",
      "publishedAt": "2025-02-09T08:29:32Z",
      "title": "Israeli forces withdrawing from Netzarim corridor in Gaza, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-09-2025-9c36734cd5175fbb86e6d1dabe3cfc07",
      "urlToImage": "https://dims.apnews.com/dims4/default/79b8ad0/2147483647/strip/true/crop/2579x1451+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fcc%2F074ae0eda455b553e02506d11ff3%2F542d99c95fbc40f2be2318a2e065f071"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "Five Thai workers released after being held hostage for over a year in Gaza arrived in Bangkok on Sunday. The five were the second batch of Thai hostages released since the war broke out. During an earlier ceasefire in November 2023, 23 Thai nationals were freed in a deal negotiated between Thailand and Hamas, with assistance from Qatar and Iran. There was no immediate information available about the last Thai hostage left in Gaza, Nattapong Pingsa, nor the two Thai workers whose bodies were taken into Gaza.",
      "publishedAt": "2025-02-09T01:42:57Z",
      "title": "Released Thai hostages return to Bangkok after being held for over a year in Gaza",
      "url": "https://apnews.com/article/thailand-middle-east-gaza-hostages-d225705053f453c403d25f29658d0fb5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee3b6cb/2147483647/strip/true/crop/5931x3336+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F86%2F85c0ce55c146f82bcea143518f9c%2Fa2bd7f9b4df343b89fdba054ce49f4a8"
    },
    {
      "author": "DAVID RISING",
      "description": "Five Thai nationals held hostage by Hamas since its Oct. 7, 2023, attack on Israel have returned home after their release from captivity. At least one other Thai national remains in captivity, while 46 died during the conflict, according to Thailand’s Ministry of Foreign Affairs. Those taken hostage were among tens of thousands of Thai workers in Israel, the largest group of foreign agricultural laborers in the country. They're paid much higher wages than they can earn at home, and many opted to stay even after the attack.",
      "publishedAt": "2025-01-30T11:32:43Z",
      "title": "Why were so many Thai farmers among the hostages held by Hamas?",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-thai-dccc8d8da8c56d5122a21a6b89c7175d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff60298/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fc4%2F7293a29630becb213c675e22813e%2F10db5e2dad1a4a0db7874766d262fc7a"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Israel has released 183 Palestinian prisoners in the latest exchange for Israeli hostages held in Gaza, part of a ceasefire that has paused the war but whose future is uncertain. Israel views the prisoners as terrorists, while Palestinians see them as freedom fighters resisting a decadeslong military occupation. Nearly every Palestinian has a friend or family member who has been jailed by Israel at some point, for militant attacks or lesser offenses such as rock-throwing, protesting or membership in a banned political group. Some are held for months or years without trial.",
      "publishedAt": "2025-02-08T11:40:46Z",
      "title": "Who are the Palestinian prisoners released in exchange for Israeli hostages?",
      "url": "https://apnews.com/article/palestinian-prisoners-gaza-ceasefire-israel-hamas-080ad5704f8e4763f28a94274d9efa2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7cebbb9/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fc8%2F80cbe298e7f3081979d294e0650d%2F1d2b96b4a5c04fbd85f3014ea315eee0"
    },
    {
      "author": null,
      "description": "Israel and Hamas are in the midst of a six-week ceasefire during which Hamas is releasing dozens of the hostages captured in its Oct. 7, 2023, attack in exchange for hundreds of Palestinian prisoners. The sides have already carried out five swaps since the ceasefire went into effect last month. In all, Hamas has agreed to release 33 Israeli hostages for nearly 2,000 prisoners and detainees during this first phase of the ceasefire. The sides still need to negotiate a second phase of the ceasefire that would be aimed at returning all remaining hostages, releasing additional prisoners and ending the war.",
      "publishedAt": "2025-02-07T19:25:41Z",
      "title": "A look at the hostages taken to Gaza by Hamas, by the numbers",
      "url": "https://apnews.com/article/israel-hostages-hamas-ceasefire-gaza-bc81ab899aed78a90a5ff42088b0f79d",
      "urlToImage": "https://dims.apnews.com/dims4/default/48589cc/2147483647/strip/true/crop/4907x2760+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Fc4%2Fff0ca446bd81c42ef39b87e78c20%2F8c0a23a876f545d4b6ccbfee45453f40"
    },
    {
      "author": "SEJAL GOVINDARAO",
      "description": "A record 13 women had been serving as governor this year. But many state constitutions still presume officeholders will be male. South Dakota voters rejected an effort in November to update their state constitution by replacing references to “he” with “the governor.” Kristi Noem, the state's first female governor, supported a change to use gendered language. She has since joined President Donald Trump's Cabinet. Most states haven't modernized their constitutions to reflect the rise of women in politics. New York and Vermont are among the states that did decades ago. A Connecticut state senator plans to make another run at updating the constitution there during this year's legislative session.",
      "publishedAt": "2025-02-09T04:57:10Z",
      "title": "As female representation hits new highs among states, constitutions still assume officials are male",
      "url": "https://apnews.com/article/state-constitutions-gendered-language-governor-c38f6e4eee31434c5f3d6b8a4ad6b4d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/453f281/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Ffa%2F5abe9c35dd9e6d68e2b914ab4a95%2F443029d0664e4ca79db62e160f6e04d7"
    },
    {
      "author": "FERNANDA FIGUEROA",
      "description": "As jobs become more reliant on technology some Latino workers can be left behind due to a lack of digital skills exacerbated by a lack of accessibility. Latinos remain an integral part of jobs in agriculture, construction, retail and food services but these jobs are also at risk of automation, leaving some Latinos unprepared for a changing role that relies more on technology, according to a new report by researchers at the University of California, Los Angeles. Analysis from the UCLA Latino Policy Institute showed that Latinos are over-represented in fields at risk of automation The report also provided some suggestions suggestion on how to improve Latino economic mobility.",
      "publishedAt": "2025-02-09T04:48:28Z",
      "title": "Latino workers working to overcome a technological divide brought on by automation, AI",
      "url": "https://apnews.com/article/automations-impact-latino-workforce-a7ff825cc2fa0eb8174eafa5e4029cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/32a1d75/2147483647/strip/true/crop/5513x3101+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Ffd%2F49e6ce0270769c55f62c95adaadb%2F9974cdda5cf54a11841dace7eebba56b"
    },
    {
      "author": "JEFF MARTIN",
      "description": "In the farm town where Cooper DeJean drew up football plays for his friends in elementary school, residents are planning a huge party for the Super Bowl. In DeJean's hometown of Odebolt, Iowa, residents plan to pack the town's community building to watch their native son on football's biggest stage. The Philadelphia Eagles defensive back has lifted spirits in the town of 920 residents once known as the Popcorn Capital of the World. Townspeople say he’s also inspired children in this remote part of Western Iowa. That's where DeJean played high school football in small-town stadiums carved out of cornfields.",
      "publishedAt": "2025-02-09T04:50:58Z",
      "title": "In Iowa's farm country, small towns rally around a native son in football's biggest game",
      "url": "https://apnews.com/article/super-bowl-iowa-cooper-dejean-odebolt-112b07f0bceaa98b401981964585bea4",
      "urlToImage": "https://dims.apnews.com/dims4/default/87273aa/2147483647/strip/true/crop/5199x2924+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Faa%2Ff877c3914ede3defb3cf7cf058ee%2Ff6fa98cfb62840e495512cf23026526b"
    },
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH, TIA GOLDENBERG",
      "description": "Hamas-led militants have released three gaunt, frail-looking Israeli hostages and Israel freed 183 Palestinian prisoners in the fifth exchange of a ceasefire agreement that has paused the war in Gaza. The hostages’ condition and scenes of Hamas forcing them to speak in the handover sparked outrage in Israel. It could increase pressure on Prime Minister Benjamin Netanyahu to extend the ceasefire beyond its current six-week phase. U.S. President Donald Trump’s stunning proposal to transfer the Palestinian population out of Gaza does not appear to have affected the truce's current phase. But it could complicate talks over the second and more difficult one.",
      "publishedAt": "2025-02-08T04:17:11Z",
      "title": "Israel confirms it has received 3 hostages freed by Hamas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-08-2025-bf94014ccedeb15b4d235a1df57b563a",
      "urlToImage": "https://dims.apnews.com/dims4/default/189a088/2147483647/strip/true/crop/5700x3206+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Ff1%2F5a3b2f25e9a9e05e9d20fb85851f%2Fd5366490090d455b8682ff2d136f42e9"
    },
    {
      "author": "GERALD IMRAY",
      "description": "Groups representing some of South Africa’s white minority have responded to a plan by U.S. President Donald Trump to offer them refugee status and resettlement in the United States by saying: thanks, but no thanks. The plan was detailed in an executive order Trump signed Friday that stopped all aid and other financial assistance to South Africa as punishment for what his administration said were “rights violations” against white South Africans. The South African government denies it. Two of the most prominent groups representing Afrikaners said Saturday they are here to stay, but thanked Trump for raising their issues.",
      "publishedAt": "2025-02-08T15:44:24Z",
      "title": "Trump says some white South Africans are oppressed and could be resettled in the US. They say no thanks",
      "url": "https://apnews.com/article/trump-south-africa-afrikaners-0120efec17122b47e3371e0e39fe1db8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d8ae7a/2147483647/strip/true/crop/4205x2365+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fe0%2F6245833f772feedd0622dcb3a7d3%2F25f71951df3e41a6ac24ac101dbadc5c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}