{
  "articles": [
    {
      "author": "Justin Spike",
      "description": "President Donald Trump has blamed Ukraine for starting the war that has cost tens of thousands of Ukrainian lives. His comments caused outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military. Trump called Ukrainian President Volodymyr Zelenskyy “a dictator without elections” and claimed his support among voters was near rock-bottom. Zelenskyy said Wednesday that the disinformation is coming from Russia, and some of what Trump has said does echo Russia’s own narrative of the conflict.",
      "publishedAt": "2025-02-19T19:25:37Z",
      "title": "Trump says Ukraine started the war that's killing its citizens. What are the facts?",
      "url": "https://apnews.com/article/ukraine-russia-trump-war-zelenskyy-putin-7fe8c0c80b4e93e3bc079c621a44e8bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5822ed/2147483647/strip/true/crop/4660x2621+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F73%2F3ffa368b078fb7b1d2221155e464%2Fafce5fdda4064e0baba94ac9c75ace9a"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump signed an executive order meant to expand access to and reduce costs of IVF. He also issued a presidential memorandum calling for “radical transparency requirements” from the government, which he suggested could reduce wasteful spending.",
      "publishedAt": "2025-02-19T07:36:00Z",
      "title": "Live updates: Trump signs executive order to study how to expand IVF",
      "url": "https://apnews.com/live/trump-presidency-updates-2-19-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/479232b/2147483647/strip/true/crop/6220x3499+0+324/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fa5%2F950fb27e8241ea2a8cde2b9f3442%2F5a42854355b449fea974ab4c7779c6b6"
    },
    {
      "author": "JUSTIN SPIKE, HANNA ARHIROVA",
      "description": "Ukraine President Volodymyr Zelenskyy says U.S. President Donald Trump is living in a Russian-made “disinformation space” as a result of his administration’s discussions with Kremlin officials. Trump suggested Tuesday that Ukraine was to blame for the war on its territory, which enters its fourth year next week. Zelenskyy spoke as Trump's envoy, Keith Kellogg, arrived in Kyiv for talks. Talks between top American and Russian diplomats in Saudi Arabia on Tuesday sidelined Ukraine and its European supporters. Trump’s comments marked a major shift in U.S. policy after years of efforts to isolate Russian President Vladimir Putin and are likely to vex Ukrainian officials.",
      "publishedAt": "2025-02-19T09:26:37Z",
      "title": "Trump is living in a Russian 'disinformation space,' says Zelenskyy",
      "url": "https://apnews.com/article/russia-ukraine-war-kellogg-zelenskyy-437f4c8fa4531059007dd3ab00c23458",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f7a422/2147483647/strip/true/crop/4510x2537+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fa5%2F69f5efbd4d1536e1086433991451%2F0a228c468c9d4ffb8a668a67696e9dbb"
    },
    {
      "author": "STEPHEN McGRATH, NICOLAE DUMITRACHE",
      "description": "NATO members are continuing their largest combat exercises of 2025 amid concern within the 32-nation alliance over its most powerful member, the United States. The drills in Romania come as a shaken Europe grapples with a new U.S. course under President Donald Trump. His defense secretary has demanded that allies dramatically ramp up military spending and said U.S. security priorities lie elsewhere. That cast doubts on Washington’s longstanding security guarantees provided to Europe. The NATO exercises also come days before the third anniversary of Russia’s full-scale invasion of Ukraine.",
      "publishedAt": "2025-02-19T14:21:31Z",
      "title": "A worried NATO holds large-scale combat drills as the US stance on Europe shifts under Trump",
      "url": "https://apnews.com/article/romania-nato-europe-russia-ukraine-us-f192b88b03f56d81fed0770fca445ba9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0d9efb/2147483647/strip/true/crop/7568x4257+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F9c%2F109acd51b1f2eb289908adee0449%2F5a50f6fe509341409fb02e4ab759e96a"
    },
    {
      "author": "Stephany Matat, Aamer Madhani, Mike Pesoli",
      "description": "President Donald Trump has warned Ukrainian President Volodymyr Zelenskyy that he “better move fast” to negotiate an end to Russia’s invasion of Ukraine or risks not having a nation to lead. The rhetoric from Trump toward Ukraine comes amid an escalating back-and-forth between the two presidents and rising tensions between the United States and much of Europe over Trump’s approach to settling the biggest conflict on the continent since World War II. Trump’s broadside came not long after Zelenskyy’s comment that Trump was being influenced by Russian disinformation as he tries to bring the fighting to a close on terms that Kyiv says are too favorable to Moscow.",
      "publishedAt": "2025-02-19T16:31:40Z",
      "title": "Trump warns Zelenskyy to quickly negotiate war's end with Russia or risk not having a nation to lead",
      "url": "https://apnews.com/article/trump-zelenskyy-ukraine-russia-war-7d18400b935166773bbd3b3323c8aa5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/224bc35/2147483647/strip/true/crop/7610x4281+0+396/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F34%2F4880976a2a42cd68b434c5eaebf1%2Ff7c9c46a6525423c8ba561637deecfab"
    },
    {
      "author": "Fatima Hussein",
      "description": "The new head of the Social Security Administration says deceased centenarians are “not necessarily receiving benefits.\" The comments Wednesday by acting commissioner Lee Dudek contradict claims by President Donald Trump and billionaire adviser Elon Musk that tens of millions of dead people over 100 years old are getting payments from the agency. While it's true improper payments have been made, including some to dead people, the numbers thrown out by Musk and the White House are overstated and misrepresent Social Security data. Dudek said that the database defaults entries with missing or incomplete birthdates to a reference point of more than 150 years ago, but that doesn't mean they're getting money.",
      "publishedAt": "2025-02-19T20:20:36Z",
      "title": "New Social Security chief contradicts claims that millions of dead people are getting payouts",
      "url": "https://apnews.com/article/social-security-doge-musk-trump-improper-payments-57f9e374e77e7a24fdff3afa294aa7fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "MICHELLE GUMEDE",
      "description": "U.S. Secretary of State Marco Rubio will skip a meeting of foreign ministers from the leading rich and developing nations, known as the Group of 20, that starts on Thursday. This comes after he criticized the policies of host South Africa, which holds the G20 presidency, as anti-American. Rubio was instead headed back to the United States from his first trip to the Middle East as America’s chief diplomat. He led a U.S. delegation in talks with Russia in Saudi Arabia over the war in Ukraine. Senior European diplomats are all expected at the G20 meeting in Johannesburg, as are Russian Foreign Minister Sergey Lavrov and Chinese Foreign Minister Wang Yi.",
      "publishedAt": "2025-02-19T14:35:18Z",
      "title": "Rubio will skip a G20 meeting after calling host South Africa's policies anti-American",
      "url": "https://apnews.com/article/rubio-trump-g20-south-africa-eu-f586fb63186ac09877a2cd80bb7f6b56",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f02b72/2147483647/strip/true/crop/4229x2379+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F93%2Fa2692ccc36a1b8e8a7c2203ca458%2F15dcc0fbcd494843a1e12a39c1a1d8ec"
    },
    {
      "author": "Nathan Ellgren, Ashraf Khalil",
      "description": "About 300 protesters rallied outside the headquarters of the Department of Health and Human Services. Many of them were current or former federal employees. They were protesting on Wednesday the recent firings and their effect on public health, and directed much of their ire at Elon Musk and his agency’s efforts to cut spending. Amid frigid temperatures and light snow, attendees chanted slogans like “Funding, not freezes” and “Stand up, fight back.” They carried signs reading “Protect civil servants because they protect you!” and “In science we trust.” Some talked about issues with continuing research because of cuts from Musk's Department of Government Efficiency. They said they were there to fight the confusion its workforce reductions have sowed.",
      "publishedAt": "2025-02-19T22:04:01Z",
      "title": "Hundreds rally against firing of federal workers, emphasizing threats to public health",
      "url": "https://apnews.com/article/federal-workers-firings-protest-workforce-public-health-5119d6b7f39aad1bce2dc904075b34e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4e6496/2147483647/strip/true/crop/8049x4528+0+419/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Faa%2F58f04b4e5e58b926012d0db76bb6%2F833394b130204ab28f3a2ef9ffd23f4e"
    },
    {
      "author": "Will Weissert",
      "description": "It’s been a lingering question since the election: How long can a partnership between two billionaires who love being the center of attention last? In a joint Fox News Channel interview that aired Tuesday, Donald Trump and adviser Elon Musk Musk insisted they like each other a lot and would stick with their arrangement despite what the president said were attempts to “drive us apart.” That means joining forces to slash the federal bureaucracy and size of government. But Trump and Musk weren't always friends. And it's often those once closest to Trump often end up as his fiercest critics.",
      "publishedAt": "2025-02-19T22:24:07Z",
      "title": "Trump and Musk say they like working together. Will the bromance last?",
      "url": "https://apnews.com/article/trump-musk-hannity-joint-interview-lovefest-history-a8c289c58f5757fa6c27e324acfb753e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b651d7a/2147483647/strip/true/crop/5077x2856+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F71%2Fccb441b32272691c1f4e8ec9e528%2Fdab56e8655f04d9ab321bd62f80922cc"
    },
    {
      "author": "NICOLE WINFIELD, ANDREA ROSA, PAOLO SANTALUCIA",
      "description": "Italian Premier Giorgia Meloni has visited Pope Francis in the hospital and says he’s “alert and responsive” and full of good humor despite his pneumonia. In a statement issued by her office, Meloni said: ”We joked around as always. He has not lost his proverbial sense of humor.” Her visit marked the first confirmed outside visitor known to have called on the pope, beyond his secretaries and medical team, since his hospitalization Friday. The Vatican has said Francis, who had part of one lung removed as a young man, was up, eating and had gotten out of bed after a tranquil night, a day after tests confirmed he had pneumonia in both lungs on top of asthmatic bronchitis.",
      "publishedAt": "2025-02-19T07:31:47Z",
      "title": "Italian Premier Meloni visits Pope Francis in hospital and says he's in good spirits",
      "url": "https://apnews.com/article/pope-francis-vatican-respiratory-health-gemelli-rome-4afa8ce660cd74b30df15581adcf4239",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fda3be/2147483647/strip/true/crop/7241x4073+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F1c%2F12fbaf2606fa9beb3e6d5ab43f34%2F71ce521e48904e319880e5f9e910b2c6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}