{
  "articles": [
    {
      "author": "ZEKE MILLER, JOEY CAPPELLETTI and SEUNG MIN KIM",
      "description": "DETROIT (AP) — President Joe Biden on Friday forcefully defied the growing number of critics in his own party who have called on him to exit the race, pivoting to warnings about a second Donald Trump term and declaring he was “not done yet.”",
      "publishedAt": "2024-07-12T09:01:30Z",
      "title": "In 'blue wall' push, Biden defiantly says he's 'not going anywhere' as he slams Trump, Project 2025",
      "url": "https://apnews.com/e0f71b95bc8761b1a39083b1b9af6e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48cefe461bc7406f9d233427fe8aad29/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "For all the usual stagecraft, the Republican National Convention that opens Monday is different from Donald Trump's previous nominating affairs.",
      "publishedAt": "2024-07-12T05:03:32Z",
      "title": "Republicans are gathering in Milwaukee to nominate Donald Trump again. Here's what to expect",
      "url": "https://apnews.com/702139084873df3d633ee19d1b82e5f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c96ea90a852441e5aa250170e36bdc7b/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — A New Mexico judge on Friday brought a sudden and stunning end to the involuntary manslaughter case against Alec Baldwin, dismissing it in the middle of the actor's trial and saying it cannot be filed again.",
      "publishedAt": "2024-07-12T04:01:37Z",
      "title": "Alec Baldwin weeps in court as judge announces involuntary manslaughter case is dismissed midtrial",
      "url": "https://apnews.com/eb3059c696a9aee5cb86967e27d8f3bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ea9462e4b55451ca05f1e3579e9f18c/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — A New Mexico judge dismissed the involuntary manslaughter case against Alec Baldwin over the fatal shooting of cinematographer Halyna Hutchins in a sudden move Friday.",
      "publishedAt": "2024-07-13T01:01:17Z",
      "title": "What’s next for Alec Baldwin after involuntary manslaughter case dismissal",
      "url": "https://apnews.com/fa647a4a3a503800400d9e06a88f3882",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da927f0ccb6149bc957d4b0dd30605e9/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Nancy Pelosi’s phone lit up the night of President Joe Biden’s debate performance with a question that has yet to be fully resolved: Now what?",
      "publishedAt": "2024-07-12T20:47:46Z",
      "title": "Pelosi and Democratic leaders try to guide their party through Biden uproar",
      "url": "https://apnews.com/28ca690455cc04a6faccda9daad1a22a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8281706a5d34f4284862e04b7226f2d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge threw out Rudy Giuliani ’s bankruptcy case on Friday, slamming the former New York City mayor as a “recalcitrant debtor” who thumbed his nose at the process while seeking to shield himself from a $148 million defamation judgment and other debts.",
      "publishedAt": "2024-07-12T19:09:27Z",
      "title": "Judge ends Rudy Giuliani bankruptcy case, says he flouted the process with his lack of transparency",
      "url": "https://apnews.com/3cf8d70d1dc2608705c9f938bbb8941d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01a8cd7b16cd48f2a5723c1ec07a907b/3000.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "Here's a troubling phrase hurricane forecasters hate but often hear: “It's just a Category 1. Nothing to worry about.”Or even worse: “Tropical storm? Just some wind and rain.”But look at Hurricane Beryl, which hit Texas this week as a “mere” Category 1 storm — far weaker in wind strength than when it swept through the Caribbean as a Cat 5 just days earlier — yet still knocked out power to 2.7 million customers.",
      "publishedAt": "2024-07-12T17:34:53Z",
      "title": "Just a Category 1 hurricane? Don't be fooled by a number — it could be more devastating than a Cat 5",
      "url": "https://apnews.com/5f0c06c5a03aa753c04040271099226d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42a0d3d518344e0db14a8f0a733fc5f3/1920.jpeg"
    },
    {
      "author": "BY DYEPKAZAH SHIBAYAN",
      "description": "ABUJA, Nigeria (AP) — A two-story school collapsed during morning classes Friday in north-central Nigeria, killing 22 students and sending rescuers on a frantic search for more than 100 people trapped in the rubble, authorities said.",
      "publishedAt": "2024-07-12T18:26:50Z",
      "title": "The collapse of a school in northern Nigeria leaves 22 students dead, officials say",
      "url": "https://apnews.com/13786ecf0be75fae5545a6d88a19b532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/188ecc457e7941599777311f4aae75aa/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Civil defense workers on Friday dug bodies out of collapsed buildings and pulled them off rubble-covered streets, as they collected dozens of Palestinians killed this week by an Israeli assault in a district of Gaza City.",
      "publishedAt": "2024-07-12T12:24:28Z",
      "title": "Emergency workers uncover dozens of bodies in a Gaza City district after Israeli assault",
      "url": "https://apnews.com/0b0b323dd471bacd18d135cf9e597e0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbe92e6d4ba24f4e96b46c1baff4cac8/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A SpaceX rocket has failed for the first time in nearly a decade, leaving the company’s internet satellites in an orbit so low that they're doomed to fall through the atmosphere and burn up.",
      "publishedAt": "2024-07-12T18:47:50Z",
      "title": "SpaceX rocket accident leaves company's Starlink satellites in wrong orbit",
      "url": "https://apnews.com/13c3cde5c8053776e3944f328e92fd59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3529117755f40c3a71414d0da4b611c/1444.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}