{
  "articles": [
    {
      "author": null,
      "description": "TEL AVIV, Israel (AP) — Israel rescue official says at least 10 killed in rocket strike, deadliest attack since start of fighting with Hezbollah.",
      "publishedAt": "2024-07-27T17:42:56Z",
      "title": "Israel rescue official says at least 10 killed in rocket strike, deadliest attack since start of fighting with Hezbollah",
      "url": "https://apnews.com/cf192533706304dab3b4d196a8e99950",
      "urlToImage": ""
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "ST. CLOUD, Minn. (AP) — Donald Trump is taking his campaign back to Minnesota, a state that has favored Democrats but that the former president thinks could be in his reach this year.",
      "publishedAt": "2024-07-27T04:04:41Z",
      "title": "Trump is returning to Minnesota with Midwesterner Vance to try to swing Democrat-leaning state",
      "url": "https://apnews.com/22aee6ecb821032328c1e3d210b27733",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be20ecee8bb34fb5ad21e7e72ab3b5d9/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — All of a sudden it's Kamala Harris ' economy — a major opportunity as well as a possible risk for the likely Democratic presidential nominee.",
      "publishedAt": "2024-07-27T12:24:35Z",
      "title": "Harris freshens up her message on the economy as Trump and Republicans go after her on inflation",
      "url": "https://apnews.com/f52edb07e4bd4adf01b484744fc7d387",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b9aea2065548298b141b5d1a0135e7/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM METZ",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes hit a school used by displaced Palestinians in central Gaza on Saturday, killing at least 30 people including several children, as the country’s negotiators prepared to meet international mediators about a proposed cease-fire.",
      "publishedAt": "2024-07-27T07:11:58Z",
      "title": "An Israeli airstrike hits a school sheltering people in Gaza, killing at least 30 including children",
      "url": "https://apnews.com/c95e8effebd9d4e4ba7e69bfbae61e04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fc37b1ca64246d49382c97217486fe9/1920.jpeg"
    },
    {
      "author": null,
      "description": "BEIRUT (AP) — An Israeli rescue official says 10 people were killed by a rocket strike in a town in the Israeli-controlled Golan Heights, in what would be the deadliest attack on an Israeli target since the fighting with the Lebanese militant group Hezbollah began.",
      "publishedAt": "2024-07-27T16:28:11Z",
      "title": "Rocket attack on town in Israeli-controlled Golan Heights kills 10, rescue official says",
      "url": "https://apnews.com/141600af654f48f733b33f9f0a26dbfe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b44023092024cefa5897ce42941cf02/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — “ Brats for Harris.” “ We need a Kamalanomenon. ” “ Gen Z feels the Kamalove.”",
      "publishedAt": "2024-07-27T04:10:27Z",
      "title": "'Gen Z feels the Kamalove': Youth-led progressive groups hope Harris will energize young voters",
      "url": "https://apnews.com/161caa432cf440a029e998409940b4a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f0f764dcd7047458d748b1fad32477a/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE and JOHN ANTCZAK",
      "description": "Thousands of firefighters were battling a wildfire in northern California on Saturday that exploded in size, scorching an area about the size of Los Angeles — one of several blazes tearing through the western United States and Canada amid dry, hot and windy conditions.",
      "publishedAt": "2024-07-27T04:17:00Z",
      "title": "California fire scorches through land the size of Los Angeles as blazes burn across US West",
      "url": "https://apnews.com/4ff0e51837119a32cc805efc46967c94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7514e27d6f28460ebad7b8a081f965c6/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON",
      "description": "PARIS (AP) — In an unprecedented display of inclusivity, drag queens took center stage at the Paris Olympics opening ceremony, showcasing the vibrant and influential role of the French LGBTQ+ community — while also attracting criticism over a tableau reminiscent of “The Last Supper.”",
      "publishedAt": "2024-07-27T16:20:12Z",
      "title": "Drag queens shine at Olympics opening, but 'Last Supper' tableau draws criticism",
      "url": "https://apnews.com/c635aa276be1147e4643231bdbe5478e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e287fd0e84549d89c1ea891508484b7/3000.jpeg"
    },
    {
      "author": "DEEPA BHARATH",
      "description": "MESCALERO, New Mexico (AP) — Anne Marie Brillante never imagined she would have to choose between being Apache and being Catholic.To her, and many others in the Mescalero Apache tribe in New Mexico who are members of St.",
      "publishedAt": "2024-07-27T12:12:37Z",
      "title": "Apache Christ icon controversy sparks debate over Indigenous Catholic faith practices",
      "url": "https://apnews.com/5e8c0331dabb1a80b36b08c7327601f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab170299abc54bd5a401ac75f9ec6155/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — “Move fast and break things,” a high-tech mantra popularized 20 years ago by Facebook founder Mark Zuckerberg, was supposed to be a rallying cry for game-changing innovation. It now seems more like an elegy for a society perched on a digital foundation too fragile to withstand a defective software program that was supposed to help protect computers — not crash them.",
      "publishedAt": "2024-07-27T11:46:29Z",
      "title": "Technology's grip on modern life is pushing us down a dimly lit path of digital land mines",
      "url": "https://apnews.com/f314f7919e5ac2d0d40682f13df00778",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/228f6ddad42b4bde981dcae5ec8b2424/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}