{
  "articles": [
    {
      "author": "JULIO CORTEZ, KATE PAYNE and HAVEN DALEY",
      "description": "ST. PETERSBURG, Fla. (AP) — Rescue teams plucked Florida residents from the flotsam of Hurricane Milton on Thursday after the storm smashed through coastal communities where it tore homes into pieces, filled streets with mud and spawned a barrage of deadly tornadoes. At least eight people were dead.",
      "publishedAt": "2024-10-10T05:21:44Z",
      "title": "Although Milton has moved on, at least 8 are dead and millions remain in the dark",
      "url": "https://apnews.com/5f6a112986eb6e21720f0f17c504afe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82600c13696c4019b94af85a8d08e19e/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — A pair of unwelcome and destructive guests named Helene and Milton have stormed their way into this year's presidential election.",
      "publishedAt": "2024-10-11T04:05:44Z",
      "title": "Back-to-back hurricanes reshape 2024 campaign’s final stretch",
      "url": "https://apnews.com/f1bf69434656bd693daf316db3842fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9969f43f78545fe997a81405c14db63/3000.jpeg"
    },
    {
      "author": "BILAL HUSSEIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israeli airstrikes on central Beirut on Thursday left two neighborhoods smoldering, killed 22 people and wounded dozens, Lebanon’s health ministry said, as well as further escalating Israel’s bloody conflict with Iran-backed Hezbollah militants in Lebanon.",
      "publishedAt": "2024-10-10T09:10:39Z",
      "title": "At least 22 killed in airstrikes in central Beirut, with Israel also firing on UN peacekeepers",
      "url": "https://apnews.com/a5e53cdd4fca30be1909506b5c777922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41d8f3b123fb4f5aab2bbc027079f851/3000.jpeg"
    },
    {
      "author": "ABDUL SATTAR",
      "description": "QUETTA, Pakistan (AP) — Gunmen killed 20 miners and wounded another seven in Pakistan’s southwest, a police official said Friday, drawing condemnation from authorities who have ordered police to trace and arrest those who are behind the killings.",
      "publishedAt": "2024-10-11T02:48:09Z",
      "title": "Gunmen kill 20 miners in an attack in southwest Pakistan ahead of an Asian security summit",
      "url": "https://apnews.com/b4302a6af4888c009212bea622f76679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c9da8b1cf664e71b0bc9463028ef1d4/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — A solid majority of Hispanic women have a positive opinion of Vice President Kamala Harris and a negative view of former President Donald Trump, but Hispanic men are more divided on both candidates, according to a recent poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-11T04:04:04Z",
      "title": "Harris viewed more positively by Hispanic women than by Hispanic men: AP-NORC poll",
      "url": "https://apnews.com/d42696a973e0988aed41bab2a46bb4cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8cd0e93ffdd49829c60c0a35bf90eea/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "AURORA, Colo. (AP) — The city of Aurora is roughly the size of pre-evacuation Tampa, Florida. With 400,000 people spread over 164 square miles, it has swank subdivisions, working-class neighborhoods and the high-end resort where Donald Trump will hold a rally Friday to highlight a city turned into “a war zone” by immigrants, in the words of his campaign.",
      "publishedAt": "2024-10-10T18:35:29Z",
      "title": "Trump seizes on one block of a Colorado city to warn of migrant crime threat, even as crime dips",
      "url": "https://apnews.com/c76df9f1dcda7e06a983105e5e970aeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20bc2d7db8a0406cb3f7324ec1929cba/1500.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MATTHEW BROWN",
      "description": "DENVER (AP) — Twelve people were rescued Thursday night after being trapped for about six hours at the bottom of a former Colorado gold mine when an elevator malfunctioned at the tourist site, authorities said.",
      "publishedAt": "2024-10-10T21:58:39Z",
      "title": "12 rescued from Colorado gold mine tourist site where elevator mishap killed 1 person",
      "url": "https://apnews.com/292aa17eb8ebdfc4baa16c4a4b4a0b62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/718564a7e9244e8ba3679e808030464a/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY and STEVE LeBLANC",
      "description": "BOSTON (AP) — Ethel Kennedy, the wife of Sen. Robert F. Kennedy, who raised their 11 children after he was assassinated and remained dedicated to social causes and the family’s legacy for decades thereafter, died on Thursday, her family said.",
      "publishedAt": "2024-10-10T15:30:05Z",
      "title": "Ethel Kennedy, social activist and wife of Robert F. Kennedy, has died",
      "url": "https://apnews.com/00eb88951db24e0cada9bd48b66ad8ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e41579508664078a5fe9e4f393a7871/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Koreans reacted with joy and astonishment on Thursday after learning that homegrown writer Han Kang won the Nobel Prize in literature, an unexpected moment that stoked national pride about the country’s growing cultural influence.",
      "publishedAt": "2024-10-10T16:01:07Z",
      "title": "South Koreans are joyful after Han Kang wins Nobel Prize for literature",
      "url": "https://apnews.com/e404fdbb3ca2079bf45e03023c6ad3b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2d688d3660e46e48686c3d3e3577511/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "Rafael Nadal’s tennis career will be remembered because of the numbers, yes — the 14 French Open trophies, the 22 Grand Slam titles overall, the nearly two decades in the top 10, and so on — and, without a doubt, because of his riveting rivalries with Roger Federer and Novak Djokovic.",
      "publishedAt": "2024-10-10T17:48:40Z",
      "title": "Rafael Nadal gave his all until he simply couldn’t anymore and had to retire: Analysis",
      "url": "https://apnews.com/0039ddaebd5413d9ab1340871501eddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5bd196302554c74b94ca8b55b39c5d2/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}