{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu said Sunday that the current phase of fighting against Hamas in Gaza is winding down, setting the stage for Israel to send more troops to its northern border to confront the Lebanese militant group Hezbollah.",
      "publishedAt": "2024-06-23T10:57:34Z",
      "title": "Netanyahu says Israel is winding down its Gaza operations. But he warns a Lebanon war could be next",
      "url": "https://apnews.com/bcc6c48de5c463fd68b7249f5b15bf5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/933da2158a034e5a8fd83ab73a860095/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Millions of Americans sweated through yet another scorching day as temperatures soared Sunday across the U.S., while residents were rescued from floodwaters that forced evacuations across the Midwest, including in an Iowa town where the flood gauge was submerged.",
      "publishedAt": "2024-06-23T15:05:54Z",
      "title": "Millions swelter as temperatures soar across the US, while floodwaters inundate the Midwest",
      "url": "https://apnews.com/45e54e79787626291194be620bb67e10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7ec82c00430433d900172e350d5af29/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump has narrowed his vice presidential shortlist to a handful of contenders as he prepares to announce his pick in the days before — or perhaps even at — next month’s Republican National Convention.",
      "publishedAt": "2024-06-23T18:49:42Z",
      "title": "Here's a look at Trump's VP shortlist and why each contender may get picked or fall short",
      "url": "https://apnews.com/8b6a3a22eecdfff668a5002ddfd3af18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df3b469fe3c4434cab8934b7fe5baf54/3000.jpeg"
    },
    {
      "author": "SUDHIN THANAWALA",
      "description": "Callie Weems was reveling in her new role as a mom in the months before a gunman in Arkansas fatally shot her at a grocery store.Her daughter Ivy, now 10 months old, was a constant source of entertainment and wonder, Weems’ mother, Helen Browning, 53, said in a phone interview on Sunday as she shared memories of her daughter.",
      "publishedAt": "2024-06-23T02:23:50Z",
      "title": "New mom who delighted in her daughter is among the dead in Arkansas grocery store shooting",
      "url": "https://apnews.com/2accbd7f3bef7987c84ca8f12c60de69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c27e9aa45234d8898ea9f4fb262add8/2750.jpeg"
    },
    {
      "author": null,
      "description": "RUIDOSO, N.M. (AP) — Full-time residents of Ruidoso will be allowed to return to their village Monday morning as federal authorities seek to prosecute whoever started a pair of New Mexico wildfires that killed two people and destroyed or damaged more than 1,400 structures.",
      "publishedAt": "2024-06-23T18:29:25Z",
      "title": "FBI seeks suspects in 2 New Mexico wildfires that killed 2 people, damaged hundreds of buildings",
      "url": "https://apnews.com/fa7b2c673100d16c16cbc4ecff6a9ead",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dbe185b4be64cd2b9a86dd6994341fb/3000.jpeg"
    },
    {
      "author": "JIMMY GOLEN",
      "description": "CROMWELL, Conn. (AP) — Six climate protesters stormed the 18th green while the leaders were lining up their putts for the final hole of regulation at the PGA Tour's Travelers Championship on Sunday, spraying smoke and powder and delaying the finish for about five minutes.",
      "publishedAt": "2024-06-23T20:38:39Z",
      "title": "Six climate protesters run onto 18th green and spray powder, delaying finish of PGA Tour event",
      "url": "https://apnews.com/bc3e9408e9417b8520fe866795761fe2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/810fe57cdc924d469b32bee3c4357401/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "ESPARGOS, Cape Verde (AP) — The top U.S. military officer warned on Sunday that an Israeli military offensive into Lebanon would risk an Iranian response in defense of the powerful Hezbollah militant group there, triggering a broader war that could put U.S.",
      "publishedAt": "2024-06-23T20:36:03Z",
      "title": "An Israel offensive into Lebanon risks an Iranian military response, top US military leader says",
      "url": "https://apnews.com/82d714dfca0d34fd44f565cf859818c0",
      "urlToImage": ""
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — More than 1,300 people died during this year’s Hajj pilgrimage in Saudi Arabia as the faithful faced extreme high temperatures at Islamic holy sites in the desert kingdom, Saudi authorities announced Sunday.",
      "publishedAt": "2024-06-23T08:25:38Z",
      "title": "Death toll at Hajj pilgrimage rises to 1,300 amid scorching temperatures",
      "url": "https://apnews.com/9f97aae1032b14ada29bbea7108195d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e144f511232484a9dfbf8802baba71c/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Armed militants attacked two Orthodox churches, a synagogue and a traffic police post in two cities in Russia’s southern republic of Dagestan, killing a priest and at least six police officers, Russian authorities reported Sunday.",
      "publishedAt": "2024-06-23T18:49:05Z",
      "title": "Armed militants in Dagestan kill priest and police in attacks on churches, synagogue and police post",
      "url": "https://apnews.com/d4ceba71308ab75b28e128991776b2b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36d8e1d37b6048418a83a2e56fb85f28/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Behind the smiles, the balloons and the red-carpet pageantry of President Vladimir Putin's visit to North Korea last week, a strong signal came through: In the spiraling confrontation with the U.S.",
      "publishedAt": "2024-06-23T04:02:41Z",
      "title": "With its new pact with North Korea, Russia raises the stakes with the West over Ukraine",
      "url": "https://apnews.com/556492779b6a32c4cf74b992741d91a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32ec843d9bef4a9fa223625a2ad9baa6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}