{
  "articles": [
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — In the first court hearing in nearly a year, a lawyer for Donald Trump clashed on Thursday with the judge in the federal election interference prosecution of the former president after suggesting the government was rushing forward with an “illegitimate” indictment at the height of the White House campaign.",
      "publishedAt": "2024-09-05T04:16:43Z",
      "title": "Courtroom clash in Trump's election interference case as the judge ponders the path ahead",
      "url": "https://apnews.com/f29a81ddd995b15afe95fcc00e928465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/650ae7c16f7d4697971019656b3449a3/3000.jpeg"
    },
    {
      "author": "AMY TAXIN, DEEPA BHARATH, ALEX VEIGA and CLAUDIA LAUER",
      "description": "LOS ANGELES (AP) — Hunter Biden plans to change his not guilty plea to avoid going to trial on federal tax evasion charges , his defense attorney said Thursday, appearing to surprise prosecutors and the judge just as jury selection was set to begin.",
      "publishedAt": "2024-09-05T04:06:43Z",
      "title": "Hunter Biden intends to change not guilty plea in his federal tax case, defense attorney says",
      "url": "https://apnews.com/6873692c030244b450e27826e7097946",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6437709d8aa64ae2b52443a0141899b8/1920.jpeg"
    },
    {
      "author": "JILL COLVIN, ADRIANA GOMEZ LICON and JOSH BOAK",
      "description": "NEW YORK (AP) — Former President Donald Trump told a group of executives and industry leaders on Thursday he wants to lead a “national economic renaissance” by slashing regulations to boost energy production, embracing cryptocurrencies and drastically cutting government spending as well as corporate taxes for companies that produce in the U.S.",
      "publishedAt": "2024-09-05T15:28:26Z",
      "title": "Trump says he'll boost the economy by cutting federal spending and corporate taxes",
      "url": "https://apnews.com/15ba5ecfdf5e907bd9b2c349b07222b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b794395849c64b0a81b9019c2e1881a4/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "WINDER, Ga. (AP) — The teen charged with opening fire at a Georgia high school denied making prior threats when police interviewed him last year as they looked into online posts threatening a school shooting.",
      "publishedAt": "2024-09-05T05:55:59Z",
      "title": "The teen charged with killing 4 people at a Georgia high school denied prior online threats in 2023",
      "url": "https://apnews.com/c3c97267a4dfff64a59e1605e515c2f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a516b76a124848dabd70c9c40c7f338a/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Laid off by the music streaming service Spotify last year, Joovay Arias figured he’d land another job as a software engineer fairly soon. His previous job search, in 2019, had been a breeze.",
      "publishedAt": "2024-09-05T07:00:21Z",
      "title": "You aren't likely to lose a job in the US but may find it harder to land one",
      "url": "https://apnews.com/7e080c656c58b2815653a706c2abf851",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47641043cbb44d2e92e8dc2c840c01a2/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE and NICKY FORSTER",
      "description": "WASHINGTON (AP) — Federal regulators responsible for the safety of the U.S. drug supply are still struggling to get back to where they were in 2019, before the COVID-19 pandemic upended factory inspections in the U.S. and across the world, The Associated Press has found.",
      "publishedAt": "2024-09-05T13:15:03Z",
      "title": "Nearly 2,000 drug plants are overdue for FDA checks after COVID delays, AP finds",
      "url": "https://apnews.com/7b3a7e9b45bcc3aea86ce5bf781271f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aad755249524296ba855241f85946c5/1920.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Fewer adolescents are vaping this year than at any point in the last decade, government officials reported Thursday, pointing to a shrinking number of high school students who are using Elf Bar and other fruity, unauthorized e-cigarettes.",
      "publishedAt": "2024-09-05T17:03:16Z",
      "title": "Teen vaping hits 10-year low in the US",
      "url": "https://apnews.com/9d25127da2db9cbc2634fae13511ef09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a6a851414964c61b6499f95e8a60575/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — The U.S. government has charged a Russian-born U.S. citizen and former adviser to Donald Trump's 2016 presidential campaign with working for a sanctioned Russian state television network and laundering the proceeds.",
      "publishedAt": "2024-09-05T16:42:37Z",
      "title": "US charges former Trump 2016 campaign adviser Dimitri Simes over work for sanctioned Russian TV",
      "url": "https://apnews.com/f0b0fe681c821f735c4e951736f041c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f3e2520b0b4341a81d4beb596b3949/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "BANGKOK (AP) — The decision by New York prosecutors to charge a former aide to the New York governor this week with acting as an illegal agent for the Chinese government has raised concerns about China's efforts to influence U.S.",
      "publishedAt": "2024-09-05T13:52:10Z",
      "title": "Why is Beijing interested in a mid-level government aide in New York State?",
      "url": "https://apnews.com/328b9d2862dac908a827f18f106e258e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caa352b8a2ec4415b792b95ea4f349bd/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D.",
      "description": "GUATEMALA CITY (AP) — The U.S. government announced Thursday that it secured the release of 135 Nicaraguan political prisoners, who have arrived in Guatemala where they will apply for entry to the United States or other countries.",
      "publishedAt": "2024-09-05T13:48:04Z",
      "title": "US secures the release of 135 Nicaraguan political prisoners",
      "url": "https://apnews.com/7244a080da577a7992d55e2677630861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4b1409b73d84e9dae8b3bc12504f489/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}