{
  "articles": [
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French voters face a decisive choice Sunday in the runoff of snap parliamentary elections that could produce the country’s first far-right government since the World War II Nazi occupation — or leave it with no majority emerging at all.",
      "publishedAt": "2024-06-30T22:24:33Z",
      "title": "It's France's moment of truth. Here's how its snap elections work and what comes next",
      "url": "https://apnews.com/193233ade08821a71731980d8a17eb4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5a6d164bc64aa4a3b65f93da02099c/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER and LISA MASCARO",
      "description": "WILMINGTON, Del. (AP) — To a defiant President Joe Biden, the 2024 election is up to the public — not the Democrats on Capitol Hill.",
      "publishedAt": "2024-07-06T15:45:18Z",
      "title": "To a defiant Biden, the 2024 race is up to the voters, not to Democrats on Capitol Hill",
      "url": "https://apnews.com/25a863ba1ca3d6d01d8cc69a61274321",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b91e3c88b23a4de590066fc9d67480c9/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Voting opened Sunday in France for the second round of high-stake legislative elections that have already seen the largest gains ever for the country’s far-right National Rally party.",
      "publishedAt": "2024-07-07T04:00:38Z",
      "title": "France is voting in key elections that could see a historic far-right win or a hung parliament",
      "url": "https://apnews.com/08f10a7416a2494c85dcd562f33401d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59e472f55aa54d4e8bcc5c134089f42d/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, REBECCA BOONE and SCOTT SONNER",
      "description": "LAS VEGAS (AP) — Roughly 130 million people were under threat over the weekend and into next week from a long-running heat wave that broke or tied records with dangerously high temperatures and is expected to shatter more from East Coast to West Coast, forecasters said.",
      "publishedAt": "2024-07-07T04:24:47Z",
      "title": "Torrid heat bakes millions of people in large swaths of US, setting records and fanning wildfires",
      "url": "https://apnews.com/f64b0459aaf83e0a4a12ab6d5e626bb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4647201c0b42ed8051c90405555a39/1920.jpeg"
    },
    {
      "author": "JUAN LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — Beryl was hurtling across the warm waters of the Gulf of Mexico on a collision course with Texas, forecast to pick up strength and regain hurricane status before nearing the coast Sunday and making landfall the following day with heavy rains, howling winds and dangerous storm surge.",
      "publishedAt": "2024-07-07T04:06:37Z",
      "title": "Beryl bears down on Texas, where it is expected to hit after regaining hurricane strength",
      "url": "https://apnews.com/a01a44797f9de77a54b3a8be454ea37f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/169e971f18a9471293728c7ac2507676/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza (AP) — Hamas has given its initial approval of a U.S.-backed proposal for a phased cease-fire deal in Gaza, dropping a key demand that Israel commit up front to a complete end to the war, a Hamas official and an Egyptian official said Saturday.",
      "publishedAt": "2024-07-06T11:11:26Z",
      "title": "Hamas clears the way for a possible cease-fire in Gaza after dropping key demand, officials say",
      "url": "https://apnews.com/77910b6fae70ac1ff4eb3ac278852b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ef47a093204a00b2f26544e416c232/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL and AMIR VAHDAT",
      "description": "DUBAI, United Arab Emirates (AP) — Reformist candidate Masoud Pezeshkian won Iran’s runoff presidential election Saturday, besting hard-liner Saeed Jalili by promising to reach out to the West and ease enforcement on the country’s mandatory headscarf law after years of sanctions and protests squeezing the Islamic Republic.",
      "publishedAt": "2024-07-06T01:43:33Z",
      "title": "Reformist Pezeshkian beats hard-liner to win Iran presidential election, promising outreach to West",
      "url": "https://apnews.com/8a10c940adc1259566791b549828a3fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96bdc4d5278c4b3aa37b1768c85ba8d9/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — New British Prime Minister Keir Starmer doesn’t get to take a breather.",
      "publishedAt": "2024-07-06T04:09:40Z",
      "title": "A NATO summit and mending EU relations are among first tasks for new UK leader Keir Starmer",
      "url": "https://apnews.com/0da1da8a74c6196518059d7d9fbcf77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/117faa366ced460aaa7788d63d478588/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "BARINAS, Venezuela (AP) — The chant is concise, but it could not be more meaningful for millions of Venezuelans in 2024: “Freedom!”Members of the country's political opposition shout it with tears in their eyes, or red angry faces, or with hopeful ear-to-ear smiles.",
      "publishedAt": "2024-07-06T22:33:43Z",
      "title": "'Freedom!' chants at Venezuelan opposition rallies ahead of election show depth of needs and fear",
      "url": "https://apnews.com/1d9aab83e201fcfa911ca1d1f72bdc80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dcfc41a2f814eb4a7fd1a12750f4caa/2411.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "JOANETES, Spain (AP) — Xavier Pallàs plants his feet on the belfry floor, grips the rope, and with one tug fills the lush Spanish valley below with the reverberating peal of a church bell.Clang-clong!",
      "publishedAt": "2024-07-07T04:56:25Z",
      "title": "Church bells speak again in Spain thanks to effort to recover the lost 'language' of ringing by hand",
      "url": "https://apnews.com/316a9fcb69b01f239e915983c6c361d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb3da0e2b99f44c99d2fd3fe46f49aa3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}