{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The stunning removal of Kevin McCarthy as speaker left the House effectively paralyzed Wednesday as Republicans struggled to bring order to their fractured majority and begin the difficult and potentially prolonged process of uniting around a new leader.",
      "publishedAt": "2023-10-04T17:59:06Z",
      "title": "The House is left paralyzed as divided Republicans search for new leader after McCarthy's ouster",
      "url": "https://apnews.com/9b244d42f60eaccc94befcc1ba9d2985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98373609cf564041a4d98032bcc3d846/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Warned to mind his out-of-court comments, former President Donald Trump returned to his New York civil fraud trial Wednesday as his defense lawyers closely questioned an accountant who prepared financial statements at the heart of the case.",
      "publishedAt": "2023-10-04T14:29:55Z",
      "title": "Trump lawyers go after accountant and appeal major pretrial ruling in New York fraud case",
      "url": "https://apnews.com/9ee06080d60671e09269ccd724c420e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9159e72e3b9b4dbba2395d331bd12753/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOSH BOAK",
      "description": "WASHINGTON (AP) — Facing a likely roadblock from House Republicans on aid for Ukraine, President Joe Biden said Wednesday he’s planning to give a major speech on the issue and suggested there may be “another means” to provide support for Kyiv if Congress continues to balk.",
      "publishedAt": "2023-10-04T18:15:59Z",
      "title": "Biden suggests he has a path around Congress to get more aid to Ukraine and plans major speech",
      "url": "https://apnews.com/37b6369c637a32c508c53d05bf187b0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd1bb5533eda45fba6935020be8b50ba/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis said the Catholic Church needed to be rebuilt to make it a place of welcome for “everyone, everyone, everyone,” as he opened a divisive meeting on the future of the church that has sparked hope among progressives and alarm among conservatives.",
      "publishedAt": "2023-10-04T04:04:38Z",
      "title": "Pope Francis opens a big Vatican meeting on the church's future and says 'everyone' is welcome",
      "url": "https://apnews.com/0525e295f5befd4ec97ed553f165bfc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebdede39261740eb8f00a957400de462/2790.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Mourners bearing bouquets and cards paid their respects Wednesday to the late U.S. Sen. Dianne Feinstein in San Francisco City Hall, where she launched her groundbreaking political career and spent a decade as the city's first female mayor.",
      "publishedAt": "2023-10-04T04:06:58Z",
      "title": "Tearful mourners pay their respects to Dianne Feinstein in San Francisco's City Hall",
      "url": "https://apnews.com/b96c95c0255d703ac20217f6f063cb04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5e22562c5b14fb287c2c41ce0e0ef7d/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A self-described gangster who police and prosecutors say masterminded the shooting death of Tupac Shakur in Las Vegas in 1996 made his first court appearance Wednesday on a murder charge.",
      "publishedAt": "2023-10-04T04:04:54Z",
      "title": "Suspect charged in rapper Tupac Shakur's fatal shooting makes first court appearance in Las Vegas",
      "url": "https://apnews.com/8568b1a49ee46aae0a737f8a30376004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a9ae63d29f54ec1a3ff5344a4d2f304/3000.jpeg"
    },
    {
      "author": "DEVI SHASTRI",
      "description": "It's the end of an era for a once-critical pandemic document: The ubiquitous white COVID-19 vaccination cards are being phased out. Now that COVID-19 vaccines are not being distributed by the federal government, the U.S.",
      "publishedAt": "2023-10-04T18:21:05Z",
      "title": "Say goodbye to the COVID-19 vaccination card. The CDC has stopped printing them",
      "url": "https://apnews.com/a70eb7f3f32b961eae1a7bf69175ad11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f76211e4c5d4a1d89f23feaf8dc697c/3000.jpeg"
    },
    {
      "author": null,
      "description": "HOLYOKE, Mass. (AP) — Multiple people were reportedly shot Wednesday afternoon in the downtown area of Holyoke, Massachusetts, police said.Holyoke Police Detective Beben told WWLP that multiple individuals had been shot, but did not indicate how many.",
      "publishedAt": "2023-10-04T19:15:10Z",
      "title": "Police in Holyoke, Massachusetts are investigating after multiple people were reported shot",
      "url": "https://apnews.com/33202c5752f8df81552488da94f87386",
      "urlToImage": ""
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — A prosecutor opened a fraud trial Wednesday by telling jurors that FTX founder Sam Bankman-Fried was on top of the world a year ago, hobnobbing with celebrities, before his historic fraud was exposed, leaving customers and investors without at least $10 billion they thought was secure.",
      "publishedAt": "2023-10-04T14:41:46Z",
      "title": "Prosecutor opens trial for FTX founder Sam Bankman-Fried saying he stole at least $10 billion",
      "url": "https://apnews.com/73fcde97d56f33f4bd4b3ba7f9c3c9bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e15bdd40cc7d4e339c06b3c7e185e9ff/3000.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR",
      "description": "GENEVA (AP) — The 2030 men's soccer World Cup is set to feature games in six countries on three continents in a unique format that will allow the tournament to celebrate its 100th anniversary in Uruguay.",
      "publishedAt": "2023-10-04T15:04:08Z",
      "title": "2030 World Cup set to be hosted by Spain-Portugal-Morocco with 3 South American countries added",
      "url": "https://apnews.com/3f400c036694c048b277f0b49796fc4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32a4e1f9ab2e43c891ad3d0661a22f78/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}