{
  "articles": [
    {
      "author": "Zeke Miller, Jon Gambrell, Aamer Madhani",
      "description": "President Donald Trump is set to meet with Syrian President Ahmad al-Sharaa, in a face-to-face with the onetime insurgent leader who spent years imprisoned by U.S. forces after being captured in Iraq. The White House says Trump has agreed to “say hello” Wednesday to al-Sharaa before the U.S. leader wraps up his visit to Saudi Arabia and moves on to Qatar. Trump is also scheduled to attend a meeting of the Gulf Cooperation Council, the grouping of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates. He then sets off Wednesday for Qatar, the second stop in his Mideast tour. Trump will be honored with a state dinner in Qatar.",
      "publishedAt": "2025-05-14T04:01:32Z",
      "title": "Trump to meet Syria's president before heading to Qatar on his Mideast tour",
      "url": "https://apnews.com/article/trump-middle-east-syria-qatar-saudi-arabia-8bd63b3f9fc1856532a00adf1795e38f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dec3055/2147483647/strip/true/crop/2864x1611+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F39%2Fd7cbf10f9a7ec7b06e6342a87fec%2Ff8967972e51647fd82d8aa094b8e694a"
    },
    {
      "author": "Will Weissert",
      "description": "It’s not just the “gesture” of a $400 million luxury plane that President Donald Trump says he’s smart to accept from Qatar. Or that Trump effectively auctioned off the first destination on his first major foreign trip, heading to Saudi Arabia because the kingdom was ready to make big investments in U.S. companies. It’s not even that the Trump family has fast-growing business ties in the Middle East. Instead, it’s the idea that the combination of these things and more could cause the United States to favor Middle Eastern leaders when it comes to American affairs of state. White House press secretary Karoline Leavitt says it's “ridiculous” to suggest Trump is doing anything for his own gain.",
      "publishedAt": "2025-05-14T02:00:43Z",
      "title": "Trump's Middle East visit comes as his family business ties there grow",
      "url": "https://apnews.com/article/trump-business-interests-family-middle-east-cryptocurrency-cbb7d2354304ce0308800819944cf3f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/70017ad/2147483647/strip/true/crop/3942x2217+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F6d%2F088b621e6f0779835ef7134d067b%2Fc259e69c1c80464fb80dea9d41e2c158"
    },
    {
      "author": "Dasha Litvinova",
      "description": "The talks took place in the warring capitals of Moscow and Kyiv, from Washington and Riyadh, Saudi Arabia, to countries across Europe. Now, all eyes are finally turning back to Istanbul to seek an end to Russia’s 3-year-old, full-scale invasion of Ukraine. Russian President Vladimir Putin proposed restarting direct peace talks with Ukraine in the Turkish city that straddles Asia and Europe on Thursday – and President Volodymyr Zelenskyy challenged him to meet in Turkey in person. What will take place remains unclear. The Kremlin has refused to confirm who it will send to Turkey and whether Putin personally will go. Ukrainian presidential adviser Mykhailo Podolyak said Zelenskyy will only sit down with the Russian leader.",
      "publishedAt": "2025-05-14T04:05:42Z",
      "title": "What to know about possible Russia-Ukraine peace talks in Turkey",
      "url": "https://apnews.com/article/russia-ukraine-war-istanbul-peace-talks-putin-54e7e2b93df0c53712f1b8ce7248e824",
      "urlToImage": "https://dims.apnews.com/dims4/default/9624ddc/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F61%2Fb083ad49105e502b344fcfa7142b%2F3562437d6b894e5e8a45b8e9d97d413a"
    },
    {
      "author": "Jaimie Ding",
      "description": "A Los Angeles judge is listening to arguments this week over whether Erik and Lyle Menendez should receive reduced sentences. The brothers have spent more than 30 years in prison for killing their parents at their Beverly Hills home in 1989. Their attorneys are expected to argue over the course of a two-day hearing starting Tuesday that the brothers have been rehabilitated in prison, and they have the support of their extended family. Prosecutors have said they oppose resentencing because the brothers have not admitted to lies told during their trial about why they killed their parents.",
      "publishedAt": "2025-05-13T04:05:02Z",
      "title": "LA judge to decide whether the Menendez brothers should be freed",
      "url": "https://apnews.com/article/menendez-brothers-resentencing-freedom-murder-95d642ef10b6d726d84c6f02a20a378c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0b0f7b/2147483647/strip/true/crop/3021x1699+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fba%2F9e740e705ad91ac99653607675f3%2F2d6111198cb54fe4ab3accf920bcc1bd"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "Tax breaks tallying more than $5 trillion. But also sizable reductions in Medicaid health care, food stamps for older Americans and green energy strategies to fight climate change. Those all faced sharp debate as House lawmakers pushed through marathon public hearings overnight into Wednesday on President Donald Trump's “big, beautiful bill.” Republicans are working on Trump’s signature legislative package over mounting opposition from Democrats, advocacy groups and even some wary Republicans themselves. The first hearing was disrupted by protesters shouting against health care cuts. House Speaker Mike Johnson hopes to send the Senate the bill by Memorial Day.",
      "publishedAt": "2025-05-13T17:33:35Z",
      "title": "House works into the night as Republicans push ahead on Trump's big bill",
      "url": "https://apnews.com/article/trump-budget-big-beautiful-tax-cuts-republicans-house-5588a1ba31875e5a4a2e23564244851b",
      "urlToImage": "https://dims.apnews.com/dims4/default/73f6bdf/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F25%2F369171fdb34a27b2b876d99e47b4%2F55766a219ddf4338afdcc7480c4d320e"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The R&B singer Cassie is poised to testify in Sean “Diddy” Combs sex trafficking trial. Testimony resumes Tuesday in New York. Combs is accused of forcing women including Cassie into drugged-up sex parties he described as “freak-offs.” Prosecutors say he used his status as a powerful executive to coerce women into abusive sexual encounters. Lawyers for three-time Grammy winner told the jury that while Combs could be violent, he never veered into sex trafficking or racketeering. Cassie has been at the center of Combs’ stunning downfall. She sued him in 2023 alleging years of abuse. A surveillance video made public last year showed Combs beating her at a Los Angeles hotel in 2016.",
      "publishedAt": "2025-05-13T04:02:07Z",
      "title": "R&B singer Cassie set to testify in Sean 'Diddy' Combs sex trafficking trial",
      "url": "https://apnews.com/article/diddy-sex-trafficking-freak-offs-cassie-f61773689c057e0264d5a755b40b825a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b23893a/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F21%2F0648a7fb5a77565263e0bf56bdf4%2F42829eefa2b842cf8e34d7f8cf1de00c"
    },
    {
      "author": "Thomas Adamson, John Leicester, Nicolas Vaux-montagny",
      "description": "Kim Kardashian has arrived at a Paris courthouse to testify against the men accused of robbing her at gunpoint in 2016, an event that reshaped her life and redefined celebrity security in the age of social media. This will be the first time she has faced the alleged assailants since that night, when she begged for her life as masked men bound her with zip ties and stole over $6 million in jewelry. Kardashian’s appearance is expected to be the emotional centerpiece of a trial that has captivated France.",
      "publishedAt": "2025-05-13T05:15:50Z",
      "title": "Kim Kardashian arrives to testify at Paris robbery trial",
      "url": "https://apnews.com/article/kim-kardashian-trial-paris-fashion-week-b06a96edfa5271de2d92870dcafe2796",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9fd950/2147483647/strip/true/crop/3738x2103+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F29%2Fb0ec2a96a6727175c4ecfbe3febe%2F8a48e0dc91774e9fa60f50712d9b6acb"
    },
    {
      "author": "Sibi Arasu",
      "description": "Rising heat is a problem for millions of people in India, and one western city is pointing the way in figuring out some ways to deal with it. Ahmedabad, a city of more than 7 million people that sees temperatures as high as 45 degrees Celsius, suffered the shock of more than 1,300 deaths during a heat wave in 2010. Officials immediately began work on an action plan for responding to killer heat in the future. That includes low-cost measures and smart planning — from painting roofs and walls white to reflect the sun’s rays to setting up straw curtains and water sprinklers in public bus stops.",
      "publishedAt": "2025-05-14T01:10:41Z",
      "title": "In one Indian city, reflective paint and bus stop sprinklers offer relief from killer heat",
      "url": "https://apnews.com/article/india-heat-tips-climate-change-937e51730d6962b05658b5e4a49abfa7",
      "urlToImage": "https://dims.apnews.com/dims4/default/7da308f/2147483647/strip/true/crop/7243x4074+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F16%2F4cddc03f6e3cdc76f7ba5bd07fe4%2Ffccbc3851de34302a82813ee54984a61"
    },
    {
      "author": null,
      "description": "Three years after Tom Cruise and “Top Gun: Maverick” flew into the Cannes Film Festival, he’s coming back Wednesday to the Croisette with “Mission: Impossible — The Final Reckoning.” Christopher McQuarrie’s latest “Mission: Impossible” installment is the biggest Hollywood tentpole wading ashore in Cannes this year, which will only magnify the spotlight on Cruise’s Cannes return. In 2022, Cruise received an honorary Palme d’Or from the festival and the “Top Gun: Maverick” premiere included an impressively timed jet fly over. Whether the 62-year-old Cruise has anything up his sleeve this time will be much anticipated at Cannes. On Sunday, Cruise climbed atop the roof of the British Film Institute in London.",
      "publishedAt": "2025-05-14T04:08:44Z",
      "title": "Tom Cruise returns to Cannes with 'Mission: Impossible — The Final Reckoning'",
      "url": "https://apnews.com/article/cannes-mission-impossible-tom-cruise-f95b5b7adc4f9b6dea622723934fa24c",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ac79f0/2147483647/strip/true/crop/7411x4169+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2Fe2%2F414b03f19cdd81ed7df5bb9604cc%2F5419aa3fbb8646ee94373cc06525b5e9"
    },
    {
      "author": "Ronald Blum",
      "description": "Pete Rose and Shoeless Joe Jackson were reinstated by baseball Commissioner Rob Manfred on Tuesday, making both eligible for the sport’s Hall of Fame after their careers were tarnished by sports gambling scandals. Rose’s permanent ban was lifted eight months after his death and comes a day before the Cincinnati Reds will honor baseball’s career hits leader with Pete Rose Night. Manfred announced Tuesday that he was changing the league’s policy on permanent ineligibility, saying bans would expire after death. Under the Hall of Fame’s current rules, it appears the earliest Rose or Jackson could be inducted would be in 2028.",
      "publishedAt": "2025-05-13T20:07:42Z",
      "title": "MLB reinstates Pete Rose, Shoeless Joe Jackson",
      "url": "https://apnews.com/article/pete-rose-shoeless-joe-jackson-reinstated-f95afff53006426f3ea44e34d5f56a24",
      "urlToImage": "https://dims.apnews.com/dims4/default/81f642c/2147483647/strip/true/crop/2695x1516+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Ff7%2Ff56bf3543698a8f8bb532a2eef2e%2F4130d76712a74dc59b64dc89db55d9ff"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}