{
  "articles": [
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel's parliament is scheduled to vote Monday on a pair of bills that would effectively sever ties with the U.N. agency responsible for distributing aid in Gaza, strip it of legal immunities and restrict its ability to support Palestinians in east Jerusalem and the West Bank.",
      "publishedAt": "2024-10-28T12:12:24Z",
      "title": "Israel to vote on severely restricting UN agency that is a lifeline for Gaza",
      "url": "https://apnews.com/6894ad0ffa997d49742908a0e8c952b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41c5c02e021a4e2193541b51075d13c3/2892.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MARYCLAIRE DALE and CHRIS MEGERIAN",
      "description": "PHILADELPHIA (AP) — Kamala Harris said Sunday that “no one can sit on the sidelines” in this year's presidential election, capping a day of campaigning across the largest city in the crucial battleground state of Pennsylvania.",
      "publishedAt": "2024-10-27T09:28:21Z",
      "title": "Harris rallies Philadelphia voters at church, barbershop, bookstore, restaurant and basketball court",
      "url": "https://apnews.com/640ea532f6de541a5e03509bfe1471ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f00bdf07945428b88922b29427973e7/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump hosted a rally featuring crude and racist insults at New York’s Madison Square Garden, turning what his campaign had dubbed as the event where he would deliver his closing message into an illustration of what turns off his critics.",
      "publishedAt": "2024-10-27T04:02:46Z",
      "title": "Trump's Madison Square Garden event features crude and racist insults",
      "url": "https://apnews.com/fcfe75be7f8281fde7bffa3adb3bba5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c59e9f76b1b40129bb1e5e0ea1bbcda/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — A comic calling Puerto Rico garbage before a packed Donald Trump rally in New York was the latest humiliation for an island territory that has long suffered from mistreatment, residents said Monday in expressions of fury that could affect the presidential election.",
      "publishedAt": "2024-10-28T16:44:15Z",
      "title": "Puerto Rico bristles after a US comedian calls it 'a floating island of garbage' at a Trump rally",
      "url": "https://apnews.com/a91e2aafd93a06d32365efa013581b85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bebfa3bac0c04a04bf729d6f34580525/2716.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — Cori Bush went from helping to lead an informal movement for racial justice to winning two terms as a congresswoman from Missouri, with an office decorated with photographs of families who lost loved ones to police violence.",
      "publishedAt": "2024-10-28T12:02:47Z",
      "title": "A decade of racial justice activism transformed politics, but landmark reforms remain elusive",
      "url": "https://apnews.com/b62f3c5998d70f050a5637cb9336a42a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdee2c906097417cba3634dfa2956d96/3000.jpeg"
    },
    {
      "author": "GARY FIELDS, ALI SWENSON and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — American voters are approaching the presidential election with deep unease about what could follow, including the potential for political violence, attempts to overturn the election results and its broader implications for democracy, according to a new poll.",
      "publishedAt": "2024-10-28T04:09:44Z",
      "title": "US voters concerned about post-election violence and efforts to overturn the results: AP-NORC poll",
      "url": "https://apnews.com/3016f595faea0dfc81c487e856aafb04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f7d6b71be9544b0883305739d59f2e9/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MIKE PESOLI",
      "description": "WASHINGTON (AP) — Polarizing. Challenging. A lot of wasted time. That’s how six lawmakers described what it is like being in the U.S.",
      "publishedAt": "2024-10-28T04:19:55Z",
      "title": "In their own words: What it's like in a 'chaos' Congress and why these lawmakers keep coming back",
      "url": "https://apnews.com/50e562326d5c1d8a43cc86381d5705f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a98b52b4fad746c6b62272c01a863d27/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Investigators from multiple federal agencies launched an \"interagency operation” on Monday at the troubled New York City jail where Sean “Diddy” Combs is being held.",
      "publishedAt": "2024-10-28T12:24:03Z",
      "title": "Authorities launch 'interagency operation' at federal jail in New York housing Sean 'Diddy' Combs",
      "url": "https://apnews.com/ac89fcc984eba107a4585b57534df0ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73fbd8838d954049b8233b5a2994d8f6/3000.jpeg"
    },
    {
      "author": "LORNE COOK and TARA COPP",
      "description": "BRUSSELS (AP) — North Korea has sent about 10,000 troops to Russia to train and fight in Ukraine within “the next several weeks,” the Pentagon said Monday, in a move that Western leaders say will intensify the almost three-year war and jolt relations in the Indo-Pacific region.",
      "publishedAt": "2024-10-28T11:27:36Z",
      "title": "North Korea has sent about 10,000 troops to Russia to fight in Ukraine, Pentagon says",
      "url": "https://apnews.com/9b7357344d988ea32d8ca21f6e22dcc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a94544172cee4efab8f59a10b23af61b/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "TBILISI, Georgia (AP) — Georgia’s president on Monday urged the West to support opposition protests after the governing party was declared the winner of a parliamentary election that she alleged was rigged with the help of Russia.",
      "publishedAt": "2024-10-28T09:18:11Z",
      "title": "Thousands rally in Georgia to denounce the result of parliamentary elections they say were rigged",
      "url": "https://apnews.com/f6667dd64b537bd2082bfc5396f4a955",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6192d9bf82db44b79a9fbfdf5bf219ba/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}