{
  "articles": [
    {
      "author": "NOAH TRISTER, TARA COPP and AAMER MADHANI",
      "description": "LANDOVER, Md. (AP) — President-elect Donald Trump was huddling with allies and a Republican cause célèbre at Saturday's Army-Navy football game, taking in one of the most storied rivalries in college sports while spotlighting his emerging national security team.",
      "publishedAt": "2024-12-14T14:16:38Z",
      "title": "Trump attends the Army-Navy game alongside key allies, nominees and Daniel Penny",
      "url": "https://apnews.com/85da138b3ac130b211afc414bf43514a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb91257aad424f7ab946c218dbb5efa3/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and LISA MASCARO",
      "description": "WASHINGTON (AP) — Former House Speaker Nancy Pelosi had hip replacement surgery Saturday at a U.S. military hospital in Germany after falling while at an event in Luxembourg with other members of Congress.",
      "publishedAt": "2024-12-14T18:00:47Z",
      "title": "Pelosi has hip replacement surgery at a US military hospital in Germany after a fall",
      "url": "https://apnews.com/b01379d1f1124dcd3cf41c789dae4a58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a4febfee824a449e790ff9e2f5fdb0/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s parliament on Saturday impeached President Yoon Suk Yeol over his stunning and short-lived martial law decree, a move that ended days of political paralysis but set up an intense debate over Yoon's fate, as jubilant crowds roared to celebrate another defiant moment in the country's resilient democracy.",
      "publishedAt": "2024-12-14T01:44:38Z",
      "title": "South Korea’s parliament votes to impeach President Yoon Suk Yeol over his martial law order",
      "url": "https://apnews.com/6432768aafc8b55be26215667e3c19d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b632bd085bbd4994b2d4d2b74ab137ae/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "AQABA, Jordan (AP) — American officials have been in direct contact with the terrorist-designated rebel group that led the overthrow of Syrian President Bashar Assad, U.S.",
      "publishedAt": "2024-12-14T15:44:36Z",
      "title": "US officials have been in direct contact with the Syrian rebel group that ousted Assad, Blinken says",
      "url": "https://apnews.com/5fcff887a74dc9ec36e483c0b601a8c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca6e13cf5ad4f2ca1b2c7e0854c251f/1920.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI and KEN MILLER",
      "description": "A large number of mysterious drones have been reported flying over parts of New Jersey and the East Coast in recent weeks, sparking speculation and concern over who sent them and why.",
      "publishedAt": "2024-12-14T18:21:17Z",
      "title": "Mystery drone sightings keep happening in New Jersey. Here's what we know (and don't know)",
      "url": "https://apnews.com/e6f565f5d51d9d47ad140e7e7d131842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e8e598ddc64153a160fe9c93854ec2/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian drone strikes on southern Russia killed a 9-year-old boy and set fire to a major oil terminal, officials said Saturday, the day after Moscow launched a massive aerial attack on its neighbor that Ukrainian President Volodymyr Zelenskyy said was one of the heaviest bombardments of the country’s energy sector in the nearly three-year war.",
      "publishedAt": "2024-12-14T14:09:05Z",
      "title": "Ukrainian drones strike Russia as Kyiv reels from consecutive massive air attacks",
      "url": "https://apnews.com/b4968f78072239d0d114423337cefd88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a72f7631ab94235b5dbd254d7b4a704/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — A major ice storm created treacherous driving conditions across Iowa and eastern Nebraska this weekend and prompted temporary closures of Interstate 80 after numerous cars and trucks slid off the road.",
      "publishedAt": "2024-12-14T17:48:12Z",
      "title": "Storms encase Iowa and eastern Nebraska in ice and generate first tornado warning in San Francisco",
      "url": "https://apnews.com/fc5493b70887cb3c25d97190ffbf66b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e574b9681adb4570ae99a9ee51fb1b1b/3000.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE",
      "description": "TBILISI, Georgia (AP) — Former soccer player Mikheil Kavelashvili became president of Georgia on Saturday, as the ruling party tightened its grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ruler Russia.",
      "publishedAt": "2024-12-14T05:23:30Z",
      "title": "Ex-soccer player Kavelashvili becomes Georgia's president in a blow to country's EU aspirations",
      "url": "https://apnews.com/3a7f5018879c77b6c596d312a163b79c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ec49d5d35694016a73b253ba8c44f36/1920.jpeg"
    },
    {
      "author": "MELISSA RAYWORTH",
      "description": "Last year, when Lauren Haydel began her first sober holiday season, she wondered how difficult it would be to avoid alcohol at family parties and celebrations with friends. She owns a boutique, Fleurty Girl, in New Orleans’ French Quarter, a neighborhood synonymous with drinking.",
      "publishedAt": "2024-12-14T05:12:44Z",
      "title": "Stay sober and have a jolly holiday season with these expert tips",
      "url": "https://apnews.com/c1a18cbf0090b5049224c3f5d578590b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1c3b7d3a17b4546853935b9642583fb/2100.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "A woman who accused rappers Jay-Z and Sean “Diddy” Combs of sexually assaulting her when she was 13 at an awards show after-party has acknowledged certain inconsistencies in her story, while her lawyer said he will continue to vet her claims.",
      "publishedAt": "2024-12-14T06:50:53Z",
      "title": "Woman accusing Jay-Z and Sean 'Diddy' Combs of sexual assault acknowledges inconsistencies",
      "url": "https://apnews.com/667e3c5f2abca341975741e536969d71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fab4810123c4472fa528d7ef863b9682/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}