{
  "articles": [
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, who presents herself as the candidate of change as she runs for president against Republican Donald Trump, said Friday that she's different from President Joe Biden because she offers \"a new generation of leadership.”",
      "publishedAt": "2024-09-14T01:14:33Z",
      "title": "Harris says she is different from Biden because 'I offer a new generation of leadership'",
      "url": "https://apnews.com/0ab110205516e5764d41f979ad9ad605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ec9fbf084aa4b2c9a2422df4bd9c31f/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and JULIE CARR SMYTH",
      "description": "BOZEMAN, Mont. (AP) — Montana U.S. Sen. Jon Tester has made protecting reproductive freedom for women central to his campaign to remain the sole remaining Democrat to hold statewide elective office in Big Sky Country.",
      "publishedAt": "2024-09-14T04:11:16Z",
      "title": "Embattled Democratic senators steer clear of Kamala Harris buzz but hope it helps",
      "url": "https://apnews.com/e7256dd5dd657f0432c36a5c2d2dc8bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99d59a9c2dee43bb9382c33469069102/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "From the looks of it, the Phoenix suburb of Gilbert hasn’t done too much with the $24 million it received in federal pandemic aid.The site where it plans to spend most of the money for a crime victims center remains an empty plot of dirt.",
      "publishedAt": "2024-09-14T04:14:11Z",
      "title": "Clock is ticking for local governments to use billions of dollars of federal pandemic aid",
      "url": "https://apnews.com/57856355e594a910d1d255deab7d2aaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02bc148aa5854ec197af5446c211eb6c/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "TEHRAN, Iran (AP) — Iran launched a satellite into space Saturday with a rocket built by the country's paramilitary Revolutionary Guard, state-run media reported, the latest for a program the West fears helps Tehran advance its ballistic missile program.",
      "publishedAt": "2024-09-14T07:30:02Z",
      "title": "Iran says it successfully launched a satellite in its program criticized by West over missile fears",
      "url": "https://apnews.com/52022a743be4e3ffca5df9d30de7b04c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77c2f0e82f8e45999e419375b81f2c89/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes hit central and southern Gaza overnight into Saturday, killing at least 14 people as friends and family members of a Turkish-American activist killed by an Israeli soldier prepared to honor her in a funeral.",
      "publishedAt": "2024-09-14T07:31:47Z",
      "title": "Israel strikes Gaza as an American activist killed by Israeli fire is buried",
      "url": "https://apnews.com/816a01b4ca23bfd6b22a1a381e1671bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/434f605cb9a44652b95bc33eb1e78e0c/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and CLAUDIA LAUER",
      "description": "HONOLULU (AP) — The wind pushed flames from house to house as a group of neighbors tried to escape their blazing subdivision, abandoning their cars in a blocked road and running to an industrial outbuilding for safety.",
      "publishedAt": "2024-09-14T04:12:24Z",
      "title": "Hawaii wildfire victims made it just blocks before becoming trapped by flames, report says",
      "url": "https://apnews.com/dc43aa50abb82f79de4ce786f9af510e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aa8c753a24440818d9d6906be4b991a/1920.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA",
      "description": "MALINDI, Kenya (AP) — Shukran Karisa Mangi always showed up drunk at work, where he dug up the bodies of doomsday cult members buried in shallow graves.",
      "publishedAt": "2024-09-14T06:38:44Z",
      "title": "The church was named Good News. Hundreds of members died in a cult massacre that haunts survivors",
      "url": "https://apnews.com/b2e99891fc5f140df8166725436cb58e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8bc126b88b54ea4a78b3e907944d101/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "CHALCO, Mexico (AP) — As 56-year-old Juana Salazar Segundo walked through her home in Chalco, a low-income suburb southeast of Mexico City, she recalled how black, reeking water had reached up to her belly button after flooding early last month.",
      "publishedAt": "2024-09-14T04:05:42Z",
      "title": "Residents of Mexico City suburb are anxious after living over a month in black sewage water",
      "url": "https://apnews.com/8ecc2eb4d9fabd5219fe6850de5addf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c235d041d1244f24821a7eee6d0052aa/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Prince Harry was always something different.From the moment he first appeared in public, snuggled in Princess Diana’s arms outside the London hospital where he was born in 1984, Harry was the ginger-haired scamp who stuck his tongue out at photographers.",
      "publishedAt": "2024-09-14T04:40:55Z",
      "title": "Prince Harry's 40th birthday marks the moment the royal scamp moves to middle age",
      "url": "https://apnews.com/fbe182bdfdd76f2020e75c5c18000989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ced6892f4414e2580f5dcee8e804a88/1764.jpeg"
    },
    {
      "author": "AARON BRACY",
      "description": "PHILADELPHIA (AP) — Francisco Alvarez, Brandon Nimmo and Harrison Bader hit three-run homers, Jose Quintana allowed three hits in seven shutout innings and the New York Mets routed the NL East-leading Philadelphia Phillies 11-3 Friday night for their 12th win in 14 games.",
      "publishedAt": "2024-09-14T01:48:58Z",
      "title": "Alvarez, Nimmo, Bader hit 3 run homers to lead Mets over Phillies 11-3 for 12th win in 14 games",
      "url": "https://apnews.com/5604e1262ce2ffebfee0d6b73c66aded",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38122a2cdf184e399a7f68b748e2183a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}