{
  "articles": [
    {
      "author": "BILL BARROW and JONATHAN J. COOPER",
      "description": "TUSCALOOSA, Ala. (AP) — Four Republican presidential candidates were given several opportunities Wednesday to criticize former President Donald Trump, who was absent from the debate again.",
      "publishedAt": "2023-12-06T05:03:35Z",
      "title": "The GOP debate field was asked about Trump. But most of the stage's attacks focused on Nikki Haley",
      "url": "https://apnews.com/0b53c0fb84ab64e62ea3697ac9d8be08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a30efe75dc254014aa6e30d04e68199d/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and NICHOLAS RICCARDI",
      "description": "With the Iowa caucuses rapidly approaching, a shrinking field of Republican White House hopefuls gathered Wednesday in Alabama for the fourth presidential debate.",
      "publishedAt": "2023-12-07T01:49:18Z",
      "title": "GOP presidential hopefuls target Nikki Haley more than Trump, and other moments from the debate",
      "url": "https://apnews.com/a442087e0ac2c16d73ad35d82b7f1ea8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f5d2aa535d74848af59bc42e05c6bce/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces struck the southern Gaza town of Rafah twice overnight, residents said Thursday, sowing fear in one of the last places where civilians could seek refuge after Israel widened its offensive against Hamas to areas already packed with displaced people.",
      "publishedAt": "2023-12-07T09:40:33Z",
      "title": "Strikes on Gaza's southern edge sow fear in one of the last areas to which people can flee",
      "url": "https://apnews.com/174f470c9e3d3c6ea5adb59d7e523425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3ea423af5ba467f9f99458071750ae4/1920.jpeg"
    },
    {
      "author": "KEN RITTER and RIO YAMAT",
      "description": "LAS VEGAS (AP) — Terrified students and professors cowered in classrooms and dorms as a gunman roamed the floors of a University of Nevada, Las Vegas building, killing three people and critically wounding a fourth before dying in a shootout with police.",
      "publishedAt": "2023-12-07T05:30:57Z",
      "title": "Vegas shooter who killed 3 was a professor who recently applied for a job at UNLV, AP source says",
      "url": "https://apnews.com/0b12656a801e227d6aa2b9ccee56d9f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83257e295754f8d8314b133b337205d/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, DAVID KEYTON, JOSHUA A. BICKEL and SIBI ARASU",
      "description": "DUBAI, United Arab Emirates (AP) — The mood is about to shift, the hours grow longer and the already high sense of urgency somehow amp up even more as the United Nations climate summit heads into its final week.",
      "publishedAt": "2023-12-07T05:05:57Z",
      "title": "Climate talks shift into high gear. Now words and definitions matter at COP28",
      "url": "https://apnews.com/c4fe8a0b106888f2d9c505823749d179",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23669b3428e2472fbe05d7e78e9ef599/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — When Iranian-backed Houthi rebels in Yemen launched missiles and hit three commercial ships in the southern Red Sea last weekend, it triggered an immediate question: Will the U.S. military strike back?",
      "publishedAt": "2023-12-07T05:07:42Z",
      "title": "Who are the Houthis and why hasn’t the US retaliated for their attacks on ships in the Middle East?",
      "url": "https://apnews.com/15d10ed74c7f3cc7fd36fa0f77f73e54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94f5de5226ee49ad8946fcd3a98dce76/1500.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Democratic views on how President Joe Biden is handling the decades-old conflict between Israelis and Palestinians have rebounded slightly, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-12-07T05:04:24Z",
      "title": "Democratic support for Biden ticks up on handling of Israel-Hamas war, AP-NORC poll says",
      "url": "https://apnews.com/9f9e9bd2ea595ece43f151d8722e47ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea49d7ff26384c9e971c680759ec3a78/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Russian lawmakers on Thursday set the date of the country’s 2024 presidential election for March 17, moving Vladimir Putin a step closer to a fifth term in office.Members of the Federation Council, Russia’s upper house of parliament, voted unanimously to approve a decree setting the date.",
      "publishedAt": "2023-12-07T07:26:06Z",
      "title": "Putin moves a step closer to a fifth term as president after Russia sets 2024 election date",
      "url": "https://apnews.com/dcb4049245a651c06720ee0d39b8518f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2ad07c2a25e47eea590b312979f4186/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS and PAT EATON-ROBB",
      "description": "WILLIMANTIC, Conn. (AP) — The killing of a Connecticut nurse making a house call in October was a nightmare come true for an industry gripped by the fear of violence.Already stressed out by staffing shortages and mounting caseloads, heath care workers are increasingly worrying about the possibility of a patient becoming violent – a scenario that is too common and on the rise nationwide.",
      "publishedAt": "2023-12-07T05:32:23Z",
      "title": "A nurse's fatal last visit to patient's home renews calls for better safety measures",
      "url": "https://apnews.com/7390421a4c6ffc8bff5e08367b745b04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e0980a882a1431ba8eaf4a72803c620/3000.jpeg"
    },
    {
      "author": "RONALD BLUM and BERNIE WILSON",
      "description": "NEW YORK (AP) — Juan Soto is headed to the New York Yankees in their first big move following the team's worst season in three decades.They hope at least one more will follow.New York acquired Soto and Gold Glove center fielder Trent Grisham in a blockbuster trade with the cost-cutting Padres on Wednesday night.",
      "publishedAt": "2023-12-07T04:19:04Z",
      "title": "Juan Soto traded to New York Yankees from San Diego Padres in 7-player blockbuster",
      "url": "https://apnews.com/36cdf65e780ad26b5204d3590795fc2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31bd34eac6a1461fbd4b40ce92004497/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}