{
  "articles": [
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — Facing a government shutdown deadline, the Senate rushed through final passage early Saturday of a bipartisan plan that would temporarily fund federal operations and disaster aid, dropping President-elect Donald Trump's demands for a debt limit increase into the new year.",
      "publishedAt": "2024-12-20T15:21:15Z",
      "title": "Government funding bill clears Congress and heads to President Biden, averting a shutdown",
      "url": "https://apnews.com/da117337aa0c0adab34a5626bb5816af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9175b538421048c580602001238cfb37/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The Senate passed legislation early Saturday to boost Social Security payments for millions of people, pushing a longtime priority for former public employees through Congress in one of its last acts for the year.",
      "publishedAt": "2024-12-21T01:49:06Z",
      "title": "Senate passes Social Security benefits boost for many public service retirees",
      "url": "https://apnews.com/565aaf221de6d607f207e286655eef25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a47f808fb344119a0f3100b6348269/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Johnny Zuagar says he’s tried to hide his worries about a potential government shutdown from his three boys as he weighs how much to spend on Christmas presents.",
      "publishedAt": "2024-12-20T23:50:49Z",
      "title": "Government funding difficulties create gloom for federal workers before Christmas",
      "url": "https://apnews.com/77886d390eb5e69fd961109297736230",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbe940bb41ad4a10969b7fb3e9ff87cf/3000.jpeg"
    },
    {
      "author": "MELISSA GOLDIN",
      "description": "President-elect Donald Trump's billionaire ally Elon Musk played a key role this week in killing a bipartisan funding proposal that would have prevented a government shutdown, railing against the plan in a torrent of more than 100 X posts that included multiple false claims.",
      "publishedAt": "2024-12-20T21:37:08Z",
      "title": "Musk helped kill a congressional spending bill. But much of what he spread was misinformation",
      "url": "https://apnews.com/1235b15b425856bf902d0c8133eec222",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ee306173ed546a1823bb6c202233951/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER, SARA ABOUBAKR and VANESSA GERA",
      "description": "MAGDEBURG, Germany (AP) — Germans on Saturday mourned a violent attack and their shaken sense of security after a Saudi doctor intentionally drove a black BMW into a Christmas market teeming with holiday shoppers, killing at least two people, including a small child, and injuring at least 60 others.",
      "publishedAt": "2024-12-21T07:18:27Z",
      "title": "Germans mourn attack on Christmas market with no answers about why",
      "url": "https://apnews.com/32ec923f21cccb2a34e287da42ced921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29758af4bc904c2daaab8d026910ec25/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "DAMASCUS, Syria (AP) — The toppling of Bashar Assad has raised tentative hopes that Syrians might live peacefully and as equals after a half century of authoritarian rule.While there have been bursts of deadly sectarian violence in the days since Assad was ousted, it’s nothing close to what was feared after nearly 14 years of civil war.",
      "publishedAt": "2024-12-21T05:00:05Z",
      "title": "Sectarian violence in Syria has been less intense than feared since Assad's ouster",
      "url": "https://apnews.com/6fef01639ed9833f9421c1a88abc61cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e26d1850b8604673862507d33607475b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "CAIRO (AP) — Even with hopes running high, so much can go wrong when a country ousts a longtime dictator and tries to start anew. The Middle Eastern and North African nations that attempted to transition to democracy in recent years can attest to that.",
      "publishedAt": "2024-12-20T17:29:10Z",
      "title": "What will Syria's future look like? The answer could lie in other Arab countries' recent pasts",
      "url": "https://apnews.com/51635b7aabc0760bb7841829586ede7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4db51c2ee1df4390a891953e4f3565d4/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Amazon delivery drivers and Starbucks baristas are on strike in a handful of U.S.",
      "publishedAt": "2024-12-20T23:43:27Z",
      "title": "Amazon and Starbucks workers are on strike. Trump might have something to do with it",
      "url": "https://apnews.com/64c5c5df331f55ee247365a5a303757d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe37f3586e374bcca1fec2369ad0e575/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN, ACHMAD IBRAHIM, and FADLAN SYAM",
      "description": "BANDA ACEH, Indonesia (AP) — Two decades after a catastrophic tsunami destroyed her village, Tria Asnani still cries when she recalls how she lost her mother while trying to escape the giant waves.",
      "publishedAt": "2024-12-21T02:07:53Z",
      "title": "Indonesians mark 2 decades since the tragic tsunami that killed hundreds of thousands",
      "url": "https://apnews.com/d62f2c5590fb8427e97ffa1b81dc09d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bb7ac8e59054273aafa7161d94801f6/1920.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "The Christmas tradition has become nearly global in scope: Children from around the world track Santa Claus as he sweeps across the earth, delivering presents and defying time.",
      "publishedAt": "2024-12-20T17:48:15Z",
      "title": "NORAD's Santa tracker was a Cold War morale boost. Now it attracts millions of kids",
      "url": "https://apnews.com/c37fd5c62b2443500f462757530fa8f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55c8f31f630a4cc9a8a311f2b80a4c2c/2880.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}