{
  "articles": [
    {
      "author": "BASSEM MROUE and JACK JEFFERY",
      "description": "BEIRUT (AP) — U.S. Secretary of State Antony Blinken said Wednesday that mediators would keep trying to close an elusive cease-fire deal after Hamas proposed numerous changes to a U.S.-backed plan, some of which he said were “workable” and some not.",
      "publishedAt": "2024-06-12T08:41:07Z",
      "title": "Blinken says some of Hamas' proposed changes to a cease-fire plan in Gaza are workable and some not",
      "url": "https://apnews.com/5cf89b426dc799e27f4ca166ea539cd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9280d0d85a244fec9be1a65059b0545b/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and COLLEEN LONG",
      "description": "ABOARD AIR FORCE ONE (AP) — President Joe Biden and President Volodymyr Zelenskyy will sign a bilateral security agreement between the U.S. and Ukraine on Thursday when they meet on the sidelines of the Group of Seven summit in Italy, aiming to send a signal to Russia of American resolve in supporting Kyiv, the White House said as Biden was headed to Europe.",
      "publishedAt": "2024-06-12T13:09:35Z",
      "title": "Biden and Zelenskyy will sign a security agreement between the US and Ukraine when they meet at G7",
      "url": "https://apnews.com/a43439b8386a20d1af9faec19f94bf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7c2bd0dc0f348d698b9fa7c1cfac21f/2925.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ERIC TUCKER",
      "description": "PHOENIX (AP) — Republicans are responding to Hunter Biden's conviction on federal gun charges with some version of, “That’s it?”",
      "publishedAt": "2024-06-12T13:16:00Z",
      "title": "Republicans stick to attacking criminal justice system, echoing Trump, after Hunter Biden conviction",
      "url": "https://apnews.com/eb7fe08832905f14dd8c5bd48ef9c716",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fe8697f3e6c45f9b7e615f4a7110fae/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and LINLEY SANDERS",
      "description": "NEW YORK (AP) — About half of U.S. adults approve of Donald Trump's recent felony conviction, according to a poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-06-12T15:01:19Z",
      "title": "AP-NORC poll: About half of US adults approve of Trump's conviction, but views of him remain stable",
      "url": "https://apnews.com/f7f687c2c6c607b9a51425c1de2302bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a70d7da02d7448eb5fa76f6f11f0e14/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO, GISELA SALOMON and ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — A fleet of Russian warships reached Cuban waters on Wednesday ahead of planned military exercises in the Caribbean in what some see as a projection of strength as tensions grow over Western support for Ukraine.",
      "publishedAt": "2024-06-12T12:20:44Z",
      "title": "Russian warships reach Cuban waters ahead of military exercises in the Caribbean",
      "url": "https://apnews.com/446f60a04a9e0639381ddf5ee084d2c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d28c01a5a9fc47ee94e394f3cbe783df/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House is expected Wednesday to vote on a resolution holding Attorney General Merrick Garland in contempt of Congress for refusing to turn over audio of President Joe Biden’s interview in his classified documents case, a move that comes just weeks after the White House blocked release of the recording to lawmakers.",
      "publishedAt": "2024-06-12T13:09:33Z",
      "title": "House moves to hold Attorney General Merrick Garland in contempt for withholding Biden audio",
      "url": "https://apnews.com/20f5e8f48cfd8390eb695d13079ca306",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85cf31df29544c95b0f10e50bb4f01d9/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court is headed into its final few weeks with nearly half of the cases heard this year still undecided, including ones that could reshape the law on everything from guns to abortion to social media.",
      "publishedAt": "2024-06-12T04:01:12Z",
      "title": "Supreme Court has a lot of work to do and little time to do it with a sizable case backlog",
      "url": "https://apnews.com/84340c4b11d81ceaf10f5ebf999cb06f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5d05397d79c4fb2a07645b3971804c5/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Senators on Wednesday blasted top health and law enforcement officials for not doing more to combat the rise of illegal electronic cigarettes in the U.S., a multibillion-dollar business that has flourished amid haphazard enforcement.",
      "publishedAt": "2024-06-12T14:01:57Z",
      "title": "Senators blast health regulators and law enforcement over illegal e-cigarettes",
      "url": "https://apnews.com/17d3cbfdc87b16f530703b5252c31156",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae6a847633174e4d9226f66a78e3f428/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — Orville Allen lived a lifetime of service, and when he died at age 98 he had one last thing to give: his liver.Allen, a veteran of both World War II and the Korean War and a longtime educator in rural southeastern Missouri, is the oldest American to ever donate an organ, transplant organizations said.",
      "publishedAt": "2024-06-12T16:41:26Z",
      "title": "A 98-year-old man's liver was donated. He is believed to be the oldest American organ donor ever",
      "url": "https://apnews.com/b582a0cd003e3e0dd421ab51b6de668d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5279372685f34dd489c0e2d9cfd041d7/1920.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "Jerry West, who was selected to the Basketball Hall of Fame three times in a storied career as a player and executive, and whose silhouette is considered to be the basis of the NBA logo, died Wednesday morning, the Los Angeles Clippers announced.",
      "publishedAt": "2024-06-12T13:57:50Z",
      "title": "Jerry West, a 3-time Hall of Fame selection and the inspiration for the NBA logo, dies at 86",
      "url": "https://apnews.com/033c08e78eb9749f4cc275c54ff31d97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0fa39e83eb340b2bd4f8f422da0da29/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}