{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Israel’s military scoured the country’s south for Hamas fighters, guarded breaches in its border fence and pounded the Gaza Strip from the air on Monday as it vowed to lay total siege to the impoverished, Hamas-ruled territory in the wake of an unprecedented weekend incursion.",
      "publishedAt": "2023-10-09T04:45:19Z",
      "title": "Israel intensifies its strikes and vows to besiege Gaza as it scours south for Hamas fighters",
      "url": "https://apnews.com/4377e096f62bf535bebcdff38cf16049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e49fd74b951423aac653aacdb25c229/3000.jpeg"
    },
    {
      "author": "RAHIM FAIEZ",
      "description": "ISLAMABAD (AP) — A senior Taliban delegation was visiting western Afghanistan’s Herat province on Monday in the aftermath of the powerful earthquake that killed at least 2,000 people over the weekend and flattened entire villages, a statement said.",
      "publishedAt": "2023-10-09T07:58:45Z",
      "title": "Senior Taliban officials visit villages struck by earthquake that killed at least 2,000 people",
      "url": "https://apnews.com/0aecf4c94979bd663d63922949f5ad0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/016588268da64459a1d6fa889503937b/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "PHILADELPHIA (AP) — Anti-vaccine activist Robert F. Kennedy Jr. is expected to announce Monday that he will drop his Democratic bid for president and run as an independent or third-party candidate, adding a new wrinkle to a 2024 race currently heading toward a rematch between President Joe Biden and former President Donald Trump.",
      "publishedAt": "2023-10-09T10:30:08Z",
      "title": "RFK Jr. is expected to drop his Democratic primary bid and launch an independent or third-party run",
      "url": "https://apnews.com/30d940109c4956de9c81f332ec418463",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d30d9c3d7985459180bfd2b4c5ba12bc/3000.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — To Rep. Mike Collins, China is a bigger threat to the United States than Russia. So the Georgia Republican has voted against providing military aid to Ukraine as he advocates for doing more to arm Taiwan, the self-governed island that’s at risk of military aggression from Beijing.",
      "publishedAt": "2023-10-09T04:05:51Z",
      "title": "Some in Congress want to cut Ukraine aid and boost Taiwan's. But Taiwan sees its fate tied to Kyiv's",
      "url": "https://apnews.com/8cbb671399a51e0e34b9e40f72f51e56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7409a6fad2d64e1eb9f19f4e4cb22d2d/3000.jpeg"
    },
    {
      "author": "DAVID KEYTON and MIKE CORDER",
      "description": "STOCKHOLM (AP) — The Nobel economics prize was awarded Monday to Harvard University professor Claudia Goldin for research that has advanced the understanding of the gender gap in the labor market.The announcement went a tiny step to closing the Nobel committee’s own gender gap: Goldin is just the third woman to win the prize out of 93 economics laureates.",
      "publishedAt": "2023-10-09T07:25:04Z",
      "title": "Nobel economics prize goes to professor for advancing the understanding of the workplace gender gap",
      "url": "https://apnews.com/224c204c0cc20843636e5525d6a61673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f11ac6240d64ff0ae51618f12e6bfc0/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — The area around the Maui town largely destroyed by wildfire two months ago began welcoming back travelers on Sunday after the mayor and Hawaii’s governor pushed ahead to restart tourism to boost the economy despite opposition from some Lahaina residents.",
      "publishedAt": "2023-10-08T04:05:58Z",
      "title": "Tourism resumes in West Maui near Lahaina as hotels and timeshare properties welcome visitors",
      "url": "https://apnews.com/d66e6528b8c61203a3110214869314ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/547957f8772142b6aced5d091f25dbd8/3000.jpeg"
    },
    {
      "author": "WASBIR HUSSAIN and ANUPAM NATH",
      "description": "GANGTOK, India (AP) — Air force helicopters were able to land Monday to rescue people in India's Himalayan northeast after a 6-year-old hydroelectric dam cracked open last week in intense rain, flooding a valley with glacial lake water and washing away bridges and homes as thousands fled.",
      "publishedAt": "2023-10-09T06:55:22Z",
      "title": "Indian rescue copters are flying into region where flood washed out bridges and killed at least 52",
      "url": "https://apnews.com/f2b2657f4212f996b2861e04ac2e1fc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2ec44cb901442d0800c57110f5e54ca/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Union workers at Mack Trucks have voted down a tentative five-year contract agreement reached with the company and plan to strike at 7 a.m. Monday, the United Auto Workers union says.",
      "publishedAt": "2023-10-09T01:39:32Z",
      "title": "Workers at Mack Trucks reject tentative contract deal and will go on strike early Monday",
      "url": "https://apnews.com/31028457605436f0c142617b1b5cf838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91c8d9aed49c46dda73dc86d123cb816/3000.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "MARRAKECH, Morocco (AP) — Less than a two-hour drive from where families sleep in tents and earthquake rubble remain in piles, the world's most powerful financial institutions are gathering for a week of discussions on economic challenges during times of war, inequality and climate change.",
      "publishedAt": "2023-10-09T05:24:00Z",
      "title": "Morocco welcomes the annual meeting of the IMF and World Bank a month after its deadly earthquake",
      "url": "https://apnews.com/d1391b0824d484dfae2c2d672b37a499",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c9cb69b1e5d4098bf059e8fc14caff4/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — As soon as the federal pandemic relief started arriving at America’s schools, so did the relentless calls.Tech companies by the dozens wanted a chance to prove their software was what schools needed.",
      "publishedAt": "2023-10-09T04:07:09Z",
      "title": "Schools' pandemic spending boosted tech companies. Did it help US students?",
      "url": "https://apnews.com/e2c803a30c5b6d34620956c228de7987",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/201c81cdf98541eea7a9fdc02ecb0b13/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}