{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFREY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — A barrage of Israeli airstrikes leveled apartment buildings in a refugee camp near Gaza City on Tuesday, with rescuers clawing through the destruction to pull men, women and children from the rubble.",
      "publishedAt": "2023-10-31T07:23:16Z",
      "title": "Israeli airstrikes crush apartments in Gaza refugee camp, as ground troops battle Hamas militants",
      "url": "https://apnews.com/54ab6bd7f6861be86266770c245827e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d87af732325f459fb40fa3ae606ecb72/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "Over the past five days, Israeli ground troops have pushed deeper and deeper into Gaza in their war against Hamas, launched in response to a bloody Oct.",
      "publishedAt": "2023-10-31T19:16:40Z",
      "title": "Has Israel invaded Gaza? The military has been vague, even if its objectives are clear",
      "url": "https://apnews.com/6ba5bf06f81c315252a9e53735f3de47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de741def319b45e7aeb8af07ebd26547/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — Before House Speaker Mike Johnson was elected to public office, he was the dean of a small Baptist law school that didn't exist.",
      "publishedAt": "2023-10-31T20:16:19Z",
      "title": "House Speaker Mike Johnson was once the dean of a Christian law school. It never opened its doors",
      "url": "https://apnews.com/2d1a3399e8fe61bf0619d66ba29a1520",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d365c868920f411da86e8979a4f3185b/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "NIAGARA FALLS, N.Y. (AP) — Inside the columned church on the corner, the rich tones of the organ have wrapped congregants in their embrace. The time has come for the Rev. Jimmie Hardaway Jr. to preach the lessons embodied by the Prince of Peace.",
      "publishedAt": "2023-10-31T12:01:16Z",
      "title": "Two pastors worry for their congregants’ safety. Are more guns the answer or the problem?",
      "url": "https://apnews.com/a44329af27040d18a0c55844cc4945ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5995c74f7e0d4beb9e4577c0ad208ac6/3000.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "Authorities publicly identified Robert Card as a person of interest about four hours after he shot and killed 18 people and wounded 13 others during attacks last week at a bowling alley and bar in Lewiston, Maine.",
      "publishedAt": "2023-10-31T21:26:42Z",
      "title": "Maine mass shooter's troubling behavior raised concerns for months, documents show",
      "url": "https://apnews.com/8b636ba995360383c67489e7f7501547",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6155a96ad1414abab76d07c78bf583bb/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Then-President Donald Trump could have mobilized the National Guard and other federal agencies to protect the U.S. Capitol once violence broke out on Jan. 6, 2021, a law professor testified Tuesday as a case to bar the former president from the 2024 ballot moved into a new phase.",
      "publishedAt": "2023-10-31T04:10:16Z",
      "title": "Expert says Trump could have defended Capitol on Jan. 6 as disqualification case enters new phase",
      "url": "https://apnews.com/6a8528813e29c9f45a0bb4972369e97e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c494628094d84bfba37737c94b0be08e/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY, REBECCA BOONE, GENE JOHNSON and CLAUDIA LAUER",
      "description": "HONOLULU (AP) — An officer sprinted from house to house in the historic town of Lahaina, Hawaii, alerting people to the approaching inferno.",
      "publishedAt": "2023-10-31T02:58:07Z",
      "title": "Bodycam video shows police saving residents from Maui wildfire, keeping people out of burn zone",
      "url": "https://apnews.com/6639ee3a59dfea3f2b39614c79395b69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/449d5e6206134c3a93322733ce49cc4c/1920.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — The country’s largest Christian university is being fined $37.7 million by the federal government amid accusations that it misled students about the cost of its graduate programs.",
      "publishedAt": "2023-10-31T18:34:56Z",
      "title": "Largest Christian university in US faces record fine after federal probe into alleged deception",
      "url": "https://apnews.com/6728cbbc74912d96f1cf1c192780ae96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/013fd81359f44a3195b4a93e3ff34433/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIMA, Peru (AP) — A Dutchman who recently confessed to killing American high school student Natalee Holloway in 2005 in Aruba was returned to Peru on Tuesday to serve the remainder of his prison sentence for murdering a Peruvian woman.",
      "publishedAt": "2023-10-31T23:13:24Z",
      "title": "Natalee Holloway’s confessed killer returns to Peru to serve out sentence in another murder",
      "url": "https://apnews.com/5933303e8f01487d4e0aa1ba357e4660",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87eeb49d7afe441ab8a09407f450e731/3000.jpeg"
    },
    {
      "author": "SUMMER BALLENTINE",
      "description": "COLUMBIA, Mo. (AP) — A Missouri appeals court ruled Tuesday against Republican-written summaries of abortion-rights ballot measures that described several proposed amendments as allowing “dangerous and unregulated abortions until live birth.”",
      "publishedAt": "2023-10-31T21:39:55Z",
      "title": "Missouri appeals court rules against ballot summary language that described 'dangerous' abortions",
      "url": "https://apnews.com/edb5f44fc0f9799d01cda22cd1f70b40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd2d94e0d55943b4b7ef5853bc3d78cb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}