{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israel pressed forward on two fronts Wednesday, pursuing a ground incursion into Lebanon against Hezbollah that left eight Israeli soldiers dead and conducting strikes in Gaza that killed dozens, including children.",
      "publishedAt": "2024-10-02T05:50:18Z",
      "title": "Israel presses forward on two fronts and reports 8 combat deaths as fears of a wider war mount",
      "url": "https://apnews.com/7d93f71b7894177b4f9c303671ee55de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce38b395293477f91b783f33f8c9634/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "At least six people were killed in an Israeli airstrike on an apartment building in Beirut overnight, Lebanon’s Health Ministry said, as governments around the world scrambled to evacuate their citizens from the country.",
      "publishedAt": "2024-10-03T04:42:51Z",
      "title": "Middle East latest: Israeli strike kills at least 6 in Beirut as foreign nationals evacuate",
      "url": "https://apnews.com/261671df3829423c4c9f4e6c8806be2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce38b395293477f91b783f33f8c9634/3000.jpeg"
    },
    {
      "author": "JEFF AMY, ERIK VERDUZCO and BRITTANY PETERSON",
      "description": "BLACK MOUNTAIN, N.C. (AP) — Sarah Vekasi is a potter who runs a store in Black Mountain, North Carolina, called Sarah Sunshine Pottery, named after her normally bubbly personality. But these days she’s struggling with the trauma of Hurricane Helene and uncertainty about the future of her business.",
      "publishedAt": "2024-10-03T04:16:47Z",
      "title": "Human connections bring hope in North Carolina after devastation of Helene",
      "url": "https://apnews.com/64fe5ca1b80f22fd2fd3b7c50b291d85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be96fe66d43d42839a1e76ca285263f6/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The devastation wrought by Hurricane Helene has brought climate change to the forefront of the presidential campaign after the issue lingered on the margins for months.",
      "publishedAt": "2024-10-03T04:03:38Z",
      "title": "Hurricane Helene brings climate change to forefront of the presidential campaign",
      "url": "https://apnews.com/e1023e209548db8ec587115505c9797f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa13ddecab9488ab9d52ca3245ef12f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and “resorted to crimes” in his failed bid to cling to power, according to a court filing unsealed Wednesday that offers new evidence from the landmark criminal case against the former president.",
      "publishedAt": "2024-10-02T19:53:53Z",
      "title": "Prosecutors lay out new evidence in Trump election case, accuse him of having 'resorted to crimes'",
      "url": "https://apnews.com/0b9969b480036bb1f7c61a73980d406c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a090c150613c49e489c461a314cb66f2/1920.jpeg"
    },
    {
      "author": "REBECCA BOONE, ALANNA DURKIN RICHER and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — The wildfire that killed at least 102 people on Maui last year erupted from an earlier brushfire, sparked by downed power lines, that firefighters believed they had extinguished, officials confirmed Wednesday as they presented their findings on the cause.",
      "publishedAt": "2024-10-02T17:13:16Z",
      "title": "Deadly Maui fire erupted from earlier blaze believed to have been extinguished, investigation finds",
      "url": "https://apnews.com/7225240816153b751fde6c5871274636",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/374d3b33cdfc4dce8b1e1028c362b1f3/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "KAOHSIUNG, Taiwan (AP) — A slow-moving typhoon approaching Taiwan led to school and office closures for a third consecutive day Thursday, with authorities asking people to stay indoors.",
      "publishedAt": "2024-10-03T00:57:36Z",
      "title": "Typhoon Krathon shuts parts of Taiwan for a third day as it nears the island with extreme rains",
      "url": "https://apnews.com/e4acaaf0fbf22779c1f0124ee2f2712b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b521f53c0cd44f582ddbf411be09ca0/3000.jpeg"
    },
    {
      "author": "EDGAR H. CLEMENTE",
      "description": "MEXICO CITY (AP) — Six international migrants are dead after Mexican soldiers opened fire on a truck carrying a group near the border with Guatemala, Mexico's Defense Department said Wednesday.The department said in a statement that soldiers claimed they heard shots as the trucks and two other vehicles approached their position late Tuesday in the southern state of Chiapas, near the town of Huixtla.",
      "publishedAt": "2024-10-03T01:34:42Z",
      "title": "6 migrants shot dead near Guatemalan border when Mexican army troops open fire",
      "url": "https://apnews.com/37e0e3f08124cd46703a598ff1b1e7c0",
      "urlToImage": ""
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Three years after the 30-year-old South Korean woman received a barrage of online fake images that depicted her nude, she is still being treated for trauma. She struggles to talk with men.",
      "publishedAt": "2024-10-03T02:52:13Z",
      "title": "In South Korea, deepfake porn wrecks women's lives and deepens gender conflict",
      "url": "https://apnews.com/df98e1a6793a245ac14afe8ec2366101",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5ddf50c752b4e6bb6a160e70f7bb5ea/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON, HELEN WIEFFERING and MANUEL VALDES",
      "description": "LONG BEACH, Wash. (AP) — Russ Lewis has picked up some strange things along the coast of Long Beach Peninsula in Washington state over the years: Hot Wheels bicycle helmets with feather tufts, life-size plastic turkey decoys made for hunters, colorful squirt guns.",
      "publishedAt": "2024-10-03T04:03:46Z",
      "title": "Thousands of shipping containers have been lost at sea. What happens when they burst open?",
      "url": "https://apnews.com/68620037992758a714b010345e1937fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/256111151e83445ca99362fced589096/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}