{
  "articles": [
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump, in a new interview, is circumspect about his duties to uphold due process rights laid out in the Constitution. He also says he doesn’t think military force would be needed to make Canada the “51st state.” And he's downplaying the possibility that he'd look to run for a third term in the White House. The comments came in a wide-ranging and at time combative interview with Kristen Walker that aired Sunday on NBC’s “Meet the Press.\" The Republican president’s efforts to quickly enact his agenda are beginning to face sharper headwinds just as his administration crossed the 100-day mark this past week.",
      "publishedAt": "2025-05-04T13:08:45Z",
      "title": "Trump, in a new interview, says he doesn't know if he backs due process rights",
      "url": "https://apnews.com/article/trump-due-process-canada-greenland-military-action-8da3e853b6cec944ec373fae4d317ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b28a790/2147483647/strip/true/crop/2885x1623+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F88%2Fb89823e8ff67f89c97dfa3de1164%2Fc28eed8434c04d12ac9681ae96b8f635"
    },
    {
      "author": "Tia Goldenberg",
      "description": "Top Israeli Cabinet ministers are set to meet to vote on whether to intensify the country’s military operations in the Gaza Strip, as the country's main airport was closed following a missile launched from Yemen. The army has begun to call up thousands of reserve soldiers in preparation for an expanded assault, Israeli officials said Sunday. The plans to escalate fighting in Gaza more than 18 months after the war there erupted come as a humanitarian crisis in the territory deepens. Houthi rebels on Sunday launched a missile that set off air raid sirens in many parts of the country. A large plume of smoke could be seen rising near Ben-Gurion Airport, according to footage shared by Israeli media.",
      "publishedAt": "2025-05-04T07:24:05Z",
      "title": "Israeli Cabinet ministers to vote on whether to expand Gaza fighting",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-05-2025-44737a4e5eba0bdd2cfe9b008b600d0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f999d4/2147483647/strip/true/crop/6420x3611+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F7c%2F429c5267f6ac2d7be874d4c23565%2F258e58d5b08e40159cef652615d4152b"
    },
    {
      "author": "Associated Pres",
      "description": "It felt much longer, but the U.S. stock market needed just a few weeks to roar all the way back to where it was on President Donald Trump’s “Liberation Day.” That’s when he shocked Wall Street by announcing much steeper tariffs than expected on nearly all U.S. trading partners. Within just four days, the S&P 500 fell about 12%, and the Dow Jones Industrial Average lost nearly 4,600 points, or about 11%. This past Friday, though, the S&P 500 rallied for a ninth straight gain and pulled back to where it was on April 2. Trump's 90-day pause on many tariffs and a resilient economy helped the market bounce back.",
      "publishedAt": "2025-05-04T12:40:39Z",
      "title": "How the stock market made back all its losses after Trump escalated the trade war",
      "url": "https://apnews.com/article/trump-tariffs-stock-market-bonds-dollar-pause-5409392268729ba0ada7077d0eea9e4e",
      "urlToImage": "https://dims.apnews.com/dims4/default/41ff5fc/2147483647/strip/true/crop/2987x1680+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F72%2Fec2c7ce10d04ecb061a0d34d862f%2F2614279450bc415b834bf3a60125532b"
    },
    {
      "author": "Stephen Mcgrath",
      "description": "Romanians are casting ballots in a critical presidential election redo after last year’s annulled vote plunged the European Union and NATO member country into its worst political crisis in decades. Eleven candidates are vying for the presidency and a May 18 runoff is expected. A median of local polls suggests George Simion, a MAGA-style hard-right nationalist, will emerge as the frontrunner, likely pitting him against Bucharest Mayor Nicusor Dan, or the governing coalition’s candidate Crin Antonescu.",
      "publishedAt": "2025-05-04T04:06:10Z",
      "title": "Romanians cast votes in presidential rerun after voided election sparked deep political crisis",
      "url": "https://apnews.com/article/romania-election-presidential-crisis-e6ce0a674cf88bfc02c505482dc2497b",
      "urlToImage": "https://dims.apnews.com/dims4/default/225b9ab/2147483647/strip/true/crop/6862x3860+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2Fa2%2F683231fe381391343e5f4b73abd5%2Fd0c33d9ef1db4783a2f58048f5ad7918"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin said there has been no need to use nuclear weapons in the war in Ukraine and expressed hope that such a scenario will not arise. In a preview aired Sunday of a state TV interview, Putin said Russia has the strength to bring the conflict to a “logical conclusion.” His remarks come amid competing Russian and Ukrainian ceasefire proposals and continued fighting. Ukrainian officials said 11 people, including two children, were wounded in a Russian drone strike on Kyiv overnight. Russia’s Defense Ministry said its air defenses shot down 13 Ukrainian drones.",
      "publishedAt": "2025-05-04T09:02:38Z",
      "title": "Putin says he hopes nuclear weapons won't be needed in Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-nuclear-putin-ceasefire-868bda4fc666ec3b05a1e512eca91b3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2892fe5/2147483647/strip/true/crop/6510x3662+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F90%2F1d69e1bb826577f20a614df07997%2F9034cb9b4951494eb5a3d8278e25ebd5"
    },
    {
      "author": "Bill Barrow",
      "description": "Democrats are looking for the right message and messengers to lead the opposition to President Donald Trump in his second term. And two vastly different politicians are emerging as top Democratic voices. They are Illinois Gov. JB Pritzker and Alexandria Ocasio-Cortez, a New York congresswoman. Both have drawn praise for high-profile speeches and events that have excited voters on the left. Pritzker is a billionaire heir who calls Trump as a threat to democracy and national stability. Ocasio-Cortez maintains her antiestablishment profile and labels Trump a corrupt billionaire who's hurting the working class he says he represents. Their messages highlight a familiar argument among Democrats' progressive and more moderate factions.",
      "publishedAt": "2025-05-04T11:51:59Z",
      "title": "Pritzker and Ocasio-Cortez emerge as Trump resistance leaders",
      "url": "https://apnews.com/article/pritzker-trump-ocasio-cortez-democrats-resistance-message-9d4f7868892629e34df7ea1e29dc0b34",
      "urlToImage": "https://dims.apnews.com/dims4/default/504faf2/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Fcb%2F08889530a724656379ecf14f7884%2F43ab07c20967473a948a7dad2287b173"
    },
    {
      "author": "Mike Stobbe",
      "description": "More than a dozen data-gathering programs that track deaths and disease appear to have been eliminated in the tornado of layoffs and proposed budget cuts in the Trump administration’s first 100 days. The Associated Press examined draft and final budget proposals and spoke to more than a dozen current and former federal employees to determine the scope of the cuts to programs tracking basic facts about Americans’ health. Among those terminated at the Centers for Disease Control and Prevention are experts tracking abortions, pregnancies, job-related injuries, lead poisonings, sexual violence and youth smoking.",
      "publishedAt": "2025-05-04T12:00:07Z",
      "title": "Cuts have eliminated more than a dozen US government health-tracking programs",
      "url": "https://apnews.com/article/cdc-disease-tracking-health-surveillance-554eb9aa20b758714eba8b835dcde856",
      "urlToImage": "https://dims.apnews.com/dims4/default/c436720/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F40%2F60ad860f4ffb5d8f4ade73d2c139%2Fbe07d9ac55ed4a719f2c969c5125ab4b"
    },
    {
      "author": null,
      "description": "Brazilian police say that they have thwarted a plot to detonate a bomb at Lady Gaga’s concert the night before in Rio de Janeiro, the biggest show of her career that drew some 2 million fans to Copacabana Beach. The Rio de Janeiro state police said Sunday they had worked with the Justice Ministry to disrupt the attack allegedly planned by a group that was spreading hate speech against the LGBTQ community. Two people have been arrested. Police said the group sought to radicalize and recruit teenagers to carry out attacks using Molotov cocktails and improvised explosives.",
      "publishedAt": "2025-05-04T15:18:55Z",
      "title": "Brazilian police arrest two people over plot to bomb Lady Gaga's concert in Rio",
      "url": "https://apnews.com/article/brazil-concert-lady-gaga-bomb-plot-arrests-f280b304d3a2793c2ab48be07b44a964",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0d3d51/2147483647/strip/true/crop/6188x3481+0+323/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F08%2F39f9733e1b4d3c0c6558f66a4be1%2Fdd70782e1f554fe7bcf1861ab7574de5"
    },
    {
      "author": null,
      "description": "For more than two decades, Sean “Diddy” Combs was one of hip-hop’s most opportunistic entrepreneurs. He spun his hitmaking talents into a broad business empire that included a record label, a fashion brand, a media company, deals with liquor companies and a key role in a reality TV show. But U.S. prosecutors say that behind the scenes, Combs was coercing and abusing women for years with help from a network of associates who helped silence victims through blackmail and violence. Combs has pleaded not guilty and denied the allegations. Jury selection for his trial starts Monday.",
      "publishedAt": "2025-05-04T11:50:49Z",
      "title": "A timeline of the rise and fall of Sean 'Diddy' Combs",
      "url": "https://apnews.com/article/diddy-sean-combs-timeline-f9c343652872f787a73069d50a821611",
      "urlToImage": "https://dims.apnews.com/dims4/default/cbcf481/2147483647/strip/true/crop/1992x1121+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F4f%2F95dd4e4009b33d93245914883a45%2Ffa34d246f97345e8b53ca1ba14b57a13"
    },
    {
      "author": "Jenna Fryer",
      "description": "Oscar Piastri maintained his advantage in the Formula 1 championship fight by winning the Miami Grand Prix for his fourth win through six races this season. Piastri has now won three consecutive F1 races for McLaren Racing, where he and teammate Lando Norris are trying to dethrone four-time defending champion Max Verstappen of Red Bull. Piastri is the first McLaren driver to win three consecutive F1 races in 28 years. Mika Hakkinen did it with a win in the 1997 season finale and then victories in the first two races of 1998. Norris was second as McLaren went 1-2.",
      "publishedAt": "2025-05-04T21:41:49Z",
      "title": "Oscar Piastri wins F1's Miami Grand Prix",
      "url": "https://apnews.com/article/f1-miami-grand-prix-90297b7ba4d14426048979bf607c55f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/933fa46/2147483647/strip/true/crop/5082x2859+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2Fee%2F047ee721d0ed650fbfa3491eec8b%2F26f9723669ae404bb5280fb062b2af50"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}