{
  "articles": [
    {
      "author": "JILL COLVIN, ERIC TUCKER, BERNARD CONDON and JIM MUSTIAN",
      "description": "WASHINGTON (AP) — Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally.",
      "publishedAt": "2024-07-26T23:00:43Z",
      "title": "FBI says Trump was indeed struck by bullet during assassination attempt",
      "url": "https://apnews.com/cb780b9d1a078f0be4191682e75101cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd9651c55071435d9515f6f5d069848d/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER and MEGAN JANETSKY",
      "description": "PARIS (AP) — A hot-air balloon brought an Olympic ring of fire into a rainy sky and singer Celine Dion belted from the Eiffel Tower as Paris kicked off its first Summer Olympics in a century Friday, with a four-hour-long, rule-breaking opening ceremony that unfurled along the Seine River.",
      "publishedAt": "2024-07-26T10:23:50Z",
      "title": "Paris dazzles with a rainy Olympics opening ceremony on the Seine River",
      "url": "https://apnews.com/9ed330cb83d89d68092ac5858c0fe590",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3090648deafb420fb0485faecf3752fe/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON and JEFFREY SCHAEFFER",
      "description": "PARIS (AP) — Arsonists attacked France's high-speed rail network early Friday, setting fires that paralyzed train travel to Paris for some 800,000 people across Europe, including athletes heading to the opening ceremony of the Olympic Games.",
      "publishedAt": "2024-07-26T07:10:11Z",
      "title": "Arsonists attack French high-speed rail system hours before opening ceremonies of the Paris Olympics",
      "url": "https://apnews.com/74c9727d33ac86bfc126f98e45cb874f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b2758090ae4202a5f0e95d50caebdc/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and MICHELLE PRICE",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu worked to mend ties with Republican presidential candidate Donald Trump on Friday and offered measured optimism about progress toward a cease-fire deal for Gaza, nearing the end of a contentious U.S.",
      "publishedAt": "2024-07-26T04:03:47Z",
      "title": "Netanyahu meets with Trump at Mar-a-Lago, offering measured optimism on a Gaza cease-fire",
      "url": "https://apnews.com/3d7a6b47060fbe51f66d82104ac5e1aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00c58fa3898247c1895d520d3feddab1/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Former President Barack Obama and former first lady Michelle Obama have endorsed Kamala Harris in her White House bid, giving the vice president the expected but still crucial backing of the nation’s two most popular Democrats.",
      "publishedAt": "2024-07-26T09:00:18Z",
      "title": "Barack and Michelle Obama endorse Kamala Harris, giving her expected but crucial support",
      "url": "https://apnews.com/48e38547560ae64484399d278c697a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8194fa8f377741eaabcf990820193dac/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, MARÍA VERZA and CHRISTOPHER SHERMAN",
      "description": "WASHINGTON (AP) — A powerful Mexican drug cartel leader who eluded authorities for decades was duped into flying into the U.S., where he was arrested alongside a son of Joaquín “El Chapo” Guzmán, according to a U.S.",
      "publishedAt": "2024-07-26T16:12:03Z",
      "title": "Powerful cartel leader 'El Mayo’ Zambada was lured onto airplane before arrest in US, AP source says",
      "url": "https://apnews.com/1d658ece5313a4de35bed732b3a86abf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f6a61de70e4cc6b9534f24b2ebbd00/2000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Mexican President Andrés Manuel López Obrador thanked Guatemala on Friday for helping the nearly 600 Mexicans who have crossed into Guatemala to escape drug cartel violence, but also minimized the violence that drove them there.",
      "publishedAt": "2024-07-26T19:33:46Z",
      "title": "Mexico's president downplays cartel violence that drove nearly 600 Mexicans into Guatemala",
      "url": "https://apnews.com/8bb8ab7225e58cda2b013aa58be72fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/881899416d9b41cfba18ca7c4bccdcda/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — A key question is looming for Vice President Kamala Harris as she edges closer to gaining the Democratic presidential nomination: Can she turn the Biden-Harris economic record into a political advantage in a way that President Joe Biden failed to do?",
      "publishedAt": "2024-07-26T07:00:28Z",
      "title": "Harris will carry Biden's economic record into the election. She hopes to turn it into an asset",
      "url": "https://apnews.com/d4dc87e150e5c0b76b664ad7525e05a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f79d85bb725498387e976e8cbac4dfb/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. health officials Friday announced a recall of some Boar's Head liverwurst and deli meats as they investigate a listeria outbreak that has sickened nearly three dozen people and caused two deaths.",
      "publishedAt": "2024-07-26T14:43:49Z",
      "title": "Recall of Boar's Head deli meats announced during investigation of listeria outbreak",
      "url": "https://apnews.com/2ab9ad2db304d829807982a53898cdb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f493c20c65d4a3a8d81e99980dece00/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE and JOHN ANTCZAK",
      "description": "Communities in the U.S. West and Canada were under siege from raging wildfires on Friday, as a fast-moving blaze sparked by lightning sent people fleeing on fire-ringed roads in rural Idaho and a human-caused inferno forced the evacuation of hundreds of homes in northern California.",
      "publishedAt": "2024-07-26T12:14:45Z",
      "title": "A tanker plane crash has killed a firefighting pilot in Oregon as Western wildfires spread",
      "url": "https://apnews.com/90e078225df39c0ed23e8edb9d26b8c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e3adc6ef3534b0faa3ebc00090f6805/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}