{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian officials say that Russia pounded the capital with yet another major missile and drone attack. At least least two people were killed in the attack overnight into Thursday. The strikes caused fires across Kyiv a day after the heaviest aerial attack of the war so far. An official in Kyiv said at least 16 people were wounded in the latest barrage. Russia has recently sought to overwhelm Ukraine’s air defenses with major attacks that include increasing numbers of decoy drones. The pressure has caused alarm among Ukrainian officials who are uncertain about continuing vital military aid from the United States and U.S. President Donald Trump’s policy toward Russia.",
      "publishedAt": "2025-07-10T02:23:26Z",
      "title": "Russia hits Kyiv with more missiles and drones",
      "url": "https://apnews.com/article/russia-drone-attack-ukraine-war-d16f45fdbb8fbd0152c7a2c7c5d3cf9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/90313ff/2147483647/strip/true/crop/7742x4355+0+403/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F9e%2F042c82ebace1188ee87ab18164df%2F3e5f2267a91e445f947d16e1491c7d92"
    },
    {
      "author": null,
      "description": "The Los Angeles Fire Department says 31 workers have been safely removed from an industrial tunnel after part of the structure collapsed. The workers were up to 6 miles from the tunnel’s only entrance Wednesday. Some workers scrambled over a tall mound of loose soil to reach coworkers. They were shuttled to the entrance and hoisted out. Paramedics were evaluating 27 of the workers and officials say none had major injuries. A Los Angeles County Sanitation Districts spokesperson says authorities are still investigating the cause of the cave-in at the nearly $700 million project.",
      "publishedAt": "2025-07-10T04:40:33Z",
      "title": "Wilmington tunnel collapse: 31 construction workers reach safety",
      "url": "https://apnews.com/article/tunnel-collapse-los-angeles-2dfef5cb607394c6a71e3b84436fde12",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c1ee5d/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fb5%2F925938b2796433c01bf936499302%2F629c5b24962e4e6fbd17bf91bcdd7882"
    },
    {
      "author": null,
      "description": "A special tribunal has indicted Bangladesh’s ousted Prime Minister Sheikh Hasina by accepting charges of crimes against humanity filed against her in connection with a mass uprising in which hundreds of students were killed last year. A three-member panel indicted Hasina, former Home Minister Asaduzzaman Khan and former police chief Chowdhury Abdullah Al-Mamun on five charges. Hasina and Khan are being tried in absentia. A lawyer appointed by the state for Hasina and Khan appeared Thursday and filed a petition to drop their names from the case but the tribunal rejected the plea.",
      "publishedAt": "2025-07-10T08:40:27Z",
      "title": "Bangladesh tribunal indicts ousted Prime Minister Hasina over deaths of protesters",
      "url": "https://apnews.com/article/bangladesh-hasina-indicted-eccdec5fd7a4c433c8b1559d9910eecb",
      "urlToImage": "https://dims.apnews.com/dims4/default/aef1ff5/2147483647/strip/true/crop/5671x3190+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F47%2Ff51de83e709b18fce81c6d263504%2F65eea2b4658f4b24ad8f4eeffab72989"
    },
    {
      "author": null,
      "description": "Several hundred people have gathered for a worship ceremony at a high school stadium in Texas. The vigil was held Wednesday evening to remember of the at least 120 people who died in the catastrophic flash floods over the July Fourth holiday. More than 160 are still believed to be missing in hard-hit Kerr County. People in the crowd clutched one another and brushed away tears during the vigil. Search crews and volunteers are continuing to scour miles along the Guadalupe River for the people still missing. The floods are now the deadliest from inland flooding in the U.S. since 1976.",
      "publishedAt": "2025-07-10T04:06:59Z",
      "title": "Hundreds gather at Texas vigil following deadly floods",
      "url": "https://apnews.com/article/texas-floods-worship-ceremony-dead-missing-39afd477993c6220d0ce8c080cea0828",
      "urlToImage": "https://dims.apnews.com/dims4/default/d68995b/2147483647/strip/true/crop/5595x3147+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Faa%2F76838ea47c9996d1b02db06cfdb6%2F802f091d658043249f88c93c62d4568a"
    },
    {
      "author": null,
      "description": "President Donald Trump has sent out tariff letters to seven smaller U.S. trading partners in his first batch of import tax announcements of the day. The countries targeted so far Wednesday are the Philippines, Brunei, Moldova, Algeria, Libya, Iraq and Sri Lanka. None of them is a major industrial rival to the United States. He says a letter is also coming for Brazil. Most economic analyses say the tariffs will worsen inflationary pressures and subtract from economic growth. But Trump has used the taxes as a way to assert the diplomatic and financial power of the U.S. on both rivals and allies.",
      "publishedAt": "2025-07-09T16:28:19Z",
      "title": "Trump sends out tariff letters to 7 more countries and more are coming",
      "url": "https://apnews.com/article/trump-tariffs-eu-trading-partners-letter-958bafd5f28d600eb0dd55fa8e942f64",
      "urlToImage": "https://dims.apnews.com/dims4/default/02c5094/2147483647/strip/true/crop/5955x3350+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F9c%2F2086f532e6710128516c1a3f0307%2F31aa08873fa249d8b2d164eb89aecd7f"
    },
    {
      "author": null,
      "description": "Houthi rebels have attacked and sunk the cargo ship Eternity C in the Red Sea. A European naval force reported Wednesday that only six of the 25 crew members have been rescued so far. The attack Monday night, which also killed at least three crew members, marks one of the most serious assaults in the region’s vital maritime trade route. It follows another Houthi attack on a bulk carrier earlier in the week. International condemnation has been swift, with the U.S. and European Union emphasizing the threat to navigation and security. Rescue efforts for the missing crew are ongoing.",
      "publishedAt": "2025-07-09T08:43:07Z",
      "title": "Ship attacked by Houthi rebels sinks in Red Sea, 6 of 25 aboard rescued",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-eternity-c-0ada222883158dd248b0d844543736c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbee862/2147483647/strip/true/crop/2160x1215+0+113/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F29%2Fdb54ca2792baddf0596de42025cb%2Fd7565b207b9b4d4ab47edd6927d74dc9"
    },
    {
      "author": null,
      "description": "Houthi rebels in Yemen have launched a violent new wave of attacks on ships in the Red Sea, sinking two vessels and killing crew members. The assaults beginning over the weekend mark an escalation in their campaign tied to the Israel-Hamas conflict. Backed by Iran, the Houthis have long targeted shipping in the region, disrupting trade and causing significant losses. Experts say the recent attacks involved advanced tactics, including drones and missiles. Despite prior ceasefires and international airstrikes, the Houthis remain capable of carrying out such operations, raising concerns about escalating violence and instability in the region.",
      "publishedAt": "2025-07-10T08:33:59Z",
      "title": "What to know about Yemen's Houthi rebels",
      "url": "https://apnews.com/article/who-are-yemen-houthis-israel-hamas-war-1cd31b8f97dacf49cb5c4228208d419e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8e580e/2147483647/strip/true/crop/5428x3053+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fa0%2F6ed204a5ca8cf342a15e1a55524a%2F238483ce14574b93a880137a284597ea"
    },
    {
      "author": null,
      "description": "President Joe Biden’s White House physician is refusing answer questions as part of the House Republican investigation into Biden’s health in office. Dr. Kevin O’Connor's lawyers say O'Connor invoked doctor-client privilege and his rights under the Fifth Amendment before the House Oversight Committee on Wednesday. Republicans are investigating Biden’s actions in office and questioning whether the Democrat's use of an autopen may have been invalid. Biden has strongly denied he was not in a right state of mind at any point while in office, calling the claims “ridiculous and false.” Oversight Committee Chair Rep. James Comer of Kentucky says O’Connor’s decision not to testify makes it \"clear there was a conspiracy.”",
      "publishedAt": "2025-07-09T14:42:10Z",
      "title": "Biden's ex-doctor doesn't answer questions in House Republican probe",
      "url": "https://apnews.com/article/biden-doctor-kevin-oconnor-testimony-5c2a75c6bec319bb4ff8a417993e3d6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/64652bf/2147483647/strip/true/crop/5316x2990+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fd2%2Fea6a20a49cce037a18e8934c0ffd%2F0a74f9372176409d82cd681d580ccb55"
    },
    {
      "author": null,
      "description": "Measles cases in the U.S. are at their highest in three decades. The U.S. Centers for Disease Control and Prevention says the U.S. has 1,288 cases since the beginning of the year. That’s higher than 2019, when there 1,274 cases driven by 22 outbreaks over 12 months. Seventeen states have seen outbreaks this year. Experts fear the U.S. may lose its status as having eliminated measles. There are also large outbreaks of the vaccine-preventable disease in Mexico and Canada.",
      "publishedAt": "2025-07-09T14:50:51Z",
      "title": "The US is having its worst year for measles in more than three decades",
      "url": "https://apnews.com/article/measles-outbreak-us-texas-mmr-vaccine-rfk-144ed193e13de675a750e52a505423e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/006cd24/2147483647/strip/true/crop/8474x4767+0+442/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F09%2F3e7297b0d417169d5c162a80cfb8%2Feb1949e0ddfa4c3badb288e84bbc0bcb"
    },
    {
      "author": null,
      "description": "Dr. Claudette Yaméogo is Burkina Faso’s only ophthalmologist who specializes in treating children. She is one of just 70 eye doctors for the West African nation's 23 million people. Treating children requires time and the stakes are high. Certain eye diseases can be cured if diagnosed early. And injuries need swift treatment to avoid lasting damage. But many people in Burkina Faso cannot afford to travel to the cities where most ophthalmologists practice, much less pay for care. Yaméogo knows this and visits some families for free consultations. The growing threat of extremist violence in the country complicates the work even more.",
      "publishedAt": "2025-07-10T05:10:25Z",
      "title": "Burkina Faso’s only pediatric eye doctor treats children amid conflict and poverty",
      "url": "https://apnews.com/article/burkina-faso-children-eye-doctor-health-e0abe5a5c44dbdafac755b9efb90180e",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb98d28/2147483647/strip/true/crop/3984x2241+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F3b%2F4a3e6dfa7bfcdec95f3c7faf3f2e%2F11f925616f6645e58f091cf0a44fb59c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}