{
  "articles": [
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday warned that Israel was losing international support because of its “indiscriminate bombing\" of Gaza, speaking out in unusually strong language as the United Nations neared a vote on demanding a cease-fire in the Israel-Hamas war.",
      "publishedAt": "2023-12-12T19:08:17Z",
      "title": "Biden takes a tougher stance on Israel's 'indiscriminate bombing' of Gaza'",
      "url": "https://apnews.com/44c4229d4c1270d9cfa484b664a22071",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ccd73bcf1994e7e9f91567ab9205a8f/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces carried out strikes across Gaza on Tuesday, crushing Palestinians in homes, as the military pressed ahead with an offensive that officials say could go on for weeks or months, even while global calls for a cease-fire leave Israel and its main ally, the United States, increasingly isolated.",
      "publishedAt": "2023-12-12T08:16:19Z",
      "title": "Israel strikes across Gaza as the offensive leaves both it and the US increasingly isolated",
      "url": "https://apnews.com/b52ae70a89443728517f1d3d7508992c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a3a1e7885384237aa1e980523325cec/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The birth of their daughter should have marked the beginning of a joyful chapter for the young Palestinian couple. Instead, the devastating war in Gaza, now in its third month, has turned childbirth and parenthood into a time of worry and fear for Salim and Israa al-Jamala.",
      "publishedAt": "2023-12-12T19:01:40Z",
      "title": "Packed hospitals, treacherous roads, harried parents: Newborns in Gaza face steeper odds of survival",
      "url": "https://apnews.com/4dd63356a472d1b6ef41b7269c19a75f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a385df9ded274d02b390837bfc500578/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — His country's future at stake, Ukrainian President Volodymyr Zelenskyy used inspirational words, resolve and a nod to Christmas in appealing Tuesday to leaders in Congress for U.S.",
      "publishedAt": "2023-12-12T05:27:18Z",
      "title": "Zelenskyy visits Capitol Hill and the White House with US aid for Ukraine at risk of collapse",
      "url": "https://apnews.com/5796a2429169d01959510f318fbc968a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d87a80486ca64dff827f8936c6638754/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Even before anyone has cast a vote in a 2024 presidential primary, the attention of many political journalists has shifted to Jan. 20, 2025.There has been a flurry of recent stories about the implications of a potential second presidency for Donald Trump, and his team's planning for Inauguration Day and beyond.",
      "publishedAt": "2023-12-12T05:05:38Z",
      "title": "Journalists tackle a political what-if: What might a second Trump presidency look like?",
      "url": "https://apnews.com/79e005396710c9ac85589f855541a38c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6388d16f509b40ad8d4035832961dcf4/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Scared for her life after Rudy Giuliani and other Trump allies falsely accused her of fraud, Georgia election worker Wandrea “Shaye” Moss told jurors Tuesday she seldom leaves her home, suffers from panic attacks and battles nightmares brought on by a barrage of threatening and racist messages.",
      "publishedAt": "2023-12-12T15:13:01Z",
      "title": "Georgia election worker says she feared for her life over fraud lies in Giuliani defamation case",
      "url": "https://apnews.com/0151222465923e9dcad489adb7661f0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af6e628b1bd1427b88229ffd339ff5bd/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "CENTRAL ISLIP, N.Y. (AP) — Former U.S. Rep. George Santos ' lawyer expressed optimism about plea negotiations in Santos' criminal fraud case Tuesday, successfully fending off prosecutors' attempts to speed up the the ousted congressman’s trial.",
      "publishedAt": "2023-12-12T17:12:20Z",
      "title": "George Santos attorney expresses optimism about plea talks as expelled congressman appears in court",
      "url": "https://apnews.com/78494765461d742dadb2f7fdac63f9ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e638045647b455f9b188319e2c2dfe0/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC and KATHY McCORMACK",
      "description": "CAMBRIDGE, Mass. (AP) — Harvard President Claudine Gay will remain leader of the prestigious Ivy League school following her comments last week at a congressional hearing on antisemitism, the university's highest governing body announced Tuesday.",
      "publishedAt": "2023-12-12T12:48:59Z",
      "title": "Harvard board keeps president as leader of Ivy League school following antisemitism backlash",
      "url": "https://apnews.com/48277807b0e4e492ac47f7ed9dbea147",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2d1899ad37948ce878def4232d7ca87/2821.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "SAN FRANCISCO (AP) — Google lost an antitrust lawsuit over barriers to its Android app store, as a federal court jury has decided that the company's payments system was anticompetitive and damaged smartphone consumers and software developers.",
      "publishedAt": "2023-12-12T18:23:47Z",
      "title": "Epic wins its antitrust lawsuit against the Play Store. What does this verdict mean for Google?",
      "url": "https://apnews.com/65ad92943418923206a032946ab6b422",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c560cd6682f4859a2e3770e5621cdbc/3000.jpeg"
    },
    {
      "author": "PAT EATON-ROBB",
      "description": "SOUTH WINDSOR, Conn. (AP) — A day after professional hockey player Adam Johnson suffered a fatal cut to his throat during a game in England, Dan Sacco went out and ordered his 10-year-old twins new neck guards.",
      "publishedAt": "2023-12-12T15:52:49Z",
      "title": "Death of Adam Johnson sparks renewed interest in guard mandates for youth hockey",
      "url": "https://apnews.com/dcc8fc5fe48c8dfaab476bfb697d510a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cd044d3e901432baed4ef8ef267f615/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}