{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Iran held annual military drills with Russia as a second American aircraft carrier drew closer to the Middle East. Both the United States and Iran are signaling they are prepared for war if talks on Tehran’s nuclear program fizzle out. President Donald Trump said Thursday he believes 10 to 15 days is enough time for Iran to reach a deal. But talks on its nuclear program have been deadlocked for years, and Iran has refused to discuss wider U.S. and Israeli demands that it scale back its missile program and sever ties to armed groups. Indirect talks held in recent weeks made little visible progress, and one or both sides could be buying time for final war preparations.",
      "publishedAt": "2026-02-19T08:04:43Z",
      "title": "Trump warns of 'bad things' if Iran doesn't make a deal",
      "url": "https://apnews.com/article/iran-us-russia-drill-nuclear-talks-aircraft-carrier-0456903e0d7a24cfcdc33d53732dee2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/68fe7c0/2147483647/strip/true/crop/4800x3198+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F97%2F532fc68388db2b374dd03913b6bf%2F25752bd85ebd4e54862d41250c82eb71"
    },
    {
      "author": "Jon Gambrell",
      "description": "Saudi Arabia could have some form of uranium enrichment within the kingdom under a proposed nuclear deal with the United States. That's according to congressional documents and an arms control group. Both U.S. Presidents Donald Trump and Joe Biden tried to reach a nuclear deal with the kingdom to share American technology. Nonproliferation experts warn any spinning centrifuges within Saudi Arabia could open the door to a possible weapons program for the kingdom. The kingdom's assertive crown prince has suggested he could pursue a nuclear weapon if Tehran obtains an atomic bomb.",
      "publishedAt": "2026-02-20T08:06:10Z",
      "title": "Saudi Arabia may enrich uranium under proposed US deal",
      "url": "https://apnews.com/article/saudi-arabia-us-nuclear-enrichment-bomb-proliferation-18cb979f0abf5f0d81c1c91f45d6a6ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/534ff5c/2147483647/strip/true/crop/2902x1934+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F28%2F31c4e7d275828bf52b5d7428d47a%2F8ab6ea011b9d4f7591c464e97eb8b063"
    },
    {
      "author": "Amir-hussein Radjy, Kareem Chehayeb",
      "description": "Iranians are still reeling with shock, grief and fear after Iran's rulers unleashed the deadliest crackdown ever seen in the Islamic Republic last month. But a vein of defiance persists. In some districts of the capital and other cities, residents shout anti-government slogans from their roofs and balconies at night. And this week, memorials marking the passage of 40 days since protesters' deaths are being held, turning a traditional rite of mourning into political protests. In videos of some 40-day memorials, hundreds gather and often chant against the government.",
      "publishedAt": "2026-02-19T17:04:04Z",
      "title": "Iranians grieve defiantly 40 days after deadly crackdown",
      "url": "https://apnews.com/article/iran-protests-memorials-chehelom-71e5db503a287126a2d31cb32a2809eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/91333ca/2147483647/strip/true/crop/2713x1808+0+82/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2Fd2%2F8137a1d3d261a496a7e1eae031c0%2F3994ba7b01914387bba74bb5b830c628"
    },
    {
      "author": "Imad Isseid, Melanie Lidman",
      "description": "The Palestinian Health Ministry and a witness say that Israeli settlers in the occupied West Bank shot and killed a Palestinian-American in an attack on a village. Resident Raed Abu Ali says the attack took place Wednesday in the village of Mukhmas. The Israeli military said its soldiers responded to a violent confrontation there and tried to disperse a riot. Separately, the Committee to Protect Journalists has reported that detained Palestinian journalists faced beatings, stress positions and medical neglect while in Israeli detention. The U.N. says Gaza’s destruction is so vast that clearing rubble alone will take seven years.",
      "publishedAt": "2026-02-19T11:41:19Z",
      "title": "Palestinian-American man killed by settlers in West Bank clashes",
      "url": "https://apnews.com/article/israel-west-bank-gaza-war-palestinians-ec2736c95acf273a9fb1f2d541f46bb5",
      "urlToImage": "https://dims.apnews.com/dims4/default/e2a2384/2147483647/strip/true/crop/8563x5706+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F3a%2F36f5901d0f4a2cdb0d18d5692b83%2F5a6f12b739a94459be66ddaa33fc05f3"
    },
    {
      "author": "Joey Cappelletti, Steven Sloan",
      "description": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors. The Republican president is still expected to meet with governors at the White House on Friday but the event won't be facilitated by the governors' group. Trump had refused to include Democratic Jared Polis of Colorado and Wes Moore of Maryland and he recently blasted them on social media as “not worthy of being there.” The episode underscores the confrontational approach Trump has taken during his second term toward state leaders he doesn't like.",
      "publishedAt": "2026-02-19T05:15:03Z",
      "title": "Group backs out after Trump won't invite all governors to the White House",
      "url": "https://apnews.com/article/governors-trump-meeting-counterweight-washington-5e078af4172aba3ea3c734c910e4e0c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/43a78d4/2147483647/strip/true/crop/5603x3733+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F01%2F4d59b39ea23ebf44e89974f57c24%2Fee69369429944fc291dafaa73da95874"
    },
    {
      "author": "Sudhin Thanawala",
      "description": "A federal judge has accused the Trump administration of terrorizing immigrants and recklessly violating the law in its efforts to deport millions of people living in the country illegally. Citing the deaths of Renee Good and Alex Pretti in Minnesota, the judge said in a scathing decision late Wednesday that the White House had also “extended its violence on its own citizens.” U.S. District Judge Sunshine Sykes in Riverside, California ordered the U.S. Department of Homeland Security to provide detained immigrants around the country with notice of her earlier decision that they may be eligible to seek release on bond. The department said in a statement that the Supreme Court had “repeatedly overruled” lower courts on the issue of mandatory detention.",
      "publishedAt": "2026-02-19T17:49:11Z",
      "title": "Federal judge slams Trump administration's immigration crackdown in scathing decision",
      "url": "https://apnews.com/article/immigration-trump-detention-bond-judge-50a5da122aa51eed77cace0830548df3",
      "urlToImage": "https://dims.apnews.com/dims4/default/b16ac16/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2Fee%2Fc0771d40cb34fb818d088e655456%2Fe0d6d797a9294d70bb1ad3fb14800cdd"
    },
    {
      "author": "Alanna Durkin Richer",
      "description": "A large banner featuring Donald Trump’s face has been hung on the exterior of Justice Department headquarters in a physical display of the Republican president’s efforts to exert power over the law enforcement agency. While Trump banners have been hung outside other agencies across Washington, the decision to place one on the storied Justice Department building Thursday amounts to a striking symbol of the erosion of the department’s tradition of independence from White House control. The banner, hung between two columns on one corner of the building, says, “Make America Safe Again,” a slogan used by the administration to tout its efforts to clamp down on illegal immigration and violent crime.",
      "publishedAt": "2026-02-19T20:11:20Z",
      "title": "Trump banner displayed on Justice Department headquarters",
      "url": "https://apnews.com/article/donald-trump-banner-justice-department-pam-bondi-13f3d901c9bd6d179e206475adadc28a",
      "urlToImage": "https://dims.apnews.com/dims4/default/18e5761/2147483647/strip/true/crop/2073x1381+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F50%2Fb005497b477b27aaa5181711cbf6%2Fb152d96b72aa4d1da142575814a919c6"
    },
    {
      "author": "Russ Bynum",
      "description": "Kindergarten and first grade students at a Georgia school are mourning their teacher days after she was killed by a driver who authorities say was fleeing federal immigration officers. Principal Alonna McMullen says it was heartbreaking telling 5 and 6 year old students in Linda Davis' special needs classes of her death. The crash happened Monday less than a half mile from the school where Davis taught in Savannah's southern suburbs. Authorities say the driver was a Guatemalan man who crashed after running a stoplight to evade immigration officers seeking to detain him on a judge's deportation order. McMullen said Davis had an upbeat personality and a determination to ensure all of her students thrived.",
      "publishedAt": "2026-02-19T21:35:22Z",
      "title": "Students in Savannah grieve teacher killed in crash with driver pursued by ICE",
      "url": "https://apnews.com/article/ice-immigration-crash-savannah-teacher-linda-davis-daed7eaee667a725dc7e3891ab327ca5",
      "urlToImage": "https://dims.apnews.com/dims4/default/07ee779/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F17%2F685f0c641d6a857b10072aa667eb%2F8e062825a75149fb82e5a25095150306"
    },
    {
      "author": "Pan Pylas",
      "description": "Police are continuing their search of the former home of Andrew Mountbatten-Windsor, a day after the former prince was held in custody for the best part of 11 hours on suspicion of misconduct in public office linked to his friendship with the late convicted sex offender Jeffrey Epstein. Following one of the most tumultuous days in the modern history of Britain’s royal family, the former Prince Andrew is back at his new home on the Sandringham estate, King Charles III’s private retreat. Police have concluded their search there but are on Friday still searching Royal Lodge, his 30-room former home in the grounds of Windsor Castle, just west of the capital.",
      "publishedAt": "2026-02-20T09:43:22Z",
      "title": "Police continue to search Andrew Mountbatten-Windsor's former stately home, a day after his arrest",
      "url": "https://apnews.com/article/andrew-mountbatten-windsor-arrest-king-charles-61ea3c437680b8341e623e4d9efa47b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab41d6a/2147483647/strip/true/crop/6305x4201+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Fe1%2Fff61da098f1d819aa1f875b1382a%2F2f6548c5177c4f64884c155476ba3770"
    },
    {
      "author": null,
      "description": "El Salvador and Mexico have reported major cocaine seizures at sea this week, as U.S. strikes on suspected drug boats leave 11 people dead. On Thursday, Mexico said it had seized nearly four tonnes from a semisubmersible vessel and detained three people. Mexican officials said U.S. agencies shared intelligence for the operation. On Sunday, El Salvador’s navy had said that it made a record seizure of 6.6 tonnes from a ship off its coast. Divers found cocaine hidden in the ship's ballast tanks. Mexican President Claudia Sheinbaum has been under pressure to show results against drug trafficking.",
      "publishedAt": "2026-02-19T22:15:18Z",
      "title": "Mexico and El Salvador make big cocaine seizures at sea",
      "url": "https://apnews.com/article/mexico-us-el-salvador-drug-seizure-trump-a8e9a462cab590ae2e363a3cb3184359",
      "urlToImage": "https://dims.apnews.com/dims4/default/94013a9/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F72%2Fc1aaf1eafb24c433a423111bbfd7%2F1e26372437f342bb90ffd9b83c736c00"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}