{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and MENELAOS HADJICOSTIS",
      "description": "RAFAH, Gaza Strip (AP) — An aid ship loaded with some 200 tons of food set sail for Gaza on Tuesday in a pilot program for the opening of a sea corridor to the territory, where the five-month-old Israel-Hamas war has driven hundreds of thousands of Palestinians to the brink of starvation.",
      "publishedAt": "2024-03-12T07:12:04Z",
      "title": "Aid ship sets sail to Gaza where hundreds of thousands face starvation 5 months into war",
      "url": "https://apnews.com/d2ba829df1df1092cf421fc591af9063",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4111a6e550a461fa92466d742f24bf9/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and MENELAOS HADJICOSTIS",
      "description": "RAFAH, Gaza Strip (AP) — An aid ship loaded with some 200 tons of food set sail for Gaza on Tuesday in a pilot program for the opening of a sea corridor to the territory, where the five-month-old Israel-Hamas war has driven hundreds of thousands of Palestinians to the brink of starvation.",
      "publishedAt": "2024-03-12T07:12:04Z",
      "title": "Aid ship sets sail to Gaza where hundreds of thousands face starvation 5 months into war",
      "url": "https://apnews.com/d2ba829df1df1092cf421fc591af9063",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4111a6e550a461fa92466d742f24bf9/3000.jpeg"
    },
    {
      "author": "MOHAMMED JAHJOUH and SAMY MAGDY",
      "description": "MUWASI, Gaza Strip (AP) — It was a somber scene as Randa Baker and her family sat on the ground in their tent in southern Gaza at sunset Monday for their meal breaking their first day of fasting in the Muslim holy month of Ramadan.",
      "publishedAt": "2024-03-12T03:41:56Z",
      "title": "A Gaza family uprooted by war and grieving their losses shares a somber Ramadan meal in a tent",
      "url": "https://apnews.com/4a0a2043e7d6b5f9a70a70ba089d973b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7fafdb8bd2e484fb04d8253ee809873/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haitian Prime Minister Ariel Henry announced early Tuesday that he would resign once a transitional presidential council is created, bowing to international pressure to save the country overwhelmed by violent gangs that some experts say have unleashed a low-scale civil war.",
      "publishedAt": "2024-03-12T04:33:00Z",
      "title": "Ariel Henry bows to pressure, saying he'll resign once a council is formed to lead crisis-hit Haiti",
      "url": "https://apnews.com/28acaecc1d80d993c99fe43a5e1e1f7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261a6294b6bb4f65b5511b1b294fc659/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Joe Biden and Donald Trump hope to clinch their parties' presidential nominations with dominant victories in a slate of state primaries on Tuesday as the 2024 fight for the White House moves into a new phase.",
      "publishedAt": "2024-03-12T04:05:50Z",
      "title": "Biden and Trump could clinch nominations in Tuesday's contests, ushering in general election",
      "url": "https://apnews.com/15bb0084ad656903ffef14cfae822abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/106c5589330a4caa93df31a5b09f72f0/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — For more than half a century, Ohio was one of the most important states to watch during presidential election years, a place where both parties competed vigorously for support from voters who were often genuinely undecided.",
      "publishedAt": "2024-03-12T04:17:59Z",
      "title": "Purple Ohio? Parties in the former bellwether state take lessons from 2023 abortion, marijuana votes",
      "url": "https://apnews.com/873f34413637043dc6b1ff6edb83d181",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03df2db3d6bc47de9336f4f6e936cdac/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, COLLEEN LONG and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The special counsel who impugned the president’s age and competence in his report on how Joe Biden handled classified documents after his years as vice president is set to be questioned himself on Tuesday, as House Republicans seek to keep a spotlight on the unflattering assessment of the president.",
      "publishedAt": "2024-03-12T04:09:12Z",
      "title": "Special counsel Hur is set to testify before a House committee over handling of Biden documents case",
      "url": "https://apnews.com/122526da6d89d7bf4d6ccfc54590312b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04ef9418422745feb7f71111ca8ed697/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Consumer prices likely rose last month at a pace that would exceed the Federal Reserve's inflation target, underscoring why the Fed is being cautious as it considers when to cut interest rates and suggesting that inflation will remain a potent issue in this year's presidential election.",
      "publishedAt": "2024-03-12T04:01:21Z",
      "title": "US inflation likely stayed elevated last month as Federal Reserve looks toward eventual rate cuts",
      "url": "https://apnews.com/4ac316b6a435ef44c370ce7686da67c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1ea46e4b26a4656be36e3e138869ecc/2250.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "ABOARD THE FRENCH FRIGATE NORMANDIE (AP) — The French navy frigate, bristling with weaponry and powering through frigid Norwegian seas not so far from Russia, awoke at 7:30 a.m. sharp to what, in the circumstances, was a surreal sound.",
      "publishedAt": "2024-03-12T05:36:13Z",
      "title": "An expanding NATO uses its diversity as strength. Member troops know Russia is watching",
      "url": "https://apnews.com/e05e08f1ef80b9f09e48e9c53da4186d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/771e1d6796fc44c89961eb134d5e4eb6/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH and VLADIMIR ISACHENKOV",
      "description": "MOSCOW (AP) — Russians are finding a few imported staples, like fruit, coffee and olive oil, have shot way up in price. Most global brands have disappeared — or been reincarnated as Russian equivalents under new, Kremlin-friendly ownership.",
      "publishedAt": "2024-03-12T05:32:39Z",
      "title": "As Putin orchestrates his reelection, a resilient Russian economy is a key selling point",
      "url": "https://apnews.com/97a5f92113e54cd9af0aa31778069a3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1486b1ba85d47eaa1d8a5ed127e0eb5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}