{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An apparent Israeli airstrike killed seven aid workers with World Central Kitchen, leading the charity to suspend delivery Tuesday of vital food aid to Gaza, where Israel’s offensive has pushed hundreds of thousands of Palestinians to the brink of starvation.",
      "publishedAt": "2024-04-02T05:29:52Z",
      "title": "World Central Kitchen charity halts Gaza operations after apparent Israeli strike kills 7 workers",
      "url": "https://apnews.com/9bdf66771b62af37d85a2800f71c0e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a1c04b8d374e1d967d1eb68addb16a/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "CAIRO (AP) — It wasn’t lack of food that pushed Heba al-Haddad and her family to leave their home in Gaza City.",
      "publishedAt": "2024-04-02T06:02:37Z",
      "title": "Forced from their Gaza home by Israeli troops, a family makes a frightening walk through a war zone",
      "url": "https://apnews.com/f1d9838c60225a8c454e372df72ca245",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3d0fd8b633e41088ae4b70bf6222466/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and KAREEM CHEHAYEB",
      "description": "TEHRAN, Iran (AP) — Iran and one of its key proxies vowed Tuesday to respond to a strike widely attributed to Israel that demolished Iran's consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.",
      "publishedAt": "2024-04-02T07:16:33Z",
      "title": "Iran vows response after strike it blames on Israel demolishes consulate in Syria",
      "url": "https://apnews.com/f7a1af3a9fc67de1962d4f1589d7e9f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/253cf65cd23344669fe73ea97de7360b/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump posted a $175 million bond on Monday in his New York civil fraud case, halting collection of the more than $454 million he owes and preventing the state from seizing his assets to satisfy the debt while he appeals, according to a court filing.",
      "publishedAt": "2024-04-02T00:22:55Z",
      "title": "Donald Trump has posted a $175 million bond to avert asset seizure as he appeals NY fraud penalty",
      "url": "https://apnews.com/feb0593a5bbd3837edc0db195554eda1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36a2ebf6da844c768f593f188aa69dc4/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN and REBECCA BOONE",
      "description": "The owner and manager of a cargo ship that rammed into Baltimore's Francis Scott Key Bridge before the span collapsed last week filed a court petition Monday seeking to limit their legal liability for the deadly disaster.",
      "publishedAt": "2024-04-01T19:30:14Z",
      "title": "Cargo ship's owner and manager seek to limit legal liability for deadly bridge disaster in Baltimore",
      "url": "https://apnews.com/16de885948e769566e7181ffa35b1753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73c967907ecf42788b79316d56a1921d/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "BUCHA, Ukraine (AP) — Days after Russian forces withdrew from the outskirts of Kyiv in the dramatic first weeks of their full-scale invasion two years ago, a photo revealed what had become of Nataliia Verbova's missing husband.",
      "publishedAt": "2024-04-02T04:59:51Z",
      "title": "Life has returned to Ukraine's Bucha. But 2 years after the killings, some families can't move on",
      "url": "https://apnews.com/3daa8c042d8d38c4a3ecc8a9ceb5e532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e4453fa5b6c462e80fafd3dbd170d0f/3000.jpeg"
    },
    {
      "author": "JARI TANNER",
      "description": "HELSINKI (AP) — A 12-year-old student opened fire at a secondary school in southern Finland on Tuesday morning, killing one and seriously wounded two other students, police said. The suspect was later arrested.",
      "publishedAt": "2024-04-02T07:41:32Z",
      "title": "A 12-year-old student opens fire at a school in Finland, killing 1 and wounding 2 others",
      "url": "https://apnews.com/8f2e89a87bbea73f554f946ca0b785af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b539a9e91974539bd8fbf705b67ece4/1920.jpeg"
    },
    {
      "author": "MARIA CHENG and MISPER APAWU",
      "description": "ACCRA, Ghana (AP) — When Efua, a 25-year-old fashion designer and single mother in Ghana, became pregnant last year, she sought an abortion at a health clinic but worried the procedure might be illegal.",
      "publishedAt": "2024-04-02T05:02:59Z",
      "title": "Abortions are legal in much of Africa. But few women may be aware, and providers don't advertise it",
      "url": "https://apnews.com/1edd27e75b1faf8b8e847456a7e7b1d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54857466f286436a8db7683ed4febf4f/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Above a bodega in New York City’s Harlem neighborhood, a mosque congregation hosts iftar, the traditional Islamic end of fast meal, for hundreds of hungry migrants every night during this holy month of Ramadan.",
      "publishedAt": "2024-04-02T04:17:00Z",
      "title": "Mosques in NYC struggle to house and feed an influx of Muslim migrants this Ramadan",
      "url": "https://apnews.com/7f0a9e2ac81426aa621adb28e87658f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8276baaef60b44309659776f0bc9072b/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "There were plenty of people at a movie theater in central Iowa on Monday night, though very few of them were watching an actual movie.They were there to see Caitlin Clark.",
      "publishedAt": "2024-04-02T10:00:36Z",
      "title": "The women's NCAA Tournament had center stage. The stars, and the games, delivered in a big way",
      "url": "https://apnews.com/da8c4260fc340d07b563dc36435356f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9977982cfcd445b4aa16232d8d7c2a6e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}