{
  "articles": [
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "Tens of thousands of people are pouring into St. Peter’s Square for Pope Francis' funeral. With hours to go, the piazza is filling up. The farewell ceremony reflects his priorities as pope and wishes as pastor: Presidents and princes will be on hand, but prisoners and migrants will welcome him into the basilica. Francis choreographed the ceremony himself when he revised and simplified the Vatican’s funeral rites and rituals last year. He aimed to emphasize the pope’s role as a mere priest and not “a powerful man of this world.” Francis is breaking with recent tradition and will be buried in the St. Mary Major Basilica.",
      "publishedAt": "2025-04-26T04:35:54Z",
      "title": "Mourners rush to St. Peter's Square for Pope Francis' funeral",
      "url": "https://apnews.com/article/pope-francis-vatican-funeral-d6a8a471978c21c71c3f1dc07f663e78",
      "urlToImage": "https://dims.apnews.com/dims4/default/8767383/2147483647/strip/true/crop/2196x1235+0+115/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Ff0%2Fae65e97f8080e8439a56f73d3628%2Ffba8894a4aae45fbab784a1d21a213a0"
    },
    {
      "author": "Darlene Superville",
      "description": "President Donald Trump will be among more than 50 heads of state and other dignitaries attending the funeral for Pope Francis in Vatican City on Saturday. The late pontiff disagreed with Trump's approach on issues like immigration and the treatment of migrants. But after Francis died earlier this week, Trump remembered him as a “good man” who “loved the world.” Trump said he'll be “seeing a lot of people\" on the sidelines of the funeral who are “important in what we're doing.” Trump is working to broker a ceasefire between Russia and Ukraine and negotiate trade agreements with multiple countries.",
      "publishedAt": "2025-04-26T04:06:19Z",
      "title": "Trump to pay respects to a pope who publicly disagreed with him for years",
      "url": "https://apnews.com/article/trump-pope-francis-funeral-vatican-rome-italy-9895e156b90aea1dde7f7ea19bf7b3e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/c651ece/2147483647/strip/true/crop/6898x3880+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F4d%2F63828b1953b99b37d2ea12e7379f%2F10d4a724f56c401e99e331c4bf9a7fe9"
    },
    {
      "author": null,
      "description": "All Ukrainian troops have been forced from Russia’s Kursk region, Kremlin spokesperson Dmitry Peskov said Saturday. Ukrainian officials have not commented on the claim. Meanwhile, Ukrainian officials said three people were killed overnight by Russian attacks across Ukraine. The attacks came hours before U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy met in Vatican City on the sidelines of the funeral of Pope Francis. The presidents met at St. Peter’s Basilica for about 15 minutes and agreed to continue negotiations later on Saturday, Ukrainian presidential spokesman Serhii Nykyforov said.",
      "publishedAt": "2025-04-26T10:30:06Z",
      "title": "Russia says all Ukrainian troops have left the Kursk region as Zelenskyy meets Trump at Vatican",
      "url": "https://apnews.com/article/russia-ukraine-war-attacks-ceasefire-peace-talks-vatican-b75aeccb7af0e3363cd97a276ba3777a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e099b08/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2Fc1%2Fa14d7ed75d954b82a9a63ba3ef11%2Ffc8b744773f949e4bcbf219cb5069cb7"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are preparing to start in-depth negotiations in Oman over Tehran’s rapidly advancing nuclear program, talks that likely will hinge on the Islamic Republic’s enrichment of uranium. Iranian state television suggested the talks could start mid-day Saturday in Muscat, the mountain-wrapped capital of this sultanate on the eastern edge of the Arabian Peninsula. However, neither Iranian Foreign Minister Abbas Araghchi nor U.S. Mideast envoy Steve Witkoff offered any immediate specifics or details on the talks that they’ll lead. Witkoff on Friday was in Moscow meeting Russian President Vladimir Putin. He arrived Saturday to Oman.",
      "publishedAt": "2025-04-26T06:15:16Z",
      "title": "Iran and US prepare for expert nuclear talks in Oman",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-f2e4ecf49c62c11a0240153d7f900d0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a61f09e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F65%2F301cb2baf511f99243fbbbdce856%2F19bff9aab044437d911586b47ad11611"
    },
    {
      "author": null,
      "description": "A massive explosion and fire has struck the Iranian port city of Bandar Abbas. A provincial disaster management official told Iranian state television there were injuries in Saturday's blast, without elaborating. He added that first responders were trying to reach the area while others were attempting to evacuate the site. The official said the blast came from containers at Rajaei port in the city. Social media videos showed a huge plume of black smoke. Rajaei port mainly handles container traffic and also has oil tanks and other petrochemical facilities.",
      "publishedAt": "2025-04-26T09:32:07Z",
      "title": "A massive explosion and fire strikes the Iranian port city of Bandar Abbas",
      "url": "https://apnews.com/article/iran-explosion-fire-bandar-abbas-72637c6b3e152a30045275f57ace29ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/2234569/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fb8%2F550c1603af5b86e16d9bc8ba03a2%2Feb18966322944b7193001e9520f9a1a2"
    },
    {
      "author": "Seung Min Kim, Linley Sanders",
      "description": "An AP-NORC poll finds many Americans don't agree with President Trump’s aggressive efforts to quickly enact his agenda, and even Republicans aren't overwhelmingly convinced his attention has been in the right place. Americans are nearly twice as likely to say Trump has been mostly focusing on the wrong priorities as to say he's been focusing on the right ones. The findings suggest Democrats are even unhappier with the reality of the second Trump term than before he was sworn in. While about 7 in 10 Republicans say Trump has been at least a “good” president so far, only about half say he’s emphasized the right things.",
      "publishedAt": "2025-04-26T11:23:37Z",
      "title": "Only about half of Republicans say Trump's priorities are right, poll finds",
      "url": "https://apnews.com/article/trump-economy-immigration-trade-100-days-poll-625efe6128d5f2e90e04bcc7f30479eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e1b039/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Ff0%2F030b88fe7d8fee886c3dc11bb0f9%2F2610ee8fca9a4779b7ad6287619a5703"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Health officials in Gaza aid that at least 49 people were killed by Israeli strikes in the last 24 hours and Arab mediators are scrambling to restart a ceasefire. A strike in a neighborhood in western Gaza City early Saturday morning, flattened a three-story house, killing 10 people. Three more people were killed in the Shati refugee camp along the city’s shoreline. The attacks come as Hamas sent a high-level delegation to Cairo Saturday, to try and get the stalled ceasefire back on track.",
      "publishedAt": "2025-04-26T10:55:52Z",
      "title": "49 killed by Israeli strikes in Gaza over 24 hours, as mediators scramble to restart ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-26-2026-4483e0e411a3aa7cf7bd2bd434d69e50",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d4d782/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fd3%2F10136c2b54884b700454403b7f1d%2Fe05d9679e63e446c9ddcc991e9607953"
    },
    {
      "author": "Aijaz Hussain, Rajesh Roy, Munir Ahmed",
      "description": "India’s military says Pakistani soldiers shot at Indian posts along the highly militarized frontier in disputed Kashmir for a second consecutive night. The cross-border fire followed a gun attack on tourists in Kashmir that India blames Pakistan for. It was the worst assault targeting civilians in the restive region for years. Pakistan denies involvement. The killings set off tit-for-tat measures on visas, treaties and diplomats. India said Saturday that its troops responded appropriately during the overnight firing. In the past, each side has accused the other of starting border skirmishes in the Himalayan region, which both claim in its entirety.",
      "publishedAt": "2025-04-26T04:47:12Z",
      "title": "Indian military says Pakistani troops fired along border in disputed Kashmir overnight",
      "url": "https://apnews.com/article/india-pakistan-kashmir-attack-829911d3eae7cfe6738eda5c0c84d6ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/d747be4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F8d%2F8d6981b97ef299e52c3a44539fc7%2Fa65a61d902814af9b108aafc7d938c35"
    },
    {
      "author": "Arnie Melendrez Stapleton",
      "description": "Shedeur Sanders was among the best available players remaining after his Round 1 snub and as the draft heads into its final four rounds Saturday, the former University of Colorado star is still waiting to hear his name called. Sanders' slide into Day 3 of the draft is surprising given that many draft analysts considered it a possibility that he'd be chosen first overall, an honor that went to Cam Ward instead. Four other quarterbacks have been drafted ahead of Sanders, who completed nearly 72% of his passes in Boulder but took 94 sacks.",
      "publishedAt": "2025-04-26T05:04:51Z",
      "title": "NFL draft stunner: Free-falling Shedeur Sanders still waiting for a team to come calling",
      "url": "https://apnews.com/article/nfl-draft-best-available-shedeur-sanders-20f9a0e4cc004d03005012870c84ffd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/51d6a8d/2147483647/strip/true/crop/4832x2718+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F3b%2F72d37085a4c141037439d16b7b66%2Fd67c72382f2f493db8d5ba34d4450ee0"
    },
    {
      "author": "Rob Gillies",
      "description": "Canadians will vote for a new government in an election that has been upended by U.S. President Donald Trump’s trade war and threats to make Canada the 51st state. Prime Minister Mark Carney and the governing Liberal Party appeared poised for a historic election defeat until Trump slapped heavy tariffs on Canada and began threatening its sovereignty. The opposition Conservative Party and its firebrand leader, Pierre Poilievre, had hoped to make the election a referendum on former Prime Minister Justin Trudeau, whose popularity cratered as food and housing prices rose and immigration surged. But the vote is now expected to focus on who's best equipped to deal with Trump. Voters head to the polls Monday.",
      "publishedAt": "2025-04-26T05:03:25Z",
      "title": "Canada is gearing up for federal election. Here's what's at stake",
      "url": "https://apnews.com/article/canada-election-carney-poilievre-trump-f9804b0c1bafcfe32f5e010a0b61c4dd",
      "urlToImage": "https://dims.apnews.com/dims4/default/fcaed0e/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F02%2F22ee8dc200df9cdda1b3e01f1df2%2F1fca2c644a8644dbb0009e76491a7f27"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}