{
  "articles": [
    {
      "author": "DAVID KLEPPER and ALI SWENSON",
      "description": "WASHINGTON (AP) — Within minutes of the gunfire, the attempted assassination of former President Donald Trump spawned a vast sea of claims — some outlandish, others contradictory — reflecting the frightening uncertainties of the moment as well as America's fevered, polarized political climate.",
      "publishedAt": "2024-07-14T18:03:41Z",
      "title": "Minutes after Trump shooting, misinformation started flying. Here are the facts",
      "url": "https://apnews.com/4b7ab8e21c00aa6ef47f25ec76984fe6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12f84c9cd8cd49e1a40c121e9849adb9/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "MUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks continue and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.",
      "publishedAt": "2024-07-14T13:45:44Z",
      "title": "Hamas says Gaza cease-fire talks haven't paused and claims military chief survived Israeli strike",
      "url": "https://apnews.com/728bb0842141ba246456422ebf93deb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb94fb8b0f8947389e4aca1e0b4d235d/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN, COLLEEN LONG, MICHAEL BALSAMO, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "BUTLER, Pa. (AP) — Former President Donald Trump called for unity and resilience Sunday after an attempt on his life added fresh uncertainty to an already tumultuous presidential campaign and raised sharp questions about how a gunman was able to open fire from a rooftop near a Pennsylvania campaign rally.",
      "publishedAt": "2024-07-14T12:40:25Z",
      "title": "Trump heads to convention as authorities investigate motive, security in assassination attempt",
      "url": "https://apnews.com/db24c5bfbbe7d09fa2437c3c836bb434",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c30233ddcbf4d13997550cbee151002/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A shooting at Donald Trump ’s rally in Butler, Pennsylvania is being investigated as an attempted assassination of the former president and presumptive Republican nominee, law enforcement officials say.",
      "publishedAt": "2024-07-14T12:13:19Z",
      "title": "The Latest: New details emerge about Trump rally shooting suspect",
      "url": "https://apnews.com/9b5184baa2662f6e2c07f1b18577d1e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dcebcf40ccf4e79b7c7172670b3ff09/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden on Sunday condemned the attempted assassination of his predecessor, Donald Trump, as “contrary to everything we stand for as a nation” and said he was ordering an independent security review of how such an attack could have happened.",
      "publishedAt": "2024-07-14T15:48:47Z",
      "title": "Biden says attempted Trump assassination is 'not who we are' and orders security review",
      "url": "https://apnews.com/704592d02c3421a767112f0bf6d25eb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5115d3aa9514d76833bca480842b4ce/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "Former President Donald Trump was the target of an assassination attempt at a Pennsylvania rally Saturday that set off panic as a bloodied Trump was surrounded by Secret Service and hurried into his vehicle.",
      "publishedAt": "2024-07-14T20:47:49Z",
      "title": "A timeline of the assassination attempt on former President Trump",
      "url": "https://apnews.com/59e2f4fcdf8379aa2cb5f141825d60a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c30233ddcbf4d13997550cbee151002/1920.jpeg"
    },
    {
      "author": "RON TODT, MARK SCOLFORO and KIMBERLEE KRUESI",
      "description": "BUFFALO TOWNSHIP, Pennsylvania (AP) — The former fire chief who was killed at a Pennsylvania rally for Donald Trump spent his final moments diving down in front of his family, protecting them from the gunfire that rang out Saturday during an assassination attempt against the former president.",
      "publishedAt": "2024-07-14T18:43:36Z",
      "title": "Former fire chief who died at Trump rally used his body to shield family from gunfire",
      "url": "https://apnews.com/11e1aa65e6e45584f49577686d38766e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3918181defe48c9ba5ce52c00c63d87/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, ALANNA DURKIN RICHER, MICHAEL BALSAMO and JIM MUSTIAN",
      "description": "WASHINGTON (AP) — The 20-year-old man who tried to assassinate former President Donald Trump first came to law enforcement’s attention at Saturday's rally when spectators noticed him acting strangely outside the campaign event.",
      "publishedAt": "2024-07-14T13:09:53Z",
      "title": "Authorities hunt for clues, but motive of man who tried to assassinate Donald Trump remains elusive",
      "url": "https://apnews.com/881581c46c07025898027143fc9132e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21293c5e596d4f9c8ba1e3a4f1cbead9/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA, MICHAEL BIESECKER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The U.S. Secret Service is investigating how a gunman armed with an AR-style rifle was able to get close enough to shoot and injure former President Donald Trump at a rally Saturday in Pennsylvania, in a devastating failure of one of the agency’s core duties.",
      "publishedAt": "2024-07-14T05:33:56Z",
      "title": "The Secret Service is investigating how a gunman who shot and injured Trump was able to get so close",
      "url": "https://apnews.com/4e3415b1461f5acefbc8e1fadad0375b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b7a097f49714ec8a622a284019db46e/3000.jpeg"
    },
    {
      "author": "STEVE DOUGLAS",
      "description": "BERLIN (AP) — Spain is the king of European soccer for a record fourth time. For England, it’s another agonizing near-miss in the team’s decades-long tale of underachievement.Completing a tournament the team dominated from start to finish, Spain beat England 2-1 in the European Championship final on Sunday with Mikel Oyarzabal the unlikely match-winner in the 86th minute.",
      "publishedAt": "2024-07-14T09:37:56Z",
      "title": "Spain wins record fourth European Championship title by inflicting another painful loss on England",
      "url": "https://apnews.com/dc46b104e6bf3b94b7d6d70e18f8220d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60852f4098394fce9581c67bc596434f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}