{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis has died. He was history’s first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change. He was 88. The Vatican camerlengo made the announcement Monday. Francis suffered from chronic lung disease and had part of one lung removed as a young man. He was admitted to Gemelli hospital on Feb. 14, 2025, for a respiratory crisis that developed into double pneumonia. He spent 38 days there. From his first greeting as pope of a simple “Good evening” to his embrace of refugees and the downtrodden, Francis signaled a very different tone for the papacy, stressing humility over hubris for a Catholic Church beset by scandal and accusations of indifference.",
      "publishedAt": "2025-04-21T07:57:28Z",
      "title": "Pope Francis, first Latin American pontiff, dies at 88",
      "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": "Nicole Winfield",
      "description": "Every pope has his critics. But Pope Francis’ conservative opponents were unique in that they actually had a living alternate as a point of reference. Pope Benedict XVI lived as a pope emeritus in the Vatican Gardens for the first decade of Francis’ pontificate. The unprecedented anomaly of having a reigning and retired pope living together made the dynamics of the Francis opposition a first in Catholic history. It exacerbated longstanding divisions in the church that experts say must be addressed before any other pope decides to step down. They say norms are needed to regulate a papal resignation to prevent a retired pontiff from remaining a source of inspiration for those seeking to discredit his successor.",
      "publishedAt": "2025-04-22T04:09:13Z",
      "title": "Pope Francis' critics: A unique situation for conservative opponents",
      "url": "https://apnews.com/article/pope-francis-critics-fef5eb221e1a44a15fa7bb9aa83b9d73",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ee8a57/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F4e%2F9b24eef4d4dc91677d83f6c8da00%2F155c70f824b64a23a7002b51d6ce5155"
    },
    {
      "author": "Vanessa Gera, Nicole Winfield",
      "description": "Pope Francis died on Easter Monday at the age of 88. Francis' death was announced by Cardinal Kevin Farrell. The Irish-born Vatican camerlengo's position will be important in the election of the next pope. Francis made his final public appearance a day earlier on Easter Sunday. Francis’ death now sets off the process of allowing the faithful to pay their final respects. That will be followed by a funeral to be celebrated by the dean of the College of Cardinals and a conclave to elect a new pope.",
      "publishedAt": "2025-04-21T11:05:09Z",
      "title": "What to know about the death of Pope Francis",
      "url": "https://apnews.com/article/pope-francis-what-to-know-7c2aa927cf142926f05654984aaa0d90",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": "Nicole Winfield",
      "description": "An Irish-born American cardinal was entrusted by Pope Francis to be the camerlengo, the Vatican official who runs the Holy See after the death of one pontiff and before the election of another. Cardinal Kevin Farrell is now in the spotlight. According to tradition, the camerlengo certifies the pope’s death, seals the papal apartment and breaks the pope’s fisherman’s ring. He leads the procession accompanying the coffin into St. Peter’s Basilica and presides over the burial. He also gets written reports from Vatican offices about their current assets; a copy of the current and projected budget for the Holy See; and any other information from the Vatican’s economic ministry that would be useful for cardinals and the future pope.",
      "publishedAt": "2025-04-22T04:05:32Z",
      "title": "Irish-born American Cardinal Kevin Farrell entrusted to be ‘camerlengo’",
      "url": "https://apnews.com/article/pope-francis-kevin-farrell-camerlengo-d539db6e09be52a76669dc7f7ac63fd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/451c967/2147483647/strip/true/crop/4897x2755+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F96%2Fe38f32539779f1dd4d6326d3260a%2Fb483fd7fa11f471c9399688c02d50802"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis understood the power of a simple touch. Some of the most iconic moments of his papacy were those when he interacted with the poor, the homeless and those seeking refuge from oppression. Francis died Monday at age 88 following a respiratory illness. History’s first Latin American pope and the first to name himself after St. Francis of Assisi charmed the world with poignant acts of love, humility and informality. That began with his very first words as pontiff, emerging on the loggia of St. Peter’s Basilica and greeting the throngs with the words, “Good evening.” Francis eventually ran into troubles, with conservatives who were increasingly upset with his progressive leanings.",
      "publishedAt": "2025-04-21T16:28:09Z",
      "title": "Pope Francis led the church with humility and simplicity",
      "url": "https://apnews.com/article/pope-francis-remembrance-life-7702c44513ed4c9ba0ac5362d418c3f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/e551567/2147483647/strip/true/crop/3872x2178+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F06%2F297282464973491350d224ca0173%2Fcc93569ccb0b4aca9b4b4a69cc699062"
    },
    {
      "author": null,
      "description": "The main Palestinian rescue service in Gaza has condemned Israel’s probe into the killings of 15 medical workers last month, calling it a “fabricated investigation.” The army announced the results of its investigation on Sunday, saying it had found “professional failures” and dismissing a deputy commander in what it described as an accident. A total of 15 people were killed in the March 23 incident — including eight medics with the Palestinian Red Crescent Society, six members of the Hamas government’s Civil Defense unit and a U.N. staffer. The PRCS says the investigation underscores “the occupation’s persistence in shielding the truth from the world.”",
      "publishedAt": "2025-04-21T18:18:38Z",
      "title": "Gaza rescue service dismisses Israeli probe into killing of medics as a 'fabricated investigation'",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-21-2025-17ffc7981c4fe1f87b25b54b3c17bf20",
      "urlToImage": "https://dims.apnews.com/dims4/default/52e644f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F8b%2Fecc4514813633bdb3ca476a471c0%2F56a511f6eca145ed85c2a21ff085a9c1"
    },
    {
      "author": "Wyatte Grantham-Philips, Damian J. Troise",
      "description": "Global financial markets have been turned upside down this year by President Donald Trump’s burgeoning trade war. Markets are not in full panic, but the double-digit declines in major U.S. stock indexes are testing nerves. U.S. markets had been on a two-year tear coming into 2025, though many felt stock prices had become overinflated. Trump’s trade war pushed that sentiment into hyperdrive. The S&P 500 has tumbled more than 12%, and U.S. markets are being outpaced in in Europe, Asia, and just about everywhere else. Trading in traditional safe havens like U.S. Treasuries and the U.S. dollar has become erratic and unpredictable. On Monday, the dollar struck a three-year low.",
      "publishedAt": "2025-04-21T19:00:56Z",
      "title": "How stocks, bonds and other markets have fared so far in 2025",
      "url": "https://apnews.com/article/stock-market-bonds-gold-bitcoin-oil-dollar-f3bf98f79192e4c6706437b36ea064e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8faa256/2147483647/strip/true/crop/5333x3000+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F03%2F0729633163e608a4b870c3f9cf0f%2Fd3a80a86b44648a181c55cd54c44a0b3"
    },
    {
      "author": "Tara Copp, Eric Tucker",
      "description": "The White House has expressed support for Defense Secretary Pete Hegseth following media reports that he shared sensitive military details in another Signal messaging chat that included his wife and brother. President Donald Trump on Monday called it “fake news” and pointed to what he called disgruntled workers. The administration's posture is meant to hold the line against Democratic demands for Hegseth’s firing at a time when the Pentagon is engulfed in turmoil, including the departures of several senior aides. The White House has framed the revelation as the outgrowth of a power struggle between Hegseth and the career workforce. But some of the recently departed officials were brought in by Hegseth.",
      "publishedAt": "2025-04-21T15:42:29Z",
      "title": "White House voices support for Hegseth as Signal chat revelation stirs fresh turmoil",
      "url": "https://apnews.com/article/hegseth-signal-chat-pentagon-trump-30dc4c3d0e75a89f3fd883f38b26afff",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff3a706/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F4c%2F1bbc15ff58dff7135160ca9cb956%2Fd1f9a1b15d4140f385f484b9f9f796e4"
    },
    {
      "author": "Corey Williams",
      "description": "Arborists are hoping to transform vacant land on Detroit’s eastside by planting giant sequoias, the world’s largest trees. Detroit is the pilot city for the Giant Sequoia Filter Forest. The nonprofit Archangel Ancient Tree Archive is donating sequoia saplings that will be planted by Arboretum Detroit to mark Earth Day. Archangel also plans to plant sequoia groves in Los Angeles, Oakland, California, and London. Sequoias are resilient against disease and insects but the California natives have become vulnerable to ever-hotter wildfires on the West Coast.",
      "publishedAt": "2025-04-22T04:07:46Z",
      "title": "A sequoia forest in Detroit? Plantings to improve air quality and mark Earth Day",
      "url": "https://apnews.com/article/sequoia-forest-detroit-vacant-lots-9a8b8b12cfde25129943bb599663c26f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ca7ee5/2147483647/strip/true/crop/5673x3191+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F90%2F6d26c0ebdd8f09353d549ec8d2b4%2F7f3f317ac0e543dc9f82763933334f63"
    },
    {
      "author": "The Associated Press",
      "description": "A change in popes is a complicated process, with centuries-old rituals involving the transition in leadership for both the spiritual head of the global Catholic Church and the Vatican’s head of state. Some of the terms are in Latin, like “sede vacante,” which means “vacant seat” and refers to the period between the pope’s death or resignation and the election of a new one. Others, like “white smoke,” refer to signaling that a new pontiff has been selected. The smoke is produced by burning the secret paper ballots along with chemicals in a furnace in the Sistine Chapel that forms the signal to the outside world.",
      "publishedAt": "2025-04-22T04:15:19Z",
      "title": "The terminology of a papal conclave, explained",
      "url": "https://apnews.com/article/pope-conclave-glossary-3f34cfc8bda3570b9ecf0602d20990fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6372a0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F83%2Fbdf4807ba90cdaf15fbf1dfca327%2Fd422c56efc334d31964707bfd94a7d15"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}