{
  "articles": [
    {
      "author": null,
      "description": "A bill to cancel about $9 billion in foreign aid and public broadcasting spending is nearing passage in the Senate. It's an action that would have a tiny impact on the nation’s debt but could have major ramifications for future spending fights in Congress. The legislation would claw back nearly $1.1 billion from the Corporation for Public Broadcasting and about $8 billion in foreign aid spending that Republicans describe as wasteful. Senate passage of the spending cuts would send the bill back to the House for final approval. Trump must sign the bill into law by midnight Friday for the cuts to take effect.",
      "publishedAt": "2025-07-16T17:22:44Z",
      "title": "Trump bid to claw back $9 billion nears Senate vote",
      "url": "https://apnews.com/article/trump-republicans-budget-cuts-pepfar-pbs-npr-486f0f5871068f14d97eb4c4d7f9bb88",
      "urlToImage": "https://dims.apnews.com/dims4/default/a75d8bd/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F23%2F03e52b317d6513296c7c22afe6ba%2Fba94f35c954c43a1a26f098800a68f27"
    },
    {
      "author": null,
      "description": "Syrian government forces have started withdrawing from the southern province of Sweida following days of vicious clashes with militias from the Druze minority. Druze leaders and Syrian government officials announced a renewed ceasefire late Wednesday that was mediated by the U.S., Turkey and Arab countries. Syria’s interim President Ahmad al-Sharaa said in an address early Thursday that some Druze factions and clerics were appointed to maintain internal security in Sweida. Israeli strikes targeting government troops did not immediately stop. The dayslong fighting has threatened to unravel Syria’s postwar political transition and brought in further military intervention by Israel.",
      "publishedAt": "2025-07-17T09:39:31Z",
      "title": "Syrian forces leave Sweida after ceasefire with Druze militias takes effect",
      "url": "https://apnews.com/article/syria-druze-israel-clashes-sweida-ceasefire-sharaa-67fdcbd1be73c4890a4ce81bd954d447",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f76588/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F35%2Fd59227d2c244d023fe0c33049528%2F3066bdd9e3c1449782e4bace267d2399"
    },
    {
      "author": null,
      "description": "Iraqi officials say a fire at a newly opened mall in eastern Wasit province killed more than 60 people, including women and children. Iraq’s Ministry of Interior said in a statement that 61 people died, most from suffocation, in the fire that began Wednesday in the city of Kut. The ministry says 14 charred bodies remain unidentified. The province has declared three day of mourning. The provincial governor says the cause of the fire is still under investigation but that legal cases were begun against the building owner and mall owner. He did not specify what the charges were.",
      "publishedAt": "2025-07-17T06:50:05Z",
      "title": "A fire at a mall in eastern Iraq kills more than 60 people",
      "url": "https://apnews.com/article/iraq-mall-fire-96e368d468ab86568ad605216e9f0589",
      "urlToImage": "https://dims.apnews.com/dims4/default/53fe1e3/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F06%2Fb2bfda791018bc2c757b67dbb80c%2F8d7d5a33f73e42c7825289e6493c0b9e"
    },
    {
      "author": null,
      "description": "Just 1 in 4 U.S. adults say President Donald Trump’s policies have helped them. That's according to a new AP-NORC poll that finds underwhelming marks for the Republican president on key issues, including the economy, immigration, government spending and health care. Overall, Trump fails to earn majority approval on any of the issues included in the poll. A majority of Americans see Trump as at least somewhat capable of getting things done following the passage of his sprawling budget bill. The mixed reviews come six months into Trump's term as he struggles to follow through on some campaign promises, including lowering costs for working-class Americans, preserving programs like Medicaid and lowering government spending.",
      "publishedAt": "2025-07-17T11:00:36Z",
      "title": "Most say Trump's policies haven't helped them: AP-NORC poll",
      "url": "https://apnews.com/article/poll-trump-approval-policies-economy-health-immigration-45681b8cd07782ba7a143d323efe9dd7",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf092ca/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2Fe4%2Ffabb66cc8562b391a5c8a9e141cb%2F83e44f60642949328ab411c2a3a16506"
    },
    {
      "author": null,
      "description": "Federal Reserve Chair Jerome Powell is gaining some key backing on Capitol Hill from Republican senators. They fear the repercussions if President Donald Trump follows through with threats to try and remove the politically independent central banker. As Trump seemingly waffled back and forth between moving to dismiss the Fed chair this week, some Republicans in Congress began to speak up to warn that such a move would be a mistake. Still, plenty of other Republicans think that dismissing Powell is a fine idea.",
      "publishedAt": "2025-07-17T04:09:31Z",
      "title": "Senate Republicans warn Trump against firing Fed chair Jerome Powell",
      "url": "https://apnews.com/article/trump-powell-congress-federal-reserve-2b6f104028489d8051d7ac27492298eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef14e4b/2147483647/strip/true/crop/2312x1301+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F7b%2F23f63fb9f86eb7ae92b58bcac633%2F95fdde905e5e423e9966ddf8f0c34904"
    },
    {
      "author": null,
      "description": "Two people were killed in an Israeli strike on Gaza’s only Catholic church on Thursday morning, according to church officials. Several other people, including the parish priest, were injured. The Catholic charity Caritas Jerusalem said the parish’s 60-year-old janitor and an 84-year-old woman receiving psychosocial support inside a Caritas tent in the church compound were killed in the attack. The Israeli military said it is aware of the incident and is investigating.",
      "publishedAt": "2025-07-17T08:49:53Z",
      "title": "2 killed and several injured in Israeli strike on Gaza's only Catholic church",
      "url": "https://apnews.com/article/gaza-israel-airstrikes-catholic-church-3a53c46a464a7ef9d7123bdea6996d8a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d753713/2147483647/strip/true/crop/5348x3008+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F17%2F60bc4e1843153826b6b6242806bb%2F137fcc0501dd4e4d856622e7abd596d0"
    },
    {
      "author": null,
      "description": "When Jeffrey Epstein died in prison, then-President Donald Trump speculated that authorities might be wrong in ruling it a suicide. Many of his allies in the pro-Trump media went further, casting Epstein's death as a murder meant to continue a decades-long coverup of pedophilia by elites. Now back in the White House, Trump has elevated prominent proponents of Epstein conspiracies to senior law enforcement roles, and they’re struggling to contain a fire that they spent years stoking. Much of Trump’s base is choosing to believe the president’s earlier claims about Epstein over his latest contention that there’s nothing of substance in government files.",
      "publishedAt": "2025-07-17T04:05:23Z",
      "title": "In their own words: Trump, Patel, Bongino and Bondi on Epstein scandal",
      "url": "https://apnews.com/article/trump-epstein-their-words-bondi-patel-bongino-70176344eeab6f66e015bc294afbbf59",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec10b2b/2147483647/strip/true/crop/2186x1230+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Fea%2Fdd445deabc0a2e761f16a61f7ee4%2Ff40bc507d7d54672a4d4aceed3a2e01f"
    },
    {
      "author": null,
      "description": "The Justice Department has fired Maurene Comey, the daughter of former FBI director James Comey and a prosecutor in the federal cases against Sean “Diddy” Combs and Jeffrey Epstein, three people familiar with the matter told The Associated Press. There was no specific reason given for her firing from the U.S. attorney’s office in the Southern District of New York, according to one of the people. They spoke to the AP on the condition of anonymity to discuss personnel matters. Comey's termination comes shortly after she prosecuted Combs, who was acquitted of sex trafficking and racketeering charges. The rapper was convicted of lesser prostitution-related offenses.",
      "publishedAt": "2025-07-16T23:16:03Z",
      "title": "Justice Department fires prosecutor on Epstein case",
      "url": "https://apnews.com/article/justice-department-james-comey-maurene-trump-dda5d1f40f08346bd97696ce4791e8ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ddd651/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F81%2Fe86d37a9fc6344b55487cca9903f%2F0d681c4b4ca74d38bbddef8af3b5f101"
    },
    {
      "author": null,
      "description": "A U.S. Army veteran arrested during an immigration raid at a California marijuana farm says he was sprayed with tear gas and pepper spray before being dragged from his vehicle on his way to work. George Retes, a native of Ventura City, California, says he was pinned to the ground by ICE officials on his back and his neck after getting caught between protesters and authorities last week at Glass House Farms in Camarillo. Retes was held for three days before being release without charges and without being allowed to contact a lawyer. He said Wednesday he plans to sue the federal government over his ordeal.",
      "publishedAt": "2025-07-17T00:15:34Z",
      "title": "Army veteran detained by ICE in California farm raid speaks out",
      "url": "https://apnews.com/article/us-army-veteran-immigration-raid-53cb22251a01599a0c4d1a8d5650d050",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d89c44/2147483647/strip/true/crop/5804x3265+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F4e%2F7de573f02e9dd8c93b789a909bdc%2Fd1fa5e2a2f624286a087d087a59ac370"
    },
    {
      "author": null,
      "description": "Yu Zidi of China is only 12 years old and has qualified for the world swimming championships in Singapore. Her performances have stunned the swimming world. Yu’s times in the 200- and 400-meter individual medley and the 200 butterfly rank among the best in the world this year. At the national championships in May, her times in the 200 butterfly and 400 IM would have placed her fourth in last year’s Paris Olympics. She’s also swimming faster at 12 than teenage Canadian star Summer McIntosh did at the same age. McIntosh has won three Olympic gold medals and holds the world record in both medley races.",
      "publishedAt": "2025-07-17T08:19:01Z",
      "title": "12-year-old Yu Zidi is set to swim at the world championships",
      "url": "https://apnews.com/article/yu-12-year-old-swim-china-worlds-d29e2e16908130174b85fbc2cde53c90",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0d9c7a/2147483647/strip/true/crop/3135x1763+0+163/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F8e%2F5b180884dd6ad91eb16d281e1815%2Fd0f363bb87d84a72900e198cc019f5c2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}