{
  "articles": [
    {
      "author": "Will Weissert, Joey Cappelletti, Seung Min Kim",
      "description": "President Donald Trump has celebrated the 100th day of his second term — yet spent much of his rally marking it in campaign mode, fixated on past grudges and grievances. He repeatedly mocked his Democratic predecessor, Joe Biden, at Tuesday's rally — attacking Biden's mental acuity and even how he appears in a bathing suit. He again uttered the lie that he won the 2020 presidential election. And he attacked polling and news coverage not favorable to him. And the rally just outside Detroit, which marked Trump’s largest political event since returning to the White House, glossed over two forces that had rocked the state: his steep trade tariffs and combative attitude toward Canada.",
      "publishedAt": "2025-04-29T11:01:34Z",
      "title": "Trump marks first 100 days in office with a Michigan rally",
      "url": "https://apnews.com/article/trump-100-days-michigan-whitmer-2e30695aa185a785cc1037ab74c19a55",
      "urlToImage": "https://dims.apnews.com/dims4/default/3116059/2147483647/strip/true/crop/4181x2352+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F45%2F937bead667791b214150d7bf7173%2F9094535d07b243f2adaab240a9d40e59"
    },
    {
      "author": "Rob Gillies",
      "description": "Canada’s Liberals are celebrating election victory in a stunning turn of fortune. The country won't know until later Tuesday whether the party of new Prime Minister Mark Carney will have an outright majority or need help in Parliament. And the Canadian Broadcasting Corporation projects that populist Conservative Party leader Pierre Poilievre will lose his Parliament seat. That caps a stunning turnaround in fortunes fueled by U.S. President Donald Trump’s annexation threats and trade war. Poilievre a few months ago appeared to be a shoo-in to become Canada’s next prime minister and shepherd the Conservatives back into power for the first time in a decade.",
      "publishedAt": "2025-04-29T13:26:21Z",
      "title": "Canada's Liberals celebrate a stunning win and the populist challenger loses his seat",
      "url": "https://apnews.com/article/canada-election-carney-trump-poilievre-7d42d2d93b98d471c2afb3cd602d117d",
      "urlToImage": "https://dims.apnews.com/dims4/default/aeaeec5/2147483647/strip/true/crop/2859x1608+0+53/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Fde%2Fe6ef393fc57c54539be257a9b808%2F2a90955c70e345558ded1ad07c0197d1"
    },
    {
      "author": "Josh Boak",
      "description": "The White House says President Donald Trump will sign an executive order Tuesday to relax some of his 25% tariffs on autos and auto parts. It's a significant reversal as the import taxes threatened to hurt domestic manufacturers. Automakers and independent analyses have indicated that the tariffs could raise prices, reduce sales and make U.S. production less competitive worldwide. White House press secretary Karoline Leavitt declined in a briefing with reporters to provide details of the relief. Treasury Secretary Scott Bessent, who joined Leavitt at the briefing, says the goal is to enable automakers to create more domestic manufacturing jobs.",
      "publishedAt": "2025-04-29T13:57:09Z",
      "title": "Trump will offer automakers some relief on his 25% tariffs",
      "url": "https://apnews.com/article/trump-tariffs-automakers-factories-relief-25a400c98e02c01c8c54502384e267e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4926534/2147483647/strip/true/crop/3984x2241+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F2e%2Fa729b95434ec4c09bb807565381f%2F3dda8de0ac8e47e4890cac05661c5818"
    },
    {
      "author": null,
      "description": "The Wisconsin Supreme Court has suspended a judge accused of helping a man evade immigration authorities. The FBI took Milwaukee County Circuit Judge Hannah Dugan into custody on Friday morning at the county courthouse. She faces federal charges of concealing an individual to prevent his discovery and arrest and obstructing or impeding a proceeding. The state Supreme Court issued a two-page order Tuesday noting that Dugan faces two federal charges and saying it is in the public interest to temporarily relieve her of her duties. Her attorney had no immediate comment. Democrats have accused the Trump administration of trying to chill the nation’s judiciary.",
      "publishedAt": "2025-04-29T22:10:44Z",
      "title": "Wisconsin high court suspends Milwaukee judge accused of helping man evade immigration authorities",
      "url": "https://apnews.com/article/milwaukee-judge-arrested-supreme-court-suspended-49f25ea7702d3211719f926f8cfc90b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/47ec2ed/2147483647/strip/true/crop/5490x3088+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F4f%2F59c88e690512105c2824d4a23bb2%2Ffa48e62bb0a84d8f8571da31f0552766"
    },
    {
      "author": "Aniruddha Ghosal",
      "description": "Vietnam marked the 50th anniversary of the end of the war with the U.S. and the formation of the modern nation. Thousands gathered in Ho Chi Minh City for a military parade near the historic Independence Palace. Communist Party General Secretary To Lam emphasized national reconciliation, focusing on unity rather than military victory. But while Vietnam’s now mended ties with the U.S. reflect mutual efforts to address war legacies. But Vietnam needs to recalibrate to continue growing in a world economy that is fragile because of tensions between the U.S. and China.",
      "publishedAt": "2025-04-29T23:31:27Z",
      "title": "Vietnam marks 50 years since war’s end and focuses on reconciliation during a period of new tensions",
      "url": "https://apnews.com/article/vietnam-war-50th-anniversary-af6700cc535b24a9779e176570ed484d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff2fe00/2147483647/strip/true/crop/7325x4120+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F53%2F4bbc493809ae4b316a4bdd28a698%2F6431b452dd624af8bcb1e7c26b399e34"
    },
    {
      "author": "John O'connor",
      "description": "Residents of a small central Illinois city are mourning the loss of three young children and a teenager who were killed in a startling collision in a building that hosts a popular after-school camp. Authorities say it appears the crash Monday, in which a car barreled through the building in Chatham, was not a targeted attack. Details about the investigation are still emerging, including the cause of the crash. Illinois State Police say the 44-year-old driver is not in custody. She was not injured but was taken to a hospital for evaluation, and toxicology reports are pending. Chatham is about 12 miles from the state capital, Springfield.",
      "publishedAt": "2025-04-29T11:32:27Z",
      "title": "Illinois community mourns the deaths of 3 children and a teen in after-school camp tragedy",
      "url": "https://apnews.com/article/chatham-illinois-after-school-building-crash-bba11439918ba4324eaf35231e0778c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/beaa683/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F3b%2F91b9cda5cd0b391a191ce525634e%2F51987c32bbc34d19a373ea207f135256"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Italian cardinal at the heart of the Vatican’s “trial of the century” announced Tuesday he was withdrawing from participating in the upcoming conclave to elect a new pope. Cardinal Angelo Becciu’s status has dominated discussions in the days after Pope Francis’ death amid questions about whether he would participate in the conclave to elect his successor. After his 2020 downfall, Becciu had said he would not participate in any future conclave. But in recent days he had asserted he had a right to enter the Sistine Chapel with other cardinals on May 7. On Tuesday, the 76-year-old Italian issued a statement through his lawyers that said he had “decided to obey” the will of Pope Francis.",
      "publishedAt": "2025-04-29T08:01:27Z",
      "title": "Disgraced Cardinal Becciu formally withdraws from participation in conclave to elect pope",
      "url": "https://apnews.com/article/becciu-cardinal-conclave-withdraws-e2df8c80fcc993ae1e529f2f12000324",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d8ebfc/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F8e%2F64a70310240569ad31aafd0bb0de%2F6dd630a90edc40d6b8c8bf7833fc5086"
    },
    {
      "author": "Tara Copp, Farnoush Amiri",
      "description": "Defense Secretary Pete Hegseth is boasting on “X” that he had dismantled a program supporting women on security teams — and may not have realized the program he just tried to break was not a “woke” Biden-era initiative but instead a celebrated program signed into law by his boss President Donald Trump. Hegseth in a agitated tweet Tuesday called the “Women, Peace & Security” program at the Department of Defense “a UNITED NATIONS program pushed by feminists and left-wing activists. Politicians fawn over it; troops HATE it.” But the legislation was actually endorsed by Trump, was heralded by Trump family members and is supported by Joint Chiefs Chairman Gen. Dan Caine. A spokeswoman for Hegseth did not immediately respond to a request for comment.",
      "publishedAt": "2025-04-29T17:43:44Z",
      "title": "Hegseth boasts about nixing 'woke' program that Trump signed into law",
      "url": "https://apnews.com/article/hegseth-ends-trump-program-women-5c9e65044c33ff780440bd123e16d28e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df979d5/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2Fc9%2Ffb2fcce1dc0e8793c7a945f9d6bc%2Fc7cc2c30007749cc9bdffff7c657920e"
    },
    {
      "author": "Christopher Rugaber",
      "description": "Americans’ confidence in the economy slumped for the fifth straight month to the lowest level since the onset of COIVD-19 as worries about the impact of tariffs take a heavy toll on consumer expectations for future growth. The Conference Board said Tuesday that its consumer confidence index fell 7.9 points in April to 86, its lowest reading since May 2020. The figures reflect a rapidly souring mood among consumers, most of whom expect prices to rise because of the widespread tariffs imposed by President Donald Trump.",
      "publishedAt": "2025-04-29T14:12:42Z",
      "title": "US consumer confidence plummets to Covid-era low",
      "url": "https://apnews.com/article/economy-confidence-tariffs-f3cb9058971c008127f8dc22c8933296",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ed20af/2147483647/strip/true/crop/6000x3375+0+562/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F82%2F38e75070f33a51ba1ff1e11e2232%2F3c2825280d8b4f35bcb8cee945ee358a"
    },
    {
      "author": "Lindsey Bahr",
      "description": "Superman already has a lot on his shoulders. It seems unfair to add the fate of the summer movie season to his list. But he’s not alone -- Marvel Studios is also returning to theaters in a big way with two movies this summer, “Thunderbolts” and “The Fantastic Four: First Steps.” Critics may have complained of fatigue, but they're a vital part of the marketplace. The summer movie season, which runs the first week of May through Labor Day, historically accounts for 40% of the annual box office and this mix of films could power it to the biggest season in the post-COVID era.",
      "publishedAt": "2025-04-29T17:44:04Z",
      "title": "What to know about the summer 2025 movie season",
      "url": "https://apnews.com/article/summer-movie-preview-2025-what-to-know-fa165400777b5292148d90a77245ee88",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab365c6/2147483647/strip/true/crop/2412x1357+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F00%2Fe7557ac7b1bc2136695f628a9459%2F09c90d0761be4219a139de16eed83288"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}