{
  "articles": [
    {
      "author": "Amir-hussein Radjy",
      "description": "A month after Iran launched a crackdown on nationwide protests, widespread arrests are roiling the country. Reports of raids on homes and workplaces have come from major cities and rural towns alike, revealing a dragnet that has touched large swaths of Iranian society. University students, doctors, lawyers, teachers, actors, athletes and filmmakers have been swept up. Activists say those who are arrested are often held incommunicado for days or weeks and prevented from contacting family members or lawyers. The U.S.-based Human Rights Activists News Agency has put the number of arrests at more than 50,000 and the number of the deaths at more than 7,000.",
      "publishedAt": "2026-02-14T05:02:12Z",
      "title": "Widespread arrests roil Iran in aftermath of crushed protests",
      "url": "https://apnews.com/article/iran-protests-crackdown-arrests-9de7c65d17920dc43568d3f025fed2cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/25d79ce/2147483647/strip/true/crop/2675x1782+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fbe%2F967ebde839fe2a4118b354461a3c%2F1cc824a8e62d4bc8985971019d78d007"
    },
    {
      "author": null,
      "description": "U.S. Secretary of State Marco Rubio on Saturday emphasized the United States’ desire to preserve the trans-Atlantic alliance, declaring that it “will always be a child of Europe” at a conference where a rift with Washington’s European allies opened up a year ago. Rubio told the Munich Security Conference that the “euphoria” of the Western victory in the Cold War led to a dangerous delusion of triumph that is now threatening the very institutions that broke both the Nazi regime and the Soviet Union.",
      "publishedAt": "2026-02-14T08:41:32Z",
      "title": "Rubio expresses desire to maintain trans-Atlantic relations despite increasing rift",
      "url": "https://apnews.com/article/munich-security-conference-rubio-4a26cfa8ebb54643be98405e896433d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/d37bdf6/2147483647/strip/true/crop/7000x4664+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F28%2F5da9209d42a3d6f6c97dbf294da9%2Ffd3a682ac55f496594d53bc06e1ac1f1"
    },
    {
      "author": null,
      "description": "A Russian drone strike on the city of Odesa killed an elderly woman ahead of fresh U.S.-brokered peace talks. Ukrainian officials said Saturday a Russian drone hit a residential building in Odesa and killed an older woman. On Friday, Russian officials said a Ukrainian missile strike in Belgorod killed two people and wounded five. Meanwhile, another round of discussions between envoys from Russia and Ukraine will take place next on Tuesday and Wednesday in Geneva. The talks come as fighting grinds on along the front line, with Russia bombing Ukrainian cities and the power grid and Ukraine launching long-range drone attacks inside Russia.",
      "publishedAt": "2026-02-14T08:26:14Z",
      "title": "A Russian drone strike kills 1 in Odesa ahead of US-brokered peace talks in Geneva",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-drones-geneva-71097ecf70019070b7b83dd3bebe21cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jim Morris, Rob Gillies",
      "description": "Canadian Prime Minister Mark Carney and the country’s opposition leaders paid tribute to the victims of one of the worst mass shootings in the country’s history at a vigil in the devastated northern British Columbia town. Carney and Conservative Opposition leader Pierre Poilievre joined hands during the community vigil. Carney named each of the six people killed at the school and said the mother and brother of the shooter who were killed also “deserve to be mourned.” British Columbia Premier David Eby said the students of the school won’t ever have to return to the building if they don’t want to. School shootings are rare in Canada, which has strict gun-control laws.",
      "publishedAt": "2026-02-14T02:58:44Z",
      "title": "Prime Minister Carney and Canada's main opposition leader hold hands during school shooting vigil",
      "url": "https://apnews.com/article/canada-school-shooting-vigil-carney-7d2d2ec8e302befe808f822432ed9a03",
      "urlToImage": "https://dims.apnews.com/dims4/default/e44ed51/2147483647/strip/true/crop/7337x4889+0+102/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F9e%2Feac3da4c09052e44de277f442dd1%2F056853ffbabc41dea8cb919071ef42a5"
    },
    {
      "author": null,
      "description": "The U.S. military says it has carried out another deadly strike on a vessel accused of trafficking drugs in the Caribbean Sea. U.S. Southern Command said Friday on social media that the boat “was transiting along known narco-trafficking routes in the Caribbean and was engaged in narco-trafficking operations.” It said the strike killed three people. A video linked to the post shows a boat moving through the water before exploding in flames. Friday’s attack raises the death toll from the Trump administration’s strikes on alleged drug boats to 133 people in at least 38 attacks carried out since early September in the Caribbean Sea and eastern Pacific Ocean.",
      "publishedAt": "2026-02-14T01:16:30Z",
      "title": "US military strikes another alleged drug boat in Caribbean",
      "url": "https://apnews.com/article/military-strikes-cartels-drug-boats-caribbean-cadab97919b92939ad069a05b567c00c",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f9ead9/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F1e%2F867fe0e8649ef905c1b27399cad9%2F77f75c663a1842faa73dba7255844b50"
    },
    {
      "author": "Jack Brook",
      "description": "The Trump administration announced this week that its immigration crackdown in Minnesota is ending. Minneapolis will now need to decide how to manage the makeshift memorial sites for two U.S. citizens killed by federal agents. Flowers, handwritten signs and artwork have amassed around the sites where Renee Good and Alex Pretti were fatally shot last month. A spokesperson for Minneapolis Mayor Jacob Frey says it was “too early” for the city to comment on the future of the memorial sites. It took the city five years to determine plans for a permanent memorial site for George Floyd after he was murdered by a police officer in 2020.",
      "publishedAt": "2026-02-14T05:04:13Z",
      "title": "Memorials remain in Minneapolis to 2 people killed by federal officers",
      "url": "https://apnews.com/article/minneapolis-renee-good-alex-pretti-memorial-114fc6189d63adb8cc06d275929652eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/b86d2b3/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Fbd%2Fd0bb06c697a5af750b933b9ce8c8%2F34badf691e7b4b86aecf7c5b187730dd"
    },
    {
      "author": "Konstantin Toropin, Jon Gambrell",
      "description": "The world’s largest aircraft carrier, the USS Gerald R. Ford, has been ordered to sail from the Caribbean Sea to the Middle East. That's according to a person familiar with the matter who spoke Thursday on condition of anonymity. It comes as U.S. President Donald Trump considers whether to take possible military action against Iran. The move, first reported by The New York Times, will put two carriers and their accompanying warships in the region as Trump increases pressure on Iran to make a deal over its nuclear program.",
      "publishedAt": "2026-02-13T04:44:52Z",
      "title": "Second US aircraft carrier is going to the Middle East, AP source says",
      "url": "https://apnews.com/article/trump-iran-aircraft-carrier-military-8db3fab10476949acda8b973be416204",
      "urlToImage": "https://dims.apnews.com/dims4/default/09e5af1/2147483647/strip/true/crop/4724x3148+2+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F1d%2F114777173880f03ca451fcd761a3%2Fd295d48c402440db8abee8c9da00efe3"
    },
    {
      "author": "Steve Karnowski",
      "description": "Former CNN host Don Lemon and four other people are set to be arraigned on federal civil rights charges in Minnesota, accused in a protest at a church in St. Paul where an Immigration and Customs Enforcement official is a pastor. Civil rights attorney and prominent local activist Nekima Levy Armstrong is also being arraigned in the case Friday. Lemon says he was reporting on the protesters as an independent journalist at Cities Church on Jan. 18, while prosecutors accuse him of joining a “mob.” Lemon did not comment to reporters as he entered the courthouse. Nine people have been indicted in the case.",
      "publishedAt": "2026-02-13T05:10:38Z",
      "title": "Don Lemon to be arraigned in Minnesota church protest case",
      "url": "https://apnews.com/article/don-lemon-cnn-minnesota-church-protest-immigration-4a110d3e097f86b696281b5c36ce3339",
      "urlToImage": "https://dims.apnews.com/dims4/default/d39d5ae/2147483647/strip/true/crop/1909x1272+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F23%2Fb408bbc1d17dc5c27faa4d32b2db%2F0407ca0a3ae14b5d99bdd6fda19b80ea"
    },
    {
      "author": "Ed White, Ty Oneil",
      "description": "More than 4,000 calls came into an Arizona sheriff's department within 24 hours after the release of videos of a masked person on Nancy Guthrie’s porch. Many will be worthless. Others could have merit. Experts say one thing’s certain: The tips can’t be ignored. Images of a mysterious person have been the most significant clues shared with the public during Guthrie’s disappearance in the Tucson area. She is the mother of NBC “Today” co-anchor Savannah Guthrie. Roberto Villaseñor, a former Tucson police chief, says processing tips is a tremendous amount of work. The FBI says it has collected more than 13,000 tips since Feb. 1, and the sheriff's office says it's received at least 18,000.",
      "publishedAt": "2026-02-13T05:08:08Z",
      "title": "How investigators sort tips in the Nancy Guthrie disappearance",
      "url": "https://apnews.com/article/nancy-guthrie-kidnapping-tips-arizona-9a34c55e06f0ffd891ea4368f2b3a038",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d773c3/2147483647/strip/true/crop/1476x983+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fe1%2F65e8c9e0352e1c0d5c3e30adc7b6%2Fa060c474f9604f07af89b9e431081fcc"
    },
    {
      "author": "Jonathan J. Cooper",
      "description": "A White House memo says demolition crews \"excellently preserved\" the White House residence when they tore down the East Wing for President Donald Trump’s planned ballroom. The administration released details Friday after the National Capital Planning Commission asked for more transparency. The memo says contractors kept heavy equipment at a safe distance and workers removed some parts by hand. Crews stabilized sections of the building and monitored vibrations and cracks. Curators also preserved historic items, like columns, doors, windows and chandeliers. The memo says the new ballroom will include a larger visitor screening center and reduce road closures.",
      "publishedAt": "2026-02-13T23:53:50Z",
      "title": "Memo says East Wing demolition didn't affect White House preservation",
      "url": "https://apnews.com/article/white-house-ballroom-east-wing-trump-5625b22f90a887394bf317b9d4f8e3b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8cb6bf/2147483647/strip/true/crop/4000x2665+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fb2%2Ff2dbcc7c12a5463ed5868559fcfe%2F817fda9824d043e998fb11a38cc457f2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}