{
  "articles": [
    {
      "author": "Tia Goldenberg",
      "description": "An Israeli official says Cabinet ministers have approved plans to intensify military operations in the Gaza Strip. The official said the plan was gradual and involved claiming more territory in the Palestinian enclave. The approval comes a day after Israel announced it was calling up tens of thousands of reservist for the expanded operations in Gaza, which Israel says are meant to increase pressure on the militant Hamas group to negotiate a ceasefire that better aligns with Israel’s terms. An eight-week ceasefire with the Hamas militant group collapsed in March when Israel resumed strikes in Gaza, killing hundreds of Palestinians, many of them women and children.",
      "publishedAt": "2025-05-05T05:26:52Z",
      "title": "Israel approves plans to intensify Gaza operations, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-05-2025-d22caabfd2cf89e83fe06e649e6438ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f14842/2147483647/strip/true/crop/3070x1727+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fb8%2F587422fe1fb2df6a5e1e55ec7f56%2Fa243f78be02e4bd595d740fc8841d116"
    },
    {
      "author": "Vanessa Gera",
      "description": "All Vatican personnel involved in supporting the upcoming papal conclave will take an oath of secrecy — under penalty of automatic excommunication. The ceremony, mandated by Vatican law and revised by Pope Benedict XVI, includes clerics and lay staff alike: cooks, cleaners, doctors, nurses and security officials. Nearly 135 cardinal electors will gather in the Sistine Chapel, beginning on Wednesday, to vote in secret for Pope Francis’s successor. The oath, which explicitly forbids recording or disclosing anything from within the conclave, underscores the Church’s insistence on confidentiality. Cardinals are bound by their own rules of secrecy. They will take their oaths on Wednesday as well.",
      "publishedAt": "2025-05-05T10:09:56Z",
      "title": "Ahead of the conclave, the Vatican staff is to be sworn to secrecy under threat of excommunication",
      "url": "https://apnews.com/article/vatican-conclave-lay-staff-secrecy-oath-254ceb6848bea852047097fec08d8e70",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d35d0a/2147483647/strip/true/crop/6000x3375+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F69%2Ffefc714882a936bacc5f2a130bff%2F435f7cfea4be41638075ffebee766100"
    },
    {
      "author": null,
      "description": "Jury selection is set to start in Sean “Diddy” Combs' sex trafficking trial in New York. The hip-hop impresario's trial begins Monday. He faces charges including racketeering conspiracy and bringing sex workers across state lines. Prosecutors say Combs coerced women into participating in sex acts with prostitutes during drug-fueled parties. They say he used violence and threats to keep his victims compliant and silent. Lawyers for Combs say the sex was consensual. Combs has pleaded not guilty. The trial is expected to take at least eight weeks.",
      "publishedAt": "2025-05-05T04:11:16Z",
      "title": "Sean 'Diddy' Combs sex trafficking trial is set to start with jury selection",
      "url": "https://apnews.com/article/diddy-trial-sean-combs-550b3f0c7a4bbb2f2777edb0a16762a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/04752ea/2147483647/strip/true/crop/3500x1969+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F1b%2Ff77b29dfd4fb41f15c70e43c726f%2F9947473cea9848a8a5e92a20a4d152e7"
    },
    {
      "author": "Bernard Condon, Josh Funk",
      "description": "Billionaire Warren Buffett will remain chairman of Berkshire Hathaway after Greg Abel takes over as CEO at the start of the new year. The decision by the board of directors at the conglomerate Sunday is likely to relieve investors worried about the future of Berkshire’s remarkable winning streak amid tariff shocks, financial turmoil and a possible recession. The changes come as the former textile manufacturer faces big questions about how to deploy its massive pile of cash after a stock-market defying six-decade run.",
      "publishedAt": "2025-05-05T11:29:49Z",
      "title": "Buffett will remain chairman at Berkshire Hathaway when Abel takes over as CEO in 2026",
      "url": "https://apnews.com/article/berkshire-hathaway-buffett-abel-188684d40a7d7188de4ab4239d598595",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef5a8d0/2147483647/strip/true/crop/2237x1258+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F6a%2F5aca1a7eb63e473882bc4434b553%2F5aa31f7083b749f9beafbcd3b05b2dcc"
    },
    {
      "author": "Rebecca Santana",
      "description": "President Donald Trump's administration says it's going to pay immigrants in the United States illegally who’ve returned to their home country voluntarily $1,000 as it pushes forward with its mass deportation agenda. The Department of Homeland Security said Monday that it's also paying for travel assistance and that people who use their CBP Home app to tell the government they plan to return home will be “deprioritized” for detention and removal by immigration enforcement. Trump has made immigration enforcement a centerpiece of his campaign. But that is a costly, resource-intensive endeavor. The Republican administration is pushing Congress for a massive increase in resources but also pushing people in the country illegally to “self-deport.”",
      "publishedAt": "2025-05-05T14:51:05Z",
      "title": "Trump says he'll pay immigrants in the US illegally $1,000 to leave the country",
      "url": "https://apnews.com/article/trump-immigration-mass-deportation-payment-border-illegal-c459325c4a73dba0d5a89fa19dbee334",
      "urlToImage": "https://dims.apnews.com/dims4/default/05a0a44/2147483647/strip/true/crop/7750x4359+0+533/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fa8%2F2ee803f0548da6f39cada9309620%2F3b42bc901e2c4a60a0a211d2359dddd3"
    },
    {
      "author": "Christopher Rugaber",
      "description": "The Federal Reserve will likely keep its key short-term interest rate unchanged on Wednesday, despite harsh criticism from President Donald Trump and his demand that the Fed reduce borrowing costs. After causing a sharp drop in financial markets two weeks ago by saying he could fire Fed Chair Jerome Powell, the Republican leader backed off and said he had no intention of doing so. Still, he and Treasury Secretary Scott Bessent have said the Fed should cut rates. The heightened scrutiny shows that even as the Trump administration backs off its threats to fire Powell, the Fed is still subject to unusually sharp political pressures, despite being an independent agency.",
      "publishedAt": "2025-05-05T04:01:37Z",
      "title": "Federal Reserve likely to defy Trump, keep rates unchanged this week",
      "url": "https://apnews.com/article/inflation-trump-fed-rates-dda543c3c00fda34e37e09119d9a9709",
      "urlToImage": "https://dims.apnews.com/dims4/default/b146120/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F08%2Ffd4ac6fc59dcb6aa48b074fa702b%2F91b5ba88544b49a2b092d907adaa3515"
    },
    {
      "author": "Munir Ahmed, Muhammad Yousaf",
      "description": "Iran’s foreign minister has held talks with top Pakistani officials to try and mediate in the escalation between Islamabad and New Delhi after last month’s deadly attack on tourists in the Indian-controlled part of Kashmir. Abbas Araghchi’s visit to Islamabad on Monday was the first by a foreign dignitary since tensions flared in the wake of the April 22 massacre of 26 people in the town of Pahalgam. Most of the victims were Indian Hindu tourists. India blames Pakistan, which denies the accusation. Tehran has offered to help ease tensions between the nuclear-armed neighbors.",
      "publishedAt": "2025-05-05T05:44:15Z",
      "title": "Iran's top diplomat in Pakistan to mediate in the escalation with India over the Kashmir attack",
      "url": "https://apnews.com/article/pakistan-tensions-india-iran-araghchi-92770117a93b72814c494834348b73b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/126c438/2147483647/strip/true/crop/3524x1982+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F67%2F259fc084dc3f7093cfae2bc66ea9%2F387527c3bc9747f097865546253f948a"
    },
    {
      "author": "Leanne Italie",
      "description": "Welcome to the first Monday in May! It's Met Gala time and the theme this year is menswear. Specifically, the dress code will focus on Black dandyism, tailoring and style. The starry guest list amounts to about 450 high-profile people from tech, sports, art, entertainment and more. This is the first Met Gala to focus exclusively on Black designers, and the first in more than 20 years to have a menswear theme. Among the hosts are Pharrell Williams, Lewis Hamilton, Colman Domingo and A$AP Rocky. LeBron James is an honorary chair with Vogue's Anna Wintour as mastermind. The gala raises the bulk of the budget for the Metropolitan Museum of Art's Costume Institute.",
      "publishedAt": "2025-05-05T04:00:06Z",
      "title": "How to stream and watch the Met Gala",
      "url": "https://apnews.com/article/met-gala-2025-fashion-stream-93414e556eed355b14863e6bec9c296f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a21cd4e/2147483647/strip/true/crop/900x506+0+47/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F6d%2Fbdbadb241237b74d793cef4beea5%2F48b4f89384524c619d80d7e02ec42ee2"
    },
    {
      "author": null,
      "description": "Officials say three people were killed, four were injured and nine others are missing after a small boat overturned in the ocean off San Diego. The sheriff's department says agencies including the U.S. Coast Guard responded around 6:30 a.m. Monday following reports of a capsized panga-style boat near Torrey Pines State Beach. The Coast Guard said on X that it was searching for nine missing people in the water about 15 miles north of downtown San Diego. Pangas are open boats designed for fishing but commonly used by smugglers.",
      "publishedAt": "2025-05-05T16:49:46Z",
      "title": "3 killed and 9 missing after small boat capsizes off San Diego, Coast Guard says",
      "url": "https://apnews.com/article/san-diego-capsized-boat-people-dead-26b454906f298d9ee442583e40051470",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran is talking tough — while still wanting to talk more with the United States over a possible nuclear deal. In the last days, Tehran has backed an attack by Yemen’s Houthi rebels that slipped through Israel’s missile defenses to strike near Ben-Gurion Airport. But all the while, Iran maintains it wants to reach a nuclear deal with the U.S. That’s even as Trump administration officials continue to insist that Tehran must give up all its ability to enrich uranium in order to receive sanction relief — something Iran repeatedly has said is a nonstarter for the negotiations.",
      "publishedAt": "2025-05-05T13:20:01Z",
      "title": "AP Analysis: Iran talks tough with US while seeking nuclear deal",
      "url": "https://apnews.com/article/iran-us-nuclear-deal-ballistic-missiles-houthis-37f64936be136584b0e03173ab813cb9",
      "urlToImage": "https://dims.apnews.com/dims4/default/96e5122/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F34%2F55810d12ca10fba3f9c5e2374f52%2F21054deffe7744ab90fe543b7d2f07b7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}