{
  "articles": [
    {
      "author": "SAMY MAGDY, NAJIB JOBAIN and JOSEF FEDERMAN",
      "description": "CAIRO (AP) — Israel and Hamas on Monday gave cool public receptions to an Egyptian proposal to end their bitter war. But the longstanding enemies stopped short of rejecting the plan altogether, raising the possibility of a new round of diplomacy to halt a devastating Israeli offensive in the Gaza Strip.",
      "publishedAt": "2023-12-25T10:52:17Z",
      "title": "Egypt floats plan to end Israel-Hamas war. The proposal gets a cool reception",
      "url": "https://apnews.com/151faf920facb9910a254c2987e00d5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65289ff8344441ec9d8c8d7fc207ab34/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis on Monday blasted the weapons industry and its “instruments of death” that fuel wars as he made a Christmas Day appeal for peace in the world and in particular between Israel and the Palestinians.",
      "publishedAt": "2023-12-25T11:40:50Z",
      "title": "Pope Francis denounces the weapons industry as he makes a Christmas appeal for peace in the world",
      "url": "https://apnews.com/cb9af73aa193d8ffe413aa767be41234",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00d0e01fbb154a83b3f52757ce5b64f4/2694.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "BETHLEHEM, West Bank (AP) — The typically bustling biblical birthplace of Jesus resembled a ghost town Sunday after Christmas Eve celebrations in Bethlehem were called off due to the Israel-Hamas war.",
      "publishedAt": "2023-12-24T09:34:45Z",
      "title": "On Christmas Eve, Bethlehem resembles a ghost town. Celebrations are halted due to Israel-Hamas war.",
      "url": "https://apnews.com/e408a3e48d18c69a7a0b018505cdc732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61467ff3817a42949826a108eb2a4688/1920.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — King Charles III reflected his coronation theme of public service Monday in a Christmas message that he connected to the health of the planet and wars that are raging.",
      "publishedAt": "2023-12-25T05:05:38Z",
      "title": "King Charles III's Christmas message reflects a coronation theme and calls for planet's protection",
      "url": "https://apnews.com/659d022ca066c5922fcd1c7b9e970194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae514437c8b84a588be43bd26e23e365/3000.jpeg"
    },
    {
      "author": "ALEX BABENKO",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy on Monday hailed the shooting down of two Russian fighter jets on Christmas Eve and said “this Christmas sets the right mood for the entire year ahead.”",
      "publishedAt": "2023-12-25T11:58:53Z",
      "title": "Ukraine says it shot down Russian fighter jets and drones as the country officially marks Christmas",
      "url": "https://apnews.com/48ea3c04c7f907b5da098f3ce6cd643f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/343411b6c3bb4c1a83925f6f5fdbe0fc/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Gift cards make great stocking stuffers — just as long as you don't stuff them in a drawer and forget about them after the holidays.Americans are expected to spend nearly $30 billion on gift cards this holiday season, according to the National Retail Federation.",
      "publishedAt": "2023-12-25T10:27:31Z",
      "title": "The secret life of gift cards: Here's what happens to the billions that go unspent each year",
      "url": "https://apnews.com/e9592f6b4067601a27d0f0199da898c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e02586699e14e16b569b4d8c4850bea/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Associates of imprisoned Russian opposition leader Alexei Navalny said Monday that he has been located at a prison colony above the Arctic Circle nearly three weeks after contact with him was lost.",
      "publishedAt": "2023-12-25T13:30:06Z",
      "title": "Imprisoned Russian politician Navalny is now in a penal colony near the Arctic Circle",
      "url": "https://apnews.com/16f8d87e2972af043a5ea2b4643e5fee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eef6dacef90a462ca0160a1d6885fe8e/3000.jpeg"
    },
    {
      "author": "CHRISTOPHE ENA and ANGELA CHARLTON",
      "description": "VATRY, France (AP) — A charter plane grounded in France for a human trafficking investigation departed Monday for India with 276 Indians aboard, authorities said.",
      "publishedAt": "2023-12-25T09:54:33Z",
      "title": "276 Indians stuck in a French airport for days for a human trafficking probe have left for India",
      "url": "https://apnews.com/147e6408f2df4ec26a7033cb2c429424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e290868833794000bc3f6ee9f73722b8/3000.jpeg"
    },
    {
      "author": "MOHAMMAD HABIB RAHMANI",
      "description": "KABUL, Afghanistan (AP) — Bahara Rustam, 13, took her last class at Bibi Razia School in Kabul on Dec. 11 knowing it was the end of her education. Under Taliban rule, she is unlikely to step foot in a classroom again.",
      "publishedAt": "2023-12-25T06:35:37Z",
      "title": "Afghan schoolgirls are finishing sixth grade in tears. Under Taliban rule, their education is over",
      "url": "https://apnews.com/5285d6d302f7c95a584dd8018a8c5a30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ba74bab6294e73bd6cd9dd3ef31c4e/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "We lost Twitter and got X. We tried out Bluesky and Mastodon (well, some of us did). We fretted about AI bots and teen mental health. We cocooned in private chats and scrolled endlessly as we did in years past.",
      "publishedAt": "2023-12-24T17:00:40Z",
      "title": "The year of social media soul-searching: Twitter dies, X and Threads are born and AI gets personal",
      "url": "https://apnews.com/98e4905027104347c7fd20fdff1641c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51235802a8ab4dbf9155a5d10e2e7b32/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}