{
  "articles": [
    {
      "author": "BASSEM MROUE, ABBY SEWELL and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Pagers used by hundreds of members of the militant group Hezbollah exploded near-simultaneously Tuesday in Lebanon and Syria, killing at least nine people, including an 8-year-old girl, and wounding several thousand, officials said.",
      "publishedAt": "2024-09-17T13:55:58Z",
      "title": "Hezbollah is hit by a wave of exploding pagers that killed at least 9 people and injured thousands",
      "url": "https://apnews.com/8893a09816410959b6fe94aec124461b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38d3e6e9cc3b436e9bcaf149eda1e949/1920.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS, MICHAEL BIESECKER, SARAH EL DEEB and SARAH PARVINI",
      "description": "NEW YORK (AP) — In what appears to be a sophisticated, remote attack, pagers used by hundreds of members of Hezbollah exploded almost simultaneously in Lebanon and Syria Tuesday, killing at least nine people — including an 8-year-old girl — and wounding thousands more.",
      "publishedAt": "2024-09-17T19:11:49Z",
      "title": "What to know about the deadly pager explosions targeting Hezbollah",
      "url": "https://apnews.com/e9493409a0648b846fdcadffdb02d71e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d724b968754387b761e4d621a52547/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER, MICHAEL R. SISAK, JENNIFER PELTZ and ANDREW DALTON",
      "description": "NEW YORK (AP) — For 10 months, rumblings, lawsuits, law enforcement raids and mounting allegations of widespread sexual abuse had surrounded Sean \"Diddy Combs.",
      "publishedAt": "2024-09-18T04:04:57Z",
      "title": "Sean 'Diddy' Combs' indictment alleges he used power to build empire of sexual crime",
      "url": "https://apnews.com/b60db3252403f2bfbe24c54b34f0cfdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c95f28f04ec4c4d839c1712197129e1/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, WILL WEISSERT and ADRIANA GOMEZ LICON",
      "description": "FLINT, Mich. (AP) — Former President Donald Trump on Tuesday made his first public appearance since Sunday’s second apparent assassination attempt against him, speaking to an crowd chanting “God bless Trump!” and “Fight, Fight, Fight” as U.S.",
      "publishedAt": "2024-09-17T14:17:45Z",
      "title": "Trump holds first event since an apparent assassination attempt while Harris does a rare interview",
      "url": "https://apnews.com/400c592c567d330d995f8dd6633dc782",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b6b300ddf334185a13b7d19c646f2d4/1920.jpeg"
    },
    {
      "author": null,
      "description": "SRINAGAR, India (AP) — The three-phased election for choosing a local government in Indian-controlled Kashmir opened early Wednesday in the first such vote since Prime Minister Narendra Modi’s government stripped the disputed region of its special status five years ago.",
      "publishedAt": "2024-09-18T02:07:46Z",
      "title": "Voting for local government opens in Indian-controlled Kashmir for first time after losing autonomy",
      "url": "https://apnews.com/197e0720c55fad094535e2a5d6907b59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07c40ce3726148b1b09a9794551bc0ef/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "AVIGNON, France (AP) — A 71-year-old French man admitted in court Tuesday that for nearly a decade, he repeatedly drugged his unwitting wife and invited dozens of men to rape her while she lay unconscious in their bed.",
      "publishedAt": "2024-09-17T08:09:28Z",
      "title": "A French man admits in court to drugging his wife so that he and dozens of men could rape her",
      "url": "https://apnews.com/943400b83a8b111bcd42a0fb23a1cfda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d971290ebbc4fce99507c27a5c80741/3000.jpeg"
    },
    {
      "author": "PAOLA FLORES",
      "description": "CARACOLLO, Bolivia (AP) — Thousands of anti-government demonstrators marching in support of Bolivia’s former President Evo Morales clashed on Tuesday with counterprotesters blocking their way, a stark sign of an escalating power struggle in the volatile Andean nation.",
      "publishedAt": "2024-09-18T00:42:46Z",
      "title": "March for Bolivia's ex-President Morales turns violent, as political crisis escalates",
      "url": "https://apnews.com/14888ebce41ed3479801dd054cc285c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbc212a0eb5c4b40b670f0974ae48c28/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM and JULIE CARR SMYTH",
      "description": "SPRINGFIELD, Ohio (AP) — A small Ohio city has been inundated with hoax bomb threats since last week's presidential debate, when former President Donald Trump falsely accused members of Springfield's Haitian community of abducting and eating cats and dogs.",
      "publishedAt": "2024-09-17T22:42:17Z",
      "title": "What to know about the threats in Springfield, Ohio, after false claims about Haitian immigrants",
      "url": "https://apnews.com/7594bae869fb05dc6f106098409418cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75d9780aa0e4026bb717e910dccdd5a/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — On the eve of New Zealand’s Māori language celebration week, the country’s right-wing political leaders ordered public agencies to stop affirmative action policies for Māori people, who are disadvantaged on almost every metric.",
      "publishedAt": "2024-09-18T03:18:10Z",
      "title": "Seen abroad as a leader on Indigenous rights, New Zealand enters a divisive new era",
      "url": "https://apnews.com/5390951314bc5c5e690ad192043b6913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84354aaee9b24d8cb48850e4f78d19a4/3000.jpeg"
    },
    {
      "author": "JEFF TURNER",
      "description": "LOS ANGELES (AP) — Convicted con artist Anna Sorokin has hit the dancefloor on “Dancing With the Stars” with a featherweight — and very sparkly — ankle monitor.",
      "publishedAt": "2024-09-18T04:27:58Z",
      "title": "'Fake heiress' Anna Sorokin debuts on 'Dancing with the Stars' — with a sparkly ankle monitor",
      "url": "https://apnews.com/9bf38625548c95e8827eed5678380694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2401fc762ad4508b49ed72f3c617bec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}