{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Ukrainian President Volodymyr Zelenskyy will meet with President Donald Trump in Washington on Friday as he seeks some form of U.S. backing for Ukraine's security against any future Russian aggression.",
      "publishedAt": "2025-02-28T07:46:00Z",
      "title": "Live updates: Trump to meet with Zelenskyy as Ukraine seeks an end to Russian aggression",
      "url": "https://apnews.com/live/donald-trump-latest-news-2-28-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/284e157/2147483647/strip/true/crop/8640x4860+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F74%2F8677e7a04d2486797289a9e7ee9e%2Fap25057611146699.jpg"
    },
    {
      "author": "Justin Spike, Aamer Madhani",
      "description": "Ukrainian President Volodymyr Zelenskyy is meeting with President Donald Trump in Washington. Friday's meeting is a pivotal moment for Zelenskyy's country, one that hinges on whether he can persuade the Republican to provide some form of U.S. backing for Ukraine’s security against any future Russian aggression. During the visit, Ukraine is expected to sign a landmark economic agreement with the U.S. that would bind the two countries economically for years. But Zelenskyy insists on firm security guarantees to safeguard his country. There are concerns that Trump may broker a peace deal favoring Russia. But U.S. officials argue American investments in Ukraine will inherently enhance its security.",
      "publishedAt": "2025-02-28T05:01:36Z",
      "title": "Zelenskyy will meet Trump and seek assurances against future Russian aggression",
      "url": "https://apnews.com/article/zelenskyy-security-guarantees-trump-meeting-washington-eebdf97b663c2cdc9e51fa346b09591d",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf72c60/2147483647/strip/true/crop/2585x1454+0+137/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Fbd%2F83c63b8ced689c6b5de1f5a52e3b%2Fb126372fa39a43b4a9dcf21ccd55f1fd"
    },
    {
      "author": "Adriana Gomez Licon",
      "description": "President Donald Trump and Vice President JD Vance had a heated exchange with Ukrainian President Volodymyr Zelenskyy in the Oval Office over the war in Ukraine, accusing him of not showing gratitude after he challenged Vance on the question of diplomacy with Russia’s Vladimir Putin. The argument, broadcast globally on Friday, was perhaps unique in American history. It led to the rest of Zelenskyy’s White House visit being canceled and called into question how much the U.S. will still support Ukraine in its defense against Russia’s 2022 invasion.",
      "publishedAt": "2025-02-28T20:58:30Z",
      "title": "A transcript of Trump and Zelenskyy's Oval Office argument",
      "url": "https://apnews.com/article/trump-zelenskyy-vance-transcript-oval-office-80685f5727628c64065da81525f8f0cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c9e3b4/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F49%2Fd2ae134e0b373d79553f54764f30%2F8fd972c8997a4122bb7524d4a3c3b60e"
    },
    {
      "author": "Mead Gruver",
      "description": "President Donald Trump has made the raw materials of modern life a pillar of U.S. foreign policy. He has talked about acquiring Greenland and its vast mineral wealth and prodding Ukraine for minerals in exchange for help fending off Russia’s invasion. This week, Trump took a step toward granting the U.S. mining industry’s top wishes by singling out copper as a focus of his domestic minerals policy. Trump signed an executive order Tuesday that calls for bolstering domestic U.S. copper production. While the U.S. mining industry praises Trump, groups opposed to stalled copper projects in Arizona and Minnesota say they shouldn't go ahead.",
      "publishedAt": "2025-02-28T05:13:52Z",
      "title": "Trump order calls for boosting US copper industry",
      "url": "https://apnews.com/article/trump-copper-mining-executive-order-minerals-bf9ce8863558efc2abb6f9563cfc4ebb",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce2dfcb/2147483647/strip/true/crop/3600x2025+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F8b%2F4f70db571878811677a207f2460e%2Fd772c81b1fd849ae9e20fe263dda1d2a"
    },
    {
      "author": "Hannah Fingerhut",
      "description": "Iowa has became the first U.S. state to remove gender identity protections from its civil rights code. Republican Gov. Kim Reynolds signed the bill into law Friday, a day after the Republican-controlled House and Senate approved the measure. Reynolds has long opposed gender identity protections. Both the House and Senate approved the bill Thursday even as hundreds of opponents filled the state Capitol, chanting slogans and testifying against it. The new law removes gender identity as a protected class from Iowa’s civil rights law. It also explicitly defines female and male, as well as gender.",
      "publishedAt": "2025-02-28T20:43:59Z",
      "title": "Iowa governor signs bill removing gender identity protections",
      "url": "https://apnews.com/article/iowa-transgender-identity-bill-governor-reynolds-signs-267c2932e9e1ed62992868d3caa6126d",
      "urlToImage": "https://dims.apnews.com/dims4/default/364ceeb/2147483647/strip/true/crop/4464x2511+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F01%2F6a45e1345166d87ae9d488c1c3cb%2Ff8f5a30ee69d4ca682fe53181d67c939"
    },
    {
      "author": "Sophia Tareen, Melissa Perez Winder",
      "description": "A jury has found a 73-year-old Illinois landlord guilty in a hate crime attack that left a Palestinian American boy dead and injured his mother. Joseph Czuba faced murder, attempted murder and hate crime charges in the death of Wadee Alfayoumi and the wounding of his mother, Hanan Shaheen, in October 2023. Authorities allege that Czuba targeted them because of their Islamic faith and as a response to the war between Israel and Hamas. He had pleaded not guilty. The family was renting rooms from Czuba at a suburban Chicago house. Shaheen testified at the trial that he attacked her with a knife before killing her 6-year-old son in another room. Jurors deliberated less than 90 minutes before handing in a verdict.",
      "publishedAt": "2025-02-28T19:18:57Z",
      "title": "Jury finds Illinois landlord guilty of murder, hate crime in 2023 attack on Palestinian American boy",
      "url": "https://apnews.com/article/palestinian-family-attacked-illinois-hate-crime-trial-muslim-1834d58621cab37197407204b4104dd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/0411b56/2147483647/strip/true/crop/2825x1589+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F6c%2Fbbd5b5b0aeee19762b43cf81de6f%2F38e7bb473d7448838daa488abd48573f"
    },
    {
      "author": "Susan Montoya Bryan, John Seewer",
      "description": "Authorities investigating the deaths of Oscar-winner Gene Hackman and his wife are waiting for more details from their autopsies to determine why they died. Santa Fe County Sheriff Adan Mendoza told NBC’s “Today” show on Friday that both were apparently dead for days or perhaps even a couple of weeks. Hackman and his wife, Betsy Arakawa, were found Wednesday at the couple’s home in Santa Fe, New Mexico. Investigators are trying to figure out the last time anyone saw or spoke to them. The sheriff says there were no signs of any foul play and they are waiting on carbon monoxide and toxicology testing results.",
      "publishedAt": "2025-02-28T15:45:31Z",
      "title": "Oscar-winner Gene Hackman and wife Betsy Arakawa may have been dead for days or weeks, sheriff says",
      "url": "https://apnews.com/article/gene-hackman-betsy-arakawa-dead-investigation-f77231a7a04bb7eff5de3c391d56a031",
      "urlToImage": "https://dims.apnews.com/dims4/default/93e0056/2147483647/strip/true/crop/1442x811+0+114/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fb2%2F11cea85084bf45d329cbdb087020%2F44b3a1d32a7b4c38b85548a13681bd9c"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican says Pope Francis suffered a bronchial spasm that resulted in him breathing in vomit, requiring non-invasive mechanical ventilation. The Vatican says he responded well, with a good level of gas exchange, and remained conscious and alert at all times. The episode, reported late Friday by the Vatican, resulted in doctors keeping his prognosis from a two-week battle with double pneumonia as guarded.",
      "publishedAt": "2025-02-28T08:06:54Z",
      "title": "Pope had a bronchial spasm and his prognosis remains guarded, Vatican says",
      "url": "https://apnews.com/article/vatican-pope-pneumonia-conclave-70907cdf66ec28e276133002987303de",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f95195/2147483647/strip/true/crop/6333x3562+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F73%2F2dde0f1f5a0f0dcfb38d58c9944c%2F136335ec649444258ff0dde6b1402ad1"
    },
    {
      "author": "Christopher Rugaber, Anne D'innocenzio",
      "description": "Ongoing tariff threats from Washington and potentially sweeping government job cuts have darkened consumers’ mood and may be weighing on an otherwise mostly healthy economy. Data released Wednesday showed that consumers slashed their spending by the most since February 2021, even as their incomes rose. On a positive note, inflation cooled, but President Donald Trump’s threats to impose large import taxes on Canada, Mexico, and China -- the United States’ top trading partners -- will likely push prices higher, economists say. Some companies are already planning to raise prices in response.",
      "publishedAt": "2025-02-28T13:42:26Z",
      "title": "Tariff threats and uncertainty could weigh on consumers, drag down US economy, gov't report suggests",
      "url": "https://apnews.com/article/economy-consumer-trump-tariffs-inflation-b8eacbe9b948af91a4efc97dd3f85cfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/2920b12/2147483647/strip/true/crop/6724x3782+0+346/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2Fa4%2F44e286c8508bfb8b18e11f6cc7d1%2Fac39f430e89b4770a0b3a6a6895b06a2"
    },
    {
      "author": "Julia Frankel",
      "description": "Mourners are burying the remains of one of the last hostages released in the first phase of the ceasefire between Hamas militants and Israel. Negotiators are seeking to iron out a second phase of the deal that could end the war in Gaza and see the remaining live hostages returning home. The body of Tsachi Idan was one of four released by Hamas this week in exchange for over 600 Palestinian prisoners, the last planned swap of the ceasefire’s first phase, which began in January. The relatives of hostages still held in Gaza are ramping up pressure on Netanyahu to secure the release of their loved ones. According to Israel, 32 of the 59 hostages still in Gaza are dead.",
      "publishedAt": "2025-02-28T11:55:31Z",
      "title": "Mourners bury one of the last hostages released from Gaza as talks start for ceasefire future",
      "url": "https://apnews.com/article/israel-hamas-war-truce-hostages-netanyahu-4608f8d5c1d86be7249e0251c08d4bdd",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e0e2a0/2147483647/strip/true/crop/8514x4789+0+443/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F4f%2F998bb1b24c3f85cc85f263988fb6%2F82d55f5b12964635bfca576d6daaad5f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}