{
  "articles": [
    {
      "author": "ALBERT AJI",
      "description": "DAMASCUS, Syria (AP) — Israel carried out at least two airstrikes on a western neighborhood of Damascus and one of the capital’s suburbs on Thursday, killing at least 15 people and wounding another 16, Syria's state news agency said.",
      "publishedAt": "2024-11-14T14:30:06Z",
      "title": "2 Israeli airstrikes hit Syria's capital and a suburb, killing 15 people, Syrian state media say",
      "url": "https://apnews.com/1f6dd957d1d6c8f610349e99cfed1a98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2110458a9d264d91b08cc07606ff8a28/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Americans are fed up with the price of food, and many are looking to President-elect Donald Trump to lower their grocery bills.",
      "publishedAt": "2024-11-14T14:31:02Z",
      "title": "Food prices worried most voters, but Trump's plans likely won't lower their grocery bills",
      "url": "https://apnews.com/b69a367ebb7dafe416b8f99b94256cf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2a2adcfde584c0e913302573b5ba931/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — Republicans have won enough seats to control the U.S. House, completing the party’s sweep into power and securing their hold on U.S. government alongside President-elect Donald Trump.",
      "publishedAt": "2024-11-14T03:29:43Z",
      "title": "Republicans win 218 US House seats, giving Donald Trump and the party control of government",
      "url": "https://apnews.com/e3754a684a7b96b129841d4b207c15e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c073fb259654a16a0e7db29cd1fe68f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump has had few defenders in Congress as reliable as Matt Gaetz, who has thundered at one prosecutor after another for perceived bias against the president-elect and emphatically amplified the Republican's rallying cry that the criminal investigations into him are “witch hunts.”",
      "publishedAt": "2024-11-14T05:03:33Z",
      "title": "Gaetz pick shows value Trump places on loyalty — and retribution — as he returns to Washington",
      "url": "https://apnews.com/0aa4f13e1e3186a6c3664a1d3b248eb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a6440dbb2c4d1d830ba506257e7663/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "The satirical news publication The Onion won the bidding for Alex Jones' Infowars at a bankruptcy auction, backed by families of Sandy Hook Elementary School shooting victims whom Jones owes more than $1 billion in defamation judgments for calling the massacre a hoax.",
      "publishedAt": "2024-11-14T14:07:21Z",
      "title": "Satire publication The Onion buys Alex Jones' Infowars at auction with Sandy Hook families' backing",
      "url": "https://apnews.com/6496f198d141c991087dcd937b3588e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d0cf69c42264f1980f0ea5da2fc6b12/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Maribel Hidalgo fled her native Venezuela a year ago with a 1-year-old son, trudging for days through Panama's Darien Gap, then riding the rails across Mexico to the United States.",
      "publishedAt": "2024-11-14T05:04:44Z",
      "title": "1 million migrants in the US rely on temporary protections that Trump could target",
      "url": "https://apnews.com/ce97e066f2515d722e2c4bd750589c62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cbd6b95bb5542dbb1a34129bbf5b1a1/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — South Africa's government says it will not help an estimated 4,000 illegal miners inside a closed mine in the country's North West province who have been denied access to basic supplies as part of an official strategy against illegal mining.",
      "publishedAt": "2024-11-14T09:29:16Z",
      "title": "South African government says it won't help thousands of illegal miners inside a closed mine",
      "url": "https://apnews.com/4d376ae6f6afca6170220f88fe859f90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a2b84bc9d48476eacba13c295d1a466/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Ford Motor Co. will pay a penalty of up to $165 million to the U.S. government for moving too slowly on a recall and failing to give accurate recall information.The National Highway Traffic Safety Administration says in a statement Thursday that the civil penalty is the second-largest in its 54-year history.",
      "publishedAt": "2024-11-14T15:29:24Z",
      "title": "Ford agrees to pay up to $165 million penalty to US government for moving too slowly on recall",
      "url": "https://apnews.com/244e2318b794e2be10196414eba9a029",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0aa8781339f74bed879868374c27b966/2250.jpeg"
    },
    {
      "author": "MARK KENNEDY and DAVID BAUDER",
      "description": "NEW YORK (AP) — Veteran NBC host and news anchor Craig Melvin has been tapped to replace Hoda Kotb as co-host of the 7 a.m.",
      "publishedAt": "2024-11-14T14:24:12Z",
      "title": "Veteran NBC host Craig Melvin tapped to replace Hoda Kotb for the first hours of 'Today' show",
      "url": "https://apnews.com/15da8420bf0920f05aa426fd7b6651bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7474df9fddac444692fd02b685b8bb47/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Those ever-present TV drug ads showing patients hiking, biking or enjoying a day at the beach could soon have a different look: New rules require drugmakers to be clearer and more direct when explaining their medications' risks and side effects.",
      "publishedAt": "2024-11-14T14:42:57Z",
      "title": "New FDA rules for TV drug ads: Simpler language and no distractions",
      "url": "https://apnews.com/80bbe076f4ed743ebde3923dd28be004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b03da42a5934648beaf68469444d54a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}