{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — The border crossing between Egypt and Gaza opened on Saturday to let a trickle of desperately needed aid into the besieged Palestinian territory for the first time since Israel sealed it off in the wake of Hamas' bloody rampage two weeks ago.",
      "publishedAt": "2023-10-21T06:51:15Z",
      "title": "Egypt's border crossing opens to let a trickle of desperately needed aid into besieged Gaza",
      "url": "https://apnews.com/f5976ed58ba508f14d45b72b428125ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71329b2786834ea6aed36fca00417d2f/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER",
      "description": "Shortly before 7 p.m. Tuesday, a volley of rockets lit up the darkened sky over Gaza. Videos analyzed by The Associated Press show one veering off course, breaking up in the air before crashing to the ground.",
      "publishedAt": "2023-10-21T04:13:10Z",
      "title": "AP visual analysis: Rocket from Gaza appeared to go astray, likely caused deadly hospital explosion",
      "url": "https://apnews.com/e0fa550faa4678f024797b72132452e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a6c873727204a0599e411cf404fc5d5/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE, MELISSA PEREZ WINDER and LISA BAUMANN",
      "description": "EVANSTON, Ill. (AP) — The father of freed American teen hostage Natalie Raanan said Friday she’s doing well following two weeks in captivity after she and her mother were abducted in Israel by Hamas and held in Gaza.",
      "publishedAt": "2023-10-20T21:18:04Z",
      "title": "The father of American teenage hostage freed by Hamas says she is 'doing very good'",
      "url": "https://apnews.com/2fa3ae23303416512a6524b47255267c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/176536fc206c403281ebec5ead39a1be/1920.jpeg"
    },
    {
      "author": "NEBI QENA",
      "description": "KYIV, Ukraine (AP) — At least two civilians were killed and others wounded across Ukraine as Russian forces continued to shell frontline areas and other parts of the country, local Ukrainian officials reported Saturday.",
      "publishedAt": "2023-10-21T10:41:04Z",
      "title": "Ukrainian officials say civilians were killed and wounded in Russian overnight attacks",
      "url": "https://apnews.com/ac5dc7fd66b340a42209a350892963b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28f37c752a3646c880d88b8c9e1e23b1/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI, STEPHEN GROVES and KEVING FREKING",
      "description": "WASHINGTON (AP) — Republicans abruptly dropped Rep. Jim Jordan on Friday as their nominee for House speaker, making the decision during a closed-door session after the hard-edged ally of Donald Trump failed badly on a third ballot for the gavel.",
      "publishedAt": "2023-10-20T04:14:35Z",
      "title": "House Republicans drop Jim Jordan as their nominee for speaker, stumbling back to square one",
      "url": "https://apnews.com/2e32f930b4fb83a4fcae2171c9e1c055",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bafc4c61441b49b49fcbc038cc5f14a6/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The White House on Friday released a sweeping set of proposals to bolster Israel and Ukraine in the midst of two wars as well as invest more in domestic defense manufacturing, humanitarian assistance and managing the influx of migrants at the U.S.-Mexico border.",
      "publishedAt": "2023-10-20T14:31:56Z",
      "title": "Biden asks Congress to secure $105 billion for Ukraine, Israel, the border and more",
      "url": "https://apnews.com/3762a0bdf00653e3c8a38175d3c3d3cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/782604ee26b74d1a96d12a5ef36f01ea/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The special counsel overseeing the Hunter Biden investigation is expected to testify before a Congressional committee behind closed doors as a GOP probe into the Justice Department's handling of the case continues to unfold.",
      "publishedAt": "2023-10-20T15:36:58Z",
      "title": "Hunter Biden prosecutor to appear for closed-door congressional testimony, AP sources say",
      "url": "https://apnews.com/0c8293f6da55859d4409fa9b668256f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ba717f106304421bbbbe625213825c0/2160.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Charles Nahale spent a restless night trying to sleep in the back seat of his pickup truck after a wildfire destroyed his home and the town of Lahaina. The next two nights weren’t much better: The singer and guitarist put his feet on one chair and sat in another as he took refuge on the grounds of an evacuated hotel where he once performed for guests.",
      "publishedAt": "2023-10-21T04:05:12Z",
      "title": "Evacuees live nomadic life after Maui wildfire as housing shortage intensifies and tourists return",
      "url": "https://apnews.com/5a43b95a20e17dd3679c6ebc580994c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20d0e9b11db740cfb2ef2f5651d189ed/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former President Donald Trump was fined $5,000 on Friday after his disparaging social media post about a key court staffer in his New York civil fraud trial lingered on his campaign website for weeks after the judge ordered it deleted.",
      "publishedAt": "2023-10-20T15:49:49Z",
      "title": "Judge fines Donald Trump $5,000 after post maligning court staffer is found on campaign website",
      "url": "https://apnews.com/ce593e3ee07d95bb6ec7e2de23f47dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e347e05267f4d2aa4e5a02f1b0b5386/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Lawyer Kenneth Chesebro pleaded guilty to a felony on Friday just as jury selection was getting underway in his trial on charges accusing him of participating in efforts to overturn Donald Trump’s loss in the 2020 election in Georgia.",
      "publishedAt": "2023-10-20T04:49:01Z",
      "title": "Lawyer Kenneth Chesebro pleads guilty over efforts to overturn Trump’s 2020 loss in Georgia",
      "url": "https://apnews.com/2e558eefdffd9c1eaa7ec8c31bf76044",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7f5f5adef4f45d0a731ac7ea8b31cc2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}