{
  "articles": [
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has signed an order to impose stiff tariffs on imports from Mexico, Canada and China, fulfilling a campaign promise but raising the prospect of trade conflict and increased prices for American consumers. Trump is declaring an economic emergency to put duties of 10% on all imports from China and 25% on imports from Mexico and Canada — America’s largest trading partners — except for a 10% rate on Canadian oil. The White House said Trump’s order also includes a mechanism to escalate the rates if the countries retaliate against the U.S., as they have threatened. Trump says the tariffs are to force the countries to do more to stop the flow of fentanyl into the U.S.",
      "publishedAt": "2025-02-01T14:14:28Z",
      "title": "Trump imposes tariffs on Canada, Mexico and China. Costs could increase",
      "url": "https://apnews.com/article/trump-tariffs-trade-china-mexico-canada-inflation-753a09d56cd318f2eb1d2efe3c43b7d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/0499847/2147483647/strip/true/crop/5693x3202+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fdc%2F71958bfcb7bbe0e661ff76295985%2Fe7084f207c594f52bd23eb152e93ad59"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "Tariffs are in the news at the moment. But what are they? Tariffs are typically charged as a percentage of the price a buyer pays a foreign seller. In the United States, tariffs are collected by Customs and Border Protection agents at 328 ports of entry across the country. Tariffs can be lower for countries with which the United States has trade agreements. For example, most goods can move among the United States, Mexico and Canada tariff-free because of Trump’s US-Mexico-Canada trade agreement. Mainstream economists are generally skeptical of tariffs.",
      "publishedAt": "2025-01-27T21:14:33Z",
      "title": "What are tariffs and how do they work?",
      "url": "https://apnews.com/article/economy-import-tariff-fce31b5c5c9f058ff09353c6846b1cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/64acfc1/2147483647/strip/true/crop/3896x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc3%2F52815690e03dea84bf89947478b0%2F6f880352f5454645926c54a604717a52"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "President Donald Trump said this week that tariffs on U.S. neighbors Canada and Mexico will arrive Saturday. The two nations are not only close geographically, but economically as well. The business between the North American nations now exceeds China, totaling $1.8 trillion in 2023. That is far greater than the $643 billion in commerce that the U.S. did with China in that same year. Following are just a few imported goods that could be hit first.",
      "publishedAt": "2025-01-31T12:43:44Z",
      "title": "Trump tariffs on Mexico and Canada could land this weekend. Here are some goods in the crosshairs",
      "url": "https://apnews.com/article/america-canada-mexico-tariffs-trump-trade-4568dababcf524945333bb518232ec4b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a386812/2147483647/strip/true/crop/2250x1266+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F21%2F20ffe7a55af9fab7724a337e6938%2F6da0acf14de24a4581f40a4d9fe979a2"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "From an ice cream parlor in California to a medical supply business in North Carolina to a T-shirt vendor outside Detroit, U.S. businesses are bracing to take a hit from the taxes President Donald Trump imposed Saturday on imports from Canada, Mexico and China, America’s three biggest trading partners. The levies — 25% on Canadian and Mexican and 10% on Chinese goods — will take effect Tuesday. Canadian energy, including oil, natural gas and electricity, will be taxed at a lower 10% rate. Trump’s tariffs threaten to raise prices for consumers and is already provoking retaliation from Canada and Mexico.",
      "publishedAt": "2025-02-02T05:01:06Z",
      "title": "US businesses brace for Trump's tariffs on Canada, Mexico and China to drive up costs",
      "url": "https://apnews.com/article/trump-tariffs-china-mexico-canada-inflation-economy-69bd5b4f66eeef3e0e803e0595888f23",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd1320f/2147483647/strip/true/crop/7237x4071+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F45%2Fdae7d2c291828d0d794ce26a4a9a%2F905feae4113e4725bdac9fe31f154e4c"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has fired the director of the Consumer Financial Protection Bureau, Rohit Chopra, in the latest purge of a Biden administration holdover. Chopra was one of the more important regulators from the previous Democratic administration who was still on the job since Trump took office on Jan. 20. Chopra's tenure saw the removal of medical debt from credit reports and limits on overdrafts penalties. But many in the financial industry saw his actions as regulatory overreach. In a social media post Saturday about his departure, Chopra thanked people across the country who “shared their ideas and experiences” with the government’s consumer financial watchdog agency.",
      "publishedAt": "2025-02-01T15:02:01Z",
      "title": "Trump fires Rohit Chopra, Consumer Financial Protection director",
      "url": "https://apnews.com/article/trump-chopra-consumer-financial-protection-bureau-47b6b39d0eff05ea0c9bca4eacf55b79",
      "urlToImage": "https://dims.apnews.com/dims4/default/adf44fa/2147483647/strip/true/crop/4492x2527+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fcc%2Fca46e581bf177cbdb8d65fca1903%2F123c1c9d2b4c4d5ea8a4cb5e61afa7b3"
    },
    {
      "author": null,
      "description": "The Premier of Canadian province of British Columbia, David Eby, called on residents to stop buying liquor from U.S.",
      "publishedAt": "2025-02-02T03:32:30Z",
      "title": "Premier of British Columbia urges Canadians to boycott U.S. alcohol",
      "url": "https://apnews.com/video/premier-of-british-columbia-urges-canadians-to-boycott-u-s-alcohol-b00ef1dc99e643da88e25a99775ef5ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8eb3ca/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fdf%2F4b05b9f07a5f85755e8540e3c390%2Fcan-us-tariffs-liquor-20250202cr-1920x1080.jpg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "Israeli Prime Minister Benjamin Netanyahu says he will discuss “victory over Hamas,” countering Iran and expanding diplomatic relations with Arab countries in his meeting with U.S. President Donald Trump. Tuesday’s meeting at the White House will be Trump’s first with a foreign leader since returning to office. It comes as U.S. and Arab mediators begin the daunting work of brokering the next phase of an agreement to wind down the war in the Gaza Strip and release dozens of militant-held hostages. Hamas, which has quickly reasserted its control over Gaza since the ceasefire took hold last month, has said it will not release many of the remaining hostages without an end to the war.",
      "publishedAt": "2025-02-02T08:38:33Z",
      "title": "Israel's Netanyahu heads to US to discuss 'victory over Hamas' with Trump",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-02-2025-90db60e88f955a8bb57cb05e99d574d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d1bd4d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Fd0%2F2669a80f6a2e87da6f76ad67c882%2F077ad72274e44af2ad5ccd296f42fa40"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Officials say preliminary data from the midair crash between an airliner and an Army helicopter showed conflicting indications about the aircrafts’ altitudes when they collided near a Washington, D.C., airport, killing everyone aboard. National Transportation Safety Board officials say data from the jet’s flight data recorder showed its altitude at 325 feet, plus or minus 25 feet, when the crash happened Wednesday night. However data in the control tower showed the Black Hawk helicopter at 200 feet. The roughly 100-foot discrepancy has yet to be explained.",
      "publishedAt": "2025-02-01T17:30:27Z",
      "title": "Recovery crews return to the Potomac debris after deadly DC air crash",
      "url": "https://apnews.com/article/washington-plane-crash-helicopter-recovery-980dcaf1acb6f80260146edbaaa9e4c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/3281097/2147483647/strip/true/crop/5683x3197+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F9f%2F27a95e69142f511dc403b5064245%2F7d5daaf4b780420cac0fb5ae47d4880f"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "The Department of Government Efficiency, run by President Donald Trump’s billionaire adviser and Tesla CEO Elon Musk, has gained access to sensitive Treasury data including Social Security and Medicare customer payment systems. That's according to two people familiar with the situation. DOGE, which is assigned to find ways to reduce federal workers, cut programs and slash federal regulations, would have wide leeway to access important taxpayer data, among other things. Senate Finance Committee member Ron Wyden, an Oregon Democrat, sent a letter to Treasury Secretary Scott Bessent on Friday. He expressed concern that “officials associated with Musk may have intended to access these payment systems to illegally withhold payments to any number of programs.”",
      "publishedAt": "2025-02-02T02:16:27Z",
      "title": "Elon Musk's DOGE commission gains access to sensitive Treasury payment systems: AP sources",
      "url": "https://apnews.com/article/donald-trump-elon-musk-doge-treasury-5e26cc80fcb766981cea56afd57ae759",
      "urlToImage": "https://dims.apnews.com/dims4/default/792a1ee/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F4b%2F2a922679318da2b2fe1757712380%2F43fb2bae60ee400097258000820369c5"
    },
    {
      "author": null,
      "description": "Competing claims have emerged over a deadly attack on a boarding school in Sudzha, a city in Russia’s Kursk region that has been under Ukrainian control for five months. The Ukrainian military reported four deaths and four people seriously injured, with over 80 people rescued from the rubble. Ukrainian President Zelenskyy said the attack was a Russian airstrike on a school where civilians were sheltering and preparing to evacuate. However, Russia’s Ministry of Defense blamed Ukraine, claiming missiles were launched from Ukraine’s Sumy region. Meanwhile, the death toll from a Russian missile strike on an apartment building in Poltava rose to 12, including two children.",
      "publishedAt": "2025-02-02T08:54:35Z",
      "title": "Russia and Ukraine trade blame over an attack on a boarding school in Russia’s Kursk region",
      "url": "https://apnews.com/article/kursk-drone-russia-ukraine-war-poltava-8da14dd5034dad22f8e8df047b2601bf",
      "urlToImage": "https://dims.apnews.com/dims4/default/7046181/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F24%2Fe633014013ffbf662e1721f67d55%2F31e21be780e147bd87fa3766f16dc271"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}