{
  "articles": [
    {
      "author": "WAFAA SHURAFA, FATMA KHALED and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops stormed one of the last hospitals operating in northern Gaza on Friday, igniting fires and forcing many staff and patients outside to strip in winter weather, the territory’s health ministry said.",
      "publishedAt": "2024-12-27T13:40:45Z",
      "title": "Israeli troops burn northern Gaza hospital after forcibly removing staff and patients, officials say",
      "url": "https://apnews.com/5bfab932afc29ce2205765ce1416a808",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94639035cd6c4f48ab25d60f00946f83/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Azerbaijani minister suggested Friday that an airliner that crashed this week was hit by a weapon, citing expert analysis and survivor testimony indicating that the plane was struck from the outside.",
      "publishedAt": "2024-12-27T11:43:21Z",
      "title": "Azerbaijani minister says plane that crashed was hit from the outside, possibly by a weapon",
      "url": "https://apnews.com/f23c1bb34a3c6911be5d00ae8fdccbdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1a070c9fa06491b8a758416a55ed2a4/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Artificial intelligence. Abortion. Guns. Marijuana. Minimum wages. Name a hot topic, and chances are good there's a new law about it taking effect in 2025 in one state or another. Many of the laws launching in January are a result of legislation passed this year.",
      "publishedAt": "2024-12-27T05:11:50Z",
      "title": "New 2025 laws hit hot topics from AI in movies to rapid-fire guns",
      "url": "https://apnews.com/b7df7562069cf99147dd7e6d957676db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/301d1873d20c49149c178a883399f912/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR and KIMBERLEE KRUESI",
      "description": "MEMPHIS, Tenn. (AP) — Taylor Cagnacci moved from California to Tennessee with hopes of starting a new chapter in a state that touts a low cost of living and natural beauty. But she's infuriated by Tennessee's meager social services, which leave her and many other moms struggling in a state where abortion is banned with limited exceptions.",
      "publishedAt": "2024-12-27T13:36:36Z",
      "title": "In states that ban abortion, social safety net programs often fail families",
      "url": "https://apnews.com/2a67e38c0d523a008ec8e1b173b67297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/780d725e85ca434d916e2888b26fc43a/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — A court in China has sentenced a man to death for killing 35 people last month by driving into a crowd, in an attack that raised national concern about mass killings.",
      "publishedAt": "2024-12-27T13:09:28Z",
      "title": "Chinese man sentenced to death for killing 35 people after driving into a crowd",
      "url": "https://apnews.com/532cf8651cc13a036771b83da03f0e44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87af8c329d454fcf9aca588475a805c8/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — The Chinese government placed sanctions on seven companies on Friday in response to recent U.S.",
      "publishedAt": "2024-12-27T11:58:38Z",
      "title": "China sanctions 7 companies over US military assistance to Taiwan",
      "url": "https://apnews.com/33e27d5389740e4a1f6c2f1ff7381931",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7273c5906df4f1092d0096f2aab69bd/3000.jpeg"
    },
    {
      "author": "CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — The man accused of burning a sleeping woman to death inside a New York City subway train has been indicted on murder and arson charges, a prosecutor said on Friday, as authorities continue working to confirm the victim's identity.",
      "publishedAt": "2024-12-27T05:02:22Z",
      "title": "Man indicted in burning death of woman inside a New York City subway train, prosecutors say",
      "url": "https://apnews.com/ba86c7c219012529b31a0dd0298d7cd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f8c3ff347b5483e954d17ecd1ae9ef6/2541.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition-controlled National Assembly voted Friday to impeach acting President Han Duck-soo despite vehement protests by governing party lawmakers, further deepening the country’s political crisis set off by President Yoon Suk Yeol’s stunning imposition of martial law and ensuing impeachment.",
      "publishedAt": "2024-12-27T07:47:17Z",
      "title": "South Korea's opposition-controlled National Assembly votes to impeach acting President Han",
      "url": "https://apnews.com/0276374e86e88d9a97c7c2a06d9fabfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61b1d160ea1d4c4a90ef1c26e71055b2/1920.jpeg"
    },
    {
      "author": "JACK THOMPSON",
      "description": "FREETOWN, Sierra Leone (AP) — Lahai Makieu struck the bamboo with a machete until it cracked and fell. Balancing on his crutch, he reached to pick it up. But colleagues pulled the bamboo's other end, and he tumbled into the dense grass.",
      "publishedAt": "2024-12-27T05:43:08Z",
      "title": "'We fall and we rise': Some amputees in Sierra Leone turn to farming to combat discrimination",
      "url": "https://apnews.com/fbfc1253ac6c3d66026de08180837d09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8a76774dba04e5181e55347d0788935/3000.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "People around the world suffered an average of 41 extra days of dangerous heat this year because of human-caused climate change, according to a group of scientists who also said that climate change worsened much of the world's damaging weather throughout 2024.",
      "publishedAt": "2024-12-27T05:04:20Z",
      "title": "Climate change added 41 days of dangerous heat around world in 2024",
      "url": "https://apnews.com/06157ede7ea4a22ea6431f135cda275f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33ee6a5ddbd94e649a2522c723bd8827/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}