{
  "articles": [
    {
      "author": "STEPHANY MATAT, ERIC TUCKER, TERRY SPENCER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WEST PALM BEACH, Fla. (AP) — The man suspected in an apparent assassination attempt targeting Donald Trump camped outside a Florida golf course with food and a rifle for nearly 12 hours, lying in wait for the former president before a Secret Service agent thwarted the potential attack and opened fire, according to court documents filed Monday.",
      "publishedAt": "2024-09-16T14:52:04Z",
      "title": "Suspect in apparent assassination attempt on Trump was near golf course for 12 hours, records show",
      "url": "https://apnews.com/fee81d8bcf737bfcde2ee8e5cea88465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66c61c9cca7c4c29bb713eae3d89bf53/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, AUDREY McAVOY, BERNARD CONDON and MICHAEL R. SISAK",
      "description": "KAAAWA, Hawaii (AP) — Ryan Wesley Routh portrayed himself online as a man who built housing for homeless people in Hawaii, tried to recruit fighters for Ukraine to defend itself against Russia, and described his support and then disdain for Donald Trump — even urging Iran to kill him.",
      "publishedAt": "2024-09-16T13:47:19Z",
      "title": "Man who appeared intent on killing Trump wrote a book urging Iran to assassinate the ex-president",
      "url": "https://apnews.com/f76ed09f256f6bd21727a10901d92af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a7e29ac38c344589ba6d0bf450c316e/2187.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — Hours after an apparent attempt on Donald Trump's life over the weekend, Elon Musk took to his social platform X to post a thinking emoji and a comment that “no one is even trying to assassinate” the Democratic president and vice president.",
      "publishedAt": "2024-09-17T04:02:03Z",
      "title": "Elon Musk has often inflamed politically tense moments, raising worries for the US election",
      "url": "https://apnews.com/3479f2348f6ec47ce641ddf20fd6ce4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57655d7624c4b6e81858ec67bedeb50/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.S. ambassador to the United Nations on Monday accused Israel’s military of striking schools, humanitarian workers and civilians in Gaza in a sign of growing American frustration with its close ally as the war approaches its first anniversary.",
      "publishedAt": "2024-09-17T01:52:48Z",
      "title": "US airs frustration with Israel's military about strikes in Gaza",
      "url": "https://apnews.com/c28906d65480c177b641a8e6676e80fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f98ceff7869845ccb88f3f3924aa3733/3000.jpeg"
    },
    {
      "author": "AIJAZ HUSSAIN",
      "description": "SRINAGAR, India (AP) — In Indian-controlled Kashmir, many people boycotted elections for decades in protest against Indian rule. But in the run-up to the local election beginning Wednesday, many are willing to buck that trend and use their vote to deny Prime Minister Narendra Modi’s party the power to form a local government in the disputed region.",
      "publishedAt": "2024-09-17T04:08:11Z",
      "title": "Large turnout is expected in a crucial vote for local government in Indian-controlled Kashmir",
      "url": "https://apnews.com/4493b9cd496de1aadf1cddcb6194043d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/550a6292f20a46fd8d8a3ff279c88afa/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON, MICHAEL R. SISAK and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Sean “Diddy\" Combs, the hip-hop mogul who has faced a stream of allegations by women accusing him of sexual assault, was arrested late Monday in New York after he was indicted by a federal grand jury.",
      "publishedAt": "2024-09-17T02:24:17Z",
      "title": "Sean 'Diddy' Combs is arrested in New York after federal indictment",
      "url": "https://apnews.com/93831d646c5cf36add77a91ba668ae84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/314bffdcfb894d1f81953e4f898ac492/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "DEER PARK, Texas (AP) — A towering flame gradually subsided Tuesday morning in the aftermath of a massive pipeline explosion after a vehicle drove through a fence and struck an above-ground valve, officials said.",
      "publishedAt": "2024-09-16T16:09:12Z",
      "title": "Massive pipeline fire burning near Houston began after a vehicle struck a valve, officials say",
      "url": "https://apnews.com/659141b9f88ed2b324c36fce2735746f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aaa86d1a39d49e7b8d6999f0e65d805/1920.jpeg"
    },
    {
      "author": null,
      "description": "LIMA, Peru (AP) — Wildfires in Peru have left at least 15 dead and more than 3,000 hectares (11.58 square miles) of cultivated land and natural areas scorched, authorities said Monday.Prime Minister Gustavo Adrianzén told reporters that the fires were started by human activity and that 22 of the 24 regions that make up the country have active outbreaks.",
      "publishedAt": "2024-09-17T02:42:09Z",
      "title": "At least 15 dead and thousands hectares scorched as wildfires sweep Peru",
      "url": "https://apnews.com/c96e54eac09cfd25b5baaa2863660901",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49e7976109c7455698d583795ffe639c/1920.jpeg"
    },
    {
      "author": "PATRICK AFTOORA ORSAGOS and MICHAEL RUBINKAM",
      "description": "SPRINGFIELD, Ohio (AP) — Ohio state police will help protect schools in a city at the center of a political furor over Haitian migrants, the governor announced Monday, while local officials canceled an annual celebration of cultural diversity in the fallout over former President Donald Trump’s false claims about pet-eating.",
      "publishedAt": "2024-09-16T19:24:19Z",
      "title": "Ohio state police to protect schools after furor over Haitian immigrants in Springfield",
      "url": "https://apnews.com/d74b7ff56f9a45d9389d8ebee4af1652",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7439ef4487264272b7c56bfa3efbd4e3/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "A key employee who labeled an experimental submersible unsafe prior to its last, fatal voyage was set to testify Tuesday before U.S.",
      "publishedAt": "2024-09-17T05:02:12Z",
      "title": "A key employee who called the Titan unsafe will testify before the Coast Guard",
      "url": "https://apnews.com/3e698a31c32d753b2d34e28900f65bdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09e9b85a166542bc82f7abc7b1eec366/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}