{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, TIA GOLDENBERG and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel and Hamas agreed to a four-day cease-fire in the war in Gaza — a diplomatic breakthrough that will free dozens of hostages held by militants as well as Palestinians imprisoned in Israel, and bring a large influx of aid to the besieged territory.",
      "publishedAt": "2023-11-22T06:55:51Z",
      "title": "Israel and Hamas call a truce to free hostages in swap for prisoners, and allow more aid into Gaza",
      "url": "https://apnews.com/d12c1728cbae0ff74a69cc9cc3e8a646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ac2275ad40842068d67d36e931a8dee/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — A temporary cease-fire agreement to facilitate the release of dozens of people taken hostage during Hamas’ raid on Israel is expected to bring the first respite to war-weary Palestinians in Gaza and a glimmer of hope to the families of the captives.",
      "publishedAt": "2023-11-22T08:21:14Z",
      "title": "Israel and Hamas have reached a deal on a cease-fire and hostages. What does it look like?",
      "url": "https://apnews.com/af1cfbc9dcaa1485ed7a9efaca7ec2b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d4332f1672e42fd8538bd27dd600a5f/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea said North Korea fired a ballistic missile toward the sea but the launch likely failed Wednesday night, hours after Seoul said it would resume front-line aerial surveillance in response to the North’s spy satellite launch.",
      "publishedAt": "2023-11-22T05:41:12Z",
      "title": "South Korea says North Korea fired a ballistic missile toward the sea but the launch likely failed",
      "url": "https://apnews.com/c3aa2c541387616ad153a1562aa018da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e8dd0d103d44029b1573e873fc1f1a3/2083.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "The late crush of holiday travelers is picking up steam, with about 2.7 million people expected to board flights on Wednesday and millions more planning to drive or take the train to Thanksgiving celebrations.",
      "publishedAt": "2023-11-22T05:06:39Z",
      "title": "Record Thanksgiving travel rush off to a smooth start despite snowy forecast",
      "url": "https://apnews.com/7858946c4d16fdf4291a66d82ea91ac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5aad664ce4c43068bd9795a6e5c4c37/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NIAGARA FALLS, N.Y. (AP) — A vehicle exploded at a checkpoint on the American side of a U.S.-Canada bridge in Niagara Falls Wednesday, prompting the closing of four border crossings in the area, authorities said.",
      "publishedAt": "2023-11-22T18:36:22Z",
      "title": "Border crossings closed after vehicle explosion on bridge connecting New York and Canada",
      "url": "https://apnews.com/4e8f9bfeabd94a0d8aa4d96eccd179b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9f39c738ede405a922df10272fa2999/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "The ousted leader of ChatGPT maker OpenAI will return to the company that fired him just days ago, concluding a short but chaotic power struggle that shocked the tech industry and underscored the conflicts around how to safely build artificial intelligence.",
      "publishedAt": "2023-11-22T06:35:59Z",
      "title": "OpenAI brings back Sam Altman as CEO just days after his firing unleashed chaos",
      "url": "https://apnews.com/31187f7f6eca8ff9d0eef7585aac6ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf2e7a6d4d0042ec9d95035cf5a2052a/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Just minutes after President John F. Kennedy was fatally shot as his motorcade rolled through downtown Dallas, Associated Press reporter Peggy Simpson rushed to the scene and immediately attached herself to the police officers who had converged on the building from which a sniper's bullets had been fired.",
      "publishedAt": "2023-11-22T05:04:31Z",
      "title": "JFK assassination remembered 60 years later by surviving witnesses to history, including AP reporter",
      "url": "https://apnews.com/822f26b3a850508fb1e6530b86ebf809",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2984e3d46adc425ba6f469e6d66a2306/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Jehovah's Witnesses are well-known for proselytizing door-to-door and handing out their literature on city streets.",
      "publishedAt": "2023-11-22T13:12:14Z",
      "title": "Timekeepers no more, rank-and-file Jehovah's Witnesses say goodbye to tracking proselytizing hours",
      "url": "https://apnews.com/2d1320da659a8a3dae4b136b55882e19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/316f836d4fa949ee8e25e04d71750704/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Impossible is often just a starting point on a Christopher Nolan film and “Oppenheimer,”about the father of the atomic bomb, was no exception.",
      "publishedAt": "2023-11-22T14:50:27Z",
      "title": "The 'Oppenheimer' creative team take you behind the scenes of the film's key moments",
      "url": "https://apnews.com/500369cc4a5e7ba1a22635b0a2f358e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d4785732ff84d138b2549790761f561/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "Boo Williams wakes up each morning not knowing how the pain will hit. It could be debilitating headaches that make it impossible to get out of bed. Sometimes the pain shoots down his neck. Through all of it, he's angry.",
      "publishedAt": "2023-11-22T11:01:35Z",
      "title": "NFL disability program leaves retired Saints tight end hurting and angry",
      "url": "https://apnews.com/c69476ec32f55f678d3748fc471daef2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1bcac03d9c64156a42f08f0b7517c10/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}