{
  "articles": [
    {
      "author": "NAJIB JOBAIN and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — Gaza’s southernmost town, Rafah, is bursting at the seams. Nearly the last place spared an Israeli offensive so far, Rafah's population has more than quintupled with Palestinians streaming in to escape fighting.",
      "publishedAt": "2024-02-09T20:38:19Z",
      "title": "Israel's next target in Gaza war is likely Rafah. Terrified people say there's nowhere left to go",
      "url": "https://apnews.com/90bf78cfca6550dc229e7192f6724dfc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33faba8fdd7e4a8db7c45ed164a3ec40/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, NAJIB JOBAIN, and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Friday said he has ordered the military to prepare a plan to evacuate civilians from Rafah ahead of an expected Israeli invasion of the densely populated southern Gaza city.",
      "publishedAt": "2024-02-09T08:30:07Z",
      "title": "Israel seeks to evacuate Palestinians jammed into a southern Gaza city ahead of an expected invasion",
      "url": "https://apnews.com/d3229eec6a85c071248d3ddc2de2a73e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c2973f55cce40e6904c0b5553987a62/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Pakistan on Saturday hit back at criticism over the conduct of its parliamentary elections, which were held amid sporadic militant attacks and an unprecedented stoppage of all mobile phone services.",
      "publishedAt": "2024-02-10T09:27:27Z",
      "title": "Pakistan hits back at criticism of election conduct and insists cellphone curbs were necessary",
      "url": "https://apnews.com/7c49e2374041ef6a8b626531f71dd6ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40d2591a603242fdbccfe94efd4b0813/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "LAHORE, Pakistan (AP) — Pakistan held parliamentary election l ast Thursday, with 44 parties fighting for a share of 266 seats in the National Assembly, or lower house of parliament.",
      "publishedAt": "2024-02-10T09:07:55Z",
      "title": "Delays, deals, nepo babies, trends and vote rigging: Five takeaways from Pakistan’s elections",
      "url": "https://apnews.com/c6b70984767161ae17b12778452258f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a42ba9bb3304bb49fb6c4ecb3dbac76/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "People across Asia welcomed the Lunar New Year on Saturday with family gatherings, festivals and temple visits to ask for blessings.The Lunar New Year is the most important annual holiday in China, a time for reunions with relatives and friends and to enjoy festive feasts.",
      "publishedAt": "2024-02-10T07:31:55Z",
      "title": "AP PHOTOS: Asia welcomes Lunar New Year of the Dragon with temple visits and celebrations",
      "url": "https://apnews.com/248ff857171fc6bc5aa3d70a00663b0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d986286dc8a40ac97fe132d738f25ac/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden's Democratic allies are launching an aggressive defense against a special counsel's explosive claims that the 81-year-old president couldn't remember major milestones in his life, trying to diminish the significance of the prosecutor's allegations that Biden was too forgetful to be charged for mishandling classified material.",
      "publishedAt": "2024-02-10T05:02:09Z",
      "title": "How Biden and his allies are pushing back against a special counsel's claims about his memory",
      "url": "https://apnews.com/a54f03441e8145f9d6915858caaac37e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/174d01734c0b4b8084b83b33183f2e91/1920.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "TOKYO (AP) — Will she make it?Taylor Swift's last song will still be ringing in the ears of thousands of fans at the Tokyo Dome on Saturday night when the singer is expected to rush to a private jet at Haneda airport that will take her on a time-zone-spanning journey to see her boyfriend, NFL star Travis Kelce, play in the Super Bowl in Las Vegas.",
      "publishedAt": "2024-02-10T09:09:03Z",
      "title": "Taylor Swift prepares for an epic journey to the Super Bowl. Will she make it?",
      "url": "https://apnews.com/13248c81324a4da46df425f0e6a7654c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/219d2715f4924cca8ea5570ede608c37/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — With a broad smile on his face, Jakarta city council candidate Rian Ernest answers almost every question about his faith with the same line.“I’m Christian, but my wife and children are Muslims, so pray for me to get the guidance,\" Ernest said.",
      "publishedAt": "2024-02-10T07:06:27Z",
      "title": "As Indonesia goes to the polls, women and minority candidates face challenges",
      "url": "https://apnews.com/7a5b3bf50fd1a199d530b2e7d8e8da03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62573f5c1e4b447c953417eb78bbe6ed/3000.jpeg"
    },
    {
      "author": null,
      "description": "NAPLES, Fla. (AP) — Two people have died after a small plane attempted to make an emergency landing on Interstate 75 in southwest Florida on Friday afternoon, colliding with a vehicle and bringing traffic to a halt as a massive plume of black smoke rose into the air.",
      "publishedAt": "2024-02-09T21:16:30Z",
      "title": "2 people dead after small plane attempts emergency landing on southwest Florida interstate",
      "url": "https://apnews.com/e619a4b96a7d0dcd14036fecae6f9ccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c435fc142c5d416688b01c275c6947b2/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — A magnitude 5.7 earthquake struck the world’s largest active volcano on Friday — Mauna Loa on the Big Island of Hawaii — knocking items off shelves and cutting power in a nearby town but not immediately prompting reports of serious damage.",
      "publishedAt": "2024-02-09T20:25:26Z",
      "title": "Magnitude 5.7 earthquake strikes Mauna Loa volcano on Hawaii's Big Island; no major damage reported",
      "url": "https://apnews.com/eaba3c465f0fd3269372c785e27f117f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64fb00dfff93402c8f2bc80955705bdb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}