{
  "articles": [
    {
      "author": null,
      "description": "Health officials in Gaza say Israeli strikes have killed at least 34 Palestinians. The bloodshed comes a day after Israel eased aid restrictions due to a worsening humanitarian crisis. On Sunday, Israel announced a pause in military operations in certain areas for 10 hours daily to improve aid flow. Despite these measures, Israel continues military operations outside the pause timeframe. Aid agencies welcomed the new measures but say they are insufficient. Images of emaciated children have sparked global outrage. Most of Gaza's population now relies on aid and accessing food has become increasingly dangerous.",
      "publishedAt": "2025-07-28T09:01:28Z",
      "title": "Israeli strikes in Gaza kill at least 34 people as some aid restrictions are eased",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-28-2025-7586cb243643b9a875f87624277127b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef65979/2147483647/strip/true/crop/3916x2203+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fd7%2Fb5304ad9ad45e009cf92dd6d990a%2F3f92071cce3b41a5a579f0cf915b65f4"
    },
    {
      "author": null,
      "description": "The U.N. General Assembly is bringing high-level officials together to promote a two-state solution to the decades-old Israeli-Palestinian conflict. Israel and its close ally the United States are boycotting the meeting, which will be co-chaired by the foreign ministers of France and Saudi Arabia. Israel’s right-wing government opposes a two-state solution, and the United States has called the meeting “counterproductive” to its efforts to end the war in Gaza. France and Saudi Arabia want the meeting to put a spotlight on the two-state solution, which they view as the only viable road map to peace, and to start addressing the steps to get there.",
      "publishedAt": "2025-07-28T04:07:56Z",
      "title": "What to expect at UN meeting on an Israel-Palestinian two-state solution",
      "url": "https://apnews.com/article/un-meeting-palestinians-twostate-israel-conflict-us-1ca1c5953ca31f76682276fa024a381b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef65979/2147483647/strip/true/crop/3916x2203+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fd7%2Fb5304ad9ad45e009cf92dd6d990a%2F3f92071cce3b41a5a579f0cf915b65f4"
    },
    {
      "author": null,
      "description": "Thai and Cambodian leaders are meeting in Malaysia to resolve deadly border clashes. The fighting, which began last Thursday after a land mine explosion injured Thai soldiers, has killed at least 35 people and displaced over 260,000 people. Both countries have recalled their ambassadors, and Thailand has closed border crossings with Cambodia. The meeting Monday follows direct pressure from U.S. President Donald Trump, who has warned the United States may not proceed with trade deals with either country if hostilities continue. Before departing for Kuala Lumpur, Thailand's acting prime minister said the key focus would be on an immediate ceasefire, but noted trust could be an issue.",
      "publishedAt": "2025-07-28T05:11:54Z",
      "title": "Thai and Cambodian leaders hold ceasefire talks in Malaysia",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-ceasefire-talks-6d8cc517df1be1ad0bf911fe1c81c765",
      "urlToImage": "https://dims.apnews.com/dims4/default/84ccd74/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F86%2Feec0aead47d30cb3f4a989dc4bcb%2F764bc5e56e414855af69fd744335f2d1"
    },
    {
      "author": null,
      "description": "British Prime Minister Keir Starmer is meeting with President Donald Trump at his family's golf property in Scotland. During Monday's talks, Starmer plans to urge Trump to press Israel to allow more aid into Gaza amid an increasingly desperate humanitarian crisis there. He'll also push for a ceasefire in the Israel-Hamas war. Trump has been more focused on the U.S. getting credit for arragning food aid to Gaza. Starmer is further aiming to promote peace efforts in Russia’s war with Ukraine. Trade issues are likely to be a common ground. Despite ongoing challenges, Starmer's efforts to maintain a positive relationship with Trump seem to be working.",
      "publishedAt": "2025-07-28T04:01:44Z",
      "title": "As Trump shows off his golf courses for Britain's leader, crisis in Gaza looms",
      "url": "https://apnews.com/article/trump-scotland-starmer-golf-course-trade-cf9ebbfb9cb2614ec59f0de67d3fd5fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8c8dd6/2147483647/strip/true/crop/8011x4506+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F51%2Fa3306dadca9c0ab1fc3df1e44fcc%2Ff96d4403176e4dc79683c0a7d8730704"
    },
    {
      "author": null,
      "description": "A gunman has shot and killed five people at a popular fresh food market in the Thai capital before killing himself. The incident happened on Monday, according to police. The victims included security guards at the Or Tor Kor Market. The Erawan Medical Center reported that two women were also wounded. The market, located next to the Chatuchak weekend Market, is popular with Thai and foreign tourists. A video circulating online reportedly showed the shooter wearing a baseball cap and shorts walking in the market with a backpack strapped to his chest and a handgun in his right hand.",
      "publishedAt": "2025-07-28T08:33:18Z",
      "title": "Gunman kills 5 and wounds 2 at a Bangkok market before killing himself, police say",
      "url": "https://apnews.com/article/thailand-shooting-chatuchak-market-gunman-401be828624e8ca93a6eb33a54cdd4df",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee3f852/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F60%2Fa9cb1409625ef45be952332747bd%2Ftha-shooting-20250728i-autocr-1920x1080.jpg"
    },
    {
      "author": null,
      "description": "Michigan authorities say 11 people have been stabbed at a Walmart in Traverse City. Authorities say a suspect is in custody and that investigators believe those hurt Saturday were not specifically targeted. The Grand Traverse County Sheriff's Office says that around 4:45 p.m., a 42-year-old man entered the store and used a folding knife to stab 11 people. The sheriff's office says a deputy arrived within minutes and took the man into custody. It also says that people in the store helped apprehend the suspect and treat victims. Munson Healthcare said six of the victims were in critical condition and five in serious condition.",
      "publishedAt": "2025-07-27T12:09:04Z",
      "title": "A man accused of stabbing 11 people at a Walmart is in Michigan authorities' custody",
      "url": "https://apnews.com/article/walmart-stabbing-michigan-341fb14f1bc715243b3780a3d7eabda0",
      "urlToImage": "https://dims.apnews.com/dims4/default/91d2d9c/2147483647/strip/true/crop/6681x3758+0+348/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F31%2F5097567d01dc15766bae541376a1%2F356cab7c940a42539bc931d4b61f16fe"
    },
    {
      "author": null,
      "description": "A former Ukrainian prisoner of war has embraced life with urgency since his release in April. In one week, Stanislav Tarnavskyi proposed to his girlfriend, bought an apartment and adopted a puppy. Tarnavskyi spent three years in Russian captivity, enduring trauma that still haunts him through nightmares and flashbacks. He credits his fiancée and therapy for helping him heal, though recovery remains a challenge. Experts stress the importance of long-term care for ex-POWs, who often face PTSD, depression, and physical scars. Another former POW, Denys Zalizko, finds solace in music and fitness, channeling his pain into dreams of becoming an artist.",
      "publishedAt": "2025-07-28T04:31:00Z",
      "title": "A former POW in Russia rebuilds his life in Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-pow-ptsd-trauma-2e78bd40e001f7b5785212e5c094467a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e7a59e/2147483647/strip/true/crop/5639x3172+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F65%2Ff97018641be697056b78eb4e3998%2F2e9422f056fe4287a66a9f4b832edbc5"
    },
    {
      "author": null,
      "description": "World stock markets have advanced after the European Union forged a trade deal with the Trump administration. U.S. futures and oil prices also were higher ahead. The EU's agreement with U.S. President Donald Trump sets tariffs on most EU exports to the U.S. at 15%. Trade talks between U.S. and Chinese officials were being held in Stockholm, Sweden on Monday. On Friday, the S&P 500 climbed 0.4% to set an all-time high for the fifth time in a week. The Dow Jones Industrial Average rose 0.5%, and the Nasdaq composite added 0.2% to its own record set the day before.",
      "publishedAt": "2025-07-28T04:34:20Z",
      "title": "World shares advance after EU strikes trade deal with Trump",
      "url": "https://apnews.com/article/stocks-markets-tariffs-trump-eu-72eaa68a1a9e4079a5ff7adb89a51315",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5c7f7f/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F4d%2F8a054405e3fb092891377e9f91ca%2Fc7691cba61654a9e9ab2ea6329ec733c"
    },
    {
      "author": null,
      "description": "Asian skin care has been a booming global business for a more than a decade, with consumers in Europe, North and South America, and increasingly the Middle East, snapping up creams, serums and balms from South Korea, Japan and China. In the United States, Korean cosmetics, or K-beauty for short, have dominated the trend. But South Korea is facing a looming 25% tariff that could put a damper on that growth. Retailers and shoppers alike are hoping South Korea is one of the countries that secures a better a trade deal before the Aug. 1 date arrives.",
      "publishedAt": "2025-07-28T09:05:06Z",
      "title": "South Korean beauty products could be subject to steep tariffs",
      "url": "https://apnews.com/article/tariffs-kbeauty-south-korea-77e528d9b0011034bcf593ba056b4077",
      "urlToImage": "https://dims.apnews.com/dims4/default/57f89b1/2147483647/strip/true/crop/5415x3046+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fa6%2Fe4417062dab51a2158d418a7aa69%2F52f4428fb93644eba6bb3bfe94b2eee8"
    },
    {
      "author": null,
      "description": "The wave of lawsuits from college athletes seeking another season of eligibility seems to be slowing down. With fall football practice starting this week, players hoping for a judge's approval to play may be left waiting. Legal expert Sam Ehrlich says it's likely too late for athletes to file cases and get relief. Judges have provided inconsistent rulings, and the issue might end up in a higher court. Some athletes, like Vanderbilt quarterback Diego Pavia, have won their cases. Others remain in limbo. The NCAA wants limited liability protection from Congress to address these eligibility lawsuits.",
      "publishedAt": "2025-07-28T11:10:06Z",
      "title": "Football season looms with no clear guidance in athlete battles to win more eligibility from NCAA",
      "url": "https://apnews.com/article/ncaa-eligibility-lawsuits-extra-year-73b5ad6c52cdc4d962fd93c171a852ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/1df8995/2147483647/strip/true/crop/4639x2609+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F72%2Ffcb564eb5678e98f9d84ad0d1974%2F061d6a787e584522bc46d765fcd075ad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}