{
  "articles": [
    {
      "author": "Darlene Superville, Mari Yamaguchi",
      "description": "President Donald Trump says he's joining some of his top economic advisers for negotiations at the White House over tariffs and trade with a top Japanese official who's traveling to Washington for the talks. The Republican president says in a post on his social media platform he'll attend the meeting Wednesday alongside Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick. Trump recently announced a round of global tariffs but then quickly put them on hold for 90 days after the markets tanked. Japan's 24% across-the-board tariff is on hold. But a 10% baseline tariff and a 25% tariff on cars, auto parts, steel and aluminum exports to the U.S. remain in place.",
      "publishedAt": "2025-04-16T12:16:35Z",
      "title": "Trump says he'll join Bessent and Lutnick for trade negotiations with the Japanese",
      "url": "https://apnews.com/article/trump-trade-tariffs-japan-negotiations-bessent-lutnick-9134808d0e4aaf30bc60b28d7adc9b32",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f8d837/2147483647/strip/true/crop/4898x2755+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F11%2F30b5c33b9ce0332b1fa060462492%2F221a04a5f8194d3a9b029a66455b9331"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Japan recorded a trade deficit for the fiscal year that just ended but racked up a $63 billion surplus with the United States. The Finance Ministry reported Thursday that the deficit was 5.2 trillion yen, or $37 billion, for the fiscal year through March, the fourth straight year of red ink. Exports to the U.S. are a contentious issue for U.S. President Donald Trump and Japanese negotiators are in Washington to argue their case against higher U.S. tariffs. Japan is a key longtime U.S. ally and major investor in the U.S., employing hundreds of thousands of Americans in the U.S.",
      "publishedAt": "2025-04-17T04:19:28Z",
      "title": "Japan reports a $63 billion trade surplus with the US as it talks with Trump on tariffs",
      "url": "https://apnews.com/article/japan-trade-tariffs-trump-d23573689292edd7b3cea7496438a4a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a450ccc/2147483647/strip/true/crop/6404x3602+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fd1%2F78620bdf942bb9ed9dc73d912acb%2F07e0dd0aa5c145f0a8c2895ef9d8ac36"
    },
    {
      "author": "By Alanna Durkin Richer",
      "description": "A federal judge says he's found probable cause to hold the Trump administration in criminal contempt of court for violating his orders to turn around planes carrying deportees to El Salvador. U.S. District Judge James E. Boasberg said Wedneday that the administration must try to “purge” itself of a contempt finding or he'll launch hearings and potentially refer the matter for prosecution. The move by Boasberg marks an escalation in a battle between the judicial and executives branches of government over a president’s powers to carry out key White House priorities.",
      "publishedAt": "2025-04-16T16:32:58Z",
      "title": "Judge finds probable cause to hold Trump administration in contempt for violating deportation order",
      "url": "https://apnews.com/article/trump-deportees-el-salvador-contempt-boasberg-da282511ac6f5c8dd19af620995ca440",
      "urlToImage": "https://dims.apnews.com/dims4/default/f302e67/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F7d%2F5f1c43a327eb23fb85f5d5d37d37%2Fbd67517eae3a45bebe8972e155380f5f"
    },
    {
      "author": "Isaac Scharf, Wafaa Shurafa",
      "description": "Israel’s defense minister says that troops will remain in so-called security zones in the Gaza Strip, Lebanon and Syria indefinitely. Israeli forces have taken over large areas of Gaza in recent weeks in a renewed campaign to pressure Hamas to release hostages after Israel ended their ceasefire last month. Israel has also refused to withdraw from some areas in Lebanon following a ceasefire with the Hezbollah militant group last year, and it seized a buffer zone in southern Syria after the overthrow of President Bashar Assad. The Palestinians and both neighboring countries view the presence of Israeli troops as military occupation in violation of international law.",
      "publishedAt": "2025-04-16T07:44:48Z",
      "title": "Israeli defense minister says troops will remain in Gaza, Lebanon and Syria indefinitely",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-16-2025-884713e2096d5353e3008ec7d9cc01ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/5549379/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F64%2F4a087c951d5aa79334830a065534%2Ffdcc0d31ed85499b946861be5a9c58d8"
    },
    {
      "author": "Joseph Krauss",
      "description": "Israel’s defense minister says its troops will remain in so-called security zones in the Gaza Strip, Lebanon and Syria indefinitely, after Israel unilaterally expanded its frontiers in the war unleashed by Hamas’ Oct. 7, 2023, attack. Israel says it needs to hold on to the zones to prevent similar attacks, but the takeovers amount to military occupation. The acquisition of territory by force is universally seen as a violation of international law. Israel, which has captured territory during wars with its Arab neighbors going back to its establishment in 1948, says this is a special case.",
      "publishedAt": "2025-04-16T16:33:15Z",
      "title": "Israel to keep soldiers in Gaza, Lebanon and Syria indefinitely",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-gaza-lebanon-syria-land-buffer-zones-bed41f9762fd5481170119f3a8d0fba7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f09c2d6/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F77%2Fd40785977f5b99574b3197b02660%2F563816720fa4444faa2f96b483e3b1bf"
    },
    {
      "author": null,
      "description": "Ten prison guards were charged in connection with the fatal beating of a 22-year-old prison inmate, including two charged with murder. Wednesday's charges are the second time a group of correctional officers in New York was indicted for a death behind bars this year. Other prisoners say several guards severely beat Messiah Nantwi, a prisoner at the Mid-State Correctional Facility, sending him to a hospital where he died on March 1. The Utica-area facility was one of many state prisons that was struggling to function during a three-week wildcat strike by guards.",
      "publishedAt": "2025-04-16T17:41:58Z",
      "title": "Messiah Nantwi: 10 guards charged over New York prisoner's fatal beating",
      "url": "https://apnews.com/article/new-york-prison-guards-inmate-death-5ec50359f3168e7115028c26784fc0af",
      "urlToImage": "https://dims.apnews.com/dims4/default/49136af/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2F70%2F3a6613582aa351ebacb38a1e51bf%2Fb191c95c28ca433ab12b4c01b2d4c327"
    },
    {
      "author": "Grant Peck, Sopheng Cheang",
      "description": "Chinese President Xi Jinping has arrive in Cambodia for a two-day state visit that serves as an opportunity to further strengthen already robust relations. The visit, Xi’s first since 2016, will conclude a three-nation Southeast Asian tour that included stops in Vietnam and Malaysia. During his visit Xi is scheduled to meet with King Norodom Sihamoni, Prime Minister Hun Manet and longtime former Prime Minister Hun Sen. Trade will likely be a major topic of Xi’s discussions in Cambodia, which faces among the highest tariff rates proposed by Washington. In addition to Trump’s universal 10% tariff, the country faces the threat of a 49% tax on exports to the U.S. once his 90-day pause expires.",
      "publishedAt": "2025-04-17T04:30:06Z",
      "title": "China’s leader Xi Jinping arrives in Cambodia to wrap up 3-nation Southeast Asia tour",
      "url": "https://apnews.com/article/xi-jinping-hun-manet-ream-naval-base-cambodia-china-f477b79fd3bb2a08455e95b66acff53c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8844cb7/2147483647/strip/true/crop/4377x2462+0+228/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fac%2Fc6de41040cd49dbe048fb7a622a1%2F10c6b2adffd04bd7b6b4958ba28705cb"
    },
    {
      "author": null,
      "description": "The head of Myanmar’s military government has granted amnesty to around 4,900 prisoners to mark the country's traditional new year, but it wasn’t immediately clear how many were political detainees locked up for opposing army rule. State-run MRTV said Thursday that the head of the ruling military council, Senior Gen. Min Aung Hlaing, had pardoned 4,893 prisoners. It said in a separate statement that 13 foreigners will also be released and deported from Myanmar. He also reduced sentences for others, except those convicted of serious charges.",
      "publishedAt": "2025-04-17T01:59:10Z",
      "title": "Myanmar frees around 4,900 prisoners to mark traditional new year",
      "url": "https://apnews.com/article/myanmar-amnesty-prisoners-min-aung-hlaing-new-year-c33b3af152a41f42fa01631150a42a6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/6999c77/2147483647/strip/true/crop/5712x3213+0+536/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F38%2F0eccad507b8976c345cb17b7748a%2F679356e492d44064b5701bf1fedac754"
    },
    {
      "author": "Rob Gillies",
      "description": "Prime Minister Mark Carney says who will go up against U.S. President Donald Trump is the key question in Canada’s election while his Conservative rival argued Carney doesn’t represent change after 10 years of Liberal Party rule. Opposition Conservative Pierre Poilievre says during the French-language leaders’ debate Canada needs change and Carney is just like his predecessor Justin Trudeau. Trump’s frequent attacks on Canada’s economy and sovereignty have infuriated Canadians and led to a surge in nationalism that has bolstered Liberal Party poll numbers ahead of the April 28 vote. Poilievre is imploring Canadians not to give the Liberals a fourth term.",
      "publishedAt": "2025-04-16T23:45:47Z",
      "title": "Carney says Trump key issue in Canada's election, while Conservative rival says country needs change",
      "url": "https://apnews.com/article/canada-election-debate-carney-trump-e030824b113d1d6776f0ec6ac1128f2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/addffcd/2147483647/strip/true/crop/5096x2867+0+20/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F25%2F3effb6a72e65c049726d0b226236%2F0bad02dc38174208aa22891c18439f0c"
    },
    {
      "author": "Dar Yasin",
      "description": "SRINAGAR, India (AP) — Mohammad Yousuf Dar and his wife, Shameema, sit cross-legged before their loom, deftly tying consecutive knots to create the floral patterns of the famed Kashmiri carpets that are now threatened by the Trump administration’s sweeping tariffs.",
      "publishedAt": "2025-04-17T04:11:17Z",
      "title": "AP PHOTOS: Trump tariffs threaten Kashmiri carpet industry",
      "url": "https://apnews.com/article/kashmir-carpet-industry-trump-tariffs-c9511e3ca391b74a21b3ece4883895c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3a43be/2147483647/strip/true/crop/7277x4093+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2Fdd%2Fda15bb944533ca740aab1d84d9a4%2Fcb3ee1a0ca46433384602aeb33ebb9dd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}