{
  "articles": [
    {
      "author": "ERIC TUCKER, KATE BRUMBACK and JILL COLVIN",
      "description": "ATLANTA (AP) — A scowling Donald Trump posed for a mug shot Thursday as he surrendered inside a jail in Atlanta on charges that he illegally schemed to overturn the 2020 election in Georgia, creating a historic and humbling visual underscoring the former president's escalating legal troubles.",
      "publishedAt": "2023-08-24T04:42:08Z",
      "title": "Mug shot of Donald Trump shows scowling former president during speedy booking at Atlanta jail",
      "url": "https://apnews.com/7f4e9860859fbb71221b6a5163aaa42f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7313904ffea485fa039b7fe083b4a44/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS and AAMER MADHANI",
      "description": "WASHINGTON (AP) — A preliminary U.S. intelligence assessment concluded that an intentional explosion caused the plane crash presumed to have killed a mercenary leader who was eulogized Thursday by Vladimir Putin, even as suspicions grew that the Russian president was the architect of the assassination.",
      "publishedAt": "2023-08-24T07:33:57Z",
      "title": "US intelligence says an intentional explosion brought down Wagner chief Prigozhin’s plane",
      "url": "https://apnews.com/382515214f691e47daa2e3635d64e612",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f281feee27b40cdb933f025993dbc6d/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "FAIRFAX, Va. (AP) — In a secluded stairwell at CIA headquarters last year, officer trainee Ashkan Bayatpour came up behind a colleague, wrapped a scarf around her neck and plainly spoke as he tried to kiss her on the mouth.",
      "publishedAt": "2023-08-24T15:16:12Z",
      "title": "CIA stairwell attack among flood of sexual misconduct complaints at spy agency",
      "url": "https://apnews.com/8ca2f3a4b41c9d6f3da34364aea42dad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e467478b70bf412a9fa79e0bba142d8b/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and GENE JOHNSON",
      "description": "HONOLULU (AP) — Maui County sued Hawaiian Electric Company on Thursday over the fires that devastated Lahaina, saying the utility negligently failed to shut off power despite exceptionally high winds and dry conditions.",
      "publishedAt": "2023-08-24T20:57:28Z",
      "title": "Maui County sues utility, alleging negligence over fires that ravaged Lahaina",
      "url": "https://apnews.com/c3513c2f8e451df6dab2e59a6c2f670d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2f7ed7b141f448bb968681023849876/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — The eight Republican presidential candidates on the debate stage were asked to raise their hands if they believed human behavior is causing climate change.",
      "publishedAt": "2023-08-24T16:53:19Z",
      "title": "Presidential debate shows how GOP candidates are struggling to address concerns about climate change",
      "url": "https://apnews.com/6d8ff0b9fd9a57cf0659a6f973a107ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3d52486a66e47b89c9a959f22f787e9/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — The first Republican presidential debate provided an opportunity for candidates to make their cases directly to a national audience, and some of that attention is translating into fundraising boosts.",
      "publishedAt": "2023-08-24T18:16:14Z",
      "title": "Ramaswamy raises $450,000 in first hours after Republican debate as campaigns try to seize momentum",
      "url": "https://apnews.com/ef3efd6c842e314048aaa3c0f59a429a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e10e87e39c884d11a68ea8bb55164057/3000.jpeg"
    },
    {
      "author": "EUGENE GARCIA, AMY TAXIN and JOHN ANTCZAK",
      "description": "TRABUCO CANYON, Calif. (AP) — The retired police sergeant who opened fire during a lively Wednesday evening at a popular Southern California biker bar had traveled from Ohio to confront his estranged wife, shooting her in the face before turning his gun on the crowd, authorities said.",
      "publishedAt": "2023-08-24T03:57:17Z",
      "title": "Retired police sergeant who killed 3 at California bar shot his estranged wife first, officials say",
      "url": "https://apnews.com/be474bdb916250261808d34cc20f67b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d3661fd721443ee835779e6cff7e089/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "KNOXVILLE, Tennessee (AP) — “That’s where I got shot,” said Rashaad Woods, nodding toward a convenience store in Knoxville’s “gun zone.” There were bullet holes in a church’s walls. Nearby was a shuttered nightclub where some people were killed.",
      "publishedAt": "2023-08-24T14:23:48Z",
      "title": "As research grows into how to stop gun violence, one city looks to science for help",
      "url": "https://apnews.com/faece441678e77776fe04db3243f6104",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cebe8db363394af6a3e094584a7ee6c3/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "ANAHEIM, Calif. (AP) — Shohei Ohtani already knew he had a career-altering tear in his elbow ligament when he roped a double to right in the fifth inning of the Angels' doubleheader nightcap on Wednesday.",
      "publishedAt": "2023-08-24T21:41:28Z",
      "title": "Ohtani to keep playing, his future and impending free agency murky after elbow ligament injury",
      "url": "https://apnews.com/f488cf6b4a9ea1c140709cb4ec12ef4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3cdef344779408ebc5cc3921e12bf08/3000.jpeg"
    },
    {
      "author": "KRYSTA FAURIA and ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Fran Drescher believes that the walkouts that have shut down Hollywood are about something much bigger than the actors union she leads, or the writers striking alongside them, or the entertainment industry.",
      "publishedAt": "2023-08-24T18:26:46Z",
      "title": "Fran Drescher says actors strike she's leading is an 'inflection point' that goes beyond Hollywood",
      "url": "https://apnews.com/ec62ce74813caa12ec11f72a0b48bc17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8911533abba546b887a6a484e76485da/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}