{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli airstrikes pounded locations across the Gaza Strip early Thursday, including parts of the south that Israel had declared as safe zones, heightening fears among more than 2 million Palestinians trapped in the territory that nowhere was safe.",
      "publishedAt": "2023-10-19T07:59:07Z",
      "title": "Palestinians trapped in Gaza find nowhere is safe during Israel's relentless bombing",
      "url": "https://apnews.com/b084e9c453cc99f7bec6f66d7b5913d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c50802c1c4bb4599b82ca0a082d41028/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel has agreed to allow Egypt to deliver limited humanitarian aid to the Gaza Strip while the Israeli military keeps up its airstrikes on the Palestinian territory. More than 1 million Palestinians, roughly half of Gaza’s population, have fled homes in the north and Gaza City after Israel told them to evacuate.",
      "publishedAt": "2023-10-19T03:55:19Z",
      "title": "Live updates | Israel OKs limited aid for Gaza as regional tensions rise following hospital blast",
      "url": "https://apnews.com/1f06a2c07957bfdd5330d32cb211809d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12019ea626dd41ad8f32be14ed65187b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Refusing to drop out, Republican Rep. Jim Jordan has brought the House speaker's race to a stalemate — the hard-fighting ally of Donald Trump has been unable to win the gavel but he and his far-right allies won't step aside for a more viable GOP nominee.",
      "publishedAt": "2023-10-19T04:07:42Z",
      "title": "The House speaker's race hits an impasse as defeated GOP Rep. Jim Jordan wants to try again",
      "url": "https://apnews.com/abdef873a8d14979848b658e4ef46fd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4744a35ee6d43b9a418e1c6c91f2d5c/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — Donald Trump is crushing his Republican presidential rivals in the contest to raise campaign cash, putting the other White House hopefuls in an unenviable position before the first votes are cast in January.",
      "publishedAt": "2023-10-19T04:05:59Z",
      "title": "Trump’s campaign cash overwhelms his GOP rivals. Here are key third-quarter fundraising takeaways",
      "url": "https://apnews.com/a07e78b814376d635f53ea17aa704d1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8397d8343dcd4e38b99d34c86f1dcbf4/3000.jpeg"
    },
    {
      "author": null,
      "description": "BIRMINGHAM, Ala. (AP) — Beth Holloway was after one thing for 18 years: answers about what happened to her missing daughter.She got them Wednesday when Joran van der Sloot, long considered the chief suspect in her daughter’s 2005 disappearance in Aruba, admitted in submitted court filings to bludgeoning Natalee Holloway to death on a beach and dragging her body out to sea.",
      "publishedAt": "2023-10-19T05:12:36Z",
      "title": "Joran van der Sloot's confession in Natalee Holloway case provides long-sought answers, mother says",
      "url": "https://apnews.com/eab59b1e91aad341cc3a77949cfe80df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0546ace785d44e33a57deb1e57142000/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and LINLEY SANDERS",
      "description": "MIAMI (AP) — Most people in the U.S. see Mexico as an essential partner to stop drug trafficking and illegal border crossings, even as they express mixed views of Mexico’s government, according to a new poll.",
      "publishedAt": "2023-10-19T04:03:59Z",
      "title": "Most in the US see Mexico as a partner despite border problems, an AP-NORC/Pearson poll shows",
      "url": "https://apnews.com/3981c86178acd29e4a22357f1f382b5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89431faef4874d8e8432cddab0c174c6/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM, KIM TONG-HYUNG and JON GAMBRELL",
      "description": "SEOUL, South Korea (AP) — Hamas fighters likely fired North Korean weapons during their Oct.",
      "publishedAt": "2023-10-19T04:27:11Z",
      "title": "Evidence shows Hamas militants likely used some North Korean weapons in attack on Israel",
      "url": "https://apnews.com/703e33663ea299f920d0d14039adfbb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adc673d1abec400985d198518c9e2243/1280.jpeg"
    },
    {
      "author": "ED KOMENDA and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — For people around the world, the green leaves that sprouted from a scorched, 150-year-old banyan tree in the heart of devastated Lahaina symbolized hope following Maui’s deadly wildfire this summer.",
      "publishedAt": "2023-10-19T04:08:01Z",
      "title": "The trees arrived with Polynesian voyagers. After Maui wildfire, there's a chance to restore them",
      "url": "https://apnews.com/c35dd1e9fd63af23ca63a6eeb631c1d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ade22e77bd144ea96d503688e2efb99/3000.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — The house on Villegas Street, in the heart of Old Havana, looks nothing like the stately two-story home it used to be a century ago, with its high ceilings, wrought iron railings, semicircular arches and stairs covered in white marble.",
      "publishedAt": "2023-10-19T04:01:33Z",
      "title": "Havana’s once stately homes crumble as their residents live in fear of an imminent collapse",
      "url": "https://apnews.com/f2a1077414ed8848f29bade3796ef020",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b899ac4f4b134949966fb957214d8e26/1920.jpeg"
    },
    {
      "author": null,
      "description": "STRASBOURG, France (AP) — Mahsa Amini, the 22-year-old Kurdish-Iranian woman who died in police custody in Iran last year, sparking worldwide protests against the country’s conservative Islamic theocracy, was awarded the European Union’s top human rights prize on Thursday.",
      "publishedAt": "2023-10-19T10:19:09Z",
      "title": "Mahsa Amini, the Kurdish-Iranian woman who died in police custody, is awarded EU human rights prize",
      "url": "https://apnews.com/5a24ba82e8b7819afae72e9dff4bc25e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10ab841f57494b3daa4f4d27f5cd184f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}