{
  "articles": [
    {
      "author": "LINDSEY BAHR",
      "description": "In our spoiler phobic culture, movie trailers don’t often offer a lot of information. It’s even dangerous territory for a critic to discuss too many specifics, sometimes years after a film or television show has come out.",
      "publishedAt": "2024-08-01T23:33:36Z",
      "title": "Movie Review: Josh Hartnett goes big as the serial killer in M. Night Shyamalan’s 'Trap'",
      "url": "https://apnews.com/f7bc0312e7f76e01c921c4622a8e0add",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7948139fc5f406e843e5114485a7a8b/3000.jpeg"
    },
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "ATLANTA (AP) — Former President Donald Trump picked a new fight with Georgia's Republican governor as he campaigned in the key swing state where he's looking to avenge his narrow 2020 loss — a defeat he continues to blame on Republican officials based on his false theories of election fraud.",
      "publishedAt": "2024-08-03T04:06:03Z",
      "title": "Trump again tears into Georgia's Republican governor on the same day he campaigns in the state",
      "url": "https://apnews.com/b21c25bbbfafdd0343c8812f6c3d7c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2936aabedfea4f70a49b4a03c085e840/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Democrats have unified with remarkable speed behind Vice President Kamala Harris as she has taken over the top of the party's ticket heading into the November presidential election.",
      "publishedAt": "2024-08-03T14:12:08Z",
      "title": "Some activists step up criticism of Shapiro and Kelly as Harris closes in on naming a running mate",
      "url": "https://apnews.com/be228f0efdb87954769232a4fb0f4362",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4d0357b5574c3399c43515588a8b1a/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "NANTERRE, France (AP) — Every year on August 3, Katie Ledecky is reminded of her first Olympic gold medal.She was just 15 years old, a reserved high schooler who had surprisingly made the U.S.",
      "publishedAt": "2024-08-03T18:53:49Z",
      "title": "Katie Ledecky swims into history with 800 freestyle victory at the Paris Olympics",
      "url": "https://apnews.com/46342b7abd636282da995d1b0b9c4aff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e83f6602e6854fabb4ea1e2de240911c/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "VILLEPINTE, France (AP) — Boxer Imane Khelif of Algeria clinched a medal at the Paris Olympics in an emotional fight Saturday that followed days of sharp scrutiny and online abuse as misconceptions about her gender exploded into a larger clash about identity in sports.",
      "publishedAt": "2024-08-03T12:36:48Z",
      "title": "Algerian boxer Imane Khelif clinches medal at Olympics after outcry fueled by gender misconceptions",
      "url": "https://apnews.com/a3c7695f2efc635cfc7a5ba9e2ef01e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7187726c7774f5a89c400f3431ef1d2/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "FARDIS, Lebanon (AP) — Alma Ayman Fakhr al-Din, a lively 11-year-old who loved basketball and learning languages, was playing on a soccer field a week ago in Majdal Shams, a Druze town in the Israeli-occupied Golan Heights, when the rocket hit.",
      "publishedAt": "2024-08-03T16:22:27Z",
      "title": "Horror at deaths of 12 children unites Druze across borders. But Mideast's wars tear at their bonds",
      "url": "https://apnews.com/cd1005be55b3893f0852e431643899bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2825540bfc640e8a81b838f830cf6d4/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ",
      "description": "CARACAS, Venezuela (AP) — Thousands of people rallied in the streets of Venezuela's capital Saturday, waving the national flag and singing the national anthem in support of an opposition candidate they believe won the presidential election by a landslide.",
      "publishedAt": "2024-08-03T18:08:52Z",
      "title": "Opposition leader joins rally calling for Venezuela presidential election results to be overturned",
      "url": "https://apnews.com/d6e70bd88ee9511298a4850c224a12e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66f26ed4e3ca4ee09cae4e58bc5791ee/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CHAPIN, S.C. (AP) — Donald Trump says he is pulling out of a scheduled September debate with Vice President Kamala Harris on ABC and wants them to face off on Fox News, making it increasingly unlikely that the candidates will confront each other on stage before the November election.",
      "publishedAt": "2024-08-03T17:57:07Z",
      "title": "Trump says he'll skip an ABC debate with Harris in September and wants them to face off on Fox News",
      "url": "https://apnews.com/0d0be341bbe7877a71bfc4bed40610fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ea84cf4bdb446e9a00f6a65dcd552ce/3000.jpeg"
    },
    {
      "author": "AREF TUFAHA and JACK JEFFERY",
      "description": "ZEITA, West Bank (AP) — Two Israeli airstrikes in the West Bank killed nine Palestinian militants on Saturday, Israel's army said, as violence flared again in the Israeli-occupied territory with tensions high over the war in Gaza and a potential regional escalation.",
      "publishedAt": "2024-08-03T09:46:00Z",
      "title": "Israel kills militants in the West Bank as a nervous region watches latest on cease-fire talks",
      "url": "https://apnews.com/4ccf2a50855866662cd21a0315395286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1df5144e3d5d44ce8ac70d8d8c0ba3c4/1920.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — A tropical depression strengthened into Tropical Storm Debby north of Cuba on Saturday and was newly predicted to become a hurricane as it moves through the Gulf of Mexico on a collision course with Florida.",
      "publishedAt": "2024-08-03T14:07:45Z",
      "title": "Tropical depression strengthens into Tropical Storm Debby as it moves through Gulf toward Florida",
      "url": "https://apnews.com/dce34e4d691b2c12a386964f86215220",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f809c1753626486b876708cee46346f7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}