{
  "articles": [
    {
      "author": null,
      "description": "SAIPAN, Northern Mariana Islands (AP) — WikiLeaks founder Julian Assange pleads guilty in deal with US securing his freedom, ending extraordinary legal fight.",
      "publishedAt": "2024-06-25T23:42:47Z",
      "title": "WikiLeaks founder Julian Assange pleads guilty in deal with US securing his freedom, ending extraordinary legal fight",
      "url": "https://apnews.com/431ceb3ddb03d80b8028fa1c0ebce40f",
      "urlToImage": ""
    },
    {
      "author": "JENNIFER PELTZ and SARAH EL DEEB",
      "description": "NEW YORK (AP) — Israelis who were taken hostage or lost loved ones during Hamas' Oct. 7 attack are suing the United Nations agency that aids Palestinians, claiming it has helped finance the militants by paying agency staffers in U.S.",
      "publishedAt": "2024-06-25T22:44:34Z",
      "title": "Israelis' lawsuit says UN agency helps Hamas by paying Gaza staff in dollars",
      "url": "https://apnews.com/2bde89983d91e9fe4fcd9ad8339c4fe7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff446b2b713146bf8bb291e91d8b6ce9/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI, KIMBERLY ESMORES, ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "SAIPAN, Northern Mariana Islands (AP) — WikiLeaks founder Julian Assange has pleaded guilty to a single felony charge for publishing U.S. military secrets in a deal with Justice Department prosecutors that secures his freedom and concludes a drawn-out legal saga that raised divisive questions about press freedom and national security.",
      "publishedAt": "2024-06-25T05:33:34Z",
      "title": "WikiLeaks’ Assange pleads guilty in deal with US that secures his freedom, ends legal fight",
      "url": "https://apnews.com/00eb380879ff636cc9b916f82f82ed40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a67f7df3354d5a9802e4af67ec9dda/1920.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY and JILL LAWLESS",
      "description": "WELLINGTON, New Zealand (AP) — He emerged on the information security scene in the 1990s as a “famous teenage hacker\" following what he called an “ itinerant minstrel childhood” beginning in Townsville, Australia.",
      "publishedAt": "2024-06-25T12:47:37Z",
      "title": "Who is Julian Assange, the polarizing founder of the secret-spilling website WikiLeaks?",
      "url": "https://apnews.com/e6f55737c9cf6e5059eb43991e89e1f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddba871f129b4083b3b8c894268f9cc3/2000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — The Supreme Court unanimously ordered the government to begin drafting ultra-Orthodox Jewish men into the army — a landmark ruling seeking to end a system that has allowed them to avoid enlistment into compulsory military service.",
      "publishedAt": "2024-06-25T21:53:38Z",
      "title": "Israel's courts say the military must enlist the ultra-Orthodox. What could that mean for Netanyahu?",
      "url": "https://apnews.com/84514233f43e4d385b7dba1f22a894bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d415b0a1d8438b8565bc2dd54dc332/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A Manhattan judge on Tuesday modified Donald Trump's gag order, freeing the former president to comment publicly about witnesses and jurors in the hush money criminal trial that led to his felony conviction, but keeping others connected to the case off limits until he is sentenced July 11.",
      "publishedAt": "2024-06-25T17:38:52Z",
      "title": "Judge alters Trump’s gag order, letting him talk about witnesses, jury after hush money conviction",
      "url": "https://apnews.com/cd8e983664e238385572b9b6dff909ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7915238d0abc4bf19686652741599111/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Federal food safety regulators said Tuesday that they have warned a top U.S. bakery to stop using labels that say its products contain potentially dangerous allergens when they don't. U.S. Food and Drug Administration inspectors found that Bimbo Bakeries USA — which includes brands such as Sara Lee, Oroweat, Thomas', Entenmann's and Ball Park buns and rolls — listed ingredients such as sesame or tree nuts on labels even when they weren't in the foods.",
      "publishedAt": "2024-06-25T22:13:22Z",
      "title": "FDA warns maker of Sara Lee and Entenmann's not to claim foods contain allergens when they don't",
      "url": "https://apnews.com/fb3f49f95515b9af3cf1bfd7ddbabed6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9811b4141e334252aa5421e365dd5e12/2000.jpeg"
    },
    {
      "author": "RIO YAMAT",
      "description": "LAS VEGAS (AP) — A man who fatally shot five people and critically injured a 13-year-old girl at apartments near Las Vegas has killed himself, authorities said Tuesday.The North Las Vegas Police Department said the suspected shooter, 47-year-old Eric Adams, killed himself Tuesday morning as he was confronted by officers in a neighborhood.",
      "publishedAt": "2024-06-25T18:36:59Z",
      "title": "Suspect is dead after shootings near Las Vegas leave 5 people dead, teen injured, police say",
      "url": "https://apnews.com/1848f6a67f424f79ce043a077bb077c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/705c331f744f459b947e2d1d7679bb18/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — It could be a well-rehearsed zinger or an offhand, too-loud sigh.Notable moments from past presidential debates demonstrate how the candidates' words and body language can make them look especially relatable or hopelessly out-of-touch.",
      "publishedAt": "2024-06-25T04:06:21Z",
      "title": "Laugh (or cringe) at these history-making moments from presidential debates",
      "url": "https://apnews.com/93b3700715c2f16092ddfaee59ca49cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0302aed3302b42a48194d82060ed9de8/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET and GABRIELA SÁ PESSOA",
      "description": "RIO DE JANEIRO (AP) — Brazil’s Supreme Court on Tuesday voted to decriminalize possession of marijuana for personal use, making the nation one of Latin America’s last to do so, in a move that could reduce its massive prison population.",
      "publishedAt": "2024-06-25T18:36:58Z",
      "title": "Brazil’s Supreme Court decriminalizes possession of marijuana for personal use",
      "url": "https://apnews.com/2ea6a00be557553df8f45676d960f141",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/796e465457514f8aa963a9d19591af8b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}