{
  "articles": [
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — Thousands of residents fled their homes as a wildfire swept into the mountain village of Ruidoso in southern New Mexico on Tuesday, destroying or damaging more than 500 structures, including an unknown number of homes.",
      "publishedAt": "2024-06-18T05:00:42Z",
      "title": "New Mexico governor declares emergency as thousands flee wildfires that have damaged 500 structures",
      "url": "https://apnews.com/86ee7230cc09ed7922a8f3a3815c7e7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fd2182203f4d86bf03e3b8c4bb1ca4/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — President Joe Biden ordered expansive election-year action Tuesday to offer potential citizenship to hundreds of thousands of immigrants without legal status in the U.S., aiming to balance his recent aggressive crackdown on the southern border that enraged advocates and many Democratic lawmakers.",
      "publishedAt": "2024-06-18T09:03:20Z",
      "title": "Half a million immigrants could eventually get US citizenship under a sweeping new plan from Biden",
      "url": "https://apnews.com/69b9212c382d9bb265369b29b62622d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/014b77752bf548ccb18d778a0c4fa688/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York’s top court on Tuesday declined to hear Donald Trump’s gag order appeal in his hush money case, leaving the restrictions in place following his felony conviction last month.",
      "publishedAt": "2024-06-18T15:08:30Z",
      "title": "New York's top court declines to hear Trump's appeal of the gag order in his hush money case",
      "url": "https://apnews.com/c6e8056bf7b82aaf0bbf094d703b5f31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a34dc65b0afc40dba20cfef08dfd16b8/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and DREW CALLISTER",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Tuesday claimed the United States is withholding weapons and implied this was slowing Israel's offensive in the southern Gaza city of Rafah, where fighting has exacerbated the already dire humanitarian situation for Palestinians.",
      "publishedAt": "2024-06-18T17:43:14Z",
      "title": "Israel's Netanyahu blames Biden for withholding weapons. US officials say that's not the whole story",
      "url": "https://apnews.com/2a7aeb71867150c5a9d84ae57e2e7bf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fad7529c77a647779cc744fec452ab3f/1920.jpeg"
    },
    {
      "author": "SOPHIE AUSTIN",
      "description": "SACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom announced Tuesday that he wants to restrict students' usage of smartphones during the school day, citing the mental health risks of social media.",
      "publishedAt": "2024-06-18T20:46:37Z",
      "title": "California governor wants to restrict smartphone usage in schools",
      "url": "https://apnews.com/3a2f2f2b4b79e0a3fb2416ff993a92be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db26df94126a4367aa853eac022d224b/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Republicans blocked bipartisan legislation Tuesday that would have outlawed bump stocks after the Supreme Court struck down a ban on the rapid-fire gun accessory used in the deadliest shooting in modern U.S.",
      "publishedAt": "2024-06-18T21:41:37Z",
      "title": "Republicans block bill to outlaw bump stocks for rifles after Supreme Court lifts Trump-era ban",
      "url": "https://apnews.com/6684089f5080bfa97f99b967fd234f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6011a9da3b4a4ec9acacd7bda1248d8b/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — The U.S. government on Tuesday acknowledged, for the first time, the harmful role it has played over the past century in building and operating dams in the Pacific Northwest — dams that devastated Native American tribes by inundating their villages and decimating salmon runs while bringing electricity, irrigation and jobs to nearby communities.",
      "publishedAt": "2024-06-18T20:04:24Z",
      "title": "US acknowledges Northwest dams have devastated the region's Native tribes",
      "url": "https://apnews.com/58f5c6737df3c3e141cbc8e1cd4926ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60b32645d2a248f29314c4575bdb0f77/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Russian President Vladimir Putin arrived in North Korea early on Wednesday, after saying the two countries want to cooperate closely to overcome U.S.-led sanctions in the face of intensifying confrontations with Washington.",
      "publishedAt": "2024-06-18T00:49:07Z",
      "title": "Russia President Vladimir Putin makes a rare visit to North Korea, an old ally",
      "url": "https://apnews.com/05f0ed66f9978ac1ba34f2d708ad7504",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/561cabfe033348b2a3e62f18caee7ff9/1920.jpeg"
    },
    {
      "author": "TAMMY WEBBER",
      "description": "FENTON, Mich. (AP) — With much of the Midwest and the Northeast broiling — or about to broil — in extreme summer heat this week, meteorologists are talking about heat waves and heat domes.",
      "publishedAt": "2024-06-18T18:04:23Z",
      "title": "What's a heat dome? Here's why so much of the US is broiling this week",
      "url": "https://apnews.com/ba561fb44dd596ee3faf3709e2f9875c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83c86128743641ba9a29e468090a33e4/1920.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "For more than one-and-a-half centuries, the Juneteenth holiday has been sacred to many Black communities.",
      "publishedAt": "2024-06-18T15:08:15Z",
      "title": "The beginner's guide to celebrating Juneteenth",
      "url": "https://apnews.com/2f7116be4418065cd954b6dbf98c62b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6223cc2308242489d32ce27b4b26fdf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}