{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and JOSEPH KRAUSS",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel bombarded the Gaza Strip early Friday, hitting areas where Palestinians had been told to seek safety, and it began evacuating a sizable Israeli town near the border with Lebanon, the latest sign of a potential ground invasion of Gaza that could trigger regional turmoil.",
      "publishedAt": "2023-10-20T06:41:16Z",
      "title": "Israel pounds Gaza, evacuates town near Lebanon ahead of expected ground offensive against Hamas",
      "url": "https://apnews.com/ed6875f15ea0d2bc196e4033b54b7194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ef14272af04486690ca60a5fbf9cedf/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Declaring that U.S. leadership \"holds the world together,” President Joe Biden told Americans on Thursday night the country must deepen its support of Ukraine and Israel in the middle of two vastly different, unpredictable and bloody wars.",
      "publishedAt": "2023-10-19T16:28:36Z",
      "title": "Biden declares Israel and Ukraine support is vital for US security, will ask Congress for billions",
      "url": "https://apnews.com/49354728b347178a4bf7508a0dc8f1d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f74c7d31adc4ff1b2ef949a84d4a555/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI, STEPHEN GROVES and KEVING FREKING",
      "description": "WASHINGTON (AP) — Despite deepening opposition, Rep. Jim Jordan is expected to try a third vote to become House speaker, even as his Republican colleagues are explicitly warning the hard-edged ally of Donald Trump that no more threats or promises can win over their support.",
      "publishedAt": "2023-10-20T04:14:35Z",
      "title": "Rep. Jim Jordan will try again for House gavel, but Republicans won't back the hardline Trump ally",
      "url": "https://apnews.com/2e32f930b4fb83a4fcae2171c9e1c055",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea8dc9a94281482c9cb9ca8ff2506822/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — It was the thing that was supposed to make Rep. Jim Jordan the 56th speaker of the House.An onslaught of pressure from the Republican Party base, allies predicted, would compel the GOP's moderate and establishment members to support Jordan, a hero of the far-right, and help him secure the votes for the gavel.",
      "publishedAt": "2023-10-20T04:25:53Z",
      "title": "Republicans are facing death threats as the election for speaker gets mired in personal feuds",
      "url": "https://apnews.com/54eeecef0188edfcb9903e45019f190f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fccdb757da94ec690448ca46d951570/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JILL COLVIN",
      "description": "NEW YORK (AP) — After turns as a real estate magnate, a New York tabloid mainstay, a reality TV star and president of the United States, Donald Trump is settling into a new role: defendant.",
      "publishedAt": "2023-10-20T04:37:59Z",
      "title": "Donald Trump is dominating the GOP primary and settling into a new role: Defendant",
      "url": "https://apnews.com/8a61f967942d9519f6f78dbe52cd03cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/494d14d7ef984235b237d6866cde379a/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and NAJIB JOBAIN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — When Omar Khodari and his family heeded the Israeli military’s warning last week advising them to head from the northern Gaza Strip to the south, they thought they were fleeing to a safer place.",
      "publishedAt": "2023-10-20T09:34:25Z",
      "title": "A Palestinian engineer who returned to Gaza City after fleeing south is killed in an airstrike",
      "url": "https://apnews.com/a4aed82dc5502e180121251c73b0b0e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/063d71e2f9594a4d9fe002ab6c7b5fe5/3000.jpeg"
    },
    {
      "author": "MOSHE EDRI",
      "description": "JERUSALEM (AP) — There’s a saying among us videojournalists: May the news stay far from your home. But on Saturday, Oct. 7, it came terrifyingly close to my hometown.While I live in Jerusalem, where I work as a cameraman for The Associated Press, I was raised in Ofakim, a city a half-hour drive from the border with Gaza.",
      "publishedAt": "2023-10-20T04:08:15Z",
      "title": "DIARY: Under siege by Hamas militants, a hometown and the lives within it are scarred forever",
      "url": "https://apnews.com/cec3cc9e14969fd100d342ad1b90f7e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d0644e6863a4542b9e35646c2ad1d7d/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY, DAVID McHUGH and STAN CHOE",
      "description": "WASHINGTON (AP) — Fifty years after the 1973 Arab oil embargo, the current crisis in the Middle East has the potential to disrupt global oil supplies and push prices higher. But don't expect a repeat of the catastrophic price hikes and long lines at the gasoline pump, experts say.",
      "publishedAt": "2023-10-20T04:57:09Z",
      "title": "Long lines at gas pump unlikely, but Middle East crisis could disrupt oil supplies, raise prices",
      "url": "https://apnews.com/fefaf577359e2b4920d6d0035f763d22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5be539bd653a476abc546ba3f8451e88/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MATTHEW BROWN",
      "description": "COLORADO SPRINGS, Colo. (AP) — A Colorado funeral home where 189 decaying bodies were discovered this month appears to have fabricated cremation records and may have given families fake ashes, according to information gathered by The Associated Press from customers and crematories.",
      "publishedAt": "2023-10-20T04:34:09Z",
      "title": "After 189 bodies were found in Colorado funeral home, evidence suggests families received fake ashes",
      "url": "https://apnews.com/29d6bc5531097b2c2e2c6d29077b4278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf54b98a463447cf9fb4371c7f8881df/1920.jpeg"
    },
    {
      "author": "BRETT MARTEL",
      "description": "NEW ORLEANS (AP) — Jacksonville quarterback Trevor Lawrence was playing with a sprained left knee, and the visiting Jaguars hurt their own cause with turnovers and penalties.They were still good enough to overcome that and pull out a dramatic victory that extended their winning streak to four games.",
      "publishedAt": "2023-10-20T03:45:26Z",
      "title": "Trevor Lawrence comes through late and the Jaguars hold off the Saints, 31-24",
      "url": "https://apnews.com/4998772c579b86fd33ec1c8da1ccfd03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff2eac3ba21944bab30a0d36ef6b7e29/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}