{
  "articles": [
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Gaza’s Health Ministry says more than 90 people have been killed by Israeli strikes in the last 48 hours. The ministry does not differentiate between civilians and combatants. The dead include at least 15 people killed overnight, among them women and children, some of who were sheltering in a designated humanitarian zone, according to hospital staff. Israel is ramping up attacks across Gaza as it tries to pressure Hamas to release its hostages and disarm. Israel has said it plans to occupy large “security zones” inside Gaza.",
      "publishedAt": "2025-04-19T10:16:12Z",
      "title": "Israeli strikes on Gaza kill more than 90 Palestinians",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-19-2025-5e80a0efc0b267515ec88aec4c3672d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin has announced a temporary Easter ceasefire in Ukraine starting Saturday, citing humanitarian reasons. Russia and Ukraine meanwhile swapped hundreds of captured soldiers in the largest exchange since Moscow’s full-scale invasion started over three years ago. According to the Kremlin, the ceasefire will last from 6 p.m. Moscow time on Saturday to midnight following Easter Sunday. Ukrainian President Volodymy Zelenskyy dismissed it as “another attempt by Putin to play with human lives.” He wrote on X that air raid alerts are spreading across Ukraine and “Shahed drones in our skies reveal Putin’s true attitude toward Easter and toward human life.”",
      "publishedAt": "2025-04-19T10:30:02Z",
      "title": "Russia, Ukraine swap hundreds of prisoners in war's largest exchange",
      "url": "https://apnews.com/article/russia-ukraine-war-kursk-drones-3c940cf913f22eb21803841b4d026db8",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f5e569/2147483647/strip/true/crop/3093x1740+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2Fa2%2Fe1fb5835ec5ae8e258515fa1033b%2Fff5f44f32adc490b9a933985d7d7980b"
    },
    {
      "author": "Matthew Lee, Jon Gambrell",
      "description": "Iran and the United States are preparing for a second round of negotiations over Tehran’s rapidly advancing nuclear program in Rome. The talks Saturday in Italy over Easter weekend again will hinge on U.S. billionaire Steve Witkoff, the U.S. Mideast envoy of President Donald Trump, and Iranian Foreign Minister Abbas Araghchi. Whether the two men find common ground in the high-stakes negotiations could mean success or failure in the talks. At risk is a possible American or Israeli military strike on Iran’s nuclear sites, or the Iranians following through on their threats to pursue an atomic weapon.",
      "publishedAt": "2025-04-19T02:27:14Z",
      "title": "Iran, US prepare for second round of nuclear talks in Rome",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiations-rome-oman-5539236d72216f55aa7766be90b963b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ec9969/2147483647/strip/true/crop/6512x3663+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2Fa6%2F49121926d3deff268acfed58b048%2F52a3775696134ff1b9e386f3341c8444"
    },
    {
      "author": "Nicole Winfield",
      "description": "U.S. Vice President JD Vance has met with the Vatican’s No. 2 official as they the sides spar over the U.S. crackdown on migrants. A Vatican statement reaffirmed good relations but noted there was “an exchange of opinions” over current international conflicts and humanitarian situations involving migrants, refugees and prisoners. There was no immediate word if Vance stopped by to greet Pope Francis, who has been resuming some official duties during his recovery from pneumonia. The Holy See has expressed alarm over the administration’s crackdown on migrants and cuts in international aid while insisting on peaceful resolutions to the wars in Ukraine and Gaza.",
      "publishedAt": "2025-04-19T05:10:10Z",
      "title": "Vance visits Vatican after papal rebuke over Trump's migrant crackdown",
      "url": "https://apnews.com/article/vatican-vance-pope-migration-a91d0f741cb994faae1e363d38b66c05",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a064c1/2147483647/strip/true/crop/7086x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F63%2F397275b7280857703fe2072f4b48%2F941ae5f383074d328cf63a77bd2a4649"
    },
    {
      "author": "Ghaith Alsayed, Sally Abou Aljoud",
      "description": "Land mines and other unexploded remnants of war continue to pose a deadly threat across Syria, causing widespread casualties and long-term harm. Since the fall of Bashar Assad’s government in December 2024, the number of land mine-related incidents has surged, particularly as displaced people return to former frontline areas. Contamination from land mines and explosive devices has killed at least 249 people, including 60 children, and injured over 370 since Dec. 8, according to an international organization dedicated to enhancing the safety of aid workers.",
      "publishedAt": "2025-04-20T05:02:02Z",
      "title": "'I thought I'd died.' How landmines are continuing to claim lives in post-Assad Syria",
      "url": "https://apnews.com/article/syria-landmines-assad-amputations-03f8c5672c9dd943622cd622c8d80b6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f6d6af3/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F37%2F2880e03580f6880d75d0d7703bf7%2F1836d6c0bcd14c50a8288f578a6a1a3a"
    },
    {
      "author": "Sheikh Saaliq",
      "description": "U.S. Vice President JD Vance is set to visit India on a four-day tour as the two countries seek to strengthen their partnership by negotiating a bilateral trade deal. Vance will kickstart his visit on Monday when he will meet Prime Minister Narendra Modi in New Delhi. The two leaders are expected to hold discussions on economic, trade and geopolitical ties. The U.S. is India’s largest trading partner, and the trade deal, if achieved, could significantly enhance economic ties between the two countries. Vance’s visit is seen as an important diplomatic mission by President Donald Trump’s administration, and it coincides with a rapidly intensifying trade war between Washington and Beijing.",
      "publishedAt": "2025-04-20T04:26:09Z",
      "title": "Vance set to visit India for bilateral talks on economic, trade and geopolitical ties",
      "url": "https://apnews.com/article/india-us-vance-visit-modi-trade-deal-101ffd4c524469c691fd7d1fd7da2ea0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9c2139/2147483647/strip/true/crop/3785x2129+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F6c%2F2eaf1cdeb48b38c2545dc1ac4440%2Fe3f2c6c204674b1c9708dbcc5d4ec59d"
    },
    {
      "author": "Yuras Karmanau",
      "description": "Dozens of journalists in Belarus have been imprisoned in recent years under a crackdown by authoritarian President Alexander Lukashenko. According to Reporters without Borders, the country of 9.5 million remains Europe’s leading jailer of journalists. The crackdown intensified in 2020 when mass protests broke out after an election — widely denounced as fraudulent — kept Lukashenko in power. One count says 40 media workers are serving long sentences in harsh penal colonies that some compare to Soviet-era prisons. Many are deprived of medical care and isolated from their lawyers and relatives. Some have fled abroad. But after U.S. President Donald Trump returned to office, his administration halted foreign aid that provides vital funding for many independent Belarusian news outlets.",
      "publishedAt": "2025-04-20T04:05:34Z",
      "title": "An incessant crackdown in Belarus hurls dozens of independent journalists into harsh prisons",
      "url": "https://apnews.com/article/belarus-lukashenko-crackdown-journalists-1f4d123b2944d68d5b33d2baf29091f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03fa7e/2147483647/strip/true/crop/6630x3729+0+345/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F31%2Fa149508e9eef894ce045a415c1e6%2Fe3d7e3bc59ae4a34946cd6aa65ebcade"
    },
    {
      "author": "Sean Murphy",
      "description": "Thirty years after the deadliest homegrown attack in U.S. history, former President Bill Clinton will return to Oklahoma City for a remembrance ceremony. Clinton was president on April 19, 1995, when a truck bomb exploded, destroying a nine-story federal building in the city's downtown. He will deliver the keynote address Saturday at a remembrance ceremony near the Oklahoma City National Memorial Museum. Clinton was widely praised for how he helped the city grapple with its grief in the wake of the bombing, which killed 168 people, including 19 children. He says it was a day in his presidency that he will never forget.",
      "publishedAt": "2025-04-19T04:04:32Z",
      "title": "Bill Clinton returns to Oklahoma City 30 years after the bombing",
      "url": "https://apnews.com/article/oklahoma-city-bombing-anniversary-bill-clinton-7705cadbc882630edf068ea45e035a3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2aca37e/2147483647/strip/true/crop/3000x1688+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fc5%2F308a0ce537440200bf1d7ba5dd9a%2F0e9fd2dd999a481db3bd67a914355154"
    },
    {
      "author": "Farai Mutsaka",
      "description": "A collection of Zimbabwean stone sculptures will be the centerpiece of an exhibition at Oxford University meant to “contextualize” the legacy of British colonialist Cecil John Rhodes. They depict the religious deception, forced labor and sexual abuse endured by Zimbabweans close to a century ago. But for many Zimbabwean sculptors, the exhibition is more than a history lesson. It’s a fight for the survival of an ancient art that's struggling because of vast economic challenges and declining tourism in the southern African nation.",
      "publishedAt": "2025-04-20T04:04:34Z",
      "title": "Zimbabwe's stone carvers seek a revival as an Oxford exhibition confronts a British colonial legacy",
      "url": "https://apnews.com/article/zimbabwe-stone-sculpture-art-colonialism-3f8140bbb2188dc868aebb49764c7b75",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed26050/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F77%2F02020d35dfa84b9242fdebdb4ebd%2Fb2f6582f229449e3b35d232ed6d4f123"
    },
    {
      "author": "Gene Johnson",
      "description": "Marijuana culture’s high holiday known as 4/20 falls this year on Easter, as well as the last day of Passover. That means cannabis fans can celebrate in some unusual ways, including an Easter nug hunt in Los Angeles, kosher-style THC gummies in New York and a blaze and praise drag brunch in Portland, Oregon. Some 300 people are expected to partake in the Easter nug scavenger hunt this weekend, aided by a mobile app leading them through participating dispensaries, trivia challenges and so-called stoner activities. The origin of the term 4/20 dates to the 1970s and a group of bell-bottomed buddies at a high school north of San Francisco who called themselves the Waldos.",
      "publishedAt": "2025-04-20T04:42:07Z",
      "title": "Marijuana holiday 4/20 coincides with Easter and Passover this year. Here's what to know",
      "url": "https://apnews.com/article/marijuana-cannabis-holiday-420-easter-sunday-cb03d644627c9fdde04ca9e3a3a619f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f69c369/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F30%2F20461ba50ff12fad8e11b3dbe328%2F67034ecb5768403f973731ed776fac11"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}