{
  "articles": [
    {
      "author": "LISA MASCARO, KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The threat of a federal government shutdown suddenly lifted late Saturday as President Joe Biden signed a temporary funding bill to keep agencies open with little time to spare after Congress rushed to approve the bipartisan deal.",
      "publishedAt": "2023-09-30T04:09:40Z",
      "title": "Government shutdown averted with little time to spare as Biden signs funding before midnight",
      "url": "https://apnews.com/732baaa19c91f981e492fd0e6a76aba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78169ce4053f48af8afb1d17378cdb0e/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional supporters of Ukraine say they won't give up after a bill to keep the federal government open excluded President Joe Biden's request to provide more security assistance to the war-torn nation.",
      "publishedAt": "2023-10-01T04:01:31Z",
      "title": "Ukraine aid left out of government funding package, raising questions about future US support",
      "url": "https://apnews.com/799067491a1bba9671b4dfdf491d0a8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/163a38de25ff488ca2aeda6abc584819/1816.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — He’s driven a taxi cab, played in a band and protested the Vietnam War. As a New York City judge, Arthur Engoron has resolved hundreds of disputes, deciding everything from zoning and free speech issues to a custody fight over a dog named “Stevie.”",
      "publishedAt": "2023-10-01T04:02:53Z",
      "title": "Who is Arthur Engoron? Judge weighing future of Donald Trump empire is Ivy League-educated ex-cabbie",
      "url": "https://apnews.com/9bd42690d327f6f63c9eb31c046f8426",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0d4b4ee5c70498aa537498c17ad48cb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Tens of thousands of now-homeless people have streamed into Armenia from the separatist region of Nagorno-Karabakh, controlled by its emboldened adversary, Azerbaijan.",
      "publishedAt": "2023-10-01T04:31:43Z",
      "title": "Armenia grapples with multiple challenges after the fall of Nagorno-Karabakh",
      "url": "https://apnews.com/c181855e2a88064231a1805480374306",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a7551ecfd0a4292bdb2e38d5d79571a/3000.jpeg"
    },
    {
      "author": "AMY TAXIN",
      "description": "NEW CUYAMA, Calif. (AP) — In the hills of a dry, remote patch of California farm country, Lee Harrington carefully monitors the drips moistening his pistachio trees to ensure they’re not wasting any of the groundwater at the heart of a vicious fight.",
      "publishedAt": "2023-10-01T04:02:38Z",
      "title": "A fight over precious groundwater in a rural California town is rooted in carrots",
      "url": "https://apnews.com/c2f4353f4c1b86eaa9f6e6e1168176c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bba65173aa2445f85a4cccdd71c6a0a/3000.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "TACOMA, Wash. (AP) — Police wrestle the unarmed Black man to the sidewalk. One officer pushes his face into the pavement as he pleads in vain: “Can’t breathe.”Witnesses capture the scene at a dark intersection on their cellphones — one yells, “Hey!",
      "publishedAt": "2023-10-01T05:03:53Z",
      "title": "Washington officers on trial in deadly arrest of Manny Ellis, a case reminiscent of George Floyd",
      "url": "https://apnews.com/4e164d9d8f7107ac390b46e100d83ec8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf2184330ccd47e8a9267a9bbd9ac5e1/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Shaun “Buge” Saribay felt like giving up. Hours of makeshift firefighting with garden hoses and buckets of water across Lahaina didn't stop flames from consuming his house, his rental properties and thousands of other structures in his beloved hometown.",
      "publishedAt": "2023-10-01T04:44:51Z",
      "title": "Native Hawaiian neighborhood survived Maui fire. Lahaina locals praise its cultural significance",
      "url": "https://apnews.com/3953bfa188fcd7e555f62d12ce4ee2c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a544f959d201446893ee17a94b6fb242/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN and TED SHAFFREY",
      "description": "NEW YORK (AP) — On a recent Sunday afternoon, the divers arrived on a thin strip of sand at the furthest, watery edge of New York City. Oxygen tanks strapped to their backs, they waded into the sea and descended into an environment far different from their usual terrestrial surroundings of concrete, traffic and trash-strewn sidewalks.",
      "publishedAt": "2023-10-01T04:05:53Z",
      "title": "In New York City, scuba divers' passion for the sport becomes a mission to collect undersea litter",
      "url": "https://apnews.com/f799ca1b2851d6e5c4791a45ad2416b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31b38b8922f94030bf501ff5c07eab7a/3000.jpeg"
    },
    {
      "author": "SUZAN FRASER",
      "description": "ANKARA, Turkey (AP) — A suicide bomber detonated an explosive device in the heart of the Turkish capital, Ankara, on Sunday A second assailant was killed in a shootout with police, the interior minister said.",
      "publishedAt": "2023-10-01T07:10:34Z",
      "title": "Suicide bomber detonates a device in the Turkish capital. A second assailant is killed in a shootout",
      "url": "https://apnews.com/dfdbae1c7cd90f7e0a48b029c866b561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2972795e4a8345bc8f1b138dc2cd2933/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Sanjay Chauhan witnessed monsoon rains lash down over his home and farm in the Indian Himalayas this year with a magnitude and intensity he's never experienced before.“Buildings have collapsed, roads are broken, there were so many landslides including one that has destroyed a large part of my orchard,\" said the 56-year-old farmer, who lives in the town of Shimla in Himachal Pradesh.",
      "publishedAt": "2023-10-01T06:11:39Z",
      "title": "India's devastating monsoon season is a sign of things to come, as climate and poor planning combine",
      "url": "https://apnews.com/b1d095811f252ab82268dbefbeef5b3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e5996638586485b8f7694ef4efa8895/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}