{
  "articles": [
    {
      "author": null,
      "description": "Texas Democrats have left the state in an attempt to prevent the state House from holding a vote Monday on new congressional maps that Republicans hope will net them several additional U.S. House seats in the 2026 midterm elections. The dramatic move Sunday could expose Democrats to fines and other penalties. Democrats have cast the decision to leave the state as a last-ditch effort to stop Republicans from pushing through a rare mid-decade redrawing of the congressional map. Republican Gov. Greg Abbott called a special session of the Legislature that started last month to take up the redistricting effort that President Donald Trump has urged.",
      "publishedAt": "2025-08-04T06:22:09Z",
      "title": "Texas governor threatens Democrats for leaving state to block vote on Trump-backed redistricting",
      "url": "https://apnews.com/article/us-election-2026-texas-redistricting-136cfeddc717f9fc69337bd3d39b1819",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f539c5/2147483647/strip/true/crop/5012x2819+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fcd%2Fb54dc5862635bcfd0ffb3a5750c2%2Fc069bc1f2bec4bbabe44b0a067830cb9"
    },
    {
      "author": null,
      "description": "Loni Anderson, who played a struggling radio station’s empowered receptionist Jennifer on the hit TV comedy “WKRP in Cincinnati,” has died. It was just days before her 80th birthday. Her longtime publicists says Anderson died at a Los Angeles hospital following a “prolonged” illness. “WKRP in Cincinnati” aired from 1978 through 1982 and was set in a lagging Ohio radio station trying to reinvent itself with rock music. As the station’s sexy and smart receptionist, Jennifer used her sex appeal to deflect unwanted business calls for her boss, Mr. Carlson. Her efficiency often kept the station running in the face of others’ incompetence.",
      "publishedAt": "2025-08-03T22:11:22Z",
      "title": "Actor Loni Anderson has died",
      "url": "https://apnews.com/article/loni-anderson-actor-died-obituary-3614dc44dbad987f74fc4cd64bd3e7fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "South Korea’s military says it has begun removing loudspeakers along its border with rival North Korea in a move aimed at reducing tensions. The speakers had previously been used to blast anti-North Korean propaganda across the border, but the South’s new liberal government halted the broadcasts in June in a conciliatory gesture as it looks to rebuild trust and revive dialogue with Pyongyang. South Korea’s Defense Ministry said the physical removal of the loudspeakers from the border was another “practical measure” aimed at easing tensions between the war-divided Koreas and that it does not affect the South’s military readiness.",
      "publishedAt": "2025-08-04T02:55:02Z",
      "title": "South Korea removes loudspeakers along its border with North Korea",
      "url": "https://apnews.com/article/south-korea-loudspeaker-border-removal-north-korea-tensions-0ee53f235ea436916f29a96b6af2bb51",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2f0372/2147483647/strip/true/crop/5650x3178+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F28%2F0ed6e35623b01e9769fb80ea12eb%2F8e62aa88a79248b7aac02921b97136ef"
    },
    {
      "author": null,
      "description": "Hospital officials and witnesses say Israeli forces have killed at least 23 Palestinians seeking food in the Gaza Strip. The incident happened on Sunday as hungry crowds surged around aid sites. Desperation has gripped the territory, home to over 2 million people, amid warnings of famine due to Israel’s blockade and ongoing offensive. Witnesses described Israeli troops opening fire on crowds near distribution points. The Gaza health ministry also said six more Palestinian adults died of malnutrition-related causes in the Gaza Strip in the past 24 hours. Ninety-three children have also died of causes related to malnutrition since the war in Gaza started last year, it said.",
      "publishedAt": "2025-08-03T10:35:55Z",
      "title": "Israeli forces kill over 20 people seeking food in Gaza, witnesses and health officials say",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-aid-famine-f1653318afd36b1b11090a4402233705",
      "urlToImage": "https://dims.apnews.com/dims4/default/e85e381/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F8f%2F7623f76169565b7ad76839275c25%2F43ab38e0c2514b15a778e6be82c158c6"
    },
    {
      "author": null,
      "description": "Boeing workers who build fighter jets are planning to go on strike. About 3,200 workers at facilities in St. Louis and other locations voted to reject a modified four-year labor agreement with Boeing. That is according to the International Association of Machinists and Aerospace Workers union. The union says its workers deserve nothing less than a contract that keeps their families secure and recognizes their unmatched expertise. Boeing says the company is disappointed its employees rejected an offer that featured 40% average wage growth and resolved issues about work schedules.",
      "publishedAt": "2025-08-03T20:43:00Z",
      "title": "3,200 Boeing workers to strike at midnight over fighter jet labor deal",
      "url": "https://apnews.com/article/boeing-strike-union-fighter-jets-3cc6357adc8bda4bacb334204d081fd4",
      "urlToImage": "https://dims.apnews.com/dims4/default/a987541/2147483647/strip/true/crop/5152x2898+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F1c%2F9fcb48f52134cba13eacf0339ab5%2F232ecadbc91c4f52ae2de5aa87f97685"
    },
    {
      "author": null,
      "description": "The Justice Department is ramping up an effort to get election data from the states. According to an Associated Press tally, the department's voting section has requested copies of voter registration lists from state election administrators in at least 15 states. And department lawyers have contacted officials in at least seven states to propose a meeting about forging an information-sharing agreement related to instances of voting or election fraud. The unusually expansive outreach has raised alarm among some election officials. That's because states have the constitutional authority to run elections and because federal law protects the sharing of individual data with the government.",
      "publishedAt": "2025-08-03T11:29:32Z",
      "title": "Justice Department's requests for voter data raise alarm in some states",
      "url": "https://apnews.com/article/justice-department-election-officials-voting-trump-a04b1522bed0cb6bbc286e25b139701f",
      "urlToImage": "https://dims.apnews.com/dims4/default/decec10/2147483647/strip/true/crop/3217x1810+0+167/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Fd2%2F50c6ab744e9be150c1f4a1bbdb99%2F6dddd4e0dc304f8580a5a41e8efa7557"
    },
    {
      "author": null,
      "description": "Authorities say a former US soldier suspected of killing four people at a Montana bar is still at large and believed to be armed. The shooting occurred on Friday morning at The Owl Bar in Anaconda, Montana. Officials believe 45-year-old military veteran Michael Paul Brown committed the shooting with a rifle. Montana Attorney General Austin Knudsen on Sunday warned residents that Brown could return to the area. Investigators are considering all possible options for Brown's whereabouts. Brown served in the Army and Montana National Guard and has struggled with mental illness for years, family members say.",
      "publishedAt": "2025-08-03T17:55:41Z",
      "title": "Search continues for suspect in Montana bar shooting",
      "url": "https://apnews.com/article/montana-shooting-four-dead-michael-paul-brown-38a642f1f2a66ab9e6408fc74766e08e",
      "urlToImage": "https://dims.apnews.com/dims4/default/98a2a95/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F85%2F5b008ac45077d995d02e59bba750%2F4a2e4fac54384b118d6d69afda474e51"
    },
    {
      "author": null,
      "description": "The U.N.'s migration agency reports that at least 68 African migrants have died and 74 others are missing after their boat capsized off Yemen. The incident occurred on Sunday. Abdusattor Esoev, head of the International Organization for Migration in Yemen, says the boat carried 154 Ethiopian migrants and capsized near Yemen’s Abyan province. Twelve migrants survived the shipwreck. The bodies of 54 migrants washed ashore in the district of Khanfar, and 14 others were found dead at a different location and taken to a hospital morgue.",
      "publishedAt": "2025-08-03T18:45:46Z",
      "title": "UN says 68 African migrants were killed when boat capsized off Yemen",
      "url": "https://apnews.com/article/migration-yemen-shipwreck-c2c28d70e51ed01086493aaece2e4f35",
      "urlToImage": "https://dims.apnews.com/dims4/default/8153950/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fce%2F8ec5f570b98b8599fb570d4a9e4f%2F1e1a5d3bd55743778d41f8b93e00d353"
    },
    {
      "author": null,
      "description": "Tennessee authorities have arrested two men they say are connected to the case of four murdered family members who were related to an abandoned infant. The Tennessee Bureau of Investigation charged Tanaka Brown and Giovonte Thomas with accessory after the fact to first-degree murder. Authorities allege both men “assisted” 28-year-old Austin Robert Drummond in the murders, but did not specify how. Authorities have left many unanswered questions, including how the four relatives were killed and how the family's baby ended up in a car seat in a yard in the Tigrett area. Law enforcement officers are still searching for Drummond.",
      "publishedAt": "2025-08-03T16:28:11Z",
      "title": "2 men charged with assisting suspect in Tennessee family murders",
      "url": "https://apnews.com/article/abandoned-infant-four-dead-tiptonville-tennessee-d604c6cc37a93a53a79379b5eeee5140",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1d5753/2147483647/strip/true/crop/2480x1395+13+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2Fe8%2F9b95f789710b6c0540ff246b847b%2F964cdd711a964e578301842b515114c3"
    },
    {
      "author": null,
      "description": "Russian officials say a Ukrainian drone attack on an oil depot near Russia’s Black Sea resort of Sochi has sparked a major fire. More than 120 firefighters have been working to extinguish the blaze. Russia’s civil aviation authority temporarily stopped flights at Sochi’s airport. Meanwhile, in southern Ukraine, a Russian missile strike hit a residential area in Mykolaiv, wounding seven people. Ukrainian President Volodymyr Zelenskyy announced that Ukraine and Russia have agreed to exchange 1,200 prisoners following negotiations in Istanbul. There was no immediate comment from Russia.",
      "publishedAt": "2025-08-03T08:01:11Z",
      "title": "Ukrainian drone attack sparks massive fire at Russian oil depot near Sochi",
      "url": "https://apnews.com/article/russia-ukraine-war-depot-drones-missiles-ceasefire-1bf8440535e8fa32bc66310ea37658d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}