{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "President Donald Trump says he has told Israeli Prime Minister Benjamin Netanyahu to hold off on an Iran strike to give his administration more time time to push for new nuclear deal with Tehran. Trump told reporters at the White House that he told Netanyahu a strike “would be inappropriate to do right now because we’re very close to a solution.” Trump's comments on Wednesday came as the head of the U.N.'s atomic watchdog group said that “the jury is still out” on negotiations between Iran and the U.S. over Tehran’s rapidly advancing nuclear program. But Rafael Mariano Grossi described the continuing negotiations as a good sign.",
      "publishedAt": "2025-05-28T10:50:15Z",
      "title": "Trump says he warned Netanyahu to hold off on Iran strike to give US more time for nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-0613bd70b6a47ed2f583177e54473a21",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4a3fa7/2147483647/strip/true/crop/8297x4667+0+432/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F6c%2Feff989ae4299eb40ecd524d5f064%2F3c3348f272d244db9a332110ae89721d"
    },
    {
      "author": null,
      "description": "A U.N. official says 47 Palestinians were wounded, mostly by gunfire, when crowd overran Gaza aid hub. Ajith Sunghay, head of the U.N. Human Rights Office for the Palestinian territories, said it appeared that Israeli army fire had caused most of the injuries. On Tuesday, crowds of Palestinians overwhelmed a new aid distribution hub set up by an Israeli and U.S.-backed foundation. The crowd broke through fences and an Associated Press journalist heard Israeli tank and gun fire, and saw a military helicopter firing flares. The distribution hub outside Gaza’s southernmost city of Rafah was opened the day before by the Gaza Humanitarian Foundation, which has been slated by Israel to take over aid operations.",
      "publishedAt": "2025-05-28T06:59:43Z",
      "title": "UN official says 47 were wounded, mostly by gunfire, when crowd overran aid hub in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-05-28-2025-d4fdbe80de0ac3edd24cf17227c0e3c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbee8a1/2147483647/strip/true/crop/7716x4340+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F8a%2F6eaa81bf01237452eaaef2ae4a52%2F326322584baa4389ba0d13c38952f823"
    },
    {
      "author": "Samy Magdy, Bassem Mroue",
      "description": "Israeli Prime Minister Benjamin Netanyahu says the man believed to be the head of Hamas’ armed wing, Mohammed Sinwar, has been killed, apparently confirming his death in a recent strike in the Gaza Strip. There was no confirmation from Hamas. Sinwar is the younger brother of Yahya Sinwar, the Hamas leader who helped mastermind the Oct. 7, 2023, attack that started the Israel-Hamas war. He was killed by Israeli forces in October 2024. Israeli strikes have decimated Hamas’ Gaza leadership during the 19-month war. But the militant group has maintained its rule over the parts of Gaza not seized by Israel and still holds dozens of hostages.",
      "publishedAt": "2025-05-28T15:07:14Z",
      "title": "Who is Mohammed Sinwar, the Hamas leader Israel says it killed?",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-mohammed-sinwar-leader-strike-6bd5f3688636c8bb5bda9dad7ab57b7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/faa9647/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F8c%2Fc4ec7a526b16c1e600ea8b218b84%2F05c12a4b1e1144c2a7c33b3b295245f8"
    },
    {
      "author": "Stefanie Dazio",
      "description": "Ukrainian President Zelenskyy will visit Berlin to meet with new German Chancellor Friedrich Merz. The talks on Wednesday come amid an escalation in Russia’s bombing campaign despite U.S.-led attempts at peace talks. Germany has been the second-biggest supplier of military aid to Ukraine after the United States. Zelenskyy’s visit on Wednesday comes two days after Merz said his country and other major allies are no longer imposing any range restrictions on weapons supplied to Ukraine as it fights the Russian invasion. Russian forces launched an attack overnight on Ukraine using five Iskander ballistic missiles, one guided air-launched missile and 88 drones.",
      "publishedAt": "2025-05-28T07:31:44Z",
      "title": "Zelenskyy visits Berlin as he seeks more support for Ukraine in the war against Russia",
      "url": "https://apnews.com/article/russia-ukraine-war-germany-zelenskyy-merz-35c583e769bfd89eed738125802637ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/829835a/2147483647/strip/true/crop/5329x2998+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fa3%2F20e193887e906c968ccb0854af34%2F195290eadef14d819bd2077b3ddb36b5"
    },
    {
      "author": "Chris Megerian",
      "description": "Elon Musk is criticizing the centerpiece of President Donald Trump’s legislative agenda, saying he's “disappointed” in what the president calls his “big beautiful bill.” It's a significant fracture in a partnership that was forged during last year’s campaign and was poised to reshape American politics and the federal government. Musk made his comments in an interview with CBS that came out Tuesday night. He said the legislation “undermines the work” of his Department of Government Efficiency, known as DOGE. Republicans recently pushed the legislation through the House and are debating it in the Senate.",
      "publishedAt": "2025-05-28T14:06:19Z",
      "title": "Musk criticizes Trump's 'big beautiful bill,' a fracture in a key relationship",
      "url": "https://apnews.com/article/elon-musk-donald-trump-big-beautiful-bill-aa2bc70b0ebdb219b5dd3e9f8fae03af",
      "urlToImage": "https://dims.apnews.com/dims4/default/f161287/2147483647/strip/true/crop/5442x3061+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Ff5%2Ff06015417d7248d1246561ae996a%2Fab50885507a94869b2eaa2e8a418204e"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A federal judge has immediately rejected a defense request for a mistrial at the sex trafficking trial of music mogul Sean “Diddy” Combs. This was the first such request at Combs’ trial, which is in its third week of testimony in Manhattan. A defense lawyer said Wednesday that prosecutors posed questions to a Los Angeles Fire Department investigator which could imply to the jury that Combs interfered in the probe of another rapper's firebombed luxury car. After a break, the judge instructed the jury to disregard questions related to destroyed fingerprint cards. Combs has pleaded not guilty to leading a racketeering conspiracy that relied on fear and violence to get what he wanted.",
      "publishedAt": "2025-05-28T17:23:58Z",
      "title": "Judge quickly rejects mistrial request at Sean 'Diddy' Combs trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-kid-cuddi-9c419869ad6d18e71fdb22841684088a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae00258/2147483647/strip/true/crop/1879x1057+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fd5%2F7af57f8c87679d031e2680d30d86%2F249bea85eb6f449ba3e66eae1f3f6dbb"
    },
    {
      "author": "Cedar Attanasio, Amanda Seitz",
      "description": "Releases of immigrant children in U.S. custody have slowed dramatically since the Trump administration increased vetting of people seeking to take care of them. Government data show only 45 of more than 2,000 children in custody were released last month. The average child stay in federal shelters has gone up from just over one month to just over seven months. Relatives looking to get the children out of government custody as they apply for legal immigration protections say there are massive delays. DNA tests take many weeks. New requirements for proof of income and identity demand documents that many caretakers — especially those in the U.S. illegally — cannot obtain.",
      "publishedAt": "2025-05-28T16:22:35Z",
      "title": "Trump's rules slow release of migrant children to their families",
      "url": "https://apnews.com/article/migrants-trump-border-shelters-4f6a2d79ebf9c899abdad809aab6c815",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd0d002/2147483647/strip/true/crop/5709x3211+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F9a%2Ff939a50f444edef7b37429be0297%2F58987023f4844493a445bd5b83522430"
    },
    {
      "author": null,
      "description": "British prosecutors say influencer brothers Andrew and Tristan Tate have been charged with rape and other crimes. Andrew Tate, 38, faces charges related to three women that include rape, actual bodily harm, human trafficking and controlling prostitution for gain. Tristan Tate, 36, faces charges related to one woman that include rape, human trafficking and actual bodily harm.",
      "publishedAt": "2025-05-28T16:35:31Z",
      "title": "Tate brothers face rape and trafficking charges in the UK",
      "url": "https://apnews.com/article/tate-brothers-andrew-tristan-rape-uk-britain-085cf07c394f4ead035b86f981060e92",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a746d1/2147483647/strip/true/crop/6259x3521+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2Fe8%2F62e738d5221be0a7110517fbb4fc%2F18148513c8cb43959b416e44322d38a1"
    },
    {
      "author": "Alan Suderman",
      "description": "The headline-grabbing tale of an Italian man who said he was kidnapped and tortured for weeks inside an upscale Manhattan townhouse by captors seeking his bitcoin highlights a dark corner of the cryptocurrency world: the threat of violence by thieves seeking digital assets. The alleged attempted robbery is known as a “wrench attack.” It’s a name popularized by an online comic that mocked how easily high-tech security can be undone by hitting someone with a wrench until they give up passwords. Wrench attacks are on the rise thanks in part to cryptocurrency’s move into mainstream finance, experts say.",
      "publishedAt": "2025-05-28T15:02:51Z",
      "title": "Why 'wrench attacks' on wealthy crypto holders are on the rise",
      "url": "https://apnews.com/article/crypto-bitcoin-kidnapping-wrench-attack-ddc7263c25ba590f85648e1682576971",
      "urlToImage": "https://dims.apnews.com/dims4/default/405316a/2147483647/strip/true/crop/4800x2700+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F98%2Fb9285b39821737a7035be1e47eba%2F6a2e2865596d420f853070352aa480e8"
    },
    {
      "author": "Marcia Dunn",
      "description": "Astronomers have discovered a strange new object in our Milky Way galaxy. The celestial object is emitting X-rays around the same time it's shooting out radio waves. Located 15,000 light-years away, scientists say this object could be a star, pair of stars or something else entirely. Findings were published Wednesday in the journal Nature. NASA’s Chandra X-ray Observatory spotted the X-ray emissions by chance last year while focusing on a supernova remnant, or the remains of an exploded star. The hyperactive phase of this object appeared to last about a month.",
      "publishedAt": "2025-05-28T15:02:40Z",
      "title": "Astronomers discover strange new celestial object in our Milky Way galaxy",
      "url": "https://apnews.com/article/strange-celestial-object-milky-way-7c119d11d37b2b5b0fa254154b4aba8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}