{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Forced leaves have begun in Washington and worldwide for most employees of the U.S. Agency for International Development. Under a Trump administration plan, the agency is to be left with fewer than 300 workers out of many thousands. The leaves at USAID started Friday. Federal workers associations have turned to the courts to try to roll back orders dismantling most of the agency and U.S.- funded aid programs around the world. It's not clear whether the reduction to 300 would be permanent or temporary, potentially allowing more workers to return after what Trump administration says is a review of the aid and development programs it wants to resume.",
      "publishedAt": "2025-02-07T13:55:18Z",
      "title": "Forced leaves start for thousands at USAID under a Trump plan to gut the foreign aid agency",
      "url": "https://apnews.com/article/usaid-foreign-aid-trump-rubio-48f8460804d33bdaa18d7765c4b24f9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/75a7e4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F06%2F50d0ce2890d770e8b85e9bdc4574%2F786b30dbc5b847ecadb76eeabd1c5461"
    },
    {
      "author": "BRIAN WITTE",
      "description": "President Donald Trump's administration has ordered all federal departments and agencies to provide lists of employees who are underperforming. The memo was sent Thursday as the administration seeks to shrink the workforce and awaits a court ruling related to its deferred resignation offers. The memo from the Office of Personnel Management directs the agencies to submit names of every employee who has received less than a “fully successful” performance rating in the past three years and to note whether the workers have been on performance plans. That data is due March 7.",
      "publishedAt": "2025-02-07T19:28:18Z",
      "title": "Trump administration orders federal agencies to provide lists of underperforming employees",
      "url": "https://apnews.com/article/trump-federal-employees-lists-underperforming-layoffs-80755cea03a93c2b6d00e21fb1716e39",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbb2cf5/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fec%2F178b4c0d051974fce9dff2f7a659%2F585af19ec9bd411d9e73456def55cf32"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump says he is firing members of the board of trustees for the Kennedy Center and naming himself chairman. He also indicated that he will use the post to dictate programming at one of the nation’s premier cultural institutions. He wrote on social media Friday that “At my direction, we are going to make the Kennedy Center in Washington D.C., GREAT AGAIN.\" He says the current chairman, philanthropist David Rubenstein, is among those who “do not share our Vision for a Golden Age in Arts and Culture.” He says, \"We will soon announce a new Board, with an amazing Chairman, DONALD J. TRUMP!”",
      "publishedAt": "2025-02-08T01:05:38Z",
      "title": "Trump says he's firing Kennedy Center board of trustees members and naming himself chairman",
      "url": "https://apnews.com/article/trump-kennedy-center-board-chairman-firings-21cd0018c6e9f591d59becea8573d8c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/75c2420/2147483647/strip/true/crop/6346x3570+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2Fd4%2F3c18df4b93fca18c175134352641%2Ffc65af1e402147e7ba238259136dc7e7"
    },
    {
      "author": "BILL BARROW",
      "description": "Donald Trump’s second administration has advanced an avalanche of policy action and political pronouncements that have jolted Washington and, in some cases, the world. The agenda is taken largely from his “Agenda 47” campaign proposals, the Heritage Foundation’s Project 2025 and other hard-right influencers with juice in Trump’s White House. But between Trump and his allies, there is still a to-do list. It includes goals like shuttering the Department of Education, remaking U.S. higher education, loosening federal labor law and pursuing sweeping tax and trade legislation on Capitol Hill. Trump allies also want to restrict medication abortions. And the president still hasn't delivered on his promise to end wars in Ukraine and Israel.",
      "publishedAt": "2025-02-08T05:04:48Z",
      "title": "What has Donald Trump not done yet?",
      "url": "https://apnews.com/article/trump-executive-orders-agenda-goals-whats-next-49c6487c19dee2e09e8f04c7bef83a01",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea280c5/2147483647/strip/true/crop/7178x4038+0+376/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F61%2Fd2eb806deac120535f1454ff32b9%2F0e865239321649579cb6ca784772ed0f"
    },
    {
      "author": "GEOFF MULVIHILL, JOHN HANNA",
      "description": "For transgender Americans, passports just became a lot more complicated. President Donald Trump issued an executive order saying there are two sexes, male and female, and rejecting the idea that people can transition to a gender identify different from the one assigned at birth. The passport policy is among several actions Trump has taken since returning to office that could stifle rights and legal recognition of transgender, intersex and nonbinary people. Transgender people have reported having requests to change the gender marker on their passports denied and being asked to swear to a sex assigned at birth rather than the gender they live as. Several transgender people are challenging the order in court.",
      "publishedAt": "2025-02-08T05:14:13Z",
      "title": "Trump's passport gender policy change brought uncertainty for applicants",
      "url": "https://apnews.com/article/trump-order-transgender-nonbinary-passport-dd7d25350afea024c0a9de1011174e2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1df0e1/2147483647/strip/true/crop/5578x3138+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Ff7%2F5dcef3be5994f62fc6ef82f53904%2F2b655bcdff414b0590d2731a8b777811"
    },
    {
      "author": "BECKY BOHRER, HALLIE GOLDEN",
      "description": "Just hours after finding 10 people dead in western Alaska from one of the deadliest plane crashes in the state in 25 years, authorities are racing to recover their remains and the wreckage of the small commuter plane from unstable sea ice before expected high winds and snow. The plane crashed on its way to the hub community of Nome on Thursday afternoon, killing everyone on board. As the community tried to process the deadly event Friday, crews worked swiftly on unstable, slushy ice to recover the dead passengers and aircraft with less than a day before the bad weather was expected. Officials said a Black Hawk helicopter would be used to move the wreckage.",
      "publishedAt": "2025-02-08T05:48:56Z",
      "title": "Crews rush to recover commuter plane found crashed on Alaska sea ice before expected snow and wind",
      "url": "https://apnews.com/article/alaska-plane-crash-10-dead-9ebe8b2f0b69c6b6cda7d284fbfc35cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d55beaf/2147483647/strip/true/crop/4796x2698+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fe5%2F1935ce8f84cd44418398d4618600%2F094769e709134b4695bc1d2aa74f1847"
    },
    {
      "author": "JIM MORRIS",
      "description": "Prime Minister Justin Trudeau says President Donald Trump’s talk of making Canada the 51st state is “a real thing” and is linked to the country’s rich natural resources. Trudeau’s comments to business and labor leaders in a closed-door session were mistakenly carried by a loudspeaker, Canada’s public broadcaster CBC reported. “Mr. Trump has it in mind that the easiest way to do it is absorbing our country and it is a real thing. In my conversations with him on…,” Trudeau said before the microphone cut out, according to CBC. Trudeau’s office did not immediately respond to a request for comment.",
      "publishedAt": "2025-02-07T19:50:08Z",
      "title": "Justin Trudeau reportedly says Trump’s talk of making Canada a US state is 'a real thing'",
      "url": "https://apnews.com/article/canada-us-tariffs-trudeau-trump-5cfe160c66f90b973d90ea7810cddbe5",
      "urlToImage": "https://dims.apnews.com/dims4/default/acf6eba/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fe1%2F37561cc2ccf5775b00bf5d7bb918%2F64f7f478ca1340d8846a437ce3a2c8c0"
    },
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH, TIA GOLDENBERG",
      "description": "Israel has begun releasing dozens of Palestinian prisoners after Hamas freed three Israeli hostages. It is the latest such exchange under the ceasefire in the Gaza Strip that took hold last month. Associated Press reporters saw a bus carrying a few dozen Palestinian prisoners heading to a meeting point where their families, friends and well-wishers were waiting.",
      "publishedAt": "2025-02-08T04:17:11Z",
      "title": "Israel confirms it has received 3 hostages freed by Hamas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-08-2025-bf94014ccedeb15b4d235a1df57b563a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d64369/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Feb%2F8c69ebd9dcba55e542c74e98b5d4%2Fe450bfd7223647f58bc2732a2387853e"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "President Donald Trump’s administration is using federal prisons to detain some people arrested in its immigration crackdown. The federal Bureau of Prisons confirmed the move Friday in a statement to The Associated Press. It's a return to a detention strategy that drew allegations of mistreatment during Trump’s first term. In a statement to AP, the prison agency said it is assisting U.S. Immigration and Customs Enforcement “by housing detainees and will continue to support our law enforcement partners to fulfill the administration’s policy objectives.” The Bureau of Prisons has declined to say how many immigration detainees it is accepting, or which prison facilities are being used.",
      "publishedAt": "2025-02-07T16:55:19Z",
      "title": "Federal prisons being used to detain people arrested in Trump’s immigration crackdown",
      "url": "https://apnews.com/article/immigration-federal-prisons-trump-25d676a6ebbff139ae04a75cd91be7e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec41fe5/2147483647/strip/true/crop/3781x2127+0+129/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Fcc%2Febf529431053694e3b0672db6ad9%2F21d3908339a9418083082c95392e4be1"
    },
    {
      "author": "AAMER MADHANI, MARI YAMAGUCHI",
      "description": "President Donald Trump plans to cover a range of issues in his meeting with Japanese Prime Minister Shigeru Ishiba. He wants to talk about joint training exercises, Japanese investment in the U.S. economy, improving cyber security, increasing space cooperation, and promoting joint business opportunities to develop critical technologies. Ishiba, for his part, will look to remind Trump about the long-running U.S.-Japan alliance. Japanese companies employ nearly 1 million Americans and have held the top spot for cumulative foreign direct investment into the U.S. over the last five years. Ishiba arrived at the White House around midday on Friday and he and Trump are holding their first face-to-face talks.",
      "publishedAt": "2025-02-07T12:03:07Z",
      "title": "Japan's Ishiba makes a whirlwind Washington trip to try to forge a personal connection with Trump",
      "url": "https://apnews.com/article/trump-ishiba-us-japan-cd84a0e7306ab4b8b7e03bc8b76aa06c",
      "urlToImage": "https://dims.apnews.com/dims4/default/892c2c7/2147483647/strip/true/crop/5502x3095+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fa5%2F15535aa6353a940e3ed516bc6340%2Fb2c2dc7635d04d44b87afb8fedb373da"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}