{
  "articles": [
    {
      "author": "MATTHEW LEE, AAMER MADHANI, JILL COLVIN",
      "description": "Job-seekers hoping to join the new Trump administration are facing a series of intense loyalty tests. And White House screening teams are fanning out to government agencies and carefully going through applicants’ politics and social media posts. President Donald Trump believed the biggest mistake he made during his first term was hiring what he considered to be the wrong kinds of people. Now, aides are working to ensure the government is filled only with loyalists. Negative social media posts have been enough to derail applications. Job-seekers have been told they'll have to prove their “enthusiasm” to implement Trump’s agenda and they've been asked when their moment of “MAGA revelation” occurred.",
      "publishedAt": "2025-01-25T17:43:44Z",
      "title": "Inside the Trump White House's intense screening of job-seekers",
      "url": "https://apnews.com/article/trump-loyalty-white-house-maga-vetting-jobs-768fa5cbcf175652655c86203222f47c",
      "urlToImage": "https://dims.apnews.com/dims4/default/183dc33/2147483647/strip/true/crop/5687x3199+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F83%2Feb4f50ae38360ce2f1ff3562c807%2F61c9a351627548f391f650d6fbdfb0fd"
    },
    {
      "author": "ZEKE MILLER, ERIC TUCKER, WILL WEISSERT",
      "description": "The Trump administration has fired about 17 independent inspectors general at federal agencies. The action removes oversight of his new administration, and some members of Congress are suggesting the dismissals violate federal oversight laws. The dismissals began Friday night and were effective immediately. That's according to two people familiar with the actions who spoke on condition of anonymity to provide details that haven't been made public. Congress was not given 30-day notices about the removals. And that's something that even a top Republican is decrying. Trump has used his first week back in office to institute a sweeping shakeup of the federal government.",
      "publishedAt": "2025-01-25T16:32:45Z",
      "title": "Trump fires more than a dozen independent inspectors general",
      "url": "https://apnews.com/article/trump-inspectors-general-fired-congress-unlawful-4e8bc57e132c3f9a7f1c2a3754359993",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a82e2d/2147483647/strip/true/crop/3260x1834+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F3a%2F45156d9923f0a909da3442cb6f56%2F0d0db091ad5549a9b5e51b660f63643b"
    },
    {
      "author": "ZEKE MILLER, JOSH BOAK",
      "description": "Donald Trump’s first week in office isn’t over yet, but what the Republican president has done so far offers clues about how his next four years in the White House may unfold. The early days of Trump's second term indicate that Trump is still Trump, but he seems emboldened like never before. He’s much more organized this time around. And he's betting he can fix everything. Trump doesn't have to worry about reelection. The Supreme Court has now granted presidents expansive immunity. And Trump is backed by a Republican Congress. So there's little to restrain him today.",
      "publishedAt": "2025-01-25T13:08:59Z",
      "title": "Takeaways from the Donald Trump’s first week in office",
      "url": "https://apnews.com/article/trump-takeaways-inauguration-pardons-first-week-b153c325399ede1cc7044bf41f9a9e1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6a99ae/2147483647/strip/true/crop/4680x2633+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F0e%2F4e865d435d4f60d61408ee0a26e2%2F3b43c63b0bf743749a64e04679c3c24f"
    },
    {
      "author": "TARA COPP",
      "description": "The U.S. Air Force has removed training courses for service members that included historical videos of its storied Black Tuskegee Airmen and Women Airforce Service Pilots, or WASPs — female World War II pilots. The step was to comply with the Trump administration’s DEI ban. The videos were shown to new enlisted troops as part of the diversity courses they took in basic training. The problem may not be with the videos themselves, but that they were used in DEI coursework. The lack of clearer guidance has led the Air Force and other agencies to take a broad approach to content they are removing from training.",
      "publishedAt": "2025-01-25T19:57:40Z",
      "title": "DEI ban: Air Force removes course videos of Tuskegee Airmen, female pilots",
      "url": "https://apnews.com/article/air-force-dei-tuskegee-women-wwii-pilots-ecdeac68dc7696535d093c7690ab73bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/22a0500/2147483647/strip/true/crop/4161x2341+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F2b%2F6232b54def1163d780dfd6a287ef%2Ff56fcd5fe7d24304adc05855e5ea8b7e"
    },
    {
      "author": "THOMAS BEAUMONT, MEG KINNARD",
      "description": "Allies of President Donald Trump have been quick to threaten primary challengers for Republican senators who don’t back Trump's Cabinet picks and legislative priorities. Five senators in particular have drawn early attention. They are Joni Ernst of Iowa, Thom Tillis of North Carolina, Bill Cassidy of Louisiana, John Cornyn of Texas, and Lindsey Graham of South Carolina. But all bring their own strengths and a history of winning in their states.",
      "publishedAt": "2025-01-25T14:58:13Z",
      "title": "How key Republican senators are responding to Trump allies' primary threats",
      "url": "https://apnews.com/article/ernst-tillis-cassidy-cornyn-graham-musk-9a70ea4d8f1f75d5f3f62689da430b50",
      "urlToImage": "https://dims.apnews.com/dims4/default/108e255/2147483647/strip/true/crop/5417x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F35%2Fd232875bf7a7bcc6f5be2e3bf221%2F900f5e3b24954503805b589c0aa47a26"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Pete Hegseth has been sworn as the nation’s 29th secretary of defense. Hegseth took the oath Saturday in Washington from Vice President JD Vance less than 12 hours after a dramatic late-night vote in the Senate installed him as the Pentagon's leader. The unusually narrow confirmation came after questions from members in both parties over Hegseth’s qualifications to lead the military amid allegations of heavy alcohol use and aggressive behavior toward women. Hegseth thanked Trump for his support and pledged that as defense secretary, he'll be focused on “putting America first” and rebuilding the U.S. military.",
      "publishedAt": "2025-01-25T16:21:24Z",
      "title": "Pete Hegseth quickly sworn in as defense secretary",
      "url": "https://apnews.com/article/pete-hegseth-confirmed-pentagon-trump-defense-secretary-1b9c9725e77812071d300a0de3a4c510",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ee061c/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F67%2Fe529ebacb426b05392cfce561e98%2F8c7cc9a76f4e4dd4833bb225a4384805"
    },
    {
      "author": "WAFAA SHURAFA, ISABEL DEBRE, SAM MEDNICK, SAMY MAGDY",
      "description": "Four female Israeli soldiers who were taken in the attack that sparked the war in Gaza have returned to Israel after Hamas militants paraded them before a crowd of thousands and handed them over to the Red Cross. Israel later released 200 Palestinian prisoners Saturday in the second exchange of a fragile ceasefire. Hamas again sought to show it remained in control in Gaza after 15 months of war. In the ceasefire's first major crisis, Israel said it would not allow displaced Palestinians to begin returning to northern Gaza as had been expected by Sunday. It said a civilian hostage meant to be released, Arbel Yehoud, had not been freed.",
      "publishedAt": "2025-01-25T03:41:50Z",
      "title": "Gaza ceasefire: Hamas frees 4 female Israeli soldiers in exchange for 200 prisoners",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-25-2025-150674e17bd8b22f2c2c3aa4991cf061",
      "urlToImage": "https://dims.apnews.com/dims4/default/889ef01/2147483647/strip/true/crop/4657x2620+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Fd1%2Fc3054ba2519e2a3b164b7279d237%2F87a283a4e7d9473f9713ebab5b6bd6c7"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "The Israeli military has set up roadblocks across border towns and roads in a strategic valley in southern Lebanon. The activity Saturday comes a day before the deadline for it to withdraw from the area under an agreement that halted Israel's war with the Hezbollah militant group. The Israeli military, meanwhile, has confirmed that it will not complete its withdrawal from southern Lebanon by Sunday as outlined in the ceasefire agreement. The deal that went into effect in late November gave both sides 60 days to remove their forces from southern Lebanon and for the Lebanese army to move in and secure the area, along with U.N. peacekeepers.",
      "publishedAt": "2025-01-25T19:50:55Z",
      "title": "Israel announces it won’t withdraw from southern Lebanon by deadline",
      "url": "https://apnews.com/article/lebanon-israel-ceasefire-deadline-withdraw-idf-hezbollah-e00203872d19b1fed9eef801c28a588d",
      "urlToImage": "https://dims.apnews.com/dims4/default/86f9d7d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Fe7%2F0e2c601ab8dcc577b44d3ce9f41f%2Fbb45fb081dc4474698887d75080d227c"
    },
    {
      "author": null,
      "description": "The U.S. and Canadian Coast Guards are continuing efforts to break up ice and free a freighter that has been trapped in a frozen Lake Erie for days, officials said. The Manitoulin, a 663-foot Canadian vessel with 17 people on board, got stuck in the ice on Lake Erie on Wednesday after it dropped off a load of wheat in Buffalo, New York, and was heading back to Canada, the U.S. Coast Guard said. The ship wasn’t damaged, and its crew is safe. A U.S. Coast Guard icebreaking ship has been working since Thursday to help the Manitoulin, and on Saturday officials said a second ship arrived to help free the freighter.",
      "publishedAt": "2025-01-25T19:25:22Z",
      "title": "Freighter remains stuck in the ice on a frozen Lake Erie",
      "url": "https://apnews.com/article/lake-frozen-ship-ice-stuck-28ab1fd3872daa37612a9a09f20dff93",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0f0739/2147483647/strip/true/crop/4977x2800+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F7e%2Fe3a25d5ee858c117126ff685cd92%2F648ffb201bbb4634a54cf40b119d924b"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump plans to use a stop in Las Vegas to offer details on how he can begin excluding tips from federal taxes. He's betting that a city built on gambling and the hospitality industry will relish taking home larger slices of gratuities. Trump is vowing to make good on a campaign promise and he'll give a speech Saturday at the Circa Resort & Casino. That word comes from the Culinary Union, which represents about 60,000 hospitality workers across Nevada. The union supports eliminating taxes on tips, but says Trump’s proposals don’t go far enough.",
      "publishedAt": "2025-01-25T14:21:38Z",
      "title": "Trump's stop in Las Vegas will focus on how he wants to eliminate taxes on tips",
      "url": "https://apnews.com/article/trump-las-vegas-taxes-tips-hospitality-workers-92da0193df89d1773b8f7dcc84ea7e3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2df9607/2147483647/strip/true/crop/4760x2678+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F81%2Ff9571c4743b88084debd5b83f66e%2Ff3e3ba40930e4a5b81a74163032bd2a7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}