{
  "articles": [
    {
      "author": "MATTHEW LEE, SAMY MAGDY, ABBY SEWELL and NATALIE MELZER",
      "description": "BEIRUT (AP) — The Israeli military says it has begun a “limited, localized” operation against Hezbollah targets in southern Lebanon.It said it was carrying out “targeted ground raids” in villages close to the Israeli border.",
      "publishedAt": "2024-09-30T09:14:51Z",
      "title": "Israeli military says 'limited' operation against Hezbollah targets in southern Lebanon have begun",
      "url": "https://apnews.com/83ea5f243688f309754ec74850de4238",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa9e41cd55d4976af07d2955b115c04/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "ASHEVILLE, N.C. (AP) — Widespread devastation left behind by Hurricane Helene came to light Monday across the South, revealing a wasteland of splintered houses, crushed cargo containers and mud-covered highways in one of the worst storms in U.S.",
      "publishedAt": "2024-09-30T04:41:03Z",
      "title": "Supplies arrive by plane and by mule in North Carolina as Helene's death toll tops 130",
      "url": "https://apnews.com/f02869c7d01e68f2d7f0553abb82252f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/349e833f6eef44578d88d77cea35cf50/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — With a strike deadline looming, the union for 45,000 dockworkers and the group representing East and Gulf Coast ports have exchanged wage offers, leaving a ray of hope that a deal can be reached without a major work stoppage.",
      "publishedAt": "2024-09-30T16:20:49Z",
      "title": "With strike looming, progress is reported in talks between Eastern and Gulf ports and dockworkers",
      "url": "https://apnews.com/e5468e760f46a64e4322d1702beb1f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fb36934a241476ebe669888fab443f3/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and JEFF AMY",
      "description": "ATLANTA (AP) — A Georgia judge on Monday struck down the state's abortion law, which took effect in 2022 and effectively prohibited abortions beyond about six weeks of pregnancy.Fulton County Superior Court Judge Robert McBurney wrote in his order that the law violates Georgia's Constitution, finding that “liberty in Georgia includes in its meaning, in its protections, and in its bundle of rights the power of a woman to control her own body, to decide what happens to it and in it, and to reject state interference with her healthcare choices.”",
      "publishedAt": "2024-09-30T19:58:20Z",
      "title": "Judge strikes down Georgia ban on abortions, allowing them to resume beyond 6 weeks into pregnancy",
      "url": "https://apnews.com/632db7d5de815efa18aea52dadbfc59b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08cadbc44e834ce2b10ab60850464ac2/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, CHRISTINE FERNANDO and JEFF AMY",
      "description": "VALDOSTA, Ga. (AP) — Donald Trump repeatedly spread falsehoods Monday about the federal response to Hurricane Helene despite claiming not to be politicizing the disaster as he toured hard-hit areas in south Georgia.",
      "publishedAt": "2024-09-30T13:58:00Z",
      "title": "Trump makes false claims about federal response as he campaigns in area ravaged by Hurricane Helene",
      "url": "https://apnews.com/3097f1706455929adf5a4eb67f9cdf0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/684d466a1d384114bcad73d07b5e331f/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The Biden administration said Monday it is making asylum restrictions at the southern border even tougher, as it's increasingly eager to show voters uneasy over immigration that it is taking a hard stance on border security.",
      "publishedAt": "2024-09-30T17:45:44Z",
      "title": "Biden administration doubles down on tough asylum restrictions at border",
      "url": "https://apnews.com/1241e365e68f8b6f7031c6ba4279bfac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/672a27a810b04b4e9006ef385a35a7a7/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — The Justice Department announced Monday it plans to launch a review of the 1921 Tulsa Race Massacre, an attack by a white mob on a thriving Black district that is considered one of the worst single acts of violence against Black people in U.S.",
      "publishedAt": "2024-09-30T22:23:44Z",
      "title": "Justice Department will launch civil rights review into 1921 Tulsa Race Massacre",
      "url": "https://apnews.com/ea6551dc40c73996c3bf7e0a3ad3b06d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66f272c8b67e4eebb27cb35973181f56/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump has suggested that “one rough hour” of law enforcement action would tamp down retail theft, an echo of his longstanding support for more aggressive and potentially violent policing.",
      "publishedAt": "2024-09-30T16:03:06Z",
      "title": "Donald Trump suggests 'one rough hour' of policing will end theft",
      "url": "https://apnews.com/766351074cc53c543e89966651ba0614",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df490146a5674238869f3d726633fb49/2864.jpeg"
    },
    {
      "author": "EVENS SANON and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Nearly 6,000 people in Haiti are starving, with nearly half the country's population of more than 11 million people experiencing crisis levels of hunger or worse as gang violence smothers life in the capital of Port-au-Prince and beyond, according to a new report released Monday.",
      "publishedAt": "2024-09-30T17:35:52Z",
      "title": "Hunger in Haiti reaches famine levels as gangs squeeze life out of the capital and beyond",
      "url": "https://apnews.com/af625f8d80698788624dfbcc30c656a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff2cf09798f4d1aaac833a68c315b47/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — If Kris Kristofferson's life were fiction, it would feel a little implausible.He was a Texas-born Golden Gloves boxer and star football player, a Rhodes Scholar and a helicopter-flying U.S.",
      "publishedAt": "2024-09-30T21:16:01Z",
      "title": "Kris Kristofferson was 'a walking contradiction,' a renegade and pilgrim surrounded by friends",
      "url": "https://apnews.com/15b97a9e3aba94b91e62284dffe63313",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c7599587b374704b336a0eb401171ef/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}