{
  "articles": [
    {
      "author": "JOHN LEICESTER, SYLVIE CORBET and DANICA KIRKA",
      "description": "OMAHA BEACH, France (AP) — As young soldiers, they waded through breaking waves and gunfire to battle the Nazis.",
      "publishedAt": "2024-06-06T02:07:16Z",
      "title": "D-Day anniversary haunted by dwindling number of veterans and shadowed by Europe's new war",
      "url": "https://apnews.com/7b6896a9d891fb2d2f75b29e1cfd67ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6ab2b0c01fd4a838e7f77036ebe31a7/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "COLLEVILLE-SUR-MER, France (AP) — President Joe Biden marked the 80th anniversary of D-Day on Thursday by pledging “we will not walk away” from Ukraine, drawing a direct line from the fight to liberate Europe from Nazi domination to today's war against Russian aggression.",
      "publishedAt": "2024-06-06T12:40:19Z",
      "title": "Biden calls for solidarity with Ukraine at D-Day anniversary ceremony near the beaches of Normandy",
      "url": "https://apnews.com/b868fe789d2fe95b776c24c17543b510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acacbf01e384954af298e40d8e8fea2/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, RANDALL CHASE, COLLEEN LONG and MIKE CATALINI",
      "description": "WILMINGTON, Del. (AP) — The widow of Hunter Biden's brother told jurors in his federal gun trial Thursday about the moment she found the revolver in his truck, describing how she put it into a leather pouch, stuffed it into a shopping bag and tossed it in a trash can outside a market near her home.",
      "publishedAt": "2024-06-06T04:09:40Z",
      "title": "Widow of Beau Biden takes the stand in Hunter Biden's gun trial, talks about tossing the revolver",
      "url": "https://apnews.com/62de446479ddcdb040c6a5418c6d28fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0866e2fd3cf943109aeb2ba3617e58b5/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and JOEY CAPPELLETTI",
      "description": "In Michigan's Upper Peninsula, two Republican members of a county canvassing board last month refused to sign off on the results of an election that led to the recall of three GOP members of the county commission.",
      "publishedAt": "2024-06-06T04:03:54Z",
      "title": "Election certification disputes in a handful of states spark concerns over 2024 presidential contest",
      "url": "https://apnews.com/09bb9d1fdc11b495b7c50687e5576997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b0000f79ed743cf98abf918313fb6f3/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike early Thursday on a school sheltering displaced Palestinians in central Gaza killed more than 30 people, including 23 women and children, according to local health officials.",
      "publishedAt": "2024-06-06T03:45:56Z",
      "title": "Israeli strike kills at least 33 people at a Gaza school the military claims was being used by Hamas",
      "url": "https://apnews.com/3d07e712f8abc1e08339163180823fb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11532a3d7be4489f832c5c5a66a47873/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Jonathan Dekel-Chen dreams of the moment when his abducted 35-year-old son, Sagui, is reunited with his wife and three young children, including a daughter born two months after the devastating attack on Israel that initiated the war.",
      "publishedAt": "2024-06-06T16:27:53Z",
      "title": "Families of US hostages in Gaza plead with Americans: Don't forget your fellow citizens",
      "url": "https://apnews.com/408f1d2b48539b6ed408e21c8cc65526",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/214bfde5bcef4c779d92cfc48a941e8a/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "RIVERHEAD, N.Y. (AP) — The New York architect accused of murdering multiple women and leaving their corpses scattered along the Long Island coast kept a “blueprint” of his crimes on his computer, prosecutors revealed Thursday as they brought charges against Rex Heuermann in two more killings.",
      "publishedAt": "2024-06-06T04:14:04Z",
      "title": "Man charged in Gilgo Beach serial killings kept 'blueprint' of crimes on computer, prosecutors say",
      "url": "https://apnews.com/cd010da500bedf2aabded35d1b939629",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfbb2f6e95da43ab8618f7870c1748b6/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "From its towering white steeple and red-brick facade to its Sunday services filled with rousing gospel hymns and evangelistic sermons, First Baptist Church of Alexandria, Virginia, bears many of the classic hallmarks of a Southern Baptist church.",
      "publishedAt": "2024-06-06T12:33:05Z",
      "title": "Southern Baptists are poised to ban churches with women pastors. Some are urging them to reconsider",
      "url": "https://apnews.com/3b40fd925377a9e3aa2ecb4a4072a4a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aeacdd150d342a29e779a0a7f86c3f9/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIVONIA, Mich. (AP) — Tornado-spawning storms tearing across the eastern U.S. killed a toddler in a Detroit suburb and injured at least five in Maryland on Wednesday and left another eight people hurt in Ohio early Thursday.",
      "publishedAt": "2024-06-06T05:22:18Z",
      "title": "Tornado hits Michigan, killing toddler, while Ohio and Maryland storms injure at least 13",
      "url": "https://apnews.com/a95e55dfbad6dd7ecf847a1983876bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/484746d50e9944ae8a9a8e51f9f407e2/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "Artificial intelligence systems like ChatGPT could soon run out of what keeps making them smarter — the tens of trillions of words people have written and shared online.",
      "publishedAt": "2024-06-06T13:32:05Z",
      "title": "AI 'gold rush' for chatbot training data could run out of human-written text",
      "url": "https://apnews.com/9676145bac0d30ecce1513c20561b87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9df84d8cc31f4eaa994aee318abd9a0d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}