{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is trying to outmaneuver former President Donald Trump and address old vulnerabilities on her policy positions as she starts to fill in how she would govern if elected in November.",
      "publishedAt": "2024-08-13T04:10:04Z",
      "title": "Harris cautiously rolls out policy, aiming to outmaneuver Trump and address 2020 liabilities",
      "url": "https://apnews.com/e606b41cce817e69a38663cc68ce7ad6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1905480e4784449a5079c1e4319ae6d/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — In some corners of the Democratic Party, last week felt like déjà vu.The party's vice-presidential nominee’s military record was under assault from Republicans — attacks reminiscent of those leveled two decades earlier on Sen.",
      "publishedAt": "2024-08-13T11:00:33Z",
      "title": "Will the attacks on Walz's military service stick like they did to Kerry 20 years ago?",
      "url": "https://apnews.com/293e178ca9fe079e879787ee2269899e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e97f3afa6044f03854285556e7e1732/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "As X’s owner and most followed user, Elon Musk has increasingly used the social media platform as a microphone to amplify his political views and, lately, those of right-wing figures he’s aligned with.",
      "publishedAt": "2024-08-13T04:01:28Z",
      "title": "How X owner Elon Musk uses his social platform to amplify his right-wing views",
      "url": "https://apnews.com/48cc1870cbdb5df03829f5ab303b579d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86c963cde97d4ba1b21e6a99d4787062/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Reem Abu Hayyah, just three months old, was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday. A few miles (kilometers) to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.",
      "publishedAt": "2024-08-13T12:02:57Z",
      "title": "Israeli strikes on Gaza leave children without parents and parents without children",
      "url": "https://apnews.com/36c11d9bb2c01b094e4301bf4e197f0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b8e8e69471e4a7cb1563e785fdc454d/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia said Tuesday that its forces checked an effort by Ukrainian troops to expand a stunning weeklong incursion into the Kursk region, as a Ukrainian Foreign Ministry spokesman said Kyiv has no intention of occupying Russian territory.",
      "publishedAt": "2024-08-13T12:24:55Z",
      "title": "Russia says it thwarted a Ukrainian charge to expand its incursion. Kyiv says it won't occupy land",
      "url": "https://apnews.com/5378360d6b1f244930d8886be4469bc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ac45d69caa6476dbe4628f997de4109/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A year after a Georgia grand jury accused Donald Trump and others of illegally trying to overturn the 2020 presidential election in the state, the case has stalled with no chance of going to trial before the end of this year.",
      "publishedAt": "2024-08-13T13:47:00Z",
      "title": "A year later, sprawling Georgia election interference case against Donald Trump has stalled",
      "url": "https://apnews.com/cd810f67a76dc4c64ec3ee64749bf897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a35650f593bb4e20b386c3f0dc9a48f3/3000.jpeg"
    },
    {
      "author": "PATRICK AFTOORA ORSAGOS and JOHN SEEWER",
      "description": "COLUMBUS, Ohio (AP) — An Ohio police officer was indicted Tuesday on murder and other charges in the shooting of Ta’Kiya Young, a 21-year-old pregnant Black mother who was killed after being accused of shoplifting last August.",
      "publishedAt": "2024-08-13T14:17:48Z",
      "title": "Officer faces murder charge in shooting of pregnant Black woman who was accused of shoplifting",
      "url": "https://apnews.com/5aeeaeff40fbad5dd85da1a77767bce6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e4d47801f5c409898e5ca40615e4adf/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — Missouri voters will decide in November whether to guarantee a right to abortion with a constitutional amendment that would reverse the state’s near-total ban on the procedure.",
      "publishedAt": "2024-08-13T13:37:59Z",
      "title": "Initiative to enshrine abortion rights in Missouri constitution qualifies for November ballot",
      "url": "https://apnews.com/0c0a28e5176a647b47aaca5a5d287628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67d8852b90d04fb2924d8687e46ea081/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Ernesto battered the northeast Caribbean on Tuesday as it took aim at Puerto Rico, where officials closed schools, opened shelters and moved dozens of the U.S.",
      "publishedAt": "2024-08-13T11:38:22Z",
      "title": "Tropical Storm Ernesto batters northeast Caribbean and aims at Puerto Rico as it strengthens",
      "url": "https://apnews.com/15ff3b85e54780fa89aa51087a87d5dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57f72443c3ac45e29ff722190d29cb52/2402.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "NORTHFIELD, Ill. (AP) — The students — most with gray hair, some with canes, all at least in their 60s — couldn't believe what they were hearing.“Oh, my God,” whispered a retired college professor.",
      "publishedAt": "2024-08-13T04:21:08Z",
      "title": "Older Americans prepare themselves for a world altered by artificial intelligence",
      "url": "https://apnews.com/bc30958c273af7c79bfe77d321617738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db111bff9782413192fc04bf67c9635d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}