{
  "articles": [
    {
      "author": "Zeke Miller, Aamer Madhani",
      "description": "U.S. President Donald Trump has left Qatar for the United Arab Emirates on the final leg of his Middle East tour. Trump will visit the country’s largest mosque, where the country's founder is buried in a courtyard. Trump also will be hosted for a state visit by the UAE's president at a palace. Trump wrapped up his visit to Qatar by stopping at a U.S. installation Thursday, telling troops his “priority is to end conflicts.” Earlier in the day, Trump said he wasn't surprised Russian President Vladimir Putin will be a no-show for anticipated peace talks with Ukraine in Turkey. Earlier this week, Trump met with Syria’s president and announced plans to ease sanctions on the war-torn country.",
      "publishedAt": "2025-05-15T04:02:17Z",
      "title": "Trump will visit US troops in Qatar during Middle East tour",
      "url": "https://apnews.com/article/trump-qatar-syria-aludeid-air-base-9c868799582685b3a115c6f0c243d606",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1e4cdc/2147483647/strip/true/crop/3639x2047+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F87%2F977425b8fdf10152ee6e528b1b9f%2Fa766ae442522424fbcd4b464315650e7"
    },
    {
      "author": "Mohammad Jahjouh, Tia Goldenberg",
      "description": "A hospital in southern Gaza says 54 people have been killed in overnight airstrikes on the city of Khan Younis. An Associated Press cameraman counted 10 airstrikes on the city overnight into Thursday and saw numerous bodies taken to the morgue in Nasser Hospital. Some bodies arrived in pieces, with some body bags containing the remains of multiple people. The hospital’s morgue confirmed 54 people had been killed. The strikes come as U.S. President Donald Trump visits the Middle East, visiting Gulf states but not Israel. There had been hope that Trump’s regional visit could usher in a ceasefire or renewal of humanitarian aid to Gaza. An Israeli blockade of the territory is now in its third month.",
      "publishedAt": "2025-05-15T06:43:42Z",
      "title": "54 people killed in overnight airstrikes on southern Gaza city, hospital says",
      "url": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-05-15-2025-b32d055195ffec2b349a0948582c68e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/28db1cd/2147483647/strip/true/crop/6886x3873+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F9d%2F7e2901282351a444195d5008cb28%2Fe174e34502a344e4a5be151e05fe3585"
    },
    {
      "author": "Mehmet Guzel",
      "description": "Russian officials say Russia’s delegation has arrived in Istanbul for peace talks with Ukraine. However, President Vladimir Putin was not part of the delegation, according to a list released by the Kremlin Wednesday night, prompting criticism from Western officials that Moscow isn’t serious about the peace effort. Earlier this week, Ukraine’s President Volodymyr Zelenskyy challenged the Russian leader to meet in person in Turkey. Earlier this week, Ukrainian President Volodymyr Zelenskyy challenged the Russian leader to meet in person in Turkey. Ukraine’s presidential adviser, Mykhailo Podolyak, said Zelenskyy will sit at the table only with Putin.",
      "publishedAt": "2025-05-15T07:55:07Z",
      "title": "A Russian delegation has arrived in Istanbul for Ukraine talks. It doesn't include Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-istanbul-talks-zelenskyy-putin-05795eea960b9035f93a143c3e177c3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b85eaa7/2147483647/strip/true/crop/2955x1662+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fff%2F322926c1aa03f855d06788296976%2F681b2f6ad2704ee79556d44b68b9303b"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is hearing arguments in its first case stemming from the flurry of actions marking the start of President Donald Trump’s second term. Before the court Thursday are the Trump administration’s emergency appeals of lower court orders putting nationwide holds on the Republican president’s push to deny citizenship to children born to people who are in the U.S. illegally. Birthright citizenship is among several issues the administration has urgently asked the court to deal with, after lower courts acted to slow Trump’s agenda. The administration, like the Biden administration before it, complains judges are overreaching by issuing nationwide injunctions that apply to everyone instead of just the parties before the court.",
      "publishedAt": "2025-05-15T10:40:09Z",
      "title": "What to know about the Supreme Court arguments over birthright citizenship",
      "url": "https://apnews.com/article/immigration-supreme-court-birthright-citizenship-nationwide-injunctions-2c495cddc1436e21a9fa976d295dc292",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee92b39/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F6b%2F55a3f63410f5534ed4cb72f35b25%2F2469e2cdc3704cb18ed25331aec37954"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Lawyers for Sean “Diddy” Combs say they’ll be questioning R&B singer Cassie about how infidelity fueled her combustible, nearly 11-year relationship with the music mogul, who is on trial for sex trafficking. The defense cross-examination of the prosecution's star witness will begin Thursday in a Manhattan courtroom. It'll be Cassie's third day on the witness stand after having testified that Combs raped her when she broke up with him in 2018. She also said Combs locked her into a life of physical abuse by threatening to release degrading sexual videos of her. Combs denies the allegations. He faces at least 15 years in prison if convicted.",
      "publishedAt": "2025-05-15T13:30:02Z",
      "title": "Sean 'Diddy' Combs' lawyers plan to press Cassie about infidelity during cross-examination",
      "url": "https://apnews.com/article/diddy-trial-sex-trafficking-cassie-testimony-69c7a6ad766103e39c4f7f35df841205",
      "urlToImage": "https://dims.apnews.com/dims4/default/deb7c37/2147483647/strip/true/crop/3872x2178+0+11/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc7%2Fa896760638f8637dd3703d090966%2Ffde0b54fcc7147ad88d825532de42341"
    },
    {
      "author": "Zeke Miller, Chris Megerian",
      "description": "When President Donald Trump addressed U.S. and Qatari troops at a military base in Qatar, he assured the rank and file “we don’t care if you’re politically correct.” Anyone needing proof of that could've watched comedian Theo Von’s routine a little earlier. The podcast host regaled the uniformed troops Thursday with jokes about drugs, developmental disabilities, homosexuality and their Qatari hosts. Von joked about the lack of crime in Qatar, where he said it'd be impossible to identify a perpetrator because everyone is named Mohammed and dresses in the same white robes. Trump connected with Von during last year's campaign. The Republican president was not present for Von's warmup act.",
      "publishedAt": "2025-05-15T15:08:03Z",
      "title": "Theo Von riffs on drugs and homosexuality before Trump speaks in Qatar",
      "url": "https://apnews.com/article/donald-trump-theo-von-qatar-military-jokes-6cb21a321a1ed806577b84dfbf9ea9ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c81a1c/2147483647/strip/true/crop/4635x2607+0+241/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fdc%2F93005e479b64421e4f0f1e2890ae%2Fe1dc918ff08b4f20bd65967d5d0c4593"
    },
    {
      "author": "Todd Richmond",
      "description": "A Wisconsin judge accused of helping a man evade federal immigration agents has pleaded not guilty to federal charges. Milwaukee County Circuit Judge Hannah Dugan entered the plea during an arraignment Thursday in federal court. She and her lawyers left after the brief hearing without talking to reporters. Dugan is charged with obstruction and concealing an individual to prevent arrest. According to an FBI affidavit, Dugan showed a man out the back door of her courtroom last month after learning immigration agents were in the courthouse looking to arrest him for being in the country illegally. The case has escalated a clash between Trump administration and Democrats over the president’s sweeping immigration crackdown.",
      "publishedAt": "2025-05-15T04:01:41Z",
      "title": "Wisconsin judge pleads not guilty to helping a man evade federal immigration agents",
      "url": "https://apnews.com/article/dugan-wisconsin-judge-arrested-trump-immigration-plea-ba8ef8e5cc1d0f66d4319e4f36f08766",
      "urlToImage": "https://dims.apnews.com/dims4/default/9326b3a/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fb4%2F47d08704ebafbc5d08e654a052d1%2F2d83c10c042d4d4e995b0eaf9a08ddf1"
    },
    {
      "author": "Matt Sedensky",
      "description": "As the Trump administration resumes collections on defaulted student loans, hundreds of thousands of older Americans with decades-old debts are now at risk of having their Social Security checks garnished. People with student loans had their payments and interest paused five years ago when the pandemic thrust many into financial hardship. But all extensions and grace periods are over and the federal government said this month it would restart the garnishment of paychecks, tax refunds and Social Security benefits. Student loan debt among older people has grown at a staggering rate. The Consumer Financial Protection Bureau says the number of Social Security beneficiaries who have had their payments garnished has ballooned by 3,000% over the past two decades.",
      "publishedAt": "2025-05-15T10:00:06Z",
      "title": "Older people in crosshairs as government restarts Social Security garnishment on student loans",
      "url": "https://apnews.com/article/student-loans-debt-social-security-67a3a50a90aee3e6dda1ae4428094f97",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f64b88/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2F13%2F4290e69b9b899180cff9b3a76742%2Fa37a5027ce5e460f823966e54a70daa2"
    },
    {
      "author": "Laura Ungar",
      "description": "A baby born with a rare and dangerous genetic disease is thriving after getting an experimental gene editing treatment made just for him. Researchers said the Pennsylvania boy is among the first to be successfully treated with a custom gene editing therapy. They described his case in a study published on Thursday in the New England Journal of Medicine. Though it may be a while before similar personalized treatments are available for others, doctors hope the technology can someday help millions who have been left behind by genetic medicine because their diseases are so rare.",
      "publishedAt": "2025-05-15T17:00:05Z",
      "title": "Gene editing helped a desperately ill baby thrive. Scientists say it could someday treat millions",
      "url": "https://apnews.com/article/crispr-gene-editing-rare-disease-mutation-chop-penn-4ab95afadde97164ae6c2450d79acbf8",
      "urlToImage": "https://dims.apnews.com/dims4/default/f020462/2147483647/strip/true/crop/5393x3034+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F0d%2F66fffc150fe5a3ce86d71807ec27%2F82f8a566c43b4bb9a41b5c310b463943"
    },
    {
      "author": "Wyatte Grantham-Philips",
      "description": "Volley after volley of tariffs — and at times on-again, off-again trade actions — have put companies around the world on edge. And a handful of major retailers have already raised prices across the U.S., or warned of future hikes. President Donald Trump's sweeping new import taxes and responding retaliation from some targeted countries have piled up in recent months. Because companies that buy products made abroad pay the tariffs imposed on them, higher costs that are typically passed on to consumers. Walmart, Barbie maker Mattel, Microsoft's Xbox and more have recently announced or anticipate price hikes amid the ongoing trade wars.",
      "publishedAt": "2025-05-15T16:11:24Z",
      "title": "Under of a cloud of tariffs, Walmart is the latest retailer to announce price hikes",
      "url": "https://apnews.com/article/tariffs-retail-consumer-trump-economy-ecd398941ba41d9a94145c5d75da6b24",
      "urlToImage": "https://dims.apnews.com/dims4/default/aba8775/2147483647/strip/true/crop/5760x3240+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F42%2F50d5483c055e7c43924fe4be544a%2F59c39ba5695944f4b0b91ad8600542be"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}