{
  "articles": [
    {
      "author": "Kate Payne, David Fischer",
      "description": "Florida State University has released an alert warning of an active shooter on the school's campus in Tallahassee. Officials say police are on scene or on the way. Students and faculty have been instructed to continue to seek shelter and await further instructions.",
      "publishedAt": "2025-04-17T16:26:44Z",
      "title": "Active shooter reported on Florida State campus in Tallahassee",
      "url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Annie Ma, Jocelyn Gecker, Collin Binkley",
      "description": "President Donald Trump's administration has escalated its ongoing battle with Harvard, threatening to revoke the university’s ability to host international students, who make up 27% of the campus. The threat emerged as the president called for withdrawing the school's tax-exempt status. The Department of Homeland Security ordered Harvard late Tuesday to turn over detailed records of the school's foreign student visa holders’ \"illegal and violent activities” by April 30. The move deepens the crackdown on Harvard. On Monday, it became the first university to openly defy the administration’s demands related to activism on campus, antisemitism and diversity. The federal government has already frozen more than $2 billion in grants and contracts to the Ivy League institution.",
      "publishedAt": "2025-04-17T14:17:43Z",
      "title": "Trump administration takes aim at Harvard's international students and tax-exempt status",
      "url": "https://apnews.com/article/trump-harvard-tax-exempt-status-international-students-07a10958bf078cb04b59d1fc9a3a27a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2a8acf/2147483647/strip/true/crop/4421x2487+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fca%2F084da462cbeccc78a71fee1f7f49%2F181b3421fdff42949b3e41adec48b0bb"
    },
    {
      "author": "Colleen Barry",
      "description": "Italian Premier Giorgia Meloni will test her mettle as an EU facilitator when she meets with Donald Trump in the White House. The meeting on Thursday marks the first face-to-face between a European leader and the U.S. president since he announced, and then temporarily suspended, tariffs of 20% on European exports. Meloni is traveling in her role as Italy’s leader, but she has been in close contact with EU Commission President Ursula Von Der Leyen ahead of the trip. The 90-day pause on the retaliatory tariffs has raised some hopes for negotiation, and experts say that Meloni’s margins for progress are more in bringing clarity on Trump's goals than in outright concessions.",
      "publishedAt": "2025-04-17T04:05:04Z",
      "title": "Meloni will test her mettle as EU-US bridge when she meets Trump in Washington",
      "url": "https://apnews.com/article/trump-meloni-white-house-meeting-eu-us-tariffs-a524f386ad4fa628c17949043ecd91e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e1e97c/2147483647/strip/true/crop/5107x2873+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2Fcb%2F537e587414a97a4de41d5ce48197%2F16895e23eda0488f9a9d96bac87c661b"
    },
    {
      "author": "Wafaa Shurafa, Fatma Khaled, Lee Keath",
      "description": "Israeli strikes on the Gaza Strip have killed at least 23 people, including a family of 10. The United Nations meanwhile raised alarm over the mounting impact of Israel’s six-week-old blockade preventing all food and other supplies from entering the territory. Israel ended its ceasefire with Hamas last month and renewed its bombardment, killing hundreds of people and seizing large parts of the territory to pressure the militants to accept changes to the agreement. The U.N. humanitarian office said that almost all of Gaza’s more than 2 million people now rely for food on the only 1 million prepared meals produced daily by charity kitchens supported by aid groups.",
      "publishedAt": "2025-04-17T08:40:19Z",
      "title": "Israeli strike kills family of 10 in Gaza as UN raises alarm over food cutoff",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-17-2025-69292810abbd0512ded90fdfd0ba7692",
      "urlToImage": "https://dims.apnews.com/dims4/default/5549379/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F64%2F4a087c951d5aa79334830a065534%2Ffdcc0d31ed85499b946861be5a9c58d8"
    },
    {
      "author": "Jon Gambrell, Amir Vahdat",
      "description": "Talks between Iran and the United States over Tehran’s rapidly advancing nuclear program are “in a very crucial” stage. That's what the head of the United Nations’ nuclear watchdog said Thursday while on a visit to the Islamic Republic. The comments by Rafael Mariano Grossi of the International Atomic Energy Agency in Tehran included an acknowledgment his agency likely would be key in verifying compliance by Iran should a deal be reached. Iran and the U.S. will meet again Saturday in Rome for a new round of talks after last weekend’s first meeting in Oman.",
      "publishedAt": "2025-04-17T11:11:54Z",
      "title": "Talks between Iran, US at 'very crucial' stage, IAEA chief says",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-iaea-rome-oman-ffa109ded4049f550fe9a116e2fdf8e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/50a5135/2147483647/strip/true/crop/1680x945+0+87/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Fad%2F91be3da50d06c43038ca27d08a8a%2Fbbaae230aa5d42d59a93ee770cb699c6"
    },
    {
      "author": "Mary Clare Jalonick, Yolanda Magaña",
      "description": "Maryland Sen. Chris Van Hollen says he was denied entry into the El Salvador prison where Kilmar Abrego Garcia is being held. Van Hollen is in El Salvador to push for Abrego Garcia’s release after he was sent there by the Trump administration in March despite an immigration court order preventing his deportation. He says in a video posted on X his car was stopped when he tried to enter the prison Thursday to check on Abrego Garcia’s health. Van Hollen says his car was stopped by soldiers about 3 kilometers from the prison, even as other cars were allowed to go on. Abrego Garcia is a a Salvadoran citizen who was living in Maryland when he was deported.",
      "publishedAt": "2025-04-16T17:06:04Z",
      "title": "Maryland's Van Hollen blocked from El Salvador prison holding Abrego Garcia",
      "url": "https://apnews.com/article/abrego-garcia-el-salvador-trump-deportation-van-hollen-senator-81cca0ac24a9a312be97c730679f8dd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/79dcf5b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F9c%2F8db43adb84c59152287941d07d94%2F6ed042bcaf774ada8a08a5e4d581f18b"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Vatican opens solemn run-up to Easter with recovering Pope Francis on the sidelines",
      "url": "https://apnews.com/article/vatican-pope-easter-pneumonia-7fc3e1c6ebc191987e7d4c9162bf6a98",
      "urlToImage": null
    },
    {
      "author": "Aamer Madhani, Josh Boak",
      "description": "President Donald Trump has slammed Federal Reserve Chair Jerome Powell, reiterating his frustration the Fed has not aggressively cut interest rates and saying the central bank leader’s “termination cannot come fast enough.” Trump hinted in a social media post Thursday at moving to fire Powell, whose term does not expire until next year. The Republican president’s broadside comes a day after Powell signaled the Fed will keep its key interest rate unchanged while it seeks “greater clarity” on the impact of policy changes in areas such as immigration, taxation, regulation and tariffs. A Supreme Court legal case could determine whether presidents can fire the heads of independent agencies such as the Fed.",
      "publishedAt": "2025-04-17T12:14:08Z",
      "title": "Trump says Fed Chair Powell’s 'termination cannot come fast enough'",
      "url": "https://apnews.com/article/trump-powell-federal-reserve-fed-termination-b6148c8048dda538a6ca3b5a270fd09e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6f2526/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F48%2Fcb87c2296c8f8900cc9b261d43bf%2F6d2ee855d6b3471a8ab2b06937792747"
    },
    {
      "author": "Carla K. Johnson",
      "description": "Microdosing is gaining popularity with a new breed of health seekers. These self-experimenters take a very small amount of psilocybin mushrooms or LSD to reduce anxiety, stress and depression. Some claim the practice gives them access to joy, creativity and connection they can’t get otherwise. This isn’t a full-blown acid trip and people who microdose don’t do it every day. They take tiny doses intermittently, on a schedule or when they feel it could be beneficial. Only a few scientists are studying microdosing. Even the advocates of the practice caution that its long-term effects have not been studied in humans.",
      "publishedAt": "2025-04-17T13:17:19Z",
      "title": "Believers say microdosing psychedelics helps them. Scientists are trying to measure the claims",
      "url": "https://apnews.com/article/microdosing-lsd-mushrooms-psychedelic-psilocybin-390c99ba54ef9d75727f39e2ec78fb34",
      "urlToImage": "https://dims.apnews.com/dims4/default/33699e4/2147483647/strip/true/crop/6981x3927+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F75%2Fc7b5dbd862ba0c5f8269cf261dc0%2Ffb0a25ddf8c84d53a3634ccc5f05be76"
    },
    {
      "author": "Dánica Coto",
      "description": "An island-wide blackout hit Puerto Rico this week, leaving 1.4 million customers without power and more than 400,000 without water. It was the second massive outage to hit Puerto Rico since New Year’s Eve, when a blackout left 90% of clients without power. Crews on Thursday scrambled to restore power as a growing number of Puerto Ricans called on the governor to cancel the contracts of two companies that oversee the generation, transmission and distribution of power on the U.S. territory of 3.2 million residents. Authorities are still investigating the causes of the blackout.",
      "publishedAt": "2025-04-17T15:28:45Z",
      "title": "A look at why an island-wide blackout hit Puerto Rico and what caused it",
      "url": "https://apnews.com/article/puerto-rico-blackout-power-outage-causes-6b1f71e33136a3f97b8238568cd664ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/57e72a3/2147483647/strip/true/crop/6753x3799+0+353/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F4b%2Fa87c3ac434736323e1eb37178395%2Ff9ed75ccfb0c4560838af785a3972457"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}