{
  "articles": [
    {
      "author": "ILLIA NOVIKOV and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — The Kremlin warned Monday that President Joe Biden’s decision to let Ukraine strike targets inside Russia with U.S.-supplied longer-range missiles adds “fuel to the fire” of the war and would escalate international tensions even higher.",
      "publishedAt": "2024-11-18T09:39:19Z",
      "title": "Moscow warns the US over allowing Ukraine to hit Russian soil with longer-range weapons",
      "url": "https://apnews.com/5cd4f9fe2cee1ae8aed67d63c22b0703",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/044fffc96ed34d57956c9786c222924d/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Before Russia’s invasion, this was an ordinary green lawn in the heart of Ukraine’s capital. Tourists would visit to take photos, and locals would stroll there on weekends.But 1,000 days of war have transformed it into a makeshift memorial, dotted with blue-and-yellow flags — each honoring a soldier who died fighting Russia.",
      "publishedAt": "2024-11-18T05:15:38Z",
      "title": "A makeshift memorial grows in Ukraine’s capital after 1,000 days of war",
      "url": "https://apnews.com/825f56c9c80c0906b3dc7d0cc3eba959",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b24134b4e5be43c9a470af48a57b8f41/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes in the Gaza Strip killed eight people, including two children and their parents, Palestinian officials said Monday.A third child was wounded in the overnight strike on a tent where displaced people were sheltering in the southern city of Khan Younis, according to the Civil Defense, first responders who operate under the Hamas-run government.",
      "publishedAt": "2024-11-18T09:03:23Z",
      "title": "Middle East latest: Children and parents among 8 killed in Israeli strikes in Gaza, officials say",
      "url": "https://apnews.com/f8b998f646051a1ef19303b51225a7ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9be2ad39c0cb44b1a0e73f35a5fa6bf6/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Just a week after winning several of the nation’s largest Arab-majority cities, President-elect Donald Trump has filled top administration posts with staunch Israel supporters, including an ambassador to Israel who has claimed “there is no such thing as Palestinians.”",
      "publishedAt": "2024-11-18T05:14:16Z",
      "title": "Some Arab Americans who voted for Trump are concerned about his picks for key positions",
      "url": "https://apnews.com/677003f64d0a255a0f6f95c3a2a1b9db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fd5a9a6f1048de81d1cb56261cf7ab/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES, MAURICIO SAVARESE and DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — Brazil pushed for concerted action to alleviate hunger Monday as it hosted a summit of the Group of 20 leading economies amid global uncertainty over two major wars and incoming U.S.",
      "publishedAt": "2024-11-18T05:05:14Z",
      "title": "Host Brazil focuses G20 on fighting hunger with wars and Trump's return in the background",
      "url": "https://apnews.com/12f7a09b8f79229509de52c92c0a074c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb188e71197348069f7a6fee295e7f61/1920.jpeg"
    },
    {
      "author": "SIBI ARASU, MELINA WALLING and SETH BORENSTEIN",
      "description": "BAKU, Azerbaijan (AP) — United Nations climate talks resumed Monday with negotiators urged to make progress on a stalled-out deal that could see developing countries get more money to spend on clean energy and adapting to climate-charged weather extremes.",
      "publishedAt": "2024-11-18T06:04:27Z",
      "title": "Negotiators are urged to get down to business as climate talks in Baku enter second week",
      "url": "https://apnews.com/13f4acd0d1675b57250741f457dcdfd0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05db1c78d7bd48ddbb7d4c1b7ac4d10c/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Typhoon Man-yi left at least seven people dead in a landslide, destroyed houses and displaced large numbers of villagers before blowing away from the northern Philippines, worsening the crisis wreaked by multiple back-to-back storms, officials said Monday.",
      "publishedAt": "2024-11-18T05:48:47Z",
      "title": "Typhoon Man-yi leaves 7 dead in Philippines and worsens crisis from back-to-back storms",
      "url": "https://apnews.com/04db73a5ee97fed4fbf12c342c4e7bb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/471c39c7f7a3481ab124c0f2d6343049/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "ISANTI, Minn. (AP) — The young Buddhist lama sat on a throne near an altar decorated with flowers, fruits and golden statues of the Buddha, watching the celebrations of his 18th birthday in silence, with a faint smile.",
      "publishedAt": "2024-11-18T13:02:47Z",
      "title": "Teenage Buddhist lama celebrates last birthday in the U.S. before joining monastery in the Himalayas",
      "url": "https://apnews.com/997837af54ebd0c963da8d30854a41ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17a6588d1bd348898de3d495a6573932/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Spirit Airlines said Monday that it has filed for bankruptcy protection and will attempt to reboot as it struggles to recover from the pandemic-caused swoon in travel, stiffer competition from bigger carriers, and a failed attempt to sell the airline to JetBlue.",
      "publishedAt": "2024-11-18T10:44:47Z",
      "title": "Spirit Airlines files for bankruptcy as financial losses pile up and debt payments loom",
      "url": "https://apnews.com/782c7fb892adf1d2f366411bab955668",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0d1faa5c1d246de9432c7d4f45f28ec/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "FUENGIROLA, Spain (AP) — Rafael Nadal felt a hand on his left shoulder as he walked out of a conference room at a resort on Spain's southern coast Monday following his first question-and-answer session with reporters since announcing this week's Davis Cup Final 8 will be his last event before retirement.",
      "publishedAt": "2024-11-18T09:30:20Z",
      "title": "Rafael Nadal and Spain's captain won't say whether he'll play at the Davis Cup",
      "url": "https://apnews.com/61f4a9a87d2a9e4666d44dbe11588e06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/838be054b665457798821769283df8ea/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}