{
  "articles": [
    {
      "author": "COLLEEN LONG, ZEKE MILLER, MICHAEL BALSAMO, AAMER MADHANI and SYLVIE CORBET",
      "description": "WASHINGTON (AP) — President Joe Biden's conduct behind closed doors, in the Oval Office, on Air Force One and in meetings around the world is described in the same dual way by those who regularly see him in action.",
      "publishedAt": "2024-07-03T23:59:06Z",
      "title": "Biden at 81: Often sharp and focused but sometimes confused and forgetful",
      "url": "https://apnews.com/7c366fda83a697265d9ecc77e8a32fd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cef2001ae8e4805919ae707bc95829d/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, WILL WEISSERT and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — A defiant President Joe Biden vowed Wednesday to keep running for reelection, rejecting growing pressure from Democrats to withdraw after a disastrous debate performance raised questions about his readiness to keep campaigning, much less win in November.",
      "publishedAt": "2024-07-03T16:45:30Z",
      "title": "Biden vows to keep running as signs point to rapidly eroding support for him on Capitol Hill",
      "url": "https://apnews.com/7794155c12bc78c084e4b964545e2b7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5444ec0c94f64cb0b516fee0cb838205/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump likes to be the one in the spotlight.But in the days since President Joe Biden's disastrous debate performance, the presumptive Republican nominee has kept a low profile, leaving the focus on the drama engulfing the Democratic Party as he and his campaign revel in a series of legal and political victories heading into the Republican National Convention this month.",
      "publishedAt": "2024-07-03T11:17:07Z",
      "title": "Trump, for now, is ceding the spotlight to Biden as the president's campaign reels from bad debate",
      "url": "https://apnews.com/86bfc24cc618906fa9b46ab029e65789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43099fdb35c04a1a85750b809350f21d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — An Israeli airstrike slammed into a residential building next to the main medical center in Gaza’s southern city of Khan Younis, wounding at least seven people, hospital authorities and witnesses said Wednesday.",
      "publishedAt": "2024-07-03T22:13:18Z",
      "title": "Life and death in Gaza's 'safe zone' where food is scarce and Israel strikes without warning",
      "url": "https://apnews.com/43536b7dfe84aa3c39668c30032bdfcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be3a9a9ea20a44d4b2a2655953af5551/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — British voters are picking a new government Thursday, voting in a parliamentary election that is widely expected to bring the Labour Party to power against a gloomy backdrop of economic malaise, mounting distrust in institutions and a fraying social fabric.",
      "publishedAt": "2024-07-04T04:01:31Z",
      "title": "Labour is hopeful and Conservatives morose before voters deliver their verdict on UK's election day",
      "url": "https://apnews.com/3c89a7974f05748943adfbebf03d3db6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c5cd2392b4c4246b87857a7c2a30387/2853.jpeg"
    },
    {
      "author": "MARTÍN SILVA and FERNANDO LLANO",
      "description": "PLAYA DEL CARMEN, Mexico (AP) — Hurricane Beryl ripped off roofs in Jamaica, jumbled fishing boats in Barbados and damaged or destroyed 95% of homes on a pair of islands in St.",
      "publishedAt": "2024-07-04T04:48:13Z",
      "title": "Hurricane Beryl roars toward Mexico after killing at least 7 people in the southeast Caribbean",
      "url": "https://apnews.com/04eda74885bbe45ae3630e2ca713ef92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fbace3055d8428b98830ee24d3ea2b4/1920.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "Many Americans weren't letting worries about their pocketbooks keep them from traveling and enjoying fireworks as they celebrate their nation’s birth with parades, cookouts and fiery splashes of colors against the evening sky.",
      "publishedAt": "2024-07-04T04:07:05Z",
      "title": "Americans to celebrate Fourth of July with parades, cookouts — and lots of fireworks",
      "url": "https://apnews.com/602108ca0e195ca52479d37cc1c04b9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8fb4a6ce5a74cd6a5ddaf6eaf74edf1/3000.jpeg"
    },
    {
      "author": "JADE LOZADA",
      "description": "UNITED NATIONS (AP) — Haitian Prime Minister Garry Conille told the U.N. Security Council on Wednesday that recently deployed Kenyan police will be crucial to helping control the country’s gangs and moving toward democratic elections — and he called feedback from their initial days in the capital “extremely, extremely positive.”",
      "publishedAt": "2024-07-03T23:15:01Z",
      "title": "Haiti's prime minister says Kenyan police are crucial to controlling gangs, early days are positive",
      "url": "https://apnews.com/141e05d7b361eae9521acdb5a731ce14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad2ba0003f8846cea04131f9e0778544/3000.jpeg"
    },
    {
      "author": "WALTER BERRY and ANITA SNOW",
      "description": "PHOENIX (AP) — Organizers in Arizona and Nebraska said Wednesday that they turned in far more signatures than required to get ballot measures on abortion rights before voters in November's election.",
      "publishedAt": "2024-07-03T04:02:42Z",
      "title": "Abortion measures could be on Arizona and Nebraska ballots after organizers submit signatures",
      "url": "https://apnews.com/83cb053919be342d7bbb60217129fe49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdd2c70d4f55457b821cff6ca872e449/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "Violence and mass shootings often surge in the summer months, especially around the Fourth of July, historically one of the deadliest days of the year.A flurry of shootings around the holiday a year ago left more than a dozen people dead and over 60 wounded.",
      "publishedAt": "2024-07-03T12:01:20Z",
      "title": "Why mass shootings and violence increase in the summer",
      "url": "https://apnews.com/d5919ea324df5dbc732baf227123f849",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abd45ad762104a07b61d78233a5598d0/2668.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}