{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israel’s Cabinet on Wednesday approved a temporary cease-fire with the Hamas militant group that is expected to bring the first halt in fighting in a devastating six-week war and win freedom for dozens of hostages held captive in the Gaza Strip.",
      "publishedAt": "2023-11-21T07:37:00Z",
      "title": "Israeli Cabinet approves cease-fire with Hamas that includes release of some 50 hostages",
      "url": "https://apnews.com/39f5ae0bdb4e32f0e69115aa43446132",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab3085b70ab1402a9a803f2c759a365e/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — The helicopter-borne Houthi attack on an Israel-linked ship in the Red Sea highlights the danger now lurking in one of the world’s key shipping routes as the Israel-Hamas war rages, as well as the rebels’ tactics mirroring those of its chief sponsor, Iran.",
      "publishedAt": "2023-11-21T10:48:59Z",
      "title": "Analysis: Iran-backed Yemen rebels' helicopter-borne attack on ship raises risks in crucial Red Sea",
      "url": "https://apnews.com/65b611ff878a411900037e7c9a8ee17b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5911e6f7ade4ec28ed46947d2471863/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and MARI YAMAGUCHI",
      "description": "SEOUL, South Korea (AP) — North Korea said it placed a spy satellite into orbit with its third launch attempt this year, demonstrating the nation's determination to build a space-based surveillance system during protracted tensions with the United States.",
      "publishedAt": "2023-11-21T00:16:59Z",
      "title": "North Korea says it put a military spy satellite into orbit on third try",
      "url": "https://apnews.com/5e16266707e0e4034eca022fde44ffa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/598529496aa344db87452bd7c7796a9f/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump has long praised a particular type of foreign leader — men he describes as “tough” and “strong,” even if they have chipped away at their countries' democratic norms.",
      "publishedAt": "2023-11-21T20:22:20Z",
      "title": "Trump has long praised autocrats and populists. He's now embracing Argentina's new president",
      "url": "https://apnews.com/450fed8348769975506d1da5e61da184",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75e1c8fa1ca849ce9adb8818269641ff/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER, MARK THIESSEN and JOHN RABY",
      "description": "JUNEAU, Alaska (AP) — A landslide that ripped down a sopping, heavily forested mountainside in southeast Alaska killed three people, injured a woman and left three other people missing as it smashed into three homes in a remote fishing community, authorities said Tuesday.",
      "publishedAt": "2023-11-21T16:48:21Z",
      "title": "Death toll from landslide in remote Alaska fishing community reaches 3, more missing",
      "url": "https://apnews.com/c4a5c3c6af3a2e4d37d38d8b8ff1d001",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1fa55d41f0d410398c2f1ec42bf3693/1440.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, GENE JOHNSON, FATIMA HUSSEIN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The U.S. government dealt a massive blow to Binance, the world’s largest cryptocurrency exchange, which agreed to pay a roughly $4 billion settlement Tuesday as its founder and CEO Changpeng Zhao pleaded guilty to a felony related to his failure to prevent money laundering on the platform.",
      "publishedAt": "2023-11-21T17:27:45Z",
      "title": "Largest crypto exchange Binance fined $4 billion, CEO pleads guilty to not stopping money laundering",
      "url": "https://apnews.com/8314e9697b98cfe3a9827c78e5720914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f455772c9ef4d16bb9c682aaeac6b4d/2000.jpeg"
    },
    {
      "author": "GAURAV SAINI and SIBI ARASU, Press Trust of India",
      "description": "NEW DELHI (AP) — Sunil Kumar watched helplessly in July as his home and 14 others were washed away by intense monsoon rains lashing the Indian Himalayas.“All my life’s work vanished in an instant.",
      "publishedAt": "2023-11-22T02:03:51Z",
      "title": "Fund to compensate developing nations for climate change is unfinished business at COP28",
      "url": "https://apnews.com/f52dec84e0dc46054bde9391bbcd2f09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c4ec38cc50446bcb02612a495ac07b8/3000.jpeg"
    },
    {
      "author": "DAVID BILLER and DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — As soon as Leandro Francisco Diana woke up Tuesday, he reached for his phone like many Argentines on the first business day after the election victory of President-elect Javier Milei.",
      "publishedAt": "2023-11-21T21:18:20Z",
      "title": "After the dollar-loving Milei wins the presidency, Argentines anxiously watch the exchange rate",
      "url": "https://apnews.com/bb61f9e9a6108ba0ced63f89b2cfd431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb83e4852717435ab75414e5fbc094cf/1920.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE",
      "description": "RIO DE JANEIRO (AP) — Lionel Messi led his Argentina lineup off the field and into the locker rooms because of a brawl between rival fans in Brazil, delaying the start of their South American World Cup qualifier by 27 minutes Tuesday at the Maracana Stadium.",
      "publishedAt": "2023-11-22T01:02:52Z",
      "title": "Brawling fans in stands delay start of Argentina-Brazil World Cup qualifying match for 27 minutes",
      "url": "https://apnews.com/f560d95ff5bd96e6e13ec70f2d4a8084",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/890ace417ea54f33aa32559461271bd4/3000.jpeg"
    },
    {
      "author": "MADDIE BURAKOFF",
      "description": "NEW YORK (AP) — It’s the season of giving thanks — and it turns out humans have been doing it for a long, long time.As more researchers dig into the science of gratitude, they've found the feeling likely played a key role in helping our ancestors band together and survive.",
      "publishedAt": "2023-11-21T16:12:31Z",
      "title": "Giving thanks isn't just a holiday tradition. It's part of how humans evolved",
      "url": "https://apnews.com/64671ce16243e3dcb6e4647265b915bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e2bb2ace8124eeeb32fcce463946660/1864.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}