{
  "articles": [
    {
      "author": "MATT BROWN and STEVE PEOPLES",
      "description": "NEW YORK (AP) — Donald Trump says he wants to hold a major campaign event at New York's Madison Square Garden featuring Black hip-hop artists and athletes. Aides speak of Trump making appearances in Chicago, Detroit and Atlanta with leaders of color and realigning American politics by flipping Democratic constituencies.",
      "publishedAt": "2024-04-27T04:05:47Z",
      "title": "Trump promised big plans to flip Black and Latino voters. Many Republicans are waiting to see them",
      "url": "https://apnews.com/d421f0859579a48adfb03bbf305aad78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8705359fc37461792a92517018b78ed/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Even by Donald Trump's standards, this was a dizzying week.The first criminal prosecution of a former president began in earnest with opening statements and testimony in a lower Manhattan courtroom.",
      "publishedAt": "2024-04-27T13:08:58Z",
      "title": "From New York to Arizona: Inside the head-spinning week of Trump's legal drama",
      "url": "https://apnews.com/72a13a37ece0a71daf45b5d7d819ae03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2812c1d6174708a895fde39c9c77fd/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and DAVID RISING",
      "description": "CAIRO (AP) — Hamas said Saturday that it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah.",
      "publishedAt": "2024-04-27T08:31:14Z",
      "title": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as a planned Rafah offensive looms",
      "url": "https://apnews.com/7ea816cac94138492f7dddf2865c1d2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66703126e0e74c48805e3949625faae4/1920.jpeg"
    },
    {
      "author": "JULIE WATSON and LESLIE AMBRIZ",
      "description": "LOS ANGELES (AP) — On a recent afternoon, Grant Oh zigzagged across the University of Southern California campus as if he was conquering an obstacle course, coming up against police blockade after police blockade on his way to his apartment while officers arrested demonstrators protesting the Israel-Hamas war.",
      "publishedAt": "2024-04-27T05:04:28Z",
      "title": "Class of 2024 reflects on college years marked by COVID-19, protests and life's lost milestones",
      "url": "https://apnews.com/7644fb635d24edd30f8f28312cdf85b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c8c440ba05340be859b6327c78a00ee/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and MARCOS MARTÍNEZ CHACÓN",
      "description": "BRIGHTON, Colo. (AP) — Republican activists gathered in a school lunchroom last month to hear political pitches from candidates and agreed on the top issue in the Denver suburbs these days: immigration.",
      "publishedAt": "2024-04-27T13:04:28Z",
      "title": "Migration roils US elections. Mexico sees mass migration too, but its politicians rarely mention it",
      "url": "https://apnews.com/3b8ec6263868cca6ce278fc2fad23c8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc5e51e0322d4c98ba1f09980ed4c32f/3000.jpeg"
    },
    {
      "author": "NICK INGRAM, JEFF MARTIN and HEATHER HOLLINGSWORTH",
      "description": "OMAHA, Neb. (AP) — Residents began sifting through the rubble Saturday after a tornado plowed through suburban Omaha, Nebraska, demolishing homes and businesses as it moved for miles through farmland and into subdivisions, then slamming an Iowa town.",
      "publishedAt": "2024-04-27T04:32:02Z",
      "title": "Residents begin going through the rubble after tornadoes hammer parts of Nebraska and Iowa",
      "url": "https://apnews.com/f12770a52d1644d88c1dea1b92bc9903",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f8d220ab3584beab54ccdb900649b87/1920.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "MEXICO CITY (AP) — If a woman wins Mexico’s presidency on June 2, would she rule with gender in mind?The question has been raised by academics, humans rights organizations and activists ahead of the voting that will likely elect Mexico’s first female president for the term 2024-2030.",
      "publishedAt": "2024-04-27T12:45:28Z",
      "title": "A woman might win the presidency of Mexico. What could that mean for abortion rights?",
      "url": "https://apnews.com/6bee6a649729d193e9a52004075f4583",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51fe00c7d7bc4e3caa0e214008652029/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The retrial in New York of Harvey Weinstein — whose moviemaking prowess once wowed Hollywood — won’t be coming to a courtroom anytime soon, if ever, legal experts said on a day when one of two women considered crucial to the case said she wasn't sure she would testify again.",
      "publishedAt": "2024-04-27T04:09:23Z",
      "title": "Retrial of Harvey Weinstein unlikely to occur soon, if ever, experts say",
      "url": "https://apnews.com/f27efa6886759bab8529e9a6a9ea57e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1603ce19062346a19d97310b059c8d93/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — On a recent weeknight at this bar in northeast Portland, fans downed pints and burgers as college women's lacrosse and beach volleyball matches played on big-screen TVs. Memorabilia autographed by female athletes covered the walls, with a painting of U.S.",
      "publishedAt": "2024-04-27T04:25:56Z",
      "title": "Oregon's Sports Bra, a pub for women's sports fans, plans national expansion as interest booms",
      "url": "https://apnews.com/0d064d208eb899609e43d52da7157c08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2175fda83e44c1b952e25eec9659ea0/3000.jpeg"
    },
    {
      "author": "ARNIE STAPLETON",
      "description": "The top 100 prospects are off the board but plenty of playmakers remain for teams to pick through Saturday in the NFL draft 's final four rounds.",
      "publishedAt": "2024-04-27T10:10:17Z",
      "title": "Top 100 prospects already scooped up but Saturday still stocked with NFL difference-makers",
      "url": "https://apnews.com/923b70be1ce8ac6bde15def902f0e562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f07ae890ee754f878338ecbde1ad0f9f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}