{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump says he's ordering the repositioning of two U.S. nuclear submarines. This decision comes after what he calls \"highly provocative statements\" by former Russian President Dmitry Medvedev. Trump posted on his social media site that he's taking action in case Medvedev's words are more than just rhetoric. He emphasizes the importance of words and hopes for no unintended consequences. The impact on U.S. nuclear subs, which routinely patrol global hotspots, remains unclear. This move escalates tensions between Washington and Moscow at a delicate time. Trump also mentions sending a special envoy to Russia to push for a ceasefire in its war with Ukraine.",
      "publishedAt": "2025-08-01T18:06:04Z",
      "title": "Trump orders US nuclear subs repositioned over statements from ex-Russian leader",
      "url": "https://apnews.com/article/trump-nuclear-submarines-repositioned-medvedev-f8e9b870fa107f6b6209e7a22f8ada43",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7ab803/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F9e%2Fa78d8d6a4cd8ffa11a45205b8267%2F0462a46b5e3c44aba7eee6d781d7e57d"
    },
    {
      "author": null,
      "description": "American businesses and consumers are finding the contours of President Donald Trump’s foreign trade agenda taking shape. But they don't have much more clarity on how import taxes on goods from dozens of countries will affect them. Late Thursday, Trump ordered new tariff rates for 66 countries, the European Union, Taiwan and the Falkland Islands. Trump postponed the start date for all of the tariffs from Friday until Aug. 7. Companies are dealing with tariffs in various ways, from absorbing the tax costs themselves to raising prices. Economist say U.S. consumers are likely to foot at least part of the bill.",
      "publishedAt": "2025-08-01T15:31:53Z",
      "title": "Economists say US consumers are likely to see effects from Trump's tariffs",
      "url": "https://apnews.com/article/trump-tariffs-consumers-prices-ebf959d8f8ad24bd0757d8e3693924c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/bed8879/2147483647/strip/true/crop/3000x1688+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2Fff%2F89676f2f6a4c21237df3f1c58600%2Fc351168a2edc485ca1e7fc818f86c6d2"
    },
    {
      "author": null,
      "description": "President Donald Trump said Friday that he has directed his team to fire the head of the agency that produces the monthly jobs figures, after a weak report showed hiring slowed and was much weaker in April and May than previously reported. Trump in a post on his social media platform alleged that the figures were manipulated for political reasons and said that Erika McEntarfer, the director of the Bureau of Labor Statistics, who was appointed by former President Joe Biden, should be fired.",
      "publishedAt": "2025-08-01T18:42:18Z",
      "title": "Trump seeks to fire official overseeing jobs data after weak employment report",
      "url": "https://apnews.com/article/trump-jobs-firing-f00e9bf96d0110519be9bf4f3ec89195",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc66fb2/2147483647/strip/true/crop/5611x3156+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F56%2Ff337e94f1ffb75dc9d254d8aebd4%2F604e2502093c44fe8d153600fbb0a794"
    },
    {
      "author": null,
      "description": "The Corporation for Public Broadcasting has been a cornerstone of American culture for three generations. Now it says it will begin taking steps toward its own closure after being defunded by the U.S. Senate. That marks the end of a nearly six-decade era in which it fueled the production of renowned educational programming, cultural content and even emergency alerts. The demise of the corporation, known as CPB, is a direct result of President Donald Trump’s targeting of public media, which he has repeatedly said is spreading political and cultural views antithetical to those the United States should be espousing. The closure is expected to have a profound impact on the journalistic and cultural landscape.",
      "publishedAt": "2025-08-01T19:23:18Z",
      "title": "Corporation for Public Broadcasting to close after Congress defunds it",
      "url": "https://apnews.com/article/public-broadcasting-defunding-pbs-npr-94708ffb8313d4811fa6ca199fe454ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/4836298/2147483647/strip/true/crop/3435x1932+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F47%2F04431ebadab9b4cf56e12651e293%2F0ddb51fba5144786b601d13fadfe377c"
    },
    {
      "author": null,
      "description": "Switzerland is home to some of the world’s most recognizable luxury brands. It now faces a 39% tariff as a result of U.S. President Donald Trump’s trade war. Industry groups warned that both Swiss companies and American consumers could pay the price. Swiss officials failed to reach an agreement with the U.S. after Trump initially threatened a 31% tariff in April. The Swiss government spent Friday reeling from the news. The U.S. goods trade deficit with Switzerland was $38.5 billion last year. That's according to the Office of the United States Trade Representative.",
      "publishedAt": "2025-08-01T15:43:01Z",
      "title": "Switzerland, the land of luxury brands, could see prices skyrocket from Trump's 39% tariffs",
      "url": "https://apnews.com/article/switzerland-tariffs-trump-us-trade-war-3700eaf85a7eac02bb0fd52a0461176b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9529dc7/2147483647/strip/true/crop/6275x3530+0+327/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F65%2F30ad6c253389f8b7b255e4af5058%2F5804395bdaf44ea58548afba6b05e1b3"
    },
    {
      "author": null,
      "description": "World shares have retreated after President Donald Trump issued a new set of import duties that will apply to dozens of countries as of Aug. 7. U.S. futures fell 0.9% after Trump announced tariff rates of up to 41% for imports from 68 countries and the European Union and a separate increase to 35% for Canada, effective Friday. European shares were down more than 1.5% and the Kospi in South Korea sank nearly 4%. Oil prices also fell. On Thursday, the S&P 500 fell 0.4% while the Dow lost 0.7%. The Nasdaq composite index closed less than 0.1% lower.",
      "publishedAt": "2025-08-01T05:31:50Z",
      "title": "World shares fall after Trump's order imposing new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-asia-wall-street-5bf5640b85f63cf7db292d0aaf26e97a",
      "urlToImage": "https://dims.apnews.com/dims4/default/38c8961/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Ff7%2F9c4efc260269e89c30fb4ce3bafd%2F444eba4af8134cf384bb1ed640627575"
    },
    {
      "author": null,
      "description": "Authorities have launched a manhunt after a shooting at a Montana bar left four people dead. State investigators said the shooting happened Friday morning at The Owl Bar in Anaconda. Public records show that the suspect lived next door to the bar. His home was cleared by a SWAT team, but he was still at large and believed to be armed, prompting warnings from officials to avoid the area. Authorities have yet to release details about what led to the shooting. Anaconda is a town of about 9,000 people and is about 75 miles southeast of Missoula.",
      "publishedAt": "2025-08-01T20:04:16Z",
      "title": "Manhunt launched after 4 killed in a shooting at a Montana bar",
      "url": "https://apnews.com/article/montana-shooting-anaconda-4ac87ca290e7b9149bdd588766bcee3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a44e9eb/2147483647/strip/true/crop/5417x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F72%2F982529d30bf27739c3d071635e0b%2Fc8f074a189894735b2f9859ae7960d3d"
    },
    {
      "author": null,
      "description": "A Miami jury ordered Elon Musk’s car company on Friday to pay $329 million to victims of a deadly crash involving its Autopilot driver assist technology, opening the door to other costly lawsuits and striking a blow to Tesla’s reputation for safety. The federal jury held that Tesla bore significant responsibility because its technology failed and that not all the blame can be put on a reckless driver, even one who admitted he was at fault. The driver had been looking for a dropped cell phone when he hit a young couple out gazing at the stars. The case could encourage other crash victims to hold out for big damages and dent confidence in self-driving technology.",
      "publishedAt": "2025-08-01T18:03:28Z",
      "title": "Jury orders Tesla to pay millions in Autopilot crash case, opening the door to other costly lawsuits",
      "url": "https://apnews.com/article/tesla-miami-musk-benavides-selfdriving-autopilot-autonomous-vehicles-c342f2716b1ec4e9ede09b8e958751b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f559c4/2147483647/strip/true/crop/3000x1688+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2F07%2Fd9f78d2b8b26fac9805e37a44d03%2Fcccc3b305f57441a8a2622d16a91de22"
    },
    {
      "author": null,
      "description": "Jeffrey Epstein’s former girlfriend, Ghislaine Maxwell, has been moved from a federal prison in Florida to a prison camp in Texas as her criminal case generates renewed public attention. The federal Bureau of Prisons said Friday that Maxwell was taken to Bryan, Texas, but did not explain the circumstances. Her attorney confirmed the move but also declined to discuss the reasons for it. Maxwell was convicted in 2021 of helping Epstein sexually abuse underage girls and was sentenced to 20 years in prison. She had been held at a prison in Tallahassee, Florida, until her transfer to the camp in Texas.",
      "publishedAt": "2025-08-01T16:38:53Z",
      "title": "Former Epstein girlfriend Ghislaine Maxwell transferred to prison camp in Texas",
      "url": "https://apnews.com/article/epstein-ghislaine-maxwell-justice-department-prison-27d53cd22f8c53d9f2b5012cea32eb5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "Jeannie Seely, the soulful country music singer known for hits like “Don’t Touch Me,” has died at 85. Her publicist says she died Friday from complications of an intestinal infection. Known as “Miss Country Soul,” Seely was a trailblazer for women in country music, celebrated for her spirited nonconformity and hits in the ‘60s and ’70s. She was hospitalized in May after multiple surgeries and a bout of pneumonia. Seely never stopped working in country music. Since 2018, she's hosted the weekly “Sunday’s with Seely” on Willie Nelson's SiriusXM channel. She appeared nearly 5,400 times at Grand Ole Opry, which will dedicate its Saturday show to her.",
      "publishedAt": "2025-08-01T23:13:58Z",
      "title": "Jeannie Seely, country singer of hits like ‘Don’t Touch Me,’ dies at 85",
      "url": "https://apnews.com/article/jeannie-seely-dead-f5e817427aecdf18efad4dcb88458268",
      "urlToImage": "https://dims.apnews.com/dims4/default/27d9646/2147483647/strip/true/crop/3000x1688+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F1e%2Fc59215a474838aa308f86e1b0270%2Fc0cb4bcf6a6e41a682d2ff4afa4702a4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}