{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump's lawyer told The Associated Press he was surprised at Trump’s stoic demeanor as he listened to the verdict that made him the first former U.S. president convicted of a crime.",
      "publishedAt": "2024-06-01T01:38:16Z",
      "title": "Donald Trump’s attorney was 'shocked' the former president took the verdict with 'solemnness'",
      "url": "https://apnews.com/4361e2bd70c287f38ba68b920e13ff81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38205381b58e4510be219921f26db6f7/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump sought to move past his historic criminal conviction on Friday and build momentum for his bid to return to the White House with fierce attacks on the judge who oversaw the case, the prosecution’s star witness and the criminal justice system as a whole.",
      "publishedAt": "2024-05-31T04:07:16Z",
      "title": "Trump tries to move past his guilty verdict by attacking the criminal justice system",
      "url": "https://apnews.com/4629840240cb308c5eae335532ad17ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Embracing Donald Trump’s strategy of blaming the U.S. justice system after his historic guilty verdict, Republicans in Congress are fervently enlisting themselves in his campaign of vengeance and political retribution in the GOP bid to reclaim the White House.",
      "publishedAt": "2024-06-01T04:24:48Z",
      "title": "Republicans join Trump's attacks on justice system and campaign of vengeance after guilty verdict",
      "url": "https://apnews.com/a05db7fa2512a62afe035992f2baaf16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/391f65a842984f1c9628864d8b6cf4b0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Will Donald Trump go to prison? Could he pardon himself? What about the election? The first criminal conviction of a former American president raises a host of legal and political questions.",
      "publishedAt": "2024-05-31T19:08:19Z",
      "title": "Answers to your questions about Donald Trump's historic hush money trial conviction",
      "url": "https://apnews.com/d4ed0607e8642e7e1aa598e52cc6d94b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f80d48041ce0442dba6975632bd8286a/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Patients lying shackled and blindfolded on more than a dozen beds inside a white tent in the desert. Surgeries performed without adequate painkillers. Doctors who remain anonymous.",
      "publishedAt": "2024-06-01T05:15:33Z",
      "title": "Israel maintains a shadowy hospital in the desert for Gaza detainees. Critics allege mistreatment",
      "url": "https://apnews.com/3ca025f6ca412ce07c0c41cf11c52c6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f08a521da204631b251fb0865014699/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "SINGAPORE (AP) — United States Secretary of Defense Lloyd Austin told a gathering of top security officials Saturday that war with China was neither imminent nor unavoidable, despite rapidly escalating tensions in the Asia-Pacific region, stressing the importance of renewed dialogue between him and his Chinese counterpart in avoiding “miscalculations and misunderstandings.”",
      "publishedAt": "2024-06-01T03:41:01Z",
      "title": "US defense secretary says war with China neither imminent nor unavoidable, stressing need for talks",
      "url": "https://apnews.com/46868bec3799f5043276d9fdeca62a41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55a319293ba743c58601b84cbd7904f9/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Indians began voting Saturday in the last round of a six-week-long national election that is a referendum on Hindu nationalist Prime Minister Narendra Modi’s decade in power.",
      "publishedAt": "2024-06-01T01:33:16Z",
      "title": "Voting begins in the last round of India's election, a referendum on Modi's decade in power",
      "url": "https://apnews.com/97b33ccf7744668218bcf3b788f4865d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc8b2ddae7d54fb583ce53f346d12bf4/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Pride Month, the worldwide celebration of LGBTQ+ culture and rights, kicks off Saturday with events around the globe.But this year’s festivities in the U.S. will unfold against a backdrop of dozens of new state laws targeting LGBTQ+ rights, particularly transgender young people.",
      "publishedAt": "2024-06-01T04:18:01Z",
      "title": "LGBTQ+ Pride Month is starting to show its colors around the world. What to know",
      "url": "https://apnews.com/1abf80d0cf1026b60b47f565e9953fec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d338bebac964c979383e4cc118070fb/2412.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI, MARK VANCLEAVE AND JOSH FUNK",
      "description": "MINNEAPOLIS (AP) — The shooting death of a Minneapolis police officer has stunned a department that has struggled to fill its ranks since the murder of George Floyd and the ensuing turmoil.",
      "publishedAt": "2024-05-31T16:53:36Z",
      "title": "Killing of Minneapolis police officer stuns a department that's been struggling to fill its ranks",
      "url": "https://apnews.com/f6a1278c618e4c966b758ca1d1fcde40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/393ac214be8947738270cb7561238c5a/1920.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "Mexican voters are poised to elect their first female president, a cause of celebration for many that has also touched off a flurry of false and misogynist online claims, blurring the lines behind fact and fiction.",
      "publishedAt": "2024-06-01T04:19:29Z",
      "title": "Sexist tropes and misinformation swirl online as Mexico prepares to elect its first female leader",
      "url": "https://apnews.com/79adddaf8300f30af51fddbbf3165216",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65ecdbb3631e445289f6399b022d1ecc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}