{
  "articles": [
    {
      "author": "Kate Brumback, Julie Walker",
      "description": "The Northeastern U.S. is getting the last brunt of a massive winter storm that dumped snow, sleet and ice across much of the southern and eastern U.S. over the weekend. The colossal storm halted air and road traffic in many areas and sent temperatures plunging. As the work week began, the heaviest snow was falling from New York northward into New England. That's after heavy ice snapped branches and power lines in the South, leaving hundreds of thousands of homes and businesses without electricity. In the meantime, arctic air was spreading in behind the storm and some communities in New York saw record-breaking subzero temperatures.",
      "publishedAt": "2026-01-26T05:01:03Z",
      "title": "Colossal storm dumps deep snow in Northeast after dropping sleet and ice in the South",
      "url": "https://apnews.com/article/winter-weather-storm-snow-ice-cbdc1977b810322baf976c91b622516b",
      "urlToImage": "https://dims.apnews.com/dims4/default/95cb7fa/2147483647/strip/true/crop/7732x5152+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Ff2%2F40b22522b0e4126d5f6422c3f20c%2F082caaf0fa7841939e372c71d7aa5c41"
    },
    {
      "author": "Michelle L. Price",
      "description": "The fatal shooting of a Minneapolis protester by a federal immigration officer touched off a firestorm and prompted some fellow Republicans to question President Donald Trump’s hard-line immigration crackdown, but the president on Sunday night doubled down and blamed Democratic officials. After remaining relatively quiet on Sunday, the Republican president in two lengthy social media posts said that Democrats had encouraged people to obstruct law enforcement operations. He also called on officials in Minnesota to work with immigration officers and “turn over” people who were in the U.S. illegally.",
      "publishedAt": "2026-01-25T23:59:54Z",
      "title": "Trump blames Democrats for chaos in Minneapolis",
      "url": "https://apnews.com/article/trump-minneapolis-shooting-immigration-deportation-e1f03e81c43176ba6f3dd960043ff626",
      "urlToImage": "https://dims.apnews.com/dims4/default/650a2a0/2147483647/strip/true/crop/8600x5730+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F36%2Fa0331c2bd9b623c7f78d0e4dece7%2Ff3aad3e9339845dfb3fe0acef07329b8"
    },
    {
      "author": "Steve Karnowski",
      "description": "A federal judge is set to hear arguments Monday on whether to pause an immigration crackdown in Minnesota. This follows the fatal shootings of two people by government officers. The state and the cities of Minneapolis and St. Paul sued the Department of Homeland Security two weeks ago. They want to restore conditions before the Trump administration's Operation Metro Surge began in December. Democratic Minnesota Attorney General Keith Ellison plans to attend the hearing. Justice Department attorneys have called the lawsuit legally frivolous. The case could have implications for other states facing similar immigration enforcement operations like that underway in Minnesota.",
      "publishedAt": "2026-01-26T05:11:53Z",
      "title": "Federal judge set to hear arguments on Minnesota immigration crackdown",
      "url": "https://apnews.com/article/shooting-minneapolis-protests-ice-immigration-lawsuit-5bd12d70d3c76bfe5eacd802ce7480a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/c56d0d1/2147483647/strip/true/crop/5248x3497+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F25%2F505ec4a3755c414299e05da3bf21%2F335fed26d1434608b70ccf5b2104bc48"
    },
    {
      "author": "Jim Gomez",
      "description": "An inter-island ferry with more than 350 on board has sunk in the southern Philippines after midnight and rescuers have saved at least 316 passengers and retrieved 15 bodies. Officials say the M/V Trisha Kerstin 3, a cargo and passenger ferry, was sailing from the port city of Zamboanga to southern Jolo island in Sulu province with 332 passengers and 27 crew members early Monday when it apparently encountered technical problems and sank. Coast guard officials said the cause of the accident was not immediately clear, but noted that the boat was cleared by the coast guard before departing and did not appear to be overcrowded.",
      "publishedAt": "2026-01-25T22:49:47Z",
      "title": "Ferry sinks in Philippines with over 350 on board",
      "url": "https://apnews.com/article/philippines-ferry-sinking-passengers-772cfd1802a7ad0ca184869201772754",
      "urlToImage": "https://dims.apnews.com/dims4/default/c864124/2147483647/strip/true/crop/8533x5686+0+357/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F5d%2F13fb1674ed9e2f5845ad9099ded3%2F99f67f3acce84879b123f75d786bf1db"
    },
    {
      "author": null,
      "description": "The Federal Aviation Administration says a private aircraft with eight people on board has crashed on takeoff from Bangor International Airport in Maine. The Bombardier Challenger 600 crashed around 7:45 p.m. Sunday. There was no immediate word on the conditions of those aboard and an airport statement said the airport was closed and emergency crews were at the site. The FAA and the National Transportation Safety Board are investigating. The crash occurred as New England and much of the country grappled with a massive winter storm. Bangor had steady snowfall Sunday like much of the northeastern United States.",
      "publishedAt": "2026-01-26T03:02:18Z",
      "title": "Private jet carrying 8 crashes at Bangor, Maine, airport",
      "url": "https://apnews.com/article/plane-crash-maine-winter-weather-d963803b01c342c3d25d4071d79dba4e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d8ae33/2147483647/strip/true/crop/2386x1590+182+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Ff4%2Fa970bb3525d4f5dba3f86b3519d1%2F14c7fbb9757b4a5783bd60cf6139fed6"
    },
    {
      "author": "E. Eduardo Castillo",
      "description": "China says it is investigating the army’s top general for suspected serious violations of discipline and law. Gen. Zhang Youxia was the highest military member just below President Xi Jinping. The Defense Ministry said Saturday that authorities were investigating Zhang, the senior of the two vice chairs of the powerful Central Military Commission. Authorities also are investigating Gen. Liu Zhenli, who was in charge of the military’s Joint Staff Department. The full impact of the changes for the army and China in general remains unknown. Some experts say this might have repercussion on Beijing’s next move on Taiwan, the self-rule island that Beijing claims as its own territory.",
      "publishedAt": "2026-01-26T07:58:53Z",
      "title": "China removes top general in military leadership purge",
      "url": "https://apnews.com/article/china-military-purge-general-zhang-investigation-76271533450c6fe6614e65e8016676ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/af41cf2/2147483647/strip/true/crop/2000x1333+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Fb9%2F7905f9c337d6093601e94b2ea086%2F515d38d8f47a4be8babe5669afe53302"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen’s Iranian-backed Houthi rebels have threatened new attacks on ships in the Red Sea corridor. This move seems to support Iran, which is concerned about a U.S. aircraft carrier approaching the region. The Houthis released a video showing a ship on fire with the caption “Soon.” They attacked over 100 ships during Israel's war on Hamas in the Gaza Strip but halted after a ceasefire. The threat comes as the USS Abraham Lincoln moves toward the area. Meanwhile, Iran has renewed warnings to Israel and the U.S., saying any attack would be met with a strong response.",
      "publishedAt": "2026-01-26T08:51:23Z",
      "title": "Yemen rebels threaten attack as US aircraft carrier heads toward Iran",
      "url": "https://apnews.com/article/iran-protests-us-aircraft-carrier-crackdown-yemen-e0a6b3c72775348c553ad185af5bfb20",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb71221/2147483647/strip/true/crop/5705x3801+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fbd%2Fab3ced2c7d8f5e488e0e114cf764%2Fe687430d2ab74aa09fb32abdaf6bed44"
    },
    {
      "author": "Josh Funk",
      "description": "So many things went wrong last Jan. 29 to contribute to the collision between an airliner and a U.S. Army helicopter that killed 67 people that the National Transportation Safety Board isn’t likely to identify a single cause at its hearing Tuesday. Instead, the investigators will detail all the things they found that played a role in the crash near Washington, and the board will recommend changes that should be made to help prevent a similar event from happening again. Family members of the victims hope those suggestions won’t be ignored the same way many past NTSB recommendations have been after other crashes.",
      "publishedAt": "2026-01-26T05:04:19Z",
      "title": "NTSB to hold hearing on collision of plane and helicopter over Washington",
      "url": "https://apnews.com/article/dc-plane-crash-army-helicopter-ntsb-cause-f2e87b625583c077acfca694700de37f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3a515a/2147483647/strip/true/crop/3349x2232+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F59%2Ff2c425d9de13111ef11b1c68c77c%2Fd64a6d7fe0ae43a28202414e0f258a85"
    },
    {
      "author": "Colleen Barry",
      "description": "Michelle Francine Ngonmo, a Cameroonian-Italian, has dedicated her career to promoting Africans and people of color in Italian fashion. She founded the Afrofashion Association a decade ago to address the lack of representation. Ngonmo produces runway shows, mentors talent, and launched the Black Carpet Awards. The association has worked with 3,000 people of color, with 92 in creative jobs. Despite initial momentum from the Black Lives Matter movement, attention has waned. Ngonmo now focuses on supportive institutions like the Italian National Fashion Chamber, which backs emerging Black talents like Victor-Hart.",
      "publishedAt": "2026-01-26T06:47:10Z",
      "title": "Afrofashion Association pushes for more inclusion in Italian fashion and society",
      "url": "https://apnews.com/article/diversity-inclusion-milan-fashion-08900d319dabb1ea85e84b9294c6292a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4fa624b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F83%2Feeb12bae47a0d0ffaeaee805d847%2Fa510f95acf174a5ba73fab6e8e95255b"
    },
    {
      "author": "Jack Brook, Steve Karnowski, Rebecca Santana",
      "description": "Democratic officials and protesters on the streets are demanding that federal immigration officers leave Minnesota after a Border Patrol agent fatally shot a man in Minneapolis. Saturday's shooting drew hundreds of demonstrators into the frigid cold in a city already shaken by another killing weeks earlier. Minneapolis Police Chief Brian O’Hara says information about what led up to the latest shooting is limited. The man has been identified by his parents as Alex Pretti. He was a 37-year-old intensive care unit nurse. The Minnesota National Guard assisted local police in monitoring the crowds.",
      "publishedAt": "2026-01-25T05:01:38Z",
      "title": "After fatal shooting in Minneapolis, protesters and Democrats demand federal agents leave",
      "url": "https://apnews.com/article/shooting-minneapolis-protests-ice-immigration-0af10ec433181aa9300deea26d1cc8c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe606de/2147483647/strip/true/crop/3600x2399+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F41%2F2c6f8d9d7985877a890a256ec7d0%2F53e02021b11b43ec95470f1f7b790c3b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}