{
  "articles": [
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN, COLLEEN LONG, MICHAEL BALSAMO, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "BUTLER, Pa. (AP) — Former President Donald Trump was the target of an assassination attempt Saturday at a Pennsylvania rally, days before he was to accept the Republican nomination for a third time.",
      "publishedAt": "2024-07-13T04:00:26Z",
      "title": "Trump injured but 'fine' after attempted assassination at rally, shooter and one attendee are dead",
      "url": "https://apnews.com/7c7ba6b99b5f38d2d840ed95b2fdc3e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf83de39d99b4653ab645ef5c2f07f93/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Donald Trump’s campaign says he is “fine” after what law enforcement officials are treating as an assassination attempt during a rally in Butler, Pennsylvania.",
      "publishedAt": "2024-07-13T14:29:06Z",
      "title": "The Latest: Officials say man who opened fire at Trump rally was a 20-year-old from Pennsylvania",
      "url": "https://apnews.com/56b8d4463b242e2bd23194fed7704d6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dcebcf40ccf4e79b7c7172670b3ff09/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "REHOBOTH BEACH, Del. (AP) — President Joe Biden said Saturday that “everybody must condemn” the suspected assassination attempt on former President Donald Trump.",
      "publishedAt": "2024-07-14T00:45:17Z",
      "title": "Biden says 'everybody must condemn' attack on Trump and later speaks with ex-president",
      "url": "https://apnews.com/6822e3147ffc68781ab3e60d62836cd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0904f8e7a314528b1150d1ded993f5b/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER and MICHAEL KUNZELMAN",
      "description": "The U.S. Secret Service is investigating how a gunman armed with an AR-style rifle was able to get close enough to shoot and injure former President Donald Trump at a rally Saturday in Pennsylvania, a monumental failure of one the agency’s core duties.",
      "publishedAt": "2024-07-14T05:33:56Z",
      "title": "The Secret Service is investigating how a gunman who shot and injured Trump was able to get so close",
      "url": "https://apnews.com/4e3415b1461f5acefbc8e1fadad0375b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ea4340bef11477a8a74887816b6ddfa/3000.jpeg"
    },
    {
      "author": "MOHAMED JAHJOUH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel said it targeted Hamas’ shadowy military commander in a massive strike Saturday in the crowded southern Gaza Strip that killed at least 90 people including children, according to local health officials.",
      "publishedAt": "2024-07-13T10:27:48Z",
      "title": "Israeli strike targets the Hamas military commander and kills at least 90 in southern Gaza",
      "url": "https://apnews.com/83bc4de7ed25b317c7871fd5c0999ad1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc3944ec9d7a4c7d869b87a791954d6f/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — When Maksim Kolker’s phone rang at 6 a.m., and the voice on the other end said his father had been arrested, he thought it was a scam to extort money. A day earlier, he had taken his father, prominent Russian physicist Dmitry Kolker, to the hospital in his native Novosibirsk, when his advanced pancreatic cancer had suddenly worsened.",
      "publishedAt": "2024-07-14T04:05:06Z",
      "title": "Treason and espionage cases are rising in Russia since the war in Ukraine began",
      "url": "https://apnews.com/ee99b15588fc0c3b20ed0e381afe3de3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fdef20737614da4b22e7da592e2f371/3000.jpeg"
    },
    {
      "author": "MELINA WALLING and JUAN A. LOZANO",
      "description": "PORTER, Texas (AP) — Hurricanes cause trouble for everyone, but farmers have a whole other list of problems. Beryl has been no exception: Over the past week, the storm damaged crops, soaked rabbits and chickens, terrified goats, put horses at risk of developing colic and left cows without fences to keep them penned in.",
      "publishedAt": "2024-07-14T04:04:32Z",
      "title": "After Beryl, Houston-area farmers pull together to face unique challenges",
      "url": "https://apnews.com/03a46c99c853a7e0907af6273b157fe3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1a7b719b9604fa29412033e724ca2fe/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Richard Simmons, television's hyperactive court jester of physical fitness who built a mini-empire in his trademark tank tops and short shorts by urging the overweight to exercise and eat better, died Saturday.",
      "publishedAt": "2024-07-13T21:45:47Z",
      "title": "Richard Simmons, a fitness guru who mixed laughs and sweat, dies at 76",
      "url": "https://apnews.com/db369da9e7f54f17bbbb1331af43508f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe8584c93cfe40bc9a9efbb657b479df/2025.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Paris is hosting an extra-special guest for France’s national holiday Sunday — the Olympic flame lighting up the city’s grandiose military parade for Bastille Day.",
      "publishedAt": "2024-07-14T05:03:57Z",
      "title": "France's Bastille Day parade meets the Olympic torch relay in an exceptional year",
      "url": "https://apnews.com/d33f90230ffa2a2c3c95873e3e167a36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/134a7fff8043428e934a7126478e17f7/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and CHRISTINA A. CASSIDY",
      "description": "WASHINGTON (AP) — Before Saturday’s apparent attempted assassination of former President Donald Trump, there have been multiple instances of political violence targeting U.S.",
      "publishedAt": "2024-07-14T02:29:03Z",
      "title": "Four US presidents were assassinated; others were targeted, as were presidential candidates",
      "url": "https://apnews.com/175d046b694ec8b370ba60bf2b001d76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf6622b346784dc4bce87056f777a102/2812.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}