{
  "articles": [
    {
      "author": "JENNIFER PELTZ and DEREK GATOPOULOS",
      "description": "UNITED NATIONS (AP) — Ukrainian President Volodymyr Zelenskyy said Tuesday that Russia is “weaponizing” everything from food and energy to abducted children in its war against Ukraine — and he warned world leaders that the same could happen to them.",
      "publishedAt": "2023-09-19T00:45:39Z",
      "title": "Zelenskyy: Russia is weaponizing food, energy and abducted children in its war against Ukraine",
      "url": "https://apnews.com/1e6b464628a7a391289b2ad386bd2d8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82dd8ef792be4610a6de495440531763/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "UNITED NATIONS (AP) — President Joe Biden made his case before the U.N. General Assembly on Tuesday that the world must remain united in defending Ukraine against Russian aggression, warning that no nation can be secure if “we allow Ukraine to be carved up\" as he tries to rally support for Kyiv's effort to repel a nearly 19-month-old Russian invasion that has no end in sight.",
      "publishedAt": "2023-09-19T09:02:34Z",
      "title": "Biden exhorts world leaders at the UN to stand up to Russia, warns not to let Ukraine 'be carved up'",
      "url": "https://apnews.com/04b25cd42d03caf194def2862f6eb8d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b500f16cbb84b39b5142ea087a130ff/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans plan to hold their first hearing next week in their impeachment inquiry into President Joe Biden.",
      "publishedAt": "2023-09-19T14:41:45Z",
      "title": "House Republicans set first Biden impeachment inquiry hearing for Sept. 28",
      "url": "https://apnews.com/6f454b9ea2d38468a848c495bda0b5bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63e4af59d3be470aba30c45f4f497c74/2160.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ROB GILLIES",
      "description": "NEW DELHI (AP) — India expelled one of Canada’s top diplomats Tuesday, ramping up a confrontation between the two countries over Canadian accusations that India may have been involved in the killing of a Sikh separatist leader in suburban Vancouver.",
      "publishedAt": "2023-09-19T03:23:54Z",
      "title": "India expels Canadian diplomat, escalating tensions after Trudeau accuses India in Sikh's killing",
      "url": "https://apnews.com/3c5572d9027769ea6adbd047ec6f462a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7282ecdc1d9641a2958d459b04222864/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The United Auto Workers union is stepping up pressure on Detroit’s Big Three by threatening to expand its strike unless it sees major progress in contract negotiations by Friday.In a video statement late Monday, UAW President Shawn Fain said workers at more factories will join those who are now in the fifth day of a strike at three plants.",
      "publishedAt": "2023-09-18T15:38:23Z",
      "title": "United Auto Workers threaten to expand targeted strike if there is no substantive progress by Friday",
      "url": "https://apnews.com/f948704cce3d6dc9ca484142c5d0d98e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/890251f98bf64f5c87669011e2e9a467/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Facing fresh challenges to his leadership, Speaker Kevin McCarthy is trying to accomplish what at times seems impossible — working furiously to convince House Republicans to come together and pass a conservative bill to keep the federal government open.",
      "publishedAt": "2023-09-19T19:05:18Z",
      "title": "Speaker McCarthy faces an almost impossible task trying to unite House GOP and fund the government",
      "url": "https://apnews.com/543f93b6ad6a3f23ee3f5275e19293f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85b08c0d48634ac6ace33f3b9bb5fd0e/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, JON GAMBRELL and LUJAIN JO",
      "description": "WASHINGTON (AP) — Americans detained for years in Iran arrived home Tuesday, tearfully hugged their loved ones and declared “Freedom!” after being let go as part of a politically risky deal that saw President Joe Biden agree to the release of nearly $6 billion in frozen Iranian assets.",
      "publishedAt": "2023-09-19T10:47:46Z",
      "title": "Americans released by Iran arrive home, tearfully embrace their loved ones and declare: 'Freedom!'",
      "url": "https://apnews.com/b9c2ec8209117d28f87074a6402ffef1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e49fd5a273a4fb1aa54c6af099c935d/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The classified documents indictment of Donald Trump would seem, on paper at least, to be the most straightforward of the four criminal cases the former president is facing.",
      "publishedAt": "2023-09-19T04:18:16Z",
      "title": "Florida jury pool could give Trump an advantage in classified documents case",
      "url": "https://apnews.com/68155de474a855cd37e2a5c27ce55cbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77903ab20b174109bbab33a370099692/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — A man accused of killing nearly two dozen older women and who was convicted last year in the slayings of two was killed Tuesday morning by his cellmate at a Texas prison, an official said.",
      "publishedAt": "2023-09-19T16:21:13Z",
      "title": "Man accused in deaths of 22 elderly women in Texas killed in prison by his cellmate",
      "url": "https://apnews.com/382dde6fb821950b0e27f2d8d474b289",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2269203d61944df79196148bb00a8a25/3000.jpeg"
    },
    {
      "author": "PAT GRAHAM",
      "description": "BOULDER, Colo. (AP) — Deion Sanders stood up for Henry Blackburn on Tuesday after the Colorado State safety received death threats for a late hit that sent Colorado's two-way star Travis Hunter to the hospital with a lacerated liver.",
      "publishedAt": "2023-09-19T18:39:11Z",
      "title": "Deion Sanders condemns death threats against player whose late hit left Hunter with lacerated liver",
      "url": "https://apnews.com/d05cd57e60f8ea01675e3ff02f4abfee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76c7eff6159741998bfbb10f5280cc91/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}