{
  "articles": [
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French voters face a decisive choice on July 7 in the runoff of snap parliamentary elections that could see the country’s first far-right government since the World War II Nazi occupation — or no majority emerging at all.",
      "publishedAt": "2024-06-30T22:24:33Z",
      "title": "French far right ahead in 1st round of snap elections. Here's how runoff works and what comes next",
      "url": "https://apnews.com/193233ade08821a71731980d8a17eb4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41e0198fc13742f4be5518da2a66b951/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER and THOMAS BEAUMONT",
      "description": "WASHINGTON (AP) — President Joe Biden's family used a Sunday gathering at Camp David to urge him to stay in the race and keep fighting despite his dreadful debate performance, and some members criticized how his staff prepared him for the faceoff, according to four people familiar with the discussions.",
      "publishedAt": "2024-06-30T17:33:49Z",
      "title": "Gathered at Camp David, Biden's family tells him to stay in the race and keep fighting",
      "url": "https://apnews.com/01bd3586a2f2da9217a04d031ddd7934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b118780888d9487db547ac5d94f1b72c/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Beryl closed in on the southeastern Caribbean late Sunday after strengthening into what experts called an \"extremely dangerous” Category 4 storm, and government officials pleaded with people to take shelter.",
      "publishedAt": "2024-06-30T10:50:38Z",
      "title": "Hurricane Beryl closes in on southeast Caribbean after strengthening into dangerous Category 4 storm",
      "url": "https://apnews.com/aaae273e307658866fdd27f9f2c76592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d3e00ee5ce94ecd87c37ed989b0f1c8/1920.jpeg"
    },
    {
      "author": "OHAD ZWIGENBERG",
      "description": "JERUSALEM (AP) — Thousands of Jewish ultra-Orthodox men clashed with Israeli police in central Jerusalem on Sunday during a protest against a Supreme Court order for them to begin enlisting for military service.",
      "publishedAt": "2024-06-30T18:41:05Z",
      "title": "Ultra-Orthodox protest against order to enlist in Israeli military turns violent in Jerusalem",
      "url": "https://apnews.com/5b17485638c0a3e578b179a8bbf44fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c793d8094014228ab73251d186c6a88/3000.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO, EVGENIY MALOLETKA and DEREK GATOPOULOS",
      "description": "DNIPROPETROVSK REGION, Ukraine (AP) — At a rural penal colony in southeast Ukraine, several convicts stand assembled under barbed wire to hear an army recruiter offer them a shot at parole. In return, they must join the grueling fight against Russia.",
      "publishedAt": "2024-07-01T05:10:29Z",
      "title": "Ukraine's convicts offered release at a high price: Joining the fight against Russia",
      "url": "https://apnews.com/08d1b13d527548ea4cc24de636766342",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/021fb9832e664907b415d1997924b593/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — It’s hard to refer to someone as “Hitler” and end up in their good graces, let alone potentially become the person they choose to help lead the country. But Ohio Sen. JD Vance’s shifting position on Donald Trump over the years from one-time critic of the former president to staunch ally is a metamorphosis shared by many of Trump’s potential running mates.",
      "publishedAt": "2024-07-01T04:06:47Z",
      "title": "The Republicans who want to be Trump's VP were once harsh critics with key policy differences",
      "url": "https://apnews.com/11ec39b0da11152ad110ff987d4eaeee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f95d9a5e00c41cc9472367dfbca3e82/1920.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Alfred Handley leaned back in his wheelchair alongside a major Phoenix freeway as a street medicine team helped him get rehydrated with an intravenous saline solution dripping from a bag hanging on a pole.",
      "publishedAt": "2024-07-01T04:11:36Z",
      "title": "Street medicine teams search for homeless people to deliver lifesaving IV hydration in extreme heat",
      "url": "https://apnews.com/c57bbafdc936a36248be593df9036f13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41f722727b114e50be47dcbaa4d375d5/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY and PAOLA FLORES",
      "description": "LA PAZ, Bolivia (AP) — Signs reading “I'm buying dollars” line the doors of Víctor Vargas’ shoe shop in the heart of Bolivia’s biggest city, a desperate attempt to keep his family business alive.Just a few years ago, the 45-year-old Vargas would unlock the doors at 8 a.m.",
      "publishedAt": "2024-07-01T05:14:47Z",
      "title": "Economic turmoil in Bolivia fuels distrust in government and its claim of a 'failed coup'",
      "url": "https://apnews.com/cdb4672eb26c68d130df924fa2913403",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f884ed87c8240399a3cc18ce500c344/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "HARTLEPOOL, England (AP) — A lot of politicians have promised change to voters in Hartlepool, a wind-whipped port town in northeast England. For decades, Labour Party representatives said they would fight for working people, even as well-paid industrial jobs disappeared.",
      "publishedAt": "2024-07-01T04:13:55Z",
      "title": "In a proud and troubled UK town, voters wonder whether their election choice will make a difference",
      "url": "https://apnews.com/a2e217caa7c14b39908f88b7ff1f545a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34b8661460324364841ab9fa3fba3396/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The U.S. Justice Department is pushing Boeing to plead guilty to criminal fraud in connection with two deadly plane crashes involving its 737 Max jetliners, according to several people who heard federal prosecutors detail a proposed offer Sunday.",
      "publishedAt": "2024-06-30T20:11:33Z",
      "title": "US wants Boeing to plead guilty to fraud over fatal crashes, lawyers say",
      "url": "https://apnews.com/861175435e04039112fde0ac6bdbf75a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03574d85a7c74bd8866533bb7954709e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}