{
  "articles": [
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — More than a dozen Israeli soldiers were killed in combat in the Gaza Strip over the weekend, the Israeli military said Sunday, in some of the bloodiest days of battle since the start of Israel’s ground offensive in late October and a sign that Hamas is still putting up a fight despite weeks of brutal war.",
      "publishedAt": "2023-12-24T08:00:21Z",
      "title": "A weekend of combat in Gaza kills more than a dozen Israeli soldiers, a sign of Hamas' entrenchment",
      "url": "https://apnews.com/9451d609ecdf85d14795caa628e2a127",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fe419040e1c45bdb57cb364ccfb08ad/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Fadi Sckak has already lost his father to the violence in Gaza. He wants to help his mother escape that fate.",
      "publishedAt": "2023-12-23T17:13:46Z",
      "title": "Americans beg for help getting family out of Gaza. \"I just want to see my mother again,' a son says",
      "url": "https://apnews.com/3d1dda48bed40c8b3e0dc2efa11caf9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01bb498482574a5fa0f9420fc2db2105/2735.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "FORT MORGAN, Colo. (AP) — Magdalena Simon's only consolation after immigration officers handcuffed and led her husband away was the contents of his wallet, a few bills.The hopes that had pushed her to trudge thousands of miles from Guatemala in 2019, her son’s small frame clutched to her chest, ceded to despair and loneliness in Fort Morgan, a ranching outpost on Colorado’s eastern plains, where some locals stared at her too long and the wind howls so fiercely it once blew the doors half off a hotel.",
      "publishedAt": "2023-12-24T05:05:11Z",
      "title": "New migrants face fear and loneliness. A town on the Great Plains has a storied support network",
      "url": "https://apnews.com/c452a587f92c5f1b9dc9a6decc6cf8fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cad27d69a6b408f9f15350c496ae5d8/1920.jpeg"
    },
    {
      "author": "FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — Atop many Christmas wish lists in economically troubled Zimbabwe is a travel document, and people are flooding the passport office this holiday season ahead of a price hike planned in the New Year.",
      "publishedAt": "2023-12-24T08:03:40Z",
      "title": "A Christmas rush to get passports to leave Zimbabwe is fed by economic gloom and a price hike",
      "url": "https://apnews.com/f134866e557272996b58d2b9552947f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43bd2aa7e7174858814ed0df597d7de5/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER",
      "description": "RENO, Nev. (AP) — The room was packed with Native American leaders from across the United States, all invited to Washington to hear from federal officials about President Joe Biden's accomplishments and new policy directives aimed at improving relationships and protecting sacred sites.",
      "publishedAt": "2023-12-24T05:01:58Z",
      "title": "Nevada tribe says coalitions, not lawsuits, will protect sacred sites as US advances energy agenda",
      "url": "https://apnews.com/f08e1c42e81982fea32b0baaa9b46106",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f8e22c0f70e4af6a2ea3560f1924fba/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR",
      "description": "SPRINGFIELD, Ill. (AP) — It was the dog, stuck atop skyscraping grain silos on Springfield's northeast side in 2019, that forced Chris Richmond's hand.The stray had found its way to the top of the behemoth Pillsbury Mills, for decades a flour-churning engine of the central Illinois city's economy but now vacant more than 20 years.",
      "publishedAt": "2023-12-24T05:17:32Z",
      "title": "Decaying Pillsbury mill in Illinois that once churned flour into opportunity is now getting new life",
      "url": "https://apnews.com/4163e35e84c507adfcee97cd44a41431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27975f980a5c419fa4b7e95e12fa6779/3000.jpeg"
    },
    {
      "author": null,
      "description": "OCALA, Fla. (AP) — A man died in a shooting at a shopping mall in central Florida two days before Christmas in which the victim was “targeted” for the attack, police said. Ocala Police Chief Mike Balken told reporters Saturday evening that the man was killed after he was shot multiple times in a common area at Paddock Mall in Ocala, located about 79 miles (127 kilometers) northwest of Orlando.",
      "publishedAt": "2023-12-23T21:49:01Z",
      "title": "Man killed and a woman injured in a 'targeted' afternoon shooting at a Florida shopping mall",
      "url": "https://apnews.com/990961110c48b7eddbbb76ea199c60df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76d0198e1d5e4af78e11e5d86dd4ebb7/2000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "BETHLEHEM, West Bank (AP) — The normally bustling biblical birthplace of Jesus resembled a ghost town on Sunday, as Christmas Eve celebrations in Bethlehem were called off due to the Israel-Hamas war.",
      "publishedAt": "2023-12-24T09:34:45Z",
      "title": "On Christmas Eve, Bethlehem resembles a ghost town. Celebrations are halted due to Israel-Hamas war.",
      "url": "https://apnews.com/e408a3e48d18c69a7a0b018505cdc732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15919445865f4747bec388768f0c1dbb/3000.jpeg"
    },
    {
      "author": "IRENE YAGÜE",
      "description": "MADRID (AP) — Spain’s Royal Tapestry Factory has been decorating the walls and floors of palaces and institutions for more than 300 years.Located on a quiet, leafy street in central Madrid, its artisans work with painstaking focus on tapestries, carpets and heraldic banners, combining the long wisdom of the craft with new techniques.",
      "publishedAt": "2023-12-24T05:40:34Z",
      "title": "AP PHOTOS: Spanish tapestry factory, once home to Goya, is still weaving 300 years after it opened",
      "url": "https://apnews.com/854af2814303a11e4723b34e870a75d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8999fdb82113420b9a518590f88627b8/3000.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "INGLEWOOD, Calif. (AP) — Josh Allen continues to reach milestones in his sixth NFL season, but he's more concerned about getting the Buffalo Bills back into the playoffs.Allen did his part Saturday night by rushing for two TDs and throwing for one, but it took a 29-yard field goal by Tyler Bass with 28 seconds remaining for the Bills to escape with a 24-22 victory over the Los Angeles Chargers.",
      "publishedAt": "2023-12-24T04:13:00Z",
      "title": "Josh Allen accounts for 3 touchdowns as Bills escape with 24-22 victory over Chargers",
      "url": "https://apnews.com/75375390b18d7468d3895301944f1027",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8319c60e64ae41b5987dd9bcc4b6942a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}