{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is set to meet with European Commission chief Ursula von der Leyen in Scotland to discuss trade. Both sides are seeking an agreement on tariff rates. Trump played golf Saturday at his course in Turnberry and plans to visit another one in Aberdeen, where his family is opening a new Trump course. The meeting Sunday with von der Leyen is expected to be private. Trump mentioned a 50-50 chance of reaching a deal with the EU. The U.S. had threatened a 30% tariff rate on the EU and Trump has set a deadline for Friday. Without a deal, the EU could retaliate with tariffs on American products.",
      "publishedAt": "2025-07-27T04:02:25Z",
      "title": "President Trump to meet EU chief as tariff deadline nears",
      "url": "https://apnews.com/article/trump-scotland-tariffs-europe-8d2fb467d64f7fdfc4797dbebd54e8fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/471d607/2147483647/strip/true/crop/1237x696+0+65/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F59%2F073d29c6cec1078cb5fa0c10ec3c%2F52c9364633d54806838bc6f78375a71d"
    },
    {
      "author": null,
      "description": "The Israeli military has begun a “tactical pause” in fighting in three areas of Gaza to address a worsening humanitarian situation. Starting Sunday, the military will halt activity in Muwasi, Deir al-Balah, and Gaza City from 10 a.m. to 8 p.m. local time daily. Secure routes will also be designated to help aid agencies deliver food and supplies. This decision follows months of warnings about famine due to Israeli aid restrictions. On Saturday, the military said it would resume airdrops into Gaza. These humanitarian steps will occur alongside ongoing military operations against Hamas. Meanwhile, health officials in Gaza said at least 16 people were killed in overnight Israeli strikes.",
      "publishedAt": "2025-07-27T05:06:40Z",
      "title": "Israeli military to pause fighting in 3 Gaza areas to address surging hunger",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-pause-hunger-9752f9dbdbb1b85aac515ffe3e859216",
      "urlToImage": "https://dims.apnews.com/dims4/default/38eae23/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F98%2F0fd352267702ff9e8bf39af68308%2F5c1e2c8211de47518155f24e587f04a3"
    },
    {
      "author": null,
      "description": "The Israeli military has intercepted a Gaza-bound aid ship, detaining 21 international activists and journalists and seizing all cargo, including baby formula, food, and medicine, according to the Freedom Flotilla Coalition. The coalition says the military \"violently intercepted\" the ship in international waters about 40 nautical miles from Gaza just before midnight Saturday. The Israeli military had no immediate comment, but Israel's Foreign Ministry posted that the Navy stopped the vessel and was bringing it to shore. The ship's interception comes as Israel faces mounting international criticism over the worsening humanitarian situation in Gaza. The ship is the second to be stopped en route to Gaza by the Israeli military in recent months.",
      "publishedAt": "2025-07-27T08:11:52Z",
      "title": "Israel again intercepts Gaza-bound ship carrying activists and humanitarian aid",
      "url": "https://apnews.com/article/gaza-blockade-activist-ship-seized-24c32eafd80d08a63e5bed8b83d5972f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f7e28a8/2147483647/strip/true/crop/7546x4245+0+503/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F50%2F9bfe927e2c56cabc254c91a07613%2Fe17e134127b24ce7a6a407a6f7f0f1ca"
    },
    {
      "author": null,
      "description": "Donald Trump once decried the idea of taking vacations as president. During his presidential campaign in 2015, he pledged to “rarely leave the White House.” And now he's in Scotland on a trip built around golf. Trump's schedule has him staying at his properties near Turnberry and Aberdeen, where his family owns two golf courses and is opening a third next months. The White House calls it a working trip where the Republican president might hold a news conference and sit for media interviews. Trump is also talking trade in separate meetings with European Commission chief Ursula von der Leyen and British Prime Minister Keir Starmer.",
      "publishedAt": "2025-07-27T12:05:44Z",
      "title": "Trump once decried the idea of presidential vacations",
      "url": "https://apnews.com/article/trump-scotland-golf-presidential-vacations-43364ff17b7ae49602909644be9fd260",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f712c1/2147483647/strip/true/crop/1644x925+0+86/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Faf%2F49a4b9176fbfd3f4040eb94d1d8d%2F3765800028e247edb9fc99a34beacc40"
    },
    {
      "author": null,
      "description": "Thailand and Cambodia have signaled their readiness to negotiate a ceasefire after mediation by U.S. President Donald Trump. The fighting, which began Thursday, has killed at least 34 people and displaced over 168,000. Trump said on Truth Social that he called the leaders of both countries and warned them over trade agreements if hostilities continued. Cambodian Prime Minister Hun Manet said Sunday he agreed to pursue an immediate ceasefire and tasked his deputy to work with the U.S. to engage Thailand on next steps. Thailand expressed cautious support but called for “sincere intention” from Cambodia. Despite the diplomatic efforts, fighting continued Sunday with both sides blaming each other.",
      "publishedAt": "2025-07-27T04:28:21Z",
      "title": "Thailand and Cambodia agree to ceasefire talks after Trump steps in",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-ceasefire-ae1ca49539793aeaf0ce71d4d1cf42a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6a37e4/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F95%2F5782cf73ace0336cda103f646c49%2F8dbc9ca7903d4125b34e8b1a90883fc9"
    },
    {
      "author": null,
      "description": "Michigan authorities say 11 people have been stabbed at a Walmart in Traverse City. Authorities say a suspect is in custody and that investigators believe those hurt Saturday were not specifically targeted. The Grand Traverse County Sheriff's Office says that around 4:45 p.m., a 42-year-old man entered the store and used a folding knife to stab 11 people. The sheriff's office says a deputy arrived within minutes and took the man into custody. It also says that people in the store helped apprehend the suspect and treat victims. Munson Healthcare said six of the victims were in critical condition and five in serious condition.",
      "publishedAt": "2025-07-27T12:09:04Z",
      "title": "A man accused of stabbing 11 people at a Walmart is in Michigan authorities' custody",
      "url": "https://apnews.com/article/walmart-stabbing-michigan-341fb14f1bc715243b3780a3d7eabda0",
      "urlToImage": "https://dims.apnews.com/dims4/default/91d2d9c/2147483647/strip/true/crop/6681x3758+0+348/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F31%2F5097567d01dc15766bae541376a1%2F356cab7c940a42539bc931d4b61f16fe"
    },
    {
      "author": null,
      "description": "Islamic State-backed rebels have attacked a Catholic church in eastern Congo, killing at least 34 people. A civil society leader reported the death toll, while local media suggests it could be over 40. The attack took place in Komanda town, where the rebels also burned houses and shops. The military confirmed 10 fatalities. The attackers, believed to be from the Allied Democratic Force, fled before security forces arrived. Eastern Congo has faced numerous deadly attacks by armed groups, including the ADF, which has ties to the Islamic State and often targets civilians.",
      "publishedAt": "2025-07-27T09:20:52Z",
      "title": "21 killed in attack on east Congo church by Islamic State-backed rebels, civil leader says",
      "url": "https://apnews.com/article/congo-church-attack-islamic-state-deaths-da83ab694e991abfcc8166245a836d86",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba6c3cf/2147483647/strip/true/crop/1645x925+0+137/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb6%2Fd2d087b8fe1a98ed207ce1cafcfb%2Faee8c03c20ea47f0824dfe5a1a43460f"
    },
    {
      "author": null,
      "description": "The new Associated Press-NORC Center for Public Affairs Research polling tracker shows that overall views of President Donald Trump’s job performance have been steady over the past few months. So has his approval rating on most issues, except for a slight decrease in support for his handling of immigration. The tracker also shows that Trump’s favorability rating has remained largely steady since the end of his first term. Between 33% and 43% of U.S. adults say they viewed him favorably across a nearly six-year period. Those long-term trends underscore that Trump has many steadfast opponents.",
      "publishedAt": "2025-07-27T11:53:30Z",
      "title": "Why Trump's approval rating is so steady: AP-NORC polling",
      "url": "https://apnews.com/article/trump-approval-polling-favorability-presidential-approval-poll-f7eee34a49d2db7670577f4491e1caf0",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf61498/2147483647/strip/true/crop/5471x3077+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fdb%2F57b1ccd89102d960d3d2b918c62c%2F667dd4cf05b044b3bc566b86fed051be"
    },
    {
      "author": null,
      "description": "Russia has scaled down the festivities honoring its navy citing security concerns as continuing Ukrainian drone attacks posed a challenge the Kremlin. Russian authorities canceled Sunday's parades of warships in St. Petersburg and in the fareastern port of Vladivostok that are usually held to mark the annual Navy Day celebrations. Asked about the reason for the cancellation of the parade in St. Petersburg even as President Vladimir Putin arrived in his home city to visit the navy headquarters, Kremlin spokesman Dmitry Peskov said it was done for \"security reasons, which are above all.” The Russian Defense Ministry said that air defenses downed 99 Ukrainian drones over several regions overnight. Officials later reported more drones shot down near St. Petersburg.",
      "publishedAt": "2025-07-27T11:28:25Z",
      "title": "Russia Navy Day celebrations scaled down as Ukraine launches drone attacks",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-navy-b895fd179433ce1f555795e86891fc32",
      "urlToImage": "https://dims.apnews.com/dims4/default/03584e9/2147483647/strip/true/crop/6743x3793+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fff%2Ff8bc9bea16a2eec5e16e5498ee5e%2F600fb1fd028c4088941c427997a459a2"
    },
    {
      "author": null,
      "description": "Slovenian rider Tadej Pogačar has effectively sealed his fourth Tour de France title after organizers decided to neutralize the times with 50 kilometers (31 miles) left because of the threat of rain and crashes. Freezing the times for the 21st and final stage into Paris all-but-ensured victory for Pogačar, but he still had to cross the finish line later in order to win. The decision was made in the late afternoon and, shortly after Pogačar reached 50 kilometers to go, heavy rain began falling and drenched the roads. Pogačar is the defending champion and also won in 2020 and ’21.",
      "publishedAt": "2025-07-27T17:08:22Z",
      "title": "Pogacar effectively seals 4th Tour de France title after times frozen",
      "url": "https://apnews.com/article/tour-de-france-winner-pogacar-paris-f927272f1751464a08cd022747151a63",
      "urlToImage": "https://dims.apnews.com/dims4/default/29711fa/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F5f%2F69ccb64129c2c1bfffdfafb10427%2Fe39d64f85b854ebfb89c5891e6f729b3"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}