{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump says the United States will get magnets and rare earth minerals from China under a new trade deal and tariffs on Chinese goods will go to 55%. Trump said Wednesday in return the U.S. will allow Chinese students to attend American colleges and universities. An international rights group says several global brands are among dozens of companies at risk of using forced labor through their Chinese supply chains. The report by Global Rights Compliance was released Wednesday. It says the companies might be linked because they use critical minerals or buy minerals-based products sourced from China’s far-western Xinjiang region. China's Foreign Ministry rejects the forced labor claims as lies.",
      "publishedAt": "2025-06-11T01:52:43Z",
      "title": "Trump says US gets minerals from China in trade deal and tariffs go to 55%",
      "url": "https://apnews.com/article/china-xinjiang-critical-minerals-forced-labor-uyghur-eac368889c299fd304a3b7beefc7469a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5303080/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F0d%2F01a7ed45420453325bb70f1271d5%2Fffabafb4784e439489eb2e074da2f9aa"
    },
    {
      "author": null,
      "description": "Los Angeles police have swiftly enforced a downtown curfew, making arrests moments after it took effect, deploying officers on horseback and using crowd control projectiles to break up a group of hundreds demonstrating against President Donald Trump’s immigration crackdown. Hours later after the curfew went into effect Tuesday night, many of the protesters had dispersed, although small sporadic confrontations continued. Democratic Gov. Gavin Newsom earlier accused Trump of drawing a “military dragnet” across the nation’s second-largest city with his escalating use of the National Guard. He also deployed Marines, though none were seen on the streets Tuesday. Trump ordered the deployment of nearly 5,000 troops, including National Guard and Marines, to LA.",
      "publishedAt": "2025-06-11T05:24:58Z",
      "title": "Los Angeles imposes curfew as protests continue against Trump’s immigration crackdown",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-f39ba39287f628ce8c8be47c92ea6147",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff18fbb/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F47%2F62853facaf44d4f78c7589340768%2F0053e7fa458a4fe2a3545c7cb6d8dd34"
    },
    {
      "author": null,
      "description": "The Gaza Health Ministry says that the Palestinian death toll from the 20-month Israel-Hamas war has climbed past 55,000. The ministry doesn't distinguish between civilians and combatants but has said that women and children make up more than half the dead. The ministry gave the updated figures on Wednesday. It’s a grim milestone in the war that began with Hamas’ attack on Oct. 7, 2023 into southern Israel. The war shows no sign of ending. Israel says it only targets militants and blames civilian deaths on Hamas. Israel accuses the militants of hiding among civilians because they operate in populated areas.",
      "publishedAt": "2025-06-11T12:26:21Z",
      "title": "Gaza health officials say more than 55,000 Palestinians have been killed in Israel-Hamas war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-11-2025-5c84e29a249b988e1172cfcf4528cdc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/3181234/2147483647/strip/true/crop/7677x4318+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F7d%2F879b430004220f5e8c266d620283%2F8ee47196adcb4728b36a019a029146c4"
    },
    {
      "author": null,
      "description": "Jury deliberations in Harvey Weinstein’s sex crimes retrial are on tenterhooks after the foreperson again requested to speak to the judge about “a situation” he found troubling. The man was questioned Wednesday in private, at his request. He had complained Monday that other jurors were pushing people to change their minds and talking about information beyond the charges. The jury is in its fifth day of deliberations. Weinstein has pleaded not guilty to rape and sexual assault charges.",
      "publishedAt": "2025-06-11T03:59:59Z",
      "title": "More jury drama at Harvey Weinstein's sex crimes retrial",
      "url": "https://apnews.com/article/harvey-weinstein-sexual-assault-trial-31d7a64b75148d1e482f3c020ffea527",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ade6c6/2147483647/strip/true/crop/1251x704+0+65/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F78%2F2248db5a572538d40bf7fc873617%2Fe3026f3652ad4650afba9245fe796283"
    },
    {
      "author": null,
      "description": "Brian Wilson of the Beach Boys has died at 82. One of the world’s most beloved and influential musicians, his family posted news of his death to his website Wednesday. The Beach Boys’ many hits include “Good Vibrations,” “California Girls” and “Surfin’ USA.” The eldest and last surviving of three musical brothers, he and his fellow Beach Boys rose from local California act to national hitmakers to international ambassadors of the American dream. Wilson himself was celebrated for his beautiful music and agonizing perfectionism and pitied for the demons that plagued him.",
      "publishedAt": "2025-06-11T16:57:12Z",
      "title": "Brian Wilson of the Beach Boys dies at 82",
      "url": "https://apnews.com/article/brian-wilson-dies-beach-boys-2272762e46c46820a7af09ffc73cb9a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/b616d5f/2147483647/strip/true/crop/4603x2589+0+419/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F46%2F5b9abed44adfc00c49c92f957da8%2F3cb441855b034c2893d37d49517e3184"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth is defending his decision to order National Guard troops to provide security during immigrations raids in Los Angeles. He is telling senators it’s about “maintaining law and order.” Hegseth was speaking Wednesday at a Senate defense appropriations subcommittee hearing, Democratic Sen. Jack Reed condemned the move as illegal. The exchange underscored confusion about the use of more than 4,000 National Guard troops and 700 Marines to provide security at the immigration protests in Los Angeles. Photographs show Guard troops setting a security perimeter around agents as they made arrests in the city",
      "publishedAt": "2025-06-11T17:20:25Z",
      "title": "Hegseth defends use of troops in Los Angeles",
      "url": "https://apnews.com/article/hegseth-pentagon-spending-ukraine-7a5c39c4d6ceaddc33b80af24e3797a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/6261267/2147483647/strip/true/crop/6057x3407+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F11%2F8998aaaf6f6e4e7ec2d83fcb832f%2Fbc55d1d1e69643d29b49b1840de84978"
    },
    {
      "author": null,
      "description": "Officials say at least 49 people have died in flooding in South Africa’s Eastern Cape province. An extreme cold front brought heavy rain and snow to parts of the country. Eastern Cape Premier Oscar Mabuyane said Wednesday that police provided the death toll. The dead included six students who were washed away when their school bus was caught in floodwaters near a river on Tuesday. Mabuyane says four other students are missing.",
      "publishedAt": "2025-06-11T14:43:46Z",
      "title": "At least 49 people have died in flooding in South Africa, officials say",
      "url": "https://apnews.com/article/south-africa-flooding-eastern-cape-cb2533d81b14cb214b9eb996873b94b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/3980b7f/2147483647/strip/true/crop/3000x1688+0+135/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F03%2F78213cbd2c5c3dc505c02a77816d%2F5c7875631ab045228bc360822bcf01c7"
    },
    {
      "author": null,
      "description": "Russian forces have launched a large-scale drone assault across Ukraine. Ukrainian officials said that the attacks overnight Wednesday killed three people and wounded 64 others. The strikes caused widespread destruction in the northeastern city of Kharkiv. Apartment buildings, private homes, playgrounds, industrial sites and public transportation were hit. Moscow’s forces have deployed high numbers of drones and missiles in recent days. They include a record bombardment of almost 500 drones on Monday and a wave of 315 drones and seven missiles overnight on Tuesday.",
      "publishedAt": "2025-06-11T06:07:42Z",
      "title": "Russian attacks kill 3 as drones hit Kharkiv and other parts of Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-kharkiv-7b2760f6b46f5037509fefd6264345aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/faf93d6/2147483647/strip/true/crop/2000x1125+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F8c%2Fd8fc89fc3c4d699494350c2bd454%2F74b9c0113496474087c6a33e3deadee0"
    },
    {
      "author": null,
      "description": "Two crypto investors have pleaded not guilty to charges they kidnapped and tortured an Italian man for his Bitcoin in a Manhattan townhouse. William Duplessie and John Woeltz were ordered held until their next court date on July 15. They were arraigned in Manhattan criminal court Wednesday. Their lawyers had sought their release on $1 million bail. They argued the victim wasn't in distress while in New York and that they had video and photo evidence to prove it. But prosecutors say the two held the accuser captive for 17 days, torturing him until he finally relented and gave them his computer password.",
      "publishedAt": "2025-06-11T16:04:15Z",
      "title": "2 men plead not guilty in New York crypto kidnapping and torture case",
      "url": "https://apnews.com/article/manhattan-crypto-kidnapping-torture-bitcoin-suspect-indicted-7e76c69217ba9f56973dbfaa33a01af2",
      "urlToImage": "https://dims.apnews.com/dims4/default/405316a/2147483647/strip/true/crop/4800x2700+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F98%2Fb9285b39821737a7035be1e47eba%2F6a2e2865596d420f853070352aa480e8"
    },
    {
      "author": null,
      "description": "Global shares are mostly trading higher after China and the U.S. said they have a framework for following up on the trade truce reached last month in Geneva. Shares in France, Germany and Britain rose early Wednesday trading. Earlier in the global day, benchmarks finished higher in Japan, South Korea, Australia and China. U.S. futures fell while oil prices edged higher. U.S. Secretary of Commerce Howard Lutnick said Tuesday that talks with China were going “really, really well.” Both the United States and China have put many of their tariffs on each other’s exports on pause as talks continue.",
      "publishedAt": "2025-06-11T04:28:45Z",
      "title": "Global shares climb as China-US trade talks end on a positive note",
      "url": "https://apnews.com/article/stock-markets-china-trump-tariffs-74076b65c39f8f7ddc145a7b63d314f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe4906d/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2Fe0%2Fc04735f50f899a3cf7c06723b0ae%2F6a276dd0d04f401eac862a35f10c6d87"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}