{
  "articles": [
    {
      "author": "R.J. RICO",
      "description": "ATLANTA (AP) — A lighting technician is mowing lawns. A camera assistant is teaching guitar again. An actor has thought about shifting careers.For more than a decade, work had been nonstop in Atlanta’s booming film industry thanks to Georgia’s extremely generous tax break.",
      "publishedAt": "2023-10-27T12:48:52Z",
      "title": "As the 'Hollywood of the South,' Atlanta has boomed. Its actors and crew are now at a crossroads",
      "url": "https://apnews.com/5bb54af9322b0a66b3dfb728c23278f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/065e5c717e2f4edc86dce64d3b0154ce/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Nearly three dozen trucks entered Gaza on Sunday in the largest aid convoy since the war between Israel and Hamas began, but humanitarian workers said the assistance still fell desperately short of needs after thousands of people broke into warehouses to take flour and basic hygiene products.",
      "publishedAt": "2023-10-29T06:19:43Z",
      "title": "Gaza receives largest aid shipment so far as deaths top 8,000 and Israel widens military offensive",
      "url": "https://apnews.com/de1a7d660ba2f6d80b3d7aeaae5bb0f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0f3062ef68f4ef594ecd9bebea2871a/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Two days after cellular and internet service abruptly vanished for most of Gaza amid a heavy Israeli bombardment, the crowded enclave came back online Sunday as communications systems were gradually restored.",
      "publishedAt": "2023-10-28T20:41:47Z",
      "title": "Internet, phone service gradually return after vanishing for most of Gaza amid heavy bombardment",
      "url": "https://apnews.com/abd024625526f6d808c1583afd58e2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afdc65367ba44931afc82f8b2bc89a88/2559.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Thousands of supporters from Pakistan's main religious political party rallied in the capital, Islamabad, on Sunday against Israel's bombing of Palestinians in Gaza, chanting anti-American slogans and accusing the U.S.",
      "publishedAt": "2023-10-29T14:01:33Z",
      "title": "Thousands rally in Pakistan against Israel's bombing in Gaza, chanting anti-American slogans",
      "url": "https://apnews.com/ff7b5feeb58b8bb6c438bcf6a906a7d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52955a24084f40a3b151a246d3dd4da4/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT F. BUKATY and JAKE BLEIBERG",
      "description": "LEWISTON, Maine (AP) — Church bells rang Sunday as Maine residents gathered at somber and sometimes joyful services to pray and support one another following a traumatic week in which a fellow Mainer gunned down 18 people in the worst mass killing in state history.",
      "publishedAt": "2023-10-29T12:10:28Z",
      "title": "Residents of Maine gather to pray and reflect, days after a mass shooting left 18 people dead",
      "url": "https://apnews.com/d08e0c1a102e2b68d02c947ae5b0e9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9ac3abb45b498a97099b95a6d115ea/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — At least 43 people died when Category 5 Hurricane Otis slammed into Mexico’s southern Pacific coast, the governor of hard-hit Guerrero said Sunday as the death toll continued to climb.",
      "publishedAt": "2023-10-29T04:25:41Z",
      "title": "Hurricane Otis death toll rises to 43, missing now number 36 as search and recovery work continues",
      "url": "https://apnews.com/50eb6a8fe677455428cbacfd3966e72c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/656aa74929d7467db04319f5e8dddc2d/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — “Friends” star Matthew Perry, the Emmy-nominated actor whose sarcastic, but lovable Chandler Bing was among television’s most famous and most quotable characters, has died at 54.",
      "publishedAt": "2023-10-29T01:21:21Z",
      "title": "Matthew Perry, Emmy-nominated 'Friends' star, dead at 54",
      "url": "https://apnews.com/f2963e83691d2bd2a8626d85a69c73cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa58ad1c0824d2688892b249dfe6fec/1920.jpeg"
    },
    {
      "author": "MELINA WALLING and BRITTANY PETERSON",
      "description": "Hudson, CO. (AP) — Alan Mazzotti can see the Rocky Mountains about 30 miles west of his pumpkin patch in northeast Colorado on a clear day. He could tell the snow was abundant last winter, and verified it up close when he floated through fresh powder alongside his wife and three sons at the popular Winter Park Resort.",
      "publishedAt": "2023-10-29T12:30:55Z",
      "title": "How extreme weather in the US may have affected the pumpkins you picked this year for Halloween",
      "url": "https://apnews.com/81905cc284aacf30744b2cb5dbe0a141",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47434b5d003f40a4a7ab99f2b1f63c7f/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON and CHRIS O'MEARA",
      "description": "TAMPA, Fla. (AP) — A fight between two groups turned deadly in Florida when a shooting in a Tampa street during Halloween festivities resulted in two deaths and 18 people hospitalized early Sunday morning, police said.",
      "publishedAt": "2023-10-29T11:19:49Z",
      "title": "Shooting kills 2 and injures 18 victims in Florida street with hundreds of people nearby",
      "url": "https://apnews.com/6791b6cf9c4165b9f287b6126732f257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80cd0090fefb446193458bb2d039cbf5/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Oklahoma dropped four spots to No. 10, the top five teams held their places and Kansas and Kansas State both entered The Associated Press college football poll on Sunday.",
      "publishedAt": "2023-10-29T18:02:23Z",
      "title": "AP Top 25: Oklahoma slips to No. 10; Kansas, K-State enter poll; No. 1 UGA and top 5 hold steady",
      "url": "https://apnews.com/1a6354be1c72dbf1d9d9f1525fb8b105",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c6d5e4005424e64bc9f059bcf2b01c5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}