{
  "articles": [
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Internal drama. Leaks. Second-guessing. The pressure and chaos swirling since Joe Biden's disastrous debate performance is causing cracks in a White House that until now had been marked by discipline and loyalty.",
      "publishedAt": "2024-07-09T23:00:39Z",
      "title": "Chaos swirling since Biden's debate flub is causing cracks in a White House known for discipline",
      "url": "https://apnews.com/e908d7e27c3baa6cfbbba1d391deec7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a24881ef11914e419211baf559bd581d/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and MICHELLE L. PRICE",
      "description": "MIAMI (AP) — Former President Donald Trump on Tuesday reveled in the mounting turmoil surrounding President Joe Biden ’s campaign in the wake of their debate and teased the expected announcement of his Republican running mate with one of the top contenders, Florida Sen.",
      "publishedAt": "2024-07-09T04:12:44Z",
      "title": "Trump revels in Democratic turmoil as he returns to campaign trail and teases VP pick",
      "url": "https://apnews.com/6893fb5c5aac589ad83f151e49729bb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45ae7940efe24700b3bc394aaf08d731/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE, ELLEN KNICKMEYER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy said Tuesday that decisive action must be taken before the U.S. presidential election in November to repel Russia's offensive against his country, using an address on the sidelines of the NATO summit to press for greater support during a pivotal but tumultuous stretch in America's political calendar.",
      "publishedAt": "2024-07-09T18:06:37Z",
      "title": "Zelenskyy says the world cannot wait until the US election in November to take action to repel Putin",
      "url": "https://apnews.com/7f6a042e323af10e0425239ea5a023c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d495daa6cd6142dcad1ac88c7329a16c/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike on a school-turned-shelter in southern Gaza killed at least 25 Palestinians on Tuesday, as heavy bombardment in the north forced the closure of medical facilities in Gaza City and sent thousands fleeing in search of increasingly elusive refuge.",
      "publishedAt": "2024-07-09T13:17:41Z",
      "title": "Airstrike kills 25 in southern Gaza as Israeli assault on Gaza City shuts down medical facilities",
      "url": "https://apnews.com/5c8eb2a36e22fb0ea7666b73e5c0b54c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0826f6f00b430f97be168369d9b108/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and MARK VANCLEAVE",
      "description": "HOUSTON (AP) — The return of searing heat in the Houston area has deepened the misery for people still without power after Hurricane Beryl crashed into Texas and left residents in search of places to cool off and fuel up as the extended outages strained one of the nation’s largest cities.",
      "publishedAt": "2024-07-10T04:17:24Z",
      "title": "Houston residents left sweltering after Beryl with over 1.7 million still lacking power",
      "url": "https://apnews.com/ceb5fdc1db4d89d2376abb22bfd45d99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de4450792004f39922ede47733be81f/1920.jpeg"
    },
    {
      "author": "KEN RITTER and CHRISTOPHER WEBER",
      "description": "LAS VEGAS (AP) — Used to shrugging off the heat, Las Vegas residents are now eyeing the thermometer as the desert city is on track Wednesday to set a record for the most consecutive days over 115 degrees Fahrenheit (46.1 Celsius) amid a lingering hot spell that will continue scorching much of the U.S.",
      "publishedAt": "2024-07-10T05:05:48Z",
      "title": "Las Vegas eyes record of 5th consecutive day over 115 degrees as heat wave continues to scorch US",
      "url": "https://apnews.com/ed2009f3f4ad15b4ca96dc1aa0f5e1e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a48851674e1495d8e85c7b554675b5c/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Sixteen jurors were seated Tuesday for Alec Baldwin’s involuntary manslaughter trial in New Mexico, where opening statements are set to start Wednesday.",
      "publishedAt": "2024-07-09T04:12:53Z",
      "title": "Jury is seated in Alec Baldwin's involuntary manslaughter trial in New Mexico",
      "url": "https://apnews.com/a6731e3226df0990f0469845df3ccde8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d1407592f942459568bf66f376f621/1920.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — A double-decker passenger bus collided with a milk truck in northern India on Wednesday, killing at least 18 people and injuring many others, officials said. The collision occurred on an expressway in Uttar Pradesh state, and 19 injured people were rushed to the hospital by villagers in the area, said police officer Arvind Kumar, adding that their condition was reported to be stable.",
      "publishedAt": "2024-07-10T04:10:51Z",
      "title": "A double-decker bus collides with a milk truck in northern India, killing at least 18 people",
      "url": "https://apnews.com/1ca3df2ed578e9d51988f12b82f0794a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c9cf33b52940269dfdc1fe1fc3d976/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI",
      "description": "NAIROBI, Kenya (AP) — The ballooning debt in East Africa's economic hub of Kenya is expected to grow even more after deadly protests forced the rejection of a finance bill that President William Ruto said was needed to raise revenue.",
      "publishedAt": "2024-07-10T04:13:51Z",
      "title": "Kenya's president warns of huge consequences after his effort to address an $80 billion debt fails",
      "url": "https://apnews.com/d1e083b61352fc2c168e71dc257cbb33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e11fc1b6f9b49d8b371a260b9af28c4/3000.jpeg"
    },
    {
      "author": "TIAN MACLEOD JI",
      "description": "WENZHOU, China (AP) — At a factory in Zhejiang province on China’s eastern coast, two mounds of discarded cotton clothing and bed linens, loosely separated into dark and light colors, pile up on a workroom floor.",
      "publishedAt": "2024-07-10T04:03:56Z",
      "title": "China's landfills brim with textile waste as fast fashion reigns and recycling takes a back seat",
      "url": "https://apnews.com/f0c54f50588c9a4f00073cd5e0e4d086",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed3b308bd6884e608dd7bd0c3f5a01b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}