{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces battled Hamas militants across Gaza on Wednesday after expanding their ground offensive to its second-largest city, further shrinking the area where Palestinians can seek safety and halting the distribution of vital aid across most of the territory.",
      "publishedAt": "2023-12-06T07:21:50Z",
      "title": "Heavy fighting in Gaza halts most aid delivery and leaves civilians with few places to seek safety",
      "url": "https://apnews.com/156afcb1626f1cb4e9e26e5430c7185c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61184714085445a288f0b9aeeedf11c7/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "NABI SALEH, West Bank (AP) — For all Palestinian parents, Marwan Tamimi said, there comes a moment they realize they're powerless to protect their children.",
      "publishedAt": "2023-12-06T05:37:02Z",
      "title": "Generation after generation, Israeli prison marks a rite of passage for Palestinian boys",
      "url": "https://apnews.com/d0f73d0a1581749894ffc0e078b4b160",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68546eaa412b411282fb23b4108307c8/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and COLLEEN LONG",
      "description": "WASHINGTON (AP) — It was a decade ago that Capitol Hill was consumed by an urgency to overhaul the nation’s immigration system, fueled in no small part by Republicans who felt a political imperative to make inroads with minority voters by embracing more generous policies.",
      "publishedAt": "2023-12-06T05:04:24Z",
      "title": "Washington's center of gravity on immigration has shifted to the right",
      "url": "https://apnews.com/7507034034ba49a8f170777600cad46e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2569bb53fe84513b12d53a3540fb517/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump declined to rule out abusing power if he returns to the White House after Fox News Channel host Sean Hannity asked him Tuesday to respond to growing Democratic criticism of his rhetoric.",
      "publishedAt": "2023-12-06T03:03:36Z",
      "title": "Trump declines to rule out abusing power to seek retribution if he returns to the White House",
      "url": "https://apnews.com/d9cad413851b60f6c0abd2a564d86338",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29d82f0d62a946ef8d0d2a9f83c952f8/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and DANA BELTAJI",
      "description": "DUBAI, United Arab Emirates (AP) — After a first-day blur of rare quick action and agreement, negotiators at a critical United Nations climate summit Wednesday finished up their first week in a more familiar place for them: the murky middle where momentum and roadblocks intertwine.",
      "publishedAt": "2023-12-06T05:18:32Z",
      "title": "After a fast start, COP28 climate talks now in murky middle of hope, roadblocks",
      "url": "https://apnews.com/98436e29d0be3a4a1ddc36181ace49b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e754fe02db14f62a3ec65f82be23413/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Russian President Vladimir Putin on Wednesday began his trip to Saudi Arabia and the United Arab Emirates as Dubai hosts the United Nations' COP28 climate talks — despite facing an arrest warrant from the International Criminal Court over the war in Ukraine.",
      "publishedAt": "2023-12-06T04:30:14Z",
      "title": "Russian President Vladimir Putin to visit Saudi Arabia and UAE, host of COP28 climate talks",
      "url": "https://apnews.com/e0366e26d7b7588a28f4b6868ecdca0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a2b9ce998614ba58a0a144d5afc3ab6/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "TALLINN, Estonia (AP) — When Vladimir Putin came to power in 2000, the outside world viewed those Russians known as “oligarchs” as men who whose vast wealth, ruthlessly amassed, made them almost shadow rulers.",
      "publishedAt": "2023-12-06T06:06:59Z",
      "title": "Under Putin, the uber-wealthy Russians known as 'oligarchs' are still rich but far less powerful",
      "url": "https://apnews.com/9b167bb98ed050c5fbfadf0b069a0b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/341535426b9345ef8afb7b32877d94b8/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Former British Prime Minister Boris Johnson defended his handling of COVID-19 on Wednesday at a public inquiry into the pandemic, saying the government “got some things wrong” but did its best.",
      "publishedAt": "2023-12-06T09:36:31Z",
      "title": "Former UK Prime Minister Boris Johnson admits to making mistakes but defends COVID record at inquiry",
      "url": "https://apnews.com/00b50f366e3928ead7213a2da5f51f84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/424145792fde4d8ea332e774d953e459/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIMA, Peru (AP) — Peru’s constitutional court ordered an immediate humanitarian release Tuesday for imprisoned former President Alberto Fujimori, 85, who was serving a 25-year sentence in connection with the death squad slayings of 25 Peruvians in the 1990s.",
      "publishedAt": "2023-12-05T21:43:06Z",
      "title": "Peruvian constitutional court orders release of former President Alberto Fujimori",
      "url": "https://apnews.com/4a9c8a0159ac9bf170a15338fa860937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4929351bd8544a719b4a1d90cc8c294f/3000.jpeg"
    },
    {
      "author": "NICHOLAS PAPHITIS",
      "description": "ATHENS, Greece (AP) — Two men play with a ball in the placid sea; a woman practices yoga where the water meets the hot sand. No one looks back — at the hellscape that starts a few beach-towel lengths away.",
      "publishedAt": "2023-12-06T05:06:48Z",
      "title": "AP PHOTOS: An earthquake, a shipwreck and a king's coronation are among Europe's views in 2023",
      "url": "https://apnews.com/a273ce0f4b4f74f13b34dc528918316f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/658a14900f12497486161570c2adba33/2204.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}