{
  "articles": [
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — The Lebanese militant group Hezbollah said Wednesday they were still searching for the body of a top commander targeted in an Israeli strike in Beirut.The Iran-backed group’s first comment after the strike targeting Fouad Shukur came hours after his death Tuesday and followed an overnight strike in Tehran that killed Hamas leader Ismail Haniyeh.",
      "publishedAt": "2024-07-31T03:09:49Z",
      "title": "Hezbollah searching for the body of commander targeted in Israeli strike in Beirut",
      "url": "https://apnews.com/30968a7acb31cd8b259de9650014b779",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0d893a82cca4eab9ed3b201c9f661f5/2500.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Hundreds of rescue workers searched through mud and debris Wednesday from multiple landslides that have killed at least 151 people in southern India, police said.The multiple landslides occurred after torrential rains triggered torrents of mud and water that swept through tea estates and villages.",
      "publishedAt": "2024-07-31T02:04:59Z",
      "title": "Rescuers search through mud and debris as deaths rise to 151 in landslides in southern India",
      "url": "https://apnews.com/b32045fc9bf86b7500333eeb3311cef7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f420b0b0e06646adbd773314d1a94763/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, GISELA SALOMON and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The Carter Center said it was unable to verify the results of Venezuela's presidential election, blaming authorities for a “complete lack of transparency” in declaring Nicolas Maduro the winner without providing any individual polling tallies.",
      "publishedAt": "2024-07-30T15:04:38Z",
      "title": "Carter Center unable to verify Venezuela election results, blasts officials for lack of transparency",
      "url": "https://apnews.com/3ec88b273cabfee8e5696ff67d24186d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccb6a6988be9435bac989bc0072fac7c/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris appears to have energized Democrats in the early days of her candidacy, with the surge in warm feelings extending across multiple groups, including some key Democratic constituencies that had been especially tepid about President Joe Biden, a new poll shows.",
      "publishedAt": "2024-07-31T04:02:02Z",
      "title": "About 8 in 10 Democrats are satisfied with Harris in stark shift after Biden drops out: AP-NORC poll",
      "url": "https://apnews.com/1feb5ed3c2e29623ce3cec3565b487cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f361775658f4c0aae0e0642a4289bc7/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is facing the delicate task of calibrating her policy pitch to American voters, a standard task for any White House hopeful but one that comes with additional challenges this year.",
      "publishedAt": "2024-07-31T04:12:04Z",
      "title": "Harris is calibrating her policy pitch for going to battle with Trump",
      "url": "https://apnews.com/f93611f3e83adf48738bfb7aefc427f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a598aecb953c47f5a223a8d6f0b831c5/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — With the end of their two-year fight against inflation in sight, Federal Reserve officials are likely Wednesday to set the stage for the first cut to their key interest rate in four years, a major shift in policy that could eventually lower borrowing costs for U.S.",
      "publishedAt": "2024-07-31T04:01:20Z",
      "title": "First interest rate cut in 4 years likely on the horizon as the Federal Reserve meets",
      "url": "https://apnews.com/04d2877f47f3913acc2f992d8ef1581b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdeffa906f4f4216bc773ab5cb28658f/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Israel on Tuesday carried out a rare strike on Beirut, which it said killed a top Hezbollah commander who was allegedly behind a weekend rocket attack that killed 12 young people in the Israeli-controlled Golan Heights.",
      "publishedAt": "2024-07-30T17:19:34Z",
      "title": "Israel carries out rare strike on Beirut that it says killed Hezbollah commander",
      "url": "https://apnews.com/52c2a1711e274859b60daf8d2db3e0e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1132830c3bb42da9958c6916b2b54e7/1920.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — In the months leading up to elections for the European Parliament, Hungarians were warned that casting a ballot against Prime Minister Viktor Orbán would be a vote for all-out war.",
      "publishedAt": "2024-07-31T04:48:32Z",
      "title": "How Hungary's Orbán uses control of the media to escape scrutiny and keep the public in the dark",
      "url": "https://apnews.com/f6315d7cc252f210c360863de403054e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19ba3cea063c42dda2765d91575aea58/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, FARNOUSH AMIRI, REBECCA SANTANA and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — The Secret Service's acting director told lawmakers Tuesday that he considered it indefensible that the roof used by the gunman in the attempted assassination of former President Donald Trump was unsecured and said it was regrettable that local law enforcement had not alerted his agency before the shooting that an armed subject had been spotted on a nearby roof.",
      "publishedAt": "2024-07-30T04:05:05Z",
      "title": "Acting Secret Service director says he's 'ashamed' after the Trump assassination attempt",
      "url": "https://apnews.com/a382e3ec081dd13e85eaa9e726cca02c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fcd329c5ad540dab9dd07d42b26ba09/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and PAT GRAHAM",
      "description": "PARIS (AP) — After days of delays and uncertainty over water quality in the Seine River, the women's and men's Olympic triathlon races will go forward Wednesday with a swim in the famed Paris waterway.",
      "publishedAt": "2024-07-31T02:08:53Z",
      "title": "Olympic triathletes will swim in Paris’ Seine River after days of concerns about water quality",
      "url": "https://apnews.com/358b29063ac00253c072290281043eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c73e2720da80423fad7e5e2cfc5bc101/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}