{
  "articles": [
    {
      "author": "Sophia Tareen",
      "description": "The Rev. Jesse L. Jackson has died. He was 84. Jackson was a protege of the Rev. Martin Luther King and became a leader of the Civil Rights Movement for decades after King was assassinated in 1968. A two-time presidential candidate, Jackson led a lifetime of political crusades, advocating for the poor and underrepresented on issues from voting rights and job opportunities to education and health care. He scored diplomatic victories with world leaders and channeled cries for Black pride and self-determination into corporate boardrooms, using his Rainbow/PUSH Coalition to pressure executives to make America a more open and equitable society.",
      "publishedAt": "2026-02-17T10:14:51Z",
      "title": "Jesse Jackson, who led the Civil Rights Movement after King's assassination, has died",
      "url": "https://apnews.com/article/jesse-jackson-dies-43abb84d2ffc76d967f9a5596ebd0be1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4513057/2147483647/strip/true/crop/3032x2020+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F83%2F93c5babbaace0ffcfe2e2d74cc72%2F4b2f1d1a34a64a48b6e7db123671e95b"
    },
    {
      "author": "Jamey Keaten, Stephanie Liechtenstein",
      "description": "The U.S. and Iran are expected to hold a second round of talks in Geneva about Iran’s nuclear program as tensions rise in the region. The session, planned for Tuesday, comes after a first round of indirect talks held in Oman earlier in the month. They are being held as the U.S. ramps up its military presence in the region amid threats by President Donald Trump to use force to push a deal. Iran also began major Revolutionary Guard naval drills near key oil shipping routes. Still, both sides are signaling they are willing to reach a deal, which Iran says must include easing U.S.-led sanctions.",
      "publishedAt": "2026-02-17T05:00:30Z",
      "title": "US and Iran to hold a second round of nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-iaea-dbed41b78ce2ddabc8a04349e72abeba",
      "urlToImage": "https://dims.apnews.com/dims4/default/73c0551/2147483647/strip/true/crop/3200x2132+0+85/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F9a%2F6f1c6cd261a46c891761bca3a91d%2F8710b09f9aa5488eab6317f99f7511da"
    },
    {
      "author": "Ken Moritsugu",
      "description": "People are celebrating the Lunar New Year with prayers, fireworks and street festivals for the Year of the Horse. On Tuesday, crowds gather at temples and events across Asia and beyond. In Hong Kong, people lined up at midnight to light incense and make wishes. In Vietnam, singers led countdown shows and fireworks light up city skies during Tet. In Moscow, two weeks of Lunar New Year events are underway with food stalls and red lanterns. In Taiwan, worshippers heard a temple bell ring 108 times and left flower offerings.",
      "publishedAt": "2026-02-17T02:19:33Z",
      "title": "Lunar New Year celebrations welcome the Year of the Horse",
      "url": "https://apnews.com/article/lunar-new-year-horse-37a6166548b209eda42e19c9fa3b61e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a65fcf4/2147483647/strip/true/crop/4185x2789+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F24%2Fadd123a0147239ffc31965f12bca%2Fe144efaea5a3477986d675906ee74378"
    },
    {
      "author": "Emma Burrows, Jamey Keaten",
      "description": "U.S.-brokered talks have taken Russian and Ukrainian delegations to Geneva although both sides are far apart on issues such as land, security and a possible ceasefire. Ukrainian President Volodymyr Zelenskyy confirmed Tuesday his team is in Switzerland. Russian state media says Moscow’s delegation has arrived too. The talks are due to run over two days. A person familiar with the talks says U.S. envoy Steve Witkoff and Jared Kushner will be taking part. The same source says military chiefs will also discuss how ceasefire monitoring could work. Zelenskyy says Russia’s latest drone and missile attacks undermine the push for peace.",
      "publishedAt": "2026-02-17T09:32:47Z",
      "title": "Russian and Ukrainian officials are in Geneva for US-brokered talks after almost 4 years of war",
      "url": "https://apnews.com/article/russia-ukraine-war-geneva-talks-a2308f6af1d7817f8886013b921409eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3ca0a8/2147483647/strip/true/crop/2000x1333+0+84/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F14%2Fe40fe081a29cb09bda3deffb55df%2F62181c1fbfea4177a72e1212728af637"
    },
    {
      "author": null,
      "description": "Police are responding to reports of multiple people hurt in a shooting at a Rhode Island ice rink where a youth hockey game was scheduled. Little detail was immediately available about the shooting Monday afternoon at Dennis M. Lynch Arena in Pawtucket, a few miles outside Providence. Messages seeking comment were left for Pawtucket police and a spokesperson for the city’s mayor. An email message left for a spokesperson with a local hospital also was not immediately returned.",
      "publishedAt": "2026-02-16T21:00:49Z",
      "title": "Police respond to reports of a shooting at a Rhode Island hockey rink",
      "url": "https://apnews.com/article/pawtucket-hockey-rink-shooting-rhode-island-c8ac3e8067ce2f2ce07e4d98009ecdaa",
      "urlToImage": "https://dims.apnews.com/dims4/default/d68fa2e/2147483647/strip/true/crop/4200x2799+0+306/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fbc%2Facba8caad274aad0fe4b3af27d4c%2Fd954ebd6a2234f6eae572e248906c4d3"
    },
    {
      "author": "Scott Bauer",
      "description": "Investigators working on the disappearance of “Today” show host Savannah Guthrie’s mother are consulting with Walmart management to develop leads. That's because a backpack the suspect was wearing is sold exclusively at Walmart stores. Chris Nanos, the sheriff of Pima County, Arizona, told The Associated Press in a text message on Monday that the suspect's “Ozark Trail Hiker Pack” is the only clothing item that has been “definitively identified.” Nancy Guthrie was last seen at her Arizona home on Jan. 31 and was reported missing the following day. The Federal Bureau of Investigation released surveillance videos of a masked person wearing a handgun holster outside Guthrie’s front door the night she vanished.",
      "publishedAt": "2026-02-16T19:17:37Z",
      "title": "Nancy Guthrie kidnapping investigators working with Walmart to develop leads",
      "url": "https://apnews.com/article/savannah-guthrie-mom-mother-missing-walmart-9b90363ef0e59fe69a7bd65e1445aa03",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca9514c/2147483647/strip/true/crop/1500x999+0+500/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F7a%2F82c5a50e812aaa943cd6b51eda7d%2F89acada3beab481eb36bb8ac79798f8a"
    },
    {
      "author": "Hannah Schoenbaum",
      "description": "A federal judge has ordered an exhibit about nine people enslaved by George Washington to be restored at his former home in Philadelphia after President Donald Trump’s administration took it down last month. The order came on Presidents Day, the federal holiday honoring Washington’s legacy. The city of Philadelphia sued last month after the National Park Service removed the panels from Independence National Historical Park. The removal followed a Trump executive order on “restoring truth and sanity to American history” at the nation’s museums, parks and landmarks. U.S. District Judge Cynthia Rufe said all materials must be restored while a lawsuit challenging the removal’s legality plays out.",
      "publishedAt": "2026-02-16T23:26:39Z",
      "title": "Judge orders Trump administration to restore George Washington slavery exhibit in Philadelphia",
      "url": "https://apnews.com/article/george-washington-slavery-exhibit-restored-trump-2a32236320f280ba3e647d900c1301b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9efd56a/2147483647/strip/true/crop/4914x3274+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F23%2F6dd1ef54cdeac0c8d1ff91f711dc%2F55269aed24a24d6591a0e7c6c68c3618"
    },
    {
      "author": "John Raby",
      "description": "The trial has started for a man whose teenage son is accused of killing two students and two teachers at a Georgia high school in 2024. Lawyers gave opening statements Monday in the case against Colin Gray. Prosecutors say Gray gave his son, Colt, access to a gun and ammunition despite warning signs. They link that decision to the four deaths at Apalachee High School. Investigators say the 14-year-old planned the attack and brought a rifle in his backpack. Gray's attorney says his client wasn't told about the planning and timing of the shooting and shouldn't be held criminally responsible The trial is being held in Winder, where the shooting happened, with jurors from nearby Hall County.",
      "publishedAt": "2026-02-16T06:39:52Z",
      "title": "Trial gets underway for a man whose son is accused in high school shooting",
      "url": "https://apnews.com/article/georgia-school-shooting-apalachee-high-colin-gray-50b94cfc66b3e68cd2ccd07219eceddf",
      "urlToImage": "https://dims.apnews.com/dims4/default/ffeb159/2147483647/strip/true/crop/4454x2968+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F79%2Fea8517aa701f33c65f0590868a38%2Fffff3a51cc404f5ea8daec0fc02aef2c"
    },
    {
      "author": "Dyepkazah Shibayan",
      "description": "The Nigerian military says about 100 U.S. troops plus equipment have arrived in Nigeria to help train soldiers in the West African country. The arrival followed a request by the Nigerian government to the U.S government to for training, technical support intelligence-sharing, the military said in a statement Monday. The deployment follows an easing of tensions that had flared between the U.S. and Nigeria when U.S. President Donald Trump had issued threats against Nigeria over allegations that the government was not protecting its Christian citizens.",
      "publishedAt": "2026-02-16T17:41:46Z",
      "title": "US troops arrive in Nigeria to help train its military",
      "url": "https://apnews.com/article/us-troops-nigeria-training-29eed3ae3dfe7c5dede9d06074a8afc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Sam Metz",
      "description": "Israeli prosecutors say they plan to charge a settler in the killing of a Palestinian activist during a confrontation that was caught on video. That would open a rare prosecution of violence by Jewish settlers in the occupied West Bank. Attacks from settlers and home demolitions by authorities have spiked dramatically over the past two years. But the death in July of Awdah Hathaleen has drawn particular attention due to his involvement in the 2025 Oscar-winning film “No Other Land.” The case also stands out because the confrontation was captured on video from multiple vantage points.",
      "publishedAt": "2026-02-16T17:20:07Z",
      "title": "Israel plans to charge a man filmed firing a gun during an attack on a Palestinian activist",
      "url": "https://apnews.com/article/israel-palestinians-west-bank-settlers-86621a794e0d3828b946c753bf08a4ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/6fa0a15/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fbf%2F84108fabcc12f0b2239cdfd53473%2Fb86e91e454a942898f3c15ff1fc69d6e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}