{
  "articles": [
    {
      "author": "ANNE D'INNOCENZIO, HALELUYA HADERO and DEE-ANN DURBIN",
      "description": "NEW YORK (AP) — TikTok and its bite-sized videos arrived in the United States as a global version of the Chinese app Douyin.",
      "publishedAt": "2024-07-03T08:59:34Z",
      "title": "From 'latte makeup' to 'girl dinners,' TikTok has launched tons of trends. Will its influence last?",
      "url": "https://apnews.com/6cc74619493f226827b103da4f652a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2113e8434e914c139402802d788c7434/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and AMIR VAHDAT",
      "description": "DUBAI, United Arab Emirates (AP) — Reformist candidate Masoud Pezeshkian won Iran’s runoff presidential election Saturday, besting hard-liner Saeed Jalili by promising to reach out to the West and ease enforcement on the country’s mandatory headscarf law after years of sanctions and protests squeezing the Islamic Republic.",
      "publishedAt": "2024-07-06T01:43:33Z",
      "title": "Reformist Pezeshkian beats hard-liner to win Iran presidential election, promising outreach to West",
      "url": "https://apnews.com/8a10c940adc1259566791b549828a3fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96bdc4d5278c4b3aa37b1768c85ba8d9/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "MADISON, Wis. (AP) — President Joe Biden, fighting to save his endangered reelection effort, used a highly anticipated TV interview to repeatedly reject taking an independent medical evaluation that would show voters he is up for serving another term in office while blaming his disastrous debate performance on a “bad episode” and saying there were “no indications of any serious condition.\"",
      "publishedAt": "2024-07-05T15:42:40Z",
      "title": "Biden dismisses age questions in interview as he tries to salvage reelection effort",
      "url": "https://apnews.com/e4657f86f5e82b10a5fefb526bc49b08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df936fd6721542059ce7129cc93eed37/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — For years it's been a Republican scare tactic.A vote to reelect President Joe Biden, the GOP often charges, is really a vote for Vice President Kamala Harris.",
      "publishedAt": "2024-07-05T23:09:49Z",
      "title": "Republicans turn their focus to Harris as talk of replacing Biden on Democratic ticket intensifies",
      "url": "https://apnews.com/1963d49f48696dafe2f7558c2dc1cc9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbc822f0e1bf482eb3e936f294ad8cf2/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, REBECCA BOONE and SCOTT SONNER",
      "description": "PORTLAND, Ore. (AP) — Roughly 130 million people were under threat Saturday and into next week from a long-running heat wave that already has broken records with dangerously high temperatures — and is expected to shatter more from East Coast to West Coast, forecasters said.",
      "publishedAt": "2024-07-06T14:51:26Z",
      "title": "More records expected to shatter as long-running blanket of heat threatens 130 million in U.S.",
      "url": "https://apnews.com/2ca3046bf74ca596b24a2879d8dcf664",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b685d9fade1b4c16b89f21ae68f944e8/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — New British Prime Minister Keir Starmer doesn’t get to take a breather.",
      "publishedAt": "2024-07-06T04:09:40Z",
      "title": "A NATO summit and mending EU relations are among first tasks for new UK leader Keir Starmer",
      "url": "https://apnews.com/0da1da8a74c6196518059d7d9fbcf77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/117faa366ced460aaa7788d63d478588/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza (AP) — Hamas has given its initial approval of a U.S.-backed proposal for a phased cease-fire deal in Gaza, dropping a key demand that Israel commit up front to a complete end to the war, a Hamas official and an Egyptian official said Saturday.",
      "publishedAt": "2024-07-06T11:11:26Z",
      "title": "Hamas clears the way for a possible cease-fire in Gaza after dropping key demand, officials say",
      "url": "https://apnews.com/77910b6fae70ac1ff4eb3ac278852b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ef47a093204a00b2f26544e416c232/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The message to NATO from President Vladimir Putin was simple and stark: Don't go too far in providing military support for Ukraine, or you'll risk a conflict with Russia that could quickly turn nuclear.",
      "publishedAt": "2024-07-06T04:18:34Z",
      "title": "Putin sees no need for nuclear weapons to win in Ukraine. But he's also keeping his options open",
      "url": "https://apnews.com/105bc866524d32013a3a4a37ddcef98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da360c8463d74fa4bf334772d04671b2/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — French President Emmanuel Macron could awake — if he has slept at all — with clipped wings on Monday morning. The high-stakes second round of the legislative election on Sunday will almost certainly impact the French leader's sway in the areas of defense and foreign affairs.",
      "publishedAt": "2024-07-06T08:03:39Z",
      "title": "France's president called a surprise election. The result could diminish his power in world affairs",
      "url": "https://apnews.com/3ea124b841f8f1222a5f0c659a2a4a71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e300b64b5674645a3fbea5e57ba5bec/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "With its unprecedented tear through the ultrawarm waters of the southeast Caribbean, Beryl turned meteorologists’ worst fears of a souped-up hurricane season into grim reality.",
      "publishedAt": "2024-07-06T11:59:51Z",
      "title": "Beryl set to strengthen on approach to Texas due to hot ocean temperatures",
      "url": "https://apnews.com/808f7c122d8e202d738d709cb4a4062d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67531beac1354b529608442f0c91256c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}