{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A Texas judge ruled Friday the state’s abortion ban has proven too restrictive for women with serious pregnancy complications and must allow exceptions without doctors fearing the threat of criminal charges.",
      "publishedAt": "2023-08-05T01:42:55Z",
      "title": "A judge has ruled Texas' abortion ban is too restrictive for women with pregnancy complications",
      "url": "https://apnews.com/d90f3bce68d86e5eafe3ba4ba5939188",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/853185e1ef6a486da15d13abb35669f2/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Ukraine said its sea drones struck a major Russian port Friday and damaged a warship in an attack that underlined Kyiv's growing naval capabilities as the Black Sea becomes an increasingly important battleground in the war.",
      "publishedAt": "2023-08-04T07:18:42Z",
      "title": "Ukraine says its drones damaged a Russian warship, showing Kyiv's growing naval capabilities",
      "url": "https://apnews.com/407a02ccfb2b1951c5afe9ec2269eed8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/211aeb95904f41848f415422831ab304/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "In the two-and-a-half years since the Jan. 6 assault on the U.S. Capitol, Congress passed a bipartisan law closing loopholes in the complex process of choosing a new president that Donald Trump tried to exploit in his push to stay in office after losing the 2020 election.",
      "publishedAt": "2023-08-05T04:06:57Z",
      "title": "Trump and allies boost calls for Justice Dept. takeover in new attack on democratic institutions",
      "url": "https://apnews.com/7b399ab628db7330ed99fac8c3784170",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89f30fe23dbc4b17b8c91d17a7422478/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN",
      "description": "NEW YORK (AP) — A crowd of thousands that packed Manhattan's Union Square for a popular livestreamer's hyped giveaway got out of hand Friday afternoon, with some clambering on vehicles, hurling chairs and throwing punches, leaving police struggling to rein in the chaos.",
      "publishedAt": "2023-08-04T20:33:50Z",
      "title": "Thousands overwhelm New York's Union Square for streamer giveaway, tossing chairs and pounding cars",
      "url": "https://apnews.com/95c0410745127ee4a5abf4621f1f27a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f86a5e6325db4f4dbcdd2ebc7cf76ff2/1920.jpeg"
    },
    {
      "author": null,
      "description": "BOISE, Idaho (AP) — A school bus carrying teenage campers rolled over on a winding Idaho highway Friday afternoon, injuring 11 people, the Idaho State Police said. Seven of those hurt had critical injuries and four had non-critical injuries, according to an ISP news release.",
      "publishedAt": "2023-08-04T23:18:20Z",
      "title": "Idaho bus filled with teen campers crashes on winding highway, injuring 11",
      "url": "https://apnews.com/2cecbdd7d6fa7432f319baf1a10cfa22",
      "urlToImage": ""
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "The Justice Department on Friday asked a federal judge overseeing the criminal case against former President Donald Trump in Washington to step in after he released a post online that appeared to promise revenge on anyone who goes after him.",
      "publishedAt": "2023-08-05T02:59:03Z",
      "title": "Prosecutors ask judge to issue protective order after Trump post appearing to promise revenge",
      "url": "https://apnews.com/71cd642e876c47fff4e1283c15f8ca01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7955bd9fa14f9d84d6d7d56691e48d/2915.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, JENNIFER PELTZ and BOBBY CAINA CALVAN",
      "description": "HAUPPAUGE, N.Y. (AP) — A woman whose remains were among discoveries that became known as the Gilgo Beach killings has been identified after 27 years, authorities said Friday, disclosing the latest in a series of recent revelations about the long-cold case.",
      "publishedAt": "2023-08-04T13:45:06Z",
      "title": "After 27 years, authorities identify woman whose remains were found along Gilgo Beach parkway",
      "url": "https://apnews.com/e573bf19f619bbdffe1b52ec3146ab52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ef3ee4d8bc54ef6b7105006a9f78e13/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Federal health officials have approved the first pill specifically intended to treat severe depression after childbirth, a condition that affects thousands of new mothers in the U.S.",
      "publishedAt": "2023-08-04T23:13:23Z",
      "title": "The first pill to treat postpartum depression has been approved by US health officials",
      "url": "https://apnews.com/d6f203c3f4084033aa06424db1382f87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cacb5161d444eadb4e869186d863136/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Men who had sworn an oath to protect and serve were huddled on the back porch of a Mississippi home as Michael Corey Jenkins lay on the floor, blood gushing from his mutilated tongue where one of the police officers shoved a gun in his mouth and pulled the trigger.",
      "publishedAt": "2023-08-04T11:24:34Z",
      "title": "How 6 Mississippi officers tried to cover up their torture of 2 Black men",
      "url": "https://apnews.com/e4937b4cd1d2ed2388b2fd1c3aeefcb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16ab2a12d4bd45f682514cc08c53fea8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}