{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's defense team attacked the credibility of prosecutors' first witness in his hush money case on Friday, seeking to discredit testimony detailing a scheme to bury negative stories to protect the Republican's 2016 presidential campaign.",
      "publishedAt": "2024-04-26T04:01:57Z",
      "title": "Trump's lawyers try to discredit testimony of prosecution's first witness in hush money trial",
      "url": "https://apnews.com/868e6b9d30a039d5009ec6a9d7e96ff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/663a546105f249cbb9b728560e65e0d5/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Defense lawyers in Donald Trump’s hush money trial dug Friday into assertions of the former publisher of the National Enquirer and his efforts to protect Trump from negative stories during the 2016 election.",
      "publishedAt": "2024-04-26T10:41:24Z",
      "title": "The Latest | Trump speaks with reporters after 4th day of witness testimony in hush money trial ends",
      "url": "https://apnews.com/afc9fb76e5b52db950339ce6c99d5fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8b7f2ec32824d7da2527f3b8645a127/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD, NOREEN NASIR and NICK PERRY",
      "description": "NEW YORK (AP) — Students protesting the Israel-Hamas war at at universities across U.S., some of whom have clashed with police in riot gear, dug in Saturday and vowed to keep their demonstrations going, while several school faculties condemned university presidents who have called in law enforcement to remove protesters.",
      "publishedAt": "2024-04-27T05:48:46Z",
      "title": "Student anti-war protesters dig in as faculties condemn university leadership over calling police",
      "url": "https://apnews.com/2ab919ad849c50c9d177a32c0309bd1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68cbf35472b2423f8c9e93862f3b001d/1920.jpeg"
    },
    {
      "author": "JULIE WATSON and LESLIE AMBRIZ",
      "description": "LOS ANGELES (AP) — On a recent afternoon, Grant Oh zigzagged across the University of Southern California campus as if he was conquering an obstacle course, coming up against police blockade after police blockade on his way to his apartment while officers arrested demonstrators protesting the Israel-Hamas war.",
      "publishedAt": "2024-04-27T05:04:28Z",
      "title": "Class of 2024 reflects on college years marked by COVID-19, protests and life's lost milestones",
      "url": "https://apnews.com/7644fb635d24edd30f8f28312cdf85b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c8c440ba05340be859b6327c78a00ee/3000.jpeg"
    },
    {
      "author": "JOSH FUNK, MARGERY A. BECK and HEATHER HOLLINGSWORTH",
      "description": "OMAHA, Neb. (AP) — Tornadoes wreaked havoc Friday in the Midwest, causing a building to collapse with dozens of people inside and destroying and damaging hundreds of homes, many around Omaha, Nebraska.",
      "publishedAt": "2024-04-27T04:32:02Z",
      "title": "Tornadoes collapse buildings and level homes in Nebraska and Iowa",
      "url": "https://apnews.com/f12770a52d1644d88c1dea1b92bc9903",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f8d220ab3584beab54ccdb900649b87/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The retrial in New York of Harvey Weinstein — whose moviemaking prowess once wowed Hollywood — won’t be coming to a courtroom anytime soon, if ever, legal experts said on a day when one of two women considered crucial to the case said she wasn't sure she would testify again.",
      "publishedAt": "2024-04-27T04:09:23Z",
      "title": "Retrial of Harvey Weinstein unlikely to occur soon, if ever, experts say",
      "url": "https://apnews.com/f27efa6886759bab8529e9a6a9ea57e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1603ce19062346a19d97310b059c8d93/3000.jpeg"
    },
    {
      "author": "RYAN J. FOLEY, CARLA K. JOHNSON and SHELBY LUM",
      "description": "Demetrio Jackson was desperate for medical help when the paramedics arrived.The 43-year-old was surrounded by police who arrested him after responding to a trespassing call in a Wisconsin parking lot.",
      "publishedAt": "2024-04-26T10:16:50Z",
      "title": "Dozens of deaths reveal risks of injecting sedatives into people restrained by police",
      "url": "https://apnews.com/621909ba7491abc2af8ad2e33ba3415b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a749ed6f161747ff994b2295a3c83a5e/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — A former paramedic who injected Elijah McClain with a powerful sedative avoided prison Friday and was sentenced to 14 months in jail with work release and probation in the killing of the Black man that helped fuel the 2020 racial injustice protests.",
      "publishedAt": "2024-04-26T05:42:24Z",
      "title": "Paramedic who injected Elijah McClain with ketamine before his death avoids prison",
      "url": "https://apnews.com/c2a7d4a0883588c4dc87993ebe6bb472",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb23041ee8e41459df9ad7a4f8b455d/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. will provide Ukraine additional Patriot missiles for its air defense systems as part of a massive $6 billion additional aid package, Defense Secretary Lloyd Austin announced Friday.",
      "publishedAt": "2024-04-25T23:50:44Z",
      "title": "US announces new Patriot missiles for Ukraine as part of new $6 billion aid package",
      "url": "https://apnews.com/026fc8f9ee064ffb49bbee2422e2908b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8afe8c87e244360afba280c00cd8263/1920.jpeg"
    },
    {
      "author": "MATTHEW PERRONE and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden’s administration is indefinitely delaying a long-awaited menthol cigarette ban, a decision that infuriated anti-smoking advocates but could avoid a political backlash from Black voters in November.",
      "publishedAt": "2024-04-26T18:57:36Z",
      "title": "Biden officials indefinitely postpone ban on menthol cigarettes amid election-year pushback",
      "url": "https://apnews.com/e9a28fb0ac70fcb0ad8e106c42d4c951",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66b3845f3c4d4747a69e5ae22f6fe4b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}