{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Joined by his top military officials handling his nuclear-capable weapons and munitions factories, North Korean leader Kim Jong Un arrived in Russia on Tuesday before an expected meeting with President Vladimir Putin that has sparked concerns about a potential arms deal for Moscow’s war in Ukraine.",
      "publishedAt": "2023-09-12T03:16:41Z",
      "title": "North Korean leader Kim Jong Un arrives in Russia before an expected meeting with Putin",
      "url": "https://apnews.com/07221c9ba59e042372d9a50e756c2d79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89ed6d7f687742c089534bacbc9d563d/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration has cleared the way for the release of five American citizens detained in Iran by issuing a blanket waiver for international banks to transfer $6 billion in frozen Iranian money from South Korea to Qatar without fear of U.S.",
      "publishedAt": "2023-09-11T19:45:23Z",
      "title": "US moves to advance prisoner swap deal with Iran and release $6 billion in frozen Iranian funds",
      "url": "https://apnews.com/3e834df0a845ef2cc5c52af14598c66f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6143266491e641908e4c40df2530c94e/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Lawyers for Donald Trump on Monday asked the federal judge presiding over his election subversion case in Washington to recuse herself, saying her past public statements about the former president and his connection to the Jan.",
      "publishedAt": "2023-09-11T20:55:37Z",
      "title": "Trump lawyers seek recusal of judge in DC presiding over federal election subversion case",
      "url": "https://apnews.com/3e5039d9d9bb5f47282ba517de5f0e7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c51e7c90b188486a8e39d3cc4203d5b3/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Americans looked back Monday on 9/11 with moments of silence, tearful words and appeals to teach younger generations about the terror attacks 22 years ago.“For those of us who lost people on that day, that day is still happening.",
      "publishedAt": "2023-09-11T04:04:54Z",
      "title": "The US marks 22 years since 9/11 with tributes and tears, from ground zero to Alaska",
      "url": "https://apnews.com/47488758b18fd78f541674041e36d263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15c119b227ee4e82bb2a29b615996124/1920.jpeg"
    },
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "TAFEGHAGHTE, Morocco (AP) — His dead relatives have been dug out and buried, but the remnants of Musa Bouissirfane's former life are still trapped under rubble and dust in the ruins of the mud-brick Moroccan village of Tafeghaghte.",
      "publishedAt": "2023-09-11T10:42:09Z",
      "title": "Earthquake robbed Moroccan villagers of almost everything — loved ones, homes and possessions",
      "url": "https://apnews.com/a1b2cbc0ce88afbfe7ad23e652ce11de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a0bca06e60a429ca66cbd5f3648950b/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Mediterranean storm Daniel caused devastating floods in Libya that broke dams and swept away entire neighborhoods in multiple coastal towns in the east of the North African nation.",
      "publishedAt": "2023-09-11T10:02:07Z",
      "title": "Flooding in Libya leaves 2,000 people feared dead and more missing after storm collapsed dams",
      "url": "https://apnews.com/8fac4fe35b962242568ff219456c6870",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd389e92eaa440839df2c3640657efff/1999.jpeg"
    },
    {
      "author": "PAUL WISEMAN and MICHAEL LIEDTKE",
      "description": "WASHINGTON (AP) — Google will confront a threat to its dominant search engine beginning Tuesday when federal regulators launch an attempt to dismantle its internet empire in the biggest U.S. antitrust trial in a quarter century.",
      "publishedAt": "2023-09-12T04:04:04Z",
      "title": "It's Google versus the US in the biggest antitrust trial in decades",
      "url": "https://apnews.com/687b9a5b90ec18f207d36df3ba11aebd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77c834d682e946c987572cb253f4c34c/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — The U.S. approved updated COVID-19 vaccines Monday, hoping to rev up protection against the latest coronavirus strains and blunt any surge this fall and winter.The Food and Drug Administration decision opens the newest shots from Moderna and Pfizer and its partner BioNTech to most Americans even if they’ve never had a coronavirus vaccination.",
      "publishedAt": "2023-09-11T18:00:16Z",
      "title": "US approves updated COVID vaccines to rev up protection this fall",
      "url": "https://apnews.com/234f27c74438fb4812a014dbd98ddbde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40e7d2011c9b4489a636ecae88646583/1134.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE and COREY WILLIAMS",
      "description": "CHICAGO (AP) — It took four and a half months for Shannon Ross’ life to unravel. Ross, who describes himself as Indigenous and a person of color, was arrested in Chicago in October 2019 on weapons charges and ultimately found not guilty.",
      "publishedAt": "2023-09-12T04:10:31Z",
      "title": "Cash bail disproportionately impacts communities of color. Illinois is the first state to abolish it",
      "url": "https://apnews.com/b8aac667b7d3016e12ea64a70964bf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00bb869152984e6291b73a8afe103bcb/3000.jpeg"
    },
    {
      "author": "DENNIS WASZAK Jr.",
      "description": "EAST RUTHERFORD, N.J. (AP) — Aaron Rodgers' debut with the New York Jets lasted just four snaps.And now the four-time MVP and a shell-shocked fanbase will have to see how long he might be sidelined.",
      "publishedAt": "2023-09-12T00:26:55Z",
      "title": "Aaron Rodgers injures his left Achilles tendon in his first series for the Jets",
      "url": "https://apnews.com/5ccdcee9f5ec74538609ff6f724fb860",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7fdce0f5adb48ce9ff93a72dbd66957/2843.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}