{
  "articles": [
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Working furiously to take control of a House in disarray, allies of Speaker Kevin McCarthy implored their Republican colleagues Saturday to drop their hardline tactics and work together to approve a conservative spending plan to prevent a federal shutdown.",
      "publishedAt": "2023-09-23T21:24:35Z",
      "title": "With House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government",
      "url": "https://apnews.com/249d83636e9d61cdd2aabdf34a129514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f58ba0500e394a5d93caef0eb66ef7cf/3000.jpeg"
    },
    {
      "author": null,
      "description": "TORONTO (AP) — Information shared by members of an intelligence-sharing alliance was part of what Canadian Prime Minister Justin Trudeau used to make public allegations of the Indian government's possible involvement in the assassination of a Sikh Canadian, the U.S.",
      "publishedAt": "2023-09-23T18:44:57Z",
      "title": "US diplomat says intelligence from 'Five Eyes' nations helped Canada to link India to Sikh's killing",
      "url": "https://apnews.com/c475ac129e09e5f1c9ebf68eaaf247ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e010ee35b244e4aa5d72ab468b9abee/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE and JONATHAN MATTISE",
      "description": "ANNAPOLIS, Md. (AP) — Residents in parts of coastal North Carolina and Virginia experienced flooding Saturday after Tropical Storm Ophelia made landfall near a North Carolina barrier island, bringing rain, damaging winds and dangerous surges.",
      "publishedAt": "2023-09-23T05:30:10Z",
      "title": "Southern East Coast hit by flooding as Ophelia weakens to tropical depression and moves north",
      "url": "https://apnews.com/f6c9d5e3a9a5b0258543cc92b609c12e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/438e31daad8a4778a8d816020c6cbba6/3000.jpeg"
    },
    {
      "author": "BARRY HATTON and HELENA ALVES",
      "description": "COSTA DA CAPARICA, Portugal (AP) — Sofia Oliveira was 12 years old when catastrophic wildfires in central Portugal killed more than 100 people in 2017. She “felt it was now or never to raise our voices” as her country appeared to be in the grip of deadly human-caused climate change.",
      "publishedAt": "2023-09-24T03:02:20Z",
      "title": "Six young activists devote years to climate fight with 32 governments. Now comes their day in court",
      "url": "https://apnews.com/9bfbd337aa0e8e8b0078c574c526ad00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a79d82b6a9540cfa97bcf59ae9ad522/3000.jpeg"
    },
    {
      "author": "FRANK BAJAK",
      "description": "BOSTON (AP) — A leading Egyptian opposition politician was targeted with spyware multiple times after announcing a presidential bid — including with malware that automatically infects smartphones, security researchers have found.",
      "publishedAt": "2023-09-23T18:09:53Z",
      "title": "Leading Egyptian opposition politician targeted with spyware, researchers find",
      "url": "https://apnews.com/6e5ab454bff94e1712c94b20b0756f7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d33b035180f4468eac6093d2d09ca362/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Rep. Andy Kim of New Jersey announced on Saturday that he will run against Sen. Robert Menendez in the state’s Democratic primary for Senate next year, saying he feels compelled to run against the three-term senator after he and his wife were indicted on sweeping corruption charges.",
      "publishedAt": "2023-09-23T22:16:26Z",
      "title": "Menendez gains a primary opponent as calls for his resignation grow after indictment",
      "url": "https://apnews.com/760ddf686941db61091ca5fd3659f040",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2e8b912820f43da9afdb02f33e240fa/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Even after escalating its strike against Detroit automakers on Friday, the United Auto Workers union still has plenty of leverage in its effort to force the companies to agree to significant increases in pay and benefits.",
      "publishedAt": "2023-09-23T18:05:36Z",
      "title": "Auto workers still have room to expand their strike against car makers. But they also face risks",
      "url": "https://apnews.com/1e68877dc9b15879879845fb4f77788e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f135030d0762489688345e68b42b4364/3000.jpeg"
    },
    {
      "author": null,
      "description": "UNITED NATIONS (AP) — It's almost the end of the U.N. General Assembly high-level meeting that brings world leaders together at U.N.",
      "publishedAt": "2023-09-24T00:25:01Z",
      "title": "UNGA Briefing: There's one more day to go after a break — but first, here's what you missed",
      "url": "https://apnews.com/523c0bdb528ab44414fbf70a0dc9fd7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af925615d1e54ac7aeb12d473f0fc3ff/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Ukraine on Saturday morning launched another missile attack on Sevastopol on the occupied Crimean Peninsula, a Russian-installed official said, a day after an attack on the headquarters of Russia’s Black Sea Fleet that left a serviceman missing and the main building smoldering.",
      "publishedAt": "2023-09-23T11:24:37Z",
      "title": "Ukraine targets a key Crimean city a day after striking Russia's Black Sea Fleet headquarters",
      "url": "https://apnews.com/9c287d5bad840beedbd68eb32c4c76a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b23a245dfda040c5aca0ab123b3ac41e/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The family of a Black high school student in Texas who was suspended over his dreadlocks filed a federal civil rights lawsuit Saturday against the state's governor and attorney general, alleging they failed to enforce a new law outlawing discrimination based on hairstyles.",
      "publishedAt": "2023-09-23T16:17:08Z",
      "title": "A Black student was suspended for his hairstyle. Now his family is suing Texas officials",
      "url": "https://apnews.com/e79ede512923b672a275abf054e2407b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11757d7770524ea48062da07f43be3a3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}