{
  "articles": [
    {
      "author": "KATIE MARIE DAVIES and DASHA LITVINOVA",
      "description": "An Azerbaijani airliner with 67 people onboard crashed Wednesday in the Kazakhstani city of Aktau, leaving at least 32 survivors, according to officials. More than 30 people are likely dead.Kazakhstan's Emergency Ministry said in a Telegram statement that those on board included five crew.",
      "publishedAt": "2024-12-25T07:53:38Z",
      "title": "Azerbaijani airliner with 67 people onboard crashes in Kazakhstan leaving 32 survivors",
      "url": "https://apnews.com/a655474030a347a5a7ddda3a77bbeddc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84cd870993b74ddbbc2566aef6c0c26b/1920.jpeg"
    },
    {
      "author": "SILVIA STELLACCI and COLLEEN BARRY",
      "description": "VATICAN CITY (AP) — Pilgrims lined up early Wednesday to walk through the great Holy Door at the entrance of St. Peter’s Basilica, as Christmas marked the start of the 2025 Holy Year celebration that is expected to bring some 32 million Catholic faithful to Rome.",
      "publishedAt": "2024-12-25T09:17:25Z",
      "title": "Pilgrims traverse Vatican Holy Door as Christmas marks the start of the 2025 Holy Year",
      "url": "https://apnews.com/189cce9b0fb73af2a02d117bcad8d4da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/420fc60d91c746dd8a5c89f4f4425fd4/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "At least eight people were killed by Israeli military operations in the northern West Bank around the city of Tulkarem on Tuesday, the Palestinian Health Ministry said, including three people it said were killed by Israeli airstrikes.",
      "publishedAt": "2024-12-24T08:34:21Z",
      "title": "Middle East latest: Israeli raid and airstrikes in West Bank kill at least 8 Palestinians",
      "url": "https://apnews.com/0bdae4e84f41628e1f234acb02367dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa31ec11af9a4628b8272061b46cf4eb/1920.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and TIA GOLDENBERG",
      "description": "JENIN REFUGEE CAMP, West Bank (AP) — Gunfire has rung out for days from the West Bank's Jenin refugee camp. But this time, it’s not Israeli forces that are facing off against armed groups.",
      "publishedAt": "2024-12-25T07:09:06Z",
      "title": "Why Palestinian forces are cracking down on Palestinian militants in the occupied West Bank",
      "url": "https://apnews.com/d698557816e2b9b674c6221511a80ef6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7be5feaff928431a8f02f8fb6a0432f4/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russia launched a massive missile and drone barrage targeting Ukraine's energy infrastructure on Wednesday, striking a thermal power plant and prompting Ukrainians to take shelter in metro stations on Christmas morning.",
      "publishedAt": "2024-12-25T08:27:44Z",
      "title": "Russia targets Ukrainian energy infrastructure on Christmas Day",
      "url": "https://apnews.com/906dafcdbc66bc4976b0428a5cc0d263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f38f2e37e2f24dc39e7d8c2da3c95360/2000.jpeg"
    },
    {
      "author": "ROBERT BADENDIECK",
      "description": "ISTANBUL (AP) — In a dim one-room apartment in one of Istanbul’s poorest neighborhoods, 11-year-old Atakan Sahin curls up on a threadbare sofa with his siblings to watch TV while their mother stirs a pot of pasta.",
      "publishedAt": "2024-12-25T05:02:51Z",
      "title": "Turkey's soaring costs are creating a 'lost generation' of kids forced to help their families get by",
      "url": "https://apnews.com/63551d2d589550666cb06ffcb7a8c18e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/614a7d915a5a4d2499ed1673768559fe/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "FORT LAUDERDALE, Fla. (AP) — President-elect Donald Trump promised on Tuesday to “vigorously pursue” capital punishment after President Joe Biden commuted the sentences of most people on federal death row partly to stop Trump from pushing forward their executions.",
      "publishedAt": "2024-12-24T21:36:10Z",
      "title": "Trump vows to pursue executions after Biden commutes most of federal death row",
      "url": "https://apnews.com/d9d1fbb5d6cb0e7727ce9f4644414a62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42cdddaa9efa4cfaa5ed1b62b10b0a5e/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN, ACHMAD IBRAHIM, and FADLAN SYAM",
      "description": "LHOKNGA, Indonesia (AP) — Qurrata Ayuni, a 28-year-old survivor of the earthquake and tsunami that devastated her hometown two decades ago, has transformed her resilience into purpose. Defying Aceh's male-dominated coffee culture, she runs a café that serves as a welcoming space for everyone, especially women, by employing and empowering them in the region worst hit by the tragedy.",
      "publishedAt": "2024-12-25T01:59:53Z",
      "title": "After 20 years, the post-tsunami generation stays vigilant for future disasters",
      "url": "https://apnews.com/6b91150437c2820ad59130c060b905ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f8b5a233cd4c3aa3b65f7d8f0bfd18/3000.jpeg"
    },
    {
      "author": "ALLEN PANCHANA",
      "description": "GUAYAQUIL, Ecuador (AP) — Ecuadorian police on Tuesday found an undisclosed number of bodies in an area close to a military base, officials said, and were investigating whether the bodies could be of some of the four children who were last seen taken by men in military uniform earlier this month.",
      "publishedAt": "2024-12-25T01:30:57Z",
      "title": "Ecuadorian police probe if bodies found are of missing children allegedly taken by soldiers",
      "url": "https://apnews.com/d514808006185a20944a2951e3f02aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/720780b36cb640ba893c0ac8c7d4349b/3000.jpeg"
    },
    {
      "author": "SAM MCNEIL",
      "description": "MODIIN, Israel (AP) — For more than 400 days after being critically wounded during Hamas’ Oct. 7, 2023, attack on southern Israel, Yona Brief tried to recover. But after losing both legs and enduring medically induced comas, the combat medic died in late November.",
      "publishedAt": "2024-12-25T08:49:24Z",
      "title": "An Israeli soldier who died 417 days after his Oct. 7 wounds has become a symbol of sacrifice",
      "url": "https://apnews.com/11f076ba459453f4ee9e4f046537873f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f61a9ce7994d87a0abe7ba20f8caaf/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}