{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy has expressed gratitude for U.S. President Donald Trump's plan to send more weapons to Ukraine, particularly Patriot air defense missile systems. But Ukrainians remain skeptical about the impact on the war of Washington's decision. Trump delayed “very severe” sanctions on Russia for 50 days, sparking criticism from Ukrainians and European leaders who see the delay as too long. Moscow saw the postponement as a reprieve.",
      "publishedAt": "2025-07-15T10:41:14Z",
      "title": "Ukrainians welcome US aid but see Trump’s 50-day ultimatum to Putin as too long",
      "url": "https://apnews.com/article/ukraine-trump-support-tariffs-russia-delay-9b620082c8fe3c457b23b0fe01241da2",
      "urlToImage": "https://dims.apnews.com/dims4/default/462d12a/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F4b%2F620c40a55af02735a0f56a73633d%2Fc591d44040584ee2a93d7c62cd32cc13"
    },
    {
      "author": null,
      "description": "Nvidia's CEO Jensen Huang says the technology giant has won approval from the Trump administration to sell its advanced H20 computer chips used for artificial intelligence to China. The company shared the news in a blog post late Monday and Huang also spoke about it on China's state-run CGTN television network. The White House announced in April that it would restrict sales of Nvidia’s H20 chips and AMD’s MI308 chips to China. Nvidia said the tighter export controls would cost it an extra $5.5 billion. Huang and other technology leaders have been lobbying President Donald Trump to reverse the restrictions, arguing they hinder U.S. competition in a leading edge sector in a major technology market.",
      "publishedAt": "2025-07-15T03:51:48Z",
      "title": "Nvidia gets US approval to sell H20 AI chips to China",
      "url": "https://apnews.com/article/nvidia-china-ai-chips-h20-trump-91588c36559bc881b8e010a9ed95cf0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/425e79f/2147483647/strip/true/crop/6000x3375+0+437/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F77%2F80ea0b273c751a91c830cabcd53a%2Fcbe1c5b9463d41bdbd65d21bfed68812"
    },
    {
      "author": null,
      "description": "Syria’s defense minister has announced a ceasefire after government forces entered a key city in Sweida province on Tuesday. This follows deadly clashes between local Sunni Bedouin tribes and Druze armed factions, which escalated when security forces intervened. The conflict began with kidnappings and attacks, raising fears of sectarian violence. Religious leaders initially urged Druze fighters to surrender weapons, but some later accused the government of breaking promises and targeting civilians.",
      "publishedAt": "2025-07-15T09:13:05Z",
      "title": "Syria announces ceasefire after sectarian violence",
      "url": "https://apnews.com/article/syria-druze-clashes-sweida-44585d1d58ddcdd224e9573ca94767b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6807df/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F96%2F9bb5878ba8085cb2ee4032bbaeac%2Fb20bd291f45442d3b2f317aa506b3579"
    },
    {
      "author": null,
      "description": "Mike Waltz will face questioning from lawmakers for the first time since he was ousted as national security adviser. President Donald Trump has nominated him to be U.S. ambassador to the United Nations, and he's set to appear before the Senate Foreign Relations Committee for his confirmation hearing Tuesday. It will provide senators with the first opportunity to grill Waltz over revelations that he added a journalist to a private text chain on the unclassified Signal messaging app that was used to discuss sensitive military plans. Waltz took responsibility for the episode. He faces lawmakers after months of delay, including the withdrawal of the previous U.N. nominee.",
      "publishedAt": "2025-07-15T04:05:58Z",
      "title": "Mike Waltz to face Senate grilling over Signal chat",
      "url": "https://apnews.com/article/waltz-trump-signal-united-nations-ambassador-14e98e2f6326877083a19f15992b8e54",
      "urlToImage": "https://dims.apnews.com/dims4/default/d601c1b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Ff5%2F3e92967098140e0fdf8fcf51b71f%2Fea55acd40c7140e680ccd65060fae7d4"
    },
    {
      "author": null,
      "description": "A Colorado dentist accused of killing his wife of 23 years by poisoning her protein shakes begins trial with opening arguments this week. Prosecutors allege James Craig used cyanide and another chemical to kill Angela Craig two years ago in suburban Denver. They claim he searched online for ways to disguise a murder and bought arsenic and potassium cyanide. Authorities also accuse Craig of offering money to arrange false testimony and kill the lead investigator. Craig denies all charges, including first-degree murder, and his attorneys question the evidence and police bias. The trial is set to begin Tuesday.",
      "publishedAt": "2025-07-15T03:48:08Z",
      "title": "Murder trial begins for Colorado dentist accused of poisoning wife",
      "url": "https://apnews.com/article/dentist-colorado-murder-poison-protein-shakes-trial-741e15b1cc91271164631e8223d43ffe",
      "urlToImage": "https://dims.apnews.com/dims4/default/2768dbf/2147483647/strip/true/crop/3000x1688+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F70%2F978c616e629e2e253304997898ce%2Fd6c8f92ec8a441f08280fe27481b254f"
    },
    {
      "author": null,
      "description": "Heavy rain has swept across parts of the Northeast, inundating sections of New York and New Jersey with flash flooding that stranded vehicles in roadways, closed subway lines and led to the declaration of a state of emergency. Downpours moved through the region Monday night. The worst of the rain has moved on as of Tuesday morning, but some roads and streets are still flooded and one house in a flooded North Plainfield, New Jersey, neighborhood caught on fire and collapsed, possibly due to an explosion. New Jersey's governor declared a state of emergency Monday night due to flash flooding and heavy rainfall. In New York City, some subway service was suspended due to flooding.",
      "publishedAt": "2025-07-15T01:18:54Z",
      "title": "Heavy rain and flash floods hit New Jersey and New York",
      "url": "https://apnews.com/article/flash-floods-northeast-new-york-new-jersey-09b0e611a1dead720168b3acccc4aeb1",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b545f2/2147483647/strip/true/crop/3200x1800+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F49%2Ffcc0a7208c4fce51b56a67b40577%2F576dd22c55ab499db07ba1afe4ce14f0"
    },
    {
      "author": null,
      "description": "The first astronauts in more than 40 years from India, Poland and Hungary are back on Earth. They closed out their private spaceflight Tuesday with a splashdown in the Pacific off the California coast. Their SpaceX capsule undocked from the International Space Station a day earlier. The crew of four launched nearly three weeks ago on a flight chartered by the Houston company Axiom Space. Axiom's Peggy Whitson served as commander. It was Axiom's fourth mission to the space station, part of NASA's effort to open up space to more businesses and people.",
      "publishedAt": "2025-07-15T09:32:43Z",
      "title": "Private spaceflight ends with a Pacific splashdown for astronauts from India, Poland and Hungary",
      "url": "https://apnews.com/article/axiom-spacex-astronauts-ca61122b649f8f9307ec161acf4611e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f34a3c/2147483647/strip/true/crop/3024x1701+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2Fd1%2F86c724b7211fe1bbc966c6a01a48%2Fdbab545129e2470b80eb66660c1ee150"
    },
    {
      "author": null,
      "description": "Thousands of Afghans who worked with British forces have been secretly resettled in the U.K. after a leak of data on their identities raised fears that they could be targeted by the Taliban. The British government disclosed the existence of the resettlement program on Tuesday. A dataset containing the personal information of nearly 19,000 Afghans who had applied to come to Britain after the Taliban takeover of their country was released in error in 2022, and extracts were later published online. That prompted the then-Conservative government to set up a secret program to resettle the Afghans.",
      "publishedAt": "2025-07-15T11:47:01Z",
      "title": "UK says thousands of Afghans have been brought to Britain under secret program",
      "url": "https://apnews.com/article/britain-afghanistan-refugees-31c4e3c2746ba409fa72f76430b93020",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "An Israeli ultra-Orthodox party has announced plans to leave Prime Minister Benjamin Netanyahu's coalition government. The decision destabilizes Netanyahu's leadership amid the ongoing war in Gaza. The party, United Torah Judaism, cites disagreements over a bill granting military draft exemptions for its constituents. The issue has long divided Israelis and intensified as military demands grew during the war in Gaza. The departure, which goes into effect in 48 hours, leaves Netanyahu with a slim majority, increasing his reliance on far-right parties in his coalition. The political development comes as Israel and Hamas continue to discuss terms for a ceasefire.",
      "publishedAt": "2025-07-15T07:04:14Z",
      "title": "Netanyahu's coalition is rattled as ultra-Orthodox party announces exit over military draft law",
      "url": "https://apnews.com/article/israel-netanyahu-government-gaza-war-elections-e207f3519314012df4c489fe1eaafa33",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a40337/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2Fe7%2Fe7117d00a413d6c0743d1137fd1f%2F0a8bd6bba9e2413e92b3fb97358c2ef9"
    },
    {
      "author": null,
      "description": "India's aviation regulator has ordered airlines to inspect fuel control switches on certain Boeing models. This follows a preliminary report on last month’s Air India crash, which killed 260 people on June 12 shortly after takeoff, revealing both engines lost fuel due to flipped switches without saying how this could have happened during the flight. It also noted a 2018 U.S. advisory, urging inspections of these switches. According to Monday’s directive, airlines must complete inspections and report findings by July 21. Air India has since conducted deeper checks on its Boeing 787 fleet.",
      "publishedAt": "2025-07-15T09:21:10Z",
      "title": "India orders airlines to inspect certain Boeing models after Air India crash",
      "url": "https://apnews.com/article/air-india-plane-crash-boeing-probe-ahmedabad-07a41340c88670f51b25429b92f28802",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}