{
  "articles": [
    {
      "author": "ZEKE MILLER, JONATHAN J. COOPER, AAMER MADHANI and DARLENE SUPERVILLE",
      "description": "CHICAGO (AP) — Former President Barack Obama and second gentleman Doug Emhoff will speak Tuesday on the second day of the Democratic National Convention, turning the party’s attention toward Vice President Kamala Harris and her faceoff against Republican Donald Trump.",
      "publishedAt": "2024-08-20T10:32:31Z",
      "title": "Obama and Emhoff are to headline the Democratic National Convention on Tuesday",
      "url": "https://apnews.com/ffb55cee591f8f162ad77b5d6b91152b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd6ad6e1ed564bfb9f43a3207806484e/2706.jpeg"
    },
    {
      "author": "WILL WEISSERT and NICHOLAS RICCARDI",
      "description": "CHICAGO (AP) — The Democratic National Convention 's first night showcased speeches from the last Democrat to lose to Donald Trump and the last one to beat him.",
      "publishedAt": "2024-08-20T01:50:01Z",
      "title": "Joe Biden's exit, talk of the glass ceiling, a nod to Gaza protesters. Takeaways from DNC's Day 1",
      "url": "https://apnews.com/dcb94aad3450d69c9ce1c25b9699f737",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72a73213f6d346a3baa6f02f1c99412d/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Barack Obama was days shy of his 43rd birthday and months from being elected to the U.S. Senate when he stepped onto a Boston stage at the 2004 Democratic National Convention.A state lawmaker from Illinois, he had an unusual profile to be a headline speaker at a presidential convention.",
      "publishedAt": "2024-08-20T04:40:07Z",
      "title": "Obama made his DNC debut 20 years ago. He's returning to make the case for Kamala Harris",
      "url": "https://apnews.com/58f15df279a382be92040dfbc6adde13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4321860ff4c4965a1348f9cbbc51657/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN, JOEY CAPPELLETTI and LEA SKENE",
      "description": "CHICAGO (AP) — Dozens of protesters broke through a security fence near the site of the Democratic National Convention on its opening day Monday as thousands took to the streets to voice their opposition to the war in Gaza.",
      "publishedAt": "2024-08-19T06:16:05Z",
      "title": "Some protesters tear down security fence as thousands march outside Democratic National Convention",
      "url": "https://apnews.com/87d32321eb5714e2005fe8410b928513",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd73264bf9a94898902fe9ff075c3ff8/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military said Tuesday that it recovered the bodies of six hostages taken in Hamas’ Oct. 7 attack that started the war in Gaza, as U.S.",
      "publishedAt": "2024-08-20T07:12:13Z",
      "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken tries to advance cease-fire deal",
      "url": "https://apnews.com/54dfaddce02c2d3cdf0415b140b3229c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82c3628a9c4c4b9ca655440843da258e/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel's demand for lasting control over two strategic corridors in Gaza, which Hamas has long rejected, threatens to unravel cease-fire talks aimed at ending the 10-month-old war, freeing scores of hostages and preventing an even wider conflict.",
      "publishedAt": "2024-08-20T04:43:27Z",
      "title": "Why is Israel demanding control over 2 Gaza corridors in the cease-fire talks?",
      "url": "https://apnews.com/03deb20a6c549273fb4b8ce3475fff17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da80598594474835bfc00d13d5a6ac1f/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian authorities struggled Tuesday to put out a massive fire in the southern Rostov region for a third consecutive day after an oil depot was hit by Ukrainian drones as Ukrainian forces push into Russia's Kursk region.",
      "publishedAt": "2024-08-20T09:20:25Z",
      "title": "A massive fire rages for a third day at a Russian oil depot targeted in a Ukrainian drone attack",
      "url": "https://apnews.com/0701b3c7f51d1dd1b6e74390f2201339",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/077f916d10df48f58d9afa7aa22bfcb7/1432.jpeg"
    },
    {
      "author": "JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "YORK, Pa. (AP) — As Democrats kick off their convention in Chicago, Donald Trump is trying to regain his footing after weeks of struggling to adjust to Vice President Kamala Harris as his rival.",
      "publishedAt": "2024-08-19T04:08:53Z",
      "title": "Trump is visiting battleground states this week as he struggles to adjust to Harris as his new rival",
      "url": "https://apnews.com/48f5d991866e33af23e4494467240592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b73e55654154488ab45ae2ca6ff8b3a6/3000.jpeg"
    },
    {
      "author": "ANDREA ROSA and NICOLE WINFIELD",
      "description": "PORTICELLO, Sicily (AP) — Police divers resumed searching Tuesday for six people, including British tech magnate Mike Lynch, believed trapped some 50 meters (164 feet) underwater in the hull of a superyacht that sank in a storm off Sicily.",
      "publishedAt": "2024-08-20T06:46:59Z",
      "title": "12-minute search shifts resume for 6 from sunken yacht off Sicily, including tech giant Mike Lynch",
      "url": "https://apnews.com/9f4f3b6d7b48bb3c76dd98e35ab973c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0add7c0db314154aea8f986b0dcc507/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — India’s top court on Tuesday set up a national task force of doctors who will make recommendations on safety of health care workers at their workplaces, days after the rape and killing of a trainee doctor that sparked outrage and nationwide protests.",
      "publishedAt": "2024-08-20T06:46:02Z",
      "title": "India's top court creates task force on workplace safety after doctor was raped and killed",
      "url": "https://apnews.com/f265714c4cd9aa4e1f9c40d36a8609df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3beb782a13fc4f0890a3e99a76b94f77/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}