{
  "articles": [
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — A scary Monday that started with a plunge abroad reminiscent of 1987 ’s crash swept around the world and pummeled Wall Street with more steep losses, as fears worsened about a slowing U.S.",
      "publishedAt": "2024-08-05T00:40:50Z",
      "title": "Dow drops 1,000 points, and Japanese stocks suffer worst crash since 1987 as markets quake worldwide",
      "url": "https://apnews.com/c6240977e9482bf7207abc53b2a11e58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2998ceacb9664b3aa50de3859eee02e0/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN and CHRISTOPHER O'MEARA",
      "description": "HORSESHOE BEACH, Fla. (AP) — Tropical Storm Debby slammed Florida with torrential rain and high winds, contributing to at least four deaths as it turned menacingly toward the Eastern Seaboard’s low-lying regions and threatened to flood some of America’s most historic Southern cities.",
      "publishedAt": "2024-08-05T05:26:55Z",
      "title": "Tropical Storm Debby hits Florida with floods, threat of record rain in Georgia and the Carolinas",
      "url": "https://apnews.com/eb9fc50d578826784824f35ba943a6da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/add7a438916a4d6599135040896d93fb/1920.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT and MICHAEL LIEDTKE",
      "description": "WASHINGTON (AP) — A judge on Monday ruled that Google's ubiquitous search engine has been illegally exploiting its dominance to squash competition and stifle innovation, a seismic decision that could shake up the internet and hobble one of the world's best-known companies.",
      "publishedAt": "2024-08-05T19:33:47Z",
      "title": "Google illegally maintains monopoly over internet search, judge rules",
      "url": "https://apnews.com/319a61f20fb11510097845a30abaefd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a58a66b4e39465ea69bc401e20dc2c1/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD",
      "description": "PHOENIX (AP) — Former President Donald Trump’s campaign attorney Jenna Ellis, who worked closely with his personal attorney, Rudy Giuliani, will cooperate with Arizona prosecutors in exchange for charges being dropped against her in a fake electors case, the state attorney general’s office announced Monday.",
      "publishedAt": "2024-08-05T20:02:13Z",
      "title": "Ex-Trump attorney Jenna Ellis to cooperate in Arizona fake electors case, charges to be dropped",
      "url": "https://apnews.com/2b45b3ff90725fd07dd6c4dc9bfe6f22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9df9745203134d20898b886a6b501e6b/2902.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — Venezuela’s top prosecutor on Monday announced a criminal investigation against the opposition’s presidential candidate Edmundo González and its leader Maria Corina Machado over their call on the armed forces to abandon their support for President Nicolás Maduro and to stop repressing demonstrators.",
      "publishedAt": "2024-08-05T20:03:54Z",
      "title": "Venezuela's top prosecutor announces criminal probe against opposition leaders González, Machado",
      "url": "https://apnews.com/763defac84e8234ff36e0dc6182efdf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4f8a7cb4ab14cd4a8cb61ba404ac64b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The dates are set. The venues are chosen. The only thing missing from this week's campaign blitz with Vice President Kamala Harris and her 2024 running mate is the name of the running mate.",
      "publishedAt": "2024-08-05T12:51:21Z",
      "title": "Rally dates are set. Venues are chosen. The only thing missing for Harris' blitz is her VP choice",
      "url": "https://apnews.com/1bc413ccbce977b2a4f71242410fee2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4e7412c7d2f4ae2a6e1e14fdc4f02ff/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, a daughter of immigrants who rose through the California political and law enforcement ranks to become the first female vice president in U.S.",
      "publishedAt": "2024-08-05T16:43:49Z",
      "title": "Kamala Harris is poised to become the Democratic presidential nominee",
      "url": "https://apnews.com/eb43b6b346cc644b2d195315cb2bfb20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/562e215042e942989558aa56506e7adb/1832.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and BASSEM MROUE",
      "description": "TEL AVIV, Israel (AP) — In Beirut, shops are open and traffic is as snarled as ever. In Tel Aviv, cafes hum with patrons and umbrellas sprout across crowded beaches.Such scenes may seem surreal in a region teetering on the edge of all-out war — and beneath the surface there is plenty of fear and anxiety.",
      "publishedAt": "2024-08-05T17:11:43Z",
      "title": "In Israel and Lebanon, life goes on even as the region teeters on the edge of all-out war",
      "url": "https://apnews.com/0ff6d28cbedf8fc76a1fffb9dea6ad33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e55025ceac54f7e94ec87059574df82/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM and KRUTIKA PATHI",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s prime minister resigned and fled the country Monday after weeks of protests against a quota system for government jobs descended into violence and grew into a broader challenge to her 15-year rule.",
      "publishedAt": "2024-08-05T05:04:29Z",
      "title": "Bangladeshi PM Sheikh Hasina resigns as widening unrest sees protesters storm her official residence",
      "url": "https://apnews.com/fdc7f2632c3d8fcbd913e6c0a1903fd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ddc1b18c3ce407fb6ceeee72a974adc/1920.jpeg"
    },
    {
      "author": "MALLIKA SEN",
      "description": "PARIS (AP) — The Olympics have their own language, traditions and rules — ones that are ever-evolving. It can be a lot to take in so here, The Associated Press will be answering some of the most asked questions about the Paris Games.",
      "publishedAt": "2024-08-03T12:28:35Z",
      "title": "What's the deal with the Olympics? Your burning questions, answered",
      "url": "https://apnews.com/bb425e86c9362cbd050b012a1ace987c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/083ac886e2a34194a2dcf61e1279d49e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}