{
  "articles": [
    {
      "author": "Justin Spike",
      "description": "As Ukraine approached the three-year mark of Russia’s full-scale invasion, the country’s hoped-for path to a favorable and lasting peace has been upended in a matter of days by the administration of U.S. President Donald Trump. Kyiv had benefited from years of staunch support by its allies in the United States and Europe which had provided crucial military and financial support to help defend against Moscow’s grinding incursions. But when Trump held a lengthy phone call with Russian President Vladimir Putin last week — undoing years of U.S. policy to isolate the Russian leader — it was taken as a signal in Kyiv and other European capitals that their alliance to contain Moscow was fraying.",
      "publishedAt": "2025-02-22T05:21:54Z",
      "title": "After years of firm support, 10 days upended the US approach to Ukraine",
      "url": "https://apnews.com/article/ten-days-that-upended-us-support-for-ukraine-8930c01a15910a7ad8a7f7c7fac9ba3a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    },
    {
      "author": null,
      "description": "The United States has proposed a draft resolution for the U.N. General Assembly that stops far short of a competing European-backed statement demanding an immediate withdrawal of all of Moscow’s forces from Ukraine. Both are timed to the third anniversary of Russia’s invasion of Ukraine, which falls on Monday, when the General Assembly will vote on the nonbinding resolutions. It pits the United States against Europe as the strength of the transatlantic alliance has been called into question over the Trump administration’s extraordinary turnaround on Russia, opening negotiations with Moscow after years of isolation as the U.S. looks to broker a rapid end to the war. Russia’s U.N. ambassador said of the U.S. resolution, “It’s a good move.”",
      "publishedAt": "2025-02-22T01:30:38Z",
      "title": "US offers UN resolution on war in Ukraine that stops far short of competing European statement",
      "url": "https://apnews.com/article/russia-ukraine-war-united-nations-resolutions-5a8af28518c4a81d70613f1e19702ae8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4faf88a/2147483647/strip/true/crop/5287x2974+106+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F58%2F3812800357017c31e06401de5e60%2F78f59aad851447e99963b353cc226612"
    },
    {
      "author": "Aamer Madhani",
      "description": "The White House and Ukraine have made significant progress toward reaching an agreement that would provide the U.S. with access to Ukraine’s rare earth minerals and tighten the long-term relationship between Kyiv and Washington. That's according to a person familiar with the negotiations who was not authorized to comment publicly. The progress in talks comes after President Donald Trump and Ukraine President Volodymyr Zelenskyy traded sharp rhetoric this week about their differences over the matter. But the two sides made significant progress during a three-day visit to Ukraine this week by retired Lt. Gen. Keith Kellogg, Trump’s special envoy to Ukraine and Russia.",
      "publishedAt": "2025-02-22T03:37:27Z",
      "title": "White House and Ukraine nearing rare earths deal that would tighten relationship, AP source says",
      "url": "https://apnews.com/article/ukraine-rare-earths-minerals-russia-trump-36090d67358d93b8aa70240761634d4a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": "Illia Novikov",
      "description": "President Donald Trump’s envoy to Ukraine and Russia says he's held “extensive and positive discussions” with Ukraine’s President Volodymyr Zelenskyy about the three-year war. He praised the Ukrainian leader as an “embattled and courageous leader of a nation at war.” Retired U.S. Lt. Gen. Keith Kellogg — who traveled to Kyiv on Wednesday and whose planned news conference with Zelenskyy on Thursday was changed at the last minute to a simple photo opportunity — struck a positive tone Friday after saying it was “a long and intense day” of talks with Ukraine’s senior leadership. His comments marked a departure from rebukes of Zelenskyy by Trump and other senior U.S. officials that appeared to reflect an abrupt deterioration of relations.",
      "publishedAt": "2025-02-21T15:17:20Z",
      "title": "US envoy praises Zelenskyy after Trump's censure of the Ukrainian leader",
      "url": "https://apnews.com/article/russia-ukraine-zelenskyy-trump-0bc41d62c4fdfa00b4358f9043ee9991",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": null,
      "description": "Red Cross ambulances have arrived in Gaza’s southernmost city of Rafah in preparation for the handover of six Israeli hostages to be freed Saturday under the Israel-Hamas ceasefire deal. AP video showed the ambulances waiting among a crowd with a line of Hamas fighters nearby in Rafah, where two of the hostages are expected to be handed over. The other four are to be handed over in central Gaza.",
      "publishedAt": "2025-02-22T06:23:32Z",
      "title": "Family confirms second body released by militants was Shiri Bibas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-22-2025-364c7abeb679e910cb5acba234469574",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1bf97d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F43%2F476efdca70eadb16c08f1e79432d%2F465de4ee09d343a18485466b3b56195c"
    },
    {
      "author": "Michael R. Blood",
      "description": "Six weeks after devastating wildfires, Los Angeles Mayor Karen Bass ousted the city’s fire chief amid a public rift over preparations for the fires and finger-pointing between the chief and City Hall. Bass says in a statement Friday that she is removing Chief Kristin Crowley immediately. Bass says 1,000 firefighters could have been on duty the morning the fires broke out but “were instead sent home on Chief Crowley’s watch.” Bass also says Crowley bucked doing a report requested by the city’s Fire Commission.",
      "publishedAt": "2025-02-21T19:38:44Z",
      "title": "LA mayor Karen Bass dismisses fire chief over response to wildfire",
      "url": "https://apnews.com/article/california-wildfires-fire-chief-146e4421e4bac52dadca6164040eff39",
      "urlToImage": "https://dims.apnews.com/dims4/default/c30ab15/2147483647/strip/true/crop/8209x4618+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F33%2Ff45462d4444d66a065a31e117564%2F52ca21e1d9494d428cef177e675006ff"
    },
    {
      "author": null,
      "description": "A U.S. Border Patrol agent who was killed in Vermont during a traffic stop near the Canadian border is scheduled to be buried at a national cemetery in Minneapolis with full military honors. David Maland died Jan. 20. It was the latest in a series of deaths tied to a cultlike group called the Zizians. The driver of a stopped car is accused of opening fire on Maland and other agents, sparking a shootout that left her companion dead. Both belonged to the Zizians. Investigators say the group may be linked to six deaths in three states. Maland went by Chris and was an Air Force veteran who worked security duty at the Pentagon during the Sept. 11 attacks.",
      "publishedAt": "2025-02-22T05:10:55Z",
      "title": "Border Patrol agent whose death is tied to cultlike Zizians is being buried with military honors",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-zizians-88e34d68cfd64fba3bcab871ef7f0045",
      "urlToImage": "https://dims.apnews.com/dims4/default/018975b/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Fd0%2F8bc84566bae2f075a21bb9d7a387%2F8dc7c0291a2c4b46b11425e0a6e9698b"
    },
    {
      "author": "Tara Copp, Lolita C. Baldor",
      "description": "President Donald Trump has abruptly fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff. The move Friday sidelines a history-making fighter pilot and respected officer as part of a targeted campaign to rid the military of leaders who support diversity and equity in the ranks. Brown is only the second Black general to serve as chairman. His 16 months in the job had been consumed with the war in Ukraine and the expanded conflict in the Middle East. But Brown’s future was called into question during the Senate Armed Services Committee’s confirmation hearing for Defense Secretary Pete Hegseth.",
      "publishedAt": "2025-02-22T00:40:47Z",
      "title": "Trump fires chairman of the Joint Chiefs of Staff and two other military officers",
      "url": "https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf",
      "urlToImage": "https://dims.apnews.com/dims4/default/8691eba/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F03%2F146b5adf1793acabc1bf2b6b425f%2F31247abc2b8b44d0bc34bbf9c0f2ad32"
    },
    {
      "author": "David Bauder",
      "description": "The Associated Press is suing three Trump administration officials over access to presidential events. It's citing freedom of speech in asking a federal judge to stop the 10-day blocking of its journalists. The lawsuit was filed in U.S. District Court in Washington, D.C. The AP says its case is about an unconstitutional effort by the White House to control speech — in this case refusing to change its style from the Gulf of Mexico to the “Gulf of America,” as President Donald Trump did last month with an executive order.",
      "publishedAt": "2025-02-21T21:22:22Z",
      "title": "AP sues 3 Trump administration officials, citing freedom of speech",
      "url": "https://apnews.com/article/ap-lawsuit-trump-administration-officials-0352075501b779b8b187667f3427e0e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff100e7/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F55%2F676e4909e174619cf5dda330e9d9%2Fab43d87a07d24d6fb726565b1eea2cf1"
    },
    {
      "author": "Lea Skene, Lindsay Whitehurst",
      "description": "A federal judge has largely blocked sweeping executive orders from President Donald Trump that sought to end government support for programs promoting diversity, equity and inclusion. Judge Adam Abelson in Baltimore found they likely violate free-speech rights and granted an injunction blocking them as a lawsuit plays out. Trump signed an order his first day in office directing federal agencies to terminate all “equity-related” grants or contracts. The city of Baltimore and higher education groups sued, arguing the executive orders are unconstitutional and an overreach of presidential authority. The Trump administration has argued that the president was targeting only DEI programs that violate federal civil rights laws.",
      "publishedAt": "2025-02-22T00:22:03Z",
      "title": "Judge largely blocks Trump’s executive orders ending federal support for DEI programs",
      "url": "https://apnews.com/article/dei-diversity-equity-inclusion-trump-federal-judge-5b04fbc742bd32adf98ca108b4b12b37",
      "urlToImage": "https://dims.apnews.com/dims4/default/2358533/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fc9%2F34743f2919558f5d65f8684810e0%2Fc171b7026f2342f6974000840b2a618c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}