{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — The border crossing between Egypt and Gaza opened Saturday to let a trickle of desperately needed aid into the besieged Palestinian territory for the first time since Israel sealed it off and began pounding it with airstrikes following Hamas' bloody rampage two weeks ago.",
      "publishedAt": "2023-10-21T06:51:15Z",
      "title": "Egypt's border crossing opens to let a trickle of desperately needed aid into besieged Gaza",
      "url": "https://apnews.com/f5976ed58ba508f14d45b72b428125ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8fc4bb75a8644b7b795c32c26072a87/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The only thing worse than the screams of a patient undergoing surgery without enough anesthesia are the terror-stricken faces of those awaiting their turn, a 51-year-old orthopedic surgeon says.",
      "publishedAt": "2023-10-21T20:24:01Z",
      "title": "Little light, no beds, not enough anesthesia: A view from the 'nightmare' of Gaza's hospitals",
      "url": "https://apnews.com/63d00d907f5469c81f49c0201801c997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caa1135feaa343a3a7eaa0a0ce84ba2a/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER",
      "description": "Shortly before 7 p.m. Tuesday, a volley of rockets lit up the darkened sky over Gaza. Videos analyzed by The Associated Press show one veering off course, breaking up in the air before crashing to the ground.",
      "publishedAt": "2023-10-21T04:13:10Z",
      "title": "AP visual analysis: Rocket from Gaza appeared to go astray, likely caused deadly hospital explosion",
      "url": "https://apnews.com/e0fa550faa4678f024797b72132452e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a6c873727204a0599e411cf404fc5d5/3000.jpeg"
    },
    {
      "author": "GARY FIELDS and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — For many Americans, the Republican dysfunction that has ground business in the U.S.",
      "publishedAt": "2023-10-21T12:06:24Z",
      "title": "Americans' faith in institutions has been sliding for years. The chaos in Congress isn't helping",
      "url": "https://apnews.com/e9fdce2be173b3f984d60a794d008969",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99635140975b48a1af09fe88f6efaf98/3000.jpeg"
    },
    {
      "author": "NEBI QENA",
      "description": "KYIV, Ukraine (AP) — At least three civilians were killed and others wounded in Ukraine on Friday and Saturday, as Russian forces continued to shell areas across the country and pushed forward near an embattled eastern city, local Ukrainian officials reported Saturday.",
      "publishedAt": "2023-10-21T10:41:04Z",
      "title": "Russian forces make renewed push to take eastern Ukraine towns with drones, missiles and mortars",
      "url": "https://apnews.com/ac5dc7fd66b340a42209a350892963b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ff73730df444bcc99c1880ff53d70b0/3000.jpeg"
    },
    {
      "author": null,
      "description": "DETROIT (AP) — A Detroit synagogue president was found stabbed to death outside her home Saturday, police said. The motive wasn't known.Emergency medical personnel declared the woman, identified in a statement from Mayor Mike Duggan as Samantha Woll, dead at the scene, Cpl.",
      "publishedAt": "2023-10-21T21:22:20Z",
      "title": "A Detroit synagogue president was fatally stabbed outside her home. Police don't have a motive",
      "url": "https://apnews.com/7dc906b1a88f146e292051c6248c2b73",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b803ef90c904946a3d4f9edfb0f9891/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — It was a bad place to keep a secret.When Republicans gathered on Dec. 14, 2020, claiming to be legitimate electors casting the state's 16 electoral votes for Donald Trump, they met at the Georgia Capitol in a room just upstairs from the building's public entrance.",
      "publishedAt": "2023-10-21T04:13:05Z",
      "title": "Inside the meeting of Republican electors who sought to thwart Biden's election win in Georgia",
      "url": "https://apnews.com/205d1fc6a02e1225c8c51214980a1232",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e42acb0121a4f05b7d6991ca477d37f/1920.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "TIJUANA, Mexico (AP) — Night after night for six weeks, Erika Hernández knelt outside her home in central Mexico and prayed: “Please, God, don’t let my son turn into a criminal.”“I prayed a lot.",
      "publishedAt": "2023-10-21T12:17:03Z",
      "title": "Violence forced them to flee. Now faith sustains these migrants on their journey to the US",
      "url": "https://apnews.com/5ac4b5823ec2455a74d0665a61c9ff8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7bd7b153e174541994cd4ceafa51427/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Charles Nahale spent a restless night trying to sleep in the back seat of his pickup truck after a wildfire destroyed his home and the town of Lahaina. The next two nights weren’t much better: The singer and guitarist put his feet on one chair and sat in another as he took refuge on the grounds of an evacuated hotel where he once performed for guests.",
      "publishedAt": "2023-10-21T04:05:12Z",
      "title": "Evacuees live nomadic life after Maui wildfire as housing shortage intensifies and tourists return",
      "url": "https://apnews.com/5a43b95a20e17dd3679c6ebc580994c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20d0e9b11db740cfb2ef2f5651d189ed/3000.jpeg"
    },
    {
      "author": "IGNACIO MARTÍNEZ and FERNANDO LLANO",
      "description": "CABO SAN LUCAS, Mexico (AP) — Hurricane Norma came ashore near the resorts of Los Cabos at the southern tip of Mexico’s Baja California Peninsula on Saturday afternoon, and hours later Hurricane Tammy made landfall on the Caribbean island of Barbuda.",
      "publishedAt": "2023-10-21T04:08:19Z",
      "title": "Hurricane Norma makes landfall near Mexico's Los Cabos and Tammy hits tiny Barbuda in the Caribbean",
      "url": "https://apnews.com/9b11493c4cbbd58d2426b8d0e9d24ded",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/004c1dd10507497eaff39b7e6e791dd1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}