{
  "articles": [
    {
      "author": "JEFF AMY, ERIK VERDUZCO and BRITTANY PETERSON",
      "description": "BLACK MOUNTAIN, N.C. (AP) — Sarah Vekasi is a potter who runs a store in Black Mountain, North Carolina, called Sarah Sunshine Pottery, named after her normally bubbly personality. But these days she’s struggling with the trauma of Hurricane Helene and uncertainty about the future of her business.",
      "publishedAt": "2024-10-03T04:16:47Z",
      "title": "Human connections bring hope in North Carolina after devastation of Helene",
      "url": "https://apnews.com/64fe5ca1b80f22fd2fd3b7c50b291d85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a9144e3288646629796c4b7de0d32e6/1920.jpeg"
    },
    {
      "author": "FADI TAWIL and JACK JEFFERY",
      "description": "BEIRUT (AP) — The Israeli military on Thursday warned people to evacuate a city and other communities in southern Lebanon that are north of a U.N.-declared buffer zone, signaling that it may widen a ground operation launched earlier this week against the Hezbollah militant group.",
      "publishedAt": "2024-10-03T08:57:22Z",
      "title": "Israel extends evacuation warnings in Lebanon, signaling a wider offensive",
      "url": "https://apnews.com/5fad98f56ebcc7e1751388b608c7c8dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a49d16628fc466f8156d509039d1c91/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The devastation wrought by Hurricane Helene has brought climate change to the forefront of the presidential campaign after the issue lingered on the margins for months.",
      "publishedAt": "2024-10-03T04:03:38Z",
      "title": "Hurricane Helene brings climate change to forefront of the presidential campaign",
      "url": "https://apnews.com/e1023e209548db8ec587115505c9797f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa13ddecab9488ab9d52ca3245ef12f/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Liz Cheney, one of Donald Trump’s fiercest Republican antagonists, will join Democrat Kamala Harris at a campaign event in Wisconsin on Thursday aimed at reaching out to moderate voters and rattling the former president.",
      "publishedAt": "2024-10-03T09:02:03Z",
      "title": "Liz Cheney will campaign with Harris in Wisconsin while Trump holds a rally in Michigan",
      "url": "https://apnews.com/89396853e5521c3870a3c88e04cbfd99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be09976ba33d48e9b9026e3be68155e4/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and “resorted to crimes” in his failed bid to cling to power, according to a court filing unsealed Wednesday that offers new evidence from the landmark criminal case against the former president.",
      "publishedAt": "2024-10-02T19:53:53Z",
      "title": "Prosecutors lay out new evidence in Trump election case, accuse him of having 'resorted to crimes'",
      "url": "https://apnews.com/0b9969b480036bb1f7c61a73980d406c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aebce365f3764a0eb2a53dca322b8d78/3000.jpeg"
    },
    {
      "author": "MAE ANDERSON and ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — U.S. ports from Maine to Texas shut down this week when the union representing about 45,000 dockworkers went on strike for the first time since 1977.",
      "publishedAt": "2024-10-03T16:47:56Z",
      "title": "The US could see shortages and higher retail prices if a dockworkers strike drags on",
      "url": "https://apnews.com/c195bedec63d41afcec3c942ebb27e93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ae0e047129a4685ac564b82c642018a/1920.jpeg"
    },
    {
      "author": "ADRIAN SAINZ",
      "description": "MEMPHIS, Tenn. (AP) — The future of three former Memphis officers charged with violating Tyre Nichols' civil rights in a beating that proved fatal is in the hands of a jury after a nearly monthlong federal trial.",
      "publishedAt": "2024-10-03T15:23:36Z",
      "title": "Jury mulling fate of 3 former Memphis officers charged in Tyre Nichols' fatal beating",
      "url": "https://apnews.com/5e19e800cd5017c89cb652cfc8235ea2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05367c7ccf884b9c87e696ec9816bacd/3000.jpeg"
    },
    {
      "author": "RUTH ALONGA and JEAN-YVES KAMALE",
      "description": "GOMA, Congo (AP) — A boat carrying scores of passengers capsized on Lake Kivu in eastern Congo on Thursday, killing at least 50 people, witnesses told The Associated Press.",
      "publishedAt": "2024-10-03T12:42:09Z",
      "title": "Boat capsizes on a lake in eastern Congo, killing at least 50 people, witnesses say",
      "url": "https://apnews.com/1a4cb5013e7cfcc0c77de62e9c93936e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fac6c66969a447468b8d6db2cf0ed6ec/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "KAOHSIUNG, Taiwan (AP) — Typhoon Krathon made landfall Thursday in Taiwan's major port city of Kaohsiung, bringing torrential rains and fierce winds to the island's south. Trees were brought down by high winds and roads were flooded, prompting the closure of schools and businesses.",
      "publishedAt": "2024-10-03T00:57:36Z",
      "title": "Typhoon Krathon makes landfall in Taiwan, packing fierce winds and torrential rain",
      "url": "https://apnews.com/e4acaaf0fbf22779c1f0124ee2f2712b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b19030883842456da3e99ca174998571/1920.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "NEW YORK (AP) — For years, the Grammy Awards have been criticized over a lack of diversity — artists of color and women left out of top prizes; rap and contemporary R&amp;B stars ignored — a reflection of the Recording Academy's electorate.",
      "publishedAt": "2024-10-03T15:02:51Z",
      "title": "The Grammys' voting body is more diverse, with 66% new members. What does it mean for the awards?",
      "url": "https://apnews.com/c8f6d88c3821bb54efdb04fe1a3650b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1c6e0d8679f4d71add838676eaa8ec9/2711.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}