{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Donald Trump's defense attorney says the former president never asked Mike Pence to overturn the will of the voters in the 2020 election, but only wanted the former vice president to “pause” the certification of votes to allow states to investigate his claims of election fraud.",
      "publishedAt": "2023-08-06T17:07:23Z",
      "title": "Pence, Trump attorney clash over what Trump told his VP ahead of Jan. 6, 2021",
      "url": "https://apnews.com/ca1f049328ad8f240c6bf72cce97026e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f160755b23784f1b9b27d5b06bae9cc9/3000.jpeg"
    },
    {
      "author": null,
      "description": "CABAZON, Calif. (AP) — Three people were killed after two firefighting helicopters collided in Southern California on Sunday while fighting a blaze in Riverside County, emergency officials said.One of the helicopters landed safely.",
      "publishedAt": "2023-08-07T05:01:41Z",
      "title": "3 killed after firefighting helicopters collide in midair in Southern California, officials say",
      "url": "https://apnews.com/10d52bcc63b4ab6cc9c8d6285b65d322",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53c545c76a51407cac219039318677cb/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea will evacuate tens of thousands of scouts by bus from a coastal jamboree site as Tropical Storm Khanun looms, officials said Monday.More than 1,000 vehicles will be used starting Tuesday morning to move 36,000 scouts — mostly teenagers — from the World Scout Jamboree in the southwestern county of Buan, according to Kim Sung-ho, a vice minister at South Korea’s Ministry of the Interior and Safety.",
      "publishedAt": "2023-08-07T05:42:23Z",
      "title": "Tens of thousands of young scouts to evacuate world jamboree in South Korea as storm Khanun looms",
      "url": "https://apnews.com/3427a308cbca3c573bcffc9d3e0cdc8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcc98edf3e3144dd89cf748e06e11460/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Niger’s mutinous soldiers closed the country’s airspace and accused foreign powers of preparing an attack, as the junta defied a deadline to reinstate the ousted president.",
      "publishedAt": "2023-08-07T06:33:54Z",
      "title": "Niger’s junta shuts airspace and accuses regional countries of planning to invade as deadline passes",
      "url": "https://apnews.com/6cc3fa0b61adc6d9bcb2fb9745c4dcdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daad7900ac6649a7935dd0b354b8a544/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — The last former Minneapolis police officer to face sentencing in state court for his role in the killing of George Floyd will learn Monday whether he will spend additional time in prison.",
      "publishedAt": "2023-08-07T04:47:01Z",
      "title": "Ex-Minneapolis officer faces sentencing on a state charge for his role in George Floyd's killing",
      "url": "https://apnews.com/586deaeb4d14807ef3f2bdd0196d0b86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cd4ad9bada747cf96481c2e91cf776d/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "Word spread through an Oregon hospital last month that a visitor was causing trouble in the maternity ward, and nurses were warned the man might try to abduct his partner's newborn.Hours later, the visitor opened fire, killing a security guard and sending patients, nurses and doctors scrambling for cover.",
      "publishedAt": "2023-08-07T04:22:13Z",
      "title": "Attacks at US medical centers show why health care is one of the nation's most violent fields",
      "url": "https://apnews.com/aa6918569ff8f76ff8a15b9813e31686",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/762ff4c332a1461faec143ceaf8d1cfb/3000.jpeg"
    },
    {
      "author": null,
      "description": "LOWER PAXTON TOWNSHIP, Pa. (AP) — A charter bus carrying up to 50 people collided with a vehicle on an interstate in Pennsylvania killing three people, state police said.The crash happened during heavy rain around 11:50 p.m.",
      "publishedAt": "2023-08-07T10:43:21Z",
      "title": "3 passengers dead after charter bus crashes in Pennsylvania, state police say",
      "url": "https://apnews.com/cb01e4aee7e992ace8b578c6b1296602",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fce1f609a59469b9d02d5931d1f50e0/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — His social media accounts suggest that Prime Minister Narendra Modi is launching high-speed trains and rubbing shoulders with foreign leaders as a powerhouse on the global stage and the face of an ascendant India.",
      "publishedAt": "2023-08-07T04:13:22Z",
      "title": "India's Modi faces a no-confidence vote over silence on ethnic violence tearing at remote Manipur",
      "url": "https://apnews.com/0477352c82171e79137066169c033e36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c66d10d3a574df88cb2032f45efa742/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ABOARD THE PAPAL PLANE (AP) — Pope Francis said Sunday his recovery from his latest abdominal surgery is going well and stressed that he ditched speeches during his five-day trip to Portugal and spoke off-the-cuff not because he was tired or feeling unwell, but to better communicate with young people.",
      "publishedAt": "2023-08-06T20:51:45Z",
      "title": "Pope discusses health, his ditched peace prayer in Fatima and LGBTQ+ Catholics in airborne briefing",
      "url": "https://apnews.com/b72bb8a3ce41ef6e5ab8e045dbd63930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e5f2e2fc21f46f8b2eb286d1454d0f8/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}