{
  "articles": [
    {
      "author": "SETH BORENSTEIN",
      "description": "The fingerprints of climate change are all over the intense heat waves gripping the globe this month, a new study finds. Researchers say the deadly hot spells in the American Southwest and Southern Europe could not have happened without the continuing buildup of warming gases in the air.",
      "publishedAt": "2023-07-25T05:05:02Z",
      "title": "Study finds climate change fingerprints on July heat waves in Europe, China and America",
      "url": "https://apnews.com/4c361736afa70766049acdb189ccfd64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15b043d607f1420ba832a7c72c2fcecf/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and LORI HINNANT",
      "description": "ODESA, Ukraine (AP) — Tetiana Khlapova's hand trembled as she recorded the wreckage of Odesa’s devastated Transfiguration Cathedral on her cellphone and cursed Russia, her native land.",
      "publishedAt": "2023-07-25T06:06:59Z",
      "title": "Anger grows in Ukraine's port city of Odesa after Russian bombardment hits beloved historic sites",
      "url": "https://apnews.com/055bd34b40ba271e89084fda83c34fb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5239439b7191470e973543fbf1b7d6f5/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and VALERIE GONZALEZ",
      "description": "AUSTIN, Texas (AP) — The Justice Department on Monday sued Texas Gov. Greg Abbott over a newly installed floating barrier on the Rio Grande that is the Republican's latest aggressive tactic to try to stop migrants from crossing into the U.S.",
      "publishedAt": "2023-07-24T20:05:01Z",
      "title": "Biden administration sues Texas governor over Rio Grande buoy barrier that’s meant to stop migrants",
      "url": "https://apnews.com/83bcb38e7f5ab613117634d0c439d6b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1e611d0e1f54050b858071ee77dc330/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — For seven months, tens of thousands of Israelis have taken to the streets to protest Prime Minister Benjamin Netanyahu's plans to overhaul the judiciary and weaken the Supreme Court.",
      "publishedAt": "2023-07-22T09:04:41Z",
      "title": "Why is Israel's judicial overhaul so divisive?",
      "url": "https://apnews.com/282e2cd18a2340a067625e148ebda41c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2242bf8ef04a3ab3315a969e0e6d36/3000.jpeg"
    },
    {
      "author": null,
      "description": "ALGIERS, Algeria (AP) — Wildfires raging across Algeria have killed 25 people, including 10 soldiers trying to get the flames under control in the face of high winds and scorching summer temperatures, government ministries said Monday.",
      "publishedAt": "2023-07-24T16:17:54Z",
      "title": "Wildfires across Algeria have killed 25 people, including 10 soldiers who were battling the flames",
      "url": "https://apnews.com/c6a720916c09f5ca2ebd5d4e9258352f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/107351935d9e4626ba428e427462f480/1698.jpeg"
    },
    {
      "author": "MIKE CATALINI and CLAUDIA LAUER",
      "description": "Pamela White stared at the silver tree with twinkling lights while she cleaned out her son’s apartment, wondering how in a matter of days she went from celebrating Christmas to having to think about headstones and burial plots.",
      "publishedAt": "2023-07-25T04:06:35Z",
      "title": "Safety net with holes? Programs to help crime victims can leave them fronting bills",
      "url": "https://apnews.com/745985a4798e93f62951b51185b4d5cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9fa8389e20d484a89e2ec6f6d380682/3000.jpeg"
    },
    {
      "author": "AARON MORRISON",
      "description": "When President Joe Biden signs a proclamation on Tuesday establishing a national monument honoring Emmett Till and his mother, Mamie Till-Mobley, it will mark the fulfillment of a promise Till’s relatives made after his death 68 years ago.",
      "publishedAt": "2023-07-25T04:04:50Z",
      "title": "For Emmett Till's family, national monument proclamation cements his inclusion in the American story",
      "url": "https://apnews.com/7c9c5e6b7ce18c9180f943b512bb4032",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d631ce35bb74829bc8928f133d10fe1/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese police said they arrested a woman and her parents in a beheading case in a popular night entertainment district in Japan's northern city of Sapporo, where a headless man was found in a hotel room three weeks ago.",
      "publishedAt": "2023-07-25T04:30:15Z",
      "title": "Japan police arrest woman, parents in beheading of man at hotel in Hokkaido entertainment district",
      "url": "https://apnews.com/50d27dcc35191cd753d1116d0857687a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/953564383fc247d986d1b19e5b338bf6/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BURG, Germany (AP) — Two teachers in eastern Germany tried to counter the far-right activities of students at their small town high school. They counseled bullies who threatened to beat up immigrant classmates.",
      "publishedAt": "2023-07-25T05:59:53Z",
      "title": "Two teachers called out far-right activities at their German school. Then they had to leave town.",
      "url": "https://apnews.com/23117cba33831f38da80055478d1264c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14d468979472468c8f40ad141412e731/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — For the mayor of Paris, the city's journey to next year's Olympic Games included an epiphany born of brutality: the slaughter of 17 people by gunmen acting in the names of al-Qaida and the Islamic State group.",
      "publishedAt": "2023-07-25T05:02:51Z",
      "title": "Extremist attacks wounded Paris. Here's why the city turned to the 2024 Olympics to heal",
      "url": "https://apnews.com/b1082a0ec16747bec10bd8a9dfab544e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03312129c94f41738cd83df079408b7f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}