{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JOSEF FEDERMAN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces rescued two hostages early Monday, storming a heavily guarded apartment in a densely packed town in the Gaza Strip and extracting them under fire.",
      "publishedAt": "2024-02-12T02:48:20Z",
      "title": "Israeli forces rescue 2 hostages in dramatic Gaza raid that killed at least 67 Palestinians",
      "url": "https://apnews.com/4ade5edf47711c6b0c13d1380980de2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0dd8df4bec4482996c90e1e609a24d1/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — It was a warm handshake between the unlikeliest of statesmen, conducted under the beaming gaze of U.S. President Jimmy Carter. Sunlight streamed through the trees at Camp David, Maryland, as Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin solidified a landmark agreement that has allowed over 40 years of peace between Israel and Egypt.",
      "publishedAt": "2024-02-12T05:52:40Z",
      "title": "Egypt is threatening to void its decades-old peace treaty with Israel. What does that mean?",
      "url": "https://apnews.com/46df917a975ed4c4f88d5de01a8508e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8df9d105a164e8a8d1e1d4991e8d933/2994.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Former President Donald Trump faces a Monday deadline for asking the Supreme Court to extend the delay in his trial on charges he plotted to overturn his 2020 election loss.",
      "publishedAt": "2024-02-12T13:21:06Z",
      "title": "Trump faces Monday deadline to ask the Supreme Court for a delay in his election interference trial",
      "url": "https://apnews.com/60bd61263299a88e48d4005d70b6094f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d072711d824b08b562f6bfcbc4c7fb/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Donald Trump, the front-runner for the Republican Party's nomination this year, says he once warned that he would allow Russia to do whatever it wants to NATO member nations that are “delinquent” in devoting 2% of their gross domestic product to defense.",
      "publishedAt": "2024-02-12T16:16:42Z",
      "title": "How Trump urging Russia to invade 'delinquent' NATO members distorts how the alliance works",
      "url": "https://apnews.com/c1f7de696ff6ca06e4088f49b93122e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62436147b61246d798c6984dc17ff6ff/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Robert Kennedy Jr.’s presidential ambitions resulted in public family drama after a political action committee aired a Super Bowl ad invoking the Democratic family’s legacy to implicitly compare the independent candidate to his assassinated uncle, President John F.",
      "publishedAt": "2024-02-12T15:01:18Z",
      "title": "Super Bowl ad for RFK Jr. stirs Democratic and family tension over his independent White House bid",
      "url": "https://apnews.com/e4dee4be456e643be11735c6e4029377",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c953f716f46c4ed5b6ff0cb7350806c0/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — The weekend shooting at Joel Osteen's megachurch in Houston is not the first time gunfire has caused panic and tragedy at a Texas house of worship.",
      "publishedAt": "2024-02-12T16:31:50Z",
      "title": "A shooter opened fire in a Houston church. Gunfire has also scarred other Texas places of worship",
      "url": "https://apnews.com/f0093f52f44b4ebd780ebf725199a457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3222e19bcd84d8e93a42570506fce5e/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is hosting Jordan’s King Abdullah II in Washington Monday and the two leaders are expected to discuss the ongoing effort to free hostages held in Gaza, and growing concern over a possible Israeli military operation in the border city of Rafah.",
      "publishedAt": "2024-02-12T05:10:57Z",
      "title": "Biden welcomes the King of Jordan as framework for hostage deal is decided in Israel-Hamas conflict",
      "url": "https://apnews.com/993c8109fca1c77383e7c27a8136927f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6a110bf4df4418c91e8ee19dc04f46b/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET and FABIANO MAISONNAVE",
      "description": "RIO DE JANEIRO (AP) — Carnival dancers took the biggest stage in Rio de Janeiro on Sunday night with their faces painted red in a traditional Indigenous manner, while percussionists had “Miners out” written across the skins of their drums.",
      "publishedAt": "2024-02-12T05:02:09Z",
      "title": "Rio's Carnival parade makes urgent plea to stop illegal mining in Indigenous lands",
      "url": "https://apnews.com/9dd984103c45e07993b3cbd6108ea344",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07d76fb411d54199a2221b7eca9a39c9/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET and VANESSA GERA",
      "description": "PARIS (AP) — Polish Prime Minister Donald Tusk vowed to “revitalize” his nation's relations with its key European partners during a trip to Paris and Berlin on Monday as fears grow that former President Donald Trump could return to power in the United States and give Russia a free hand to expand its aggression following its invasion of Ukraine.",
      "publishedAt": "2024-02-12T11:18:44Z",
      "title": "Poland's Tusk heads to France, Germany to strengthen alliance as fears grow over Russia and Trump",
      "url": "https://apnews.com/f40604859d6efba833a6895dcc95bffe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf8a0b10abf9404eb1ced1523112669d/3000.jpeg"
    },
    {
      "author": "NOAH TRISTER",
      "description": "LAS VEGAS (AP) — The Kansas City Chiefs beat the San Francisco 49ers 25-22 in overtime in a Super Bowl unlike any other.",
      "publishedAt": "2024-02-12T11:00:39Z",
      "title": "Mahomes, the Chiefs, Taylor Swift and a thrilling game. It all came together at the Super Bowl",
      "url": "https://apnews.com/14ec9984e04cb9906a29dd1db52315d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bd2666650d84e2cb0339335e7df009e/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}