{
  "articles": [
    {
      "author": "MSTYSLAV CHERNOV and LORI HINNANT",
      "description": "ANDRIIVKA, Ukraine (AP) — The Russian bullet struck the sergeant just above the left ear. The leader of the Ukrainian platoon was down. Headquarters radioed a battlefield promotion to the private who had called him “brother” — a man known as Courier.",
      "publishedAt": "2023-09-21T04:01:26Z",
      "title": "Inside a Ukrainian brigade’s battle ‘through hell’ to reclaim a village on the way to Bakhmut",
      "url": "https://apnews.com/684873be8aad1b1502ff8d67ea48afac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbc04b834bf6473b9cd10be987989fb8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Representatives from Nagorno-Karabakh and the Azerbaijan government met for talks Thursday to discuss the future of the breakaway region that Azerbaijan claims to fully control following a military offensive this week.",
      "publishedAt": "2023-09-21T08:45:12Z",
      "title": "Talks held on the future of Nagorno-Karabakh as Azerbaijan claims full control of the region",
      "url": "https://apnews.com/2964483a95121dfdccd0e6e4d220fb12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d50434c5f3334774a8cb4c1fab1a417c/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and ELLIOT SPAGAT",
      "description": "WASHINGTON (AP) — The Biden administration says it's granting temporary legal status to hundreds of thousands of Venezuelans who are already in the country — quickly making them eligible to work — as it grapples with growing numbers of people fleeing the South American country and elsewhere to arrive at the U.S.-Mexico border.",
      "publishedAt": "2023-09-21T00:23:37Z",
      "title": "The US is allowing hundreds of thousands of Venezuelans in the country to work legally",
      "url": "https://apnews.com/b914be14aaeef14eb01bd10ee23067f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033a90e3a26f45c5a240204346b40eca/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "HUEHUETOCA, Mexico (AP) — Thousands of migrants riding atop railway cars in Mexico this week or waiting in mile-long lines by the tracks to hitch a ride to the U.S. have triggered the closure of one U.S.",
      "publishedAt": "2023-09-21T04:08:04Z",
      "title": "Wave of migrants that halted trains in Mexico started with migrant smuggling industry in Darien Gap",
      "url": "https://apnews.com/7fa1f413f816d036ed06f0ef7c5d05b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e62f0615c6f44e789cd4ce5ab7a293c2/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India’s visa processing center in Canada suspended services Thursday as a rift widened between the countries after Canada’s leader said India may have been involved in the killing of a Canadian citizen.",
      "publishedAt": "2023-09-21T08:30:42Z",
      "title": "India suspends visa services in Canada and rift widens over killing of Canadian citizen",
      "url": "https://apnews.com/381e973e84f8d0c10b0bd53b03ccbdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e898214bf692424685c6851fa9a9e98d/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "UNITED NATIONS (AP) — Work together. Go it alone. The apocalypse is at hand. But the future can be bright. The squabbles never cease, yet here are human beings from all across the world — hashing out conflicts with words and processes, convening under one roof, trying to write the next chapter of a common dream.",
      "publishedAt": "2023-09-20T22:42:30Z",
      "title": "Behind all the speechmaking at the UN lies a basic, unspoken question: Is the world governable?",
      "url": "https://apnews.com/08c1edb481c05dbb0a454ae5a3cbbb3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e6da452a9924acba5e7bcf40e251d27/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "HARDIN, Mont. (AP) — Yolanda Fraser is back near a ragged chain-link fence, blinking through tears as she tidies up flowers and ribbons and a pinwheel twirls in the breeze at a makeshift roadside memorial in a small Montana town.",
      "publishedAt": "2023-09-21T04:05:02Z",
      "title": "A grandmother seeks justice for Native Americans after thousands of unsolved deaths, disappearances",
      "url": "https://apnews.com/a9155ee50f769976c716a729ceb29e65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c380816546a49ea84b8a04776a8ee61/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "BRIGHTON, Colo. (AP) — Two Denver-area police officers who put Elijah McClain in a neck hold ignored his pleas of “I can’t breathe” before the Black man was injected by paramedics with a powerful sedative and died, prosecutors said Wednesday, as a trial began over the 2019 confrontation that became a rallying cry for protests and spurred police reform.",
      "publishedAt": "2023-09-20T06:03:59Z",
      "title": "Officers who put Elijah McClain in neck hold ignored pleas of 'I can't breathe,' prosecutors say",
      "url": "https://apnews.com/9f976b1e4b9ae52bf824ae5b68ba6fb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6b67794253a4d4bbcda0690e35db3a3/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — More than 15,000 people in Arizona have registered to join a new political party floating a possible bipartisan “unity ticket” against Joe Biden and Donald Trump.",
      "publishedAt": "2023-09-21T04:06:37Z",
      "title": "No Labels push in closely divided Arizona fuels Democratic anxiety about a Biden spoiler",
      "url": "https://apnews.com/91dd36375a83a67f8969af8ac511fbf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9423d40980274d45bfd3a4a569ae9f51/2892.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "General Motors and Stellantis announced fresh layoffs Wednesday that they blamed on damage from the United Auto Workers strike, and the labor standoff grew more tense just two days before the union was expected to call for new walkouts.",
      "publishedAt": "2023-09-20T18:13:32Z",
      "title": "Jeep maker Stellantis makes a new contract offer as auto workers prepare to expand their strike",
      "url": "https://apnews.com/dce8eb39a1e36f2cc54a5c1e4210e1f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb209b158cb0473292913b0e59ac19f7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}