{
  "articles": [
    {
      "author": "Hanna Arhirova, Michelle L. Price",
      "description": "President Donald Trump said Russian President Vladimir Putin told him “very strongly” in a phone call Wednesday that he will respond to Ukraine’s weekend drone attack on Russian airfields. The president said in a social media post that “It was a good conversation, but not a conversation that will lead to immediate Peace.” The call that lasted for an hour and 15 minutes was Trump’s first known with Putin since May 19. Trump said he and Putin also discussed Iran’s nuclear program.",
      "publishedAt": "2025-06-04T14:30:58Z",
      "title": "Trump says Putin told him that Russia will respond to Ukrainian attack",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-truce-peace-b211da51905cd117b913bc0fac658de3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c85c3e/2147483647/strip/true/crop/8214x4620+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Ff2%2Fc2b54242de9431efbebeb6b743a4%2F5e233c2ecc9c496ca2f9091939454b46"
    },
    {
      "author": "Lisa Mascaro",
      "description": "President Donald Trump’s big bill will cut taxes by $3.75 trillion but increase deficits by $2.4 trillion and leave 10.9 million more people without health insurance over the next decade. That’s according to an analysis released Wednesday by the nonpartisan Congressional Budget Office. The analysis comes as the Republican president is pushing to have the final product on his desk by July Fourth. The CBO's findings will be weighed by lawmakers and others seeking to understand the budgetary impacts of the sprawling bill. The White House and Republican leaders have been sowing doubt on the CBO’s work. Democrats say Republicans explode the debt when they’re in power.",
      "publishedAt": "2025-06-04T14:17:51Z",
      "title": "Trump bill will cut taxes by $3.7T and add $2.4T to deficit, CBO says",
      "url": "https://apnews.com/article/cbo-deficits-tax-cuts-trumps-big-beautiful-bill-64d7de49aef62ba07b7f6f45c1ca73d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/da9e696/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F66%2Fe206866f3d1597fab05ad236cbe6%2Ff0cf144f464b4a42821ae8a5d4cb7e23"
    },
    {
      "author": "Kevin Freking",
      "description": "A small, government office with some 275 employees has found itself caught in the political crossfire as Congress debates President Donald Trump’s “one big beautiful bill.” The Congressional Budget Office has projected that the legislation would increase federal deficits by about $2.4 trillion over 10 years. That’s a problem for a Republican Congress that has spent much of the past four years criticizing Joe Biden and Democrats for the nation’s rising debt levels. The White House and Republican leaders in Congress are taking issue with CBO’s findings. Meanwhile, Democrats are touting CBO’s findings as evidence of the bill’s failings.",
      "publishedAt": "2025-06-04T17:00:59Z",
      "title": "What is the CBO? A look at the small office that scored Trump's tax bill",
      "url": "https://apnews.com/article/cbo-big-beautiful-bill-trump-republican-deficit-debt-d432b67a965790e4a26de46ea8db1266",
      "urlToImage": "https://dims.apnews.com/dims4/default/da9e696/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F66%2Fe206866f3d1597fab05ad236cbe6%2Ff0cf144f464b4a42821ae8a5d4cb7e23"
    },
    {
      "author": "Wafaa Shurafa",
      "description": "An Israeli- and U.S.-backed group has temporarily paused food delivery at its three distribution sites in Gaza. That came after health officials said dozens of Palestinians were killed in a series of shootings near the sites this week. Separately, officials said Israeli strikes across the territory killed 26 people overnight and into Wednesday. The Gaza Humanitarian Foundation said it was in discussions with the Israeli military on better guiding foot traffic near its distribution sites and enhancing military procedures. Gaza health officials, the Red Cross and the U.N. rights office said 27 people were killed Tuesday. Witnesses blamed Israeli forces. Israel’s military said it fired near people it described as suspects and that it is looking into reports of casualties.",
      "publishedAt": "2025-06-04T11:37:35Z",
      "title": "Gaza Humanitarian Foundation pauses food delivery after deadly shootings",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-04-2025-37dff186f63d8395f204792aba27b09a",
      "urlToImage": "https://dims.apnews.com/dims4/default/c08a010/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2Fa2%2F1caba6119df6f970178016c1b56c%2F231d0b96d6da4f1792c7fb398c44f83c"
    },
    {
      "author": "Aijaz Rahi",
      "description": "Several people are feared dead and many more injured in a stampede outside a cricket stadium in southern India. The crush on Wednesday happened as thousands of cricket fans gathered outside the M. Chinnaswamy Stadium in Bengaluru city to celebrate the winners of the Indian Premier League. That's the world’s most popular T20 cricket tournament. Local television news channels showed some people stretched out on the ground and emergency personnel carrying people away on stretchers and into ambulances. Indian authorities didn't immediately confirm the number of deaths.",
      "publishedAt": "2025-06-04T12:24:21Z",
      "title": "Several feared dead in stampede outside M. Chinnaswamy Stadium",
      "url": "https://apnews.com/article/india-cricket-stadium-stampede-casualties-4b568af6dd17b9387f4ffad02ace9caf",
      "urlToImage": "https://dims.apnews.com/dims4/default/2817fab/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2Fa1%2Fc7eb311e84bc50f6a024605eb22a%2F82f2c31b10f844edb2b1f27115336ef7"
    },
    {
      "author": "Eric Tucker, Jaimie Ding, Jake Offenhartz",
      "description": "Federal authorities say a Washington man provided chemicals to make explosives that were used to bomb a California fertility clinic in May. Authorities arrested 32-year-old Daniel Park on Tuesday night in New York upon his return from Poland. U.S. Attorney Bill Essayli say Park shipped 180 pounds of ammonium nitrate to Guy Edward Bartkus, who bombed the clinic. The chemical compound is an explosive precursor that can be used to make homemade bombs, Essayli said. Park also traveled to Southern California in late January to stay with Bartkus for about two weeks, Essayli said. Bartkus was killed in the explosion.",
      "publishedAt": "2025-06-04T14:21:17Z",
      "title": "A man is arrested over links to the Palm Springs fertility clinic bombing",
      "url": "https://apnews.com/article/palm-springs-fertility-clinic-explosion-suspect-arrested-acacf4e610f8610bfe296bd2ab6f25b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d8b48c/2147483647/strip/true/crop/3426x1927+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F9f%2F9f87d7ab2a88f71b045f34b85027%2Fc97b3bd9f3e34d2cb1c2ec6b7b94100c"
    },
    {
      "author": "By Catherine Gaschka, Sam McNeil, Paul Wiseman",
      "description": "Europe and the United States are meeting in Paris to negotiate a settlement of a tense tariff spat with global economic ramifications between two global economic powerhouses. European Union top trade negotiator Maroš Šefčovič met Wednesday with U.S. Trade Representative Jamieson Greer on the sidelines of a meeting of the Organization for Economic Cooperation and Development. Šefčovič says in a post on X that the sides are “advancing in the right direction at pace” and staying in close contact. Brussels and Washington are unlikely to reach a substantive trade agreement in Paris. The issues dividing them are too difficult to resolve quickly.",
      "publishedAt": "2025-06-04T09:56:00Z",
      "title": "EU and US negotiators meet in Paris for tariff talks",
      "url": "https://apnews.com/article/eu-tariffs-negotiators-sefcovic-greer-b03672b645df0d63765484391a3d2631",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc67546/2147483647/strip/true/crop/6000x3375+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2F71%2F4c3466ff22f6062bb6bb4350e1aa%2Fc1c2a331bdb04047923de6b77422e832"
    },
    {
      "author": "Charlotte Graham-McLay",
      "description": "An Australian woman on trial for the triple murder of her estranged husband's relatives and the attempted murder of another has told the Supreme Court in the state of Victoria that she carefully planned the July 2023 lunch where her dinner guests were poisoned with death cap mushrooms. Three of the four died in hospital. Erin Patterson denies the charges against her but she accepts that the beef Wellington meal she served contained the poisonous mushrooms. Prosecutors say the poisoning was deliberate but the defense says it was a tragic accident. Patterson faces life in prison if convicted. The trial is to continue on Thursday.",
      "publishedAt": "2025-06-04T10:22:41Z",
      "title": "Australian woman on trial for mushroom murder of in-laws says she was trying to fix a 'bland' lunch",
      "url": "https://apnews.com/article/australia-mushroom-trial-erin-patterson-wilkinson-60b08cdcc496032499ec9676681289a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/bfa3b92/2147483647/strip/true/crop/3675x2067+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F31%2Faa6d29a661507ea2366335348bf4%2F490b0c58dc26493b9d607af364922edd"
    },
    {
      "author": "Ken Moritsugu, Kanis Leung",
      "description": "For most Chinese, the 36th anniversary of a bloody crackdown that ended pro-democracy protests in China has passed like any other weekday. And that’s just how the ruling Communist Party wants it. Security was tight Wednesday around Beijing’s Tiananmen Square, where weeks of student-led protests shook the party in 1989. Hundreds and possibly thousands of people were killed in a June 4 crackdown. The Communist Party bans any public commemoration of the events. In recent years, that ban has been extended to Hong Kong. It is only in Taiwan that June 4 gatherings can still take place. The self-governing island is claimed by China but runs its own affairs",
      "publishedAt": "2025-06-04T09:08:23Z",
      "title": "China suppresses talk of Tiananmen Square crackdown on anniversary",
      "url": "https://apnews.com/article/china-tiananmen-anniversary-hong-kong-taiwan-451a7dfd09b3662791148999b6007e1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdae146/2147483647/strip/true/crop/3449x1940+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2Fb4%2F335d3368c2fdeef3a0f763aff30c%2Fe9c0b6c44cb14760afa58ed60f0af4c0"
    },
    {
      "author": "Devi Shastri, Nicky Forster",
      "description": "Childhood vaccination rates against measles fell in the years after the COVID-19 pandemic in nearly 80% of the more than 2,000 U.S. counties with available data. That includes counties in states that are battling outbreaks this year. The Johns Hopkins University study was published in JAMA this week. It illustrates where more vulnerable communities are located. The results mirror trends established at state and national levels: Routine childhood vaccination rates are dropping. Most of the measles cases in the U.S. this year — 1,088 nationally as of Friday — are in unvaccinated people. Three people have died.",
      "publishedAt": "2025-06-04T16:01:54Z",
      "title": "Measles vaccine rates drop in hundreds of US counties after pandemic",
      "url": "https://apnews.com/article/measles-vaccine-mmr-covid-exemptions-87cbfe44d8599b68408861f9b62421ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/01e87ec/2147483647/strip/true/crop/2640x1485+0+138/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fb9%2Fc43f1fe19dab7478cb4edbf42265%2F8df6f045c02243d1ad979e3b18a0b52e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}