{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Iran held annual military drills with Russia as a second American aircraft carrier drew closer to the Middle East. Both the United States and Iran are signaling they are prepared for war if talks on Tehran’s nuclear program fizzle out. President Donald Trump said Thursday he believes 10 to 15 days is enough time for Iran to reach a deal. But talks on its nuclear program have been deadlocked for years, and Iran has refused to discuss wider U.S. and Israeli demands that it scale back its missile program and sever ties to armed groups. Indirect talks held in recent weeks made little visible progress, and one or both sides could be buying time for final war preparations.",
      "publishedAt": "2026-02-19T08:04:43Z",
      "title": "Trump warns of 'bad things' if Iran doesn't make a deal",
      "url": "https://apnews.com/article/iran-us-russia-drill-nuclear-talks-aircraft-carrier-0456903e0d7a24cfcdc33d53732dee2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/68fe7c0/2147483647/strip/true/crop/4800x3198+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F97%2F532fc68388db2b374dd03913b6bf%2F25752bd85ebd4e54862d41250c82eb71"
    },
    {
      "author": "Luena Rodriguez-Feo Vileira, Michael Warren, Carley Petesch, Nell Clark",
      "description": "President Donald Trump is hosting dozens of nations that have joined his Board of Peace for an inaugural meeting. Nine nations have pledged $7 billion for Gaza relief.",
      "publishedAt": "2026-02-19T08:05:00Z",
      "title": "Live updates: Trump heads to Georgia after securing Board of Peace pledges for Gaza relief funds",
      "url": "https://apnews.com/live/trump-board-of-peace-georgia-midterms-2-19-2026",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b4febe/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F0b%2F1ff47bad4ce18cf0841779b823c6%2Fap26050615848970.jpg"
    },
    {
      "author": null,
      "description": "The Board of Peace has met for the first time in Washington, bringing officials from nearly 50 countries together. Twenty-seven of the countries have joined the board. The other participating countries — as well as the European Union — came as observers. President Donald Trump opened the meeting on Thursday, announcing that nine members pledged a combined $7 billion toward relief in Gaza. Trump also said five countries have agreed to deploy troops to take part in an international stabilization force to the Palestinian territory that has been battered by the war between Israel and the Palestinian militant Hamas group.",
      "publishedAt": "2026-02-19T16:57:13Z",
      "title": "List of those who attended Trump's first Board of Peace meeting",
      "url": "https://apnews.com/article/trump-board-of-peace-participants-b9b7e438caeca308c153b60c032895b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd45c08/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fd5%2F5872243d721b3902df98754d57be%2F256beca1c4e544c59258e41f7db15a8b"
    },
    {
      "author": "Aamer Madhani, Matthew Lee",
      "description": "President Donald Trump has announced at the inaugural Board of Peace meeting that nine members have agreed to pledge $7 billion toward a Gaza relief package. He also says five countries have agreed to deploy troops as part of an international stabilization force for the war-battered Palestinian territory. While lauding the pledges, Trump faces the unresolved challenge of disarming Hamas, a sticking point that threatens to delay or even derail the Gaza ceasefire plan that his administration notched as a major foreign policy win. The dollars pledged on Thursday, while significant, represent a small fraction of the estimated $70 billion needed to rebuild the Palestinian territory decimated after two years of war between Israel and Hamas.",
      "publishedAt": "2026-02-19T05:03:49Z",
      "title": "Trump secures $7B in pledges for Gaza plus troop commitments from Board of Peace",
      "url": "https://apnews.com/article/trump-board-of-peace-first-meeting-22e587df67e27cd1e1d96e446cb88378",
      "urlToImage": "https://dims.apnews.com/dims4/default/41e4814/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F8c%2Fc5b5f390be2412749b86f2e9efa8%2F1e142bfc1dfe467caedf17b9596c9ef3"
    },
    {
      "author": "Dave Skretta",
      "description": "Alysa Liu won Olympic gold for the U.S. in women’s figure skating, ending a 24-year drought. Liu delivered a near-flawless free skate at the Milan Cortina Games to beat out Kaori Sakamoto and Ami Nakai of Japan on Thursday night. Liu had returned to the sport after stepping away following the Beijing Games. She posted a career-best 226.79 points, while Sakamoto took silver after a mistake. Nakai earned bronze after a slip as well. American teammate Amber Glenn celebrated in the kiss-and-cry area with Liu after Nakai’s score was read. Glenn rebounded from Tuesday’s short program and finished fifth.",
      "publishedAt": "2026-02-19T10:26:43Z",
      "title": "Alysa Liu gives US its first women's figure skating Olympic gold in 24 years",
      "url": "https://apnews.com/article/milan-cortina-olympics-figure-skating-women-437ba97a98c0f43b1317dfc26275b633",
      "urlToImage": "https://dims.apnews.com/dims4/default/0049a3c/2147483647/strip/true/crop/3562x2373+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Ff8%2Fed91f0f1f6a81fbc7413c21a7daf%2Fcc677e98953a415bac6270c8f198e8da"
    },
    {
      "author": "John Wawrow",
      "description": "The United States has won its third Olympic gold medal in women's hockey. Megan Keller backhanded in a shot 4:07 into overtime, and the Americans beat Canada 2-1 at the Milan Cortina Games on Thursday night to close another thrilling chapter of one of sports’ most heated rivalries. American captain Hilary Knight forced overtime by tipping in Laila Edwards’ shot from the blue line with 2:04 remaining. The goal was the 15th of her Olympic career and 33rd point to break the U.S. record in both categories. The U.S. previously won gold at the 1998 Nagano Games, the first to feature women’s hockey, and in 2018 in Pyeongchang.",
      "publishedAt": "2026-02-19T14:14:43Z",
      "title": "US beats Canada 2-1 in overtime to win Olympic women's hockey gold",
      "url": "https://apnews.com/article/us-canada-womens-hockey-olympic-final-141b5904352673676656cbe2a1c253e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/792640e/2147483647/strip/true/crop/4956x3302+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F36%2F2c181746683aebeb569e60432da7%2Fafff1410b18b4eb18b85571805897527"
    },
    {
      "author": "Julia Frankel",
      "description": "If you’ve gotten tired of watching curling, imagine how the athletes feel. By the end of the Milan Cortina Olympic Games, there will have been a total of 147 curling matches crammed into 18 days. In Cortina, curling began on Feb. 4, a full two days before the Opening Ceremonies. It ends Feb. 22, the last day of competition at the Games. Athletes coming off the ice say that this Olympics has left them worn out, physically and mentally. That reflects the near-constant competition schedule that has led to curling’s popular reputation as the Olympic sport that’s always on.",
      "publishedAt": "2026-02-19T17:28:47Z",
      "title": "Curling in the Milan Cortina Olympic Games grows tiring for curlers, mentally and physically",
      "url": "https://apnews.com/article/curling-olympics-cortina-milan-canada-3754a4f00b4ea5415b2fb9a6422f4bcf",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1a012b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F2e%2F8447ce1a73094bf11c5018cb3254%2F98843380395e408ca87c3dced8132e71"
    },
    {
      "author": "Joey Cappelletti, Steven Sloan",
      "description": "The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors. The Republican president is still expected to meet with governors at the White House on Friday but the event won't be facilitated by the governors' group. Trump had refused to include Democratic Jared Polis of Colorado and Wes Moore of Maryland and he recently blasted them on social media as “not worthy of being there.” The episode underscores the confrontational approach Trump has taken during his second term toward state leaders he doesn't like.",
      "publishedAt": "2026-02-19T05:15:03Z",
      "title": "Group backs out after Trump won't invite all governors to the White House",
      "url": "https://apnews.com/article/governors-trump-meeting-counterweight-washington-5e078af4172aba3ea3c734c910e4e0c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/43a78d4/2147483647/strip/true/crop/5603x3733+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F01%2F4d59b39ea23ebf44e89974f57c24%2Fee69369429944fc291dafaa73da95874"
    },
    {
      "author": "Jill Lawless",
      "description": "The former Prince Andrew is the first senior British royal in modern history to be arrested by police. Andrew Mountbatten-Windsor was detained on Thursday on suspicion of misconduct in public office, in an investigation stemming from his relationship with the late sex offender Jeffrey Epstein. He was born in 1960, the third child of Queen Elizabeth II and her husband Prince Philip. He spent 22 years in the Royal Navy, serving as a helicopter pilot during the 1982 Falklands War. Named Britain’s special representative for international trade in 2001, he was forced to step down from that role in 2011 amid growing concern about his friendship with Epstein. Last year that friendship cost him his royal title and honors.",
      "publishedAt": "2026-02-19T12:22:05Z",
      "title": "Former Prince Andrew's path from helicopter pilot to royal pariah",
      "url": "https://apnews.com/article/andrew-mountbatten-windsor-profile-d64e61fd0214a68b9a05fc0da95d9486",
      "urlToImage": "https://dims.apnews.com/dims4/default/a630741/2147483647/strip/true/crop/3000x1999+0+347/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fbd%2Fbcc48ea4f7e32d9e0ef1090c3da5%2F6aff4629bd614734a04be2faf8da6a23"
    },
    {
      "author": "Susan Montoya Bryan",
      "description": "New Mexico’s attorney general has reopened an investigation into allegations of illegal activity at Jeffrey Epstein’s former Zorro Ranch. Attorney General Raúl Torrez’s office says the decision was made after reviewing information recently released by the U.S. Department of Justice. Although New Mexico’s initial case was closed in 2019 at the request of federal prosecutors in New York, state prosecutors say now that “revelations outlined in the previously sealed FBI files warrant further examination.” The New Mexico Department of Justice says special agents and prosecutors at the agency will be seeking immediate access to the complete, unredacted federal case file.",
      "publishedAt": "2026-02-19T21:15:51Z",
      "title": "New Mexico reopens investigation into alleged illegal activity at Epstein's former Zorro Ranch",
      "url": "https://apnews.com/article/new-mexico-epstein-investigation-reopen-12dffa70784c6f468627962da3cf51b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/41587fd/2147483647/strip/true/crop/1996x1330+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F4c%2F65638ba04e65843a74f37c3e4190%2F6adff0efb7614ae1aa886d30aceee8fe"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}