{
  "articles": [
    {
      "author": null,
      "description": "Savannah Guthrie has told the potential kidnappers of her mother Nancy Guthrie that the family is prepared to pay for her safe return. Savannah Guthrie appeared in a video on Instagram on Saturday while flanked by her two siblings. She said: “We received your message and we understand ... This is very valuable to us, and we will pay.” It was not immediately clear if Guthrie was referring to a new message from someone who might have kidnapped Nancy Guthrie. The frantic search for the 84-year-old Nancy Guthrie has entered a seventh day. Authorities have not identified any suspects or ruled anyone out.",
      "publishedAt": "2026-02-08T00:10:53Z",
      "title": "Savannah Guthrie pleads for safe return of mother, says 'We will pay'",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-92dff046a91f2c5c0093f17cd3b7ad42",
      "urlToImage": "https://dims.apnews.com/dims4/default/40c0dfa/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F6c%2F917e8a5800f78f9312746c49c3c1%2Ff5ba4eb95bfb4920836ba3f51f739f17"
    },
    {
      "author": "Samy Magdy, Melanie Lidman",
      "description": "The Rafah border crossing between Gaza and Egypt reopened Sunday, allowing limited Palestinian travel after a two-day closure, according to Egyptian state media. The crossing opened last week for the first time since 2024, a key part of a U.S.-backed ceasefire. Egyptian media reported Palestinians began crossing around noon. Israel hasn't confirmed this. Over the first four days, 36 Palestinians needing medical care and 62 companions were allowed to leave for Egypt, according to the United Nations. Nearly 20,000 people in Gaza seek to leave for medical care. The crossing's reopening is part of a fragile ceasefire deal between Israel and Hamas.",
      "publishedAt": "2026-02-08T09:38:10Z",
      "title": "Gaza's Rafah crossing reopens, allowing limited travel as Palestinians claim delays and mistreatment",
      "url": "https://apnews.com/article/mideast-gaza-egypt-rafah-crossing-medical-treatment-397a2323fb7ef85d274d682258b4a0eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae8de98/2147483647/strip/true/crop/7517x5009+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F82%2F398375c0d76cb9206adec54ab284%2Fe067912d78cb4cb989e61a32cea71b02"
    },
    {
      "author": "Rob Maaddi",
      "description": "It’s almost time to crown an NFL champion. After two weeks of hype and anticipation, the New England Patriots and Seattle Seahawks will face off in Super Bowl 60 at Levi’s Stadium. Will Drake Maye and the Patriots capture their seventh Lombardi Trophy? Or will Sam Darnold and the Seahawks earn their second? The matchup features two stingy defenses, two balanced offenses and two quarterbacks who’ve taken vastly different routes to get here. The Seahawks allowed the fewest points in the NFL and have standout players at every level. The Patriots got here because their defense has been dominant in the playoffs.",
      "publishedAt": "2026-02-08T11:00:06Z",
      "title": "Drake Maye and the Patriots take on Sam Darnold and the Seahawks in Super Bowl 60",
      "url": "https://apnews.com/article/super-bowl-seahawks-patriots-24ad67503a342a7e24348e66986250ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e33954/2147483647/strip/true/crop/5672x3779+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F47%2F213226251b0149fe9bc786f276e9%2Fc70381e993624e91a0b58262d665c3a6"
    },
    {
      "author": "Mari Yamaguchi, Foster Klug",
      "description": "Exit polls say that Japanese Prime Minister Sanae Takaichi’s governing party is almost certain to win a single-party majority in a key parliamentary election. NHK public television and other major networks cited exit polls. NHK says Takaichi’s governing coalition which is led by her Liberal Democratic Party could win more than two-thirds of the 465-seat lower house. The huge jump from the preelection share could allow Takaichi to make progress on a right-wing agenda that aims to boost Japan’s economy and military capabilities as tensions grow with China and she tries to nurture ties with Washington.",
      "publishedAt": "2026-02-07T22:07:08Z",
      "title": "Exit polls say Japan's prime minister on path to winning majority",
      "url": "https://apnews.com/article/japan-election-bbb322b4dc1dcad8f7373ba7aae4d535",
      "urlToImage": "https://dims.apnews.com/dims4/default/a542f02/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Ff0%2F1f30462a9a8341b74c78d542f6a3%2Fe86bb7e11d4b4b66a1aa105da74ad5f2"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Iran’s top diplomat strikes a hard line on US talks, saying Tehran’s power comes from saying ‘no’",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-protests-araghchi-389531836ccaa4c126b5ee06c1d5b1f8",
      "urlToImage": null
    },
    {
      "author": "Jake Offenhartz",
      "description": "Legal observers and officials say they have received a growing number of reports of federal agents impersonating construction workers, delivery drivers and in some cases anti-ICE activists in Minnesota. Not all of those incidents have been verified during the ongoing immigration crackdown. But they have heightened fears in a state already on edge. They add to legal groups’ concerns about the Trump administration’s dramatic reshaping of immigration enforcement tactics nationwide. Supporters of the immigration crackdown say the sprawling network of anti-ICE activists in Minneapolis has forced federal agents to adopt new methods of avoiding detection.",
      "publishedAt": "2026-02-08T05:08:11Z",
      "title": "Reports of immigration agents in disguise stoke fears in Minnesota",
      "url": "https://apnews.com/article/immigration-ice-agents-minneapolis-ruse-54ca86155182edceeda68e649b5518f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5655c56/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F5a%2F327a3037b9c1ba9c42484ea327af%2F19ce72e1d4ca49c28582368ffd04a8f4"
    },
    {
      "author": "Josh Boak",
      "description": "The White House is trying to show it's lowering the cost of living, but President Donald Trump has said he doesn't want to see the price of homes come down. He wants to keep values high. That's something in the interest of existing homeowners and they're a key part of his political base. And older voters tend to show up to vote more than do younger people, so Trump's position on housing could be a factor in the November elections. But Trump's aversion to policies that would expand housing supply and lower prices risks alienating younger voters and could hurt the chances for his Republican Party to expand its voting base.",
      "publishedAt": "2026-02-08T12:31:50Z",
      "title": "Why Trump doesn't want home prices to fall",
      "url": "https://apnews.com/article/trump-housing-mortgage-midterm-elections-prices-affordability-6bda9c1260550990bc819bcb6f1402cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/894976e/2147483647/strip/true/crop/4108x2737+382+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F95%2F57bdf0075349358c2fae028f2fc8%2F486a3ab441864c5688cf716b764fb967"
    },
    {
      "author": "Andrew Dampf, Pat Graham",
      "description": "Lindsey Vonn's pursuit of a second Olympic downhill gold medal is over. The 41-year-old American, skiing with a badly injured left knee, crashed early in Sunday's race in Italy. She was taken off the course by helicopter after receiving medical attention. Vonn lost control early in the race and was heard screaming as she was surrounded by medical personnel. The race was paused while she received treatment. Vonn returned to elite ski racing last season after a long break and was a gold-medal favorite. Her crash may end her storied career.",
      "publishedAt": "2026-02-08T09:28:03Z",
      "title": "Lindsey Vonn crashes early in Olympic downhill, taken off the mountain in a helicopter",
      "url": "https://apnews.com/article/lindsey-vonn-milan-cortina-olympics-90b10c0a145053f3bbfb573c4024653a",
      "urlToImage": "https://dims.apnews.com/dims4/default/67c3cae/2147483647/strip/true/crop/1545x1029+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F5c%2Fb43984a8d6b2c99a51c40fa4553e%2Fbddd6642081e4840a1ded9eab903772e"
    },
    {
      "author": null,
      "description": "France’s former Culture Minister Jack Lang has resigned as head of a Paris cultural center. His resignation follows alleged past financial links to convicted sex offender Jeffrey Epstein, prompting a tax investigation. Lang was summoned to appear at the French Foreign Ministry, which oversees the Arab World Institute, on Sunday, but he submitted his resignation. He has denied wrongdoing. The ministry confirmed his resignation on Saturday evening. The financial prosecutors' office has opened an investigation into Lang and his daughter over alleged “aggravated tax fraud laundering.” Lang's name appeared more than 600 times in the Epstein files. He headed the Arab World Institute since 2013.",
      "publishedAt": "2026-02-08T09:38:00Z",
      "title": "France's former Culture Minister Jack Lang resigns over Epstein-linked tax fraud probe",
      "url": "https://apnews.com/article/jeffrey-epstein-files-france-jack-lang-aab2edd95993de4816c48c4f6fc0c479",
      "urlToImage": "https://dims.apnews.com/dims4/default/beb787c/2147483647/strip/true/crop/7744x5160+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fc5%2Fd84c3bbcf0826b86e32f8d5c6547%2Fd856f91ed3d14e8885b91f1b1afa03dc"
    },
    {
      "author": "Jake Coyle",
      "description": "Paul Thomas Anderson won the top prize at the 78th Directors Guild Awards, putting the “One Battle After Another” filmmaker on course to potentially win his first Oscar. The DGA Awards, held Saturday night at the Beverly Hilton in Beverly Hills, California, is among the most reliable Academy Awards precursors. In the last 10 years, nine DGA winners have gone on to win best director at the Oscars. In the guild’s nearly eight-decade history, only eight times has the guild not predicted the Oscar winner. The award adds to a virtual awards-season sweep for “One Battle After Another,” the best-picture front-runner.",
      "publishedAt": "2026-02-08T13:46:51Z",
      "title": "Paul Thomas Anderson wins at Directors Guild Awards",
      "url": "https://apnews.com/article/dga-awards-paul-thomas-anderson-ryan-coogler-f7a872fa1d96d48ea753a0ab969dfd2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1b5e3d/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F9a%2F7e86cee50e49970e0c10495699ba%2F1abc57df21304990bc6e49703e2b7c3e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}